{
  "imdb_id": "tt0078841",
  "tmdb_id": "10322",
  "douban_id": "1293256",
  "title": "Being There (1979)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "130 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.0,
  "director": [
    {
      "id": "nm0000797",
      "name": "Hal Ashby"
    }
  ],
  "writer": [
    {
      "id": "nm0467085",
      "name": "Jerzy Kosinski",
      "description": "novel"
    },
    {
      "id": "nm0467085",
      "name": "Jerzy Kosinski",
      "description": "screenplay"
    },
    {
      "id": "nm0002717",
      "name": "Robert C. Jones",
      "description": "uncredited"
    }
  ],
  "cast": [
    {
      "id": "nm0000634",
      "name": "Peter Sellers",
      "character": "Chance"
    },
    {
      "id": "nm0000511",
      "name": "Shirley MacLaine",
      "character": "Eve Rand"
    },
    {
      "id": "nm0002048",
      "name": "Melvyn Douglas",
      "character": "Benjamin Rand"
    },
    {
      "id": "nm0912001",
      "name": "Jack Warden",
      "character": "President 'Bobby'"
    },
    {
      "id": "nm0246004",
      "name": "Richard Dysart",
      "character": "Dr. Robert Allenby"
    },
    {
      "id": "nm0000865",
      "name": "Richard Basehart",
      "character": "Vladimir Skrapinov"
    },
    {
      "id": "nm0040984",
      "name": "Ruth Attaway",
      "character": "Louise"
    },
    {
      "id": "nm0166359",
      "name": "David Clennon",
      "character": "Thomas Franklin"
    },
    {
      "id": "nm0109329",
      "name": "Fran Brill",
      "character": "Sally Hayes"
    },
    {
      "id": "nm0239180",
      "name": "Denise DuBarry",
      "character": "Johanna Franklin"
    },
    {
      "id": "nm0120770",
      "name": "Oteil Burbridge",
      "character": "Lolo"
    },
    {
      "id": "nm0445571",
      "name": "Ravenell Keller III",
      "character": "Abbaz"
    },
    {
      "id": "nm0180962",
      "name": "Brian Corrigan",
      "character": "Policeman by White House"
    },
    {
      "id": "nm0112982",
      "name": "Alfie Brown",
      "character": "Old Woman asked for lunch       (as Alfredine Brown)"
    },
    {
      "id": "nm0414193",
      "name": "Don Jacob",
      "character": "David       (as Donald Jacob)"
    },
    {
      "id": "nm0565987",
      "name": "Ernest McClure",
      "character": "Jeffrey       (as Ernest M. McClure)"
    },
    {
      "id": "nm0666292",
      "name": "Kenneth Patterson",
      "character": "Perkins"
    },
    {
      "id": "nm0893390",
      "name": "Richard Venture",
      "character": "Wilson"
    },
    {
      "id": "nm0344560",
      "name": "Arthur Grundy",
      "character": "Arthur"
    },
    {
      "id": "nm0123762",
      "name": "W.C. 'Mutt' Burton",
      "character": "Lewis"
    },
    {
      "id": "nm0205967",
      "name": "Henry B. Dawkins",
      "character": "Billings"
    },
    {
      "id": "nm0355607",
      "name": "Georgine Hall",
      "character": "Mrs. Aubrey"
    },
    {
      "id": "nm0495112",
      "name": "Nell P. Leaman",
      "character": "Constance"
    },
    {
      "id": "nm0055094",
      "name": "Villa Mae P. Barkley",
      "character": "Teresa"
    },
    {
      "id": "nm0386676",
      "name": "Alice Hirson",
      "character": "First Lady"
    },
    {
      "id": "nm0633595",
      "name": "James Noble",
      "character": "Kaufman"
    },
    {
      "id": "nm0788096",
      "name": "Timothy Shaner",
      "character": "Presidential Aide"
    },
    {
      "id": "nm0931938",
      "name": "William F. Williams",
      "character": "Presidential Aide"
    },
    {
      "id": "nm0199144",
      "name": "Bill Dance",
      "character": "Presidential Aide       (as William Dance)"
    },
    {
      "id": "nm0007419",
      "name": "Jim Aar",
      "character": "Presidential Aide"
    },
    {
      "id": "nm0523921",
      "name": "William Lubin",
      "character": "Presidential Aide"
    },
    {
      "id": "nm0573528",
      "name": "Gerald C. McNabb Jr.",
      "character": "Woltz"
    },
    {
      "id": "nm0364386",
      "name": "Hoyt Clark Harris Jr.",
      "character": "Riff"
    },
    {
      "id": "nm0933905",
      "name": "Ned Wilson",
      "character": "Honeycutt"
    },
    {
      "id": "nm0344043",
      "name": "Stanley Grover",
      "character": "Baldwin"
    },
    {
      "id": "nm0363157",
      "name": "John Harkins",
      "character": "Courtney"
    },
    {
      "id": "nm0208865",
      "name": "Katherine De Hetre",
      "character": "Kinney       (as Katherine DeHetre)"
    },
    {
      "id": "nm0488937",
      "name": "William Larsen",
      "character": "Lyman Stuart"
    },
    {
      "id": "nm0375477",
      "name": "Jerome Hellman",
      "character": "Gary Burns"
    },
    {
      "id": "nm0742172",
      "name": "Arthur Rosenberg",
      "character": "Morton Hull"
    },
    {
      "id": "nm0918873",
      "name": "Sam Weisman",
      "character": "Colson"
    },
    {
      "id": "nm0499791",
      "name": "Fredric Lehne",
      "character": "TV Page"
    },
    {
      "id": "nm0401706",
      "name": "Gwen Humble",
      "character": "TV Guest"
    },
    {
      "id": "nm0420204",
      "name": "Laurie Jefferson",
      "character": "TV Reporter"
    },
    {
      "id": "nm0930006",
      "name": "Allen Williams",
      "character": "Other Reporter"
    },
    {
      "id": "nm9354127",
      "name": "Janet Meshad",
      "character": "Other Reporter"
    },
    {
      "id": "nm0547490",
      "name": "Paul Marin",
      "character": "Other Reporter"
    },
    {
      "id": "nm0110068",
      "name": "Melendy Britt",
      "character": "Sophie"
    },
    {
      "id": "nm0381000",
      "name": "Hanna Hertelendy",
      "character": "Natasha Skrapinov"
    },
    {
      "id": "nm0059946",
      "name": "Elya Baskin",
      "character": "Karpatov"
    },
    {
      "id": "nm0943660",
      "name": "Than Wyenn",
      "character": "Ambassador Gaufridi       (as Thann Wyenn)"
    },
    {
      "id": "nm0571599",
      "name": "Richard McKenzie",
      "character": "Ron Stiegler"
    },
    {
      "id": "nm0911832",
      "name": "Sandy Ward",
      "character": "Senator Slipshod"
    },
    {
      "id": "nm0360744",
      "name": "Danna Hansen",
      "character": "Mrs. Slipshod"
    },
    {
      "id": "nm0470656",
      "name": "Mitch Kreindel",
      "character": "Dennis Watson"
    },
    {
      "id": "nm0781720",
      "name": "Richard Seff",
      "character": "Pallbearer"
    },
    {
      "id": "nm0193016",
      "name": "Terrence Currier",
      "character": "Pallbearer"
    },
    {
      "id": "nm0338549",
      "name": "Leon Greenberg",
      "character": "Pallbearer"
    },
    {
      "id": "nm0370469",
      "name": "Austin Hay",
      "character": "Pallbearer"
    },
    {
      "id": "nm0358481",
      "name": "Mark Hammer",
      "character": "Pallbearer"
    },
    {
      "id": "nm0178641",
      "name": "Maurice Copeland",
      "character": "Pallbearer"
    }
  ],
  "overview": "A simple-minded gardener named Chance has spent all his life in the Washington D.C. house of an old man. When the man dies, Chance is put out on the street with no knowledge of the world except what he has learned from television.",
  "storyline": "A simple-minded gardener named Chance has spent all his life in the Washington D.C. house of an old man. When the man dies, Chance is put out on the street with no knowledge of the world except what he has learned from television. After a run in with a limousine, he ends up a guest of a woman (Eve) and her husband Ben, an influential but sickly businessman. Now called Chauncey Gardner, Chance becomes friend and confidante to Ben, and an unlikely political insider.",
  "plot": "Cyrus, leader of the Gramercy Riffs, the most powerful gang in New York City, calls a midnight summit of all New York area gangs, requesting them to send nine unarmed delegates to Van Cortlandt Park. The Warriors, from Coney Island, attend the summit. Cyrus proposes to the assembled crowd a permanent citywide truce and alliance that would allow the gangs to control the city since they outnumber the police by five to one. Most of the gangs applaud his idea, but Luther, leader of the Rogues, shoots Cyrus dead. In the resulting chaos, Luther frames the Warriors' leader Cleon for the murder, and Cleon is beaten down and most likely killed by the Riffs. Meanwhile, the other Warriors have escaped, unaware that they've been implicated in Cyrus' murder. The Riffs put out a hit on the Warriors through a radio DJ. Swan, the Warriors' \"war chief\", takes charge of the group as they try to make it back home.\n\nAlmost immediately the Warriors are spotted by the Turnbull ACs who attempt to run them down with their bus, but the Warriors manage to escape and board the subway. On the ride to Coney Island, the train is stopped by a fire on the tracks, stranding the Warriors in Tremont, in the Bronx. Setting out on foot, they come across a group called the Orphans who were not invited to Cyrus' meeting and who are insecure and belligerent about their low status in the city gang hierarchy. Swan makes peace with the Orphans' leader, Sully, who agrees to let the Warriors pass through their territory unharmed. However, a young woman named Mercy mocks Sully as a \"chicken\" and instigates a confrontation. Mercy's goading convinces Sully to demand that the Warriors take off their colors and go as civilians before walking through their neighborhood. Swan and the Warriors flatly refuse Sully's demand, and the Orphans challenge them to a fight. Outnumbered and unarmed, Swan and the Warriors throw a Molotov cocktail at a car, blowing it up and using the opportunity to escape to the train station. Impressed, and desperate to escape her depressed neighborhood, Mercy follows the Warriors.\n\nWhen they arrive at the 96th Street and Broadway station in Manhattan, they are chased by police and separated. Three of them, Vermin, Cochise, and Rembrandt, make the train to Union Square, while Fox, struggling with a police officer, falls onto the tracks and is run over by a train as Mercy escapes. Swan and the remaining three Warriors, Ajax, Snow, and Cowboy, are chased by the Baseball Furies into Riverside Park, where a brawl ensues in which the Warriors easily defeat the Baseball Furies. After the fight, Ajax notices a lone woman in the park, becomes sexually aggressive and is arrested when the woman turns out to be an undercover police officer. Arriving at Union Square, Vermin, Cochise, and Rembrandt are seduced by an all-female gang called the Lizzies and invited into their hideout. The trio manages to escape the Lizzies' subsequent attack, learning in the process that everyone believes they murdered Cyrus.\n\nHaving scouted ahead on his own, Swan returns to the 96th Street station and finds Mercy there. More police show up and Swan and Mercy flee into the tunnel. They have an argument and Swan continues to Union Square where he reunites with the other Warriors. A fistfight ensues with the Punks in a public restroom which the Warriors win. Meanwhile, the Riffs are visited by a gang member who attended the earlier gathering and saw Luther shoot Cyrus.\n\nThe Warriors finally arrive at Coney Island at dawn, only to find the Rogues are waiting for them. During the confrontation, Swan says \"When we see the ocean, we figure we're home.\" When Swan asks why Luther shot Cyrus, Luther says it was for \"no reason\" and \"I like doing things like that.\" Swan then challenges Luther to a one-on-one fight, but the Rogue leader pulls his gun instead. Swan throws a knife into Luther's wrist, disarming him. The Riffs then arrive in force and apprehend the Rogues, but not before acknowledging the Warriors' courage and skill. As the Warriors leave, Luther screams in anguish as the entire Riffs gang descends upon the Rogues.\n\nThe radio DJ then announces that the big alert has been called off and salutes the Warriors with a song, \"In the City\". Swan, Mercy, and the rest of the gang walk down the beach, illuminated by the rising sun.",
  "synopsis": "Chance (Peter Sellers) is a middle-aged gardener who lives in the townhouse of a wealthy man in Washington D.C. Chance seems very simple-minded and has lived in the house his entire life, tending the garden, with virtually no contact with the outside world. His cultural and social education is derived entirely from what he watches on the television sets provided by the \"Old Man,\" who raised him. The only other person in his life is Louise, the maid who cooks his meals and looks upon him as nothing more than a child who has failed to grow up. When his benefactor dies, Chance is visited by attorneys handling the estate. Chance tells them that he has lived his whole life inside the house. He was apparently abandoned as a baby and left in a basket outside the front door where the \"Old Man\" lived, who took him in and raised him. The lawyers force him to leave the townhouse and he discovers the outside world for the first time.\tChance wanders aimlessly through a wintry and busy Washington dressed in conservative, old-fashioned business attire, a homburg hat, suitcase, umbrella and a television remote from his former home. Although finely-tailored many years ago, his clothes are of the style which has now come back into fashion, and so others presume he is an expensively well-dressed man of means.\tThat evening, as he wanders, Chance happens upon a TV store. He sees his own image in one of the TVs captured by a camera in the shop window. While watching himself he backs into the street and is struck by a car owned by Ben Rand (Melvyn Douglas), a wealthy businessman. Rand's wife Eve (Shirley MacLaine), who is inside the limo, invites Chance to their home to recover from his injured leg. After being offered alcohol for the first time in his life, Chance coughs after he is asked his name. He says, \"Chance the Gardener\", but due to his cough those listening interpret his name to be \"Chauncey Gardiner.\"\tDuring dinner at the Rands' home, Chance describes the attorneys coming to his former house and shutting it down where he lived his whole life after the death of \"the Old Man\". Judging by his appearance and overall demeanor, Ben Rand automatically assumes that Chauncey is an upper class, well-to-do, highly-educated business man. Although Chance is really describing being kicked out of the home where he tended to the garden after the death of his legal guardian, Ben Rand perceives it as attorneys shutting down Chance's business because of financial problems after the death of his long-term boss and mentor \"the Old Man\".\tBen even assumes it must have been caused by \"kid lawyers from the SEC,\" obviously attributing it to have occurred at a higher, more sophisticated level than a tax/IRS problem, as most persons would likely have assumed. Sympathizing with him, Ben Rand takes Chance under his wing. Chance's personal style and seemingly conservative and insightful ways embody many qualities that Ben admires. His simplistic, serious-sounding utterances, which mostly concern the garden, are interpreted by virtually everyone as allegorical statements of deep wisdom and knowledge regarding business matters and the current state of the economy in America.\tBen Rand is also the confidant and adviser of the U.S. President (Jack Warden), whom he introduces to \"Chauncey.\" Chance's remarks about how the garden changes with the seasons are interpreted by the President as economic and political advice, relating to his concerns about the mid-term unpopularity that many administrations face while in office. Chance, as Chauncey Gardiner, quickly rises to national public attention. He becomes a media celebrity and appears on a national television talk show. He rapidly joins the A-list of the most wanted in Washington society. Public opinion polls start to reflect just how much his \"simple brand of wisdom\" resonates with the jaded American public. At an upscale Washington cocktail lounge, two important, older, well-dressed men are discussing Chauncey; one says to the other, there is a rumor \"he holds degrees in medicine as well as law.\" Rand, dying of aplastic anemia, encourages his wife to become close to Chance, knowing Eve is a fragile woman.\tRand's doctor (Richard A. Dysart) makes a few inquiries of his own. Even after acquiring Chance's fingerprints and a photo of him, the physician can't find a record of him anywhere, including elementary, middle, or high schools, colleges, nor employment or a police record. Rand's doctor concludes that Chance is actually a simpleton gardener, totally oblivious and unaware to the ways of the world. But he sees that Chance has helped Rand to accept his final illness and pending death. The doctor is hesitant to say anything that will upset Rand. He also sees that Chance possesses no guile, no intent to deceive, or any interest which would adversely impact Ben or Eve, or have any adverse effect upon Eve, or the estate, following Ben's death.\tJust days before his death, Rand amends his will to include Chauncey. At his funeral, the President gives a long-winded speech full of bon mots and quotes by Rand. Rand's pallbearers, all influential citizens and members of the board of Rand's several companies, hold a whispered discussion over potential replacements for the President in the next term of office. As Rand's coffin is about to be interred in the family Masonic pyramid-like mausoleum, they unanimously agree on \"Chauncey Gardiner.\"\tChance, oblivious to all this, wanders away from the funeral and through Rand's wintry estate. Ever the gardener, he straightens out a pine sapling and then walks up to the edge of a pond and then onto its surface. He pauses, dips his umbrella deeply into the water next to him, and then continues to walk further out into the pond. Rand's quote \"Life is a state of mind\" is stated in voiceover ."
}