{
  "imdb_id": "tt0288477",
  "tmdb_id": "9645",
  "douban_id": "1296535",
  "title": "Ghost Ship (2002)",
  "genres": [
    "Horror"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "91 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.5,
  "director": [
    {
      "id": "nm0065284",
      "name": "Steve Beck"
    }
  ],
  "writer": [
    {
      "id": "nm0360144",
      "name": "Mark Hanlon",
      "description": "story"
    },
    {
      "id": "nm0360144",
      "name": "Mark Hanlon",
      "description": "screenplay and"
    },
    {
      "id": "nm0688282",
      "name": "John Pogue",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0000321",
      "name": "Gabriel Byrne",
      "character": "Murphy"
    },
    {
      "id": "nm0000523",
      "name": "Julianna Margulies",
      "character": "Epps"
    },
    {
      "id": "nm0253035",
      "name": "Ron Eldard",
      "character": "Dodge"
    },
    {
      "id": "nm0004993",
      "name": "Desmond Harrington",
      "character": "Ferriman"
    },
    {
      "id": "nm0913460",
      "name": "Isaiah Washington",
      "character": "Greer"
    },
    {
      "id": "nm0227317",
      "name": "Alex Dimitriades",
      "character": "Santos"
    },
    {
      "id": "nm0881631",
      "name": "Karl Urban",
      "character": "Munder"
    },
    {
      "id": "nm0115161",
      "name": "Emily Browning",
      "character": "Katie Harwood"
    },
    {
      "id": "nm0720575",
      "name": "Francesca Rettondini",
      "character": "Francesca"
    },
    {
      "id": "nm0110311",
      "name": "Boris Brkic",
      "character": "Chief Steward"
    },
    {
      "id": "nm0749459",
      "name": "Bob Ruggiero",
      "character": "Captain"
    },
    {
      "id": "nm0306759",
      "name": "Iain Gardiner",
      "character": "Purser"
    },
    {
      "id": "nm1260161",
      "name": "Adam Bieshaar",
      "character": "First Officer"
    },
    {
      "id": "nm0914956",
      "name": "Cameron Watt",
      "character": "Second Officer"
    },
    {
      "id": "nm1260627",
      "name": "Jamie Giddens",
      "character": "Friendly Officer"
    }
  ],
  "overview": "After discovering a passenger ship missing since 1962 floating adrift on the Bering Sea, salvagers claim the vessel as their own. Once they begin towing the ghost ship towards harbor, a series of bizarre occurrences happen and the group becomes trapped inside the ship, which they soon learn is inhabited by a demonic creature.",
  "storyline": "After discovering a passenger ship missing since 1962 floating adrift on the Bering Sea, salvagers claim the vessel as their own. Once they begin towing the ghost ship towards harbor, a series of bizarre ocurrences happen and the group becomes trapped inside the ship, which they soon learn is inhabited by a demonic creature.",
  "plot": "In May 1962, aboard the Italian ocean liner SS Antonia Graza, dozens of wealthy passengers dance to the song \"Senza Fine\" sung by Francesca, an Italian singer. A young girl, Katie Harwood, sits alone until the ship's captain offers to dance with her. Elsewhere, a hand presses a lever that unravels a thin wire cord from a spool. The spool snaps and the wire whips across the dance floor, bisecting the dancers.\n\nForty years later, at a bar, a boat salvage crew — Captain Sean Murphy, Maureen Epps, Greer, Dodge, Munder, and Santos — celebrate their recent success. Jack Ferriman, a Canadian weather service pilot, approaches them and says he spotted a vessel adrift in the Bering Sea. Because the ship is in international waters, it can be claimed by whoever brings it to port. The crew sets out on the Arctic Warrior, an ocean salvage tugboat. The ship is the Antonia Graza, which was believed to be lost at sea. As they prepare to tow it, they discover it contains a large quantity of gold. After a series of supernatural events, the group decides to abandon the salvage effort but take the gold, but an invisible force sabotages the Arctic Warrior. The tugboat explodes as its engine is restarted, killing Santos.\n\nLeft with no other option, the group begins repairing the Antonia Graza. Greer encounters Francesca, who seduces him into betraying the fiancée he has ashore, then leads him off a precipice to his death. Captain Murphy enters the captain's cabin and finds his ghost. The captain explains that they recovered the gold from a sinking cruise ship, the Lorelei, along with a sole survivor. Murphy is shown a picture of the survivor, whom he recognizes. He rushes to tell the others, but begins hallucinating and sees everyone as the ghost of the burned Santos, who provokes him into a murderous rage. The others think Murphy has gone mad and lock him in the drained fish tank, where he is later found drowned by Epps.\n\nEpps meets Katie's ghost, who reveals what happened on the Graza. The sole survivor of the Lorelei convinced the Graza's crew to murder the passengers for the gold. Once the passengers were killed, the crew turned on one another; soon, only a single officer was left, but he was later killed by Francesca. Another man, the mastermind behind the massacre, then killed Francesca by mystical means and branded her palm with a hook-shaped symbol using only his hands. The man is revealed as Jack Ferriman, who is actually a demonic spirit. Epps deduces that Ferriman lured the salvage team to the Graza to repair it, and decides to sink it to thwart his plan. Epps asks Dodge to keep Jack on the ship's bridge while she secretly sets explosives. When Ferriman realizes that Dodge is on to his secret, he walks towards Dodge while insulting him for not being man enough to act upon his feelings for Epps. Dodge threatens to shoot Ferriman, who simply smiles and says that murderers go to hell. Dodge shoots and Ferriman is seemingly killed.\n\nEpps is below decks setting explosives when she is confronted by Dodge. He tells her he has killed Ferriman and that they can salvage the gold to start a life together, but Epps is made suspicious by this unexpected romantic proposal and Dodge's apparent knowledge of the deaths of the rest of the crew despite not being told of them. Realizing that his ruse has failed, \"Dodge\" morphs into Jack Ferriman, who has killed the real Dodge. Ferriman describes himself as a salvager of souls, a job he earned by a lifetime of sin. He plans to use the Antonia Graza and the gold as a trap to continue collecting souls. Only the souls of sinners can be readily controlled, through the mark he brands them with, and as long as the Graza is kept afloat the soul of everyone who has died aboard the ship will be dragged down when Ferriman has filled his quota and returns to hell, something which will please the \"management\". He offers to spare Epps's life in exchange for her not interfering but she detonates the explosives. Ferriman is blown to pieces in the explosion and Katie helps Epps escape the sinking ship. Katie is left in the debris before the souls trapped on the ship ascend to heaven.\n\nDrifting on the open sea, Epps is found by a cruise ship and returned to land. As she is loaded into an ambulance, she sees the battered crates of gold being loaded onto the cruise ship by crewmen overseen by Ferriman, who glares at her and carries on; she screams as the ambulance doors close.",
  "synopsis": "The film opens aboard an Italian ocean liner, Antonia Graza, in May 1962. Dozens of wealthy passengers enjoy dancing in the ship's luxurious ballroom while a beautiful Italian woman sings \"Senza Fine.\" Away from the party in an outer room, a gloved hand pulls a switch that unravels a thin wire cord from a hidden spool.\tSuddenly, the spool snaps and the wire slices across the deck (dance floor) like a blade, bisecting the dancers. A number of them remain alive for several seconds before grasping that they have been cut in half. Only little Katie, dancing with a ship's officer (the Captain), is spared, thanks to her small stature and to the captain leaning down on her when he saw the wire snap. Seeing the fate of the other dancers, she looks up at the officer's face. He looks back at her sorrowfully, as his face splits open at mouth level and the top of his head falls off. Katie then screams, the view from the outside of the ship zooms down underwater, and the film cuts to the present day.\tA salvage crew has retrieved a sinking ship in the open ocean. They bring the ship into port and receive its salvage value from the authorities. While celebrating their success at a bar, Jack Ferriman, a Canadian Air Force pilot, approaches them and says he has spotted a mysterious vessel running adrift in the Bering Sea. Because the ship is in international waters, it can be claimed by whomever is able to bring it to a port. The crew soon set out on the Arctic Warrior, a small tugboat. While exploring the abandoned ship, they discover that it is the Antonia Graza, an Italian luxury liner that disappeared in May 1962 and was believed to be lost at sea. The ocean liner's disappearance was well known at the time.\tWhen they board the ship and prepare to tow it to shore, strange things begin to happen. Maureen Epps claims to have seen a little girl on the stairwell while trying to save a crewmate from falling through the floor. Greer claims to have heard the singing of an unseen songstress in various places on the ship. Epps and Ferriman discover the corpses of another team of salvagers in the ship's laundry room. The crew decide to leave the ship but take the large quantity of gold that they find on board. Their tugboat explodes from a tank of propane that mysteriously is opened as the engine is started, killing Santos, who was trying to fix the boat, and leaving them stranded on the ghost ship in the Bering Sea.\tAs they decide to attempt to fix the Antonia Graza and sail it back to land, more and more crew members are killed, as they discover more dark secrets about the ship, including bullet holes in the pool, and a skeleton hanging by a noose in a wardrobe. Maureen Epps meets a young girl named Katie who was seen at the beginning of the movie dancing with the Captain who reveals a dark secret: the crew turned on the passengers and each other in an attempt to get the gold that the ship carried. It is revealed that the skeleton hanging from the noose is Katie, who was on her way to New York to be with her parents.\tKatie takes Maureen momentarily back to the past, where Epps finally sees what had happened. While the numerous dancers were sliced by the wire, the chefs in the kitchen were murdered and the crew began pouring rodent poison into the evening's food. The food was served, and it is obvious that people begin to succumb to the poison as their mouths dripped with foam. The crew begins taking the lives of the rest of the passengers, including Katie, as it dawns that it was Katie's skeleton Epps found earlier. The murderous crew also line some passengers by the pool and shoot them (accounting for the shell casings and bullet holes). As the crew begins to take the gold, one crew member (an officer) walks out of the small compartment where the valuables are stored. He takes a look at Francesca, the ship's sultry ballroom singer, who is also standing there dressed in a shimmering red satin strapless ballgown, turns around, and viciously murders his fellow crewmates out of greed with a submachine gun. Francesca then shoots him in the head with a pistol. At last, a man walks up to Francesca and they embrace. As he walks away, the singer looks up and sees a large hook swing into her face, killing her. The man burns a mark into her hand, and it is revealed that he, the mastermind of the attack, was Jack Ferriman, an evil spirit.\tAfter this enlightenment, Epps decides to blow up the ship, but is confronted by Ferriman, who has killed the last remaining of Epps' crew. He states the obvious - by using the gold as bait, he has taken multitudes of souls to his masters; he has been doing this for a long time, and considers himself a \"salvager\" of souls. He guided the salvagers there merely to effect repairs. They fight for a short amount of time before Epps manages to blow up the ship, \"killing\" Ferriman. She is left in the debris as the souls trapped on the ship ascend to heaven; Katie stops to thank her.\tEpps is discovered by a large cruise ship and taken back to land. The last scene shows Epps in the back of an ambulance at the docks. She looks out the back of the vehicle from her stretcher and sees the battered crates of gold being loaded onto the cruise ship by the her former crewmen, followed moments later by Ferriman. He glares at her, and carries on, her screams cut short by the ambulance doors closing and the fade to the end credits."
}