{
  "imdb_id": "tt0780504",
  "tmdb_id": "64690",
  "douban_id": "2010972",
  "title": "Drive (2011)",
  "genres": [
    "Crime",
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "100 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.8,
  "director": [
    {
      "id": "nm0716347",
      "name": "Nicolas Winding Refn"
    }
  ],
  "writer": [
    {
      "id": "nm0024925",
      "name": "Hossein Amini",
      "description": "screenplay"
    },
    {
      "id": "nm2201245",
      "name": "James Sallis",
      "description": "book"
    }
  ],
  "cast": [
    {
      "id": "nm0331516",
      "name": "Ryan Gosling",
      "character": "Driver"
    },
    {
      "id": "nm1659547",
      "name": "Carey Mulligan",
      "character": "Irene"
    },
    {
      "id": "nm0186505",
      "name": "Bryan Cranston",
      "character": "Shannon"
    },
    {
      "id": "nm0000983",
      "name": "Albert Brooks",
      "character": "Bernie Rose"
    },
    {
      "id": "nm1209966",
      "name": "Oscar Isaac",
      "character": "Standard"
    },
    {
      "id": "nm0376716",
      "name": "Christina Hendricks",
      "character": "Blanche"
    },
    {
      "id": "nm0000579",
      "name": "Ron Perlman",
      "character": "Nino"
    },
    {
      "id": "nm4541945",
      "name": "Kaden Leos",
      "character": "Benicio"
    },
    {
      "id": "nm0004178",
      "name": "Jeff Wolfe",
      "character": "Tan Suit"
    },
    {
      "id": "nm0080866",
      "name": "James Biberi",
      "character": "Cook"
    },
    {
      "id": "nm0848560",
      "name": "Russ Tamblyn",
      "character": "Doc"
    },
    {
      "id": "nm0117851",
      "name": "Joe Bucaro III",
      "character": "Chauffeur       (as Joey Bucaro)"
    },
    {
      "id": "nm2047090",
      "name": "Tiara Parker",
      "character": "Young Woman"
    },
    {
      "id": "nm0871839",
      "name": "Tim Trella",
      "character": "Hitman #1"
    },
    {
      "id": "nm1097170",
      "name": "Jimmy Hart",
      "character": "Hitman #2"
    },
    {
      "id": "nm2641271",
      "name": "Tina Huang",
      "character": "Waitress"
    },
    {
      "id": "nm2872008",
      "name": "Andy San Dimas",
      "character": "Stripper"
    },
    {
      "id": "nm0701561",
      "name": "John Pyper-Ferguson",
      "character": "Bearded Redneck"
    },
    {
      "id": "nm0062639",
      "name": "Craig Baxley Jr.",
      "character": "Masked Man #1"
    },
    {
      "id": "nm1313479",
      "name": "Kenny Richards",
      "character": "Masked Man #2"
    },
    {
      "id": "nm0684187",
      "name": "Joe Pingue",
      "character": "Assistant Director #1"
    },
    {
      "id": "nm0123969",
      "name": "Dieter Busch",
      "character": "Assistant Director #2       (as Dieter H. Busch)"
    },
    {
      "id": "nm2502702",
      "name": "Chris Muto",
      "character": "Caterer"
    },
    {
      "id": "nm2306433",
      "name": "Rachel Dik",
      "character": "Newscaster"
    },
    {
      "id": "nm1075323",
      "name": "Cesar Garcia",
      "character": "Waiter"
    },
    {
      "id": "nm3280335",
      "name": "Steve Knoll",
      "character": "Movie Star"
    },
    {
      "id": "nm2684441",
      "name": "Mara LaFontaine",
      "character": "Movie Star Girlfriend"
    },
    {
      "id": "nm4592244",
      "name": "Teonee Thrash",
      "character": "Police Officer"
    },
    {
      "id": "nm1712521",
      "name": "Ralph Lawler",
      "character": "Basketball Announcer       (voice)"
    }
  ],
  "overview": "A mysterious Hollywood stuntman who moonlights as a getaway driver seems to be trying to escape his shady past – until he falls for his neighbor, whose husband is in prison and who's looking after her child alone.",
  "storyline": "A mysterious man who has multiple jobs as a garage mechanic, a Hollywood stuntman and a getaway driver seems to be trying to escape his shady past as he falls for his neighbor - whose husband is in prison and who's looking after her child alone. Meanwhile, his garage mechanic boss is trying to set up a race team using gangland money, which implicates our driver as he is to be used as the race team's main driver. Our hero gets more than he bargained for when he meets the man who is married to the woman he loves.",
  "plot": "The unnamed Driver works as a mechanic, a movie double, and a stunt driver, as well as a criminal-for-hire getaway driver. He is managed in all jobs by auto shop owner Shannon, who persuades Jewish mobsters Bernie Rose and Nino to purchase a car for the Driver to race. The Driver meets his new neighbor, Irene, and becomes close to her and her young son, Benicio. Irene's husband, Standard Gabriel, is in prison. After Standard is released, Irene still asks the Driver to visit them.\n\nStandard owes protection money from his time in prison and is beaten up by Albanian gangster Cook, who demands that Standard rob a pawnshop for $40,000 to pay off the debt. Cook gives Benicio a bullet as a symbol that he and his mother are in danger. The Driver, concerned for the safety of Irene and Benicio, offers to act as the getaway driver for the pawnshop robbery. While waiting for Standard and Cook's accomplice, Blanche, to complete the pawnshop robbery, the job goes awry when Standard is shot and killed by the pawnshop owner. The Driver and Blanche escape after an intense car chase with a mysterious adversary. The Driver hides with Blanche in a motel, where he learns that the bag contains a million dollars and that Blanche and Cook planned to re-steal the money with the car that chased them. Two of Cook's men ambush them in the motel room, killing Blanche before the Driver manages to kill them both.\n\nAt the auto shop, Shannon offers to hide the money, but the Driver refuses. He hunts down Cook in a strip club, smashes his fingers with a hammer, threatens to kill him, and force-feeds him the bullet that was given to Benicio. Cook reveals that Nino was behind the robbery. The Driver decides to return the money, but Nino dismisses the offer and instead sends a hitman to the Driver's apartment building. Entering the elevator with Irene, the Driver encounters the hitman and kisses Irene before brutally beating the hitman to death.\n\nAt his pizzeria, Nino reveals to Bernie that the money was stashed at the pawnshop by a low-level Philadelphia wise guy from the \"East Coast mob\" and, since anyone tied to the robbery could lead the East Coast Mafia to them, they need to kill everyone involved. Bernie warns Nino that nobody steals from the Italian Mob. Nino is angry because the Italian Mob has marginalized and insulted him due to his Jewish heritage. He convinces Bernie to follow his plan. Bernie then murders Cook, as he is the sole witness to their agreement. After Shannon refuses to divulge the whereabouts of the driver, Bernie kills him at the auto shop with a straight razor.\n\nThe Driver, disguising himself with a rubber mask from his stuntman job, follows Nino from the pizzeria to the Pacific Coast Highway and T-bones Nino's car onto a beach, then chases him from the wreck to the ocean and drowns him. He makes a phone call to Irene to tell her he is leaving and that meeting her and Benicio was the best thing that ever happened to him. The Driver goes to meet Bernie, who promises that Irene will be safe in exchange for the money. The Driver gives Bernie the money, but Bernie attempts to kill him, stabbing him in the stomach. The Driver survives and fatally stabs Bernie, then drives away, abandoning the money. Irene knocks at the Driver's apartment, but gets no response. The Driver drives away into the night.",
  "synopsis": "The Driver  who lives in an apartment in Echo Park, Los Angeles, has no name and no signs of any real personal life. He barely speaks and rarely shows any real emotions. The Driver works repairing cars and as a Hollywood stunt driver by day and a getaway driver for criminals by night. The cars the Driver uses are provided by his mentor and boss, Shannon  a crippled, washed-up body shop owner. On criminal missions all he does is drive. He doesn't plan any of the heist details and he doesn't carry a gun. He gives his clients a five minute window to pull off their jobs and get back in the car. If they do their jobs right and are out in five minutes, then the Driver guarantees a safe, successful getaway. The Driver lives in an inconspicuous apartment complex, in a sparsely decorated room, down the hall from an attractive young woman named Irene  and her six-year-old son, Benicio . One day the Driver helps out when Irene's car breaks down and she invites him back home. Over a glass of water, she explains that her husband, Standard  is in prison and she is raising her son alone.\tMeanwhile, Shannon wants to borrow $300,000 from Bernie Rose , a movie producer/loan shark/local gangster to invest in a racecar that he wants the Driver to race. After a trial at a local racetrack Rose is impressed with the Driver's skills and agrees to the idea. Less impressed is Nino , a hulking, ruthless thug and Bernie's partner in crime.\tThe Driver starts spending a lot of time with Irene and Benicio. He develops a genuine bond with Benicio and the chemistry and attraction between Irene and him develops into an unspoken romance. Unexpectedly, Irene receives a call from her husband's attorney that he is being released from prison in one week. Standard comes home and is shown to be a decent guy who regrets the actions that put him in jail. Irene and the Driver try to come to terms with the end to their short-lived relationship. Standard finds Irene talking to the Driver and senses something, but instead of feeling threatened, he welcomes the Driver.\tOne day the Driver finds Standard beaten badly in the building's parking lot. The attackers were from Standard's previous employer, Cook, who wants him to pull off a daylight pawn shop robbery as payback for protecting him in prison. The Driver offers to help when he hears that Irene and Benicio may be in danger if Standard does not cooperate. Cook tells them that the pawn shop is expected to have around $40,000 in cash. Standard has been told that he is a free man if the job goes off as expected.\tAccompanying the Driver and Standard is Cook's associate, Blanche . While the Driver waits in the parking lot, he sees another car sidle up in the parking lot a distance away. Soon Blanche returns with a heavy bag and the two wait for Standard to return. Suddenly, Standard runs out and is shot to death by the pawn shop owner. The Driver quickly drives out of the parking lot even as they are pursued and nearly killed by the car that was in the parking lot. The Driver executes some deft driving and manages to escape the pursuers.\tHiding out at a motel afterward, the Driver realizes that the stolen money is more like a million dollars. The Driver and Blanche watch a news report about the pawnshop robbery which mentions that the shopkeeper reported nothing as stolen. The Driver is suspicious and forces Blanche to reveal whether they were set up and by whom. She admits that she was in on it with Cook, whose real name is Chris. While Blanche is in the bathroom, her cell phone goes off. The Driver realizes that Blanche has revealed their location to Chris, who has sent hitmen to kill him. One of the hitmen kills Blanche, and the Driver manages to kill both hitmen and escape. The Driver goes to a local strip joint in search of Chris. Using a hammer to beat in his hand, the Driver forces Chris to confess that Nino set up the heist and he wanted both Standard and the Driver dead. The money belongs to the East Coast mob, and Nino knows that the mob will come after him if they found out who stole their money. So he tells Bernie Rose that Shannon, Irene, Benicio, and the Driver are the only links back to him and will have to die. Bernie agrees to this plan reluctantly, and in exchange, brutally kills Chris for messing up the original plan of killing the Driver.\tThe Driver offers Irene the money so she can get away from the city with her son, but she slaps him because his offer offends her. As they are talking, Nino's hitman arrives in the apartment elevator. They get into the elevator and the Driver realizes that the man is here to kill them. The Driver grabs Irene and gives her a passionate kiss before disarming the hitman and stomping his head in. Irene is terrified to see this side of the Driver. Meanwhile, Shannon had been warned by the Driver to get out of town, but before he can, Rose shows up at his garage and kills him. The Driver finds his friend's lifeless body sitting in a pool of his own blood. The Driver heads out after Nino and Rose to avenge his friend's death.\tWearing a rubber mask from one of the movies he had worked in, the Driver shows up at Nino's pizza place and waits until he gets into his car. He follows the car and rear ends it before slamming hard into the rear end. The limo is sent tumbling over a small cliff onto a deserted beach. Nino is still alive and crawls out of the car away from the Driver but the Driver catches him and drowns him in the sea. He then calls Rose to tell him that Nino is dead. Knowing the Driver cares only about is the safety of Irene and Benicio, Rose suggests a meeting at a restaurant where the Driver can handover the money in exchange for Irene and Benicio's guaranteed safety. Rose lets him know in no uncertain terms that the Driver will not live long. Even with his life in danger, the Driver agrees.\tThe Driver makes a final call to Irene to tell her how much he enjoyed spending time with her and Benicio and that they will never see him again. The Driver and Rose meet at a restaurant. They proceed to the parking lot where the Driver hands over the cash. As he hands it over, Rose pulls a knife and stabs the Driver in the abdomen, but the Driver pulls his own knife, just as quickly and stabs Rose in the neck. The Driver manages to get in his car and drive out of the parking lot, leaving Rose's dead body behind, next to the open bag of cash. There is a shot of Irene knocking hopefully at the Driver's apartment door but he is not there. The final shot is of the Driver bleeding badly, cruising through the city streets at night, listening to music."
}