{
  "imdb_id": "tt2014295",
  "tmdb_id": "259171",
  "douban_id": null,
  "title": "The Silent Mountain (2014)",
  "genres": [
    "Adventure",
    "Drama",
    "History",
    "Romance",
    "War"
  ],
  "country": "Austria",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.5,
  "director": [
    {
      "id": "nm0002478",
      "name": "Ernst Gossner"
    }
  ],
  "writer": [
    {
      "id": "nm1201863",
      "name": "Clemens Aufderklamm",
      "description": "writer"
    },
    {
      "id": "nm1201863",
      "name": "Clemens Aufderklamm",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0608440",
      "name": "William Moseley",
      "character": "Andreas Gruber"
    },
    {
      "id": "nm1361686",
      "name": "Eugenia Costantini",
      "character": "Francesca Calzolari"
    },
    {
      "id": "nm0001012",
      "name": "Claudia Cardinale",
      "character": "Nuria Calzolari"
    },
    {
      "id": "nm2686957",
      "name": "Emily Cox",
      "character": "Elisabeth Gruber"
    },
    {
      "id": "nm0246306",
      "name": "Werner Daehn",
      "character": "Sven Kornatz"
    },
    {
      "id": "nm0969364",
      "name": "Corrado Invernizzi",
      "character": "Nicola Quinziato"
    },
    {
      "id": "nm0128123",
      "name": "Michael Cadeddu",
      "character": "Bepi Moiola"
    },
    {
      "id": "nm0439435",
      "name": "Fritz Karl",
      "character": "Fritz Weinberger"
    },
    {
      "id": "nm0934731",
      "name": "Harald Windisch",
      "character": "Karl Gruber"
    },
    {
      "id": "nm0419409",
      "name": "Brigitte Jaufenthaler",
      "character": "Anna Gruber"
    },
    {
      "id": "nm4215700",
      "name": "Giulio Cristini",
      "character": "Angelo Calzolari"
    },
    {
      "id": "nm5099989",
      "name": "Felix Briegel",
      "character": "Georg Lechner"
    },
    {
      "id": "nm5099893",
      "name": "Josef Lanz",
      "character": "Clementi"
    },
    {
      "id": "nm4050719",
      "name": "Laura Bilgeri",
      "character": "Marie Lanz"
    },
    {
      "id": "nm1429724",
      "name": "Franz Weichenberger",
      "character": "Alfred Weber"
    },
    {
      "id": "nm5099996",
      "name": "Franz-Josef Gluderer",
      "character": "Markus Dallapozza"
    },
    {
      "id": "nm6168853",
      "name": "Florian Adamski",
      "character": "Josef Kofler"
    },
    {
      "id": "nm0285461",
      "name": "Reinhard Forcher",
      "character": "Major Keiserjäger"
    },
    {
      "id": "nm0345119",
      "name": "Julia Gschnitzer",
      "character": "Anastasia Innerkofler"
    },
    {
      "id": "nm3528107",
      "name": "Georg Kaser",
      "character": "Casperi"
    },
    {
      "id": "nm0594159",
      "name": "Peter Mitterrutzner",
      "character": ""
    },
    {
      "id": "nm6168854",
      "name": "Markus Plattner",
      "character": "The Finger-Eater"
    },
    {
      "id": "nm1167097",
      "name": "Andreas Pronegg",
      "character": "K&K Oberleutnant von Hohenegg"
    },
    {
      "id": "nm2999283",
      "name": "Lucas Zolgar",
      "character": "Mitterrutzner Peter"
    }
  ],
  "overview": "A young Austrian soldier in World War I fights his way through the Alps to rescue his Italian girlfriend and escape the impending explosion that will rock the mountain.",
  "storyline": "How war affects the people in the spectacular Dolomiti Mountains at the outbreak of WWI between Italy and Austria-Hungary in 1915.",
  "plot": "The story begins on May 1915 in South Tyrol where Anderl Gruber, a son of a rich hotel owner, is attending the wedding of his sister Elisabeth (Lisl) with Italian Angelo Calzolari. There, he meets Angelo's sister Francesca, with whom he falls in love. However, the same day Italy declares war on Austria-Hungary. The tensions present between Austrians and Italians immediately escalate into the conflict between them, and they both join their respective armies. With expulsion of Italians by the villagers Francesca is forced to hide her identity. However, Fritz Weinberger, a local teacher who returns from the front and who has particularly strong hatred towards Italians, exploits this and offers Francesca to protect her identity in exchange for sexual favors.\n\nAustrian platoon occupies the adjacent mountains and repulse initial assaults of Alpini who are trying to climb a mountain. Later they are reinforced by German Gebirgsjäger unit. Meanwhile, Anderl discovers Francesca's affair with Fritz and returns to the front in rage where he single-handedly repulses a massive attack of Italian infantry. As the following Italian offensives also fail, Nicola Quinziato, the commander of Italian garrison orders Angelo, an experienced civil engineer, to dig a tunnel below the Austrian positions. Initially it is planned to launch an offensive through the tunnels, but later Quinziato decides to set the explosives below the mountain to blow up the Austrian troops. Angelo is discharged immediately after that and sent to the regular infantry, thus exposing him to the dangers of the war.\n\nSome time later, Angelo is caught by the Austrians where he reveals the Italian plans to blow up the mountain. Anderl helps Angelo to return to their village, while the German and Austrian troops decide to hold the mountain despite the imminent danger. Unfortunately, Angelo's identity is quickly discovered and he is summarily executed by the Austrian troops, with Elisabeth watching.\n\nAnderl looks for Francesca, forgives her and leads her out of the village to the mountains. They arrive close to the Austrian positions in the moment of explosion which annihilates the Austrian stronghold. They then leave the valley and Anderl later often thinks about their mountain, a mountain without the soldiers.",
  "synopsis": null
}