{
  "imdb_id": "tt2027138",
  "tmdb_id": "120101",
  "douban_id": null,
  "title": "Kyaa Super Kool Hain Hum (2012)",
  "genres": [
    "Comedy"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "136 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.1,
  "director": [
    {
      "id": "nm1966139",
      "name": "Sachin Yardi"
    }
  ],
  "writer": [
    {
      "id": "nm4375423",
      "name": "Sukhmani Sadana",
      "description": "dialogue revisor"
    },
    {
      "id": "nm1966139",
      "name": "Sachin Yardi",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1299011",
      "name": "Riteish Deshmukh",
      "character": "Sid       (as Ritesh Deshmukh)"
    },
    {
      "id": "nm2777281",
      "name": "Neha Sharma",
      "character": "Simran"
    },
    {
      "id": "nm0969428",
      "name": "Tusshar Kapoor",
      "character": "Adi"
    },
    {
      "id": "nm3253318",
      "name": "Kavin Dave",
      "character": "Drippy Grewal"
    },
    {
      "id": "nm0451600",
      "name": "Anupam Kher",
      "character": "Francis Marlo"
    },
    {
      "id": "nm0659233",
      "name": "Chunky Pandey",
      "character": "Baba 3G"
    },
    {
      "id": "nm5477820",
      "name": "Hemant Arora",
      "character": "Alwin"
    },
    {
      "id": "nm5903113",
      "name": "Sonika Chopra",
      "character": "Dr. Gila Shukhani"
    },
    {
      "id": "nm3591549",
      "name": "Sarah-Jane Dias",
      "character": "Anu"
    },
    {
      "id": "nm1330618",
      "name": "Yusuf Hussain",
      "character": "Catholic Priest"
    },
    {
      "id": "nm1450924",
      "name": "Delnaaz Irani",
      "character": "(as Delnaaz Paul)"
    },
    {
      "id": "nm0451299",
      "name": "Razak Khan",
      "character": "Popat       (as Razzak Khan)"
    },
    {
      "id": "nm5898363",
      "name": "Laad Singh Maan",
      "character": "Truck driver"
    },
    {
      "id": "nm6071682",
      "name": "Nalneesh",
      "character": "Dog thief"
    },
    {
      "id": "nm9508122",
      "name": "Nalneesh Neel",
      "character": "Dog Thief"
    },
    {
      "id": "nm1210683",
      "name": "Howard Rosemeyer",
      "character": "Adam"
    },
    {
      "id": "nm4512989",
      "name": "Karan Sharma",
      "character": "News Reader"
    },
    {
      "id": "nm2933689",
      "name": "Shireesh Sharma",
      "character": "Father of the Lead"
    },
    {
      "id": "nm1460159",
      "name": "Rohit Shetty",
      "character": "Himself"
    },
    {
      "id": "nm10439276",
      "name": "Manish Uppal",
      "character": "Chintu"
    }
  ],
  "overview": "Kya Super Kool Hain Hum (English: How Super Cool Are We) is an upcoming Bollywood comedy film directed by Sachin Yardi, and produced by Ekta Kapoor and Shobha Kapoor. The film is a sequel to the 2005 surprise hit, Kyaa Kool Hai Hum. It stars Tusshar Kapoor and Ritesh Deshmukh from the original cast. The film is expected to release on 27th July 2012",
  "storyline": "Adi and Sid want to make big but always run out of luck and series of confusion start taking place when they reach Goa.",
  "plot": "The story follows Sid (Riteish Deshmukh) and Adi (Tusshar Kapoor), roommates and good friends. Adi is a struggling actor, whilst Sid is a struggling DJ who admires his own dog Sackru more than himself, Adi and Sid manage to meet ends by offering Sackru for mating in dog breeding centres where Sackru mates with female dogs of his breed on playing a specific music by Sid. Adi falls in love with Simran (Neha Sharma) who works at a call-center,Adi proposes Simran for marriage but she refuses and lies to him that she is lesbian and Sid falls for Anu (Sarah Jane Dias) whom he meets at a fashion show. Then Anu and Simran go to Goa to meet Anu's father, Marlo (Anupam Kher) who has gone mad ever since the death of his mother. In Goa, Baba 3G (Chunky Pandey), a conman posing as a priest tells Marlo that his dead mother has been reincarnated into a female dog Rosemary.When Adi and Sid take Sackru and follow the girls to Goa and Sid meets Marlo where Sackru copulates with the female dog Rosemary.\n\nMarlo then believes the dog is not his mother as she was so pure and didn't let her husband touch her. However, Baba 3G, not wanting to lose his business, tells Marlo that his father has been reincarnated as Sackru, and Sackru is then kidnapped by Marlo.Sid comes to rescue Sackru where Marlo offers Sid to host New Year Eve as DJ and takes Sackru.Adi mistakes Anu to be partner of Simran and tells Sid about it,both get broken and decide to leave Goa with Sackru.Marlo decides to get Rosemary and Sackru married. Adi receives a message from Simran for help. Adi and Sid reach the venue of marriage,where Simran confirms Adi that she is not lesbian and both reunite,Sid with intent to take Sackru back plays the music on which Sackru runs on a mating spree in the function.A police inspector at the venue recognises Baba 3G as a criminal and arrests him. The film ends with marriage of Adi,Sid and Sackru with Simran,Anu and Rosemary.",
  "synopsis": null
}