{
  "imdb_id": "tt2088913",
  "tmdb_id": "139301",
  "douban_id": null,
  "title": "Terrados (2011)",
  "genres": [
    "Drama"
  ],
  "country": "Spain",
  "version": [],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm2443021",
      "name": "Demian Sabini"
    }
  ],
  "writer": [
    {
      "id": "nm2443021",
      "name": "Demian Sabini",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2443021",
      "name": "Demian Sabini",
      "character": "Leo"
    },
    {
      "id": "nm2523877",
      "name": "Alain Hernández",
      "character": "Mario"
    },
    {
      "id": "nm1056555",
      "name": "Carla Pérez",
      "character": "Ana"
    },
    {
      "id": "nm4183989",
      "name": "Carolina Cabrerizo",
      "character": "Elsa"
    },
    {
      "id": "nm1944825",
      "name": "Pablo Molinero",
      "character": "Pablo"
    },
    {
      "id": "nm3343682",
      "name": "David Resplandí",
      "character": "Nachete"
    },
    {
      "id": "nm0087281",
      "name": "José María Blanco",
      "character": "Entrevistador"
    },
    {
      "id": "nm4595439",
      "name": "Álex Molero",
      "character": "Víctor       (as Alex Molero)"
    },
    {
      "id": "nm3838543",
      "name": "Jéssica Alonso",
      "character": "Silvia"
    },
    {
      "id": "nm4349495",
      "name": "Anna Bertran",
      "character": "Entrevistadora JRM"
    },
    {
      "id": "nm4730335",
      "name": "Carol Groot",
      "character": "Agente inmobiliara"
    },
    {
      "id": "nm3238586",
      "name": "Magda Puig",
      "character": "Chica fiesta"
    },
    {
      "id": "nm4730457",
      "name": "Jesús Rodríguez",
      "character": "Chico fiesta"
    },
    {
      "id": "nm4729577",
      "name": "Jesús Comaposada",
      "character": "Portero"
    },
    {
      "id": "nm4173815",
      "name": "Pablo Antonio Sola",
      "character": "Reparador aire acondicionado"
    },
    {
      "id": "nm3792106",
      "name": "Óscar Aragonés",
      "character": "Abogado JRM"
    }
  ],
  "overview": "During the economic crisis ravaging Spain during 2010, Leo and his friends enjoy a convenient charging situation unemployment insurance. In his thirty discouraged by the working environment, spend their days visiting different city rooftops randomly chosen to spend the hours doing nothing. Amid the current apathy and evasion, Leo discover that perhaps never before stopped to think about what he really want. The relationship with his girlfriend Ana and her best friend Mario mark the beat of its evolution to the point where he have to decide whether to continue the same old life, or change follow his instincts and take own initiative.",
  "storyline": "During the severe economic crisis plaguing Spain during 2010, Leo and his friends enjoy a conveniently secure situation living on unemployment subsidy. In their thirties and unmotivated by the working environment, they spend their days visiting different rooftops around the city chosen at random to spend hours doing nothing. In the midst of this stream of passivity and evasion, Leo discovers that perhaps he had never before stopped to think what he really wants. The relationships with his girlfriend Ana and best friend Mario mark the beat of Leo's evolution to a point where he will have to decide whether to continue his same old life, or conversely, follow his instincts and take his own initiative.",
  "plot": "See also: List of Terra Formars characters\nIn an attempt to colonize Mars, 21st century scientists are tasked with terraforming the planet. Their goal is to seed the planet with a modified algae to absorb sunlight and purify the atmosphere, and cockroaches, whose corpses spread the algae across the planet as they feed.\n\nFive hundred years later, the first manned ship to Mars lands and its six crew members are attacked by giant mutated humanoid cockroaches with incredible physical strength, later labeled \"Terraformars\"; the crew is wiped out after sending a warning back to Earth. Two years later, BUGS II, a multinational expedition of genetically modified humans, is sent to collect 10 samples of both sexes of roaches, and exterminate the mutated bugs to take control of the red planet. Only two survivors manage to return to Earth, one swearing to return and avenge their fallen companions. As a third expedition is assembled questions are raised about the true origin of the Terraformars and their connection with an unknown disease afflicting mankind, the Alien Engine Virus, or A.E. Virus. To fight the Terraformars' strength and agility, members of the second and third expedition undergo genetic modification to inherit the characteristics of other organisms, only possible after having a special organ implanted with a 36% chance of surviving the surgery itself.\n\nThe third expedition ends with most of its crew members killed as well, be it by fighting the Terraformars, or amongst themselves in the multi-sided conflict between the various factions aboard the ship, each with own opposing interests. Despite that, the few survivors manage to collect enough samples for the research on a cure to the A.E. Virus and return home. However, a new fight against the Terraformars begins when it is revealed that the creatures arrived on Earth long before, and after multiplying on an alarming rate and adapting themselves far better to their new environment than they did to their homeworld, they start their plan to take over the planet.",
  "synopsis": null
}