{
  "imdb_id": "tt2071445",
  "tmdb_id": "200044",
  "douban_id": null,
  "title": "Deranged (2012)",
  "genres": [
    "Horror"
  ],
  "country": "Spain",
  "version": [
    {
      "runtime": "78 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.1,
  "director": [
    {
      "id": "nm2040801",
      "name": "Neil Jones"
    }
  ],
  "writer": [
    {
      "id": "nm2774170",
      "name": "Óscar Carrión",
      "description": "screenplay"
    },
    {
      "id": "nm4228942",
      "name": "Marcia Do Vales",
      "description": "story"
    }
  ],
  "cast": [
    {
      "id": "nm4228942",
      "name": "Marcia Do Vales",
      "character": "Gabriella"
    },
    {
      "id": "nm0265492",
      "name": "Craig Fairbrass",
      "character": "Anthony"
    },
    {
      "id": "nm2518469",
      "name": "Victoria Broom",
      "character": "Silvia"
    },
    {
      "id": "nm3265106",
      "name": "Natalia Celino",
      "character": "Mary"
    },
    {
      "id": "nm4154592",
      "name": "Tabitha Quitman",
      "character": "Anna"
    },
    {
      "id": "nm1614655",
      "name": "Pablo Olewski",
      "character": "Stripper"
    },
    {
      "id": "nm2793867",
      "name": "Danko",
      "character": "'Max' the Dog"
    },
    {
      "id": "nm5682337",
      "name": "Timothy Bourne",
      "character": "Card Player"
    },
    {
      "id": "nm5682696",
      "name": "Cesar Arroyo Gomez-Gordo",
      "character": "Card Player"
    },
    {
      "id": "nm5682291",
      "name": "Maria Dolores Gomez-Gordo",
      "character": "Card Player"
    },
    {
      "id": "nm5682840",
      "name": "Francisco López Aparicio",
      "character": "Card Player"
    },
    {
      "id": "nm5682398",
      "name": "Marta Romero Molina",
      "character": "Restaurant Patron       (as Maria Romero Molina)"
    }
  ],
  "overview": "Deranged’ follows four girls who go on a bachelorette party weekend to a country house, in rural Spain. Little do they know what someone had planned for them. The real party begins when the host is mysteriously attacked and one by one, the guests find themselves in mortal danger. The race is on to uncover the killer’s identity and they must fight back or be brutally murdered.",
  "storyline": "Four girls travel to a party in an isolated house in Spain and one by one the guests are brutally murdered. The race is on to uncover the killer's identity and fight back or die.",
  "plot": "Jae-hyuk (Kim Myung-min) is a former professor with a doctorate in biochemistry who is currently working as a pharmaceutical sales representative after losing his life savings and his job due to a bad investment he made in the stock market from advice he received from his younger brother. When a series of dead bodies are found floating in the Han River, the public is shocked to discover that the deaths are related to a fatal outbreak of virus-infected mutant parasitic horsehair worms, called Yeongasi, that can control the human brain. Those infected show symptoms of increased hunger without appropriate weight gain and excessive thirst when the worms are mature and ready to reproduce. Hence, they jump into the river to allow the worms to come out of the body. While the authorities work to find a cure, Jae-hyuk and his brother Jae-pil (Kim Dong-wan), a detective agonized with guilt for squandering Jae-hyuk's money in the stock market, struggle to save Jae-hyuk's family when they also exhibit similar symptoms.",
  "synopsis": null
}