{
  "imdb_id": "tt2049448",
  "tmdb_id": "266235",
  "douban_id": null,
  "title": "Fray (2012)",
  "genres": [
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm3033138",
      "name": "Geoff Ryan"
    }
  ],
  "writer": [
    {
      "id": "nm3033138",
      "name": "Geoff Ryan",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm3286183",
      "name": "Bryan Kaplan",
      "character": "Justin"
    },
    {
      "id": "nm2631486",
      "name": "Marisa Costa",
      "character": "Cheri"
    },
    {
      "id": "nm2690935",
      "name": "Catherine Johnson",
      "character": "Vicky"
    },
    {
      "id": "nm3776273",
      "name": "Wes Harris",
      "character": "Paul"
    },
    {
      "id": "nm3511349",
      "name": "Drew Hicks",
      "character": "Matt"
    },
    {
      "id": "nm4020350",
      "name": "Evan Honer",
      "character": "Pete"
    },
    {
      "id": "nm1700833",
      "name": "Bob Olin",
      "character": "Apartment Manager"
    },
    {
      "id": "nm3941142",
      "name": "Edward Stiner",
      "character": "Homeless Veteran"
    }
  ],
  "overview": "A young Marine veteran is facing a new battle back home while struggling through a shattered economy and burdened by the physical and emotional scars of war.",
  "storyline": "Just back from combat, a young Marine veteran faces a new battle to find purpose in the mundane existence of civilian life while struggling through a shattered economy while burdened by the physical and emotional scars of war.",
  "plot": "John Ottway (Liam Neeson) works in Alaska, killing wolves that threaten an oil drilling team. On his last day on the job, he shoots one. That evening, Ottway writes a letter \"without purpose\" to his wife, Ana (Anne Openshaw), explaining his plans to commit suicide. He hears a distant wolf howl and doesn't follow through.\n\nThe next day, Ottway and other oil drillers board a plane. During the flight, Ottway dreams of sleeping with his wife in bed but is awakened by a loud bang. He buckles up in fear of a possible plane crash. Shortly afterwards, the back of the plane is torn off, luggage starts getting sucked out and the plane crashes. Eight people including Ottway survive the crash. However, Lewenden dies of his injuries. Taking charge, Ottway sets the survivors on the task of building a fire. While doing this, he discovers a corpse, and is attacked by the grey wolf feeding on it. After saving Ottway, the group surmises that they are in the wolves' territory. They decide to take turns keeping watch for the predators.\n\nLater, Hernandez (Ben Bray) is killed by two wolves. Ottway suggests they leave the crash site, but Diaz (Frank Grillo) questions his leadership. While searching for the wallets of their deceased colleagues, intending to return them to their families, Diaz finds an emergency wrist watch containing a radio beacon. The group then leaves the site.\n\nWhile walking, Flannery (Joe Anderson) falls behind, and is killed by wolves. One of them spots a pack of wolves approaching, and the survivors run for the trees, lighting a fire in an attempt to ward off their attackers. The group sets about producing makeshift weaponry. Diaz threatens Ottway with a knife, but is disarmed and ultimately begins regretting his actions. An omega wolf sent by the alpha wolf to test them attacks, but they kill and roast it for food. Diaz beheads the corpse and throws the head back at the pack, a move noted by the group as unwise, as they (erroneously) accept a statement that 'wolves are known to take revenge'.\n\nWhile sitting around the fire, Diaz tells the group of his atheism, and Talget (Dermot Mulroney) states he believes in God. Ottway states he is also an atheist, but wishes he could believe. Ottway then recites a simple poem written by his father. A blizzard approaches, and the survivors set to maintaining the fire.\n\nThe following morning, Burke (Nonso Anozie), who had been suffering from hypoxia, is found dead. The remaining survivors leave the camp, and travel to the edge of a steep canyon. Hendrick (Dallas Roberts) secures a line across, Diaz and Ottway traverse the canyon. Talget, however, is afraid of heights and his foot becomes caught on the rope, which breaks. He falls to the ground and is dragged away by wolves. While attempting to save Talget, Diaz falls from the tree and injures his knee.\n\nDiaz, Ottway, and Hendrick continue and arrive at a river. There, Diaz, humbled by his journey, explains that he's too tired and weak to continue on. They part company, and Ottway and Hendrick continue on together. Further along the river, Ottway and Hendrick are set upon by wolves. In an attempt to flee, Hendrick falls into the river and is trapped beneath the surface. Ottway attempts to save him but Hendrick drowns. Frustrated, Ottway looks up and appeals to God to help and show him something real but realises the futility of his plea.\n\nOttway, cold and wet, continues on alone. Exhausted, he stops walking and begins going through the collected wallets of the others. Ottway then realizes he has stumbled right into the wolves' den - and that the team had been steadily walking towards, not away from, the source of danger. Surrounded by the pack, he looks at his wife's photo in his wallet; it is then revealed that she was dying of a terminal illness. As the alpha wolf approaches him, Ottway arms himself with a knife and shards of glass from small liquor bottles taped to his hand. After reciting his father's poem once more, he lunges at the alpha wolf.\n\nIn a brief post-credits scene, the wolf is seen lying injured on the ground and breathing softly, with the back of Ottway's head visible resting on the wolf, while also breathing. It is not made clear whether he has been mortally wounded or if he will survive.",
  "synopsis": null
}