{
  "imdb_id": "tt2088865",
  "tmdb_id": "296095",
  "douban_id": null,
  "title": "Little White Lie (2014)",
  "genres": [
    "Documentary",
    "Biography",
    "Drama",
    "Family"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "65 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm2259264",
      "name": "Lacey Schwartz"
    },
    {
      "id": "nm1498362",
      "name": "James Adolphus"
    }
  ],
  "writer": [
    {
      "id": "nm2321233",
      "name": "Mehret Mandefro",
      "description": "co-writer"
    },
    {
      "id": "nm2259264",
      "name": "Lacey Schwartz",
      "description": "writer"
    }
  ],
  "cast": null,
  "overview": "Tells Lacey Schwartz's story of growing up in a typical upper-middle-class Jewish household in Woodstock, NY, with loving parents and a strong sense of her Jewish identity — despite the open questions from those around her about how a white girl could have such dark skin. She believes her family's explanation that her looks were inherited from her dark-skinned Sicilian grandfather. But when her parents abruptly split, her gut starts to tell her something different.  At age of 18, she finally confronts her mother and learns the truth: her biological father was not the man who raised her, but a black man named Rodney with whom her mother had had an affair.",
  "storyline": "Little White Lie tells Lacey Schwartz's story of growing up in a typical upper-middle-class Jewish household in Woodstock, NY, with loving parents and a strong sense of her Jewish identity - despite the questions from those around her about how a white girl could have such dark skin. She believes her family's explanation that her looks were inherited from her dark-skinned Sicilian grandfather. But when her parents abruptly split, her gut starts to tell her something different. At eighteen, she finally confronts her mother and learns the truth: her biological father was not the man who raised her, but a black man named Rodney with whom her mother had an affair. Afraid of losing her relationship with her parents, Lacey doesn't openly acknowledge her newly discovered black identity with her white family until her biological father dies shortly before Lacey's thirtieth birthday. Following the funeral, Lacey begins a quest to reconcile the hidden pieces of her life and heal her ...",
  "plot": null,
  "synopsis": null
}