{
  "imdb_id": "tt2078613",
  "tmdb_id": "136801",
  "douban_id": null,
  "title": "Back from Hell (2011)",
  "genres": [
    "Horror",
    "Thriller"
  ],
  "country": "Italy",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    }
  ],
  "imdb_rating": 2.9,
  "director": [
    {
      "id": "nm4712667",
      "name": "Leonardo Araneo"
    }
  ],
  "writer": [
    {
      "id": "nm4712667",
      "name": "Leonardo Araneo",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm6177804",
      "name": "Giovanni Araneo",
      "character": "Inmate"
    },
    {
      "id": "nm2400258",
      "name": "Aran Bert",
      "character": "Mark       (as Aran Bertetto)"
    },
    {
      "id": "nm0346730",
      "name": "Giovanni Guidelli",
      "character": "Father Elia"
    },
    {
      "id": "nm4712028",
      "name": "Jennifer Mischiati",
      "character": "Claudia"
    },
    {
      "id": "nm2865854",
      "name": "Manuela Parodi",
      "character": "Sarah"
    },
    {
      "id": "nm0702759",
      "name": "Marco Quaglia",
      "character": "Andrew"
    },
    {
      "id": "nm4125908",
      "name": "Marco Vannini Gandolfi",
      "character": "Alex"
    },
    {
      "id": "nm0955959",
      "name": "Roberto Zibetti",
      "character": "George"
    }
  ],
  "overview": "When six pals escape the chaos of the city for a brief getaway, the manor home they rent in the countryside may not be so idyllic after all… The party mood soon sours as strange phenomenon begins. The group initially attempts to rationalize the occurrences, but they soon escalate into horrifying paranormal events and, ultimately, the apparent possession of Giorgio.  Desperate, the terrorized group pleads with the local priest to exorcise the unholy force. But its demonic powers may be more than he can handle… and a bigger menace than any of them could have imagined.",
  "storyline": "Six ex-classmates decide to spend some holidays together. To enjoy a short rest period and some amusement, they rent a manor house in the countryside, upon where to forget the raving madness of the city life. After they get to know the priest living in the adjoining church, the group moves into the house. Very soon, the convivial mood progressively deteriorates, while in the house strange phenomena start to happen, apparently paranormal. The journey turns into a nightmare when Giorgio, one of the mates, starts to have aberrant behaviors, until he shows evident signs of what properly seems a diabolic possession. While Alessandro, his best friend, tries to find a scientific and rational explanation to the happenings, the other friends trust in Father Elia, the priest. He feels Giorgio is surely possessed by the devil, and tries to exorcise him. But in the end, all the people will figure out that what is happening goes over their ability to understand, and moreover, their possibility to ...",
  "plot": null,
  "synopsis": null
}