{
  "imdb_id": "tt2064968",
  "tmdb_id": "206821",
  "douban_id": null,
  "title": "The Longest Week (2014)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "86 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.4,
  "director": [
    {
      "id": "nm2871592",
      "name": "Peter Glanz"
    }
  ],
  "writer": [
    {
      "id": "nm2871592",
      "name": "Peter Glanz",
      "description": "screenplay"
    },
    {
      "id": "nm2871592",
      "name": "Peter Glanz",
      "description": "story"
    },
    {
      "id": "nm2900644",
      "name": "Juan Iglesias",
      "description": "story"
    }
  ],
  "cast": [
    {
      "id": "nm0000867",
      "name": "Jason Bateman",
      "character": "Conrad Valmont"
    },
    {
      "id": "nm0731634",
      "name": "Tony Roberts",
      "character": "Barry the Therapist"
    },
    {
      "id": "nm2777975",
      "name": "Laura Clery",
      "character": "Bunny"
    },
    {
      "id": "nm1156818",
      "name": "William Abadie",
      "character": "Concierge"
    },
    {
      "id": "nm6742109",
      "name": "Stephen Temperly",
      "character": "Jean-Louis Valmont"
    },
    {
      "id": "nm0624661",
      "name": "Alexandra Neil",
      "character": "Maribel Valmont"
    },
    {
      "id": "nm2089090",
      "name": "Seamus Davey-Fitzpatrick",
      "character": "Young Conrad       (as Seamus Fitzpatrick)"
    },
    {
      "id": "nm0697587",
      "name": "Barry Primus",
      "character": "Bernard the Chauffeur"
    },
    {
      "id": "nm1312575",
      "name": "Olivia Wilde",
      "character": "Beatrice Fairbanks"
    },
    {
      "id": "nm0001082",
      "name": "Billy Crudup",
      "character": "Dylan Tate"
    },
    {
      "id": "nm0058983",
      "name": "Jayce Bartok",
      "character": "Artist #1"
    },
    {
      "id": "nm1876851",
      "name": "Danny Deferrari",
      "character": "Artist #2"
    },
    {
      "id": "nm0861487",
      "name": "Auden Thornton",
      "character": "Woman at Gallery"
    },
    {
      "id": "nm0937059",
      "name": "Steve Witting",
      "character": "Museum Host"
    },
    {
      "id": "nm0611087",
      "name": "Maureen Mueller",
      "character": "Museum Socialite"
    },
    {
      "id": "nm4148495",
      "name": "Nicole Elizabeth Berger",
      "character": "Young Beatrice       (as Nicole Berger)"
    },
    {
      "id": "nm6753730",
      "name": "Ann W. Friedman",
      "character": "Beatrice's Mother       (as Ann Friedman)"
    },
    {
      "id": "nm0885227",
      "name": "Richaud Valls",
      "character": "Fashion Photographer"
    },
    {
      "id": "nm3887975",
      "name": "Irina Kisilyova",
      "character": "Psychic"
    },
    {
      "id": "nm3520615",
      "name": "Erin Darke",
      "character": "Bartender"
    },
    {
      "id": "nm2046214",
      "name": "Erika Spring Forster",
      "character": "Erika Spring       (as Erika Spring)"
    },
    {
      "id": "nm0325006",
      "name": "Jessie Gold",
      "character": "Jessie Gold"
    },
    {
      "id": "nm2351139",
      "name": "Jay Israelson",
      "character": "Jay Israelson"
    },
    {
      "id": "nm2809577",
      "name": "Jenny Slate",
      "character": "Jocelyn #1"
    },
    {
      "id": "nm0713191",
      "name": "Martin Rayner",
      "character": "Octave"
    },
    {
      "id": "nm0776424",
      "name": "Barbara Schulz",
      "character": "Marianne"
    },
    {
      "id": "nm0086432",
      "name": "Alexander Blaise",
      "character": "Maitre D'"
    },
    {
      "id": "nm1548302",
      "name": "Mario Brassard",
      "character": "Hemmings Waiter"
    },
    {
      "id": "nm2808348",
      "name": "Jane Anne Thomas",
      "character": "Jocelyn #2"
    },
    {
      "id": "nm6248259",
      "name": "Luke Cissell",
      "character": "Violinist #1"
    },
    {
      "id": "nm6742110",
      "name": "Janice Lamarre",
      "character": "Violinist #2"
    },
    {
      "id": "nm6742111",
      "name": "Paula Cho",
      "character": "Violist"
    },
    {
      "id": "nm6742112",
      "name": "Reenat Pinchas",
      "character": "Cellist"
    },
    {
      "id": "nm0480086",
      "name": "Anthony Laciura",
      "character": "Doorman"
    },
    {
      "id": "nm2384525",
      "name": "Peter Kilcommons",
      "character": "Doctor"
    },
    {
      "id": "nm1817474",
      "name": "Georgia Ximenes Lifsher",
      "character": "Nurse       (as Georgia X. Lifsher)"
    },
    {
      "id": "nm1473922",
      "name": "Liesl",
      "character": "Ivory House Girl #1"
    },
    {
      "id": "nm3046705",
      "name": "Lucy Walters",
      "character": "Ivory House Girl #2"
    },
    {
      "id": "nm0191314",
      "name": "Elliot Cuker",
      "character": "Car Mechanic"
    },
    {
      "id": "nm0134666",
      "name": "Geoffrey Cantor",
      "character": "Intellectual #1 Subway"
    },
    {
      "id": "nm3352214",
      "name": "Roya Shanks",
      "character": "Intellectual #2 Subway"
    },
    {
      "id": "nm4659397",
      "name": "Joel Brody",
      "character": "Homeless Man"
    },
    {
      "id": "nm1177936",
      "name": "Barbara Christie",
      "character": "Woman Patient"
    },
    {
      "id": "nm1935951",
      "name": "Uma Incrocci",
      "character": "Reporter #1"
    },
    {
      "id": "nm1291892",
      "name": "Eric Deskin",
      "character": "Reporter #2"
    },
    {
      "id": "nm0683978",
      "name": "Larry Pine",
      "character": "Narrator       (voice)"
    },
    {
      "id": "nm5213931",
      "name": "The Greyhound Mia",
      "character": "Napoleon the Dog       (as Mia)"
    }
  ],
  "overview": "As he eases into adulthood at the age of forty, Conrad Valmont, the over-educated, under-employed heir to the Valmont Hotel fortune, is cut off from his allowance following his parents abrupt divorce and tossed out into the unforgiving streets of the Upper West Side. Luckily, he is taken in by his old friend Dylan, and returns the favor by immediately falling for Dylan’s girlfriend Beatrice. As Conrad attempts to woo Beatrice while keeping both their relationship and his bank balance secret, Dylan tries to set him up with Jocelyn. Ever committed to the charade that he eventually finds difficult to maintain, Conrad quickly realizes his charm can only extend so far into debt. Now deep into an extensional reflection, will it take losing everything to make Conrad realize what he can truly become?",
  "storyline": "As he eases into adulthood at the age of forty, Conrad Valmont (Jason Bateman), the over-educated, under-employed heir to the Valmont Hotel fortune, is cut off from his allowance following his parents abrupt divorce and tossed out into the unforgiving streets of the Upper West Side. Luckily, he is taken in by his old friend Dylan (Billy Crudup), and returns the favor by immediately falling for Dylan's girlfriend Beatrice (Olivia Wilde). As Conrad attempts to woo Beatrice while keeping both their relationship and his bank balance secret, Dylan tries to set him up with Jocelyn (Jenny Slate). Ever committed to the charade that he eventually finds difficult to maintain, Conrad quickly realizes his charm can only extend so far into debt. Now deep into an extensional reflection, will it take losing everything to make Conrad realize what he can truly become?",
  "plot": null,
  "synopsis": "Conrad Valmont (Jason Bateman) is a New York City debutante that has coasted through the years off his family's wealth. As the narrator tells us, his parents left him in the care of their staff as a child while they took a trip around the world. Since then, he's always felt alone and has developed separation anxiety, casually cavorting about with any woman he wants. He frequently visits his therapist Barry (Tony Roberts), to whom Conrad tells that he has lately realized that the women he is sexually attracted to are people he doesn't care for, and the women he cares for are those he doesn't find sexually attractive, and those who happen to be both are usually with someone else. Over the years, he has also been trying to write his second album, constantly using the excuse that he is in the \"gathering stages.\"Conrad's parents cut him off from their money and he has no place to live. While taking the subway, he sees Beatrice Fairbanks (Olivia Wilde), a beautiful woman reading \"Sense and Sensibility\". The two merely look at each other, but without a word, Beatrice slips Conrad her phone number and gets off the train.Conrad stays with his best friend Dylan Tate (Billy Crudup). The two of them are mutually envious of the other's lifestyle. Together, they go to a party where Beatrice is in attendance. The narrator informs us that Beatrice has been playing classical music on the piano since she was a child, and she has made a career as a model. She is apparently already seeing Dylan, which makes her encounter with Conrad a little awkward. It's clear Beatrice likes Conrad more. Her friend Jocelyn (Jenny Slate) immediately assumes Conrad is nothing more than an affluent rich guy who drinks a lot and has few ambitions.Throughout the week, Conrad and Beatrice start going out behind Dylan's back, despite Dylan explicitly telling Conrad to NOT make a move on Beatrice. The two of them drink and enjoy each other's company, admiring all of each other's nuances. Dylan gets tickets to a show and asks Beatrice to invite someone for Conrad. She brings Jocelyn. Neither she nor Conrad enjoy the show, and afterwards, they all go to a bar. Jocelyn gets drunk and admits her hatred for rich types, and she ends up making out with Dylan. He ends up not sleeping with her.Conrad confesses to Dylan that he has been sleeping with Beatrice. Dylan angrily kicks him out, leaving Conrad to move in with Beatrice. Still, Conrad fears that Beatrice will leave him if she finds out he is broke.The couple go see a performance, when Conrad suddenly leaves Beatrice alone. He later finds her sitting in a cafe with Dylan, laughing with him. This later leads to an argument where Conrad admits he's broke. Beatrice tells him she was just trying to patch things up between Conrad and Dylan. She breaks up with Conrad. As he rides his motor scooter away, he is hit by a truck.After Conrad recovers, he tries to make amends with Dylan and Beatrice. Conrad goes on one last date with Beatrice, and after their last kiss, they realize it is over between them, and they never see each other again. Dylan, although a bit bitter with Conrad, has managed to forgive him. They go out for drinks and Dylan ropes in two women for them to hook up with, but Conrad is still not quite over Beatrice.Conrad's mother comes home and he finds comfort in her arms. After ages, Conrad finally finishes his book, which is inspired by his whole week with Beatrice. The book gets a lukewarm reception. Conrad has also set up a meeting between Dylan and Beatrice at the same show that they went to together. They get back together and later form a jazz duo that gets moderately successful. By now, at the age of 42, Conrad has finally decided to grow up."
}