{
  "imdb_id": "tt2089864",
  "tmdb_id": "204391",
  "douban_id": null,
  "title": "Zomvideo (2011)",
  "genres": [
    "Comedy",
    "Horror"
  ],
  "country": "Japan",
  "version": [],
  "imdb_rating": 5.0,
  "director": [
    {
      "id": "nm2384575",
      "name": "Kenji Murakami"
    }
  ],
  "writer": [
    {
      "id": "nm1782637",
      "name": "Katsuo Kawai",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm3261896",
      "name": "Akari",
      "character": ""
    },
    {
      "id": "nm4544516",
      "name": "Mai Hagiwara",
      "character": ""
    },
    {
      "id": "nm2208906",
      "name": "Tomu Miyazaki",
      "character": ""
    },
    {
      "id": "nm4731242",
      "name": "Yûji Morita",
      "character": ""
    },
    {
      "id": "nm1732553",
      "name": "Saki Nakajima",
      "character": "Kanabun"
    },
    {
      "id": "nm1967327",
      "name": "Kôichi Ohori",
      "character": ""
    },
    {
      "id": "nm4544399",
      "name": "Chisato Okai",
      "character": ""
    },
    {
      "id": "nm3288166",
      "name": "Mayu Sugano",
      "character": ""
    },
    {
      "id": "nm1965488",
      "name": "Jtarô Sugisaku",
      "character": "(as J-Tarô Sugisaku)"
    },
    {
      "id": "nm3139716",
      "name": "Airi Suzuki",
      "character": ""
    },
    {
      "id": "nm3129715",
      "name": "Miyuki Torii",
      "character": "Yasude"
    },
    {
      "id": "nm4544556",
      "name": "Maimi Yajima",
      "character": "Aiko"
    }
  ],
  "overview": "Aiko and Hashimoto discovere a VHS videotape called \"A Guide to Surviving Zombies From\". This is a video with a set of instructions that will help them cope with the invasion of the undead living in Japan.",
  "storyline": "Aiko along with his zombie nerd co-worker Hashimoto and Uncle must fight a group of zombies led by Yasude at their office.They have no Guns,no Chanisaws,no Baseball Bats just a mysterious VHS Tape.",
  "plot": "In the 1800s, an English couple and their infant son escape a shipwreck, ending up near uncharted rainforests off the coast of Africa. The couple craft themselves a treehouse from their ship's wreckage, but are subsequently killed by Sabor, a leopardess. Kala, a female western gorilla who recently lost her own child to Sabor, hears the cries of the orphaned infant and finds him in the ruined treehouse. Though she is attacked by Sabor, Kala and the baby manage to escape. Kala takes the baby back to the jungle to raise as her own, an action of which the leader and her mate, Kerchak, grudgingly disapproves. Kala raises the human child, naming him Tarzan.\n\nYears later, Tarzan begins to befriend other gorillas and animals, including a young female gorilla named Terk and the paranoid male elephant Tantor. Tarzan finds himself treated differently because of his different physique, so he makes great efforts to improve himself. As a young man, Tarzan manages to kill Sabor with a crude spear he made, gaining Kerchak's reluctant respect.\n\nThe gorilla troop's peaceful life is interrupted by the arrival of a team of human explorers from England, consisting of Professor Porter, his daughter Jane, and their hunter-guide Clayton. The explorers are looking to study gorillas. Jane accidentally becomes separated from the group and chased by a baboon troop, with Tarzan saving her. He recognizes that she is the same as he is: a human. Jane leads Tarzan back to their camp, where Porter and Clayton both take great interest in him; the former in terms of scientific progress while the latter hopes to have Tarzan lead him to the gorillas so that he can capture them and return with them to England. Despite Kerchak's warnings to be wary of the humans, Tarzan continues to return to the camp, where Porter, Clayton, and Jane teach him to speak English as well as what the human world is like. He and Jane begin to fall in love. However, the English explorers have a difficult time convincing Tarzan to lead them to the gorillas, due to Tarzan's fear of Kerchak.\n\nThe explorers ship soon returns to retrieve them. Jane asks Tarzan to return with them to England, but Tarzan in turn asks Jane to stay with him when Jane says it is unlikely they will ever return. Clayton convinces Tarzan that Jane will stay with him forever if he leads them to the gorillas. Tarzan agrees and leads the trio to the nesting grounds, while Terk and Tantor lure Kerchak away to avoid having him attack the humans. Porter and Jane are excited to mingle with the gorillas, but Kerchak returns and when he sees the humans, attacks them. Tarzan is forced to hold Kerchak at bay while the humans escape. Kerchak accuses Tarzan of betraying the troop. Kala takes Tarzan to the treehouse where she found him, shows him his true past, and says that she wants him to be happy whatever he decides. Tarzan puts on a suit that belonged to his father, signifying his decision to go to England.\n\nWhen Tarzan boards the ship with Jane and Porter the next day, they are ambushed by Clayton and his band of stowaway thugs. Clayton hopes to seize the gorillas now that he knows where the nesting grounds are, and locks Tarzan, Jane, and Porter away to prevent them from interfering. Tarzan manages to escape with the help of Terk and Tantor, and he returns to the gorillas' nesting grounds. Clayton fatally shoots Kerchak and then engages Tarzan in a fierce battle across the treetops. Despite Tarzan spares Clayton's life and destroys his gun, he tries to kill him by using his machete. Tarzan traps Clayton with vines, and the latter angrily attempting to cut his way free, even cutting the vine which he was holding onto; he is then killed by falling from the tree with a vine tangled around his neck, hanging him. Kerchak, with his dying breath, finally forgives Tarzan and names him new leader of the gorilla troop. The rest of the gorillas are freed after scaring away the rest of Clayton's men.\n\nThe next day, Porter and Jane prepare to leave on the ship while Tarzan stays behind with the gorilla troop. As the ship leaves shore, Porter encourages his daughter to stay with the man she loves, and Jane jumps overboard to return to shore; Porter shortly follows her. The Porters reunite with Tarzan and his family and embark on their new life together.",
  "synopsis": null
}