{
  "imdb_id": "tt2084934",
  "tmdb_id": "90231",
  "douban_id": null,
  "title": "Kill Zombie! (2012)",
  "genres": [
    "Comedy",
    "Horror"
  ],
  "country": "Netherlands",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.9,
  "director": [
    {
      "id": "nm2088171",
      "name": "Martijn Smits"
    },
    {
      "id": "nm1460692",
      "name": "Erwin van den Eshof"
    }
  ],
  "writer": [
    {
      "id": "nm1375739",
      "name": "Tijs van Marle",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm1871379",
      "name": "Yahya Gaier",
      "character": "Aziz"
    },
    {
      "id": "nm1280698",
      "name": "Mimoun Ouled Radi",
      "character": "Mo"
    },
    {
      "id": "nm2629899",
      "name": "Gigi Ravelli",
      "character": "Kim"
    },
    {
      "id": "nm3316142",
      "name": "Sergio Hasselbaink",
      "character": "Jeffrey"
    },
    {
      "id": "nm4797595",
      "name": "Uriah Arnhem",
      "character": "Nolan"
    },
    {
      "id": "nm4518274",
      "name": "Noel Deelen",
      "character": "Joris Snijder"
    },
    {
      "id": "nm3631792",
      "name": "Nadia Poeschmann",
      "character": "Tess       (as Nadia Palesa Poeschmann)"
    },
    {
      "id": "nm0098388",
      "name": "Carlo Boszhard",
      "character": "Jan de Hoop"
    },
    {
      "id": "nm6413144",
      "name": "Yesser Roshdy",
      "character": ""
    },
    {
      "id": "nm1280666",
      "name": "Iliass Ojja",
      "character": ""
    },
    {
      "id": "nm0222020",
      "name": "Frans van Deursen",
      "character": ""
    },
    {
      "id": "nm0095614",
      "name": "Kees Boot",
      "character": ""
    },
    {
      "id": "nm2821980",
      "name": "Wart Kamps",
      "character": ""
    },
    {
      "id": "nm2822668",
      "name": "Tim Kamps",
      "character": ""
    },
    {
      "id": "nm0676566",
      "name": "Loek Peters",
      "character": ""
    },
    {
      "id": "nm0739199",
      "name": "Michiel Romeyn",
      "character": ""
    },
    {
      "id": "nm0116373",
      "name": "Edo Brunner",
      "character": ""
    },
    {
      "id": "nm1969856",
      "name": "Remy Bonjasky",
      "character": ""
    },
    {
      "id": "nm3030944",
      "name": "Rik Sinkeldam",
      "character": "Steef"
    },
    {
      "id": "nm4103232",
      "name": "Ben Saunders",
      "character": ""
    },
    {
      "id": "nm1160136",
      "name": "Kenan Raven",
      "character": ""
    },
    {
      "id": "nm2919432",
      "name": "Patrick Neumann",
      "character": ""
    },
    {
      "id": "nm3654449",
      "name": "Theo Struijk",
      "character": ""
    },
    {
      "id": "nm6413145",
      "name": "Isabel Toren",
      "character": "Oma Zombie"
    },
    {
      "id": "nm2423913",
      "name": "Wouter Braaf",
      "character": "Militair"
    },
    {
      "id": "nm0973063",
      "name": "Jan Doense",
      "character": "Kantoor Zombie"
    },
    {
      "id": "nm3138866",
      "name": "Bernd Neunzling",
      "character": ""
    },
    {
      "id": "nm6413146",
      "name": "Zwart Licht",
      "character": ""
    },
    {
      "id": "nm3997882",
      "name": "Sonya Arab Ovisi",
      "character": "Zombie"
    }
  ],
  "overview": "The bizarre story takes place in Amsterdam-West, where a virus turns people into bloodthirsty zombies. Although much blood is flowing and many limbs chopped off, there is a lot to laugh at in this bizarre horror comedy.",
  "storyline": "The bizarre story takes place in Amsterdam-West, where a virus turns people into bloodthirsty zombies. Although much blood is flowing and many limbs chopped off, there is a lot to laugh at in this bizarre horror comedy.",
  "plot": "The film begins by showing the previous six months in flashbacks. In June 2011 a plague called the VM2 virus is first discovered in a French woman. Within the next 28 days, 83% of the population of Europe was infected. The virus becomes a global pandemic as it eventually reaches Japan, Philippines, and the United States. Six months later, the zombie plague has wiped out ninety percent of the population of the United States.\n\nIn the present, a trio of survivors comes down from a cabin to search a small town for food and news of survivors. Ramona (Taryn Manning), Billie (Eddie Steeples), and Kevin (Gerald Webb) are ransacking an auto repair garage when the noise attracts a horde of zombies who attack. Kevin is swarmed and bitten before another group of survivors consisting of Henry (Ving Rhames), Julian (Johnny Pacar), Cassie (Lesley-Ann Brandt), and Mack (Gary Weeks) intervene and stop the zombies. Kevin, bitten and turning into a zombie, is dispatched by Cassie. The group decides to head out together. As they are traveling, Mack reveals they are headed to the island of Catalina, supposedly a survivor camp.\n\nThe group stop at a strip mall and raid a surf shop for shoes and protective clothing. They are attacked by a \"runner\" zombie which attracts a group of slower ones. Cassie kills the runner and they escape out the rear of the store. That night, they take refuge in a diner and the group shares a dinner together. The next day the group heads to the \"Human Safe Zone\" at the high school. Inside they find corpses littered around and no people. In the gym they discover empty cots and realize the place was abandoned. As they are searching the gym it is suddenly flooded with zombies that pour in from several doors. During the melee Ramona is separated from the group and Billie is swarmed and bitten. The group finds Ramona in the showers and tell her about Billie.\n\nAfter leaving the school, the group takes a short cut through a small neighborhood and find a house that's on fire. As Mack is about to be overtaken by a zombie an arrow hits it and a man with a bow grabs Mack. The man takes Mack, Julian and Ramona with him. Henry and Cassie are separated and run off without the others. At a nearby safe house, the archers introduce themselves as Myrah, Brockton (Robert Blanche), and Sarah (Anya Monzikova). They all confer to decide on a route to get to the ferry to Catalina. Mack wants to go back for Henry and Cassie, Brockton tells them no. They decide to follow the original route they were going to take in the hopes that everyone will find each other. The next day the group sets out through the city. Julian stops to use a portable toilet and finds a zombie hiding inside. The group is swarmed and in the chaos Julian is bitten. They hide from the zombies in a van and Julian reveals his bite to Mack. He offers to sacrifice himself as a distraction but begins to turn before he can follow through. The entire group is forced to hold him down while Mack breaks his neck.\n\nMeanwhile, Henry and Cassie travel alone toward the ferry dock. They decide to stay on the original path because they know where the others are going. They encounter an abandoned army post and take some grenades. Cassie uses a grenade to kill a pack of zombies following them and the explosion is close enough to distract the zombies surrounding the others in the van. They take the opportunity to leave the van and head the opposite way. The explosion attracts hordes of zombies to Henry and Cassie, who end up trapped on the roof of a building. While on the roof they see Mack and the others on a nearby rooftop. Cassie and Henry escape the rooftop and rejoin Mack's group. The unified group is pursued through the streets toward the docks. At the docks they find a sign about the ferry, instructions for quarantine, and food and water. They also discover freshly killed bodies that have been dragged around. The group is then suddenly attacked by a pair of infected tigers. Brockton is killed and Henry is bitten. Henry begs Cassie to finish him and she does. As the movie closes, the survivors wait for the ferry and Mack is shown writing in Julian's diary. In the final scene, the ferry approaches and blows its horn.",
  "synopsis": null
}