{
  "imdb_id": "tt2088735",
  "tmdb_id": "157289",
  "douban_id": null,
  "title": "Curfew (2012)",
  "genres": [
    "Short",
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "19 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.9,
  "director": [
    {
      "id": "nm0159900",
      "name": "Shawn Christensen"
    }
  ],
  "writer": [
    {
      "id": "nm0159900",
      "name": "Shawn Christensen",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0159900",
      "name": "Shawn Christensen",
      "character": "Richie"
    },
    {
      "id": "nm3262742",
      "name": "Fatima Ptacek",
      "character": "Sophia"
    },
    {
      "id": "nm2172860",
      "name": "Kim Allen",
      "character": "Maggie"
    },
    {
      "id": "nm1914169",
      "name": "Dana Segal",
      "character": "Gabby"
    },
    {
      "id": "nm0391407",
      "name": "Kirsten Holly Smith",
      "character": "Cathy"
    },
    {
      "id": "nm5543765",
      "name": "Helga Athineos",
      "character": "Lady"
    },
    {
      "id": "nm6249509",
      "name": "Gino Patti",
      "character": "Bowler"
    }
  ],
  "overview": "At the lowest point of his life, Richie gets a call from his estranged sister, asking him to look after his nine-year old niece, Sophia, for a few hours.",
  "storyline": "Sadly, having reached the lowest point in his life and on the brink of demise, the self-destructive outcast, Richie, desperately wants out. However, as nothing is over yet, an unexpected call from his estranged sister, Maggie, offers a new lease of life, even though it is only a fleeting one. Strange as it may seem--as Richie is the last person she would ever call--a distraught Maggie needs Richie, of all the people, to look after her young daughter, Sophia, for the night. However, as the two alienated relatives timidly reconnect under New York's silvery night lights, much to their surprise, a subtle and delicate relationship will start to bloom. Could this be the beginning of a new reality?",
  "plot": "Richie is in the process of ending his life in a bathtub, when he gets a call from his estranged sister, Maggie, asking him to look after his niece, Sophia, for the night. Richie cancels his plans and sets out to babysit his niece.\n\nWhen he meets Sophia, she makes it clear that she has no interest in talking to him, nor does she seem to care much about him. Richie mentions that he drew flipbooks when he was younger, starring a protagonist named “Sophia”, and that he wonders if his sister got Sophia’s name from those flipbooks. He then takes Sophia to an old rundown building where he used to live, and finds the flipbooks he wants to show her, but Sophia gets scared and wants to go home.\n\nAfter Richie apologizes, they return to the bowling alley and Sophia starts asking all about his life. They start to become friends, and Richie admits that the reason he hasn’t been allowed to see her all these years, is because he once dropped Sophia on her head while taking care of her as a baby. Sophia finds this incident amusing, just as her favorite song comes on over the loudspeakers. Suddenly, everyone in the bowling alley seems to be dancing along with the song, except for Richie. Sophia begs him to dance with her, tugging at his arm until his wrist comes out of its sleeve, revealing his suicide attempt. Richie snaps back to reality.\n\nWhen Richie brings Sophia back home, he notices a restraining order sitting on the kitchen table, citing assault and harassment. His sister comes back looking bruised and she thanks Richie for his help, but she wants him to leave. She doesn’t want her daughter having any more “false idols”. Richie tells her how much he looked up to her when they were younger, and how much he still looks up to her now. He returns home to his bathtub, and attempts to continue what he started in the beginning but Maggie interrupts him with a phone call again, this time on nicer terms.",
  "synopsis": null
}