{
  "imdb_id": "tt2084989",
  "tmdb_id": "145197",
  "douban_id": null,
  "title": "Upstream Color (2013)",
  "genres": [
    "Drama",
    "Sci-Fi"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "96 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm1503403",
      "name": "Shane Carruth"
    }
  ],
  "writer": [
    {
      "id": "nm1503403",
      "name": "Shane Carruth",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm1541272",
      "name": "Amy Seimetz",
      "character": "Kris"
    },
    {
      "id": "nm1503403",
      "name": "Shane Carruth",
      "character": "Jeff"
    },
    {
      "id": "nm2426419",
      "name": "Andrew Sensenig",
      "character": "The Sampler"
    },
    {
      "id": "nm4264573",
      "name": "Thiago Martins",
      "character": "Thief"
    },
    {
      "id": "nm1970303",
      "name": "Kathy Carruth",
      "character": "Orchid Mother"
    },
    {
      "id": "nm3573550",
      "name": "Meredith Burke",
      "character": "Orchid Daughter"
    },
    {
      "id": "nm5378132",
      "name": "Andreon Watson",
      "character": "Peter"
    },
    {
      "id": "nm4988211",
      "name": "Ashton Miramontes",
      "character": "Lucas"
    },
    {
      "id": "nm5379821",
      "name": "Myles McGee",
      "character": "Monty"
    },
    {
      "id": "nm1797014",
      "name": "Frank Mosley",
      "character": "Husband"
    },
    {
      "id": "nm4374654",
      "name": "Carolyn King",
      "character": "Wife"
    },
    {
      "id": "nm3598194",
      "name": "Kerry McCormick",
      "character": "OBGYN"
    },
    {
      "id": "nm2649755",
      "name": "Marco Antonio Rodriguez",
      "character": "MRI Tech"
    },
    {
      "id": "nm1754270",
      "name": "Brina Palencia",
      "character": "Woman in Club"
    },
    {
      "id": "nm3220866",
      "name": "Lynn Blackburn",
      "character": "HR Manager"
    },
    {
      "id": "nm0909493",
      "name": "John Walpole",
      "character": "Bank Investigator       (as Trey Walpole)"
    },
    {
      "id": "nm1853335",
      "name": "Dave Little",
      "character": "Veterinarian #1"
    },
    {
      "id": "nm0562641",
      "name": "Julie Mayfield",
      "character": "Veterinarian #2"
    },
    {
      "id": "nm1444110",
      "name": "Ben LeClair",
      "character": "The Sampled"
    },
    {
      "id": "nm5378408",
      "name": "Gerald Dewey",
      "character": "The Sampled"
    },
    {
      "id": "nm0535714",
      "name": "Leticia Magaña",
      "character": "The Sampled"
    },
    {
      "id": "nm5296987",
      "name": "Rebecca Frances",
      "character": "The Sampled       (as Rebecca Waldon)"
    },
    {
      "id": "nm5183094",
      "name": "Lindsey Roberts",
      "character": "The Sampled"
    },
    {
      "id": "nm4808006",
      "name": "Cody Pottkotter",
      "character": "The Sampled"
    },
    {
      "id": "nm5378974",
      "name": "Julie Santosuosso",
      "character": "The Sampled"
    },
    {
      "id": "nm4746349",
      "name": "Steve Jimenez",
      "character": "The Sampled"
    },
    {
      "id": "nm0914320",
      "name": "Jack Watkins",
      "character": "The Sampled"
    },
    {
      "id": "nm2467078",
      "name": "Ted Ferguson",
      "character": "The Sampled"
    },
    {
      "id": "nm0259074",
      "name": "Juli Erickson",
      "character": "The Sampled"
    },
    {
      "id": "nm2295793",
      "name": "Karen Jagger",
      "character": "The Sampled"
    },
    {
      "id": "nm5378825",
      "name": "Jason Barnes",
      "character": "Roth"
    },
    {
      "id": "nm3299636",
      "name": "Wendy Welch",
      "character": "Neighbor"
    },
    {
      "id": "nm5393982",
      "name": "Keith Copeman",
      "character": "EMT #1"
    },
    {
      "id": "nm5394924",
      "name": "Nettie Yovanovitch",
      "character": "EMT #2"
    },
    {
      "id": "nm4614189",
      "name": "Driton Tomaj",
      "character": "Intern #1       (as Tony Tomaj)"
    },
    {
      "id": "nm4338303",
      "name": "Wheeler Williams",
      "character": "Intern #2"
    },
    {
      "id": "nm5393566",
      "name": "Tommy Watson",
      "character": "Security Guard"
    },
    {
      "id": "nm5605245",
      "name": "Joe Cutler",
      "character": "Grocery Store Clerk"
    }
  ],
  "overview": "A man and woman are drawn together, entangled in the lifecycle of an ageless organism. Identity becomes an illusion as they struggle to assemble the loose fragments of wrecked lives.",
  "storyline": "Kris is attacked one night, and hypnotized, using a grub with hypnotic properties, administered by a thief. She follows the thief's instructions to give him everything, even taking out loans. After the worms are extracted, she wakes up to find her life ruined. She's lost her job, her finances are destroyed. Years later, she meets Jeff whom she may have a lot in common with.",
  "plot": "The film starts with a man (mentioned in the credits as the \"Thief\") who appears to be harvesting a type of larva for the unusual effects it has on the human mind when ingested.\n\nAt a club, Kris (Amy Seimetz) is tasered and kidnapped by the Thief. He drugs her with a strange capsule, inducing a sort of hypnotic susceptibility, which causes an extremely suggestible mental state that the Thief then exploits. He uses an elaborate set of distractions, such as getting her to create a paper chain where each link features a transcription from the book Walden, in order to distract her while performing his mind control. He eventually manipulates her to liquidate her home equity and steals a valuable collection of rare coins. Through hypnotic suggestion, Kris is prevented from consuming solid foods. She is only allowed to drink small portions of water at regulated intervals, which she is compelled to perceive as extremely refreshing and delicious. The capsule administered to Kris contains a live larva found among the leaves of the Thief's special, blue-tinged orchid flowers—a larva that presumably is infected with a roundworm that subsequently infects Kris's system. She is released from her suspension of hunger by the Thief, presumably to trigger the onset of roundworm growth. Kris binges ravenously and falls asleep in soiled clothes. She awakes in her home to find one of several large roundworms visibly crawling under her skin. She unsuccessfully attempts to remove them by using a kitchen knife.\n\nLater, a pig farmer and avid field recorder—the \"Sampler\"—draws Kris to his farm using infrasonics, which attracts the worm. The Sampler silently sets up a transfusion through which he transfers the worm from Kris's body into that of a young pig. Kris then awakens in an abandoned SUV on the freeway with no memory of these recent traumatic events. Upon arriving at her disordered house, she quizzically notices blood on her sheets and floors and considers calling the police. She realizes she has no information to tell them and stops dialing. After cleaning up, she heads to work where she is promptly fired for her unexplained absence. A trip to the grocery store reveals to Kris that her personal funds are gone, evidently stolen by the Thief.\n\nA year later, Kris meets a man named Jeff (Shane Carruth) on a train and unknowingly connects with him, seemingly on a telepathic level. Kris and Jeff meet several times, before finally spending the night with each other, and afterward realize they both retain identical stitching scars from the aforementioned, forgotten, transfusions. The two of them soon realize that they both had similar experiences; Jeff lost his job as a broker due to shifting company funds around to cover for money stolen from him and attributes the incident to a psychotic break. At the same time, it is made clear to the audience that a parallel exists between the emotions Kris and Jeff have been feeling and two pigs, one of which is the host to Kris's parasite. As an example: Kris mistakenly believes herself to be pregnant at the same time her pig counterpart is actually pregnant. Upon consultation with a doctor, she is diagnosed with having had endometrial cancer that was successfully removed. The supposed cancer, she is told, is no longer a threat to her body, but it has rendered her infertile and she is unable to conceive.\n\nThe Sampler finds that the pig containing Kris's worm has now given birth to piglets. He throws the piglets into a burlap sack and tosses them into a river. This event coincides with Jeff and Kris feeling an extreme sense of loss and frustration, and both act as if something terrible is happening to them; Jeff spontaneously picks a fight with two of his co-workers while Kris frantically searches as if she'd lost something. The two, in their panicked state, reunite and travel to Kris's house, where they gather supplies, including a gun, and make camp in her bathroom's tub, expecting the worst. Meanwhile, the sack of piglets is seen rotting away and a blue substance bursts from the piglets' open wounds, filling the surrounding waters, from which orchids have emerged. The orchids eventually turn the same color blue and are collected by farmers, who sell the plants in the neighborhood where the Thief operates.\n\nThese events seem to mark a change in the state of things. Kris and Jeff begin to remember each other's personal histories as their own. Jeff discovers Kris mumbling the text of Walden while swimming. It is while performing this ritual that Kris comes to sense things that the Sampler has sensed, and it is this moment that the two start to piece together what happened to them both. In a dreamlike sequence, Kris, Jeff, and the Sampler all sit down at the same table in a bare, white room where Kris reveals to the Sampler that she is aware of him; the Sampler collapses from an apparent heart attack. The scene then cuts suddenly to a parallel shot back at the pig farm, where Kris shoots and kills the collapsed Sampler. Kris and Jeff collect a box of written records revealing others who were similarly drugged, and the two summon these other past victims to the farm by sending them copies of Walden. The farm is thereafter remodeled and the pigs are better cared for; as a result, no more pigs are drowned, the orchids in the river no longer turn blue, the Thief is deprived of the roundworms for his drug. The film ends with Kris cradling a baby pig, as if for the moment, at peace.",
  "synopsis": null
}