{
  "imdb_id": "tt2082155",
  "tmdb_id": "199415",
  "douban_id": null,
  "title": "Looking for Maria Sanchez (2013)",
  "genres": [
    "Comedy",
    "Romance"
  ],
  "country": "Puerto Rico",
  "version": [
    {
      "runtime": "98 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm2598734",
      "name": "Bruno Irizarry"
    }
  ],
  "writer": [
    {
      "id": "nm2598734",
      "name": "Bruno Irizarry",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0592135",
      "name": "Lin-Manuel Miranda",
      "character": "Raul"
    },
    {
      "id": "nm0131781",
      "name": "Jaime Camil",
      "character": "Juan"
    },
    {
      "id": "nm0868514",
      "name": "Dayanara Torres",
      "character": "Yolanda"
    },
    {
      "id": "nm0828127",
      "name": "Monica Steuer",
      "character": "Rebeca"
    },
    {
      "id": "nm3598985",
      "name": "Mayra Matos Pérez",
      "character": "Maria Sanchez"
    },
    {
      "id": "nm3475191",
      "name": "Victor Alicea",
      "character": "Husband"
    },
    {
      "id": "nm3270793",
      "name": "Neville Archambault",
      "character": "Scary Man"
    },
    {
      "id": "nm4726543",
      "name": "Davila Belkies",
      "character": "Lucia"
    },
    {
      "id": "nm9151449",
      "name": "Julitza Berberena",
      "character": "Mourner"
    },
    {
      "id": "nm5640346",
      "name": "Rose Breedlove",
      "character": "Secretary"
    },
    {
      "id": "nm3961134",
      "name": "Alexandria Carbone",
      "character": "Nancy       (as Alexandra Carbone)"
    },
    {
      "id": "nm0149415",
      "name": "Iris Chacón",
      "character": "Santera"
    },
    {
      "id": "nm8210663",
      "name": "Loren Colon",
      "character": "Cousin"
    },
    {
      "id": "nm4562163",
      "name": "Omar Cruz Soto",
      "character": "Turista"
    },
    {
      "id": "nm1755961",
      "name": "Alfredo De Quesada",
      "character": "Officer Ramírez"
    },
    {
      "id": "nm4940216",
      "name": "Catalina Del Puerto",
      "character": "Girl at the bar #1       (as Catalina Gomez)"
    },
    {
      "id": "nm1893975",
      "name": "Ernesto Franco",
      "character": "Felipe"
    },
    {
      "id": "nm5019414",
      "name": "Czarina Gomez",
      "character": "Student Protester"
    },
    {
      "id": "nm0380438",
      "name": "John Herrera",
      "character": "Don Santiago"
    },
    {
      "id": "nm2598734",
      "name": "Bruno Irizarry",
      "character": "Marcos"
    },
    {
      "id": "nm5040913",
      "name": "Joel Isaac",
      "character": "Young College Guy"
    },
    {
      "id": "nm0495971",
      "name": "Juan Manuel Lebrón",
      "character": "Don Armando"
    },
    {
      "id": "nm4105246",
      "name": "Sebastian Martinez",
      "character": "Nerdy Kid"
    },
    {
      "id": "nm4744662",
      "name": "Gretza M. Merced",
      "character": "Carmen"
    },
    {
      "id": "nm3015257",
      "name": "Pili Montilla",
      "character": "Daisy"
    },
    {
      "id": "nm3790648",
      "name": "Wilfred Omar Perez",
      "character": "Young College Guy"
    },
    {
      "id": "nm5640210",
      "name": "Milagros Piñero",
      "character": "Maria #1"
    },
    {
      "id": "nm2761137",
      "name": "Julio Ramos Velez",
      "character": "Ticket Dealer"
    },
    {
      "id": "nm7455946",
      "name": "Jonathan Louis Ramos",
      "character": "Tito"
    },
    {
      "id": "nm0712070",
      "name": "Luis Raul",
      "character": "Pedro"
    },
    {
      "id": "nm5628693",
      "name": "Wilfredo Rodriguez",
      "character": "Worker #1"
    },
    {
      "id": "nm5639754",
      "name": "Fernando Rojas",
      "character": "Raul Jr."
    },
    {
      "id": "nm5640356",
      "name": "Reema Sampat",
      "character": "Girl at the Bar #2"
    },
    {
      "id": "nm2397267",
      "name": "Isaac Santiago",
      "character": "Big Guy #2"
    },
    {
      "id": "nm5640360",
      "name": "Julio Sesarre",
      "character": "Worker #2"
    },
    {
      "id": "nm1111018",
      "name": "Roy Sánchez-Vahamondes",
      "character": "Raul Sr."
    },
    {
      "id": "nm3422841",
      "name": "Guillermo Valedon",
      "character": "Big Guy #1"
    },
    {
      "id": "nm3038059",
      "name": "Marisé Álvarez",
      "character": "Sara       (as Marisé Alvarez)"
    }
  ],
  "overview": "Raul, a Puerto Rican born in New York, meets Maria, a young Puerto Rican woman visiting NY, one night. Struck by love at first sight, he travels to Puerto Rico in search of this beautiful girl.",
  "storyline": "200 Cartas is a romantic comedy about the life of a Puerto Rican born in NY. One night, Raul meets Maria, a young Puerto Rican woman visiting New York. The night of their encounter, something dramatic happens and they are suddenly separated. Struck by love at first sight, he travels to Puerto Rico in search of this beautiful girl. This adventure will have him traveling around the island in search of his love.",
  "plot": "Henry Bennett (Ewan McGregor), his wife Maria (Naomi Watts), and their three sons Lucas (Tom Holland), Tomas (Samuel Joslin), and Simon (Oaklee Pendergast) go on a Christmas holiday in 2004 to Khao Lak, Thailand. Arriving on Christmas Eve, they settle in and begin to enjoy the brand new Orchid Beach Resort. Two days later on Boxing Day, the massive 2004 tsunami inundates the area.\n\nMaria and Lucas eventually emerge from the swirling water and find one another, with Maria having sustained serious injuries to her leg and chest. They help a young boy, Daniel, from the wreckage and are soon found by locals who transfer them to a local hospital in the city of Takua Pa. Daniel is separated from them during the journey. At the hospital, Maria encourages Lucas to help others find their family members while she goes into surgery for her chest injuries.\n\nMeanwhile, Henry, Thomas and Simon have also survived and are together. Henry leaves the two boys with another family who head to the mountains for safe shelter while he stays behind to search for Maria and Lucas. While out looking, injured and alone, he is picked up by a passer-by and driven to a nearby bus shelter to wait out with other survivors. Communication facilities are scarce but eventually a tourist named Karl (Sönke Möhring), who has also been separated from his family, lends Henry his cell phone to contact his relatives. Henry promises Maria's father he will look everywhere for his family and that he will find them. Karl tells the group his wife had left him a note confirming they were at the beach, their location when the wave hit. He volunteers to accompany Henry to look for Maria and Lucas and his own family, too.\n\nWhile Maria is in surgery, her medical chart is mixed-up with another patient who has died. Lucas returns to find his mother's bed empty and is then taken to a tent where children without families are kept safe. The mistake is discovered when Lucas cannot identify any of the dead woman's jewelry and he is subsequently reunited with his mother who has been moved to a private room in the ICU. In the hospital while he waits, Lucas finds Daniel who has been reunited with his father.\n\nHenry and Karl search for their families in various places before they arrive at the hospital where Henry is given five minutes to look. Karl gives him a piece of paper with his family members names on. The vehicle carrying Thomas and Simon also stops outside the hospital and the boys get off so Simon can urinate. From a distance, Lucas recognizes his father and while searching him out in the chaotic crowd outside, Lucas' siblings spot him and they reunite. Henry finds the three of them together. He learns that Maria is in the hospital ready to undergo more surgery for her leg, which she survives. Flashbacks reveal how she came to be badly injured and how she surfaced the water. While in surgery, Lucas tells his father he has something really important to tell Maria.\n\nThe following day, the family boards an ambulance airplane to Singapore so Maria may receive further medical treatment, arranged by their insurance company. On the plane, Lucas tells his mother he knows Daniel is safe. Maria looks out the window at the chaos left behind.",
  "synopsis": null
}