{
  "imdb_id": "tt2050633",
  "tmdb_id": "135368",
  "douban_id": null,
  "title": "The Barrens (2012)",
  "genres": [
    "Horror"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.6,
  "director": [
    {
      "id": "nm1135423",
      "name": "Darren Lynn Bousman"
    }
  ],
  "writer": [
    {
      "id": "nm1135423",
      "name": "Darren Lynn Bousman",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0610459",
      "name": "Stephen Moyer",
      "character": "Richard Vineyard"
    },
    {
      "id": "nm0000477",
      "name": "Mia Kirshner",
      "character": "Cynthia Vineyard"
    },
    {
      "id": "nm1239813",
      "name": "Allie MacDonald",
      "character": "Sadie Vineyard"
    },
    {
      "id": "nm3257504",
      "name": "Peter DaCunha",
      "character": "Danny Vineyard"
    },
    {
      "id": "nm0444534",
      "name": "David Keeley",
      "character": "Sheriff Winters       (as David W. Keeley)"
    },
    {
      "id": "nm0461712",
      "name": "Erik Knudsen",
      "character": "Ryan"
    },
    {
      "id": "nm3875456",
      "name": "Shamier Anderson",
      "character": "Dave"
    },
    {
      "id": "nm2963060",
      "name": "Max Topplin",
      "character": "Zach"
    },
    {
      "id": "nm0178680",
      "name": "Michael Copeman",
      "character": "Wyatt Burns"
    },
    {
      "id": "nm0039162",
      "name": "Shawn Ashmore",
      "character": "Dale"
    },
    {
      "id": "nm1920701",
      "name": "Athena Karkanis",
      "character": "Erica"
    },
    {
      "id": "nm0488493",
      "name": "J. LaRose",
      "character": "Ranger Bob"
    },
    {
      "id": "nm2524107",
      "name": "Chantelle Chung",
      "character": "Laura"
    },
    {
      "id": "nm1690652",
      "name": "Naomi Snieckus",
      "character": "Monica"
    },
    {
      "id": "nm0052925",
      "name": "Matt Baram",
      "character": "Kyle"
    },
    {
      "id": "nm1542156",
      "name": "Marty Adams",
      "character": "Peter Luther"
    },
    {
      "id": "nm0055567",
      "name": "Demore Barnes",
      "character": "Deputy Ranger"
    },
    {
      "id": "nm5353538",
      "name": "Francois Dagenais",
      "character": "Jersey Devil"
    },
    {
      "id": "nm1758846",
      "name": "Jason Detheridge",
      "character": "Jersey Devil"
    },
    {
      "id": "nm3719457",
      "name": "Dennis Long",
      "character": "Cop"
    },
    {
      "id": "nm3984104",
      "name": "Tatiana Ivanova",
      "character": "Mother Leeds"
    },
    {
      "id": "nm2999633",
      "name": "John Fleming",
      "character": "Young Richard"
    },
    {
      "id": "nm1219099",
      "name": "Kathy Maloney",
      "character": "Field Reporter"
    },
    {
      "id": "nm0271210",
      "name": "Lina Giornofelice",
      "character": "Police Psychologist"
    }
  ],
  "overview": "A man takes his family on a camping trip and becomes convinced they are being stalked by the legendary monster of the New Jersey Pine Barrens: the Jersey Devil.",
  "storyline": "This movie is about the Vineyard family and their trip to the New Jersey Pine Barrens. There is a legend that the Jersey Devil lives in these woods. It came about after a woman known as Mother Leeds had 13 children, but she offered up the 13th child to the Devil so she and her other children didn't have to leave their house as they were going to be forced out by the town folk because she was having too many kids in the area back in the 1700s. So it's now the present, and the Vineyard family are going to camp there so the father (Stephen Moyer) can release his father's ashes. But while there they hear that someone has gone missing, and Richard (Moyer) thinks it's the work of the Jersey Devil. So they move their camp site to get away from the rest of the campers only to find that they're in more trouble than they were before. But is the legend of the Jersey Devil real, or is it just another story?",
  "plot": "Two young campers walk together through the woods, commenting that there are no animals or birds around. They discover a pile of mutilated deer carcasses left on the trail. They are chased by a mutilated deer that drops dead in front of them. Something sounding like a large swarm of birds is heard approaching.\n\nRichard Vineyard, his wife Cynthia, his daughter Sadie, and his young son Danny leave their suburban home for a camping trip. They want to leave civilization behind and bond as a family in the Barrens, a forest in southern New Jersey. On the way to the campsite, they see a mutilated deer crossing the road. They stay in a crowded commercial campsite full of obnoxious campers who are not inclined to abandon civilization: cell phones and loud music abound. While setting up his tent, Richard has a flashback to a traumatic event from his childhood that occurred in the Barrens. Later that evening, when a fellow camper tells a story of the Jersey Devil, the campers pull a prank that scares the Vineyard family. Richard overreacts, much to the embarrassment of the rest of the family.\n\nThat night, Richard has a nightmare in which he is being chased through a field by something unseen. He is awakened by Cynthia in the middle of the forest, having actually run from their tent while asleep. He accuses his wife of infidelity; she doesn't understand his suspicion and tries to reassure him. Richard apologizes. Cynthia returns to the tent and Richard goes for a walk. He sees a deer carcass fall from a tree.\n\nSeveral facts are revealed in conversation the next day. Richard is taking pain medication for a wound received before they left home. Cynthia is stepmother to his children. One of the campers involved in the prank the previous night is missing. The hikers from the opening scene were found dead the previous week. Richard, who appears weakened by pain, leads his family deeper into the forest to a new camp site.\n\nWhile resting, Danny finds the disemboweled corpse of the missing camper but says nothing. Richard begins hallucinating and becomes irritable. They find a campsite containing a decomposed dog and furs hanging to dry, but no people. They decide to set up camp there. Richard disposes of the dog, and discovers that another camper, Ryan, has been following them and is communicating secretly with Sadie by cell phone. Richard returns to the campsite and tries to take Sadie's cell phone away. Cynthia announces that they are going home the next day. That night, Sadie searches for Ryan. She is frightened by something in the woods. It is revealed in conversation that Richard killed the family's rabid dog before they left home because it bit him. Richard’s mental state deteriorates.\n\nRichard sleepwalks again, awakening surrounded by mist. The Jersey Devil appears behind him. Richard gathers the family and they leave immediately, but Danny and Richard disappear. Cynthia calls the police, and she and Sadie discover Ryan's disemboweled corpse; Richard’s knife is next to the body. They find Danny face down in the river, but are able to resuscitate him. Richard returns but has a seizure. He attacks Cynthia and breaks her leg. Sadie knocks him unconscious and ties him up. Sadie and Danny leave to find help, leaving the injured Cynthia with her hysterical husband.\n\nRichard breaks free of his bonds. Cynthia passes out from the pain. Richard sees the Jersey Devil again. Sadie and Danny are found by a hunter who summons the police. The police find the bodies of the missing campers. Cynthia knocks out Richard with a rock. Cynthia is attacked by something unseen. The hunter, Sadie and Danny find Richard and Cynthia. The unseen entity attacks again and knocks out the hunter, but Cynthia and the children escape. As the police reach the campsite, Richard turns on his family with a loaded gun. He sees the Jersey Devil behind them. For the first time, the others see it as well. Richard attempts to shoot it, but he is shot by the sheriff. The Jersey Devil attacks and kills the sheriff and then turns on the Vineyards.\n\nAn epilogue following the closing credits reveals that Sadie and Danny survive in police custody. An officer questions Sadie about the events in the forest; no one believes her claim that the Jersey Devil is responsible. Sadie, who is not under arrest, joins a forest ranger and other hunters to avenge her parents' deaths and end the threat of the Jersey Devil.",
  "synopsis": null
}