{
  "imdb_id": "tt2016940",
  "tmdb_id": "76544",
  "douban_id": "6041199",
  "title": "Man of Tai Chi (2013)",
  "genres": [
    "Action",
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "105 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.1,
  "director": [
    {
      "id": "nm0000206",
      "name": "Keanu Reeves"
    }
  ],
  "writer": [
    {
      "id": "nm2686509",
      "name": "Michael G. Cooney",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0155392",
      "name": "Tiger Hu Chen",
      "character": "'Tiger' Chen Lin Hu"
    },
    {
      "id": "nm0000206",
      "name": "Keanu Reeves",
      "character": "Donaka Mark"
    },
    {
      "id": "nm0596297",
      "name": "Karen Mok",
      "character": "Inspector Suen Jing Si"
    },
    {
      "id": "nm0950494",
      "name": "Hai Yu",
      "character": "Master Yang"
    },
    {
      "id": "nm5328316",
      "name": "Qing Ye",
      "character": "Ching Sha"
    },
    {
      "id": "nm0945189",
      "name": "Simon Yam",
      "character": "Superintendent Wong"
    },
    {
      "id": "nm6049191",
      "name": "Yasuyuki Hirata",
      "character": "Thin Man"
    },
    {
      "id": "nm6049192",
      "name": "Brian Siswojo",
      "character": "Gong Au Young"
    },
    {
      "id": "nm0867248",
      "name": "Michael Tong",
      "character": "Shek Kuan"
    },
    {
      "id": "nm0498189",
      "name": "Sam Lee",
      "character": "De-Ming"
    },
    {
      "id": "nm5350911",
      "name": "Jiulong Guo",
      "character": "Old Commentator"
    },
    {
      "id": "nm6049194",
      "name": "Huang Jiang Xiang",
      "character": "Young Commentator"
    },
    {
      "id": "nm6049195",
      "name": "Zihan Xia",
      "character": "Li Hung"
    },
    {
      "id": "nm3398435",
      "name": "Sung-jun Yoo",
      "character": "Chi Tak"
    },
    {
      "id": "nm3299397",
      "name": "Iko Uwais",
      "character": "Gilang Sunjaya"
    },
    {
      "id": "nm6049196",
      "name": "Troy Sandford",
      "character": "Chi Tak Opponent"
    },
    {
      "id": "nm5077823",
      "name": "Kun Ju",
      "character": "Chou Ping (Southern Fist)"
    },
    {
      "id": "nm3425146",
      "name": "Jeremy Marinas",
      "character": "MMA"
    },
    {
      "id": "nm3100183",
      "name": "Brahim Chab",
      "character": "Taekwondo Fighter"
    },
    {
      "id": "nm5607377",
      "name": "Alain Ngalani",
      "character": "Boxer"
    },
    {
      "id": "nm6049197",
      "name": "'Zha Ka' Han Feixing",
      "character": "Mongolian"
    },
    {
      "id": "nm3641911",
      "name": "Ocean Hou",
      "character": "Hard Style"
    },
    {
      "id": "nm6049198",
      "name": "'Big Bear' Yin Chun Xiong",
      "character": "Zi-Long (San Shou)"
    },
    {
      "id": "nm6049199",
      "name": "Chen Chao",
      "character": "Zi-Hou"
    },
    {
      "id": "nm5077647",
      "name": "Li Xingping",
      "character": "Zi-An"
    },
    {
      "id": "nm1593238",
      "name": "Jun He",
      "character": "Liu Gi (Crane)"
    },
    {
      "id": "nm0799272",
      "name": "Silvio Simac",
      "character": "Uri Romanov"
    },
    {
      "id": "nm5077932",
      "name": "Haifeng Ni",
      "character": "Dragon Shape       (as Ni Haifeng)"
    },
    {
      "id": "nm6049201",
      "name": "Hao Yang",
      "character": "UPCS Director"
    },
    {
      "id": "nm6049202",
      "name": "Wen Huan Liu",
      "character": "Courier Co. Manager"
    },
    {
      "id": "nm6049203",
      "name": "Min Zhou",
      "character": "Landlady"
    },
    {
      "id": "nm6049204",
      "name": "Tan Wei Ya",
      "character": "Mr. Chen"
    },
    {
      "id": "nm6049205",
      "name": "Yu Na",
      "character": "Mrs. Chen"
    },
    {
      "id": "nm4012667",
      "name": "Xiao Wang",
      "character": "Lawyer"
    },
    {
      "id": "nm6049206",
      "name": "Wu Yong Tai",
      "character": "Shopkeeper"
    },
    {
      "id": "nm6049207",
      "name": "Chengqi Gong",
      "character": "Coach"
    },
    {
      "id": "nm6049208",
      "name": "Xiao Dong Zhao",
      "character": "New Delivery Guy"
    },
    {
      "id": "nm6049209",
      "name": "Wu Ming",
      "character": "Referee #1"
    },
    {
      "id": "nm6049210",
      "name": "Jiang Wei",
      "character": "Referee #2"
    },
    {
      "id": "nm3596195",
      "name": "Michael Chan",
      "character": "Police Officer #1       (voice)"
    },
    {
      "id": "nm5194279",
      "name": "Hélène Siwan Leclerc",
      "character": "Female Announcer"
    }
  ],
  "overview": "In Beijing, a young martial artist's skill places him in position to experience opportunities and sacrifices.",
  "storyline": "Tiger Chen is a Tai Chi student who is rather rebellious and uses Tai Chi to fight despite his master's concerns. When the temple where he studies get threatened from modern redevelopment, he fights in an underground fight club to get money the temple needs. However he soon realizes that his employer has other negative motives.",
  "plot": "Tiger Chen is the sole student of Ling Kong Tai Chi style under his elderly master Yang. While Tiger excels in the physical aspects of his training, he has yet to understand its philosophical aspects, which worries Master Yang. Determined to prove the effectiveness of the style, Tiger competes in the local Wulin (武林) Competition.\n\nHKPD officer Sun-Jing Shi leads an investigation into Security System Alliance (SSA), a private security firm owned by the mysterious Donaka Mark. Suspecting Donaka of hosting an illegal fighting operation, Sun-Jing turns one of Donaka's fighters into a mole, but Donaka discovers and personally kills him. Without any evidence, Superintendent Wong orders the case closed, but Sun-Jing secretly continues investigating.\n\nWhile searching for his next fighter, Donaka sees Tiger at the Wulin Competition. Intrigued by the relative obscurity of the style, as well as Tiger's immaturity, he sends Tiger a job offer at SSA. Tired of his menial courier job, Tiger flies to Hong Kong for the job interview. The \"interview\" turns out to be a test of Tiger's combat ability, which he passes. Donaka welcomes Tiger offers him great financial rewards for joining his underground fighting ring. Tiger refuses as fighting for money would compromise his honor, and leaves.\n\nSoon after, land inspectors arrive and declare the Tai Chi temple structurally unsafe. They announce the plan to evict its occupants, including Master Yang, and demolish the temple for real estate development. Tiger seeks help from Qing Sha, a paralegal friend. With her help, he finds a means to save the temple through historic preservation and government protection. However, because of the temple's deteriorated condition, it requires repairs within a month's time. Desperate for money, Tiger accepts Donaka's offer.\n\nAfter each fight, which is a form of modern gladiatorial combat enjoyed by rich individuals, Tiger wins larger sums of money. He quits his job, buys his parents presents, and begins having the temple repaired. However, the challenges became more difficult, with the stakes raised against him, forcing Tiger to develop a style that is more efficient but also more brutal. Noticing the change in him, Master Yang warns Tiger; however, intoxicated with the new life, Tiger ignores the warning.\n\nIn the Wulin Competition, Tiger viciously injures his opponent, and is disqualified. When Tiger comes back to train with his master, the usual respectful spar devolves into an intense fight. Master Yang is forced to use his internal chi energies to palm-strike Tiger, reminding him that he has not yet completely mastered Tai Chi. He advises Tiger to return to the path of peace, but Tiger rejects his teachings and leaves. Tiger finds out that the authority has rejected his petition to gain historical protection for the temple. A disappointed Qing-Sha tells Tiger that the decision is in part due to his actions at the Wulin Competition, which are in contrast to the claimed honor and nobility of his temple's philosophy.\n\nStill enraged, Tiger demands a fight and Donaka has him face a mercenary named Uri Romanov. Using his rage, he quickly defeats Uri and almost kills him, but relents at the end. Donaka finishes off Uri. Realizing how much he has changed, Tiger declares his intention to stop participating in underground fighting. Donaka scoffs at Tiger belief that he can just quit. Tiger decides to reach out to the police, and Sun-Jing contacts him. However, unbeknownst to Tiger, Donaka had put him under constant surveillance for a long time, and knows of his every action.\n\nDonaka sets up a private tournament for a death match, which Tiger is to participate. Sun-Jing trails Tiger's escort, but her car is run off the road. Surviving the crash, Sun-Jing calls for assistance and discovered Superintendent Wong has been working for Donaka and disrupting investigations against him.\n\nAt the tournament, Donaka shows a video to his audience. Composed of surveillance footage, the video reveals how Tiger Chen has been manipulated and \"corrupted\" by Donaka, and has transformed from an innocent martial arts practitioner to a ruthless fighter. In the death match, Tiger refuses to fight his assigned opponent, and challenges Donaka instead. The tournament is interrupted by the HKPD, who storm the compound and arrest participants and audience. Donaka escapes capture.\n\nDonaka waits for Tiger back at his temple, and the two begin fighting. Donaka taunts Tiger, and pushes him to reveal his \"true nature\". Being formidable fighter himself, Donaka has the upper hand, but Tiger re-embraces his Tai Chi training and holds his own. Donaka pulls out a knife and stabs Tiger. Despite the wound and pressure, Tiger achieved what his master has been trying to teach him, and uses his Chi to fatally strike Donaka. A dying Donaka smiles, pleased for having pushed Tiger to become a killer.\n\nSome time later, Tiger repairs his relationship with his master. Sun-Jing has been promoted to Superintendent. Tiger reaches out to both Qing Sha's law firm and the real estate developers and all three parties reach a compromise. The temple will be part of a historical cultural village. Not only will the government protect the village, but tourists can come and visit to learn more about the 600-year history of the Ling Kong Temple. Finally putting that chapter of his life behind him, Tiger tells Qing-Sha that he intends to return to the city and open his own Tai Chi school to continue the legacy of the Ling Kong Tai Chi.",
  "synopsis": "Tiger Chen (Tiger Chen Linhu) is the sole student of his elderly master's Ling Kong Tai Chi style. Whilst Tiger excels in the physical aspects of his training, Master Yang struggles to instill in Tiger the philosophical aspects, and fears for his character. Tiger harbors a determined ambition to prove the martial effectiveness of the style, as he competes in the local Wulin () contest. In between, HKPD officer Sun-Jing Shi (Karen Mok) has been leading an investigation into Security System Alliance (SSA), a private security firm owned by the mysterious Donaka Mark. Suspected of hosting an illegal fighting operation, Sun-Jing turned one of Donaka's fighters into a mole, but he was discovered and personally killed by Donaka. Despite the setbacks, Sun-Jing wants to continue investigating, but without any evidence, Superintendent Wong (Simon Yam) had the case closed. Believing the evidence will eventually come through, Sun-Jing secretly continued investigating Donaka and things would change with Tiger's involvement.Short of a fighter, Donaka searches for his next great fighter and took notice of Tiger during the Wulin Competition. Seeing Tai Chi as something different and noticed the innocence within Tiger's eyes; he sent an invitation to Tiger for a job opportunity at SSA. Tired of his menial courier job, he took a chance and was flown over to Hong Kong for the job interview. However, once he arrived at the interview room, he was attacked and he subdued his opponent; it was a test of his combat ability. Donaka welcomed him and offered him great financial rewards for joining his underground fighting ring; Tiger refused as it would compromise his honor by fighting for money. However, Donaka had other means of persuasion.The following day, investigators had arrived and had the temple declared structurally unsafe; Master Yang was to be evicted and the temple demolished for new real estate development. Unclear of the legal system, Tiger sought help from Qing Sha (Ye Qing), a paralegal friend and love interest to Tiger. With Qing-Sha's help, she found a means to save the temple: historic preservation and government protection. However, even if the law prevails on their side, the temple's dilapidated status required emergency repairs within a month's time and a lot of money; Tiger relented to Donaka's offer and fought to preserve the temple.Tiger excelled in his combat challenges. With every battle, he won large sums of money, but also evolved and enhanced his combat abilities with every match. His path allowed him to repair the Ling Kong Temple, quit his courier job, lavish his parents with presents, quickly rise in the Wulin Competition, and seem to have a budding romantic relationship with Qing Sha. However, with every battle, the challenges became more brutal and darkening Tiger. Master Yang wasn't a fool and noticed a change in his combat abilities and warned him the dangers of not changing his ways. Unfortunately, Tiger didn't see a problem with his situation and continued to enjoy life; little did he realized Donaka had corrupted him.In a recent two against one fight, Tiger won the battle, but developed a ruthless attitude and brought that mentality into the Wulin Competition. Breaking the rules of friendly and honorable competition, he viciously injured his opponent and resulted him disqualified from the competition. Master Yang witnessed what happened on TV and was shocked at Tiger's ruthlessness. When Tiger came to train with Master Yang, it was an aggressive fight than a respectful spar. Despite his advanced age, Master Yang held his own and was forced to use his internal chi energies to palm-strike Tiger, repelling him away. Still loving his student, he continues to tell Tiger to return to the path of peace, but Tiger rejected his master's good intentions and left him saddened. Things worsened when he found out his petition to gain historical protection for his temple was rejected. A disappointed Qing-Sha revealed Tiger's vicious actions from the Wulin Competition swayed her director's decision. Enraged, he demanded the director to explain herself and she reasoned that his actions don't reflect the claimed honor and nobility of his temple's philosophy; she's favoring new real estate development instead.Still raging from what happened, Tiger demanded a fight and Donaka had Tiger face the killer mercenary, Uri Romanov. Using his rage, he quickly defeated Uri and could've killed him, but he refused; Donaka appeared in a black mask to help finish off Uri. Tiger had had enough of underworld combat and wanted to leave, but Donaka laughed at Tiger, thinking he had a choice of leaving. Realizing he's trapped, Tiger decided to reach out to the police. However, unknown to Tiger, Donaka had every aspect of Tiger's life recorded and Gong (Donaka's camera man) reported on Tiger's plan to defect; Donaka had a contingency plan.Now \"secretly\" working with the police, Donaka set up a private tournament for a death match. Sun-Jing secretly trailed Tiger's escort to reach to the secret tournament, but her car was violently knocked over by a truck. Sun-Jing survived her attack and she then contacted her squad for assistance and discovered Superintendent Wong commanded communications to prevent anyone from investigating into particular frequencies that may lead to Donaka; Wong works for Donaka. Several hours before the tournament, a brief video revealed the private life of Tiger, shamefully revealing how exposed his life is and how Donaka manipulated him into underground combat and corrupted him as a person. Enraged, Tiger tried to attack Donaka, but was subdued by a taser. It was then Donaka revealed his vision for Tiger: exposing his life as he slowly corrupted and making Tiger a killer before a live audience.In the death match, Tiger was to face Gilang Sanjaya (Iko Uwais); now fully awakened to his reality, Tiger refused to fight, but challenged Donaka for a match instead. The match was over after HKPD stormed the compound and arrested everyone, including Wong; Donaka escaped capture. Back at home, Tiger was visiting the temple when he found Donaka. They had their own private death match as Donaka demanded Tiger owing him a life and telling Tiger to show him his true nature. Tiger was losing at first, but he re-embraced his Tai Chi training and gained the upper-hand. Donaka forced Tiger's hand as he pulled out a knife and stabbed Tiger in the stomach. It was then that Tiger used his internal powers to repel Donaka. Suffering from internal damage, Donaka was pleased to know Tiger had it in him to be a killer, but died shortly after.Some time later, Tiger repaired his relationship with his master and Sun-Jing has been promoted to Superintendent. Tiger reached out to both Qing Sha's law firm and the real estate developers and all three parties reached a compromised agreement: the temple will be part of a historical cultural village. Not only will the government will protect the village, but now tourists can come and visit, to learn more about the 600 year history of the Ling Kong Temple. Finally putting that chapter of his life away, Tiger tells Qing-Sha that he intends to return to the city and open his own Tai Chi school, to continue on the legacy of the Ling Kong Tai Chi."
}