{
  "imdb_id": "tt2010939",
  "tmdb_id": "180813",
  "douban_id": null,
  "title": "One Track Heart: The Story of Krishna Das (2012)",
  "genres": [
    "Documentary",
    "Biography",
    "Music"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "74 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.9,
  "director": [
    {
      "id": "nm1562901",
      "name": "Jeremy Frindel"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm3478528",
      "name": "Neem Karoli Baba",
      "character": "Himself       (archive footage)"
    },
    {
      "id": "nm4799126",
      "name": "Jason Becker",
      "character": "Himself"
    },
    {
      "id": "nm1135454",
      "name": "Larry Brilliant",
      "character": "Himself"
    },
    {
      "id": "nm1291815",
      "name": "Krishna Das",
      "character": "Himself"
    },
    {
      "id": "nm0022404",
      "name": "Ram Dass",
      "character": "Himself"
    },
    {
      "id": "nm5061993",
      "name": "Dan Goleman",
      "character": "Himself"
    },
    {
      "id": "nm0005391",
      "name": "Rick Rubin",
      "character": "Himself"
    },
    {
      "id": "nm1637088",
      "name": "Jai Uttal",
      "character": "Himself"
    }
  ],
  "overview": "Krishna Das is on a journey to India to discover legendary spiritual teacher Neem Karoli Baba, through drug addiction and depression, to his eventual emergence as a world-famous Kirtan singer.",
  "storyline": "In 1970, Jeffrey Kagel walked away from the American dream of rock 'n' roll stardom, turning down the chance to record as lead singer for the band soon-to-be the Blue Oyster Cult. Instead, he sold all his possessions and moved from the suburbs of Long Island to the foothills of the Himalayas in search of happiness and a little-known saint named Neem Karoli Baba. ONE TRACK HEART: THE STORY OF KRISHNA DAS follows his journey to India and back, witnessing his struggles with depression and drug abuse, to his eventual emergence as Krishna Das, world-renowned spiritual teacher and chant master. Featuring interviews with Ram Dass (LSD Icon Richard Alpert), Rick Rubin (Grammy Award winning Producer), Sharon Salzberg (NY Times bestselling author), Daniel Goleman (two-time Pulitzer Prize nominee), as well as a musical score by J Mascis (Dinosaur Jr) & Devadas, this is the inspiring story of how one man's heart-expanding journey continues to transform countless lives.",
  "plot": "Jeremy Frindel's 2012 film One Track Heart: The Story of Krishna Das documents the life and musical career of American kirtan singer Krishna Das. In 1970, while struggling with drug abuse and depression, Das left his native Long Island, New York for India, selling all his possessions and turning down the opportunity to record as lead vocalist with the band that would later become Blue Öyster Cult. While in India he formed a close relationship with the guru Neem Karoli Baba (Maharaj-ji), setting him on a new spiritual course and eventually leading to his emergence as Krishna Das – the world-renowned spiritual teacher, chant master, and Grammy-nominated musician. The film features interviews with Be Here Now author and spiritual guru Ram Das, Grammy-winning producer Rick Rubin (The Beastie Boys, Metallica, Jay-Z), New York Times bestselling author Sharon Salzberg, and two-time Pulitzer Prize nominee Daniel Goleman, as well as a score by Dinosaur Jr's J Mascis and Devadas.",
  "synopsis": null
}