{
  "imdb_id": "tt2032557",
  "tmdb_id": "121677",
  "douban_id": "6856067",
  "title": "The Reluctant Fundamentalist (2012)",
  "genres": [
    "Drama",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "130 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.9,
  "director": [
    {
      "id": "nm0619762",
      "name": "Mira Nair"
    }
  ],
  "writer": [
    {
      "id": "nm0015287",
      "name": "Javed Akhtar",
      "description": "eulogy in urdu"
    },
    {
      "id": "nm2039868",
      "name": "Ami Boghani",
      "description": "screen story"
    },
    {
      "id": "nm4577066",
      "name": "Mohsin Hamid",
      "description": "novel"
    },
    {
      "id": "nm4577066",
      "name": "Mohsin Hamid",
      "description": "screen story"
    },
    {
      "id": "nm0923980",
      "name": "William Wheeler",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm1981893",
      "name": "Riz Ahmed",
      "character": "Changez"
    },
    {
      "id": "nm0005028",
      "name": "Kate Hudson",
      "character": "Erica"
    },
    {
      "id": "nm0000630",
      "name": "Liev Schreiber",
      "character": "Bobby Lincoln"
    },
    {
      "id": "nm0000662",
      "name": "Kiefer Sutherland",
      "character": "Jim Cross"
    },
    {
      "id": "nm0700875",
      "name": "Om Puri",
      "character": "Abu"
    },
    {
      "id": "nm0000818",
      "name": "Shabana Azmi",
      "character": "Ammi"
    },
    {
      "id": "nm0233027",
      "name": "Martin Donovan",
      "character": "Ludlow Cooper"
    },
    {
      "id": "nm1734700",
      "name": "Nelsan Ellis",
      "character": "Wainwright"
    },
    {
      "id": "nm0082211",
      "name": "Haluk Bilginer",
      "character": "Nazmi Kemal"
    },
    {
      "id": "nm4723652",
      "name": "Meesha Shafi",
      "character": "Bina"
    },
    {
      "id": "nm1437485",
      "name": "Imaaduddin Shah",
      "character": "Sameer       (as Imaad Shah)"
    },
    {
      "id": "nm2166469",
      "name": "Christopher Nicholas Smith",
      "character": "Mike Rizzo       (as Chris Smith)"
    },
    {
      "id": "nm2586977",
      "name": "Ashwath Bhatt",
      "character": "Junaid"
    },
    {
      "id": "nm2744256",
      "name": "Sarah Quinn",
      "character": "Clea"
    },
    {
      "id": "nm0802103",
      "name": "Chandrachur Singh",
      "character": "Bandy Uncle"
    },
    {
      "id": "nm1300009",
      "name": "Adil Hussain",
      "character": "Mustafa Fazil"
    },
    {
      "id": "nm3488509",
      "name": "Ali Sethi",
      "character": "Ahmed"
    },
    {
      "id": "nm0202172",
      "name": "Deepti Datt",
      "character": "Amreh"
    },
    {
      "id": "nm3093959",
      "name": "Gary Richardson",
      "character": "Anse Rainier"
    },
    {
      "id": "nm1300111",
      "name": "Sonya Jehan",
      "character": "Nadia       (as Sonia Jehan)"
    },
    {
      "id": "nm3326915",
      "name": "Golam Sarwar Harun",
      "character": "Ranting South Asian Man"
    },
    {
      "id": "nm3260765",
      "name": "Rohan Gupta",
      "character": "Rahim"
    },
    {
      "id": "nm5177979",
      "name": "Claire Roberts Lamont",
      "character": "June Davis"
    },
    {
      "id": "nm0805789",
      "name": "Victor Slezak",
      "character": "Maxwell Underwood"
    },
    {
      "id": "nm0059779",
      "name": "Ismail Bashey",
      "character": "Pak-Punjab Deli Customer"
    },
    {
      "id": "nm0541052",
      "name": "Mahmood Mamdani",
      "character": "Pak-Punjab Deli Customer"
    },
    {
      "id": "nm1193262",
      "name": "Taylor St. Clair",
      "character": "Cable Company Manager"
    },
    {
      "id": "nm0567009",
      "name": "Roy McCrerey",
      "character": "Agent Ford"
    },
    {
      "id": "nm0484707",
      "name": "Clayton Landey",
      "character": "Agent Jackson"
    },
    {
      "id": "nm1792087",
      "name": "James Sutton",
      "character": "Airport Security"
    },
    {
      "id": "nm1308927",
      "name": "Jamie Moore",
      "character": "Cable Company Worker"
    },
    {
      "id": "nm0134016",
      "name": "Vince Canlas",
      "character": "Kenzaburo"
    },
    {
      "id": "nm4691528",
      "name": "Yinka Adeboyeku",
      "character": "NYPD Officer"
    },
    {
      "id": "nm4818391",
      "name": "Amuche Chukudebelu",
      "character": "Nigerian Merchant       (as Amuche)"
    },
    {
      "id": "nm3319472",
      "name": "Cody W. Parker",
      "character": "Herman       (as Cody Parker)"
    },
    {
      "id": "nm5177930",
      "name": "Kuldeep Lulla",
      "character": "Little Boy in Mercedes"
    },
    {
      "id": "nm5177967",
      "name": "Daksh Vashisht",
      "character": "Bobby's Shooter"
    },
    {
      "id": "nm2558745",
      "name": "Charu Shankar",
      "character": "Lovely Girl at Wedding"
    },
    {
      "id": "nm5178019",
      "name": "Javed Basu Kesselman",
      "character": "Pakistani Bond"
    },
    {
      "id": "nm4356874",
      "name": "Bradford Haynes",
      "character": "Jogger       (as Bradford Haynes)"
    },
    {
      "id": "nm6151809",
      "name": "Kartikeya",
      "character": "Student"
    },
    {
      "id": "nm9454217",
      "name": "Josiah Lyricq",
      "character": "Airport worker"
    },
    {
      "id": "nm9977730",
      "name": "Byron Carvil Cecil Napier",
      "character": "Extra Student"
    },
    {
      "id": "nm0646936",
      "name": "Mark Oliver",
      "character": "Ruddy Immigration Officer"
    },
    {
      "id": "nm4830386",
      "name": "Jimmy R. Perdue Jr.",
      "character": "Office personel /              airport extra"
    }
  ],
  "overview": "In New York, a Pakistani native finds that his American Dream has collapsed in the wake of the 9/11 terrorist attacks.",
  "storyline": "A young Pakistani man is chasing corporate success on Wall Street. He finds himself embroiled in a conflict between his American Dream, a hostage crisis, and the enduring call of his family's homeland.",
  "plot": "The story begins on the streets of Lahore. A Pakistani man, Changez, offers to direct an American visitor where he can find a good cup of tea. As they wait for their tea, Changez begins to weave a long story about his life, especially his time living in the United States. The unnamed American is restless but remains to listen.\n\nChangez tells the American he was an excellent student who, after completing his bachelor's degree in Finance, joined Underwood Samson, a consultancy firm, as an analyst. He vacationed in Greece, after graduating from Princeton with fellow Princetonians, where he met Erica, an aspiring writer. He was instantly smitten by her, but his feelings remained almost unrequited because she was still grieving over the death of her childhood sweetheart Chris, who succumbed to lung cancer. After a date, they return to his place and he proceeds to have sex with her, but stops because her emotional attachment to Chris prevents her from becoming aroused. After this incident there is an interlude where neither contact each other. But soon they go on another date, after which they have sex when Changez convinces Erica to close her eyes and fantasize that she is with Chris. Though Changez is satisfied at this development in their relationship, this irreversibly damages their relationship. Soon she begins treatment in a mental institution. He notices she is physically emaciated and no longer her former self. After this meeting he travels to Chile on an assignment. When he returns to meet her, it is found that she has left the institution and her clothes were found near the Hudson River. Officially she is stated as a missing person, as her body has not been found.\n\nIn his professional life, he impresses his peers and gets earmarked by his superiors for his work, especially Jim, the person who recruited him, develops a good rapport with him, and holds him in high esteem. This prompts the firm to send him to offshore assignments in the Philippines and Valparaíso, Chile. In Chile, he is very distracted due to developments in the world and, responding to the parabolic suggestion of the publisher his company is there to assess, he comes to see himself as a servant of the American empire that has constantly interfered with and manipulated his homeland. He returns from Chile to New York without completing the assignment and ends up losing his job.\n\nPolitically, Changez is surprised by his own reaction to the September 11th attacks. \"Yes, despicable as it may sound, my initial reaction was to be remarkably pleased\", he tells the American. He observes the air of suspicion towards Pakistanis. Changez, due to his privileged position in society, is not among those detained or otherwise abused, but he notices a change in his treatment in public. To express solidarity with his countrymen after his trip to Chile, he starts to grow a beard. After the 2001 Indian Parliament attack, India and Pakistan mobilize leading to a standoff. Noticing the US response to this situation, he has an epiphany that his country is being used as a pawn. With no job, an expiring visa and no reason to stay in America, he moves back to Lahore.\n\nAfter returning to Lahore, he becomes a professor of finance at the local university. His experience and insight in world issues gains his admiration among students. As a result, he becomes a mentor to large groups of students on various issues. He and his students actively participate in demonstrations against policies that were detrimental to the sovereignty of Pakistan. Changez advocates nonviolence, but a relatively unknown student gets apprehended for an assassination attempt on an American representative, which brings the spotlight on Changez. In a widely televised interview, he strongly criticizes the militarism of U.S. foreign policy. This act makes people surrounding him think that someone might be sent to intimidate him or worse.\n\nAs they sit in the cafe, Changez keeps noting that the American stranger is very apprehensive of their surroundings, and he walks the stranger toward his hotel. As they walk, the American, now highly suspicious that he is in immediate danger, reaches into his pocket, possibly for a gun. Changez says he trusts it is simply his holder of business cards. But the novel ends without revealing what was in his pocket, leaving the reader to wonder if the stranger was a CIA agent, possibly there to kill Changez, or if Changez, in collusion with the waiter from the cafe, had planned all along to do harm to the American.",
  "synopsis": "The film opens in Lahore with Anse Rainier (Gary Richardson), an American professor at Lahore University, kidnapped on his way home from seeing a movie. The following day, the kidnappers send a video tape, in which they demand the release of 690 detainees from a Muslim concentration camp in Kot Lakhpat and 700,000 for the children of Waziristan in exchange for Rainier's life. An American journalist and undercover CIA informant in Pakistan, Bobby Lincoln (Liev Schreiber), arranges to interview one of Rainier's colleagues at Lahore University, Changez Khan (Riz Ahmed), who is suspected of being involved in the kidnapping, in a cafe in Lahore.Set back in 2000, Changez, the son of a famous poet (Om Puri) and housewife (Shabana Azmi), lives a privileged life in Lahore. Changez wins a scholarship to Princeton University. From there, he gains a training contract at a top Wall Street valuation firm, Underwood Samson. Before beginning employment, Changez takes a vacation to Greece, where he meets and falls in love with an American photographer, Erica (Kate Hudson), who mourns the death of her boyfriend. Their relationship develops on Changez's return to the USA, where he becomes a high-flying employee under his boss Jim Cross (Kiefer Sutherland).Changez is away in Manila on business when the World Trade Center attacks take place, and on return to the USA finds himself a figure of automatic suspicion, being strip-searched on arrival in New York. Gradually his positive attitude towards America begins to change. Despite sleeping with Erica, their relationship further deteriorates as she fails to move on from her boyfriend's death.During a business visit to Istanbul Changez values a publisher, and finds it worth no money. He discovers that the publisher published translations of his father's poems in Turkish. He cannot bring himself to only look at the money, and resigns from Underwood Samson. He returns to New York and has a last meeting with Erica.\nChangez returns to Lahore. He begins lecturing at Lahore University, where he voices his dissatisfaction with the US's interference in Pakistan and also meets suspected Al-Qaida members, causing the US to raid his house and threaten members of his family.Fast forward to the present day, both Bobby and Changez are under pressure from the CIA and protestors outside the cafe, leading the CIA to move in. Changez reveals that despite his opposition to the US he refused to join Al-Qaida as his anti-US sentiment does not define him; Bobby in turn admits that Rainier was a CIA officer. As the protests in Lahore grow more violent, Changez suggests a butcher's shop where Rainier may have been taken.Tensions and suspicions escalate as the protesters grow further enraged and Bobby becomes suspicious of Changez, who is sending tense text messages on his cellphone. The CIA inform Bobby that Rainier is, in fact, already dead, leading him to drag Changez out of the cafe at gunpoint. As Changez appeals for calm from the protestors, Bobby accidentally shoots and kills Sameer (Imaad Shah), one of Changez's militant students. As the CIA extract Bobby, they reveal to Bobby both that Rainier had died earlier that day and that Changez had already offered to work with the CIA - the text messages he sent were to his sister, Bina (Meesha Shafi).Changez delivers a eulogy at Sameer's funeral as Bobby recuperates in hospital, recalling Changez's words - \"Looks can be deceiving. I am a lover of America.\" The film ends with the note."
}