{
  "imdb_id": "tt2053425",
  "tmdb_id": "97365",
  "douban_id": null,
  "title": "Rust and Bone (2012)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "120 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.5,
  "director": [
    {
      "id": "nm0002191",
      "name": "Jacques Audiard"
    }
  ],
  "writer": [
    {
      "id": "nm0002191",
      "name": "Jacques Audiard",
      "description": "screenplay"
    },
    {
      "id": "nm0081179",
      "name": "Thomas Bidegain",
      "description": "screenplay"
    },
    {
      "id": "nm4662668",
      "name": "Craig Davidson",
      "description": "story"
    }
  ],
  "cast": [
    {
      "id": "nm0182839",
      "name": "Marion Cotillard",
      "character": "Stéphanie"
    },
    {
      "id": "nm0774386",
      "name": "Matthias Schoenaerts",
      "character": "Alain van Versch"
    },
    {
      "id": "nm5014245",
      "name": "Armand Verdure",
      "character": "Sam"
    },
    {
      "id": "nm2072818",
      "name": "Céline Sallette",
      "character": "Louise"
    },
    {
      "id": "nm0556387",
      "name": "Corinne Masiero",
      "character": "Anna"
    },
    {
      "id": "nm0099521",
      "name": "Bouli Lanners",
      "character": "Martial"
    },
    {
      "id": "nm3853313",
      "name": "Jean-Michel Correia",
      "character": "Richard"
    },
    {
      "id": "nm0158898",
      "name": "Yannick Choirat",
      "character": "Simon"
    },
    {
      "id": "nm2239764",
      "name": "Mourad Frarema",
      "character": "Foued"
    },
    {
      "id": "nm0579907",
      "name": "Fred Menut",
      "character": "Le patron d'ELP Sécurité"
    },
    {
      "id": "nm5068865",
      "name": "Duncan Versteegh",
      "character": "Soigneur d'orques"
    },
    {
      "id": "nm5068608",
      "name": "Katia Chaperon",
      "character": "Soigneuse d'orques"
    },
    {
      "id": "nm5068882",
      "name": "Catherine Fa",
      "character": "Soigneuse d'orques"
    },
    {
      "id": "nm5068535",
      "name": "Andès Lopez Jabois",
      "character": "Soigneur d'orques"
    },
    {
      "id": "nm5068907",
      "name": "Océane Cartia",
      "character": "La baby-sitter"
    },
    {
      "id": "nm0584719",
      "name": "Françoise Michaud",
      "character": "La mère de Stéphanie"
    },
    {
      "id": "nm5068029",
      "name": "Irina Coito",
      "character": "La prof d'aérobic"
    },
    {
      "id": "nm5068920",
      "name": "David Billaud",
      "character": "Le maître-chien"
    },
    {
      "id": "nm9946399",
      "name": "Yvon L'Allain",
      "character": "Le prothésiste"
    },
    {
      "id": "nm2810232",
      "name": "Fabien Baïardi",
      "character": "Le dragueur dans la boîte"
    },
    {
      "id": "nm5068561",
      "name": "Laetitia Malbranque",
      "character": "La femme du supermarché"
    },
    {
      "id": "nm5068780",
      "name": "Soulyane Rajraji",
      "character": "Le délégué syndical du supermarché"
    },
    {
      "id": "nm0747491",
      "name": "Pascal Rozand",
      "character": "Le concessionnaire"
    },
    {
      "id": "nm5068198",
      "name": "Hedi Touihri",
      "character": "Le chef sécurité du supermarché"
    },
    {
      "id": "nm0587687",
      "name": "Martine Millar",
      "character": "La collègue d'Anna"
    },
    {
      "id": "nm5068497",
      "name": "Anne-Marie Tomat",
      "character": "L'infirmière de l'hôpital près du lac"
    }
  ],
  "overview": "Put in charge of his young son, Ali leaves Belgium for Antibes to live with his sister and her husband as a family. Ali's bond with Stephanie, a killer whale trainer, grows deeper after Stephanie suffers a horrible accident.",
  "storyline": "Lonely and destitute, Alain leaves the north of France for his sister's house in Antibes after becoming the sole guardian of his estranged five-year-old son Sam. When he lands a job as a bouncer in a nearby nightclub, things quickly start to look up for the itinerant father and son. Then one night, after breaking up a fight in the club, he meets the radiant Stephanie, and slips her his number after dropping her off safely at home. Though her position on the high end of the social spectrum makes romance an unlikely prospect for the pair, a tragic accident at Marineland robs her of her legs, and finds her reaching out in desperation to him. Her spirit broken by the same tragedy that took her legs, she gradually finds the courage to go on living trough transcendent moments spent with him -- a man with precious little pity, but an enormous love of life.",
  "plot": "Alain van Versch, an unemployed father in his mid 20s known as Ali, arrives in Antibes, southern France, to look for work to support his young son, Sam. Having no money, he crashes with his sister Anna, who already has her own share of problems with money and temporary employment.\n\nAli gets a job as a bouncer in a nightclub but still keeps his passion burning for fighting. On a usual evening in the night club, Ali meets Stéphanie and escorts her safely to her home after she is injured in a brawl at the club. She works at a local marine tourist park where she suffers a tragic accident during a show and wakes up in the hospital to realize that her legs have been amputated.\n\nAli meets a guy at work who informs him about a kick boxing fixture he can make money from. Stéphanie, now in a wheelchair and trying to adjust to her life without legs, is terminally depressed and gives Ali a call. Ali visits her and takes her to a beach where Stéphanie forgets her self-consciousness and feels freedom when Ali carries her out to the ocean to swim.\n\nOver a period of time, Ali and Stéphanie spend a lot of time together. and Stéphanie starts to feel better about herself in Ali's company. She gets artificial limbs and starts to walk again. Stéphanie accompanies Ali to his mixed martial arts fights and is surprised to learn he has a son.\n\nAfter a frank discussion, Ali offers to have sex with Stéphanie to help her adjust to her new body and their friendship then evolves to include casual sex, although Stéphanie prevents any true intimacy by telling Ali that there will be no kissing during their encounters.\n\nAli, Stéphanie, and some friends visit the same night club where Ali used to work. Ali goes to the dance floor and flirts with a girl as Stéphanie watches curiously. Ali goes away with the girl leaving a surprised and dejected Stéphanie with other friends. A man at the bar tries to kiss her but she backs away from him revealing her prosthetic legs. Looking down at her aluminum legs in her skirt, the man apologizes to her and Stéphanie flies into a rage throwing a glass and attacking the man. She has to be escorted out of the club.\n\nThe next day a hurt Stéphanie sullenly questions Ali about their relationship status. She tells him that if they continue having casual sex, they have to respect each other's feelings and be more discreet about their other involvements. Their intimacy increases and Stéphanie, letting down her guard, kisses Ali igniting true intimacy. Stéphanie also begins managing Ali's bets for his fighting after his manager leaves town.\n\nAnna is fired from her job when the managers realize she has been taking home expired food products. Anna blames Ali for this, as Ali was involved in an odd job where he installed spy cameras in work areas. He does this at the direction of the management to spy on the activities of their employees. This results in a standoff between Ali and Anna's partner who demands he move out and not to come back.\n\nAli, feeling guilty and rejected leaves town without a word to Stephanie who is hurt by being thoughtlessly left behind. Sam stays with Anna while Ali goes to a combat sports training facility near Strasbourg (as evidenced by earlier references in the film and the fact that Anna's partner drops Sam off on the way to a delivery in Colmar), losing touch with Stéphanie.\n\nAnna's partner, with her permission, drops off Sam to visit for a day with Ali at the training facility. It is winter and Ali and Sam play in the snow on a frozen lake. A weak spot on the frozen lake cracks and Sam falls through the ice swiftly losing consciousness. He is submerged in the icy waters as Ali turns away momentarily distracted by a call of nature. It takes Ali a while to realize that Sam has fallen through. Once he spots the hole and sees Sam under the ice of the frozen lake, Ali releases a desperate volley of punches to break the surface and is finally able to pull an unconscious Sam out. In the process, Ali fractures almost every bone is his hands.\n\nAfter carrying him to the hospital a distraught Ali stays at Sam's bed while he's in a coma. Sam survives, coming out of his coma. Stéphanie, who calls after hearing about Sam's accident speaks to Ali at the hospital. Ali breaks down while talking to Stéphanie on the phone and confesses his love for her.\n\nAs Ali narrates, he explains how broken bones normally heal stronger than before, but he knows the pain will return in his hands.\n\nAfter some time passes, Ali is shown celebrating a fight victory in Warsaw as Stéphanie happily watches. After the celebration of the win, Ali and Stéphanie take Sam by the hand and leads him out through the revolving door of a hotel.",
  "synopsis": "Ali (Matthias Schoenaerts) in his mid 20's, an unemployed father to a young son, Sam (Armand Verdure) arrives in Antibes, southern France to look for work. Having no money, he crashes with his sister Anna (Corinne Masiero) who already has her own share of problems with money and temporary employment.\nAli gets a job as a bouncer in a night club but still keeps his passion burning for kick boxing. On a usual evening in the night club, Ali meets Stéphanie (Marion Cotillard) and escorts her safely to her home after she is injured in a brawl at the club. She works at a local marine tourist park where she suffers a tragic accident during a show and wakes up in the hospital to realize that her legs have been amputated. Ali meets a guy at work who informs him about a kick boxing fixture he can make money from. Stéphanie, now in a wheelchair, is terminally depressed and gives Ali a call. Ali visits her and takes her to a beach where they swim.Over a period of time, Ali and Stéphanie spend a lot of time together and get involved in casual sex every now and then, while Ali hooks up with other women as well, being honest about it with Stéphanie. Stéphanie starts to accompany Ali to the kick boxing matches and a symbiosis forms between both of them. Stéphanie starts to feel better about herself in Ali's company and gets artificial limbs. She starts to walk again and even manages Ali's bets for kick boxing. Ali, Stéphanie and some friends visit the same night club where Ali used to work. Ali goes to the dance floor and flirts with a girl as Stéphanie watches curiously. Ali goes away with the girl leaving a dejected Stéphanie with other friends. Anna is fired from her job as the higher management comes to know of her taking home the expired food products. Anna blames Ali for this as Ali was involved in an odd job where he installed spy cameras in work areas at the direction of the management to spy on the activities of their employees. This results in a standoff between Ali and Anna's partner and Ali leaves. Sam stays with Anna while Ali goes to a training facility for kick boxers in a distant place and loses touch with Stéphanie. Sam visits Ali at his facility for a day and both are shown playing on a frozen lake. A weak spot on the frozen lake cracks and Sam falls into the lake, loses consciousness and floats on. Ali takes a while to realize that Sam is nowhere to be seen. Once he spots Sam under the frozen lake, Ali releases a desperate volley of punches to break the surface and gets an unconscious Sam out. In the process, Ali fractures his hands.Sam survives and in the hospital Ali breaks down while talking to Stéphanie on the phone and confesses his love for her after realizing that he had been cold and insensitive to her all this time. As the film closes, Ali is shown to have gone professional in kick-boxing as Sam and Stephanie stand by him in what looks like a post-fight victory ceremony."
}