{
  "imdb_id": "tt2080323",
  "tmdb_id": "82023",
  "douban_id": null,
  "title": "Hotel Desire (2011)",
  "genres": [
    "Short",
    "Drama",
    "Romance"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "38 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm1159827",
      "name": "Sergej Moya"
    }
  ],
  "writer": [
    {
      "id": "nm1159827",
      "name": "Sergej Moya",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm2701577",
      "name": "Saralisa Volm",
      "character": "Antonia"
    },
    {
      "id": "nm0771332",
      "name": "Clemens Schick",
      "character": "Julius Pass"
    },
    {
      "id": "nm0470818",
      "name": "Jan-Gregor Kremp",
      "character": "Marcel"
    },
    {
      "id": "nm0460578",
      "name": "Herbert Knaup",
      "character": "Hoteldirektor"
    },
    {
      "id": "nm1035643",
      "name": "Frederick Lau",
      "character": "Doorman"
    },
    {
      "id": "nm3485229",
      "name": "Palina Rojinski",
      "character": "Julia"
    },
    {
      "id": "nm2012595",
      "name": "Trystan Pütter",
      "character": "Rezeptionist       (as Trystan Wyn Puetter)"
    },
    {
      "id": "nm0061830",
      "name": "Hans-Uwe Bauer",
      "character": ""
    },
    {
      "id": "nm4668474",
      "name": "Liroy Gehrke",
      "character": "Luca"
    },
    {
      "id": "nm1555489",
      "name": "Susan Hoecke",
      "character": ""
    },
    {
      "id": "nm4772645",
      "name": "Petar Knezevic",
      "character": "Französisches Model"
    },
    {
      "id": "nm1030925",
      "name": "Carlo Ljubek",
      "character": "Galerist Dennewitz"
    }
  ],
  "overview": "The story is about a woman who lives alone. Her son went to his father in another place. The first character is a maid in a hotel to serve the people. First, she got some serious problems in her job. She couldn't take care of both, her job and her son. Her supervisor solved some her problems because he was a good man and may like her. She was not rich and proud, she listened her colleague advice about sex because she didn't have sex for about seven years. She went accidentally to a room who a blind man is living. He was naked after a shower and he talked on his phone. after that, he looked for his socks but he touched the maid body that listened his conversation and be completely quiet. then they started to do sex.",
  "storyline": "In Berlin--during one of the hottest summers in the last seven years--Antonia, a single mother and an exhausted hotel maid who has lost faith in her, drives her son to the bus station to visit his father in Paris. Late again for work, an unexpected act of compassion will pave the way for a fateful encounter with the famous blind portrait painter, Julius Pass, who is on pins and needles for his big exhibition opening; however, is this untidy maid prepared for an unforgettable and life-altering experience?",
  "plot": null,
  "synopsis": "The story is about a woman who lives alone. Her son went to his father in another place. The first character is a maid in a hotel to serve the people. First, she got some serious problems in her job. She couldn't take care of both, her job and her son. Her supervisor solved some her problems because he was a good man and may like her. She was not rich and proud, she listened her colleague advice about sex because she didn't have sex for about seven years. She went accidentally to a room who a blind man is living. He waas naked after a shower and he talked on his phone. after that, he looked for his socks but he touched the maid body that listened his conversation and be completely quiet. then they started to do sex."
}