{
  "imdb_id": "tt2070862",
  "tmdb_id": "97006",
  "douban_id": null,
  "title": "Temptation: Confessions of a Marriage Counselor (2013)",
  "genres": [
    "Drama",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "111 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.9,
  "director": [
    {
      "id": "nm1347153",
      "name": "Tyler Perry"
    }
  ],
  "writer": [
    {
      "id": "nm1347153",
      "name": "Tyler Perry",
      "description": "screenplay"
    },
    {
      "id": "nm1347153",
      "name": "Tyler Perry",
      "description": "stage play \"The Marriage Counselor\""
    }
  ],
  "cast": [
    {
      "id": "nm0810619",
      "name": "Jurnee Smollett-Bell",
      "character": "Judith"
    },
    {
      "id": "nm2342614",
      "name": "Lance Gross",
      "character": "Brice"
    },
    {
      "id": "nm2578007",
      "name": "Kim Kardashian West",
      "character": "Ava       (as Kim Kardashian)"
    },
    {
      "id": "nm0001853",
      "name": "Vanessa Williams",
      "character": "Janice"
    },
    {
      "id": "nm0429129",
      "name": "Robbie Jones",
      "character": "Harley"
    },
    {
      "id": "nm0853041",
      "name": "Renée Taylor",
      "character": "Ms. Waco Chapman"
    },
    {
      "id": "nm0431520",
      "name": "Ella Joyce",
      "character": "Sarah"
    },
    {
      "id": "nm0005275",
      "name": "Brandy Norwood",
      "character": "Melinda"
    },
    {
      "id": "nm1583973",
      "name": "Jim Adams",
      "character": "Client"
    },
    {
      "id": "nm2457961",
      "name": "Alvin Aki",
      "character": "Client #4"
    },
    {
      "id": "nm4294448",
      "name": "Sidney Baxley",
      "character": "Client #2       (as Sid Baxley)"
    },
    {
      "id": "nm3150771",
      "name": "Renee Ford Clark",
      "character": "Sarah's Church Sister #2"
    },
    {
      "id": "nm1051245",
      "name": "Candice Coke",
      "character": "Marriage Counselor"
    },
    {
      "id": "nm5580003",
      "name": "Stephanie Marie Douglas",
      "character": "Choir Singer #1"
    },
    {
      "id": "nm5582858",
      "name": "Timothy Scott Floyd",
      "character": "Choir Singer #6"
    },
    {
      "id": "nm5579732",
      "name": "Jack Brandon Frazier",
      "character": "Choir Singer #4"
    },
    {
      "id": "nm5580641",
      "name": "Howard C. French",
      "character": "Client #1"
    },
    {
      "id": "nm5582064",
      "name": "Ryan Johns",
      "character": "Choir Singer #2"
    },
    {
      "id": "nm5581521",
      "name": "Blanche Leigh Johnson",
      "character": "Choir Singer #7"
    },
    {
      "id": "nm5580778",
      "name": "Bethany Hurst Jones",
      "character": "Choir Singer #5"
    },
    {
      "id": "nm3936378",
      "name": "Doreen Ketchens",
      "character": "Singer"
    },
    {
      "id": "nm5581580",
      "name": "Bryson Lofton",
      "character": "BJ"
    },
    {
      "id": "nm5283590",
      "name": "Ronald Lynch",
      "character": "Young Brice (10 yrs)"
    },
    {
      "id": "nm4753360",
      "name": "Sheila Maddox",
      "character": "Sarah's Church Sister #1"
    },
    {
      "id": "nm2278056",
      "name": "Cara Mantella",
      "character": "Social Advance Marriage Counselor"
    },
    {
      "id": "nm3244413",
      "name": "Andrea Moore",
      "character": "Lisa"
    },
    {
      "id": "nm1296890",
      "name": "Shamea Morton",
      "character": "Woman"
    },
    {
      "id": "nm5583099",
      "name": "Nadine A. O'Brien",
      "character": "Choir Singer #3"
    },
    {
      "id": "nm3670203",
      "name": "Shaeleigh Person",
      "character": "Young Judith (10 yrs)"
    },
    {
      "id": "nm2146268",
      "name": "Andy Rusk",
      "character": "Mountain Biker"
    },
    {
      "id": "nm4533639",
      "name": "Zach Sale",
      "character": "Brad"
    },
    {
      "id": "nm1399155",
      "name": "Ron Bobb Semple",
      "character": "Client #3       (as Ron Bobb-Semple)"
    },
    {
      "id": "nm2937645",
      "name": "DeMontrez Spears",
      "character": "Man #1"
    },
    {
      "id": "nm2025632",
      "name": "Peg Thon",
      "character": "Mildred"
    }
  ],
  "overview": "A marriage counselor's personal and professional life becomes complicated after she enters into a relationship with one of her clients.",
  "storyline": "Roger Jackson strives to support his family, a group that includes not only his Ivy League-educated wife Judith (Jurnee Smollett-Bell), but his ganja-smoking father Stanley and her Bible-thumping mother TT as well. Meanwhile, Judith doles out thoughtful advice to couples every day, yet remains completely powerless when it comes to addressing the issues surrounding her own troubled marriage. When an old college friend drops by her office, Judith faces her biggest personal challenge to date..",
  "plot": "The film starts in a rundown office with a marriage counselor (Candace Coke) counseling a young married couple, Bradley (Zach Sale) and Lisa (Andrea Moore). After the husband walks out of the room, not wanting to participate, the marriage counselor notices a change within the wife's demeanor. The marriage counselor can tell that she has met someone else and decides to tell her a story about her sister, Judith.\n\nWe then go back in time, where Judith and her childhood sweetheart Brice are growing up through the years together, as soulmates. The two later get married and move to Washington, D.C. to start their own life together.\n\nJudith (Jurnee Smollett-Bell) becomes a therapist, working at a matchmaking agency owned by Janice (Vanessa L. Williams) and Brice (Lance Gross) works as a pharmacist. While at work, Brice meets another employee, Melinda (Brandy Norwood). Melinda reveals she is on the run from an abusive ex-boyfriend.\n\nJudith is dissatisfied with her job and anxious to start her own marriage counseling business, but Brice tells her to wait until they are more financially stable. Brice decides to take Judith out for dinner at a \"$5.99 buffet\". Judith becomes upset with Brice, when he refuses to confront a group of men who catcall her on their way home from dinner.\n\nJudith meets Harley (Robbie Jones) at work. Harley, a wealthy Internet entrepreneur who wants to invest in Janice's business, attempts to seduce Judith as they work late on matchmaking surveys. When Harley questions the absence of sex in the surveys, Judith says she does not believe in premarital sex. Harley says Judith's sex life is boring. Judith, now questioning her sex life with Brice, tries to improve it, but fails.\n\nJudith changes her hair and makeup for her birthday and Brice fails to notice the change or remember her birthday. At work, Judith receives flowers that she believes are from Brice. Harley appears and notes her change in appearance -- the flowers are actually from him. Harley claims he is willing to do anything to be near her. At home, Judith leaves a cupcake with a candle in it on the counter. Realizing his mistake, Brice dances and sings in a cowboy outfit for her. The two make up.\n\nJanice sends Judith to New Orleans with Harley to finalize a deal with shareholders, telling her to flirt with Harley, but also to be careful. Judith's coworker, Ava (Kim Kardashian), gives Judith a makeover. In New Orleans, Judith and Harley complete the business deal and go dancing and sightseeing. On the way home, Harley seduces Judith and they have sex in his private jet. He takes her home and meets Judith's mother, Miss Sarah (Ella Joyce).\n\nUnhappy with Brice's inattentiveness, Judith sneaks out to meet Harley and they have sex again. He demands that she leave Brice and offers to help with her business. When she feels like she shouldn't, Harley tells her to leave and she becomes upset and starts throwing drink and food at him. Back at home, Judith and her mother Sarah get into an argument, which leads to Sarah slapping Judith and leaving. Judith rufuses to tell talk to Brice about their argument and goes to take a shower. She later leaves him to be with Harley.\n\nJanice fires Judith after finding out about her and Harley's plans, and the two have a falling out. Brice discovers Judith is having an affair and heads to Harley's party. Brice drags Judith outside and begs her to return to him, but Judith chooses to stay with Harley. Brice goes over to Melinda's place where she comforts him and encourages him that things will get better. Judith returns to the apartment she shared with Brice to pick up a laptop and becomes surrounded by her mother and church members' prayer circle. Sarah grabs Judith, trying to prevent her from leaving. Harley knocks Sarah down and forces Judith to leave. At Harley's, Judith is outraged by his treatment of her mother and after a heated argument, Harley begins to beat her, after she attempts to leave.\n\nBrice has dinner with Melinda. She reveals she contracted HIV from her ex, who is revealed to be Harley. Brice breaks into Harley's place with Melinda and finds Judith in the bathroom bloody and bruised. After taking Judith to his truck, Brice goes back into the house and begins to beat Harley until stopped by Melinda. As Harley regains consciousness, he calls out to Melinda, whose real name is Karen. Brice threatens him to stay away from both Karen and Judith and they leave him, laying on the floor beaten and still semi-conscious.\n\nCut back to present day, the marriage counselor has finished the story and Lisa wonders how the story ends. The marriage counselor tells her that Judith contracted HIV as well, but not Brice. Lisa thanks the marriage counselor and decides to stay with her husband.\n\nThe marriage counselor (revealed to be an older Judith) then goes to the pharmacy to get her medicine from Brice. After they speak, a woman and a little boy walk into the pharmacy, revealed to be Brice's new wife and child, making it clear things didn't work out between the two. Judith (in sorrow) then walks out of the pharmacy and heads to church, to meet with her mother as the credits start rolling.",
  "synopsis": "The movie opens up in a rundown office where a marriage counselor is counseling a couple. Due to an argument, the husband walks out and the counselor notices a change in the wife's demeanor once the husband is gone. The counselor says she can tell that the wife has met someone, and that she would like to tell her a story about her sister, Judith.We then cut to a montage of Judith (Jurnee Smollett-Bell) and her husband Brice (Lance Gross) growing up and falling in love in southern Virgina, throughout the years. Eventually, with the blessing of Judith's mother, Ms. Sarah (Ella Joyce), the couple marries and moves to Washington D.C. Brice gets a job at a local pharmacy working for the elderly owner Ms. Chapman (Renée Taylor), while Judith takes a job as the in-house therapist at matchmaking/dating service company owned by Janice (Vanessa Williams), a French woman. At the practice, Judith is constantly belittled by Ava (Kim Kardashian), Janice's personal secretary, for her lack of sex appeal and fashion sense.Over at the pharmacy, Brice and Ms. Chapman hire Melinda (Brandy Norwood) to work in the store, although Ms. Chapman has a stereotypical view of Melinda. Based on her boots and clothes, she think she's a lesbian. Melinda still takes the job.At Judith and Brice's small one bedroom apartment, Judith talks about wanting to start her own practice and move up. Brice reminds her maybe in 10 to 15 years when they are more established. He then decides to take Judith out to dinner to a cheap $5.99 buffet. After dinner, some young thugs make a sexual comment towards Judith who wants to say something, but Brice tells her to walk it off and let it go. Meanwhile, in another part of the city, Melinda is walking home and looking over her shoulder very afraid. Once she arrives at home at her one-room apartment, she puts about six locks on her front door and grabs a baseball bat for protection.The next day at work, Judith is introduced to Harley (Robbie Jones), a Zuckerberg-type computer software inventor who wants to invest in Janice's company. While speaking privately with Judith, Harley asks if he knows her, and he mentions that he's seen her running in the same park he does. Judith counters this by saying he's the shirtless man who is always trying to impress the ladies in the park. Judith then gives Harley a questionnaire about his love life and personality for him to fill out. At home, Judith mentions to Brice whom she met and that her mother will be paying a visit in the coming days.When Judith goes back to work the next day, Harley gives her a questionnaire to be completed, but he mentions that there are no questions about sex on the questionnaire. Judith says: \"we aren't that kind of business\". Janice informs Judith that she'll be working with Harley on the deal. Meanwhile at Brice's pharmacy, Melinda mentions that she needs to quit. Ms. Chapman asks her why, and she informs Brice and Ms. Chapman that her ex-husband attempted to kill her, and that she's been on the run for years trying to escape him. Ms. Chapman then mentions to her that she can't quit and that Brice will take her to and from work, so she feels safe.While working late one night, Harley verbally seduces Judith by asking her about her sex life with Brice, coming to the conclusion that Judith and Brice have a boring sex life, due to the fact that they basically only have sex in the bedroom. Harley mentions having sex in the car, in the kitchen, etc., and it's clear by Judith's face that she's turned on. Judith rushes home and attempts to seduce Brice in the kitchen, even going as far to make animal-like noises, but Brice is taken aback. He tells her they only have sex in the bedroom, and if she wants to attack something, attack the sandwich he just made her.The next morning, Judith wakes up un-sexually satisfied and decides to go for her morning run to see Harley. While running, Judith runs into a biker on accident and Harley blows up at the man. Judith calms him down. Harley takes her to his home to fix up her leg, which was hurt when she fell. Judith is very impressed by Harley's home and once again, Harley tries to verbally seduce Judith by saying he doesn't miss anything about her, such as the way she smiles or some of the blonde hairs mixed in with her natural hair. Judith counters him again by saying she doesn't miss a thing either, like the smell of perfume in his home, or the woman's earring on the table. Brice shows up to pick up Judith, and they head home.A few days later, it's Judith's 26th birthday, and she decides to try something different with her makeup and hair. Brice doesn't notice and mentions to Judith that he will be working late tonight, and walks out of the house without wishing her happy birthday. When Judith gets to her office, there are roses waiting, and she runs into Ava, who again is taken aback by her appearance. Judith thinks the flowers are from Brice, but they are from Harley. At home that night, Brice notices a single cupcake with a candle and realizes his mistakes. He then decides to sing, \"Try A Little Tenderness\" to his wife in nothing but a cowboy hat and his underwear to cheer her up.Back at work the next day, Judith finally gives in to Ava's desire to make her over. Around the same time, Janice tells Judith that she will be accompanying Harley to New Orleans to finalize their deal. Janice warns Judith to be careful around Harley. Judith arrives at Harley's private plane and the two head to New Orleans. In New Orleans, the deal is a success, and the two spend the day exploring the city. Heading back on the plane after much talk, Harley comes on to Judith, initially she tries to push him away, but gives in to him, and they have sex on his plane. Arriving back home, Judith tells Harley to never call her again. Harley chases after Judith, right as her mother and Brice are pulling up. Judith's mother instantly takes a disliking to Harley.While having dinner with Judith and Ms. Sarah, Brice lets it slip that Judith hasn't been cooking, nor has the couple been attending church, which doesn't sit well with the conservative and traditionalist Ms. Sarah.At work the next day, Judith is in her office and sees Harley who's been ignoring her all day. At home that night, Brice is watching a football game when Harley calls Judith. Judith goes off on Harley who reminds her she is the one who wanted to end things. Harley then insults Judith while at the same time seducing her. He tells her to tell him that she wants him, to which she does and that he will be there to pick her up in 20 minutes. Judith walks out of the house, Brice doesn't notice, but Ms. Sarah does.After having sex again with Harley in his home, Judith cooks for him, cleans his house, etc. Harley then mentions to Judith that he doesn't want to go into business with Janice. Instead, he wants to start a business with her on the condition that she leaves Brice. Judith refuses to leave Brice, and the two get into an argument, which results in Judith throwing food and walking out, which results in Harley just laughing. When Judith arrives at home, she gets into an argument with her mother. Judith then reveals to her mother that she knows the real reason her dad left, which causes Ms. Sarah to slap Judith. Brice is awoken by all the arguing, and asks what's wrong with the two, and they both ignore him.A few days pass, and Judith ends up going up back to Harley. Harley is reluctant at first, but when Judith has sex with Harley in his Rolls Royce he changes his mind. Judith has totally changed into a wild and crazy, devious person.One day, when Brice notices her stumbling in their apartment from being dropped off with Harley, he puts two and two together. Judith ends up putting in a one week notice with Janice. However, Janice fires her before she can quit, revealing she knows all about Judith's deal with Harley. Judith attempts to have the last word with Janice by revealing that she's knows that she's not from Paris like once thought, but rather from Georgia. Caught off-guard, Janice then counters her by changing her accent and saying, \"bitch get outta of my office.\"In the midst of her affair with Harley, Judith still hasn't told Brice, who shows up at Harley's home in the middle of a party. In an attempt to get his wife back. Brice drags Judith out of the house, where she all but breaks Brice's heart, and he breaks down crying. He tells Judith he'll pack her stuff, but she says she doesn't need it. She then walks back into the house. Brice goes to Melinda's home for comfort, and while there, he attempts to kiss her, but she reminds him that they aren't attracted to each other, but she can be his friend.The next day Judith goes back to the apartment to get her laptop, and her mother is there with members of the local church. The ladies are all praying for Judith, but it falls on deaf ears. Harley becomes frustrated and throws Ms. Sarah to the ground, and then forces Judith out of the house.Back at Harley's home, the couple get into an argument with Harley acting childish and going as far as to say that Judith is picking her mother over him. Judith responds by saying: \"it's not my fault that your mother left you to go to a crack house!\" Harley then goes into a closet and beats Judith.That night at Melinda's apartment, while having dinner with Brice, he asks her if she thinks she will ever find love again. She says no, due to the fact that she's HIV positive. Melinda then reveals that she got it from her ex-husband... Harley, which alerts Brice.Melinda and Brice rush to Harley's apartment, where they find Harley passed out drunk and Judith bloody and bruised in the bathtub. Brice picks her up and takes her to his truck. He then goes back in to Harley's home and gives Harley a beating. Melinda comes into the home and stops Brice before he kills Harley. Harley, dazed but still aware, notices Melinda and says, \"Karen... you came back to me.\" She replies with, \"Yes, it's me.\" Brice then warns Harley to stay away from both Melinda/Karen and Judith.Cut back to the present day where the marriage counselor is finishing up the story. The wife asks if this story has a happy ending, and the marriage counselor reveals that it's still being written. Judith did contract HIV as well. The client then tells that the marriage counselor that she has decided to stay with her husband and end the affair.The marriage counselor is next seen walking into Chapman's pharmacy, now run by Brice. It is revealed that she is Judith. Brice tells her he spoke to her doctor about her new meds, and he hopes she's doing okay. A woman and a young boy walk into the store and run towards Brice. It's made clear that Judith and Brice didn't work things out, and Brice re-married (making the present day at least five or six years forward). Judith then walks out of the pharmacy and heads to church to meet her mother."
}