{
  "imdb_id": "tt2084007",
  "tmdb_id": "172618",
  "douban_id": null,
  "title": "Lora ot sutrin do vecher (2011)",
  "genres": [
    "Adventure",
    "Comedy",
    "Mystery"
  ],
  "country": "Bulgaria",
  "version": [
    {
      "runtime": "93 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm3849745",
      "name": "Dimitar Kotzev"
    }
  ],
  "writer": [
    {
      "id": "nm3849745",
      "name": "Dimitar Kotzev",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2838083",
      "name": "Milena Nikolova",
      "character": "Lora"
    },
    {
      "id": "nm1284068",
      "name": "Hristo Petkov",
      "character": "The Sleek (Gladkia)"
    },
    {
      "id": "nm2147605",
      "name": "Iva Gocheva",
      "character": "Silveto"
    },
    {
      "id": "nm4733551",
      "name": "Antonina Kovacheva",
      "character": "Aunt Sia       (as Dr. Antonina Kovacheva)"
    },
    {
      "id": "nm4733803",
      "name": "Marten Roberto",
      "character": "Mario"
    },
    {
      "id": "nm4732979",
      "name": "Yulian Kovalevski",
      "character": "The Moustache"
    },
    {
      "id": "nm2817670",
      "name": "Dimo Alexiev",
      "character": "Tiho"
    },
    {
      "id": "nm4721794",
      "name": "Georgi Petrov",
      "character": "Jabba"
    },
    {
      "id": "nm0884794",
      "name": "Radena Valkanova",
      "character": "Chief"
    }
  ],
  "overview": "After a night of partying with her friends Lora has to get herself together and attend an important meeting. At her office she finds two packages which contain two mysterious dice. The sides of one of them are all marked with the number two and of the other - with the number five. In the course of the day Lora will have to find out the truth behind the magical properties of a set of six dice. She'll be betrayed and helped, chased and abducted. She'll fall in love and help a friend deal with a complicated relationship. After this roller-coaster ordeal she'll come out stronger and happier having reasserted the importance of true friendship.",
  "storyline": "After a night of partying with her friends Lora has to get herself together and attend an important meeting. At her office she finds two packages which contain two mysterious dice. The sides of one of them are all marked with the number two and of the other - with the number five. In the course of the day Lora will have to find out the truth behind the magical properties of a set of six dice. Lora would be betrayed and helped, chased and abducted. She'd fall in love and she'd help a friend deal with a complicated relationship. After this roller-coaster ordeal she'll come out stronger and happier having reasserted the importance of true friendship.",
  "plot": null,
  "synopsis": null
}