{
  "imdb_id": "tt2048877",
  "tmdb_id": "84172",
  "douban_id": null,
  "title": "The Ambassador (2011)",
  "genres": [
    "Documentary"
  ],
  "country": "Denmark",
  "version": [
    {
      "runtime": "93 min",
      "description": "original"
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm1366561",
      "name": "Mads Brügger"
    }
  ],
  "writer": [
    {
      "id": "nm1366561",
      "name": "Mads Brügger",
      "description": "original idea"
    },
    {
      "id": "nm1366561",
      "name": "Mads Brügger",
      "description": "writer"
    },
    {
      "id": "nm1342798",
      "name": "Maja Jul Larsen",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm1366561",
      "name": "Mads Brügger",
      "character": "Himself"
    },
    {
      "id": "nm10115007",
      "name": "Heather Schmid",
      "character": "Herself"
    }
  ],
  "overview": "This darkly comic, genre-bending piece of gonzo journalism from international provocateur Mads Brügger (filmmaker of Sundance Grand Jury Prize winner Red Chapel) rips the corroded lid off the global scheme of political corruption and exploitation happening in one of the most dangerous places on the planet: the Central African Republic. Armed with a phalanx of hidden cameras, black-market diplomatic credentials and a bleeding-edge wit, Brügger transforms himself into an outlandish caricature of a European-African consul. As he immerses himself in the life-threatening underworld of nefarious bureaucrats, Brügger encounters blood diamond smuggling, bribery, and even murder -- while somehow managing to crack amazing razor-sharp barbs at every step along the way. From each absurdly terrifying/hilarious situation to the next, The Ambassador is a one-of-a-kind excursion from the man whom The Huffington Post has called “the most provocative filmmaker in the world.”",
  "storyline": "Danish journalist Mads Brügger goes undercover as a Liberian Ambassador to embark on a dangerous yet hysterical journey to uncover the blood diamond trade in Africa.",
  "plot": null,
  "synopsis": null
}