{
  "imdb_id": "tt2034761",
  "tmdb_id": "149427",
  "douban_id": null,
  "title": "Journey to the Christmas Star (2012)",
  "genres": [
    "Adventure",
    "Family",
    "Fantasy"
  ],
  "country": "Norway",
  "version": [],
  "imdb_rating": 5.9,
  "director": [
    {
      "id": "nm0310168",
      "name": "Nils Gaup"
    }
  ],
  "writer": [
    {
      "id": "nm1515005",
      "name": "Kamilla Krogsveen",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4935995",
      "name": "Vilde Zeiner",
      "character": "Sonja       (as Vilde Marie Zeiner)"
    },
    {
      "id": "nm0471601",
      "name": "Anders Baasmo Christiansen",
      "character": "Kongen"
    },
    {
      "id": "nm1748545",
      "name": "Agnes Kittelsen",
      "character": "Heksa"
    },
    {
      "id": "nm4936339",
      "name": "Stig Werner Moe",
      "character": "Greven       (as Stig-Werner Moe)"
    },
    {
      "id": "nm4936256",
      "name": "Eilif Hellum Noraker",
      "character": "Mose"
    },
    {
      "id": "nm0908970",
      "name": "Knut Walle",
      "character": "Julenissen"
    },
    {
      "id": "nm4936424",
      "name": "Sofie Asplin",
      "character": "Heksas datter"
    },
    {
      "id": "nm0951604",
      "name": "Kristin Zachariassen",
      "character": "Skognissemor"
    },
    {
      "id": "nm1548431",
      "name": "Andreas Cappelen",
      "character": "Skognissefar"
    },
    {
      "id": "nm1939580",
      "name": "Jakob Oftebro",
      "character": "Ole"
    },
    {
      "id": "nm1284277",
      "name": "Evy Kasseth Røsten",
      "character": "Petrine"
    },
    {
      "id": "nm0406082",
      "name": "Trond Høvik",
      "character": "Sjefsarbeidernisse"
    },
    {
      "id": "nm0326477",
      "name": "Jarl E. Goli",
      "character": "Stjernetyderen       (as Jarl Goli)"
    },
    {
      "id": "nm0351785",
      "name": "Brit Elisabeth Haagensli",
      "character": "Røvermor"
    },
    {
      "id": "nm1142576",
      "name": "Vera Rudi",
      "character": "Røverjente"
    },
    {
      "id": "nm0387009",
      "name": "Erik Hivju",
      "character": "Forteller       (as Eirik Hivju)"
    },
    {
      "id": "nm0357171",
      "name": "Stein Grieg Halvorsen",
      "character": "Skognissebestefars stemme"
    },
    {
      "id": "nm0644461",
      "name": "Nils Ole Oftebro",
      "character": "Bamse Brakar"
    },
    {
      "id": "nm0839209",
      "name": "Bjørn Sundquist",
      "character": "Nordavinden"
    },
    {
      "id": "nm8668171",
      "name": "Jakub Petr Crowe",
      "character": "Røvergutt 1"
    },
    {
      "id": "nm8668172",
      "name": "Simon Crowe",
      "character": "Røvergutt 2"
    },
    {
      "id": "nm0689183",
      "name": "Karel Polisenský",
      "character": "Hoffsjefen       (as Karel Polisensky)"
    },
    {
      "id": "nm6894003",
      "name": "Izabella Kisova",
      "character": "Dugg       (as Izabella Kisovà)"
    },
    {
      "id": "nm2145526",
      "name": "Richard Fiala",
      "character": "Arbeidsnisse 1"
    },
    {
      "id": "nm6173780",
      "name": "Václav Vodicka",
      "character": "Arbeidsnisse 2       (as Vaclav Vodicka)"
    },
    {
      "id": "nm6050553",
      "name": "Tomás Jeres",
      "character": "Arbeidsnisse 3       (as Tomàs Jeres)"
    },
    {
      "id": "nm1488622",
      "name": "Rostilav Trtík",
      "character": "Slottsvakt 1       (as Rotislav Trtìk)"
    },
    {
      "id": "nm1302436",
      "name": "Jaroslav Slánský",
      "character": "Slottsvakt 2"
    },
    {
      "id": "nm8668173",
      "name": "Kajetán Písa",
      "character": "Vakt ved slottsinngang"
    },
    {
      "id": "nm2468460",
      "name": "Julius Novák",
      "character": "Skognissebestefar       (as Julius Novàk)"
    },
    {
      "id": "nm8668174",
      "name": "Miroslav Uskoba",
      "character": "Smed"
    },
    {
      "id": "nm8668175",
      "name": "Zdenka Maríková",
      "character": "Gammel heks       (as Zdenka Marìkovà)"
    },
    {
      "id": "nm9217246",
      "name": "Rina Kelly",
      "character": "Nissejente"
    },
    {
      "id": "nm7874240",
      "name": "Stephie Theodora",
      "character": "Witch's Daughter       (voice)"
    }
  ],
  "overview": "13 year old kind-hearted Sonja arrives at a tiny village together with a company of bandits. But there is a curse on the village. A long time ago, the King’s only daughter Goldhair disappeared while searching for the Christmas Star. The Queen died of a broken heart, leaving the shattered King all on his own. From that day on, the King cursed the Christmas Star, thereby causing darkness and grief to descend upon the land. However, an old sage has revealed that Goldhair is still alive, and will return only if the King finds the way back to the Christmas Star. Ever since, the King has been searching for the Christmas Star every Christmas, but all in vain.",
  "storyline": "Once upon a time a little girl went out to find the Christmas star.",
  "plot": "In the opening scene, Max Anderson (Jean-Michel Paré) is being pursued by a Giganotosaurus. Max then comes across a fissure vent. When he tries to jump across, he falls while calling out the name of his brother. Ten years later, Max's brother volcanologist Trevor Anderson (Brendan Fraser) is visited by Max's son, Trevor's 13-year-old nephew Sean Anderson (Josh Hutcherson). In a box of items that belonged to Max is a book, Journey to the Center of the Earth by Jules Verne. Notes written by Max are found inside the book.\n\nIn Trevor's volcanology laboratory, a device shows activity on Snæfell, a dormant volcano in Iceland. Trevor and Sean travel to Iceland to investigate. They try to contact Icelandic volcanologist Sigurbjörn Ásgeirsson, but instead encounter his daughter Hannah Ásgeirsson (Anita Briem) since her father had died some years earlier. It turns out that Sigurbjörn and Max were both Vernians, a group of people who believe the works of Jules Verne to be fact and not fiction.\n\nHannah offers to help them climb the volcano. While the group is hiking up the volcano, a lightning storm forces them to take shelter in a cave. The cave entrance collapses, having them trapped in what appears to be an abandoned mine. The trio then rides on out-of-control mine carts, in which the tracks start to branch-off in three ways. Hannah and Trevor get saved from dead-ends and Sean reunites with them. They reach the bottom of a volcanic vent, the floor of the vent breaks, and they begin to fall towards the center of the Earth. The volcanic vent eventually becomes a water slide which drops them safely into a lake in the center of the Earth, which turns out to be a completely separate world contained within the Earth.\n\nThe group starts seeking a way back to the surface. Along the way, they find evidence that someone had been there a hundred years ago. Trevor remarks that some instruments found are Lidenbrock's (the name of a character in Jules Verne's book Journey to the Center of the Earth). This suggests that another group had previously made the journey, somehow returned to the surface and recounted the tale of their adventure to Verne. They find some of Max's things as well. While Trevor and Sean are examining what they've found, Hannah discovers Max's body. They bury Max on the beach of the underground ocean and Trevor reads a letter to Sean found in Max's journal. Trevor discovers that his brother died due to dehydration because of hot magma surrounding the center of the Earth.\n\nUsing information from Max's journal, Trevor determines that they must find a geyser that can send them to the surface before the temperature rises to 200 °F (about 93 °C). Further, they must reach the geyser within 48 hours or the water for the geyser will have evaporated. They build a raft and begin crossing the underground ocean, but soon encounter a pack of Xiphactinus. They use makeshift clubs to bat them away, then a shoal of Elasmosaurus attacks the Xiphactinus, allowing the trio to escape. The raft's sail becomes loose. Sean tries to hold on, but is blown away and separated from the two adults.\n\nA little bird guides Sean towards the river. Meanwhile, Trevor and Hannah decide to take a rest, but are attacked by carnivorous plants. Hannah is captured and being strangled by the plants. Trevor defeats the plant that is holding Hannah by the neck, and they continue towards the geyser.\n\nWhen they arrive at the river Trevor calls out to Sean but gets no response. Trevor says he is going to look for Sean, but tells Hannah she should continue on to the geyser and save herself. Before he goes, Hannah kisses Trevor just in case he does not return. Meanwhile, Sean has entered an arid, bone-filled land. He hears roars, looks up and sees a Giganotosaurus coming after him. Trevor saves him. When they get to a river, they find Hannah sailing a boat fashioned from a Tyrannosaurus skull. They sail to a volcano with magma rising in its crater. They are too late; the water needed for the geyser has evaporated.\n\nSean notices that the crater walls are wet. Trevor hears water flowing on the other side of the walls and sees that the crater walls contain magnesium. After Trevor uses a flare to ignite the magnesium, a geyser shoots them up and out of the Center of the Earth. They emerge from the volcano. When they fall, they accidentally destroy some of the vines in a vineyard. To make amends with the vineyard's farmer, Sean gives the owner a diamond that he found while in the center of the Earth. Trevor sees that Sean has many more diamonds in his backpack.\n\nTrevor later uses them to fund his late brother's laboratory. During the adventure, Hannah and Trevor gradually become closer and eventually share a kiss. After the adventure, Sean visits Trevor and Hannah in their new home purchased using some of the diamonds Sean took from the cave. Trevor hands Sean a book about another strange land, Atlantis: The Antediluvian World by Ignatius L. Donnelly, and suggests they get together during Sean's Christmas break. Sean reveals that he has brought the little bird back from the center of the Earth to keep as a pet. However, the bird happily flies away.",
  "synopsis": null
}