{
  "imdb_id": "tt2058024",
  "tmdb_id": "76470",
  "douban_id": null,
  "title": "Nasi Lemak 2.0 (2011)",
  "genres": [
    "Comedy"
  ],
  "country": "Malaysia",
  "version": [],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm4671471",
      "name": "Namewee"
    }
  ],
  "writer": [
    {
      "id": "nm4671471",
      "name": "Namewee",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4675710",
      "name": "Karen Kong",
      "character": "Xiao K"
    },
    {
      "id": "nm1767971",
      "name": "Adibah Noor",
      "character": "Kak Noor"
    },
    {
      "id": "nm4675232",
      "name": "David Arumugam",
      "character": "Curry Master       (as Dato David Arumugam)"
    },
    {
      "id": "nm0789495",
      "name": "Afdlin Shauki",
      "character": "Fisherman"
    },
    {
      "id": "nm4675414",
      "name": "Dennis Lau",
      "character": "Lan Qiao"
    },
    {
      "id": "nm4675193",
      "name": "Chee",
      "character": "Baba"
    },
    {
      "id": "nm1012525",
      "name": "Yuhang Ho",
      "character": ""
    },
    {
      "id": "nm4675195",
      "name": "Kong Karen",
      "character": "Xiao K"
    },
    {
      "id": "nm4675223",
      "name": "Kenny",
      "character": "Nyonya"
    },
    {
      "id": "nm4675202",
      "name": "Dennis Lau",
      "character": "Lan Qiao"
    },
    {
      "id": "nm1356503",
      "name": "Seng Tat Liew",
      "character": ""
    },
    {
      "id": "nm4724199",
      "name": "Mohamad Nadzif",
      "character": "Security Guard"
    },
    {
      "id": "nm4671471",
      "name": "Namewee",
      "character": "Chef Huang"
    },
    {
      "id": "nm4675199",
      "name": "Reshmonu",
      "character": "Hero Resh"
    },
    {
      "id": "nm4675206",
      "name": "Nadine Ann Thomas",
      "character": "Curry Daughter"
    }
  ],
  "overview": "Young Chef Huang (Namewee) struggles to get his restaurant business going because he cannot adapt to the “localised’ cooking his patrons are looking for. However, despite his unpopular cuisine, he is well-known as Hero Huang in the local neighbourhood where he carries out good deeds by helping the community – that is, until he met Xiao K (Karen Kong) who gets him in deep trouble. So as to get his life and the restaurant business back on track, Chef Huang must now seek help from a mysterious hawker stall lady (Adibah Noor), who summons him to embark on the extraordinary journey. He is to meet many ‘local heroes’ who will help him rediscover his roots and the hidden message of ‘Nasi Lemak’.",
  "storyline": "Young Chef Huang (Namewee) struggles to get his restaurant business going because he cannot adapt to the 'localized' cooking his patrons are looking for. However, contradictory to his unpopular cuisine, he is also well-known as 'Hero Huang' in the local neighborhood where he carries out good deeds in helping the community until he met Xiao K (Karen Kong) who got him into deep trouble. In order to get his life and the restaurant business back on track, Chef Huang must now seek help from a mysterious hawker stall lady (Adibah Noor), who summons him to embark on the extraordinary journey of his life. During this self-enlightening experience, he will also meet many 'local heroes' each lending their support to help him re-discover his roots and the real hidden message of 'Nasi Lemak'.",
  "plot": "A young chef, Huang Da Xia (Wee Meng Chee) struggles to get his restaurant business going. His restaurant is unpopular because he cannot adapt to the \"localized\" cooking his patrons are looking for. However, contradicting his unpopular cuisine, he is also well known as \"Hero Huang\" in the local neighborhood, because he carries out good deeds in helping the community, including filming videos and putting them on his YouTube account. One day, he meets Xiao K (Karen Kong), who asks for his help. Xiao K's father, owner of a famous Chinese restaurant, is fighting with her aunt for the ownership of the restaurant. After some complicated discussions, they decide to hold a contest to see who can cook the best Chinese dish. Desperate to get his life and the restaurant business back on track, Chef Huang decides to help Xiao K. Huang seeks help from a mysterious hawker stall lady (Adibah Noor), who summons him to embark on an extraordinary journey of his life. During this self-enlightening experience, he will also meet many \"local heroes\", each lending their support to help him rediscover his roots and the real hidden message of \"Nasi Lemak\".",
  "synopsis": null
}