{
  "imdb_id": "tt2099673",
  "tmdb_id": "102156",
  "douban_id": null,
  "title": "Dark Watchers: The Women in Black (Video 2012)",
  "genres": [
    "Sci-Fi"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 1.8,
  "director": [
    {
      "id": "nm3032813",
      "name": "Philip Gardiner"
    }
  ],
  "writer": [
    {
      "id": "nm3032813",
      "name": "Philip Gardiner",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3767168",
      "name": "Melanie Denholme",
      "character": "Alexis"
    },
    {
      "id": "nm4752987",
      "name": "Val Monk",
      "character": "Sammy"
    },
    {
      "id": "nm4753224",
      "name": "Luana Ribeira",
      "character": "Lorna       (as Eirian Cohen)"
    },
    {
      "id": "nm4782699",
      "name": "Lee Roberts",
      "character": "Terry"
    },
    {
      "id": "nm4753050",
      "name": "Rudy Barrow",
      "character": "Man in Black"
    },
    {
      "id": "nm4220367",
      "name": "Thomas Gleba",
      "character": "Podcaster"
    },
    {
      "id": "nm4215280",
      "name": "James Earnshaw",
      "character": "Abductee"
    },
    {
      "id": "nm4471991",
      "name": "Jessica Messenger",
      "character": "Girl"
    },
    {
      "id": "nm5462933",
      "name": "Nikki Webster",
      "character": "Alien Being"
    }
  ],
  "overview": "More and more UFO sightings occur every day. Across the globe people are losing time, friends and loved ones disappear, while the Men in Black are perpetually lurking in the background. In a sleepy seaside village, three women search the skies for a sighting of a UFO that is repeatedly haunting the area. Every day they venture out until one day they return having completely lost 4 hours from their lives. Their need to understand the UFO's and why they are here opens a world they could never have imagined and takes them into the heart of a dark and secretive universe populated by the Men in Black. Coming face to face with the unknown, they begin to realize that they have been profoundly affected by their encounter. To make matters worse, they begin to evolve into something amazing, yet horrifying - something beyond their worst nightmares. Beware the Dark Watchers. Written by Philip Gardiner",
  "storyline": "More and more UFO sightings occur every day. Across the globe people are losing time, friends and loved ones disappear, while the Men in Black are perpetually lurking in the background. In a sleepy seaside village, three women search the skies for a sighting of a UFO that is repeatedly haunting the area. Every day they venture out until one day they return having completely lost 4 hours from their lives. Their need to understand the UFO's and why they are here opens a world they could never have imagined and takes them into the heart of a dark and secretive universe populated by the Men in Black. Coming face to face with the unknown, they begin to realize that they have been profoundly affected by their encounter. To make matters worse, they begin to evolve into something amazing, yet horrifying - something beyond their worst nightmares. Beware the Dark Watchers.",
  "plot": null,
  "synopsis": null
}