{
  "imdb_id": "tt2063782",
  "tmdb_id": "64215",
  "douban_id": null,
  "title": "Laddaland (2011)",
  "genres": [
    "Drama",
    "Horror"
  ],
  "country": "Thailand",
  "version": [
    {
      "runtime": "113 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm1637163",
      "name": "Sophon Sakdaphisit"
    }
  ],
  "writer": [
    {
      "id": "nm3761254",
      "name": "Sopana Chaowwiwatkul",
      "description": "screenplay &"
    },
    {
      "id": "nm1637163",
      "name": "Sophon Sakdaphisit",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0762703",
      "name": "Saharat Sangkapreecha",
      "character": "Thee"
    },
    {
      "id": "nm1869505",
      "name": "Piyathida Woramusik",
      "character": "Parn"
    },
    {
      "id": "nm4726726",
      "name": "Sutatta Udomsilp",
      "character": "Nan"
    },
    {
      "id": "nm4726568",
      "name": "Athipich Chutiwatkajornchai",
      "character": "Nat"
    },
    {
      "id": "nm1985584",
      "name": "Deuntem Salitul",
      "character": "Parn's Mother       (as Duentem Salitul)"
    },
    {
      "id": "nm0095465",
      "name": "Sahajak Boonthanakit",
      "character": "Somkiat"
    },
    {
      "id": "nm5683037",
      "name": "Chayanisa Micheli",
      "character": "Nit (Somkiat's Wife)"
    },
    {
      "id": "nm5683022",
      "name": "Theerut Weerawet",
      "character": "Golf"
    },
    {
      "id": "nm5683077",
      "name": "Sasapin Sirivanit",
      "character": "Makhin (Burmese Maid)"
    },
    {
      "id": "nm5683094",
      "name": "Prarames Noiarm",
      "character": "Khun Manop"
    },
    {
      "id": "nm5682909",
      "name": "Jumrern Rattanatangtrakul",
      "character": ""
    },
    {
      "id": "nm5683011",
      "name": "Sasiwan Lertwiriyaprapa",
      "character": ""
    },
    {
      "id": "nm5683003",
      "name": "Pongsuk Herunyapreak",
      "character": "Yoy"
    },
    {
      "id": "nm5683120",
      "name": "Tanabadin Yongseabcart",
      "character": "Security Guard"
    },
    {
      "id": "nm5682964",
      "name": "Somwang Namdoang",
      "character": ""
    },
    {
      "id": "nm5682903",
      "name": "Nuntiya Tongnhu",
      "character": ""
    },
    {
      "id": "nm5682970",
      "name": "Srebao Jaiya",
      "character": ""
    },
    {
      "id": "nm5682913",
      "name": "Kittipong Suptavornnin",
      "character": ""
    },
    {
      "id": "nm5682971",
      "name": "Khuntoon Vittammanon",
      "character": ""
    },
    {
      "id": "nm5683136",
      "name": "Montida Makein",
      "character": ""
    },
    {
      "id": "nm5682946",
      "name": "Arnanya Eiamsherangkoon",
      "character": ""
    },
    {
      "id": "nm5683148",
      "name": "Surapas Laongmanee",
      "character": ""
    },
    {
      "id": "nm5683092",
      "name": "Chaivit Punyavong",
      "character": ""
    },
    {
      "id": "nm5683152",
      "name": "Yoon Jung Chang",
      "character": ""
    },
    {
      "id": "nm5683099",
      "name": "Arpatsara Lertprasert",
      "character": ""
    },
    {
      "id": "nm5683019",
      "name": "Saharath Jiemprasertboon",
      "character": ""
    },
    {
      "id": "nm5682981",
      "name": "Baworndech Theankajang",
      "character": ""
    },
    {
      "id": "nm5682944",
      "name": "Worawee Kanamsri",
      "character": ""
    },
    {
      "id": "nm5683113",
      "name": "Tossapol Pingjan",
      "character": ""
    },
    {
      "id": "nm5683137",
      "name": "Vattanachai Teedaycha",
      "character": ""
    },
    {
      "id": "nm5683004",
      "name": "Supituck Chatsureyawong",
      "character": ""
    },
    {
      "id": "nm5574440",
      "name": "Suthep Sukantarporn",
      "character": ""
    },
    {
      "id": "nm5682915",
      "name": "Chuchat Arntip",
      "character": ""
    },
    {
      "id": "nm1741007",
      "name": "Joe Thomas",
      "character": "Somkiat       (voice)"
    }
  ],
  "overview": "A family moves into a new house where they gradually begin to encounter paranormal and horror events.",
  "storyline": "When a family moves to Laddaland, an upscale housing development with large, beautiful homes, they discover life in their new neighborhood isn't so perfect when they encounter a series of terrifying, paranormal events that drives the family to the edge of insanity.This is a short description of the content.",
  "plot": "Thee, a struggling 40-year-old marketing officer, moves from Bangkok to Laddaland, an upmarket housing estate located in Chiang Mai, bringing along his wife, Parn, his rebellious teenage daughter, Nan, and lively young son, Nat. Thee is certain that the move is the best option to answer all of his financial problems relating to the company he works for, which sells dietary supplements, despite his wife's concern over the hefty mortgage payments required to purchase the new house. Thee also hopes to mend his relationship with Nan, who is resentful of her parents due to spending much of her life with her maternal grandmother as per an agreement between Thee and Parn's mother — Nan was born out of wedlock when her parents were still in high school, and Parn's mother, who never accepts Parn's relationship with Thee, demands Nan in return for their continued relationship. Nan is unimpressed despite Thee's best efforts to make good of the situation and wishes to return to her grandmother.\n\nWhile Laddaland appears to be a relatively ordinary, if quiet, neighborhood, Thee and his family realize that something is wrong with the environs, since the place seems to sow discord on the families to commit violence. A Burmese housemaid is found dead in a grisly murder. Somkiat, Thee's next-door neighbor, regularly beats his wife and son while mistreating his elderly mother; the entirety of the family eventually perish when Somkiat commits murder suicide, with his son's death being the most horrific as he disfigures his face by vertically cutting it. Meanwhile, Nan experiences supernatural phenomena when she is swayed by her friends to visit the house where the Burmese maid was killed, but Thee's inability to believe them causes her to move to her boarding school until the end of her term. Thee and Parn also eventually succumb to the discord, Thee because of his discovery that his company is a fraud and his boss is taking away all of his money, forcing him to work in odd jobs such as being a shop clerk, and Parn because of the stress of Nan's absence and her own supernatural experiences. Nat is the only one who remains uncorrupted from the violence and is happy to live there, but his friendship with an imaginary friend that turns out to be Somkiat's deceased son only worries Parn even further.\n\nThe dysfunction reaches its nadir when Nan, on the day of her return from boarding school, is haunted by the spirit of Somkiat's wife and mother next door and has to stay at a mental hospital so she can be calmed down. Parn lashes out at Thee and says that she and the children will move back to her mother. Thee discovers Nat missing that night and searches Somkiat's house, where he is haunted by the spirit of Somkiat's son. He is followed by Parn, who finds Thee shooting at a wardrobe where Nat is hiding in his hide-and-seek game with Somkiat's son. Nat survives the shot, but Thee, thinking that he had killed his son, commits suicide.\n\nParn drives her children back to her mother in Bangkok after the tragedy. She recounts to Nan of how she became accustomed to Thee, how she lost her dreams when she discovered her pregnancy, and how in spite of everything, Thee always tries to do his best and love his family. The film ends with flashbacks showing Thee and his family in happier times.",
  "synopsis": null
}