{
  "imdb_id": "tt2081311",
  "tmdb_id": "128276",
  "douban_id": null,
  "title": "May I Kill U? (2012)",
  "genres": [
    "Comedy",
    "Horror",
    "Thriller"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "87 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm0005614",
      "name": "Stuart Urban"
    }
  ],
  "writer": [
    {
      "id": "nm0005614",
      "name": "Stuart Urban",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0084107",
      "name": "Kevin Bishop",
      "character": "Baz"
    },
    {
      "id": "nm1660027",
      "name": "Jack Doolan",
      "character": "Seth"
    },
    {
      "id": "nm0053384",
      "name": "Frances Barber",
      "character": "Bernice"
    },
    {
      "id": "nm4265324",
      "name": "Hayley-Marie Axe",
      "character": "Val"
    },
    {
      "id": "nm2767754",
      "name": "Kasia Koleczek",
      "character": "Maya"
    },
    {
      "id": "nm0494863",
      "name": "Rosemary Leach",
      "character": "Mags"
    },
    {
      "id": "nm1736914",
      "name": "Ali Craig",
      "character": "Andy"
    },
    {
      "id": "nm3656001",
      "name": "Rachael Evelyn",
      "character": "Tracy"
    },
    {
      "id": "nm4716561",
      "name": "Israel Oba",
      "character": "Clark       (as Tyson Oba)"
    },
    {
      "id": "nm4750188",
      "name": "Jessica Jackson-Smith",
      "character": "Mandy"
    },
    {
      "id": "nm3868545",
      "name": "Margarita Nazarenko",
      "character": "Trafficked Woman"
    },
    {
      "id": "nm3712363",
      "name": "Kimberley Drew",
      "character": "Police Shooter 2"
    },
    {
      "id": "nm4753756",
      "name": "Bethen Thorpe",
      "character": "Lesbian Mum"
    },
    {
      "id": "nm5097832",
      "name": "Bitzy Au",
      "character": "(voice)"
    },
    {
      "id": "nm4018355",
      "name": "Ellie Badcock",
      "character": "Girl"
    },
    {
      "id": "nm4360198",
      "name": "Katharine Blackshaw",
      "character": "Plain Clothes Police Officer"
    },
    {
      "id": "nm0095613",
      "name": "Julian Boote",
      "character": "Scene Of Crime Officer"
    },
    {
      "id": "nm3455740",
      "name": "Tom Cheshire",
      "character": "Police Shooter"
    },
    {
      "id": "nm4632179",
      "name": "Leon Corbin",
      "character": "Cafe goer"
    },
    {
      "id": "nm4701008",
      "name": "Chris Cowlin",
      "character": "Prison Officer"
    },
    {
      "id": "nm4871184",
      "name": "Adam Damerell",
      "character": "Police Officer"
    },
    {
      "id": "nm3764730",
      "name": "Gregoire de Langlade",
      "character": "Scene of Crime Officer"
    },
    {
      "id": "nm4546320",
      "name": "Kirsty Dilley",
      "character": "Tracy's Female Friend"
    },
    {
      "id": "nm4566494",
      "name": "John Duggan",
      "character": "Police Officer"
    },
    {
      "id": "nm5147370",
      "name": "Lamb Felicity",
      "character": "Paramedic"
    },
    {
      "id": "nm4870817",
      "name": "John Gilmour",
      "character": "Police Sergeant"
    },
    {
      "id": "nm4730403",
      "name": "Martha Grace",
      "character": "Trafficked Girl"
    },
    {
      "id": "nm6560350",
      "name": "Sabine Gruchet",
      "character": "Control Centre Policewoman"
    },
    {
      "id": "nm4703646",
      "name": "Lucinda Jubb",
      "character": "Girl"
    },
    {
      "id": "nm4768960",
      "name": "Victor Konstantine",
      "character": "Boris"
    },
    {
      "id": "nm4069122",
      "name": "Benjayx Murphy",
      "character": "Member Of The 'Why I Hate The Police' Meeting"
    },
    {
      "id": "nm4870854",
      "name": "Abukar Osman",
      "character": "Somali Youth"
    },
    {
      "id": "nm4739284",
      "name": "Anna Maria Pankova",
      "character": "Trafficked Girl"
    },
    {
      "id": "nm0765398",
      "name": "Michael Sarne",
      "character": "Shabby Man"
    },
    {
      "id": "nm0769018",
      "name": "Frank Scantori",
      "character": "White Van Man"
    },
    {
      "id": "nm2541371",
      "name": "Suresh Sippy",
      "character": "Asian Shopkeeper"
    },
    {
      "id": "nm5157380",
      "name": "Neil Alexander Smith",
      "character": "Anti-Police Protester"
    },
    {
      "id": "nm4261365",
      "name": "Anna Stephenson",
      "character": "Riot Police"
    },
    {
      "id": "nm1193181",
      "name": "David Urban",
      "character": "(voice)"
    },
    {
      "id": "nm4834698",
      "name": "Leah Urban",
      "character": "Ticketed Sloane"
    }
  ],
  "overview": "A PC becomes a vigilante after a head trauma.",
  "storyline": "Baz is one of Britain's new bicycle police, a figure of fun.Â But soon he will turn from cycle cop to psycho-path.Â As riots break out in London, a head injury skews Baz into a vigilante, offering criminals the choice of arrest or death. Baz sees his campaign as lawful killing. Lowlifes who are too stunned, confused, or drunk to argue when he politely asks, \"May I kill you?\" are merrily dispatched. All filmed on the helmet-cam and posted on social networks!Â Using the alter ego @N4cethelaw, Baz acquires thousands more fans with each killing, dispensing justice to scumbags, cleaning up society. In a sudden reversal, Baz is captured by an enraged relative of one of his presumed \"kills\", and faces slaughter or -Â even worse - exposure.",
  "plot": "In 2015, an extraterrestrial race called the Mimics have taken over Continental Europe. Five years later, the United Defense Force has only managed one victory, at Verdun, but has managed to hold the Mimics at the English Channel. In Britain, General Brigham, head of the UDF, orders Major William Cage, a public affairs officer with no combat experience, to cover the next day's massive assault on France. Cage objects to the dangerous assignment and threatens to put the blame on Brigham if the landing fails. Brigham orders the arrest of Cage, who is tasered when he attempts to escape. He awakes in handcuffs at Heathrow Airport. He has been demoted to private, labeled a deserter, and assigned to J Squad (an allusion to the Jade Squad, a joint NYPD-Manhattan district attorney's office probe of crime in Chinatown), under the command of Master Sergeant Farell.\n\nThe invasion proves to be a trap. Cage, despite his inexperience, manages to kill an unusually large Mimic with explosives and dies covered with its blood. He wakes up and finds himself back at Heathrow the previous morning. No one believes his story that the invasion is doomed. Cage repeats the loop of dying on the beach and waking at Heathrow over and over again, becoming more competent in combat and learning to predict what happens. In one loop, he encounters the famous Sergeant Rita Vrataski (the \"Angel of Verdun\") during the invasion. When she sees he knows the movements of an attacking Mimic in advance, she tells him to locate her the next time he \"wakes up\"; they both perish in an explosion.\n\nWhen Cage next awakens, he finds Vrataski. She takes him to Dr. Carter, an expert in Mimic biology. Carter explains that the Mimics are a hive mind: if an \"Alpha\" is killed, the hive queen, the \"Omega\", turns time back a day, thus giving the Mimics a seemingly unbeatable advantage. Cage \"hijacked\" their ability by being doused in Alpha blood. Vrataski had herself gained this ability at Verdun, but lost it by receiving a blood transfusion after being wounded. She tells Cage that they must destroy the Omega.\n\nOver many, many loops, Vrataski trains Cage to fight better. Frustrated by his continued failures, he retreats to London, but discovers the Mimics will attack there after defeating the invasion force. After having a vision of the Omega at a dam in Germany (which Carter said meant that the Omega was trying to locate him) Cage and Vrataski spend many loops figuring out how to get to the dam. Cage comes to know Vrataski, who is humorless and only interested in defeating the Mimics, having lost her loved one to them. Upon reaching a point where she dies whatever they do, Cage decides to hunt the Omega alone. When he reaches the dam, he discovers that it is a trap. Ambushed by an Alpha and another Mimic, Cage drowns himself before the Alpha can bleed him out and destroy his ability to reset time.\n\nCage and Vrataski infiltrate the UK Ministry of Defence to obtain a prototype built by Carter that can locate the Omega. Cage finally persuades General Brigham to give him the device, though his men then try to capture them. Cage discovers the Omega is under the Louvre Pyramid in Paris. However, Cage is captured and seriously injured. He wakes up in a hospital to find he has been given a transfusion, thus stopping him from being able to reset the day.\n\nVrataski frees Cage. They recruit J Squad to help destroy the Omega before the invasion begins. They fly to Paris, where the other soldiers sacrifice themselves so Cage and Vrataski can get into the Louvre. Just before luring away an Alpha standing between them and the submerged Omega, Vrataski kisses Cage to thank him for getting her as far as he did. The Alpha kills Vrataski and mortally wounds Cage, but he manages to drop a belt of grenades, killing the Omega.\n\nThe dying Cage floats down through the water into the Omega's blood. He awakens en route to his first meeting with Brigham. Brigham announces on TV that Mimic activity has ceased following a mysterious energy surge in Paris. Cage, still a Major, goes to Heathrow to find Vrataski. She greets him rudely, just like in previous loops, to his amusement.",
  "synopsis": null
}