{
  "imdb_id": "tt2023561",
  "tmdb_id": "195677",
  "douban_id": null,
  "title": "La patente (2011)",
  "genres": [
    "Comedy"
  ],
  "country": "Italy",
  "version": [
    {
      "runtime": "86 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm3501582",
      "name": "Alessandro Palazzi"
    }
  ],
  "writer": [
    {
      "id": "nm3501582",
      "name": "Alessandro Palazzi",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm2948340",
      "name": "Andrea De Bruyn",
      "character": "Rolando"
    },
    {
      "id": "nm4569427",
      "name": "Ernesto de Stefano",
      "character": "Sergio"
    },
    {
      "id": "nm5155479",
      "name": "Isabel Gondim",
      "character": "Giulia"
    },
    {
      "id": "nm5155547",
      "name": "Matteo Lombardi",
      "character": "Tonino"
    },
    {
      "id": "nm5155508",
      "name": "Emanuele Beffa",
      "character": "Piero"
    },
    {
      "id": "nm5155583",
      "name": "Jin Liyu",
      "character": "Liyu Jin"
    },
    {
      "id": "nm4903088",
      "name": "Daniele Grifoni",
      "character": "Alessandro"
    },
    {
      "id": "nm5155554",
      "name": "Arianna Di Stefano",
      "character": "Serena"
    },
    {
      "id": "nm4522432",
      "name": "Robert Cervantes",
      "character": "Armando"
    },
    {
      "id": "nm4947268",
      "name": "Lucia Rossi",
      "character": "Mina"
    },
    {
      "id": "nm0041054",
      "name": "Roberto Attias",
      "character": "Vito"
    },
    {
      "id": "nm5155576",
      "name": "Palma Spina",
      "character": "Mariella"
    },
    {
      "id": "nm4655404",
      "name": "Michele Ferrarese",
      "character": "Renatino"
    },
    {
      "id": "nm4705712",
      "name": "Mattia Stancanelli",
      "character": "Pino Sgommino"
    }
  ],
  "overview": "\"The License\" is a modern-day ensemble comedy revolving around the lives of two Roman slackers. Rolando, thirty-something and perpetually unsatisfied, works at his future father-in-law's driving school, and Sergio is a waiter at the corner café as well as a small-time drug dealer. Thanks to the unexpected death of the elderly owner, they end up taking control of the driving school during the pivotal week before the final driving test.",
  "storyline": "\"The License\" is a modern-day ensemble comedy revolving around the lives of two Roman slackers. Rolando, thirty-something and perpetually unsatisfied, works at his future father-in-law's driving school, and Sergio is a waiter at the corner café as well as a small-time drug dealer. Thanks to the unexpected death of the elderly owner, they end up taking control of the driving school during the pivotal week before the final driving test. The driving school acts as a backdrop for the aspirations and problems of the students: Armando, a Filipino butler oppressed by his elderly \"boss lady\" who pressures him into getting a license so he can be her chauffeur as well; LiyuJin, a Chinese student who comes to class each time with a different look and a different \"business\"; Giulia, a Brazilian trannie in search of a more normal life; and Alessandro and Serena, 18-year-olds grappling with their first love story. Characters of all ages and from all walks of life, future drivers and their unlikely ...",
  "plot": null,
  "synopsis": "The License is a modern-day ensemble comedy revolving around the lives of two Roman slackers.\nRolando, thirty-something and perpetually unsatisfied, works at his future father-in-laws driving school, and Sergio is a waiter at the corner café as well as a small-time drug dealer.\nThanks to the unexpected death of the elderly owner, they end up taking control of the driving school during the pivotal week before the final driving test.\nThe driving school acts as a backdrop for the aspirations and problems of the students: Armando, a Filipino butler oppressed by his elderly boss lady who pressures him into getting a license so he can be her chauffeur as well; LiyuJin, a Chinese student who comes to class each time with a different look and a different business; Giulia, a Brazilian trannie in search of a more normal life; and Alessandro and Serena, 18-year-olds grappling with their first love story.\nCharacters of all ages and from all walks of life, future drivers and their unlikely instructors, come together to create a reality that borders on grotesque, yet feels incredibly familiar.\nThe film ironically and lightheartedly tackles interpersonal and social relationships and the inevitable clashes in group dynamics. It touches on important issues like integration in present-day Italy, and gender roles, while never losing its comic tone."
}