{
  "imdb_id": "tt2018164",
  "tmdb_id": "238560",
  "douban_id": null,
  "title": "Under Snow (2011)",
  "genres": [
    "Documentary"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "108 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm0653200",
      "name": "Ulrike Ottinger"
    }
  ],
  "writer": [
    {
      "id": "nm0653200",
      "name": "Ulrike Ottinger",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4647412",
      "name": "Setsuko Arakawa",
      "character": ""
    },
    {
      "id": "nm4624257",
      "name": "Kiyotsugu Fujima",
      "character": ""
    },
    {
      "id": "nm4638380",
      "name": "Takamasa Fujima",
      "character": ""
    },
    {
      "id": "nm4639696",
      "name": "Hiroomi Fukuzawa",
      "character": ""
    },
    {
      "id": "nm4626541",
      "name": "Nori Katsumata",
      "character": ""
    },
    {
      "id": "nm0559837",
      "name": "Eva Mattes",
      "character": "Narrator       (voice)"
    },
    {
      "id": "nm4633180",
      "name": "Akemi Takanami",
      "character": ""
    },
    {
      "id": "nm3508193",
      "name": "Yumiko Tanaka",
      "character": ""
    },
    {
      "id": "nm4652072",
      "name": "Yoko Tawada",
      "character": ""
    },
    {
      "id": "nm4625983",
      "name": "Toru Yoshihara",
      "character": ""
    }
  ],
  "overview": "In Echigo in Japan the snow often lies several feet deep well into May covering landscape and villages. Over the centuries the inhabitants have organised their lives accordingly. In order to record their very distinctive forms of everyday life, their festivals and religious rituals Ulrike Ottinger journeyed to the mythical snow country – accompanied by two Kabuki performers. Taking the parts of the students Takeo and Mako they follow in the footsteps of Bokushi Suzuki who in the mid-19th century wrote his remarkable book “Snow Country Tales”.",
  "storyline": "In Echigo in Japan the snow often lies several feet deep well into May covering landscape and villages. Over the centuries the inhabitants have organized their lives accordingly. In order to record their very distinctive forms of everyday life, their festivals and religious rituals Ulrike Ottinger journeyed to the mythical snow country - accompanied by two Kabuki performers. Taking the parts of the students Takeo and Mako they follow in the footsteps of Bokushi Suzuki who in the mid-19th century wrote his remarkable book \"Snow Country Tales\". A beautiful vixen fox leads the two protagonists astray and they undergo a wondrous metamorphosis. As a man and woman of the Edo period they now travel through the past and again and again encounter the present: Temple children build the holy mountain Fuji-san out of snow; a woman weaver, producing flimsy crepe in the icy cold, is haunted by an evil mountain demon; at the festival of the gods of paths and roads the rice straw pyramid with New ...",
  "plot": "In the poor Adelaide suburb of Salisbury North, 16-year-old Jamie (Lucas Pittaway) lives with his distressed mother, Elizabeth Harvey (Louise Harris), and his brothers — including Troy (Anthony Groves), who rapes Jamie. One day, his mother's boyfriend takes indecent photographs of the boys. When the police are reluctant to intervene, Elizabeth is contacted by Barry (Richard Green), a gay man who introduces her to John (Daniel Henshall). John, who despises paedophiles and homosexuals, continually harasses the boyfriend until he moves away. John begins to assume the role of Jamie's father figure. Barry tells John the names and addresses of paedophiles in the area, and John creates a wall with pictures and details about each, including notes saying things like \"I'm coming for you\".\n\nJamie finds himself slowly drawn into John's homophobic and violent tendencies, unable to escape his charismatic and intimidating dominance. On one occasion, he has Jamie shoot his dog. John meanwhile influences the rest of the neighbourhood with his extremely homophobic views, and separates Barry from his younger boyfriend Robert (Aaron Viergever). Only Troy seems to dislike John. Barry soon disappears, leaving behind only an answering machine message saying that he is going to Queensland. John brings Jamie in as the neophyte member of his small team who \"bury men\".\n\nShortly afterward, Jamie visits his drug-addicted best friend Gavin (Bob Adriaens) with John, who takes a dislike to Gavin. Later one night, John and Robert take Jamie into his garden shed and show him the bodies of Barry and Gavin. Distressed, Jamie lashes out at John but remains under his influence. When John learns that Jamie has been abused by Troy, he and Robert torture Troy. Jamie later kills the brutalised Troy in an act of mercy. Now desensitised, Jamie assists John in carrying out several murders. John and his team store the bodies in the vault of an abandoned bank in the town of Snowtown.\n\nJamie is persuaded by John to lure his half-brother Dave (Beau Gosling) to the bank building, ostensibly to look at a computer for sale. Jamie drives with him to the town, vaguely conscious of what he is doing, and leads Dave into the building, where he is met by John and Robert. Unaware of what is going on, Dave watches Jamie shut the door of the bank.\n\nAgainst a black screen, captions reveal that South Australian Police discovered the remains of eight people stored in barrels in the bank vault of Snowtown on 20 May 1999, and, the following day, John Bunting and Robert Wagner were arrested.",
  "synopsis": null
}