{
  "imdb_id": "tt2081274",
  "tmdb_id": "262866",
  "douban_id": null,
  "title": "Armed Response (2013)",
  "genres": [
    "Action",
    "Comedy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.2,
  "director": [
    {
      "id": "nm2312182",
      "name": "Adam Beamer"
    },
    {
      "id": "nm2304734",
      "name": "Evan Beamer"
    }
  ],
  "writer": [
    {
      "id": "nm2312182",
      "name": "Adam Beamer",
      "description": null
    },
    {
      "id": "nm2304734",
      "name": "Evan Beamer",
      "description": null
    },
    {
      "id": "nm2305173",
      "name": "Craig Hildebrand",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0256121",
      "name": "Ethan Embry",
      "character": "Kevin"
    },
    {
      "id": "nm0321591",
      "name": "Michael Gladis",
      "character": "Bruce"
    },
    {
      "id": "nm0245112",
      "name": "Clea DuVall",
      "character": "Lena"
    },
    {
      "id": "nm0000144",
      "name": "Cary Elwes",
      "character": "Joshua"
    },
    {
      "id": "nm0035060",
      "name": "Adam Arkin",
      "character": "Broomhall"
    },
    {
      "id": "nm0000609",
      "name": "Ving Rhames",
      "character": "Officer Hall"
    },
    {
      "id": "nm2105766",
      "name": "Gabriel Morales",
      "character": "Ramiro"
    },
    {
      "id": "nm0641389",
      "name": "Jim O'Heir",
      "character": "Norval"
    },
    {
      "id": "nm0943927",
      "name": "George Wyner",
      "character": "Rafferty"
    },
    {
      "id": "nm0000893",
      "name": "Ed Begley Jr.",
      "character": "Officer Krupke"
    },
    {
      "id": "nm0032628",
      "name": "Amy Aquino",
      "character": "Lena's Mom"
    },
    {
      "id": "nm0000273",
      "name": "Alan Arkin",
      "character": "Officer Riggs"
    },
    {
      "id": "nm0005068",
      "name": "Vinnie Jones",
      "character": "Tillinghast"
    },
    {
      "id": "nm2748450",
      "name": "Daniel Aldema",
      "character": "Hallgrim"
    },
    {
      "id": "nm1964623",
      "name": "Brian Scannell",
      "character": "Officer Muldoon"
    },
    {
      "id": "nm0204544",
      "name": "Edgar L. Davis",
      "character": "Ellis"
    },
    {
      "id": "nm4369276",
      "name": "Adam Bartley",
      "character": "Driscoll"
    },
    {
      "id": "nm4190073",
      "name": "Heath Cullens",
      "character": "Foster"
    },
    {
      "id": "nm2088348",
      "name": "Tom Hornof",
      "character": "Officer Merrigan"
    },
    {
      "id": "nm0227912",
      "name": "Dennis Dion",
      "character": "Bartender"
    },
    {
      "id": "nm3738224",
      "name": "John Rushing",
      "character": "Robert the Waiter"
    },
    {
      "id": "nm4090948",
      "name": "Dave Racki",
      "character": "Officer Cooper"
    },
    {
      "id": "nm3949769",
      "name": "Albert Serrato",
      "character": "Restaurant Owner"
    },
    {
      "id": "nm3851260",
      "name": "Gabe Eggerling",
      "character": "Crying Boy       (as Gabriele Eggerling)"
    },
    {
      "id": "nm4368244",
      "name": "Jennifer Grace Farmer",
      "character": "Rafferty's Wife"
    },
    {
      "id": "nm4726962",
      "name": "Craig Bailey",
      "character": "FBI Guy"
    },
    {
      "id": "nm0529137",
      "name": "Phyllis Lyons",
      "character": "Norval's Wife"
    },
    {
      "id": "nm1759834",
      "name": "Ajibike Adekoya",
      "character": "Suburban Woman"
    },
    {
      "id": "nm4717288",
      "name": "Dave Tavres",
      "character": "Parent"
    },
    {
      "id": "nm4717279",
      "name": "Marie Coatsworth",
      "character": "Parent"
    },
    {
      "id": "nm4754902",
      "name": "Braden Davis",
      "character": "Wealthy Tourist"
    },
    {
      "id": "nm3083311",
      "name": "David Baughman",
      "character": "Bicycle boy"
    },
    {
      "id": "nm0666388",
      "name": "Ross Patterson",
      "character": "St. James St. James"
    },
    {
      "id": "nm1705050",
      "name": "Leonora Pitts",
      "character": "Mom Customer"
    },
    {
      "id": "nm1399969",
      "name": "Scott Pitts",
      "character": "Dad Customer"
    },
    {
      "id": "nm2513386",
      "name": "Elizabeth Regal",
      "character": "Moroccan Lady"
    },
    {
      "id": "nm6787944",
      "name": "L.A. Ross",
      "character": "Background"
    }
  ],
  "overview": "The owners of a failing security company start robbing houses to boost business.",
  "storyline": "When a home security business falls on hard times, the owners decide to start robbing local houses in an attempt to add to their income and create a desperate need for their services. The plan seems to work perfectly until, in an attempt to one-up the competition, they finish a job with more in their haul than they bargained for.",
  "plot": "Andrew Beckett is a senior associate at the largest corporate law firm in Philadelphia. Beckett hides his homosexuality and his status as an AIDS patient from the other members of the firm. On the day Beckett is assigned the firm's newest and most important case, a partner in the firm notices a lesion on Beckett's forehead. Although Beckett attributes the lesion to a racquetball injury, it is actually due to Kaposi's Sarcoma, a form of cancer marked by multiple tumors on the lymph nodes and skin.\n\nShortly thereafter, Beckett stays home from work for several days to try to find a way to hide his lesions. While at home, he finishes the paperwork for the case he has been assigned and then brings it to his office, leaving instructions for his assistants to file the paperwork the following day, which marks the end of the statute of limitations for the case. Later that morning he receives a call asking for the paperwork, as the paper copy cannot be found and there are no copies on the computer's hard drive. The paperwork is finally discovered in an alternate location and is filed with the court at the last possible moment. The following day Beckett is fired by the firm's partners.\n\nBeckett believes that someone deliberately hid his paperwork to give the firm an excuse to fire him, and that the firing is actually as a result of his diagnosis with AIDS. He asks several attorneys to take his case, including personal injury lawyer Joe Miller. The homophobic Miller appears to be worried that he could contract Beckett's illness. After declining to take the case, Miller immediately visits his doctor to find out if he could have contracted the disease. The doctor explains that the routes of HIV infection do not include casual contact.\n\nUnable to find a lawyer willing to represent him, Beckett is compelled to act as his own attorney. While researching a case at a law library, Miller sees Beckett at a nearby table. After a librarian announces that he has found a book on AIDS discrimination for Beckett, others in the library begin to first stare and then move away, and the librarian suggests Beckett retire to a private room. Disgusted by the other people's behavior, Miller approaches Beckett, reviews the material Beckett has gathered, and takes the case.\n\nAs the case goes before the court, the partners of the firm take the stand, each claiming that Beckett was incompetent and that he had deliberately tried to hide his condition. The defense repeatedly suggests that Beckett brought AIDS upon himself by having gay sex, and is therefore not a victim. In the course of testimony, it is revealed that the partner who had noticed Beckett's lesion had previously worked with a woman who had contracted AIDS after a blood transfusion and so should have recognized the lesion as relating to AIDS. According to that partner, the woman was an innocent victim, unlike Beckett, and further testified that he did not recognize Beckett's lesions. To prove that the lesions would have been visible, Miller asks Beckett to unbutton his shirt while on the witness stand, revealing that his lesions are indeed visible and recognizable as such.\n\nBeckett eventually collapses during the trial. After Beckett is hospitalized, the partner who noticed Beckett's lesions confesses that he suspected Beckett had AIDS but never gave him the opportunity to explain himself. During his hospitalization, the jury votes in his favor, awarding him back pay, damages for pain and suffering, and punitive damages. Miller visits the visibly failing Beckett in the hospital after the verdict and overcomes his fear enough to touch Beckett's face. After Beckett's family leaves the room, he tells his partner Miguel that he is ready to die. At the Miller home, Joe and his wife are awakened by a phone call from Miguel, presumably to tell them that Beckett has died. A reception is held at Beckett's home following the funeral, where many mourners, including Miller, view home movies of Beckett as a happy child.",
  "synopsis": null
}