{
  "imdb_id": "tt2091384",
  "tmdb_id": "80539",
  "douban_id": null,
  "title": "Panjaa (2011)",
  "genres": [
    "Action",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "156 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm3315387",
      "name": "Vishnuvardhan"
    }
  ],
  "writer": [
    {
      "id": "nm4738590",
      "name": "Rahul Koda",
      "description": "screenplay"
    },
    {
      "id": "nm2493024",
      "name": "Abburi Ravi",
      "description": "dialogue"
    },
    {
      "id": "nm5897072",
      "name": "Prasad Rishi",
      "description": "dialogue supervisor"
    },
    {
      "id": "nm3315387",
      "name": "Vishnuvardhan",
      "description": "story"
    },
    {
      "id": "nm3315387",
      "name": "Vishnuvardhan",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0436302",
      "name": "Pawan Kalyan",
      "character": "Jai"
    },
    {
      "id": "nm3591549",
      "name": "Sarah-Jane Dias",
      "character": "Sandya"
    },
    {
      "id": "nm4738631",
      "name": "Anjali Lavania",
      "character": "Janvi"
    },
    {
      "id": "nm0006763",
      "name": "Jackie Shroff",
      "character": "Bhagvan"
    },
    {
      "id": "nm0474609",
      "name": "Atul Kulkarni",
      "character": "Kulkarni"
    },
    {
      "id": "nm0103977",
      "name": "Brahmanandam",
      "character": "Paparayudu"
    },
    {
      "id": "nm0019382",
      "name": "Ali",
      "character": "Chotu"
    },
    {
      "id": "nm1759615",
      "name": "Subbaraju",
      "character": "Ashok"
    },
    {
      "id": "nm3414188",
      "name": "Adivi Sesh",
      "character": "Munna"
    },
    {
      "id": "nm1219922",
      "name": "Jhansi",
      "character": "Laxmi"
    },
    {
      "id": "nm0080238",
      "name": "Tanikella Bharani",
      "character": "Guruvayya"
    },
    {
      "id": "nm0664085",
      "name": "Venkateswara Rao Paruchuri",
      "character": "Sabhapathi"
    },
    {
      "id": "nm3164292",
      "name": "Sampath Raj",
      "character": "Sampath       (as Sampath)"
    },
    {
      "id": "nm4442569",
      "name": "Joy Badlani",
      "character": "Rahul"
    }
  ],
  "overview": "The story begins in Kolkata and here the mafia don Bhagawan (Jackie shroff) is ruling the roost. He has a loyal aide in the form of Jai who keeps protecting him from many dangers.. Kulakarni (Atul Kulakarni) is the rival of Bhagavan. Jai has a friend named Jahnavi (Anjali Lavania) who is a club dancer. . The story takes a turn with the arrival of Munna (adivi sesh), an arrogant and highly impatient guy who is also the son of Bhagawan.After few incidents munna killed by Jai. After Jai becomes the prime target for Bhagavan. What happens next is to be seen on the screen.",
  "storyline": "Jai, an orphan, is taken in and nurtured into a hitman by a gangster named Bhagwan. When not busy kicking the hell out of rival gangs, he escapes his lovelorn life by running a nursery with his pal Chotu. Meanwhile, Jai runs into a Greenpeace activist Sandhya and sparks fly between the duo. When Jai couldn't bear Munna's manic activities, he confronts him. Bhagawan, father of Munna is enraged and is hell bent on revenge. An ultimate face-off between loyalty and morals ensues.",
  "plot": "Radha Mohan and Krishna Veni are a couple leading a miserable marital life due to several misunderstandings and decide to apply for divorce. They die on 14 February 1983 at 10:20 AM near a clock tower on their way to the lawyer's office. Their son, Nageswara Rao, becomes a rich and influential businessman and happens to come across his parents' lookalikes, Nagarjuna and Priya. After befriending them, Rao decides to re-establish them as a couple but is shocked when Nagarjuna introduces his lover, Prema. Rao manages to dissolve the relationship with the help of his personal adviser, Girish Karnad. Unaware of this, Nagarjuna swears not to fall in love with anyone. At the same clock tower, Rao meets Dr. Anjali and falls in love with her at first sight. He helps her in admitting an injured old man to a nearby hospital and donates his blood. The injured man, Chaitanya, is shocked upon seeing the pair as they resemble his deceased parents, Seetharamudu and Ramalakshmi.\n\nSeetharamudu was a barrister who returned from London upon his father's death to manage his family businesses. He was a zamindar and was fond of cars. In one such instance, he sees a poor farmer Ramalakshmi and decides to marry her. Asked by a mediator, she accepts the proposal, without meeting Seetharamudu, but asks him for six months' delay as she has to buy new clothes for the bridegroom, following the village's tradition. Seetharamudu learns about this and meets her as a reformed thief. With his help, Ramalakshmi could cultivate enough grain in three months and buy new clothes with that money. On the day of marriage, she is surprised to know that Seetharamudu is her chosen groom and they marry. On 14 February 1924 the couple goes out, but Chaitanya, suffering from fever then, fakes a stomach ache so that his parents return. The plan works and the couple rush home at high speed but die in an accident at 10:20 AM near the same clock tower where Radha Mohan and Krishna Veni would die. Now he aims to reunite them without letting them recollect their past as they cannot bear the pain of losing him.\n\nChaitanya stays in Rao's house for further treatment while Nagarjuna joins them as he was expelled from his hostel. One night, Priya, remembering her past life, visit Rao's house, only to see Nagarjuna sleeping beside him. She leaves the house in tears. While Rao's attempts to propose to Anjali begin, Nagarjuna and Priya join Salsa dance classes where Priya constantly expresses her anger towards Nagarjuna. On Rao's birthday, 13 February 2013, Anjali proposes to him which he accepts. This makes Chaitanya very happy. Priya meets Nagarjuna there who is dressed as Radha Mohan, who reveals that he too recollected memories of his past life on the night she left the house in shock. He apologises for his wrong deeds and proposes her. She accepts his proposal and Rao is relieved.\n\nThe next day, Nagarjuna goes to a temple with Priya in a car which has no brakes and Rao chases them along with Anjali. Both the couples are nearing the same clock tower where they died in their past lives. A worried Chaitanya is offered a lift by a young biker who follow them. On 10:20 AM when all the four are safe near the clock tower, a lorry driven by a drunk driver is shown rushing towards them. The biker and Chaitanya jump from the bike, which goes on to hit the lorry tyre, distracting the lorry's path. The four thank Chaitanya who urges them to thank the biker, Akhil.",
  "synopsis": "Jai (Pawan Kalyan) is an accomplished hitman and the most trusted aide of Bhagavan (Jackie Shroff), the supreme don of Kolkata. Jai remains loyal to him as he helped in seeking revenge with the people who raped his mother and sister when he came to Kolkata in his childhood after his father's death. They share a business rivalry with Kulkarni (Atul Kulkarni), who aims to overthrow Bhagavan. Things are smooth until Bhagwan's son Munna (Adivi Sesh) returns to India. He is a psychotic and highly impulsive youngster. He has his eyes on club dancer Jahnavi (Anjali Lavania), but she rejects him as she adores Jai. Meanwhile, Jai comes across Sandhya (Sarah-Jane Dias), a soft-spoken environmentalist and tree lover. A mutual admiration for each other leads to a romantic involvement between the two. Munna, however, continues to go crazy about Jahnavi, and a tragedy ensues.Sabhapathi (Paruchuri Venkateswara Rao) works for Bhagavan. Munna mistreats Sabhapathi, but Bhagavan does not care. Sabhapathi joins Kulkarni's gang to protect himself. Jai kidnaps Sampath's (Sampath Raj) son. Munna kills Sampath's son due to laughter over Jahnavi loving Jai. Munna confronts Jahnavi at Jai's apartment and brutally murders her. Jai kills Munna by throwing him from his flat. This scene is seen by Guravayya (Tanikella Bharani), an associate of Bhagavan who is an informer to Kulkarni. He reports this to Bhagavan to get rid of Jai.Jai is forced to decide whether to retaliate or leave Kolkata completely. He chooses to leave out of loyalty to Bhagavan and heads to Palasa, Sandhya's village where her brother Ashok (Subbaraju) is a valiant, kindhearted cop. He comes across S. I. Paparayudu (Brahmanandam), and he solves the problems of the village by cleverly using Paparayudu. Jai cannot hide the truth from Sandhya anymore. He tells her about his life in Kolkata and that he made it look like that Paparayudu solved the village's problems. Since Jai told the truth, Sandhya still loves him.On the other hand, Bhagavan cannot rest until he seeks out Jai for revenge. Firstly, he kills Chotu (Ali), Jai's best friend and associate. Meanwhile, Sandhya gets kidnapped and taken to Kolkata. In a fit of rage at losing Chotu and Sandhya, Jai returns to Kolkata and starts hunting his rivals. He goes to Kulkarni's house with heavy ammunition and kills everyone except Kulkarni, as Jai promised him that he would not kill him. Kulkarni dies in his attempt to kill Jai. Later, Jai kills Guruvayya, as he gets information that the latter was responsible for this saga. At last, Jai reaches Bhagavan, who kidnapped Sandhya. Although Jai tells Bhagavan that Munna killed Jahnavi, Bhagavan still believes that Jai should not have murdered Munna. After an emotional sequence, Jai shoots Bhagavan in his chest as the latter shoots Sandhya. Sandhya survives, but Bhagavan dies. Jai unites with Sandhya, and they both start a new and happy life."
}