{
  "imdb_id": "tt2007993",
  "tmdb_id": "98344",
  "douban_id": "10450409",
  "title": "Warriors of the Rainbow: Seediq Bale I (2011)",
  "genres": [
    "Action",
    "Drama",
    "History"
  ],
  "country": "Taiwan",
  "version": [
    {
      "runtime": "144 min",
      "description": ""
    },
    {
      "runtime": "154 min",
      "description": "international"
    },
    {
      "runtime": "156 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.5,
  "director": [
    {
      "id": "nm0917669",
      "name": "Te-Sheng Wei"
    }
  ],
  "writer": [
    {
      "id": "nm0917669",
      "name": "Te-Sheng Wei",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm4595384",
      "name": "Nolay Piho",
      "character": "Mona Rudao"
    },
    {
      "id": "nm2208579",
      "name": "Chih-Hsiang Ma",
      "character": "Temu Walis       (as Umin Boya)"
    },
    {
      "id": "nm0027942",
      "name": "Masanobu Andô",
      "character": "Genji Kojima, Constable at Tonbara clan"
    },
    {
      "id": "nm0442754",
      "name": "Sabu Kawahara",
      "character": "General Yahiko Kamada"
    },
    {
      "id": "nm0398852",
      "name": "Vivian Hsu",
      "character": "Obing Tadao aka Hatsuko Takayama"
    },
    {
      "id": "nm4629744",
      "name": "Mei-Ling Lo",
      "character": "Obing Nawi aka Hanako Kawano"
    },
    {
      "id": "nm2639075",
      "name": "Landy Wen",
      "character": "Mahung Mona (Mona's Daughter)"
    },
    {
      "id": "nm4595701",
      "name": "Da-Ching",
      "character": "Mona Rudao - Young"
    },
    {
      "id": "nm6071443",
      "name": "Pawan Nawi",
      "character": "Chief Rudao Luhe, Mona's Father"
    },
    {
      "id": "nm5555540",
      "name": "Yakau Kuhon",
      "character": "Tado Mona (Mona's Eldest Son)"
    },
    {
      "id": "nm5555725",
      "name": "Pawan Neyung",
      "character": "Baso Mona (Mona's Younger Son)       (as Lee Shih-chia)"
    },
    {
      "id": "nm5556203",
      "name": "Yuan-Jie Lin",
      "character": "Pawan Nawi"
    },
    {
      "id": "nm3117467",
      "name": "Chih-Wei Cheng",
      "character": "Biho Sapo"
    },
    {
      "id": "nm4689774",
      "name": "Yi-Fan Hsu",
      "character": "Ichiro Hanaoka aka Dakis Nomin"
    },
    {
      "id": "nm4690048",
      "name": "Soda Voyu",
      "character": "Jiro Hanaoka aka Dakis Nawi"
    },
    {
      "id": "nm6071444",
      "name": "Hayung Gaki",
      "character": ""
    },
    {
      "id": "nm6071445",
      "name": "Bayan Kenbo",
      "character": ""
    },
    {
      "id": "nm6071446",
      "name": "Gaki Baunky",
      "character": ""
    },
    {
      "id": "nm6071447",
      "name": "Laka Umaw",
      "character": ""
    },
    {
      "id": "nm6071448",
      "name": "Yong-cheng Kao",
      "character": ""
    },
    {
      "id": "nm6071449",
      "name": "Teymu Boru",
      "character": ""
    },
    {
      "id": "nm6071450",
      "name": "Bagah Pawan",
      "character": ""
    },
    {
      "id": "nm6071451",
      "name": "Chao-Ming Chin",
      "character": ""
    },
    {
      "id": "nm6071452",
      "name": "Yawei Basang",
      "character": ""
    },
    {
      "id": "nm6071453",
      "name": "Sabulo",
      "character": ""
    },
    {
      "id": "nm6071454",
      "name": "Wei-cheng Chuang",
      "character": ""
    },
    {
      "id": "nm6071455",
      "name": "Jiru Taylung",
      "character": ""
    },
    {
      "id": "nm6071456",
      "name": "Tudaw Macang",
      "character": ""
    },
    {
      "id": "nm6071457",
      "name": "Yumin Silan",
      "character": ""
    },
    {
      "id": "nm6071458",
      "name": "Idi Tusang",
      "character": ""
    },
    {
      "id": "nm6071459",
      "name": "Suyan Masing",
      "character": ""
    },
    {
      "id": "nm1221055",
      "name": "Yûichi Kimura",
      "character": "Satsuka Aisuke"
    },
    {
      "id": "nm0367389",
      "name": "Jun'ichi Haruta",
      "character": "Egawa Hiromichi, Police chief in Wushe area"
    },
    {
      "id": "nm1055827",
      "name": "Minoru Matsumoto",
      "character": "Katsumi Yoshimura, Constable at timber factory"
    },
    {
      "id": "nm6071460",
      "name": "Sonrei Yoshioka",
      "character": "Police"
    },
    {
      "id": "nm3108838",
      "name": "Ju-Lung Ma",
      "character": "Han Chinese Trader"
    },
    {
      "id": "nm0972598",
      "name": "Chie Tanaka",
      "character": "Matsuno Kojima, Wife of Officer Kojima"
    },
    {
      "id": "nm4751846",
      "name": "Chi-Wei Cheng",
      "character": "Wu Jin-dun, the Shop Owner       (as Cheng Chih-wei)"
    },
    {
      "id": "nm3117992",
      "name": "Pong Fong Wu",
      "character": "Taiwanese volunteer armies leader"
    },
    {
      "id": "nm2601626",
      "name": "Dean Fujioka",
      "character": "Miyakawa"
    },
    {
      "id": "nm3082813",
      "name": "Michio Hayashida",
      "character": "Hua-Lien Police Chief"
    },
    {
      "id": "nm1183939",
      "name": "Akira Hibino",
      "character": "General Oshima, Commander of occupying force"
    },
    {
      "id": "nm2948613",
      "name": "Yoshitaka Ishizuka",
      "character": "Yasuichiro Fukabori"
    },
    {
      "id": "nm3117907",
      "name": "Yukihiko Kageyama",
      "character": "Kikukawa"
    },
    {
      "id": "nm1009140",
      "name": "Kenji Kasai",
      "character": ""
    },
    {
      "id": "nm4720068",
      "name": "Junji Kumagai",
      "character": ""
    },
    {
      "id": "nm4514400",
      "name": "Hiroshi Noguchi",
      "character": "Admiral Kabayama Sukenori, Governor-general of Taiwan"
    },
    {
      "id": "nm5900625",
      "name": "Yukiya Oonishi",
      "character": "Officer Nagano"
    },
    {
      "id": "nm0849294",
      "name": "Shiang-Chu Tang",
      "character": "Li, Ching-Fang, Special envoy of China"
    },
    {
      "id": "nm1284592",
      "name": "Jun Tian",
      "character": ""
    },
    {
      "id": "nm4509187",
      "name": "Masaru Yoshitake",
      "character": ""
    },
    {
      "id": "nm2779859",
      "name": "Qiusheng Zeng",
      "character": ""
    }
  ],
  "overview": "Mouna Rudo was born and raised among the Seediq people, an indigenous tribe in Taiwan, and as he grew to be a man he became a member of the Seediq Bale, a courageous band of native warriors. However, Rudo's way of life is threatened under the yoke of occupying forces from Japan, who took over the nation in 1895. As Rudo sees the traditions and honor of his people stripped away, he realizes the time has come to fight back, and in 1930 he brings together a group of former Seediq Bale soldiers, many of whom have been reduced to infighting, and molds them into a revolutionary army. Rudo and his comrades make their stand when they confront Japanese occupation troops at a youth athletic event, leading to a violent confrontation between the Seediq forces and their oppressors. Warriors of the Rainbow: Seediq Bale - Part 1: The Sun Flag is Part one of the two-part, four-hour Taiwanese edition of the film Warriors of the Rainbow.",
  "storyline": "During the Japanese rule of Taiwan, the Seediq were forced to lose their own culture and give up their faith. Men were subject to harsh labor and kept from traditional hunting; whereas women had to serve the Japanese policemen and their families by doing the household work and giving up their traditional weaving work. Above all, they were forbidden to tattoo their faces. And these tattoos were seen as the Seediq's traditional belief to transform themselves into Seediq Bale (\"true humans\"). Mona Rudao, the protagonist, witnessed the repression by the Japanese over a period of 30 years. Sometime between autumn and winter 1930, when the slave labor is at its harshest, a young Seediq couple are married and a joyful party is thrown. At the same time, a newly appointed Japanese policeman goes on his inspection tour to this tribe. Mona Rudao's first son, Tado Mona, offers wine to the policeman with gusto, but is in return beaten up because his hands were considered not clean enough. With ...",
  "plot": "Warriors of the Rainbow depicts the Wushe Incident, which occurred near Qilai Mountain of Taiwan under Japanese rule. Mona Rudao, a chief of Mahebu village of Seediq people, led warriors fighting against the Japanese.\nPart I\n\nThe film begins with a hunt by a mountain river in Taiwan. Two Bunun men are hunting a boar, but they are attacked by a group led by young Mona Rudao of Seediq people. Mona Rudao invades the territory, kills one of them and takes away the boar.\n\nIn 1895, China cedes Taiwan to Japan via the Treaty of Shimonoseki. The Japanese invasion of Taiwan ends with Japan defeating Han Chinese resistance. Japanese military officials see the natives as an obstacle to the resources of Taiwan. Later a team of Japanese soldiers are attacked by natives. The attack leads to a battle between Japanese and natives including Mona Rudao on a cliff trail. On his way to trade with Han Chinese off the mountain, Mona Rudao also feuds with Temu Walis, a Seediq young man from Toda group. The Japanese ban people from trading with Mona Rudao, and collaborate with a group of Bunun to get Mona Rudao's men drunk and ambush them when they are asleep. After some battles (the 1902 人止關 and 1903 姊妹原), Rudao Luhe, Mona Rudao's father, is injured. Their village, Mahebu, and neighboring villages are under the control of the Japanese.\n\nTwenty years pass. Mahebu and other villages are forced to abolish the custom of keeping the heads they have hunted. Men are subject to low-wage logging and kept from holding guns and from traditional animal and human hunting. Women work in houses of the Japanese and give up the traditional weaving work. Children including the boy Pawan Nawi attend school in Wushe village. Men buy alcohol and medicine from a grocery owned by a Han man and the men hold grudge as they are in debt. Above all, they are forbidden to tattoo their faces, because to earn that tattoo the young men must kill an enemy and take their head. The tattoo is believed to be the requirement for Seediq people to \"go to the other side across the Rainbow Bridge\" after death. There are also young people such as Dakis Nomin, Dakis Nawi, Obing Nawi and Obing Tadao, who adopt Japanese names, education and life style and attempt to work and live among Japanese. The Japanese, except a few, are not aware of the tension.\n\nIn late autumn of 1930, the village of Mona Rudao holds a wedding for a young couple. Mona Rudao goes hunting for the wedding and quarrels for hunting ground with Temu Walis, who is hunting with Japanese policeman Kojima Genji and his son. At the wedding, Yoshimura, a newly appointed and nervous Japanese policeman, inspects the village. Mona Rudao's first son, Tado Mona, offers to share his homebrewed millet wine with Yoshimura, but Yoshimura considers the beer unsanitary as it is fermented with saliva. Tado Mona's hands are also covered in blood from the animal he has just slaughtered. A fight with Tado Mona and his brother Baso Mona ensues. The fight is stopped, but Yoshimura fears for his life and threatens to punish the whole village. Later Mona Rudao tried to apologize but Was refused. Young men, including Piho Sapo from Hogo village, see the punishment unacceptable and urge Mona Rudao to start war with the Japanese. Mona Rudao tells them that it is impossible to win. But Mona Rudao also sees the war as necessary and decides to fight.\n\nIn a few days Mona Rudao calls on villages with pacts to join force. They schedule to attack the Japanese on October 27, when Japanese will attend a sports game (in memory of Prince Kitashirakawa Yoshihisa) and gather on the schoolyard of the Wushe Village. The women, including Mona Rudao's first daughter, Mahung Mona, know the men are planning for a war and are sad.\n\nDakis Nomin, a young man who adopted the Japanese name Hanaoka Ichiro and became a police officer, notices that Mona Rudao is preparing for war. He comes to a waterfall and tries to persuade Mona Rudao not to start the war, instead Mona Rudao persuades him to collaborate. After Dakis Nomin leaves, Mona Rudao sings with the ghost of Rudao Luhe and determines to start the war. In the night before, Mahung Mona tries to seduce her husband to break rule so he cannot go to war the next day. The natives attack the police outposts. Mona Rudao then rallies young men from village to village, and at last chief Tadao Nogan of Hogo village agrees to join Mona Rudao. Everyone is clear about the outcome of the war is: The death of the native warriors is certain, but they are willing to fight anyway, because only a warrior with blood on his hand can enter the \"land of their ancestors\". So they decide to rather fight and die in honour, then to live in shame.\n\nOn October 27 the attack takes place as scheduled. All Japanese men, women and children are killed. Pawan Nawi and other boys kill their Japanese teacher and his family. Obing Nawi, a woman who wears Japanese clothes, is spared only because her husband Dakis Nomin covers her with a native cloth. Obing Tadao, who is daughter of chief Tadao Nogan and who also wears Japanese clothes, survives by hiding in a storage room. Han people such as the grocer are spared. Native people attack a police station and take the guns. One Japanese police officer escapes and tells the outside world about the attack. The film ends with Mona Rudao sitting in the schoolyard which is full of bodies.\nPart II\n\nThe second film begins with Dakis Nomin and Dakis Nawi writing their last words on the wall, telling their ambivalence. When the news of war breaks open, policeman Kojima Genji is threatened, but he convinced Temu Walis and his men to fight with Japan. The colonial government sees the uprising as a major crisis, and sends Major General Kamada Yahiko leading 3,000 police and soldiers to fight the 300 men on Mona Rudao's side. Pawan Nawi and other boys earn their face tattoos. In a woods some people begin to commit suicide. Dakis Nomin, his wife Obing Nawi and young man Dakis Nawi die there.\n\nGeneral Kamada is furious with the stalemate and orders to use the illegal poison gas bomb. On the other hand, Kojima Genji sets bounty on men, women and children in Mona Rudao's village, and orders Temu Walis and his men to fight Mona Rudao.\n\nThe battle turns against Mona Rudao's side. Many are lost to poison gas and Temu Walis' men. Mona Rudao's people lose the village to the Japanese and other natives and retreat to caves. Pawan Nawi and the boys feel desperate and ask to fight side by side with Mona Rudao. Mona Rudao asks them to recite their creation story in which the first man and first woman are formed from a tree that is half stone half wood.\n\nIn the retreat the women kill the children then hang themselves on trees to conserve food for the warriors. Piho Sapo also helped his injured relative, Piho Walis, to hang himself. Temu Walis is shaken when he sees the hanged women, and claims that he fights for his own sake not for Kojima.\n\nMona Rudao and his men launched a desperate attack on the Japanese force occupying the Mahebu village. Baso Mona is injured and asks his brother to kill him. Pawan Nawi and the boys die fighting. Meanwhile, in a river, Temu Walis and his men are ambushed by Piho Sapo and other men. In his illusion, Temu Walis thinks he is fighting young Mona Rudao before he dies.\n\nWhen Mona Rudao sees the fight is near the end, he gives leadership to Tado Mona, and returns to his wife and children (the movie implies two versions of the story, one is that Mona Rudao shot his wife, the other is that the wife hanged herself). Some people of the village surrender and survive. Natives present and identify heads of the dead to Japanese for rewards, and it is shown that in the battle they feud with each other even further. Mahung Mona is resuscitated by the Japanese, and is sent to offer Tado Mona's men wine and a chance to surrender. The men take the wine, and sing and dance with the women, but refuse to surrender. Tado Mona tells Mahung Mona to give birth to and raise offspring, and leads men to hang themselves in woods. Piho Sapo is captured and tortured to death. The war ends, and even Kamada is impressed by his enemy's spirit. The surviving people of the villages that rebel are removed from their homes, and are later attacked by Kojima. Mona Rudao is missing, and a native hunter is led by a bird to find his body. The hunter then sees Mona Rudao and his people following the Seediq legend to cross the rainbow bridge. The film ends with a scene of several natives telling their creation story.",
  "synopsis": null
}