{
  "imdb_id": "tt2017709",
  "tmdb_id": "119195",
  "douban_id": null,
  "title": "Father of Lights (2012)",
  "genres": [
    "Documentary"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "99 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.5,
  "director": [
    {
      "id": "nm4203108",
      "name": "Darren Wilson"
    }
  ],
  "writer": [
    {
      "id": "nm4203108",
      "name": "Darren Wilson",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4203108",
      "name": "Darren Wilson",
      "character": "Narrator"
    },
    {
      "id": "nm4916331",
      "name": "Robby Dawkins",
      "character": "Himself - Minister"
    },
    {
      "id": "nm5152692",
      "name": "Todd White",
      "character": "Himself"
    },
    {
      "id": "nm5152236",
      "name": "Deena Vant Hul",
      "character": "Herself"
    },
    {
      "id": "nm5233791",
      "name": "Doug Addison",
      "character": "Himself - Tattoo Prophet"
    },
    {
      "id": "nm4930889",
      "name": "Heidi Baker",
      "character": "Herself - Minister"
    },
    {
      "id": "nm4804257",
      "name": "Matthew Barnett",
      "character": "Himself"
    },
    {
      "id": "nm3832331",
      "name": "Mike Bickle",
      "character": "Himself - Pastor"
    },
    {
      "id": "nm5147946",
      "name": "Shawn Bolz",
      "character": "Himself - Minister"
    },
    {
      "id": "nm2304365",
      "name": "Reinhard Bonnke",
      "character": "Himself - Minister"
    },
    {
      "id": "nm4917003",
      "name": "Greg Boyd",
      "character": "Himself"
    },
    {
      "id": "nm5152567",
      "name": "Randy Clark",
      "character": "Himself - Minister"
    },
    {
      "id": "nm5152023",
      "name": "Jack Deere",
      "character": "Himself - Minister"
    },
    {
      "id": "nm4408987",
      "name": "Majed el Shafie",
      "character": "Himself"
    },
    {
      "id": "nm5002813",
      "name": "Andrew Farley",
      "character": "Himself"
    },
    {
      "id": "nm5032303",
      "name": "Harmony Dust Grillo",
      "character": "Herself       (as Hamony Dust)"
    },
    {
      "id": "nm4887737",
      "name": "Bill Johnson",
      "character": "Himself - Minister"
    },
    {
      "id": "nm5153433",
      "name": "Banning Liebscher",
      "character": "Himself"
    },
    {
      "id": "nm1515273",
      "name": "Jaeson Ma",
      "character": "Himself"
    },
    {
      "id": "nm4916524",
      "name": "Philip Mantofa",
      "character": "Himself - Minister"
    },
    {
      "id": "nm4930693",
      "name": "Chris Overstreet",
      "character": "Himself"
    },
    {
      "id": "nm5152828",
      "name": "Ravi",
      "character": "Himself"
    },
    {
      "id": "nm5152963",
      "name": "Shanti Rice",
      "character": "Herself"
    },
    {
      "id": "nm4916469",
      "name": "Kris Vallotton",
      "character": "Himself - Pastor"
    },
    {
      "id": "nm5152264",
      "name": "Mike Vant Hul",
      "character": "Himself"
    },
    {
      "id": "nm5152145",
      "name": "Andrew Wommack",
      "character": "Himself"
    }
  ],
  "overview": "Through filming incredible spiritual encounters around the world, Darren Wilson cuts through religious misconceptions in an effort to find the true nature and character of God.",
  "storyline": "In this final installment of Darren Wilson's popular \"God Trilogy\" (Finger of God & Furious Love), Darren and his team take you on their wildest, most powerful ride yet. Asking the simple question, \"Who is the Father?\", you will be blown away by the incredible and historic encounters they were able to capture. Featuring a veritable who's who of Christian leaders from across the globe, and witch doctors, gang leaders, Hindu gurus, and Muslims alike encountering the God of the Bible, you will never view the Father quite the same again. Prepare to meet your Maker, as Darren and his team cut through religious misconceptions in an effort to find the true nature, heart, and character of God.",
  "plot": "Will Shaw (Henry Cavill) works as a financial advisor in San Francisco. During the summer break, he reluctantly visits his family in Spain for a holiday. He is met there by his father, Martin Shaw (Bruce Willis), who is himself an advisor for the government. That evening, a phone call puts Will in a bad mood and he decides to go fishing the next day. His preoccupation with the phone results in a sailing accident; Will leaps to save his brother's (Rafi Gavron) girlfriend Dara (Emma Hamilton) from being hit by the yacht's boom but she hits her head on a winch. While everyone is fussing over Dara, Will's phone rings again. In frustration, Martin grabs it and throws it into the ocean. Will decides to swim to town to fetch medical supplies and take some time to cool down. When he comes back, he can no longer find his family in the yacht.\n\nWill goes to the police and they lead him to Zahir (Roschdy Zem), who knows the whereabouts of Will's family, and invites him along to be shown the way. Will senses something is amiss, and attempts to escape with the police car. Martin appears, beats the officers, and helps Will escape.\n\nMartin reveals he is a CIA agent, and explains that the people who kidnapped their family are after a briefcase he had taken while carrying out a CIA assignment. Martin calls his CIA team leader, Jean Carrack (Sigourney Weaver) who agrees to meet him in Madrid. At the meeting, Will stays in the car while Martin talks to Carrack, who says she no longer has the briefcase for she handed it over their superiors. He doesn't believe her and senses something is wrong. As Martin returns to the car, he is shot and killed by a sniper (Joseph Mawle). Will is shocked but when he gets out to check him, Martin's phone starts ringing and the sniper, Gorman, starts shooting at him. Will grabs the phone, leaves the car, and is chased through Madrid by Gorman. Will escapes, leaving his father's gun in a trash bin. During his escape, Will takes a call from the kidnappers, who want to speak to \"Tom\" and demand the briefcase in exchange for his family. He is given a deadline of 21 hours and a meeting point.\n\nWill arranges a meeting with his father's friend, Diego. He arrives at Diego's office and meets receptionist Lucia Caldera (Verónica Echegui), who was the girl he spoke to on the phone and it transpires that Diego is her uncle. But Diego was killed by Jean and Gorman. Will and Lucia escape across the rooftops, but Will is shot. Instead of taking Will to a hospital, Lucia takes him to a nightclub, to a friend who has medical experience. Lucia also tells Will that \"Tom\" is Martin's alias in Spain, and that she is actually Will's half sister, being Martin's daughter by another woman.\n\nLucia comes up with a plan to lure Carrack out by starting a tab on her credit card. Gorman appears and is subdued by bouncers at the nightclub and tortured for information. He gives nothing away and Will decides to let him think he has escaped and to follow him. This works and they follow him to Carrack, who has the briefcase and in negotiation with someone in an underground car park. But Jean senses that something's wrong and started attacking the negotiators and Will. After an extensive car chase through Madrid, the roles are reversed and Carrack chases them, angry at their interference. The cars collide and Lucia is seriously injured. Just as Carrack is about to shoot Will, she is shot by a sniper, and Zahir retrieves the briefcase. It was revealed that Zahir and his team are CIA agents and Jean, with Gorman, is a traitor. Zahir commends Will and tells him that his father would have been proud of him. Lucia recovers in hospital, surrounded by her half family. Will is offered a job in the CIA; whether he accepts is left unresolved.",
  "synopsis": null
}