{
  "imdb_id": "tt2065945",
  "tmdb_id": "129385",
  "douban_id": null,
  "title": "Gingerclown (2013)",
  "genres": [
    "Comedy",
    "Horror"
  ],
  "country": "Hungary",
  "version": [
    {
      "runtime": "83 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.3,
  "director": [
    {
      "id": "nm2458034",
      "name": "Balázs Hatvani"
    }
  ],
  "writer": [
    {
      "id": "nm2458034",
      "name": "Balázs Hatvani",
      "description": "characters created by"
    }
  ],
  "cast": [
    {
      "id": "nm2421350",
      "name": "Ashley Lloyd",
      "character": "Sam"
    },
    {
      "id": "nm4706089",
      "name": "Erin Hayes",
      "character": "Jenny"
    },
    {
      "id": "nm0000347",
      "name": "Tim Curry",
      "character": "Gingerclown       (voice)"
    },
    {
      "id": "nm0000448",
      "name": "Lance Henriksen",
      "character": "Braineater"
    },
    {
      "id": "nm0935498",
      "name": "Michael Winslow",
      "character": "Stomachcrumble"
    },
    {
      "id": "nm0000374",
      "name": "Brad Dourif",
      "character": "Worm Creature"
    },
    {
      "id": "nm0000707",
      "name": "Sean Young",
      "character": "Nelly the Spiderwoman"
    },
    {
      "id": "nm4690656",
      "name": "Michael Cannell-Griffiths",
      "character": "Biff"
    },
    {
      "id": "nm4715269",
      "name": "András Koloszár",
      "character": "Jerry"
    },
    {
      "id": "nm1897156",
      "name": "Joshua Brownwood",
      "character": "Ed"
    },
    {
      "id": "nm4715270",
      "name": "Nelson Matthews",
      "character": "Lou"
    },
    {
      "id": "nm4743777",
      "name": "Andrew Montesi",
      "character": "Teakettle"
    },
    {
      "id": "nm4715444",
      "name": "Dorottya Bokros",
      "character": "Girl"
    },
    {
      "id": "nm4715356",
      "name": "Dorottya Dióssi",
      "character": "Girl"
    },
    {
      "id": "nm4715344",
      "name": "Bernadett Fodor",
      "character": "Girl"
    },
    {
      "id": "nm4715266",
      "name": "Soraya Hegyesi",
      "character": "Girl"
    },
    {
      "id": "nm4715320",
      "name": "Anna Mucsi",
      "character": "Girl"
    }
  ],
  "overview": "1983: A group of high school students are having a great time near Hollywood Hills at the weekend when they bump into the Loser from their school, Sam, who's just on his way home. Sam would do anything in order to get Jenny's attention, one of prettiest girls in school. Unfortunately she's also the girlfriend of the school's bully, Biff, the quarterback of the football team. Biff and his buddies are keen to take Sam to the old abandoned amusement park to make him prove his courage as part of their initiation ceremony. They involve Jenny in their cruel game as the grand prize of the competition. Sam accepts the challenge, but the girl wouldn't let him go in by himself; she follows him into the amusement park and a night they'll never forget.",
  "storyline": "In 1983, a group of high school kids break into an abandoned amusement park only to realize it's overrun with monsters.",
  "plot": "In 1983, a group of high school students led by Biff, run into their nerdy classmate Sam (Ashley Lloyd), who they instantly begin to bully. In order to prove himself to Biff and also win the affection of Biff's good natured girlfriend, Jenny (Erin Hayes) he agrees to sneak into an old abandoned amusement park to prove his courage.\n\nTired of Biff's antics, Jenny follows Sam into the amusement park. After catching up with him and suggesting they should leave, feeling something is not right about the park. Suddenly, various attractions in the amusement park begin to light up. Their presence in the park has come to the attention of a creature known as Gingerclown (Tim Curry) who now attempts to torment and kill the duo. Trying to find a way out of the park, the two run into the other hideous creatures that live within the park (Brad Dourif, Lance Henriksen, Michael Winslow). Getting suspicious of how long Jenny and Sam have been alone together, Biff enters the park searching for them. He is soon found by Gingerclown, who eventually murders him. Jenny and Sam are separated from each other, with Sam being chased by Gingerclown and Jenny is captured by a giant spider (Sean Young), but she manages to escape by killing her.\n\nAlthough they are briefly reunited, Sam is captured by Gingerclown, while Jenny hides. Jenny is soon confronted by Gingerclown, but before he can kill her she chains him to a barrier, while Sam sneaks up behind him and strangles him to death with a chain. Morning comes and the pair having survived the night, share a kiss.",
  "synopsis": null
}