{
  "imdb_id": "tt2011040",
  "tmdb_id": "397739",
  "douban_id": null,
  "title": "Here Build Your Homes (2012)",
  "genres": [
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "99 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.0,
  "director": [
    {
      "id": "nm3123560",
      "name": "Cameron Beyl"
    }
  ],
  "writer": [
    {
      "id": "nm3123560",
      "name": "Cameron Beyl",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3229692",
      "name": "Patrick Carlyle",
      "character": "Owen"
    },
    {
      "id": "nm3247998",
      "name": "Heather Ann Davis",
      "character": "Charlotte"
    },
    {
      "id": "nm3870069",
      "name": "Emily Graham-Handley",
      "character": "Rosie"
    },
    {
      "id": "nm2860792",
      "name": "Megan Lee Joy",
      "character": "Aliz"
    },
    {
      "id": "nm3395051",
      "name": "Benjamin Parslow",
      "character": "Micah"
    },
    {
      "id": "nm2649935",
      "name": "Joseph Snyder-Kloos",
      "character": "Dustin"
    }
  ],
  "overview": "Six young people head up to a cabin in the woods of Northern California for a rustic Independence Day retreat, only to find themselves going through their own personal crucibles at the threshold of adulthood.",
  "storyline": "For as long as they can remember, siblings Owen and Rosie have always spent summers in their family's rustic cabin in the redwoods outside Boulder Creek, California. Now in their mid-twenties, they find their family splintering apart in the wake of their parents' divorce. As property has divided, their summer cabin has fallen into the possession of their mother, who is intent on selling it. With the knowledge that this is their last trip to a favorite childhood place, Owen and Rosie organize an Independence Day weekend getaway for them and their closest friends. In tow: Owen's longtime girlfriend Aliz, her best friend Charlotte, Charlotte's long-distance beau Micah, and Rosie's new boyfriend-- a yoga instructor named Dusty that rubs everyone else the wrong way. In the days leading up to the Fourth, Owen and Rosie squabble about their parents divorce and the future of the cabin. Dusty learns of the impending sale and offers to buy the cabin for Rosie, which doesn't sit well with Owen. ...",
  "plot": null,
  "synopsis": null
}