{
  "imdb_id": "tt2023690",
  "tmdb_id": "117974",
  "douban_id": null,
  "title": "Sightseers (2012)",
  "genres": [
    "Adventure",
    "Comedy",
    "Crime",
    "Horror",
    "Romance"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "88 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm1296554",
      "name": "Ben Wheatley"
    }
  ],
  "writer": [
    {
      "id": "nm1546686",
      "name": "Alice Lowe",
      "description": "written by &"
    },
    {
      "id": "nm1361530",
      "name": "Steve Oram",
      "description": "written by"
    },
    {
      "id": "nm4207229",
      "name": "Amy Jump",
      "description": "additional material"
    }
  ],
  "cast": [
    {
      "id": "nm1546686",
      "name": "Alice Lowe",
      "character": "Tina"
    },
    {
      "id": "nm0203688",
      "name": "Eileen Davies",
      "character": "Carol"
    },
    {
      "id": "nm1361530",
      "name": "Steve Oram",
      "character": "Chris"
    },
    {
      "id": "nm0584199",
      "name": "Roger Michael",
      "character": "Tram Conductor"
    },
    {
      "id": "nm0915453",
      "name": "Tony Way",
      "character": "Crich Tourist"
    },
    {
      "id": "nm0642306",
      "name": "Seamus O'Neill",
      "character": "Mr. Grant"
    },
    {
      "id": "nm0230826",
      "name": "Monica Dolan",
      "character": "Janice"
    },
    {
      "id": "nm0034877",
      "name": "Jonathan Aris",
      "character": "Ian"
    },
    {
      "id": "nm3043480",
      "name": "Aymen Hamdouchi",
      "character": "Chalid Sulinan"
    },
    {
      "id": "nm1360283",
      "name": "Tom Meeten",
      "character": "Head Shaman"
    },
    {
      "id": "nm1518750",
      "name": "Kali Peacock",
      "character": "Hiking Shop Assistant"
    },
    {
      "id": "nm0352901",
      "name": "Kenneth Hadley",
      "character": "Richard"
    },
    {
      "id": "nm1279787",
      "name": "Stephanie Jacob",
      "character": "Joan"
    },
    {
      "id": "nm1092812",
      "name": "Christine Talbot",
      "character": "Newsreader"
    },
    {
      "id": "nm0525973",
      "name": "Richard Lumsden",
      "character": "Rambler"
    },
    {
      "id": "nm3038224",
      "name": "Dominic Applewhite",
      "character": "Blond Teenager"
    },
    {
      "id": "nm0829815",
      "name": "Sara Stewart",
      "character": "Blond Boy's Mother"
    },
    {
      "id": "nm1757718",
      "name": "Richard Glover",
      "character": "Martin"
    },
    {
      "id": "nm5223914",
      "name": "Rachel Austin",
      "character": "Bride-to-Be"
    },
    {
      "id": "nm4207598",
      "name": "Gemma Lise Thornton",
      "character": "Head Hen"
    },
    {
      "id": "nm5661734",
      "name": "Alana Burnett",
      "character": "Hen"
    },
    {
      "id": "nm5661704",
      "name": "Lisa-Marie Hoctor",
      "character": "Hen"
    },
    {
      "id": "nm0564096",
      "name": "Susan McArdle",
      "character": "Hen"
    },
    {
      "id": "nm4540815",
      "name": "Kelly Munro-Fawcett",
      "character": "Hen"
    },
    {
      "id": "nm1764320",
      "name": "Samantha Stone",
      "character": "Hen"
    },
    {
      "id": "nm5223872",
      "name": "Louisa Farrant",
      "character": "Waitress"
    },
    {
      "id": "nm3876621",
      "name": "Gareth Jones",
      "character": "Runner"
    },
    {
      "id": "nm0214223",
      "name": "Sara Dee",
      "character": "Radio Voices       (voice)"
    },
    {
      "id": "nm5661439",
      "name": "Smurf",
      "character": "Banjo"
    },
    {
      "id": "nm5661413",
      "name": "Ged",
      "character": "Poppy"
    }
  ],
  "overview": "Chris wants to show girlfriend Tina his world, but events soon conspire against the couple and their dream caravan holiday takes a very wrong turn.",
  "storyline": "Chris wants to show girlfriend Tina his world, but events soon conspire against the couple and their dream caravan holiday takes a very wrong turn.",
  "plot": "After destroying a drug laboratory in Latin America, James Bond—Agent 007—travels to Miami Beach to receive instructions from his superior, M, via CIA agent Felix Leiter. He is to observe bullion dealer Auric Goldfinger at the hotel there. Bond sees Goldfinger cheating at gin rummy and stops him by distracting his employee, Jill Masterson, and blackmailing Goldfinger into losing. After Bond and Jill consummate their new relationship, Bond is knocked out by Goldfinger's Korean manservant, the hulking giant Oddjob. When Bond awakens, he finds Jill dead, covered in gold paint, having died from \"skin suffocation.\"\n\nIn London, Bond learns his objective is determining how Goldfinger smuggles gold internationally. Bond arranges to meet Goldfinger socially and wins a high-stakes golf game against him with a recovered Nazi gold bar at stake. Bond follows him to Switzerland, where Tilly, Jill's sister, makes an unsuccessful attempt at revenge by firing a rifle at Goldfinger.\n\nBond sneaks into Goldfinger's plant and discovers Goldfinger smuggles gold by melting it down and incorporating it into the bodywork of his car, which he takes with him whenever he travels. Bond also overhears Goldfinger talking to Red Chinese agent Mr. Ling about \"Operation Grand Slam.\" Leaving, Bond encounters Tilly as she tries to kill Goldfinger again, but trips an alarm in the process; Oddjob kills Tilly with his hat. Captured, Bond is tied to a cutting table underneath an industrial laser, which begins to slice a sheet of gold in half, with Bond lying over it. Bond lies to Goldfinger that MI6 knows about Grand Slam, causing Goldfinger to spare Bond's life to mislead MI6 into believing Bond has things in hand.\n\nBond is transported by Goldfinger's private jet, piloted by Pussy Galore, to his stud farm near Fort Knox, Kentucky. Bond escapes and witnesses Goldfinger's meeting with US mafiosi, who have brought the materials he needs for Operation Grand Slam. Although they are each promised $1&#160;million, Goldfinger tempts them that they could have the million today, or $10 million tomorrow, and relates his plan to rob Fort Knox. He then kills them using some of the \"Delta 9\" nerve gas he plans to release over Fort Knox.\n\nBond is recaptured and tells Goldfinger why the plan to rob the gold depository will not work. Goldfinger hints he does not intend to steal the gold, and Bond deduces Goldfinger will detonate a cobalt bomb inside the vault, designed to render the gold useless for 58 years. This will increase the value of Goldfinger's own gold and give the Chinese an advantage from the potential economic chaos.\n\nOperation Grand Slam begins with Pussy Galore's Flying Circus spraying the gas over Fort Knox. However, Bond had seduced Galore and convinced her to replace the nerve gas with a harmless substance and alert the US government about Goldfinger's plan. The military personnel of Fort Knox play dead until they are certain that they can prevent the criminals from escaping.\n\nBelieving the military forces to be neutralised, Goldfinger's private army breaks into Fort Knox and accesses the vault itself as Goldfinger arrives in a helicopter with the atomic device. In the vault, Kisch handcuffs Bond to the bomb. The troops attack; Goldfinger takes off his coat, revealing a US Army colonel's uniform, and kills Mr. Ling and the troops seeking to open the vault, then makes his escape. Kisch attempts to stop the bomb, but Oddjob kills him. Bond frees himself from the handcuffs, but Oddjob attacks him before he can disarm the bomb. Bond manages to electrocute Oddjob, then forces the lock off the bomb but is unable to disarm it. An atomic specialist who accompanied Leiter arrives with seconds to spare, and simply turns off the device with the clock stopped on \"0:07\".\n\nBond is invited to the White House for lunch with the President. However, Goldfinger hijacks the plane carrying Bond there. In a struggle for Goldfinger's revolver, the gun fires, shooting out a window, creating an explosive decompression. Goldfinger is sucked from the cabin through the ruptured window. With the plane out of control, Bond rescues Galore and they parachute safely from the aircraft before it crashes into the ocean.",
  "synopsis": "Chris is a caravan fan and aspiring writer who takes his girlfriend Tina on a road trip, much to the chagrin of Tina's mother, who has never forgiven Tina for the death of their dog \"Poppy\". At their first stop, the National Tramway Museum, Chris confronts a man who is littering, and the man refuses to pick up his rubbish. When they get back to their car, Chris runs him over and kills him. Chris claims that the death was an accident, but smirks after the impact, unseen by Tina. Chris tells Tina that she is his muse.They meet Janice, Ian and their dog Banjo (who resembles Poppy) at a caravan park and Janice reveals that Ian is a published writer, something that makes Chris jealous. The next morning Ian goes for a walk. Chris follows him, hits him in the head with a rock, steals his camera and pushes him off a cliff. Tina takes Banjo with them as they go. Tina finds photos of Ian and Janice on the camera and confronts Chris, who confesses to Ian's murder. Tina accepts this. During a walk through a National Trust park, Banjo defecates on the ground and a tourist tells Tina to clear up the mess. Chris arrives and encourages Tina to claim that the man tried to rape her. A row ensues, and Chris beats him to death.At the next caravan park, Chris meets Martin, an engineer who is testing a mini-caravan that can be attached to the back of a bicycle. During a meal in a restaurant, Tina goes to the bathroom. When she returns, she finds Chris kissing the bride from the hen party at a nearby table as part of a bachelorette dare. Upset, Tina follows the bride outside and kills her by pushing her down a steep hill onto some rocks, observed by Chris. The next morning, instead of visiting a local tourist attraction, Chris says he is helping Martin make some modifications to his caravan. They argue, and Tina drives off alone. Upset, she calls her mother and is about to confess to the murders, when her mother hangs up. Later that night, Tina tries to seduce Chris by talking about their complicity in the murders, but he rejects her.Chris wakes up to find Tina has left him sleeping in the caravan and is speeding down the highway. He calls her and tells her to pull over. Tina notices a jogger and runs him over. Chris is upset with her chaotic approach to the murders, believing himself to be justified in his choice of victims, and argue before hiding the body at the side of the road. They drive to a mountain, where they set up camp with the Ribblehead Viaduct in sight, the final destination on their holiday. When a hailstorm forces them back inside the caravan, Chris falls asleep and Tina looks at his notebook, finding a drawing of her and Chris standing on the viaduct, about to jump.Martin arrives, with Banjo in the mini-caravan. While Chris is outside, Tina tries to seduce Martin, who is made uncomfortable by her advances and rejects her. When Chris returns, she tells him that Martin propositioned her in a, particularly implausible and repulsive manner. Martin returns to his mini-caravan, and Chris and Tina have a fight over whether the dog should be called by the name \"Poppy\" or \"Banjo\". Upset, Tina pushes Martin's mini-caravan off the cliff, with him still in it. She re-enters their caravan and tells Chris that the problem is over. He runs outside and finds Martin's dead body. He insults Tina and they fight, which ends in them having sex.Chris sets the caravan on fire and kisses Tina. They run to the Ribblehead Viaduct and climb to the top, holding hands. Chris asks Tina if she enjoyed the holiday and she says it was brilliant. He apologises for insulting her and asks if she really wants to kill herself. Just as Chris steps off the viaduct, Tina lets go of his hand, watching as he falls to the ground and dies. Tina stares at her hand as the screen cuts to black."
}