{
  "imdb_id": "tt2012665",
  "tmdb_id": "80920",
  "douban_id": null,
  "title": "Repentance (2013)",
  "genres": [
    "Drama",
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.8,
  "director": [
    {
      "id": "nm0129310",
      "name": "Philippe Caland"
    }
  ],
  "writer": [
    {
      "id": "nm0989941",
      "name": "Shintaro Shimosawa",
      "description": "screenplay"
    },
    {
      "id": "nm0129310",
      "name": "Philippe Caland",
      "description": "based on the film \"The Gypsy and the Gury\" by"
    }
  ],
  "cast": [
    {
      "id": "nm0001845",
      "name": "Forest Whitaker",
      "character": "Angel Sanchez"
    },
    {
      "id": "nm1107001",
      "name": "Anthony Mackie",
      "character": "Tommy Carter"
    },
    {
      "id": "nm0258402",
      "name": "Mike Epps",
      "character": "Ben Carter"
    },
    {
      "id": "nm0005125",
      "name": "Sanaa Lathan",
      "character": "Maggie Carter"
    },
    {
      "id": "nm0662519",
      "name": "Nicole Ari Parker",
      "character": "Sophie Sanchez"
    },
    {
      "id": "nm4578163",
      "name": "Ariana Neal",
      "character": "Francesca Sanchez"
    },
    {
      "id": "nm1632747",
      "name": "Denise Milfort",
      "character": "Seer"
    },
    {
      "id": "nm1532689",
      "name": "Selma Pinkard",
      "character": "Aunt"
    },
    {
      "id": "nm4582331",
      "name": "Avery Edward Landry",
      "character": "Boy"
    },
    {
      "id": "nm2305677",
      "name": "Margo Swisher",
      "character": "Red-head Woman"
    },
    {
      "id": "nm1457701",
      "name": "Adella Gautier",
      "character": "Angel's Mother"
    },
    {
      "id": "nm3841862",
      "name": "Jessica Medina",
      "character": "Angel's Cousin #1"
    },
    {
      "id": "nm6317503",
      "name": "Gina Blocker",
      "character": "Angel's Cousin #2"
    },
    {
      "id": "nm0000693",
      "name": "Peter Weller",
      "character": "Meyer"
    },
    {
      "id": "nm5450445",
      "name": "Ashley Toman",
      "character": "Harpist"
    },
    {
      "id": "nm5047230",
      "name": "Terri Battee",
      "character": "Angel's Cousin #3"
    },
    {
      "id": "nm0163688",
      "name": "Betsy Clark",
      "character": "Maggie's Friend       (as Betsy Clark-Calland)"
    }
  ],
  "overview": "An earnest life-coach/author, Thomas Carter, is mysteriously abducted by a deranged client, Angel Sanchez, who delves into Thomas' teachings and uses his spiritual messages of Karma - action and reaction (Vipaka), against him to terrorize him and his family for their past sins.",
  "storyline": "An earnest life-coach/author, Thomas Carter, is mysteriously abducted by a deranged client, Angel Sanchez, who delves into Thomas' teachings and uses his spiritual messages of Karma - action and reaction (Vipaka), against him to terrorize him and his family for their past sins.",
  "plot": "Repentance is set in a small Georgian town. The film starts with the scene of a woman preparing cakes. A man in a chair is reading from a newspaper that the town's mayor, Varlam Aravidze (Avtandil Makharadze) has died. One day after the funeral the corpse of the mayor turns up in the garden of his son's house. The corpse is reburied, only to reappear again in the garden. A woman, Ketevan Barateli (Zeinab Botsvadze), is eventually arrested and accused of digging up the corpse. She defends herself and states that Varlam does not deserve to be buried as he was responsible for a Stalin-like regime of terror responsible for the disappearance of her parents and her friends. She is put on trial and gives her testimony, with the story of Varlam's regime being told in flashbacks.\n\nDuring the trial, Varlam's son Abel (Avtandil Makharadze) denies any wrongdoings by his father and his lawyer tries to get Ketevan declared insane. Varlam's grandson Tornike (Merab Ninidze) is shocked by the revelations about the crimes of his grandfather. He ultimately commits suicide. Abel himself then throws Varlam's corpse off a cliff on the outskirts of the town.\n\nAt the end the film returns to the scene of the woman preparing a cake. An old woman is asking her at the window whether this is the road that leads to the temple. The woman replies that the road is Varlam street and will not lead to the temple. The old woman replies: \"What good is a road if it doesn't lead to a temple?\"",
  "synopsis": "From Lionsgate and Codeblack Films. Years after a drunken car crash that almost took his life, Tommy Carter (Anthony Mackie) has reinvented himself as a therapist/spiritual advisor who advocates a synthesis of world religions and positivity. Hes parlayed this vocation into a successful book release that one day draws the attention of Angel Sanchez (Forest Whitaker), a profoundly troubled man fixated on the untimely death of his mother. When Carter takes on Sanchez as a personal client in an effort to raise funds for his indebted brother Ben (Mike Epps), things quickly take a turn for the worse. Angel needs much more than a simple life coach. What may be simple to grasp for some is the idea that single actions in the past comprise tidal waves of reactions in the present. Director Philippe Caland's REPENTANCE examines these issues against a backdrop of kidnapping and murder."
}