{
  "imdb_id": "tt2043865",
  "tmdb_id": "252444",
  "douban_id": null,
  "title": "Cásese quien pueda (2014)",
  "genres": [
    "Comedy"
  ],
  "country": "Mexico",
  "version": [
    {
      "runtime": "107 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm1000616",
      "name": "Marco Polo Constandse"
    }
  ],
  "writer": [
    {
      "id": "nm1172285",
      "name": "Martha Higareda",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1172285",
      "name": "Martha Higareda",
      "character": "Ana"
    },
    {
      "id": "nm1645334",
      "name": "Luis Gerardo Méndez",
      "character": "Gustavo"
    },
    {
      "id": "nm1001435",
      "name": "Juan Pablo Medina",
      "character": "Mariano"
    },
    {
      "id": "nm2564274",
      "name": "Miriam Higareda",
      "character": "Daniela"
    },
    {
      "id": "nm0112868",
      "name": "Michel Brown",
      "character": "Erik"
    },
    {
      "id": "nm0116737",
      "name": "Cory Brusseau",
      "character": "Dr. Luke       (rumored)"
    },
    {
      "id": "nm2460714",
      "name": "Alejandro Cuétara",
      "character": "Alejandro"
    },
    {
      "id": "nm5687461",
      "name": "Rocio Garcia",
      "character": "Friend"
    },
    {
      "id": "nm2070938",
      "name": "Elsy Reyes",
      "character": "Tania"
    },
    {
      "id": "nm2614149",
      "name": "Mayra Batalla",
      "character": "Esposa de Donovan"
    },
    {
      "id": "nm3381556",
      "name": "Ricardo Mestre",
      "character": "Pelon       (as Richie Mestre)"
    },
    {
      "id": "nm6260838",
      "name": "Tania Palacios",
      "character": "Vivi"
    },
    {
      "id": "nm2706119",
      "name": "Arturo Valdemar",
      "character": "Miguelito"
    },
    {
      "id": "nm4814103",
      "name": "Maite Suarez Diez",
      "character": "Romina"
    },
    {
      "id": "nm1753491",
      "name": "Pablo Fulgueira",
      "character": "Jacobo"
    }
  ],
  "overview": "“Cásese quien pueda”, is a romantic comedy placed in Mexico City and in the Quintana Roo jungles. The story tells about two sisters with completely different goals in life: one of them wants to get married, and the other wants to succeed in her professional career; but life will take them to completely unknown and new paths. Ana Paula (Martha Higareda) is about to get married when she finds out her fiancé is cheating on her with her own cousin. That night, after many shots of tequila, Ana Paula ends up falling asleep in the back of a truck owned by a worker who that same night goes back to his hometown, a small village in Quintana Roo.",
  "storyline": "Martha Higareda plays Ana Paula, a girl whose dream is to get married and have the perfect wedding, the perfect life with the perfect husband. Her fiancée is not so perfect though as he has cheated on her with her cousin. Miriam Higareda plays Daniela, a care-free girl that has been in love of her best friend since childhood but she never had the courage to tell him so. Ana Paula ends up drunk and accidentally driven out of the city unto the jungle where she founds Erik, a simple man that travels the native colonies as a doctor, that will show her that life doesn't have to be always perfect, that the simple things in life are greater. And her convictions on her upcoming marriage will be challenged. In the meantime Daniela is staying at her best friend's house to celebrate his father's birthday, and because his family teases him that he has never had a real girlfriend, Daniela pretends to be his girlfriend in front of the family, but they will both soon realize that their feelings for ...",
  "plot": null,
  "synopsis": null
}