{
  "imdb_id": "tt2081438",
  "tmdb_id": "153509",
  "douban_id": null,
  "title": "Apocalypse Z (2013)",
  "genres": [
    "Action",
    "Horror",
    "Sci-Fi"
  ],
  "country": "Italy",
  "version": [
    {
      "runtime": "87 min",
      "description": ""
    }
  ],
  "imdb_rating": 2.3,
  "director": [
    {
      "id": "nm2650383",
      "name": "Luca Boni"
    },
    {
      "id": "nm2652613",
      "name": "Marco Ristori"
    }
  ],
  "writer": [
    {
      "id": "nm2650383",
      "name": "Luca Boni",
      "description": "written by"
    },
    {
      "id": "nm2652613",
      "name": "Marco Ristori",
      "description": "written by"
    },
    {
      "id": "nm7936137",
      "name": "Russell Romick",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0091443",
      "name": "Christian Boeving",
      "character": "Jack Stone"
    },
    {
      "id": "nm2396944",
      "name": "Mike Mitchell",
      "character": "John 'Mad Dog' McKellen"
    },
    {
      "id": "nm2286991",
      "name": "Tara Cardinal",
      "character": "Eden Shizuka"
    },
    {
      "id": "nm4948716",
      "name": "Ivy Corbin",
      "character": "Sam Neumann       (as Ivy Marshall Corbin)"
    },
    {
      "id": "nm2164767",
      "name": "Carl Wharton",
      "character": "General Carter"
    },
    {
      "id": "nm1376997",
      "name": "Jon Campling",
      "character": "Doug Mulligan"
    },
    {
      "id": "nm1896559",
      "name": "Daniel Vivian",
      "character": "Dragan Ilic"
    },
    {
      "id": "nm1649939",
      "name": "Gerry Shanahan",
      "character": "Doctor Neumann"
    },
    {
      "id": "nm4949222",
      "name": "Nathalia Henao",
      "character": "Claire Howard"
    },
    {
      "id": "nm1470733",
      "name": "David White",
      "character": "Secretary of Defense"
    },
    {
      "id": "nm0093051",
      "name": "Uwe Boll",
      "character": "President of the US"
    },
    {
      "id": "nm4948869",
      "name": "Lee Baughn",
      "character": "Soldier #1"
    },
    {
      "id": "nm4948614",
      "name": "Garth Lughton",
      "character": "Soldier #2"
    },
    {
      "id": "nm6088575",
      "name": "Andrea Rovini",
      "character": "Soldier #3"
    },
    {
      "id": "nm6088576",
      "name": "Pietro Batini",
      "character": "Soldier #4"
    },
    {
      "id": "nm6088577",
      "name": "Stefano Carmignani",
      "character": "Soldier #5"
    },
    {
      "id": "nm6088578",
      "name": "Alessio Pace",
      "character": "Soldier #6"
    },
    {
      "id": "nm6088579",
      "name": "Ilaria Balluchi",
      "character": "Christina Stone"
    },
    {
      "id": "nm1444606",
      "name": "Michael Segal",
      "character": "Prologue Guy /              Final Creature"
    },
    {
      "id": "nm4869332",
      "name": "Cristiana Raggi",
      "character": "Prologue Girl"
    },
    {
      "id": "nm6088581",
      "name": "Vincenzo Bellini",
      "character": "Prologue Old Man"
    },
    {
      "id": "nm6088582",
      "name": "Manuel Cuni",
      "character": "Businessman #1"
    },
    {
      "id": "nm1984126",
      "name": "Guglielmo Favilla",
      "character": "Businessman #2"
    },
    {
      "id": "nm6960480",
      "name": "Antonio Cecchi",
      "character": "Businessman #3"
    },
    {
      "id": "nm1583675",
      "name": "Claudio Marmugi",
      "character": "Businessman #4"
    },
    {
      "id": "nm3927503",
      "name": "Tiziano Martella",
      "character": "Businessman #5"
    },
    {
      "id": "nm4948973",
      "name": "Veronica Spagnuolo",
      "character": "Pool Girl #1"
    },
    {
      "id": "nm4948668",
      "name": "Marissa Chang",
      "character": "Pool Girl #2"
    },
    {
      "id": "nm4949548",
      "name": "Anelita Di Carlo",
      "character": "Pool Girl #3"
    },
    {
      "id": "nm3806915",
      "name": "Kawni Gilroy",
      "character": "Pool Girl #4"
    },
    {
      "id": "nm5275938",
      "name": "Stefano Rovai",
      "character": "Carter's Bodyguard #1"
    },
    {
      "id": "nm6088584",
      "name": "Marco Monti",
      "character": "Carter's Bodyguard #2"
    },
    {
      "id": "nm6088585",
      "name": "Luca Candotti",
      "character": "Human Guinea Pig"
    },
    {
      "id": "nm2653146",
      "name": "Federico Caddeo",
      "character": "Prisoner"
    },
    {
      "id": "nm6088586",
      "name": "Glaucia Virdone",
      "character": "Raped Girl"
    },
    {
      "id": "nm1998984",
      "name": "Alex Lucchesi",
      "character": "Zombie"
    }
  ],
  "overview": "A bacteriological weapon developed by the US Government to create a super soldier - spreads an epidemic in a quiet little town in the middle of Eastern Europe. All citizens have been turned into infected zombies. The plan is to bring an atomic bomb into the city's nuclear plant to pretend a terrible accident occurred. No one has to know the truth. A team of mercenaries is hired to complete the mission. The battle is on. Hordes of monsters against the team. Who will survive?",
  "storyline": "A bacteriological weapon developed by the US Government to create a super soldier - spreads an epidemic in a quiet little town in the middle of Eastern Europe. All citizens have been turned into infected zombies. The plan is to bring an atomic bomb into the city's nuclear plant to pretend a terrible accident occurred. No one has to know the truth. A team of mercenaries is hired to complete the mission. The battle is on. Hordes of monsters against the team. WHO WILL SURVIVE?",
  "plot": "On July 4, 1969, an unknown man attacks Darlene Ferrin and Mike Mageau with a handgun, at a lovers' lane in Vallejo, California. Mageau survives; Ferrin dies.\n\nOne month later, the San Francisco Chronicle receives encrypted letters written by the killer calling himself the \"Zodiac\" and taunting the police. Political cartoonist Robert Graysmith is not taken seriously by crime reporter Paul Avery or the editors and is excluded from the initial details about the killings despite his interest in the case. When the newspaper publishes the letters, a married couple is able to decipher one. At a local bar, Avery initially makes fun of Graysmith before they discuss the coded letters. Graysmith interprets the letter, which Avery finds helpful, and Avery begins sharing information. The Zodiac killer attacks law student Bryan Hartnell and Cecelia Shepard at Lake Berryessa in Napa County on September 27, 1969. Shepard dies two days later, and Hartnell survives. One of Graysmith's insights about the letters is that the Zodiac's reference to man as \"the most dangerous animal of them all\" is a reference to the story and film The Most Dangerous Game (which features General Zaroff as a man who hunts live human prey). The fact that both Zaroff's surname and the name \"Zodiac\" start with a \"Z\" also seems significant.\n\nTwo weeks later, San Francisco taxicab driver Paul Stine is shot and killed in the city's Presidio Heights district immediately after dropping the killer off. The Zodiac killer mails pieces of Stine's blood stained shirt to the Chronicle, along with a taunting letter. San Francisco police detectives Dave Toschi and his partner Bill Armstrong are assigned to the Stine case, and work closely with Vallejo's Jack Mulanax and Captain Ken Narlow in Napa. The killer, or someone posing as him, continues to toy with authorities by sending more letters and speaks on the phone with lawyer Melvin Belli when he makes an appearance on a television talk show. Avery and Graysmith form an alliance, delving deeper into the case as time permits.\n\nIn 1971, Detectives Toschi, Armstrong, and Mulanax question Arthur Leigh Allen, a suspect in the Vallejo case. Allen behaves suspiciously during the interview. They ask to see his watch and notice that he wears a Zodiac brand wristwatch which has the same logo used by the killer. However, a handwriting expert insists that Allen did not write the Zodiac letters, even though Allen is said to be ambidextrous. Avery receives a letter threatening his life; becoming increasingly paranoid, he turns to drugs and alcohol. At one point, he shares information with the Riverside Police Department, angering both Toschi and Armstrong. The case's notoriety weighs on Toschi, who is bothered when Graysmith shows up at the theater where Toschi is watching a Hollywood film, Dirty Harry, loosely based on the Zodiac case, with his wife.\n\nIn 1978, Avery leaves the Chronicle, and moves to the Sacramento Bee. Graysmith persistently contacts Toschi about the Zodiac murders, and eventually impresses the veteran detective with his knowledge of the case. While Toschi cannot directly give Graysmith access to the evidence, he provides contact names of other police departments in other counties where Zodiac murders occurred. Armstrong transfers from the San Francisco Police homicide division, and Toschi is demoted for supposedly forging a Zodiac letter. Graysmith continues his own investigation, which is profiled in the Chronicle, and he allows himself to be interviewed on television about his book-in-progress concerning the case. He begins receiving anonymous phone calls with heavy breathing. Because of his immersion in the case, Graysmith loses his job and his wife Melanie leaves him, taking their children with her. Graysmith acquires more information that points to Allen as the Zodiac, and although circumstantial evidence seems to indicate his guilt, the physical evidence, such as fingerprints and handwriting samples, do not implicate him.\n\nIn December 1983, Graysmith tracks Allen down to a Vallejo Ace Hardware store, where he is employed as a sales clerk. The men have a brief encounter before Graysmith leaves. Eight years later, victim Mike Mageau meets with authorities and identifies Allen from a police mugshot. As the authorities walk by an airport book store, copies of Graysmith's book Zodiac are shown. Final title cards inform the audience that Allen died in 1992 before he could be questioned further. A DNA test performed in 2002 on an archived autopsy sample did not match a partial DNA sample gathered from the postage stamp on one of the Zodiac letters, but this does not rule him out as a suspect.",
  "synopsis": null
}