{
  "imdb_id": "tt2072134",
  "tmdb_id": "131673",
  "douban_id": null,
  "title": "It's in the Blood (2012)",
  "genres": [
    "Drama",
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "81 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.6,
  "director": [
    {
      "id": "nm1692070",
      "name": "Scooter Downey"
    }
  ],
  "writer": [
    {
      "id": "nm1692070",
      "name": "Scooter Downey",
      "description": null
    },
    {
      "id": "nm3053884",
      "name": "Sean Elliot",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0000448",
      "name": "Lance Henriksen",
      "character": "Russell"
    },
    {
      "id": "nm3053884",
      "name": "Sean Elliot",
      "character": "October"
    },
    {
      "id": "nm3585927",
      "name": "Rose Sirna",
      "character": "Iris"
    },
    {
      "id": "nm1281943",
      "name": "Jimmy Gonzales",
      "character": "Michael"
    },
    {
      "id": "nm0408970",
      "name": "Doran Ingram",
      "character": "Truck Driver       (as Doran Ingrham)"
    },
    {
      "id": "nm2967554",
      "name": "Andrew Varenhorst",
      "character": "Monster"
    },
    {
      "id": "nm2304690",
      "name": "Cameron Wofford",
      "character": "Little October"
    },
    {
      "id": "nm2921892",
      "name": "Cassie Kinchen",
      "character": "Little Iris"
    },
    {
      "id": "nm3133509",
      "name": "Mark Meir",
      "character": "Deputy       (as Mark Scheibmeir)"
    },
    {
      "id": "nm2202931",
      "name": "Larry Jack Dotson",
      "character": "Deputy"
    },
    {
      "id": "nm4990617",
      "name": "David Jarrot",
      "character": "Deputy"
    },
    {
      "id": "nm1591663",
      "name": "Dog",
      "character": "Zeus"
    }
  ],
  "overview": "One year after a tragic incident tore their family apart, a grieving son and his estranged father embark on a journey into the wild to reconcile their past. When a horrifying accident leaves Russell badly injured, and strands them in the wild, it is up to October to save them both. However, this wilderness is not what it seems, and as they deteriorate, so to does their concept of reality.",
  "storyline": "When a father and son become stranded in the wild, they must confront the horrors of their past to escape with their lives.",
  "plot": "Christine, an advertising executive, is attempting to gain professional and romantic power over her up-and-coming subordinate, Isabelle, as revenge for her affair with Christine's lover, Dirk. Christine does everything in her power to ruin Isabelle's reputation and relationships. She also tries to fire Isabelle's secretary, Dani. Because of these events, Isabelle seemingly becomes emotionally destitute and develops an addiction to prescription drugs.\n\nAfter Christine is found dead, Isabelle is arrested and confesses to the murder while in a drug-induced trance. Desperate to prove her innocence, Isabelle shows the police that she has an alibi on the evening the murder took place. Dirk, having been drunk after being rejected by Christine, is arrested after a scarf with Christine's blood on it turns up in his car. Isabelle is freed and Dirk is charged with the murder despite his denials.\n\nEventually, it is revealed that Isabelle had murdered Christine, and set everything up to convince everyone that she was having a nervous breakdown while framing Dirk for the crime. Dani, who secretly is in love with Isabelle, reveals that she had captured Isabelle on video with her cellphone at various moments during the night of the murder. Dani then tries to blackmail Isabelle into becoming her lover. That night, Isabelle has a strange dream where she strangles Dani after being seduced by her, but not before Dani sends the video incriminating Isabelle to the investigating police detective. Suddenly, Christine's twin sister appears and strangles Isabelle from behind with a bloodstained scarf. The next moment, Isabelle wakes up in her own bedroom from her nightmare only to face a new one with Dani lying dead at the foot of her bed.",
  "synopsis": null
}