{
  "imdb_id": "tt2063008",
  "tmdb_id": "97794",
  "douban_id": null,
  "title": "The Road (2011)",
  "genres": [
    "Crime",
    "Drama",
    "Horror",
    "Thriller"
  ],
  "country": "Philippines",
  "version": [
    {
      "runtime": "110 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm0487990",
      "name": "Yam Laranas"
    }
  ],
  "writer": [
    {
      "id": "nm1414840",
      "name": "Aloy Adlawan",
      "description": "screenplay &"
    },
    {
      "id": "nm0487990",
      "name": "Yam Laranas",
      "description": "screenplay"
    },
    {
      "id": "nm0487990",
      "name": "Yam Laranas",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0898062",
      "name": "Carmina Villaroel",
      "character": "Carmela"
    },
    {
      "id": "nm0013793",
      "name": "Marvin Agustin",
      "character": "Boy's Father"
    },
    {
      "id": "nm2322483",
      "name": "Rhian Ramos",
      "character": "Ate Lara"
    },
    {
      "id": "nm1468588",
      "name": "TJ Trinidad",
      "character": "Luis"
    },
    {
      "id": "nm2991896",
      "name": "Barbie Forteza",
      "character": "Ella"
    },
    {
      "id": "nm4498610",
      "name": "Alden Richards",
      "character": "Teenage Luis"
    },
    {
      "id": "nm3441586",
      "name": "Louise de los Reyes",
      "character": "Joy"
    },
    {
      "id": "nm4495826",
      "name": "Derrick Monasterio",
      "character": "Brian"
    },
    {
      "id": "nm3693115",
      "name": "Lexi Fernandez",
      "character": "Janine"
    },
    {
      "id": "nm2690822",
      "name": "Ynna Asistio",
      "character": "Martha"
    },
    {
      "id": "nm2320054",
      "name": "Renz Valerio",
      "character": "Boy Luis"
    },
    {
      "id": "nm0430482",
      "name": "Jaclyn Jose",
      "character": "Sisters' Mom"
    },
    {
      "id": "nm1049183",
      "name": "John Regala",
      "character": "Chief"
    },
    {
      "id": "nm0667074",
      "name": "Allan Paule",
      "character": "Greg"
    },
    {
      "id": "nm0759707",
      "name": "Lloyd Samartino",
      "character": "Ella's Father"
    },
    {
      "id": "nm0535102",
      "name": "Gerald Madrid",
      "character": "Allan"
    },
    {
      "id": "nm3366972",
      "name": "Ana Abad Santos",
      "character": "Janine's Mother"
    },
    {
      "id": "nm2507691",
      "name": "Dex Quindoza",
      "character": "Mailman"
    },
    {
      "id": "nm3012235",
      "name": "Mae Fajardo",
      "character": "Lara's Ghost       (as Mai Fajardo)"
    },
    {
      "id": "nm5072056",
      "name": "Dave de Mesa",
      "character": "Mayor"
    },
    {
      "id": "nm5072085",
      "name": "Mart de Mesa",
      "character": "Police Captain"
    },
    {
      "id": "nm5072109",
      "name": "Nick de Mesa",
      "character": "Police Officer"
    }
  ],
  "overview": "A 12 year old cold case is reopened when three teens are missing in an old abandoned road where a gruesome murder is left undiscovered for three decades.",
  "storyline": "A twelve year old cold case is reopened when three teens are missing in an abandoned road. In the course of the investigation, deeper and gruesome stories of abduction and murders are discovered. After more than two decades, the secrets of the haunted road may finally be revealed.",
  "plot": "Graeme Willy (Simon Pegg) and Clive Gollings (Nick Frost) are British comic book enthusiasts and best friends who travel to the United States to attend the annual San Diego Comic-Con International, and to take a road trip through the American Southwest to visit sites significant to UFO lore. While driving on a remote desert highway at night, after a tense situation with some rednecks in a diner, Graeme and Clive observe a car driving erratically and then crash. They stop to investigate and offer assistance to the driver, who turns out to be an alien named Paul (voiced by Seth Rogen). Clive faints, but Graeme agrees to assist Paul and gives him a ride.\n\nLater, United States Secret Service Agent Zoil (Jason Bateman) arrives at the car crash site and informs his unseen female superior, \"the Big Guy\" (Sigourney Weaver), that he is closing in on Paul. She sends two inept rookies, Haggard (Bill Hader) and O'Reilly (Joe Lo Truglio), to assist Zoil.\n\nGraeme, Clive and Paul camp at an RV park run by two Christian fundamentalists; one-eyed Ruth Buggs (Kristen Wiig) and her father, Moses (John Carroll Lynch). Upon Ruth discovering Paul the next day, the three are forced to take her with them. During an argument about her religion, Paul transfers his collective knowledge to her, after which Ruth realises that everything she was raised to believe is questionable. Paul later uses his healing powers to cure Ruth's blinded eye and convinces her to moderate her fundamentalist beliefs and enjoy life more freely. The fugitives stop at a bar and Ruth tries to call Moses, but Zoil intercepts the call and she is accosted by the rednecks from the diner, starting a bar fight in the process. The group escapes when Paul terrifies the rednecks into fainting. Later, at another RV park, Ruth is questioned by Agent Zoil, but claims to know nothing about \"a one-eyed girl\" or \"two British nerds\". Released, she and Graeme retrieve Clive and Paul, who narrowly escape Haggard and O'Reilly. Frustrated, Zoil orders Haggard and O'Reilly to return to base, but they go behind his back and insist on catching the alien on their own.\n\nThe group soon arrive at a house owned by Tara (Blythe Danner), who rescued Paul when he first crashed on Earth, and as a result of no one believing her story, has spent her life as a pariah. As she makes tea for her visitors, Haggard, O'Reilly and Zoil surround the house. The fugitives flee, but O'Reilly shoots at them, igniting gas from Tara's stove and destroying her house. O'Reilly is apparently killed in the explosion. Haggard pursues and catches up to the RV. Due to an error in judgement, Haggard drives off a cliff and is killed. Zoil reassures the Big Guy that he will have Paul within the hour, but she is tired of waiting and informs Zoil that she has ordered a \"military response\".\n\nPaul, Graeme, Clive, Ruth and Tara arrive at Devils Tower National Monument, where they set off fireworks as a signal to Paul's mothership. A helicopter suddenly arrives with agents and The Big Guy. Zoil then appears and starts a stand-off, disabling the agents, but is then wounded by The Big Guy. Secretly, Zoil is Paul's friend and was attempting to aid the escape under cover of capturing Paul. The group fights The Big Guy and Tara knocks her out. Moses arrives unexpectedly and fires his shotgun with the intent on killing Paul but Graeme jumps in front of Paul and Ruth and is fatally wounded. Paul once again uses his healing powers to heal Graeme and revives him in spite of the danger to himself. Graeme and Ruth admit their feelings for each other and kiss, but then The Big Guy regains consciousness and holds the group at gunpoint. Just as The Big Guy is about to kill them, she is crushed by a suddenly arriving spaceship. Paul says goodbye to his friends before he leaves in the ship with Tara, promising to give her a new life after ruining her childhood. Two years later, Graeme, Clive, Ruth, Zoil and O'Reilly (who survived the explosion) are at another Comic-Con, where Graeme and Clive are promoting Paul, their best-selling novel.",
  "synopsis": null
}