{
  "imdb_id": "tt2076349",
  "tmdb_id": "148686",
  "douban_id": null,
  "title": "Penguins (Video 2012)",
  "genres": [
    "Adventure",
    "Drama",
    "Family"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "78 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.7,
  "director": null,
  "writer": [
    {
      "id": "nm1936714",
      "name": "Sias Wilson",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0000741",
      "name": "Tim Allen",
      "character": "Narrator       (voice)"
    },
    {
      "id": "nm0041003",
      "name": "David Attenborough",
      "character": "Himself       (voice)"
    }
  ],
  "overview": "South Georgia - alone in a vast ocean. 900 miles from Antarctica, and a mere 100 miles long. A wild rugged landscape with mountain ranges, vast glaciers, windblown plains half buried beneath snow and ice. Three years ago, the Penguin King left home. Now he is returning to the place where he was born and raised: Penguin City. One of the most densely-packed, sought-after pieces of real estate in the entire southern hemisphere and somehow he must establish his own place in it. He must find a mate.",
  "storyline": "Narrated by David Attenborough, \"Penguins 3D\" celebrates the destiny of a very special King Penguin, who returns to his birthplace in the sub-Antarctic. Known as Penguin City, the island is home to hundreds of albatrosses, fur seals and brawling elephant seals-as well as six million penguins! Somehow our hero must earn his place among the island inhabitants and fulfill his destiny by finding a mate and raising a family. What follows is the story of the most challenging time in a King Penguin's life, when he is driven to nurture and defend his offspring against harsh weather and fierce predators. This cosmic drama plays out in one of Earth's last great wildernesses, amid steep mountain ranges and windblown plains half buried beneath snow and ice. \"Penguins 3D\" is an unforgettable tale of one King Penguin's journey through his species' central rite of passage.",
  "plot": "Many days after bidding the penguins goodbye, Alex suggests to his friends and the lemurs that they should go to Monte Carlo to get the penguins and the chimpanzees and fly back to New York City, which they agree to do.\n\nIn Monte Carlo, the penguins and chimpanzees have been saving up their daily winnings from the casino to fly back to Africa and bring their friends home. Alex's interference to kidnap them leads to animal control, led by a vicious big-game hunter named Chantel DuBois, pursuing them around the city, with Alex and the gang barely escaping. With determination, DuBois vows to capture Alex and add him to her collection of animals she's captured (through taxidermy).\n\nIn the skies of France, the plane crashes as the authorities close in. They come across a circus train consisting of Stefano, Gia, and Vitaly, and manage to gain entry, claiming that they are circus animals themselves. The animals soon learn from Stefano that they are performing in Rome and London, where they plan to impress a promoter to get them on their first American tour. Before the zoo animals' claim is discredited, the penguins suddenly appear with a deal to purchase the circus themselves; however, the circus animals' show in Rome proves to be a failure.\n\nIn route to London, Stefano soon reveals to Alex that Vitaly was the biggest star of them all, but quit due to an accident in one of his stunts; therefore, the friends lost faith in the circus. At a stop in the Alps, Alex convinces the circus to continue pursuing the circus. In the process, they grow closer.\n\nMeanwhile, DuBois is arrested in Rome while chasing the animals, but escapes and discovers that Alex was the missing lion from the zoo in New York. Once free, DuBois recruits her injured men and they head toward the Alps, forcing the animals to proceed to London despite incomplete rehearsals. Alex finds Vitaly preparing to leave and convinces him to stay by reminding him of how he enjoys performing the impossible. He suggests that he uses hair conditioner as a safer lubricant to perform his flaming ring jump as well as fix his damaged fur. As a result, Vitaly's stunt is performed perfectly and the show is a spectacular success. After the impressed promoter arranges for an American tour, DuBois shows up with a paper showing that Alex was missing. Though the penguins are able to foil Dubois' plan, Alex is forced to confess that the four of them are just zoo animals trying to get home, disappointing the others who feel used and lied to.\n\nThe zoo animals and circus go their separate ways, but arrive in New York City at the same time. Realizing how much their adventures have changed them, the zoo animals find that their true home was with the circus. Before they can go back, however, DuBois tranquilizes and captures them, before being discovered by the zoo staff, who believe she is responsible for returning the missing animals. Julien and the penguins manage to get to the circus and convince the circus animals to rescue their friends.\n\nBack at the zoo, Alex awakens to find that he along with his friends are trapped in larger fence enclosures. DuBois, who was honored by the zoo guards, secretly loads a poison-filled dart into a gun that she hides inside a foam finger in preparation for publicly executing Alex. The circus animals arrive led by Skipper and are able to defeat DuBois and her henchmen. Alex and his friends decide to permanently join the circus to pursue their adventures. Meanwhile, DuBois and her henchmen are sent off in crates bound for Madagascar.",
  "synopsis": null
}