{
  "imdb_id": "tt2040537",
  "tmdb_id": "161482",
  "douban_id": null,
  "title": "The Coalition (Video 2012)",
  "genres": [
    "Comedy",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "101 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.4,
  "director": [
    {
      "id": "nm3475507",
      "name": "Monica Mingo"
    }
  ],
  "writer": [
    {
      "id": "nm3475507",
      "name": "Monica Mingo",
      "description": null
    },
    {
      "id": "nm2787318",
      "name": "Terrell Suggs",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1269155",
      "name": "Denyce Lawton",
      "character": "Skylar Hathaway"
    },
    {
      "id": "nm1867913",
      "name": "Eddie Goines",
      "character": "Prime Alexander"
    },
    {
      "id": "nm1169619",
      "name": "Adrienne Houghton",
      "character": "Katalina Santiago       (as Adrienne Bailon)"
    },
    {
      "id": "nm2824707",
      "name": "J.R. Ramirez",
      "character": "Lonzo Ramirez"
    },
    {
      "id": "nm3588708",
      "name": "Ingrid Clay",
      "character": "Autumn Singletary"
    },
    {
      "id": "nm3969761",
      "name": "Sant'e Andrews",
      "character": "Dallas"
    },
    {
      "id": "nm0255001",
      "name": "Nadine Ellis",
      "character": "Kennedy Lorenze'"
    },
    {
      "id": "nm1283650",
      "name": "Shanti Lowry",
      "character": "Dylan Singletary"
    },
    {
      "id": "nm0364068",
      "name": "Jackée Harry",
      "character": "Grandmother Hathaway"
    },
    {
      "id": "nm1377442",
      "name": "Nicole Garza",
      "character": "Carnegie"
    },
    {
      "id": "nm1506887",
      "name": "Satu Runa",
      "character": "Mira       (as Satu Makeda)"
    },
    {
      "id": "nm4762682",
      "name": "Quenton Harvey",
      "character": "Compton Que"
    },
    {
      "id": "nm4762515",
      "name": "Adrian Enrique Hernandez",
      "character": "Vidal       (as Adrian Hernandez)"
    },
    {
      "id": "nm4773488",
      "name": "Ricardo Alvarado",
      "character": "Poncho"
    },
    {
      "id": "nm5033221",
      "name": "Brad Blane",
      "character": "Bar Patron"
    },
    {
      "id": "nm4773190",
      "name": "Michelle Cohrt",
      "character": "Cathy"
    },
    {
      "id": "nm4773654",
      "name": "Trinidy Currier",
      "character": "Officer Suggs       (as Trinady Currier)"
    },
    {
      "id": "nm3945165",
      "name": "Tarik Dickens",
      "character": "Gala Attendee"
    },
    {
      "id": "nm4773346",
      "name": "John Dinane",
      "character": "Club Doorman"
    },
    {
      "id": "nm4773248",
      "name": "Amber Engram",
      "character": "Amber"
    },
    {
      "id": "nm4773305",
      "name": "Dawn Engram",
      "character": "Dawn"
    },
    {
      "id": "nm9524915",
      "name": "Christopher Fortin",
      "character": "Bar Patron"
    },
    {
      "id": "nm4773349",
      "name": "Dion Fowler",
      "character": "Mr. Rodriguez"
    },
    {
      "id": "nm4773437",
      "name": "Maria Fowler",
      "character": "Mrs. Rodriguez"
    },
    {
      "id": "nm4554326",
      "name": "Jeanette Hatlestad",
      "character": "Bar Patron"
    },
    {
      "id": "nm5650977",
      "name": "Taliban Hendrix",
      "character": "Bar Patron       (as Kyswan Diggs)"
    },
    {
      "id": "nm4817397",
      "name": "Chuck Holaday",
      "character": ""
    },
    {
      "id": "nm4824944",
      "name": "Debbie Jennings",
      "character": "Bar Patron /              Club Manager"
    },
    {
      "id": "nm2357996",
      "name": "Rita Kurtz",
      "character": "VIP Hostess"
    },
    {
      "id": "nm4773369",
      "name": "Lori Marik",
      "character": "Laura Lauderdale"
    },
    {
      "id": "nm4773330",
      "name": "Mark Marik",
      "character": "Robert Lauderdale"
    },
    {
      "id": "nm4041235",
      "name": "Mina Mirkhah",
      "character": "Camille"
    },
    {
      "id": "nm4454052",
      "name": "Joseph Newsome",
      "character": "Chyna"
    },
    {
      "id": "nm3797184",
      "name": "Dawn Nixon",
      "character": "Bar Patron"
    },
    {
      "id": "nm4579995",
      "name": "Chanta Patton",
      "character": "Shanita"
    },
    {
      "id": "nm4763214",
      "name": "James Phillips",
      "character": "Kalif"
    },
    {
      "id": "nm4762821",
      "name": "Sheba Price",
      "character": "Arielle       (as Sheba Shaffi Price)"
    },
    {
      "id": "nm4763204",
      "name": "Daniel Pryor",
      "character": "Jeff Trepagnier"
    },
    {
      "id": "nm8005520",
      "name": "Tonia M. Robinson",
      "character": "Gala attendee /              casino patron"
    },
    {
      "id": "nm4773620",
      "name": "Valerie Sanchez",
      "character": "Starr Rodriguez"
    },
    {
      "id": "nm4773240",
      "name": "Gina Soza",
      "character": "Susie Rodriguez"
    },
    {
      "id": "nm2744676",
      "name": "Kimberly Stahl",
      "character": "Heidi"
    },
    {
      "id": "nm4762728",
      "name": "Dahni Suggs",
      "character": "Dahni Wyatt"
    },
    {
      "id": "nm4762973",
      "name": "Donald Suggs",
      "character": "Chris"
    },
    {
      "id": "nm2787318",
      "name": "Terrell Suggs",
      "character": "Gala Attendee"
    },
    {
      "id": "nm4762606",
      "name": "L.J. Thurman",
      "character": "Driver"
    },
    {
      "id": "nm0317198",
      "name": "Tiffany Torrence-Davis",
      "character": "Shannon"
    },
    {
      "id": "nm4773309",
      "name": "Trevor Walkett",
      "character": "Mall Guy"
    },
    {
      "id": "nm3141832",
      "name": "Alexander Dean Williams",
      "character": "Luke"
    },
    {
      "id": "nm4255913",
      "name": "Vonet Woods",
      "character": "Milan Alexander"
    },
    {
      "id": "nm4773239",
      "name": "Leeza Zeigler",
      "character": "Reporter"
    }
  ],
  "overview": "A group of women form an unlikely alliance to get their revenge on a pro athlete and his three friends who played them. The guys are used to getting what they want when they want it, but that's all about to change.",
  "storyline": "Prime Alexander is a professional athlete living the life most men dream of. He has a huge guaranteed contract, beautiful women chasing him and the best friends a man could ask for. He's used to getting what he wants, when he wants it and doesn't believe in explaining himself to anyone, especially Autumn, the beautiful woman he's been dating for a little over a year. Autumn Singletary is a wealthy socialite who doesn't understand the word no. Her relationship with Prime has more to do with appearances than real feelings but that's of no consequence when Prime decides to end their relationship by publicly humiliating her in the presence of his new interest, Skylar. The bond Prime shares with his boys, Lonzo, Kalif and Dallas has been nurtured throughout the years as the main constant in their life. They are always together. They are always taking care of each other. They are a true pact and have the secrets and the code to prove it. 1080 for life. Lonzo, Prime's very best friend, is an...",
  "plot": "This section should be summarized in Development of Deus Ex and a link provided from there to here using the {{Main}} template. See guidance in Wikipedia:Summary style. (July 2014)Main article: Development of Deus ExDeus Ex director Warren Spector anddesigner Harvey Smith\nAfter Looking Glass Technologies and Origin Systems released Ultima Underworld II: Labyrinth of Worlds in January 1993, producer Warren Spector began to plan Troubleshooter, the game that would become Deus Ex. Spector found himself burnt out on fantasy and science fiction settings and hoped to make a game set in the real world. In his 1994 proposal, he described the concept as \"Underworld-style first-person action\" in a real world setting with \"big-budget, nonstop action\". Spector later commented that Origin did not have the interest, nor Looking Glass the funding, to produce the game. He eventually left Origin for Looking Glass and continued to develop the game's concept, but his project Junction Point, which was inspired by ideas from Troubleshooter, was canceled.[citation needed] After Spector and his team were laid off from Looking Glass, John Romero of Ion Storm offered him the chance to make his \"dream game\" without any restrictions. Spector quickly joined the company.\n\nPreproduction for Deus Ex began around August 1997 and lasted roughly six months. The six-person team came from Looking Glass's Austin studio. Spector, the team's director and producer, saw their work as improving upon the game design ideas of Origin, Looking Glass, and Valve Corporation by doing what those companies did not. The game's \"ironic\" working title was Shooter: Majestic Revelations, and it was scheduled for release on Christmas 1998. The team developed the setting before the game mechanics. Noticing his wife's fascination with The X-Files, Spector connected the \"real world, millennial weirdness, [and] conspiracy\" topics on his mind and decided to make a game about them that would appeal to a wide audience. Shooter's fiction was based in part on conspiracy theories related to Area 51, CIA drug trafficking, the John F. Kennedy assassination, the Majestic 12, and a Masonic bunker beneath Denver International Airport. The team designed over 200 characters without associated in-game roles,[clarification needed] which was both helpful when designing missions and unhelpful as they attempted to reduce their scope. Later in 1997, Spector wrote a \"manifesto\" on his ideal game and the structure of role-playing video games. His principles included \"problems, not puzzles\", \"no forced failure\", \"players do; NPCs watch\", and \"areas with multiple entrance and exit points\". In retrospect, Spector believed that Deus Ex accomplished the intent of his manifesto.\n\nThe Shooter design document cast the player as an augmented agent working against an elite cabal in the \"dangerous and chaotic\" 2050s. It cited Half-Life, Fallout, Thief: The Dark Project, and GoldenEye 007 as game design influences, and used the stories and settings of Colossus: The Forbin Project, The Manchurian Candidate, Robocop, The X-Files and Men in Black as reference points. According to the document, the game would engage with \"the millennial madness that's gripping the world ... and a general fascination with conspiracy theories and the desire to play with high-tech espionage toys\". The team designed a skill system that featured \"special powers\" derived from nanotechnological augmentation and avoided the inclusion of die rolling and skills that required micromanagement. Augmentations were unique to the player character. By March 1998, preproduction had generated 300 pages of documentation. The document grew to 500 pages, with \"radically different\" content, by the game's April 1999 Alpha 1 deadline. Of Spector's original design document, the marketing section was the only part left unedited.\n\nIn early 1998, the Deus Ex team grew to 20 people and the game entered a 28-month production phase. Spector hired new staff for his Austin studio and was assigned an art team from Ion Storm's Dallas branch. The development team consisted of three programmers, six designers, seven artists, a writer, an associate producer, a \"tech\", and Warren Spector, the producer, and director. Two writers and four testers were hired as contractors. Chris Norden was the lead programmer and assistant director, Harvey Smith the lead designer, Jay Lee the lead artist, and Sheldon Pacotti the lead writer. However, Spector's initial management structure, which involved two competing design teams and the matrix management of the Dallas art team, was a failure. According to Spector, the team was interested in multiple video game genres, and it contained both design maximalists who wanted to \"do everything\" and design minimalists who wanted to do a few things well. Close friends of the team who understood the intentions behind the game were invited to playtest and give feedback. The wide range of input led to debates in the office and changes to the game. Spector later concluded that the team was \"blinded by promises of complete creative freedom\", and by their belief that the game would have no budget, marketing or time restraints. By mid-1998, the game's title had become Deus Ex, derived from the Latin literary device deus ex machina (\"god from the machine\") in which a plot is resolved by an unpredictable intervention. Spector acknowledged its grammatical faults as a title, but he liked it because of its relevance to the in-game struggle for power, to the medium's storytelling difficulties, to the game being played on a computer, and to the \"self-referential\" acceptance of trying one's best to resolve affairs.\n\nSpector felt that the best aspects of Deus Ex's development were the \"high-level vision\" and length of preproduction, flexibility within the project, testable \"proto-missions\", and Unreal Engine license. The team's pitfalls included the management structure, unrealistic goals, underestimating risks with artificial intelligence, their handling of proto-missions, and weakened morale from bad press. He referred to that period of Ion Storm as \"Sturm und Drang\", because of the degree of hype and the vitriol following Daikatana's trash talk marketing, alongside negative press in 1998 and 1999. He said that his Austin team had \"frequent\" slumps in morale from taking the company's coverage personally and seeing their private emails posted online. Eventually, the Deus Ex Austin team developed a \"'we'll show them' mentality\" to distinguish their work and reputation from those of the Dallas branch. Deus Ex was released on June 23, 2000 and published by Eidos Interactive for Microsoft Windows. The team planned third-party ports for Mac OS 9 and Linux.\nDesign\n\nThe original 1997 design document for Deus Ex privileges character development over all other features, including experimental sequences and technology demos.[clarification needed] The game was designed to be \"genre-busting\": in parts simulation, role-playing game, first-person shooter, and adventure. The team wanted players to consider \"who they wanted to be\" in the game, and for that to alter how they behaved in the game. In this way, the game world was \"deeply simulated\", or realistic and believable enough that the player would solve problems in creative, emergent ways without noticing distinct puzzles. The developers also wanted to include \"choice\" and \"consequence\", which Spector called the team's \"two most frequently uttered words\". However, the team's simulation ultimately failed to maintain the desired level of openness, and they had to brute force \"skill\", \"action\", and \"character interaction\" paths through each level. Playtesting also revealed that their idea of a role-playing game based in the real world was more interesting in theory than in reality. The team chose two real-world bases for levels: \"highly interconnected, multi-level\" spaces, and places that most cannot visit (e.g., the White House). In practice, the team found that certain aspects of the real world, such as hotels and office buildings, were not compelling in a game. Ion Storm saw Deus Ex as being about \"player expression\" rather than making the developers appear \"clever\". They treated the player as a \"collaborator\", who they sought to empower to \"make choices and ... deal with the consequences\". Spector credited the 1995 role-playing video game Suikoden as an inspiration, stating that the limited choices in Suikoden inspired him to expand on the idea with more meaningful choices in Deux Ex.\nThe premise of Deus Ex was inspired by conspiracy theories such as those behind the JFK assassination\nThe game's story changed greatly during production, but the idea of an augmented counterterrorist protagonist named JC Denton remained throughout. Though Spector originally pictured Deus Ex as akin to The X-Files, lead writer Sheldon Pacotti felt that it ended up more like James Bond. Spector wrote that the team overextended itself by planning highly elaborate scenes, including a replica of downtown Austin, a reconstruction of Area 51 from satellite data, a sunken post-earthquake Los Angeles, a raid to free thousands of prisoners of war from a Federal Emergency Management Agency-controlled United Nations concentration camp, and over 25 missions throughout Siberia, western Europe, and the United States. Designer Harvey Smith pushed for the removal of a subplot in which Mexico invaded Texas, in order to make development easier and the narrative more personal. He also removed a largely complete White House level due to its complexity and production needs.[b] Finished digital assets were repurposed or, in the cases of Texas and the Denver airport, abandoned by the team. Pete Davison of USgamer referred to the White House and presidential bunker as \"the truly deleted scenes of Deus Ex's lost levels\".\n\nOne of the things that Spector wanted to achieve in Deus Ex was to make JC Denton a cipher for the player, in order to create a better immersion and gameplay experience. He did not want the character to force any emotion so that whatever feelings the player may be experiencing comes from themselves rather than from JC Denton. To do this, Spector instructed voice actor Jay Anthony Franke to record his dialogue without any emotion but in a monotone voice, which is unusual for a voice acting role.\n\nOnce coded, the team's game systems did not work as intended. Prototypes of the systems and of certain missions were built near the beginning of development, which revealed some of the team's planning mistakes. For example, the early tests of the conversation system and user interface were flawed, but the team had time to revise them before the game's release. The team also found augmentations and skills to be less interesting than they had seemed in the design document. Colleagues from other companies—such as Doug Church, Rob Fermier, Marc LeBlanc, and Gabe Newell—noticed and pointed out these deficiencies in game \"tension\" when they played the prototype. In response, Harvey Smith substantially revised the augmentations and skills. Production milestones served as wake-up calls for the game's direction. A May 1998 milestone that called for a functional demo revealed that the size of the game's maps caused frame rate issues, which was one of the first signs that maps needed to be cut. A year later, the team reached a milestone for finished game systems that Spector nicknamed the \"Wow, these missions suck\" milestone, which led to better estimates for their future mission work and to the reduction of the 500-page design document to 270 pages. Spector recalled Smith's mantra on this point: \"less is more\". \n\nOne of the team's biggest blind spots was the AI programming for NPCs. Spector wrote that they considered it in preproduction, but that they did not figure out how to handle it until \"relatively late in development\". This led to wasted time when the team had to discard their early AI code. The team built atop their game engine's shooter-based AI instead of writing new code that would allow characters to exhibit convincing emotions. As a result, NPC behavior was variable until the very end of development. Spector felt that the team's \"sin\" was their inconsistent display of a trustable \"human AI\".\nTechnology\nDeus Ex used the Unreal game engine, which was designed for first-person shooters\nThe game was developed on systems including dual-processor Pentium Pro 200s and Athlon 800s with eight and nine gigabyte hard drives, some using SCSI. The team used \"more than 100 video cards\" throughout development. Deus Ex was built using Visual Studio, Lightwave, and Lotus Notes. They also built a custom dialogue editor, ConEdit. The team used UnrealEd atop the Unreal game engine for map design, which Spector wrote was \"superior to anything else available\". Their trust in UnrealScript led them to code \"special-cases\" for their immediate mission needs instead of more generalized multi-case code. Even as concerned team members expressed misgivings, the team only addressed this later in the project. To Spector, this was a lesson to always prefer \"general solutions\" over \"special casing\", such that the tool set works predictably.\n\nThey waited to license a game engine until after preproduction, expecting the benefits of licensing to be more time for the content and gameplay, which Spector reported to be the case. They chose the Unreal engine as it did 80% of what they needed from an engine and was more economical than building from scratch. Their small programming team allowed for a larger design group. The programmers also found the engine accommodating, though it took about nine months to acclimate to the software. Spector felt that they would have understood the code better had they built it themselves, instead of \"treating the engine as a black box\" and coding conservatively. He acknowledged that this precipitated into the Direct3D issues in their final release, which slipped through their quality assurance testing. Spector also noted that the artificial intelligence, pathfinding, and sound propagation were designed for shooters and should have been rewritten from scratch instead of relying on the engine. He thought the licensed engine worked well enough that he expected to use the same for the game's sequel and Thief 3. He added that developers should not attempt to force their technology to perform in ways it was not intended, and should find a balance between perfection and pragmatism.\nMusic\n\nAlexander Brandon \"Deus Ex Main Title\"\n30-second sample from the theme song of Deus Ex.\nProblems playing this file? See media help.\nThe soundtrack of Deus Ex, composed by Alexander Brandon (primary contributor, including main theme), Dan Gardopée (\"Naval Base\" and \"Vandenberg\"), Michiel van den Bos (\"UNATCO\", \"Lebedev's Airfield\", \"Airfield Action\", \"DuClare Chateau\" plus minor contribution to some of Brandon's tracks), and Reeves Gabrels (\"NYC Bar\"), was praised by critics for complementing the gritty atmosphere predominant throughout the game with melodious and ambient music incorporated from a number of genres, including techno, jazz, and classical. The music sports a basic dynamic element, similar to the iMUSE system used in early 1990s LucasArts games; during play, the music will change to a different iteration of the currently playing song based on the player's actions, such as when the player starts a conversation, engages in combat, or transitions to the next level. All the music in the game is tracked - Gabrels' contribution, \"NYC Bar\", was converted to a module by Brandon.\n\nA compact disc of the Deus Ex soundtrack was included in the Game of the Year edition and is not available for separate purchase. Notably, the soundtrack is not a direct audio rip from the game itself, however; it is a \"remastering\" of the soundtrack with added instruments and audio production. Originally only thirty tracks were included with the re-release, with tracks thirty-one through forty-one considered as extras.[citation needed] The PlayStation 2 port featured live, orchestral renditions of some tracks.[citation needed]",
  "synopsis": null
}