{
  "imdb_id": "tt2096615",
  "tmdb_id": "79976",
  "douban_id": null,
  "title": "Steve Jobs: One Last Thing (TV Movie 2011)",
  "genres": [
    "Documentary",
    "Biography"
  ],
  "country": "USA",
  "version": [],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm1282155",
      "name": "Sarah Hunt"
    },
    {
      "id": "nm3677789",
      "name": "Mimi O'Connor"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm0187877",
      "name": "Robert X. Cringely",
      "character": ""
    },
    {
      "id": "nm1530382",
      "name": "Bill Fernandez",
      "character": ""
    },
    {
      "id": "nm0330983",
      "name": "Demetri Goritsas",
      "character": "Narrator"
    },
    {
      "id": "nm4747042",
      "name": "Dean Hovey",
      "character": ""
    },
    {
      "id": "nm0423418",
      "name": "Steve Jobs",
      "character": "Himself"
    },
    {
      "id": "nm4746553",
      "name": "Robert Palladino",
      "character": ""
    },
    {
      "id": "nm0674437",
      "name": "Ross Perot",
      "character": ""
    },
    {
      "id": "nm1443238",
      "name": "Will.i.am",
      "character": "(as Will i Am)"
    },
    {
      "id": "nm0941967",
      "name": "Steve Wozniak",
      "character": ""
    }
  ],
  "overview": "Through interviews with colleagues and others who knew the creative genius whose innovations transformed the lives of millions, ONE LAST THING provides an inside look at the man and the major influences that helped shape his life and career.",
  "storyline": "Through interviews with colleagues and others who knew the creative genius whose innovations transformed the lives of millions, ONE LAST THING provides an inside look at the man and the major influences that helped shape his life and career.",
  "plot": null,
  "synopsis": "This PBS documentary begins with a montage of comments from his contemporaries leading to his death. The film then moves back to fill-in milestones in the life of Steve Jobs. His partnership with Steve Wozniak eventually led to the invention of the first Apple computer. But before that, their first joint project was to make a machine which could mimic the AT&T phone system so they could make free long-distance phone calls. The partnership flourished: Jobs was the people-person who could and did charm anyone while Wozniak ('Woz') remained the nerd who would figure out how to make what Jobs imagined. Title cards separate segments of Jobs' life: 'Entrepreneur', 'Artist', 'Innovator', etc. To further illustrate these aspects of his life, many people were interviewed who knew and recognized those segments in his life. The interviews then were broken-up and used to illustrate segments of Jobs' life. His only misstep was to bring in John Scully from Pepsi. Scully took over and Jobs was fired. Then the culture of Apple changed from creative to corporate. When Apple verged on bankruptcy, Jobs was brought back. 'Savior', 'Visionary' describe Jobs when he returned. He became famous for his new product introductions. He always introduced several products but then saved his biggest innovation for the last: One Last Thing."
}