{
  "imdb_id": "tt2046090",
  "tmdb_id": "111443",
  "douban_id": null,
  "title": "The End (2012)",
  "genres": [
    "Drama",
    "Sci-Fi",
    "Thriller"
  ],
  "country": "Spain",
  "version": [
    {
      "runtime": "88 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.9,
  "director": [
    {
      "id": "nm0868441",
      "name": "Jorge Torregrossa"
    }
  ],
  "writer": [
    {
      "id": "nm1037221",
      "name": "Sergio G. Sánchez",
      "description": null
    },
    {
      "id": "nm0346277",
      "name": "Jorge Guerricaechevarría",
      "description": null
    },
    {
      "id": "nm3427616",
      "name": "David Monteagudo",
      "description": "novel"
    }
  ],
  "cast": [
    {
      "id": "nm0893941",
      "name": "Maribel Verdú",
      "character": "Maribel"
    },
    {
      "id": "nm1268637",
      "name": "Daniel Grao",
      "character": "Félix"
    },
    {
      "id": "nm1242939",
      "name": "Clara Lago",
      "character": "Eva"
    },
    {
      "id": "nm0749715",
      "name": "Carmen Ruiz",
      "character": "Sara"
    },
    {
      "id": "nm1846255",
      "name": "Andrés Velencoso",
      "character": "Hugo"
    },
    {
      "id": "nm2087841",
      "name": "Miquel Fernández",
      "character": "Sergio"
    },
    {
      "id": "nm2861706",
      "name": "Blanca Romero",
      "character": "Cova"
    },
    {
      "id": "nm0308272",
      "name": "Antonio Garrido",
      "character": "Rafa"
    },
    {
      "id": "nm1079001",
      "name": "Eugenio Mira",
      "character": "Ángel 'Profeta'"
    },
    {
      "id": "nm6092821",
      "name": "Sofía Herraiz",
      "character": "Niña"
    }
  ],
  "overview": "A group of old friends gets together for a weekend in a mountain cabin. Years have gone by and yet nothing seems to have changed between them. But lurking behind the laughter and stories is a murky episode from the past that continues to haunt them. A strange, sudden incident alters their plans, leaving them stranded and with no line of communication to the outside world. On their way for help, the group starts to disintegrate, just as a new natural order is unveiled before their astonished eyes.",
  "storyline": "A group of old friends gets together for a weekend in a mountain cabin. Years have gone by and yet nothing seems to have changed between them. But lurking behind the laughter and stories is a murky episode from the past that continues to haunt them. A strange, sudden incident alters their plans, leaving them stranded and with no line of communication to the outside world. On their way for help, the group starts to disintegrate, just as a new natural order is unveiled before their astonished eyes.",
  "plot": null,
  "synopsis": "La película empieza con unos dibujos hechos a lápiz; son dibujos de monstruos y angustia. El dibujante se va de una playa y se mete en el metro. Le dice \"hola\" a otro de los pasajeros, pero el ejecutivo no se digna a estrecharle la mano que le tiende. Un reloj pone 23 JUN, 21:26Sergio (Miquel Fernández) entra en el parking de un edificio. Allí le espera también Eva (Clara Lago), su novia. Él comenta que tienen por delante cuatro horas de coche. Ella revista las fotografías de los amigos: Rafa (Antonio Garrido), Félix (Daniel Grao), Ángel, apodado El Profeta (Eugenio Mira), Sara (Carmen Ruiz), Hugo (Andrés Velencoso) el más guapo de todos, y Maribel (Maribel Verdú). Sergio era el artista de la pandilla, y Ángel, un chalado. Llegan a la casa en la sierra madrileña, se supone. Está bastante aislada. Ángel es el único que aún no ha llegado. Cova (Blanca Romero) es la mujer de Hugo, y también está allí, mirando como Hugo corta leña para la hoguera. Ponen la mesa para cenar. Ángel aún no ha llegado, y eso que la idea de la reunión era suya. Se ríen después de la cena juntos de las caras de las fotos antiguas.Sara está preocupada. Hugo le entra a Eva; los dos se besan y Cova los ve, aunque no los interrumpe. Por la noche, brindan a la luz de la hoguera. Esperan la lluvia de estrellas de la noche de San Juan, tradicionalmente llamadas lágrimas de San Lorenzo. Uno de los chicos se desnuda y hace su brindis a la luz de la hoguera, a la que tira su ropa; Cova chilla que si le han echado alguna droga en la bebida. El cielo se ilumina, y se oye como una explosión.De vuelta a casa, no hay electricidad ni teléfono. Maribel le tira a Hugo una manta. Sara piensa que todo es una broma de Ángel. Resulta que a Ángel le había dado una especie de ataque y sus amigos no encontraron las pastillas para darle. Como decía cosas muy raras, acabó en el psiquiátrico, y nadie lo fue a visitar en 20 años. Ahora que salió, se le ocurrió juntarlos a todos. Rafa reconoce que su empresa va mal, que no es un triunfador. Las parejas se van a dormir enfadadas.Es de día y los coches no arrancan. Son las 12:00 del día siguiente. Ángel no llega. Van andando al pueblo más cercano. En la primera casa que llegan no hay nadie, pero Maribel encuentra una puerta abierta. No hay línea de teléfono, la mesa está puesta. Hay lo que parece un taller de taxidermia, pero resulta que el buitre está vivo, asustando a Maribel, que grita. Los demás rompen el cristal de la puerta para entrar.Siguen su camino. Unos campistas desaparecieron, pero ven a una persona moviéndose en la cima de un peñasco lejos. Es un camino peligroso, cerca de un barranco. Cova dice que está muy cansada y se retrasa. Una manada de cabras corriendo aparecen en dirección contraria. Todos tienen que arrimarse a la pared para que no los arrastren, los tiren por el barranco o les pasen por encima. Rafa intenta hablar con Cova. Ella dice que está cansada, y parece durar si tirarse por el barranco o no. Como los dos intentan correr en la dirección contraria a la manada de cabras, Rafa está a punto de caerse por el barranco. Las cabras pasan rápido. Los demás levantan a Rafa, pero Cova ha desaparecido. Su cuerpo no se ve en el fondo del barranco, ni en el camino.Llegan a la costa. Empiezan a entender que algo muy serio ha pasado, y que esto no es una broma.Duermen a la intemperie. Uno de ellos se despierta pensando que ha oído un coche, pero resulta que eran sólo los pájaros. Además, el chico que estaba montando guardia ha desaparecido. Corren hacia otro ruido, y es un grupo de ovejas abandonadas dentro de un camión abandonado. Sara libera a las ovejas. De repente, encuentran uno de los dibujos extraños del principio tirado en el suelo. Sara ve a alguien en un coche accidentado. Resulta que es un hombre, y Eva, que es la primera en llegar, le toma el pulso y se da cuenta de que está muerto.Sara se escandaliza de que nadie más lo reconozca: es Ángel. Hugo manda callar a Sara, que se está poniendo histérica. Entierran a Ángel. Sergio se queda con el cuaderno y los dibujos de Ángel.Los chicos toman el sol sobre unas rocas a la orilla del río. Hace sol, y el día está claro. Hugo y Sergio tienen una conversación no demasiado amistosa. Hugo se tira a nadar al río, e inmediatamente desaparece. Sergio se tira al río detrás de él, pero no encuentra nada. Eva también se tira al agua, sin encontrar nada extraño: el río es de aguas limpias y cristalinas. Maribel acusa a Sara de que lo sabía desde lo de Rafa; Sara se da cuenta de que van a acabar desapareciendo uno a uno. No morirse, no que quede un cadáver: desaparecer de repente.Llegan en un camping de caravanas: en la terraza, hay zumos de naranja a medio tomar, fichas de dominó a punto de ser jugadas, un bolso de playa. A nadie le dio tiempo de recoger nada. Entran en una cafetería, completamente abandonada, pero aún con comida en el mostrador. Aprovechan para reponer provisiones. Félix está llorando, y de repente, desaparece.Sara encuentra un perrito ladrando, atado a un poste. Lo suelta y lo llama para que vuelva con ella, pero no le hace caso.Cogen unas bicis. Aparece otro perro más grande. Sara no hace caso a sus amigos y le da de comer. Pronto aparece una jauría entera que los ataca al oler la comida. Al final, es Sergio quien tira un paquete de comida y aleja a los perrazos momentáneamente.Salen escopeteados en sus bicicletas. Tienen que animar mucho a Sara, que parece no estar acostumbrada al ejercicio físico. Eva se retrasa para animarla. Parece que la jauría ya los ha alcanzado, pero al final, todos sobreviven.Sin embargo, Sergio tiene que hablar con Sara: le dice que no se rinda. Ella llora, y dice que no quiere quedarse sola. Sergio la llama, pero llega un momento en que Sara no puede hablar más, tal es su angustia. De repente, Sara ha desaparecido, sin más. Su bicicleta se queda tirada en el arcén de la carretera, con una rueda girando. Eva y Maribel se abrazan desoladas.Maribel, Eva y Sergio siguen caminando. Llegan a una alameda y se paran al ver humo saliendo de entre un campo de maíz. Sergio comprueba que hay un dibujo en el cuaderno de Sergio que describe la escena tal cual.Entre el fuego y los escombros, encuentran un trocito de las instrucciones de seguridad de un avión. Se suben a un trozo de ala y ven los restos.Por fin, llegan a un pueblo. A la entrada, un taxi abandonado y los carteles anunciando el circo que llega. El mar está del otro lado de las murallas. Entran en una casa y Sergio coge un rifle. Suben con las bicis hasta una iglesia. Sergio hace sonar la campana, pero nadie acude. Hay cirios todavía encendidos. Maribel enciende más velas.Sergio le enseña a Maribel los dibujos de Ángel, diciéndole que él lo sabía todo: la jauría, los perros, el río en que desapareció Hugo. También aparece la cara de un león y un hombre y una mujer de espaldas, en un velero surcando durante la noche. La última página ha sido arrancada.Oyen a una niña gritar. La niña huye de ellos. Se oye el rugido del león del circo cerca.La niña les lleva hasta el puerto y se encierra en un velero. Maribel intenta calmarla y hablar con ella. Lo consigue enseñándole la foto de ella con su amiga. La niña se calma, se acerca a la ventana para tocar la foto al otro lado del cristal; se ve su sombra acercarse, pero inmediatamente, ya no está ahí. Sergio fuerza la puerta y mira dentro del velero, pero no encuentra nada.Esto a Maribel le afecta muchísimo. El león se acerca. Sergio dice a Maribel que no va a disparar, que van a soltar amarras muy despacito e irse. Sergio y Eva le dicen a Maribel que suba al barco, pero ella camina hacia el león. Eva le dice a Sergio que dispare. Éste lo hace, pero no acierta al león. Al tercer intento, Maribel se le pone en la línea de tiro, y Sergio prefiere disparar para que tenga una muerte rápida. La foto de Maribel de niña queda flotando en el agua.Sergio encuentra la última hoja que faltaba: Eva está sola en la cubierta del velero. Cuando él va a sentarse junto a ella, sabe perfectamente que él será el siguiente en desaparecer, y después ella se quedará sola. Tienen una conversación, sobre el pasado. Durante la noche, Sergio y Eva se miran fijamente, se besan en la boca y duermen abrazados.A la mañana siguiente, es Eva la que no está en la cama. Sergio sale a ver. Eva está en cubierta, mirando fijamente al horizonte.Se sienta a su lado, se cogen de la mano y se miran a los ojos. La niebla los envuelve.--- Escrito por KrystelClaire"
}