{
  "imdb_id": "tt2061822",
  "tmdb_id": "119478",
  "douban_id": null,
  "title": "The Devil in Me (2012)",
  "genres": [
    "Horror"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "98 min",
      "description": "edited"
    }
  ],
  "imdb_rating": 4.2,
  "director": [
    {
      "id": "nm3419080",
      "name": "Greg A. Sager"
    }
  ],
  "writer": [
    {
      "id": "nm2326370",
      "name": "Geoff Hart",
      "description": null
    },
    {
      "id": "nm3419080",
      "name": "Greg A. Sager",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4679011",
      "name": "Michelle Argyris",
      "character": "Alex Froshiber"
    },
    {
      "id": "nm2689181",
      "name": "Shantelle Canzanese",
      "character": "Jessica Martin"
    },
    {
      "id": "nm3230459",
      "name": "Vanessa Broze",
      "character": "Breanne Whitaker"
    },
    {
      "id": "nm1790768",
      "name": "Kevin Walker",
      "character": "Brian Wolski       (as Kevin Jake Walker)"
    },
    {
      "id": "nm4678899",
      "name": "Wayne Conroy",
      "character": "Professor Madison       (as Wayne M. Conroy)"
    },
    {
      "id": "nm5154453",
      "name": "Danielle White",
      "character": "Possessed Girl 1970"
    },
    {
      "id": "nm0807755",
      "name": "Colin Smith",
      "character": "Young Priest 1970"
    },
    {
      "id": "nm5154946",
      "name": "Dick Vance",
      "character": "Cop #1 1970"
    },
    {
      "id": "nm5143488",
      "name": "Louise Hollingsworth",
      "character": "Old Psychic Woman"
    },
    {
      "id": "nm5155215",
      "name": "Alan Branton",
      "character": "College Professor"
    },
    {
      "id": "nm5154196",
      "name": "Angelina Mueller-Lavictoire",
      "character": "Little Girl"
    },
    {
      "id": "nm4693167",
      "name": "Michael G. Wilmot",
      "character": "Father Madison"
    },
    {
      "id": "nm0420287",
      "name": "David Jeffrey",
      "character": "ER Doctor       (as David Jeffery)"
    },
    {
      "id": "nm5155114",
      "name": "Melissa Patriquin",
      "character": "Adoption Agent"
    },
    {
      "id": "nm3837837",
      "name": "Sabrina D'Amour",
      "character": "Adoption Wife"
    },
    {
      "id": "nm0601210",
      "name": "Frank Moore",
      "character": "Adoption Husband"
    },
    {
      "id": "nm8989759",
      "name": "David Jeffrey",
      "character": "ER Doctor"
    },
    {
      "id": "nm9305708",
      "name": "Dunbar Thompson",
      "character": "Detective"
    }
  ],
  "overview": "Alexandra is a lively college student returning to live with her roommates Jessica and Breanne after the summer holidays. After a night of drinking, Alex agrees to a psychic reading to learn about her future with her boyfriend, Brian, but during the reading a dramatic turn of events causes SOMETHING to go drastically wrong. When Alex awakes the next day, she cant remember the events of the night before. She begins to hear creepy noises, hallucinate, black out and receive unidentifiable scratch marks all over her body. Afraid shes going crazy, she seeks help from her friends but Jessica, Breanne and Brian are incapable of comprehending the scope of the darkness descending UPON her. Instead, Alex receives help from a school professor and his father who have dealt with the supernatural before. But as Alexs condition worsens, it becomes apparent that it may already be too late to stop the entity from using Alexs body as a gateway into our world (IMDb.com).",
  "storyline": "This movie is about Alex, a returning college student who moves in with her girlfriends after the holidays. They go out and have quite a few drinks and on the way home Alex and her friend Jessica go to a psychic where Alex has an episode and freaks out her friend and the psychic. The next day Alex doesn't have any memory of what happened and her friends think there's something going on with her. Over time, she starts having things happen to her, scratches, visions and ultimately rape from some being. Her friends start to worry about her even more and things take a turn for the worst when she loses control. What is inside her, and will they all live?",
  "plot": "On October 30, 1989, Maria Rossi (Suzan Crowley) committed a triple murder during an exorcism performed on her. The Catholic Church became involved, and she has since been in a Catholic psychiatric hospital in Rome. A news story and police investigation show the three members of the clergy whom she murdered. Her daughter, Isabella, learned of the murders from her father, who died three days after telling her.\n\nTwenty years later, Isabella (Fernanda Andrade) is in the process of filming a documentary about exorcisms and, to find out more about her mother, she visits a school in Rome. She meets two priests, Ben (Simon Quarterman) and David (Evan Helmuth), who take her with them on an exorcism performed on Rosalita (Bonnie Morgan). They bring along medical equipment to determine if it's possession or mental illness. Rosalita attacks the crew after spouting out obscene remarks in different languages and accents. She calls Isabella by her name, despite not knowing her. Eventually, they get her under control.\n\nWhen Isabella goes to visit her mother, Maria, in the asylum, she finds that her mother speaks in different accents and has paintings all over the walls. She has inverted crosses carved into her arms and her bottom lip. Maria tells Isabella that killing a child is against God's will. Isabella tells David and Ben that she had an abortion years ago and her mother had no way of knowing that—another sign that showed possible possession. As the crew prepares to perform an exorcism/analysis on Maria, David worries about losing his job, since the Church does not authorize exorcisms without undeniable proof that the patient is indeed possessed. During the procedure, Maria mentions knowing what Ben did in the past.\n\nAfter analyzing the data from the video and audio files, they present the evidence to the Church. David shows many signs of stress, as Ben plays the audio files over and over. Ben finds that there are four different demons speaking in unison. David is to perform a baptism at his church, in which Michael tags along to record. When he holds the baby to start the immersion baptism, he mutters some lines from the Bible and starts forcefully submerging the baby in the holy water. The crowd rush up to save the baby as he passes out.\n\nSoon after, Ben finds David at home with blood all over his forearms, much the way Maria was during the exorcism. The police arrive, and David acquires an officer's handgun and holds it in his mouth. Ben tells him to fight it, but he begins to weep, reciting the Lord's Prayer, and forgets the last few words. He laughs and shoots himself. Isabella begins having a seizure.\n\nBen hysterically comes to the realization that Isabella is possessed. Ben and Michael leave with Isabella in a car, heading to get help for a potential exorcism. While Michael drives, Isabella speaks of also knowing the horrible act Ben committed, scaring Ben. She then tries to strangle Michael and breathes into his mouth. He instantly shows signs of possession, and acceleration can be heard as Michael speeds into oncoming traffic. The camera goes black, and cuts in with short sequences of chaos, most likely of Michael, Isabella and Ben flying through their car windshield, their outcome unknown.\n\nBefore the credits start rolling, a title card is shown informing that the case of the Rossi family is still unresolved, followed by another title card directing viewers to a website (www.TheRossiFiles.com, currently defunct) \"for more information on the ongoing investigation\".",
  "synopsis": "Alexandra is a lively college student returning to live with her roommates Jessica and Breanne after the summer holidays. After a night of drinking, Alex agrees to a psychic reading to learn about her future with her boyfriend, Brian, but during the reading a dramatic turn of events causes SOMETHING to go drastically wrong. When Alex awakes the next day, she cant remember the events of the night before. She begins to hear creepy noises, hallucinate, black out and receive unidentifiable scratch marks all over her body. Afraid shes going crazy, she seeks help from her friends but Jessica, Breanne and Brian are incapable of comprehending the scope of the darkness descending UPON her. Instead, Alex receives help from a school professor and his father who have dealt with the supernatural before. But as Alexs condition worsens, it becomes apparent that it may already be too late to stop the entity from using Alexs body as a gateway into our world."
}