{
  "imdb_id": "tt2066041",
  "tmdb_id": "94319",
  "douban_id": null,
  "title": "Pray for Japan (2012)",
  "genres": [
    "Documentary",
    "History"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.0,
  "director": [
    {
      "id": "nm1646305",
      "name": "Stuart J. Levy"
    }
  ],
  "writer": [
    {
      "id": "nm4720731",
      "name": "Ryôichi Wagô",
      "description": "poetry written by as Ryoichi Wago"
    }
  ],
  "cast": [
    {
      "id": "nm2201894",
      "name": "Hiroyuki Abe",
      "character": "Himself"
    },
    {
      "id": "nm4915241",
      "name": "Najeeb Ullah Ayaz",
      "character": "Himself"
    },
    {
      "id": "nm4914865",
      "name": "Shu Chiba",
      "character": "Himself"
    },
    {
      "id": "nm2219368",
      "name": "Manabu Endo",
      "character": "Himself"
    },
    {
      "id": "nm4916038",
      "name": "Kento Ito",
      "character": "Himself"
    },
    {
      "id": "nm4916005",
      "name": "Shuki Ito",
      "character": "Himself"
    },
    {
      "id": "nm4915966",
      "name": "Tsukasa Kurosawa",
      "character": "Himself"
    },
    {
      "id": "nm4915364",
      "name": "Mitsunori Monma",
      "character": "Himself"
    },
    {
      "id": "nm4915957",
      "name": "Anees Ahmad Nadeem",
      "character": "Himself"
    },
    {
      "id": "nm4914639",
      "name": "Hideo Otsuki",
      "character": "Himself"
    },
    {
      "id": "nm3233736",
      "name": "Jun'ichi Satô",
      "character": "Himself       (as Junichi Sato)"
    },
    {
      "id": "nm4914580",
      "name": "Chieko Seto",
      "character": "Herself"
    },
    {
      "id": "nm4915653",
      "name": "Yoshiaki Shoji",
      "character": "Himself"
    },
    {
      "id": "nm0840624",
      "name": "Kyôka Suzuki",
      "character": "Poetry reader       (voice)"
    },
    {
      "id": "nm4914787",
      "name": "Seiji Yoshimura",
      "character": "Himself"
    }
  ],
  "overview": "On March 11, 2011, Japan's Tohoku coastal region was destroyed by a 9.0 magnitude earthquake and devastating tsunami that followed. PRAY FOR JAPAN takes place in the devastated region of Ishinomaki, Miyagi - the largest coastal city in Tohoku with a population of over 160,000 people. Filmmaker Stu Levy - an American living in Japan - filmed the tsunami aftermath during his trips to Tohoku as a volunteer and over a period of 6 weeks, captured over 50 hours of footage. PRAY FOR JAPAN focuses on four key perspectives of the tragedy - School, Shelter, Family, and Volunteers. With each perspective we meet victims who faced significant obstacles and fought to overcome them. Through these four vantage points, the audience is able to understand the vast ramifications of this large-scale natural disaster - and the battle these real-life heroes fought on behalf of their loved ones and their hometown.",
  "storyline": "Real heroes faced the Tohoku earthquake and tsunami tragedy. The battle to rebuild Japan continues - and the world must not forget their story.",
  "plot": null,
  "synopsis": "On March 11, 2011, Japans Tohoku coastal region was destroyed by a 9.0 magnitude earthquake and devastating tsunami that followed. PRAY FOR JAPAN takes place in the devastated region of Ishinomaki, Miyagi the largest coastal city in Tohoku with a population of over 160,000 people. Filmmaker Stu Levy an American living in Japan - filmed the tsunami aftermath during his trips to Tohoku as a volunteer and over a period of 6 weeks, captured over 50 hours of footage.PRAY FOR JAPAN focuses on four key perspectives of the tragedy School, Shelter, Family, and Volunteers. With each perspective we meet victims who faced significant obstacles and fought to overcome them. Through these four vantage points, the audience is able to understand the vast ramifications of this large-scale natural disaster and the battle these real-life heroes fought on behalf of their loved ones and their hometown.Losing loved ones cuts emotional scars which run deep.We can help heal these wounds by paying tribute to the amazing resilience and quiet spirit of the many victims and volunteers of Tohoku. By letting them know we admire and respect them, we encourage them to continue the good fight at a time when even the strongest warriors would grow weary. We also gain insight into how our own inner strength can help us if we ever find ourselves in a life-threatening situation.We can all learn from these incredible heroes!"
}