{
  "imdb_id": "tt2072233",
  "tmdb_id": "324542",
  "douban_id": null,
  "title": "Sleepless (2017)",
  "genres": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "country": "USA",
  "version": [],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm2171633",
      "name": "Baran bo Odar"
    }
  ],
  "writer": [
    {
      "id": "nm0075696",
      "name": "Andrea Berloff",
      "description": "screenplay"
    },
    {
      "id": "nm0418621",
      "name": "Frédéric Jardin",
      "description": "film \"Nuit blanche\" &"
    },
    {
      "id": "nm0754256",
      "name": "Nicolas Saada",
      "description": "film \"Nuit blanche\" &"
    },
    {
      "id": "nm0235502",
      "name": "Olivier Douyère",
      "description": "film \"Nuit blanche\""
    }
  ],
  "cast": [
    {
      "id": "nm0004937",
      "name": "Jamie Foxx",
      "character": "Vincent"
    },
    {
      "id": "nm1157358",
      "name": "Michelle Monaghan",
      "character": "Bryant"
    },
    {
      "id": "nm1058940",
      "name": "Scoot McNairy",
      "character": "Novak"
    },
    {
      "id": "nm0000551",
      "name": "Dermot Mulroney",
      "character": "Rubino"
    },
    {
      "id": "nm1939267",
      "name": "T.I.",
      "character": "Sean       (as Tip 'T.I.' Harris)"
    },
    {
      "id": "nm1092086",
      "name": "David Harbour",
      "character": "Dennison"
    },
    {
      "id": "nm0005517",
      "name": "Gabrielle Union",
      "character": "Dena"
    },
    {
      "id": "nm3422950",
      "name": "Octavius J. Johnson",
      "character": "Thomas"
    },
    {
      "id": "nm1132085",
      "name": "Tim Connolly",
      "character": "McFerrin"
    },
    {
      "id": "nm4263881",
      "name": "Drew Sheer",
      "character": "Anderson"
    },
    {
      "id": "nm1019674",
      "name": "Sala Baker",
      "character": "Benik"
    },
    {
      "id": "nm0726601",
      "name": "Tim Rigby",
      "character": "Larry"
    },
    {
      "id": "nm5066026",
      "name": "Elijah Everett",
      "character": "Bathroom Attendant"
    },
    {
      "id": "nm3384278",
      "name": "Tess Malis Kincaid",
      "character": "Demanding New Yorker"
    },
    {
      "id": "nm0183548",
      "name": "Steve Coulter",
      "character": "Frazzled Concierge"
    },
    {
      "id": "nm4948941",
      "name": "Matt Mercurio",
      "character": "Busboy #1"
    },
    {
      "id": "nm3153028",
      "name": "Chan Ta Rivers",
      "character": "Nurse"
    },
    {
      "id": "nm8706845",
      "name": "Brooke Boxberger",
      "character": "Receptionist"
    },
    {
      "id": "nm4123582",
      "name": "Chelsea Hayes",
      "character": "Shari"
    },
    {
      "id": "nm4434362",
      "name": "Holly A. Morris",
      "character": "Kelly Rubino       (as Holly Morris)"
    },
    {
      "id": "nm3812535",
      "name": "Leonardo Santaiti",
      "character": "Bartender"
    },
    {
      "id": "nm1183181",
      "name": "Stephen Shelton",
      "character": "Security Guard"
    },
    {
      "id": "nm2479589",
      "name": "Jamie Hill Fuller",
      "character": "Bikini Woman #1       (as Jamie Hill)"
    },
    {
      "id": "nm4725561",
      "name": "Richard Nunez",
      "character": "Guerro"
    },
    {
      "id": "nm7692696",
      "name": "Anthony Michael Lopez",
      "character": "Busboy #2"
    },
    {
      "id": "nm7382570",
      "name": "Gabrielle Lexa",
      "character": "Bikini Girl #2"
    },
    {
      "id": "nm0718680",
      "name": "Ric Reitz",
      "character": "Captain"
    },
    {
      "id": "nm5886497",
      "name": "RJ Shearer",
      "character": "Zak"
    },
    {
      "id": "nm1408499",
      "name": "Brian Durkin",
      "character": "Uniformed Officer"
    },
    {
      "id": "nm1180204",
      "name": "Alex Collins",
      "character": "Uniform Cop"
    },
    {
      "id": "nm0486047",
      "name": "Reuben Langdon",
      "character": "Passenger"
    }
  ],
  "overview": "SLEEPLESS stars Jamie Foxx as undercover Las Vegas police officer Vincent Downs, who is caught in a high stakes web of corrupt cops and the mob-controlled casino underground. When a heist goes wrong, a crew of homicidal gangsters kidnaps Downs’ teenage son. In one sleepless night he will have to rescue his son, evade an internal affairs investigation and bring the kidnappers to justice.",
  "storyline": "In Las Vegas, vice LVMPD policemen Vincent Downs and Sean Cass rob a shipment of cocaine belonging to entrepreneur Stanley Rubino, who intended to sell it to mobster Rob Novak, the son of a powerful mob boss. They volunteer to investigate the robbery in order to cover up their involvement, clashing with Internal Affairs investigators Jennifer Bryant and Doug Dennison, who are suspicious of their involvement. It is also revealed that Vincent is estranged from his wife Dena, who is getting remarried, and has minimal involvement in the life of his 16-year-old son Thomas..",
  "plot": "In Las Vegas, vice LVMPD policemen Vincent Downs and Sean Cass rob a shipment of cocaine belonging to entrepreneur Stanley Rubino, who is associated with mobster Rob Novak, the son of a powerful mob boss. They volunteer to investigate the robbery in order to cover up their involvement, clashing with Internal Affairs investigators Jennifer Bryant and Doug Dennison, who are suspicious of their involvement. Unbeknownst to them, Vincent is undercover on behalf of Internal Affairs to dismantle the crime ring within the police department, which has left him estranged from his ex-wife Dena and their son, Thomas.\n\nWhile driving Thomas to soccer practice, Vincent is ambushed by Rubino's men, who stab him in the abdomen and kidnap Thomas, demanding the stolen cocaine back in exchange for Thomas's life. Vincent retrieves the cocaine from Cass, places it in a duffel bag and leaves it in the ventilation shaft of one of the bathrooms in Rubino's casino, but is unknowingly followed by Bryant, who hides it in the women's locker room nearby. Upon learning that the drugs were moved, Vincent is forced to present Rubino with a bag of sugar to ensure Thomas's safety, but Novak uncovers his ruse and Thomas is recaptured by Rubino's men, while Vincent manages to escape.\n\nVincent infiltrates the casino disguised as a security guard, but is located by Bryant and chased into one of the hotel rooms, where he subdues her and reveals he's working for Internal Affairs. Bryant directs him to the locker room, but the drugs have disappeared. Dennison ambushes Vincent, but is ultimately overpowered and knocked unconscious, while Thomas manages to escape, stealing Rubino's cellphone to contact Vincent. Elsewhere, Dena finds out Vincent and Thomas are in danger and heads to the casino as well.\n\nCass arrives and saves Vincent from Novak's men, but is shot in the process and presumed dead. Going through Cass' phone, Vincent finds out Dennison is on Novak's payroll and informed Cass that Vincent was Internal Affairs and needed to be killed. Bryant and Dennison later find a severely injured Cass in the garage. Dennison privately questions Cass on whether Vincent is aware of his involvement and finishes him off when Cass refuses to answer. Vincent and Thomas reunite just as Novak begins shooting up the casino and escape to the parking garage. Meanwhile, Bryant arrests Rubino.\n\nVincent and Thomas attempt to escape in a stolen car, but are ambushed by Novak and his men, leading to a violent shootout. Dena arrives and kills some of Novak's men before Novak corners them. He shoots Vincent in the chest, but Vincent survives and fatally shoots Novak. Vincent then contacts Bryant and alerts her of Dennison's corruption. Realizing he's been exposed, Dennison draws his gun, and shoots Bryant and Rubino and forces the police cruiser they're in to crash.\n\nDennison crawls out of the wreckage claiming Rubino killed Bryant and the driver with a stolen gun before being shot by Dennison, but Bryant has managed to survive and exposes Dennison, who is arrested by the arriving policemen. Vincent and Bryant are taken to the same hospital, where they make ammends and congratulate each other on the job. Meanwhile, a corrupt DEA Agent contacts Novak's father and informs him there's been a problem.",
  "synopsis": "Two men in masks are chasing after a van. They hit the van and cause it to crash. The men are really cops - Vincent Downs (Jamie Foxx) and Sean Cass (T.I.). They fight the men in the van and kill one as more thugs show up with guns. Vincent and Sean shoot the men and steal a duffel bag with 25 kilograms of cocaine in it.Vincent is an Internal Affairs officer who has been conducting a two-year investigation into a crime ring. He knows Sean is a courier for the ring, but his top targets are casino owner Stanley Rubino (Dermot Mulroney), and the boss behind everything, Rob Novak (Scoot McNairy).Detective Jennifer Bryant (Michelle Monaghan) walks into her department with a cut on her face. She speaks to a police psychologist about a recent incident in which she attempted to take down a meth lab but was assaulted by a junkie. Now many of her colleagues think she is in over her head and should take time off, but she is determined to get in on the drug ring case.Vincent and Sean are sent back to the scene of their crime. They pick up some evidence as Vincent and Jennifer meet for the first time. There is obvious tension between them as they both feel the need to take control of the case.Vincent goes to the hospital to pick up his son Thomas (Octavius J. Johnson) for sports practice. Vincent finds out that his ex-wife Dena (Gabrielle Union) is engaged to another man. Both Dena and Thomas know Vincent has been distant since he took on the case, but they were never made aware of the case itself. Vincent is driving Thomas away when the two are ambushed on the parkway. Two men attack them, resulting in Thomas being snatched and Vincent getting stabbed in the abdomen. Almost immediately, Vincent receives a call from Rubino. He knows Vincent took the coke and demands that he bring it to the Luxus casino that he owns within three hours, or Novak will retaliate against Vincent and his family.Sean finds Vincent tending to his wound. Vincent blows up on Sean and orders him to bring him the bag of coke before they are all in trouble.Novak tortures his cousin, who is a DEA informant and one of the men that Vincent and Sean hit when they stole the coke. He has the man hung upside down with balls shot at him before Novak orders his goons to cut out his cousin's tongue.Vincent brings the coke in a trash bag to the Luxus and puts it up in the ceiling over a stall in the men's bathroom. He goes upstairs to meet with Rubino to negotiate for Thomas's return. However, Jennifer arrives at the casino with her partner Doug Dennison (David Harbour). She goes knocking through the stalls when the bathroom attendant tells her that Vincent was going around there as well. Jennifer finds the bag and takes it to the women's locker room in the spa.When it is discovered that the drugs are missing, Vincent tries to go find them himself. Meanwhile, Novak arrives at the casino and begins pressing Rubino for the coke or else Novak's father (who operates an even bigger crime circle) will have something to say about it.Vincent brings Rubino a bag of sugar to fool them as they hand Thomas over to Vincent. They start making their way out of the casino when Novak learns that he was given sugar. One of Rubino's large thugs chases after Vincent and Thomas as they go down by the kitchen. Vincent's stab wound starts seeping, and he admits to his son that he is part of a large drug case. The thug then finds the two and starts fighting Vincent in the kitchen. Thomas attempts to intervene to help his father. Vincent subdues the thug by throwing him through a window into an office.Vincent and Thomas try escaping through the club, but the thug re-captures Thomas. Dena continues to call Vincent as he tries to hide the fact that Thomas was taken from him while he continues to try and rescue him, though he does let her know he is at the Luxus.Vincent poses as a hotel employee in order to get by unnoticed. He runs into Jennifer, who identifies him and goes after him. They have a fight in one of the rooms before Vincent cuffs Jennifer to the bed. He explains his involvement in the case and reveals he is IA, having been undercover for two years and having to keep it from his family.Vincent goes to the locker room to find the bag, but it's gone from the locker. He is found by Dennison and starts a fight with him. Vincent knocks him out in the hot tub but pulls him out so he won't drown.Thomas manages to get away since the bad guys left the door open. He takes Rubino's phone and contacts Vincent to let him know where he is. At the same time, Dena becomes aware that something bad is going on, so she leaves the hospital and rushes to the casino.The thugs find Vincent and Thomas in the club once again. The big thug from earlier fights Vincent again as Novak starts shooting up the place. Vincent breaks off a champagne bottle and sticks the broken end in the thug's neck before getting himself and Thomas out of there.In the parking garage, Vincent encounters Sean, who has learned that Vincent is IA. Another thug approaches them with a gun, leading to himself and Sean shooting each other. Vincent tries to wake Sean up, but he appears dead.Vincent looks at Rubino's phone and sees a message from Dennison. He's on Novak's payroll and has informed his bosses that the drugs are missing and that Vincent could place them.Jennifer and Dennison find the thug and Sean in the parking garage. Dennison goes to Sean, who is still alive. When Dennison asks Sean if Vincent knows of Dennison's involvement, Sean just tells him to go fuck himself. Dennison suffocates Sean to death while still lying to Jennifer.Vincent and Thomas try to get out of the casino as the bad guys chase after them. Rubino tries to get away, but he is arrested by Jennifer, Dennison, and a group of other officers. Vincent and Thomas take a sports car from the lobby and drive into the garage as Novak straps up and puts on a mask. In the garage, Novak starts shooting tear gas canisters all around the place as Vincent and Thomas try to get away. More thugs come in, just as Dena shows up with her own gun. The thugs get killed before Novak has Vincent and his family cornered. Vincent steps out and tries to negotiate with Novak, but Novak shoots Vincent in the chest. Vincent falls to the ground and shoots Novak in the neck and heart, killing him.Vincent manages to call Jennifer's phone and play back Dennison's voicemail so she can hear. Now that she knows the truth, she attempts to shoot Dennison, but he grabs her gun and shoots her first. He then kills Rubino and the driver, causing the car to flip over and crash. The other officers arrive and get Dennison out. He claims that Rubino went crazy and that he killed Jennifer, but she crawls out of the car and tells the other officers to arrest Dennison.Vincent and Jennifer are both taken to the hospital. Both of them eventually wake up, with Dena and Thomas sitting by Vincent's bed. Jennifer goes to Vincent's room. He tells her she's a great cop.The CSI team is sweeping up the garage where Novak and his thugs lie dead. Novak's phone rings, and it's his dad calling. A DEA agent on their payroll answers the phone and tells Novak's dad that there's been a problem."
}