{
  "imdb_id": "tt2042544",
  "tmdb_id": "367113",
  "douban_id": null,
  "title": "Gothic Assassins (2012)",
  "genres": [
    "Action",
    "Drama",
    "Sci-Fi"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "116 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm1115471",
      "name": "Milos Twilight"
    }
  ],
  "writer": [
    {
      "id": "nm1115471",
      "name": "Milos Twilight",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0000874",
      "name": "Steven Bauer",
      "character": "VOX"
    },
    {
      "id": "nm4087633",
      "name": "Amra Silajdzic",
      "character": "Scarlett Dax"
    },
    {
      "id": "nm3924963",
      "name": "Olya Casey",
      "character": "Kadalhiax Dax       (as Olya Lea)"
    },
    {
      "id": "nm0005133",
      "name": "Priscilla Inga Taylor",
      "character": "Dalhiax Dax       (as Priscilla Taylor)"
    },
    {
      "id": "nm0398994",
      "name": "Jack Huang",
      "character": "Avenger"
    },
    {
      "id": "nm6200168",
      "name": "Elle Natasha Aslin",
      "character": "Aquarius       (as Elle Aslin)"
    },
    {
      "id": "nm1320710",
      "name": "Seth Hampton",
      "character": "Gage"
    },
    {
      "id": "nm0454998",
      "name": "Linden King",
      "character": "Lead"
    },
    {
      "id": "nm4566326",
      "name": "Hugh Lehane",
      "character": "The Master"
    },
    {
      "id": "nm4391050",
      "name": "Marius Lite",
      "character": "Oleg Varga"
    },
    {
      "id": "nm2940016",
      "name": "Brian Metran",
      "character": "Agent Frias"
    },
    {
      "id": "nm4641834",
      "name": "Jose Paz",
      "character": "Carlos Brenna"
    },
    {
      "id": "nm5212516",
      "name": "Eivid Nina Pedersen",
      "character": "Cydiax"
    },
    {
      "id": "nm3200398",
      "name": "Chuck Rockford",
      "character": "Washington DC Agent"
    },
    {
      "id": "nm2349051",
      "name": "Adi Spektor",
      "character": "Larko"
    },
    {
      "id": "nm2962003",
      "name": "Kevin Strom",
      "character": "Newscaster"
    },
    {
      "id": "nm3590584",
      "name": "Aliona Yurchenko",
      "character": "Allyax Dax"
    }
  ],
  "overview": "A global conspiracy is underway guided by The New World Order. They have strategically placed its members all over the globe in key positions of power. The time spoken in prophesy known as the end of days is quickly approaching. A secret religious order created thousands of years ago with the sole purpose to prevent the Apocalypse must face their fate. Walking by faith not by sight, through their journey, these knights will be pierced by the sword of truth, revealing their own miseries, doubts and fears, discovering how they were misled by their Master. Their faith will be put to test surrounded by temptation, betrayal, murder and remorse. Only the faithful to death shall receive the crown of life. The others will become Gothic Assassins.",
  "storyline": "A global conspiracy is underway guided by The New World Order. They have strategically placed its members all over the globe in key positions of power. The time spoken in prophesy known as the end of days is quickly approaching. A secret religious order created thousands of years ago with the sole purpose to prevent the Apocalypse must face their fate. Walking by faith not by sight, through their journey, these knights will be pierced by the sword of truth, revealing their own miseries, doubts and fears, discovering how they were misled by their Master. Their faith will be put to test surrounded by temptation, betrayal, murder and remorse. Only the faithful to death shall receive the crown of life. The others will become Gothic Assassins.",
  "plot": "Troy Baker assumed the role of the Joker, succeeding long-time voice actor Mark Hamill.\nBy July 2012, Warner Bros. Interactive Entertainment (WBIE) was planning Rocksteady Studios's next Batman game as a prequel based on the Silver Age of Comic Books, featuring Superman, Wonder Woman, Green Lantern and the Flash. The game would explore Batman's first confrontation with the Joker, with a release date no earlier than 2014. In August 2012, Paul Dini said he would not be involved in writing a sequel to Arkham City. He did not write any of that game's downloadable content (including the story-based \"Harley Quinn's Revenge\" DLC), and said that Warner Bros. and Rocksteady suggested he accept other work if offered. Dini added that he had taken on other projects, preventing his involvement until 2013. In February 2013, it was reported that a new game in the Batman Arkham franchise would be released by a developer other than Rocksteady.\n\nDevelopment of Batman: Arkham Origins began in late 2011 by Canadian development studio WB Games Montréal (WB Montréal), and the game was announced on April 9, 2013. WB Montréal was chosen to develop the game given the amount of time Rocksteady, developer of the first two Arkham games, needed to create Arkham Origins's successor, Batman: Arkham Knight, which would have resulted in \"a long time without an Arkham game.\" WB Montréal had worked on the Wii U adaptation of Batman: Arkham City, familiarizing itself with the modified Unreal Engine 3 development engine used by Rocksteady. WB Montréal decided not to heavily modify the established combat system (believing it already worked well), but introduced new enemy types with opportunities for new tactics and combat moves to defeat opponents. Although Rocksteady provided advice on technology, game mechanics and its engine, WB Montréal developed the story independently. The plot was partly inspired by the comic-book series Batman: Legends of the Dark Knight and the graphic novel Batman: Year One, detailing the first year of Batman's career, with Arkham Origins described as a \"Year Two\" story. Parts of the plot (such as Batman's relationships with the Joker, Gordon and the game's Christmas setting) were partly inspired by Batman: The Man Who Laughs, Batman: Turning Points and Batman: The Long Halloween, respectively. The story is written by Dooma Wendschuh, Ryan Galletta and Corey May, with input from DC Comics and comic-book writer Geoff Johns. Eric Holmes acted as Arkham Origins' creative director. Explaining the decision to develop a prequel, Holmes said while the Batman of Arkham Asylum and Arkham City was comparable to his comic counterpart—a fully formed, experienced character—Arkham Origins could explore other aspects of the character (such as his lack of experience and greater vulnerability). The game was considered 80 percent complete by January 2013, and WB Montréal used the remaining development time to tweak the final product.\n\nBy April 2013 the developers had decided not to use veteran Batman voice actor Kevin Conroy in the role, preferring a younger voice for Batman's early career. In May, Roger Craig Smith was announced as the voice of Batman and Troy Baker as the Joker. Conroy said at the 2013 Dallas Comic Con that he had been working on \"the next Arkham\", inspiring speculation that he would reprise his role as Batman in Arkham Origins; however, in June it was confirmed that Conroy would not be in the game. In July, it was announced that Arkham Origins would be the first game in the Arkham series to feature multiplayer gameplay. The multiplayer game was produced by independent British developer Splash Damage under creative director Alastair Cornish, separately from WB Montréal's work on the main game. The Wii U version of the game is single-player, with Warner Bros. saying that the team was focused on platforms with the largest multiplayer audience.\nDesign\n\nHolmes described the Christmas setting as a juxtaposition between the joyful time of year and the grim world of Gotham City, including decorative Santas near Gothic gargoyles and Christmas lights in dark alleys. The city is dislodged from time and space, contrasting 1930s (and older) buildings with Batman's futuristic technology. The New Gotham area was designed for vertical movement, allowing the placement of enemies above and below Batman to create areas dense with activity. The game features high contrast between darks and lights, with exaggerated shadows and few balancing colors. The city was divided into residential, industrial and commercial neighborhoods, which were decorated accordingly: the industrial setting is bleak, the commercial area has corporate decorations and residential neighborhoods have lights in their windows.\n\nDesigners aimed to make the younger Batman's outfit look \"assembled versus manufactured\", pieced together from a number of sources. Holmes said, \"[Batman's suit is] not something that was made in a factory. He's taken pieces of tech either he's invented, he's fabricated or things from the Wayne facilities, and he has made this costume out of these pieces.\" To emphasize the mystery and fear instilled by Batman in this early stage of his career, art director Jeremy Price and the design team used silhouettes and film noir-style low-key lighting to make the character more imposing. The name \"Batman\" is used sparingly in this game to emphasize his urban-legend status and the lack of understanding of the character. It was suggested that Batman make mistakes because of his inexperience (such as tripping or missing with batarangs), but this idea was discarded as inconsistent with the character. His inexperience was instead personality-based: learning how to be the city's protector and overcoming his obsession with vengeance. In designing Batman's abilities and gadgets, gameplay took precedence over narrative consistency with the previous games; the designers thought that removing features players had already experienced in those games would make playing Arkham Origins feel less empowering.\n\nHolmes acknowledged that Black Mask is not as well known as some of Batman's other villains (such as the Joker and Penguin), and the character required expansion to make him interesting and scary. Black Mask was considered an appropriate antagonist for Batman's early career because of his practicality; he transitions from the typical criminals Batman has been facing and the neurotic, quirky super-villains he will confront in the future. The team decided to make Arkham Origins' Copperhead a female (in contrast to the comic's male character) with input from Johns. The contortionist character required three motion-capture actors to animate: a stunt woman, a Cirque du Soleil performer and a martial artist. This version of Copperhead will be added to DC Comics' The New 52. Anarky, an anti-villain based on anarchist philosophy, was updated in appearance for the game to a street protester with a gang resembling a social movement. The character would appeal to Batman for a partnership (since he is not necessarily evil) but, as Holmes said, \"is multidimensional in the Batman Universe.\" The popularity of anti-corporate and anti-government protest movements factored in the character's inclusion, and Holmes thought that of all of the villains Anarky was the most timely. The developers drew upon \"original Alan Grant and Norm Breyfogle appearances\" of Anarky for his character. Each main-story boss reinforces the player's mastery of a specific game mechanic (such as Deathstroke, whose fighting focuses on countering attacks). The assassins selected for the game were chosen for abilities which would challenge the game mechanics. The boss fights were inspired by Arkham City's battle against Mr. Freeze, which tasked players with exploring the full range of Batman's strategies and abilities to overcome the villain.\n\nThe \"Detective Vision\" crime scenes were designed to be brief, visually rewarding and fun segments, rather than demanding challenges. The designers worked on the length of time for each scene, seeing how many pieces of evidence players wanted to scan before they had a solution; they eventually settled on two to three minutes. A number of predator areas (levels where Batman stalks enemies from the shadows) provide variety and challenge. For example, the theatre aboard Penguin's ship was gradually shrunk in size to pack the enemies closer together, and a hovering drone was removed when test players easily overcame it. A dynamic weather system altering gameplay (such as wind and snow reducing visibility, making snipers more vulnerable to Batman's stealth) was implemented during development, but discarded when it was not completed within the available development time.\nMusic\n\nChristopher Drake&#160;— The Night Before Christmas\nDrake was inspired by the 1988 action film Die Hard, using sleigh bells for punctuation.\nProblems playing this file? See media help.\nThe score for Arkham Origins was composed by Christopher Drake, replacing Ron Fish and Nick Arundel (who composed the scores for Arkham Asylum and Arkham City). It was partially inspired by the 1988 action film Die Hard (also set during Christmas), which features sleigh bells in its soundtrack to punctuate specific moments. Drake said that since the game was a prequel, it allowed him more freedom in the score while adhering to \"the DNA\" of Batman music. He added that although the previous scores were elegant and orchestral, he chose more electronic elements. Drake approached the cinematic scenes as a traditional film score, with the design team describing scenes over the phone while he worked out of Burbank, California. The in-game music was created with layers which activate with action (such as Batman entering a location or beginning a fight), and can be added or subtracted depending on what is occurring. Drake hoped the in-game music would not be boring, since those sections work at differing lengths of time (dependent on how long a player takes to complete a task).\n\nThe Batman: Arkham Origins&#160;– Original Video Game Score was released by WaterTower Music on October 22, 2013 and features 32 tracks composed for the game.\n\nAll music composed by Christopher Drake.\n\nTracks\nNo.TitleLength1.\"Arkham Origins Main Titles\"2:522.\"The Night Before Christmas\"2:073.\"Black Mask Escapes\"0:474.\"Killer Croc\"2:035.\"Croc Arrest\"1:016.\"Batwing Storm Damage\"0:397.\"Assassins\"2:418.\"Weapons Deal\"1:049.\"The Final Offer\"1:3210.\"Deathstroke\"4:0611.\"Winter Comes to Gotham\"2:0712.\"Carol of the Bells (Joker's Theme)\"1:2913.\"G.C.P.D.\"2:1414.\"Can't You Just Play Along?\"2:0815.\"Merchant Bank Escape\"1:1516.\"Copperhead\"1:3017.\"Hallucinations\"2:5718.\"Snake in a Box\"0:4019.\"Night Patrol\"2:0320.\"Gotham City Royal Hotel\"1:5621.\"Bane\"2:2922.\"Why Would You Save...Me?\"1:2823.\"The Thieving Magpie\" (Overture from Gioachino Rossini's La gazza ladra)2:0124.\"The Bridge\"1:1025.\"Firefly\"6:0026.\"I Have Left Enough Life in Him for Some Final Words... If You Hurry\"1:2427.\"Allies\"3:0428.\"Electric Chair\"1:4029.\"One of Us Will Die\"1:0930.\"Shadow of the Bat\"2:1031.\"Arkham Origins End Titles\"1:4932.\"Arkham Origins Suite\"2:16\nTotal length:1:03:51",
  "synopsis": null
}