{
  "imdb_id": "tt2043979",
  "tmdb_id": "89156",
  "douban_id": null,
  "title": "Rose (2011)",
  "genres": [
    "Drama",
    "War"
  ],
  "country": "Poland",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm1500530",
      "name": "Wojciech Smarzowski"
    }
  ],
  "writer": [
    {
      "id": "nm0843850",
      "name": "Michal Szczerbic",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0233949",
      "name": "Marcin Dorocinski",
      "character": "Tadeusz"
    },
    {
      "id": "nm0474492",
      "name": "Agata Kulesza",
      "character": "Róza Kwiatkowska"
    },
    {
      "id": "nm3189871",
      "name": "Malwina Buss",
      "character": "Jadwiga Kwiatkowska, Róza's Daughter"
    },
    {
      "id": "nm0695835",
      "name": "Kinga Preis",
      "character": "Amelia"
    },
    {
      "id": "nm0102765",
      "name": "Jacek Braciak",
      "character": "Wladek, Amelia's Husband"
    },
    {
      "id": "nm0246189",
      "name": "Marian Dziedziel",
      "character": "Mateusz"
    },
    {
      "id": "nm0523820",
      "name": "Edward Linde-Lubaszenko",
      "character": "Pastor"
    },
    {
      "id": "nm1455087",
      "name": "Eryk Lubos",
      "character": "Wasyl"
    },
    {
      "id": "nm0245612",
      "name": "Lech Dyblik",
      "character": "Wozniak"
    },
    {
      "id": "nm0090461",
      "name": "Szymon Bobrowski",
      "character": "Kazik"
    },
    {
      "id": "nm1293137",
      "name": "Andrzej Konopka",
      "character": "Dr. Leliwa"
    },
    {
      "id": "nm1229808",
      "name": "Robert Wabich",
      "character": "Hawryluk"
    },
    {
      "id": "nm1711335",
      "name": "Grzegorz Wojdon",
      "character": "Madecki"
    },
    {
      "id": "nm4664299",
      "name": "Mateusz Trembaczowski",
      "character": "Georg"
    },
    {
      "id": "nm1281009",
      "name": "Jerzy Rogalski",
      "character": "Barber"
    },
    {
      "id": "nm0865069",
      "name": "Dariusz Toczek",
      "character": "Clerk"
    },
    {
      "id": "nm1291612",
      "name": "Aleksander Chochlow",
      "character": "Doctor"
    },
    {
      "id": "nm0957463",
      "name": "Ilja Zmiejew",
      "character": "NKWD Capitain"
    },
    {
      "id": "nm0344849",
      "name": "Anna Grzeszczak",
      "character": "Gretchen"
    },
    {
      "id": "nm0067329",
      "name": "Andrzej Beja-Zaborski",
      "character": "Railwayman"
    },
    {
      "id": "nm3997001",
      "name": "Kamil Tolinski",
      "character": "Postman"
    },
    {
      "id": "nm1055993",
      "name": "Dorota Piasecka",
      "character": "Barmaid"
    },
    {
      "id": "nm2911079",
      "name": "Mateusz Lasowski",
      "character": "Soldier"
    },
    {
      "id": "nm0417597",
      "name": "Arkadiusz Janiczek",
      "character": "Johann Kwiatkowski"
    },
    {
      "id": "nm1847247",
      "name": "Karolina Porcari",
      "character": "Anna"
    },
    {
      "id": "nm3353644",
      "name": "Kacper Zielinski",
      "character": "Priest"
    },
    {
      "id": "nm2618089",
      "name": "Marcin Juchniewicz",
      "character": "Wasyl's friend"
    },
    {
      "id": "nm0439131",
      "name": "Irena Karel",
      "character": "Shoted Woman"
    },
    {
      "id": "nm1697691",
      "name": "Marzena Bergmann",
      "character": "Masurian woman 1       (as Marzena Bergman)"
    },
    {
      "id": "nm0059518",
      "name": "Barbara Baryzewska",
      "character": "Masurian woman 2"
    }
  ],
  "overview": "This harrowing tale of survival centers on Rose, a Masurian woman, whose German soldier husband was killed in the war, leaving her alone on their farm. A single woman had no defense against Russian soldiers who raped as a form of revenge, nor against plundering Poles who found themselves in desperate straits. Help arrives for Rose in the form of Tadeusz, a former officer in the Polish Home Army who deserted after he saw his wife raped and murdered by Russian troops and is attempting to hide his identity.",
  "storyline": "A harrowing tale of survival centers on Rose, a Masurian woman, whose husband, a German soldier, was killed in the war, leaving her alone on their farm. A single woman had no defense against Russian soldiers who raped as a form of revenge, nor against plundering Poles who found themselves in desperate straits. The law of the jungle had replaced the rule of law. Help arrives for Rose in the form of Tadeusz, a former officer in the Polish Home Army who survived the Warsaw uprising and is attempting to hide his identity.",
  "plot": "Annie Walker (Kristen Wiig) is a single woman in her late 30s. Following the failure of her bakery, she lost her boyfriend and her savings, forcing her to take a job as a sales clerk in a jewelry store and to share an apartment with an obnoxious roommate Gil (Matt Lucas) and his sister Brynn (Rebel Wilson). Her business's failure was so painful that she has given up baking entirely. She has a no-strings-attached sexual relationship with the self-absorbed Ted (Jon Hamm) but hopes for something more from him. Her best friend, Lillian (Maya Rudolph), is virtually her only source of happiness.\n\nLillian becomes engaged and asks Annie to be her Maid of Honor. At the engagement party, Annie meets Lillian's bridesmaids: cynical cousin Rita (Wendi McLendon-Covey); idealistic friend Becca (Ellie Kemper); the groom's raunchy sister Megan (Melissa McCarthy); and Helen (Rose Byrne), the rich and beautiful wife of the groom's boss. Helen and Annie, who are jealous of each other's friendship with Lillian, take an instant dislike to each other, but Lillian persuades them to spend time together.\n\nAnnie takes Lillian and the bridesmaids to a Brazilian steak restaurant for lunch before going to a chic bridal shop. Helen uses her influence to gain entry to the shop because Annie didn't make a reservation. While trying on gowns, the whole party— with the exception of Helen, who chose not to eat before the fitting —becomes sick from food poisoning. Later, Annie's suggestion of a bachelorette party at Lillian's parents' lake house is overruled in favor of a trip to Las Vegas planned by Helen. Worried about her finances and too proud to accept a ticket paid for by Helen, Annie books a ticket in coach although the rest of the party flies first-class. The trip is cut short by an outburst from Annie, who had accepted a sedative from Helen because of her fear of flying. The plane makes an emergency landing in Casper, Wyoming; and the party takes a bus back home. Annie apologizes, but Lillian decides she wants Helen to take over planning the shower and the wedding.\n\nAnnie continues to hope for a relationship with Ted, but Nathan Rhodes (Chris O'Dowd), a friendly State Patrol officer who had earlier let her off without a ticket for broken tail lights, begins flirting with her. Nathan encourages her to open a new bakery, but Annie refuses. Following a night together, Nathan buys baking supplies for Annie to start baking again. Offended and overwhelmed, Annie leaves. Annie is later fired for being rude to a customer and kicked out of her apartment by her roommates, forcing her to move in with her mother (Jill Clayburgh).\n\nAnnie travels to Helen's home in Chicago for the bridal shower, which has become a Parisian-themed event, an idea that Annie previously came up with but Helen turned down. Helen also upstages Annie's heartfelt, handmade shower gift by giving Lillian a trip to Paris, an idea Helen stole from Annie. Enraged that Helen has taken credit for the Parisian theme, Annie throws a tantrum. Lillian kicks her out of the shower and the wedding. On her way home, Annie is involved in a car accident due to her still-broken tail lights, but the other driver flees the scene. Nathan is the responding officer, and he admonishes her for not fixing her tail lights and taking responsibility for her life. He storms off when Ted arrives to give Annie a ride. On the ride home, Ted asks Annie to perform oral sex on him. Angered, she breaks off the relationship and walks home.\n\nAnnie becomes reclusive, refusing to leave her mother's house and obsessively watching television. Eventually, Megan arrives and gives Annie a pep talk, telling Annie that she must stop blaming the world for her problems and take control of her life. Annie realizes her errors and begins to repair her life, beginning to bake again and getting her car fixed. She tries to make amends with Nathan, but he ignores her. On the day of the wedding, Helen appears at Annie's doorstep distraught; Lillian has disappeared, and Helen begs for Annie's help in finding her. While driving, Helen apologizes to Annie and opens up to her, revealing that people only involve her in their lives because she is good at planning events, but she does not have any true female friends, leading to a reconciliation between them. The two enlist Nathan to help, and he grudgingly agrees. The group finds Lillian at her own apartment, discovering that she ran from her wedding because of Helen's extravagant planning and from fear of leaving her life in Milwaukee. After reconciling, Annie helps Lillian prepare for her wedding.\n\nAnnie resumes her place as Maid of Honor. After the wedding, which Annie agrees with Helen is \"perfect\", Helen again apologizes to Annie and states her hope that they can be friends in the future. Realizing that Annie and Nathan were falling in love, Helen also arranged for him to pick up Annie after the wedding. Nathan and Annie reconcile and the pair ride away in his police car.",
  "synopsis": null
}