{
  "imdb_id": "tt2024519",
  "tmdb_id": "137182",
  "douban_id": null,
  "title": "The Broken Circle Breakdown (2012)",
  "genres": [
    "Drama",
    "Music",
    "Romance"
  ],
  "country": "Belgium",
  "version": [
    {
      "runtime": "111 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.8,
  "director": [
    {
      "id": "nm0886976",
      "name": "Felix van Groeningen"
    }
  ],
  "writer": [
    {
      "id": "nm0374949",
      "name": "Johan Heldenbergh",
      "description": "play &"
    },
    {
      "id": "nm1570441",
      "name": "Mieke Dobbels",
      "description": "play"
    },
    {
      "id": "nm0429741",
      "name": "Carl Joos",
      "description": "adaptation &"
    },
    {
      "id": "nm0886976",
      "name": "Felix van Groeningen",
      "description": "adaptation"
    },
    {
      "id": "nm1631468",
      "name": "Charlotte Vandermeersch",
      "description": "collaboration on screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0374949",
      "name": "Johan Heldenbergh",
      "character": "Didier Bontinck /              Monroe"
    },
    {
      "id": "nm0046424",
      "name": "Veerle Baetens",
      "character": "Elise Vandevelde /              Alabama"
    },
    {
      "id": "nm4636536",
      "name": "Nell Cattrysse",
      "character": "Maybelle"
    },
    {
      "id": "nm0887769",
      "name": "Geert Van Rampelberg",
      "character": "William"
    },
    {
      "id": "nm4624700",
      "name": "Nils De Caster",
      "character": "Jock"
    },
    {
      "id": "nm0165982",
      "name": "Robbie Cleiren",
      "character": "Jimmy       (as Robby Cleiren)"
    },
    {
      "id": "nm4656777",
      "name": "Bert Huysentruyt",
      "character": "Jef"
    },
    {
      "id": "nm0082052",
      "name": "Jan Bijvoet",
      "character": "Koen"
    },
    {
      "id": "nm1699572",
      "name": "Sofie Sente",
      "character": ""
    },
    {
      "id": "nm3166737",
      "name": "Ruth Beeckmans",
      "character": "(as Ruth Beekmans)"
    },
    {
      "id": "nm0358418",
      "name": "Jan Hammenecker",
      "character": "Doctor"
    },
    {
      "id": "nm0374637",
      "name": "Blanka Heirman",
      "character": "Denise"
    },
    {
      "id": "nm2438846",
      "name": "Kirsten Pieters",
      "character": ""
    },
    {
      "id": "nm3625449",
      "name": "Yves Degryse",
      "character": ""
    },
    {
      "id": "nm1502517",
      "name": "Dominique Van Malder",
      "character": ""
    },
    {
      "id": "nm6090368",
      "name": "Marianne Loots",
      "character": ""
    },
    {
      "id": "nm1682371",
      "name": "Sanderijn Helsen",
      "character": ""
    },
    {
      "id": "nm6090369",
      "name": "Siham El Makhfi",
      "character": ""
    },
    {
      "id": "nm6090370",
      "name": "Maxime Neyt",
      "character": ""
    },
    {
      "id": "nm4296974",
      "name": "Maurice Leerman",
      "character": ""
    },
    {
      "id": "nm6090371",
      "name": "Aagje Moorthamer",
      "character": ""
    },
    {
      "id": "nm6090372",
      "name": "Lena Cattrysse",
      "character": ""
    },
    {
      "id": "nm0124133",
      "name": "George W. Bush",
      "character": "Himself       (archive footage)"
    },
    {
      "id": "nm6090373",
      "name": "Warre Cattrysse",
      "character": ""
    },
    {
      "id": "nm6090374",
      "name": "Eva Vanrysselberghe",
      "character": ""
    },
    {
      "id": "nm2993811",
      "name": "Labhise Allara Mandango Ciratu",
      "character": ""
    },
    {
      "id": "nm4383418",
      "name": "Mieke Proost",
      "character": ""
    },
    {
      "id": "nm6090375",
      "name": "Yasmina Neyskens",
      "character": ""
    },
    {
      "id": "nm5563423",
      "name": "Bjorn Eriksson",
      "character": ""
    },
    {
      "id": "nm6090376",
      "name": "Karl Eriksson",
      "character": ""
    },
    {
      "id": "nm6090377",
      "name": "Lennart Dauphin",
      "character": ""
    },
    {
      "id": "nm6090378",
      "name": "Celine Vande Vyver",
      "character": ""
    },
    {
      "id": "nm6090379",
      "name": "Karel Vandaele",
      "character": ""
    },
    {
      "id": "nm5523513",
      "name": "Emilie Guillaume",
      "character": ""
    },
    {
      "id": "nm6090380",
      "name": "Isabelle Persoons",
      "character": ""
    },
    {
      "id": "nm6090381",
      "name": "Jo Lootens",
      "character": ""
    },
    {
      "id": "nm6090382",
      "name": "Arthur de Hond",
      "character": "Dog"
    }
  ],
  "overview": "The loss of their young daughter threatens to destroy the love and faith of two married musicians.",
  "storyline": "Elise and Didier fall in love at first sight. She has her own tattoo shop and he plays the banjo in a bluegrass band. They bond over their shared enthusiasm for American music and culture, and dive headfirst into a sweeping romance that plays out on and off stage - but when an unexpected tragedy hits their new family, everything they know and love is tested. An intensely moving portrait of a relationship from beginning to end, propelled by a soundtrack of foot-stomping bluegrass, The Broken Circle Breakdown is a romantic melodrama of the highest order.",
  "plot": "As punishment for a past rebellion, each of the 12 districts of the nation of Panem is forced by the victorious Capitol to annually select two tributes, one boy and one girl between the ages of 12 and 18, to fight to the death in the Hunger Games. In District 12, Katniss Everdeen (Jennifer Lawrence) volunteers after her younger sister Primrose (Willow Shields) is initially chosen by lot. She and the male tribute, Peeta Mellark (Josh Hutcherson), are escorted to the Capitol by chaperone Effie Trinket (Elizabeth Banks) and their mentor Haymitch Abernathy (Woody Harrelson), a past District 12 victor, now an alcoholic. Haymitch impresses on them the importance of gaining sponsors, as they can provide gifts of food and supplies during the Games. During part of a series of televised interviews, Peeta publicly expresses his love for Katniss, which she initially takes as an attempt to earn sponsors for himself, though later learns that it could help her. While training, Katniss observes the Careers: Marvel (Jack Quaid), Glimmer (Leven Rambin), Cato (Alexander Ludwig), and Clove (Isabelle Fuhrman), tributes from Districts 1 and 2 who have been training for the Games from an early age.\n\nAt the start of the Games, Katniss ignores Haymitch's advice and grabs supplies from the ground around the Cornucopia, a place filled with food, weapons and other supplies where the contestants start, and narrowly escapes being killed by Clove; more than half of the tributes are killed in the initial melee, and only 11 survive the first day. Katniss tries to stay as far away from the rest of the competitors as possible, but Head Gamemaker Seneca Crane (Wes Bentley) triggers a forest fire to drive her back towards the others. She runs into the Careers, with whom Peeta has seemingly allied, and flees up a tree. The Career pack fails to kill her and Peeta advises them to wait for her to come down.\n\nThe next morning, while the Careers and Peeta sleep, Katniss notices Rue (Amandla Stenberg), District 11's young female tribute, hiding in an adjacent tree. Rue silently draws her attention to a nest of poisonous tracker jackers, genetically modified wasps that can cause hallucinations and death. Using a serrated knife, she cuts the branch holding the wasps, causing it to fall and release them onto the Careers. Marvel, Cato and Clove escape, while Glimmer succumbs to the venom and dies. Katniss is stung, and becomes disoriented from the venom, hallucinating the death of her father. After Rue helps Katniss recover from the poison, they become friends. Katniss devises a plan to destroy the cache of supplies that the Careers have been hoarding. After Katniss succeeds, Cato angrily kills a boy from District 3, since he had left pressure-sensitive mines around their supplies, which Katniss had blown up, thus destroying the supplies. Katniss discovers Rue caught in a trap and frees her, but not before Marvel finds them and kills Rue with a spear, and Katniss shoots him in the heart with an arrow, killing him. Katniss comforts Rue with a song and after she dies, the grieving Katniss places flowers around her body. She then holds three fingers up - a District 12 salute - as a way to honor Rue towards District 11 and to show a symbol of disgust towards the Capitol. The people of District 11 watch and then riot, leading President Snow (Donald Sutherland) to warn Crane that these Games are not turning out well.\n\nHaymitch persuades Crane to change the rules to allow two winners if they are from the same district, suggesting that this will quiet the unrest. When this change is announced, Katniss searches for Peeta, finding him wounded after fleeing from the Careers. He tells her Cato found out that he was intending to return to Katniss, leading him to stab Peeta with a sword in his leg. After she moves him to safety, they hear an announcement that what each survivor needs the most will be provided at the Cornucopia. Despite Peeta's strong opposition, Katniss leaves to get medicine for him. Clove attacks and pins her down; she then boasts about her part in Rue's death. Katniss is saved when Thresh (Dayo Okeniyi), District 11's male tribute, kills Clove to avenge Rue. He spares Katniss's life&#160;— once&#160;— for Rue's sake. The medicine heals Peeta.\n\nWhile hunting for food, Katniss hears a cannon go off, runs to find Peeta, and is horrified to find fatal nightlock berries on his jacket. Peeta is found to be fine, and they discover Foxface (Jacqueline Emerson), District 5's female tribute, dead after consuming the berries. For the finale of the Games, Crane has wild beasts unleashed into the arena which attack and kill Thresh. The beasts chase Katniss and Peeta onto the roof of the Cornucopia where Cato is hiding. They fight, until Katniss aims an arrow at Cato, who has Peeta in a headlock, boasting about how Katniss shooting him will result in both of them falling to their deaths. Peeta gets Katniss to shoot Cato's hand; she does so, and Peeta throws him to the mutts below, who attack, but don't kill him. Katniss then proceeds to shoot and kill Cato, ending his misery.\n\nKatniss and Peeta think they have won, but Crane cancels the rule change: there can be only one victor. Peeta says that Katniss should shoot him, but Katniss convinces Peeta to eat nightlock berries with her. Just before they do, they are hastily named co-winners of the 74th Hunger Games.\n\nAfterward, Haymitch warns Katniss that she has made many enemies by her acts of defiance. Snow has Crane locked in a room where the only source of food is nightlock. As Katniss and Peeta return to District 12, Snow ponders the situation. Katniss encourages Peeta to forget what happened between them in the Games, devastating him.",
  "synopsis": "«Ciclo Interrompido» conta a história de amor entre Elise e Didier. Ela tem a sua própria loja de tatuagens, ele toca banjo numa banda. É amor «à primeira vista» apesar das grandes diferenças. Ele fala, ela escuta. Ele é um ateu convicto, embora, ao mesmo tempo, um ingénuo romântico. Ela tem uma cruz tatuada no pescoço, mas os pés bem assentes na terra.\nA sua felicidade completa-se com o nascimento de Maybelle. Infelizmente, Maybelle, aos seis anos de idade, adoece gravemente. Didier e Elise reagem de forma muito diferente mas Maybelle não lhes irá deixar escolha. Didier e Elise terão que lutar juntos por ela. Será possível sentir o mesmo sendo tão diferente? Ou, o amor, mesmo quando forte e intenso, pode desiludir quando mais dele se precisa?"
}