{
  "imdb_id": "tt2073016",
  "tmdb_id": "125623",
  "douban_id": null,
  "title": "The Other Son (2012)",
  "genres": [
    "Drama"
  ],
  "country": "France",
  "version": [],
  "imdb_rating": 7.4,
  "director": [
    {
      "id": "nm0506518",
      "name": "Lorraine Lévy"
    }
  ],
  "writer": [
    {
      "id": "nm4699321",
      "name": "Noam Fitoussi",
      "description": "original idea screenplay"
    },
    {
      "id": "nm0506518",
      "name": "Lorraine Lévy",
      "description": "screenplay"
    },
    {
      "id": "nm0766635",
      "name": "Nathalie Saugeon",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0222922",
      "name": "Emmanuelle Devos",
      "character": "Orith Silberg"
    },
    {
      "id": "nm0253018",
      "name": "Pascal Elbé",
      "character": "Alon Silberg"
    },
    {
      "id": "nm0803262",
      "name": "Jules Sitruk",
      "character": "Joseph Silberg"
    },
    {
      "id": "nm1304635",
      "name": "Mehdi Dehbi",
      "character": "Yacine Al Bezaaz"
    },
    {
      "id": "nm0648337",
      "name": "Areen Omari",
      "character": "Leïla Al Bezaaz"
    },
    {
      "id": "nm0622384",
      "name": "Khalifa Natour",
      "character": "Saïd Al Bezaaz"
    },
    {
      "id": "nm3218796",
      "name": "Mahmud Shalaby",
      "character": "Bilal Al Bezaaz       (as Mahmood Shalabi)"
    },
    {
      "id": "nm0687913",
      "name": "Bruno Podalydès",
      "character": "David"
    },
    {
      "id": "nm0196710",
      "name": "Ezra Dagan",
      "character": "Le rabbin"
    },
    {
      "id": "nm2504118",
      "name": "Tamar Shem Or",
      "character": "Yona"
    },
    {
      "id": "nm2063842",
      "name": "Tomer Offner",
      "character": "Ilan       (as Tomer Ofner)"
    },
    {
      "id": "nm4960183",
      "name": "Noa Manor",
      "character": "Ethel"
    },
    {
      "id": "nm2126971",
      "name": "Shira Naor",
      "character": "Lisa"
    },
    {
      "id": "nm4960124",
      "name": "Diana Zriek",
      "character": "Amina"
    },
    {
      "id": "nm4959385",
      "name": "Marie Wisselmann",
      "character": "Keren"
    },
    {
      "id": "nm0069913",
      "name": "Gilles Ben-David",
      "character": "Le directeur de l'hôpital       (as Jill Ben David)"
    },
    {
      "id": "nm4375347",
      "name": "Yuval Rozman",
      "character": "Docteur militaire"
    },
    {
      "id": "nm1783055",
      "name": "Lana Ettinger",
      "character": "Femme Officer"
    },
    {
      "id": "nm2991045",
      "name": "Loai Nofi",
      "character": "Jamil       (as Loai Noufi)"
    },
    {
      "id": "nm5041956",
      "name": "Majd Bitar",
      "character": "Tarik"
    },
    {
      "id": "nm4919330",
      "name": "Nir Avrashi",
      "character": "Officier ministère"
    },
    {
      "id": "nm5226874",
      "name": "Shir Friebach",
      "character": "Femme sergent"
    },
    {
      "id": "nm5226262",
      "name": "Beni Eldar",
      "character": "Soldat 1 check point"
    },
    {
      "id": "nm4079023",
      "name": "Ori Lachmi",
      "character": "Soldat 2 check point"
    },
    {
      "id": "nm5226240",
      "name": "Natan Yadlin",
      "character": "Soldat 3 check point"
    },
    {
      "id": "nm5226749",
      "name": "Samantha Amouyal",
      "character": "Jolie cliente glace"
    },
    {
      "id": "nm5227086",
      "name": "Oum Abed",
      "character": "Madame Hafiz"
    },
    {
      "id": "nm5226186",
      "name": "Michel Taroni",
      "character": "Loubard 1 plage"
    },
    {
      "id": "nm5227386",
      "name": "Keppa",
      "character": "Loubard 2 plage"
    },
    {
      "id": "nm5226098",
      "name": "Zaki Mevorach",
      "character": "Loubard 3 plage"
    }
  ],
  "overview": "Two men discover they were accidentally switched at birth.",
  "storyline": "Two young men, one Israeli and one Palestinian, discover they were accidentally switched at birth.",
  "plot": "In January 1865, President Abraham Lincoln expects the Civil War to end soon – perhaps within a month – with the defeat of the Confederate States. However, he is concerned that his war-time 1863 Emancipation Proclamation may be discarded by the courts once the war has concluded, and that the proposed Thirteenth Amendment will be defeated by the returning slave states. Lincoln feels it is imperative to pass the amendment before that, thus removing any possibility that slaves who have already been freed may be re-enslaved. The Radical Republicans fear the amendment will be defeated by some who merely wish to delay its passage; the support of the amendment by Republicans in the border states is not yet assured either, since they prioritize the issue of ending the war. Even if all of them are ultimately brought on board, the amendment will still require the support of several Democratic congressmen if it is to pass. With dozens of Democrats having just become lame ducks after losing their re-election campaigns in the fall of 1864, some of Lincoln's advisors believe that he should wait until the new Republican-heavy Congress is seated, presumably giving the amendment an easier road to passage. Lincoln, however, remains adamant about having the amendment in place and the issue of slavery settled before the war is concluded and the southern states readmitted into the Union.\n\nLincoln's hopes for passage of the amendment rely upon the support of Francis Preston Blair, a founder of the Republican Party whose influence can ensure that all members of the western and border state conservative Republican faction will back the amendment. With Union victory in the Civil War seeming highly likely and greatly anticipated, but not yet a fully accomplished fact, and with two sons serving in the Union Army, Blair is keen to end the hostilities as soon as possible. Therefore, in return for his support, Blair insists that Lincoln allow him to immediately engage the Confederate government in peace negotiations. This is a complication to Lincoln's amendment efforts since he knows that a significant portion of the support he has garnered for the amendment is from the Radical Republican faction for whom a negotiated peace that leaves slavery intact is morally unacceptable, and that other Republicans will be content to end the war but leave slavery intact. Unable to proceed without Blair's support, however, Lincoln reluctantly authorizes Blair's mission.\n\nIn the meantime, Lincoln and Secretary of State William Seward work on the issue of securing the necessary Democratic votes for the amendment. Lincoln suggests that they concentrate on the lame duck Democrats, as they have already lost re-election and thus will feel free to vote as they choose, rather than having to worry about how their vote will affect a future re-election campaign. Furthermore, those members will soon be in need of employment, and Lincoln will have many federal jobs to fill as he begins his second term, which he sees as a tool he can use to his advantage. Though Lincoln and Seward are unwilling to offer direct monetary bribes to the Democrats, they authorize agents to quietly go about contacting Democratic congressmen with offers of federal jobs in exchange for their voting in favor of the amendment.\n\nAt a key moment in the debate, racial-equality advocate Thaddeus Stevens agrees to moderate his position, instead arguing that the amendment represents only legal equality, not a declaration of actual equality. Meanwhile, Confederate envoys are ready to meet with Lincoln to discuss terms for peace, but he instructs that they be kept out of Washington, as the amendment approaches a vote on the House floor. A rumor of their mission circulates, prompting both Democrats and conservative Republicans to advocate postponing the vote on the amendment. But in a carefully worded statement, Lincoln denies that there are envoys in Washington, and the vote proceeds, narrowly passing by a margin of two votes. Black visitors to the gallery celebrate, and Stevens returns home to his \"housekeeper\" and lover, a mixed-race woman.\n\nWhen Lincoln subsequently meets with the Confederates, he tells them that slavery cannot be restored as the North is united for ratification of the amendment, and that several of the southern states' reconstructed legislatures would also vote to ratify. On April 3, Lincoln visits the battlefield at Petersburg, Virginia, where he exchanges a few words with Lieutenant General Ulysses S. Grant. Six days later, Grant receives General Robert E. Lee's surrender at Appomattox Courthouse.\n\nOn April 14, Lincoln is in a meeting with members of his cabinet, discussing possible future measures to enfranchise blacks when he is reminded that First Lady Mary Todd Lincoln is waiting to take them to their evening at Ford's Theatre. That night, while Lincoln's son Tad is watching Aladdin and the Wonderful Lamp at Grover's Theatre, the manager suddenly stops the play and announces that the President has been shot, to the audience's shock and Tad's distress. The next morning at the Petersen House, Lincoln dies; Secretary of War Edwin Stanton declares, \"Now he belongs to the ages\".\n\nLincoln is seen again delivering his second inaugural address.",
  "synopsis": "This is the story of two families separated by a wall of war, different in everything, life, religion, beliefs, but are close to one another more than they can ever imagine. The Jewish family discover that their son (Joseph) has a blood group type different from his parents, so his father (Alon) can think of only two explanations: either his wife (Orith) has cheated on him, or the boy is not their son. Meanwhile a family doctor made a research and found that in that year when Orith had delivered her baby 18 years ago a raid hit that hospital, and in the panic of trying to escape and save the infants, the babies were switched by mistake. The problem is that the other baby lives on the other side of the wall, a Muslim from a Palestine family. The film tells the story of how these two families deal with this news, and how from being enemies they need to become a family. (by Dalia Kandalaft)"
}