{
  "imdb_id": "tt2061712",
  "tmdb_id": "118737",
  "douban_id": null,
  "title": "Interview with a Hitman (2012)",
  "genres": [
    "Action",
    "Thriller"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "96 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm4678690",
      "name": "Perry Bhandal"
    }
  ],
  "writer": [
    {
      "id": "nm4678690",
      "name": "Perry Bhandal",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0331577",
      "name": "Luke Goss",
      "character": "Viktor"
    },
    {
      "id": "nm3202512",
      "name": "Caroline Tillette",
      "character": "Bethesda"
    },
    {
      "id": "nm0007154",
      "name": "Stephen Marcus",
      "character": "Traffikant"
    },
    {
      "id": "nm0585661",
      "name": "Danny Midwinter",
      "character": "Sergei"
    },
    {
      "id": "nm4675422",
      "name": "Elliot Greene",
      "character": "Young Viktor"
    },
    {
      "id": "nm0924360",
      "name": "Philip Whitchurch",
      "character": "Tosca"
    },
    {
      "id": "nm0529300",
      "name": "Patrick Lyster",
      "character": "Xavier"
    },
    {
      "id": "nm1110435",
      "name": "Ray Panthaki",
      "character": "Franco"
    },
    {
      "id": "nm1670628",
      "name": "Uriel Emil",
      "character": "Alexandru       (as Uriel Emil Pollack)"
    },
    {
      "id": "nm1036127",
      "name": "Branko Tomovic",
      "character": "Anatolie"
    },
    {
      "id": "nm0951843",
      "name": "René Zagger",
      "character": "Cesar"
    },
    {
      "id": "nm1345685",
      "name": "Adrian Bouchet",
      "character": "Brett"
    },
    {
      "id": "nm0443825",
      "name": "Dermot Keaney",
      "character": "Kruchenko"
    },
    {
      "id": "nm4303322",
      "name": "Molly Harmon",
      "character": "Young Girl"
    },
    {
      "id": "nm4102902",
      "name": "James Capel",
      "character": "David"
    },
    {
      "id": "nm2544665",
      "name": "Christopher Sciueref",
      "character": "Vadim"
    },
    {
      "id": "nm1497802",
      "name": "Louise Franklin",
      "character": "Roxy"
    },
    {
      "id": "nm0564309",
      "name": "Jack McBride",
      "character": "Nathan"
    },
    {
      "id": "nm3351714",
      "name": "Drew Horsley",
      "character": "Raffa"
    },
    {
      "id": "nm0544903",
      "name": "Marcello Walton",
      "character": "Tony"
    },
    {
      "id": "nm1787364",
      "name": "Philip Arditti",
      "character": "Kovacs"
    },
    {
      "id": "nm6716081",
      "name": "Mark Burns",
      "character": "Gangster"
    },
    {
      "id": "nm4712855",
      "name": "Niamh Calderwood",
      "character": "Bar Patron       (as Naithen Calderwood)"
    },
    {
      "id": "nm3062696",
      "name": "Rikki Chamberlain",
      "character": "Marku"
    },
    {
      "id": "nm5019676",
      "name": "Dylan Edge",
      "character": "Pimp"
    },
    {
      "id": "nm4698944",
      "name": "Joanna Holden",
      "character": "Helena"
    },
    {
      "id": "nm4771502",
      "name": "Paul Knowles",
      "character": "Carl"
    },
    {
      "id": "nm4320922",
      "name": "Ben Lucas",
      "character": "Steve the Barman"
    },
    {
      "id": "nm4095928",
      "name": "Simon Manley",
      "character": "Henchman"
    },
    {
      "id": "nm4884408",
      "name": "Emily Outred",
      "character": "Martha"
    },
    {
      "id": "nm4700776",
      "name": "Lucy Scott-Smith",
      "character": "Angel"
    },
    {
      "id": "nm3774603",
      "name": "Steven Charles Stobbs",
      "character": "Zoltar /              The Man"
    },
    {
      "id": "nm3146549",
      "name": "Wayne Thompson",
      "character": "Henchman"
    },
    {
      "id": "nm1724384",
      "name": "Steve Wraith",
      "character": "Rick"
    },
    {
      "id": "nm1270633",
      "name": "Matthew Wynn",
      "character": "Anton"
    }
  ],
  "overview": "An elite hitman returns to erase his past only to find that somebody has messed with his future.",
  "storyline": "Trust No one. Feel nothing. Never lose: this is the mantra that has helped a ruthless Eastern European assassin rise to the pinnacle of his profession. Raised in the harsh slums of Romania, Victor knows the value of life more than most, which makes him the perfect killer. But after being betrayed by the very men who made him, he must fake his own death and escape to London. Here he joins a new gangster family and finds his rules are again put to the test in the midst of a vicious underworld power struggle. Viktor is now better, faster and more ruthless than ever before. With the secrets of his past refusing to fade away, an encounter with a dark beauty turns his world on its head and offers him the chance for a new life. But can he ever escape the existence he was born into? It is not long before a deadly threat from a past he thought long buried surfaces and he is forced to change his path. It is time to face that which cannot be forgotten.",
  "plot": "Viktor (Luke Goss) is a professional assassin. The film is told using flashbacks in which Viktor explains to a disgraced filmmaker how he became a professional assassin.\n\nHe starts his story with his childhood; he was raised in a slum area in an outlying district of Bucharest, Romania. He is being threatened by two young neighbourhood bullies, whom he owed money to, and Viktor’s father is also being threatened by a local mafia. He, then and there, decides to take up a job with the local mafia, not to pay off his father's debt, but simply to escape his own fate. Sergei, the local mafia lieutenant takes him in after he proves his mettle. He returns home where he witnesses his father abusing his mother. Soon after; his father is assassinated even though he tries to pay off his debt to the local mafia, and the money is returned to Victor’s mother.\n\nIn his first assignment, Viktor is sent to collect money owed to the mafia but the man belittles the young lad and pays with his life. Victor kills the man’s wife and was about to kill their two very young daughters when Sergei stops him and whisks him away. Viktor is moved to the city and is placed under the tutelage of Sergei, who teaches him how to be a hit man. In addition to preparation, eavesdropping, infiltration, and elimination, Sergei teaches him how to destroy a strong man by killing the people he cares for: \"Sometimes, a simple bullet is not enough.\"\n\nWorking with Sergei until adulthood, they are assigned to work a drug purchase with Franco, the son of their boss Trafficant. Franco attempts to kill the man he is making a deal with, and Viktor and Sergei are forced to back him up, killing the drug vendor as well as his bodyguards. Unfortunately, the man they were making a deal with is the son of a well-known mafia boss, Vadim. Sergei and Viktor are tasked with covering up the murder, but have doubts about Trafficant's ability to keep the truth from coming out.\n\nViktor returns to his apartment, turning on the shower, and Sergei sneaks in to dispatch him. Viktor has been trained well, though, and takes Sergei prisoner, disarming him. They sit down and discuss how things had come to this point. It is clear that the two men have high regard for each other, but Sergei explains that he was compelled to kill Viktor by orders from Trafficant (even though he does not want to do it). He has no choice - either he can kill Viktor, or he himself will be killed. Only Viktor walks away. Knowing that the Romanian mafia will not rest until they believe him to be dead, Viktor puts in a body double in his place, and burns his apartment out.\n\nHaving thus faked his own death, he begins a new life in London by retrieving a wanted informant for a London mafia boss. Having proved his skill, he is next tasked with killing a British police officer who cannot be bought. This is accomplished by using liquid nicotine in the man's coffee at a coffee shop, which induces heart failure. After this success, he is invited to celebrate with the mafia boss and two women. They are attacked on their way to celebrate, and discover that the boss's lieutenant sold them out. He kills the lieutenant, and is invited to replace him, but declines. As a parting request, the boss asks him to kill a female reporter who is writing an article about him.\n\nViktor goes to a coffee shop, and some toughs come in and grab a woman inside and take her to the back of the shop to beat and rape her. He takes out the man guarding the entrance, and is about to leave, but the sound of the woman being beaten flashes back to his father beating his mother, so he has a change of heart and rescues her, finding out her name is Bethesda. He winds up meeting her again later, and they fall in love.\n\nSix months later, he discovers that Bethesda is pregnant. After he finds out, he becomes very unsure of himself and almost kills her. He then tracks down the reporter and after he sees that she has a small child he shows her mercy and instead of killing her he tells her she is dead and needs to leave the country and start over somewhere else.\n\nViktor wants to turn over a new leaf and quit his job, but Romanian mafia comes back after him. His childhood friend Cesar has discovered that he is alive, and they try to kill him. Viktor takes Cesar prisoner, interviews him, and then kills him.\n\nReturning home to Bucharest, Viktor finds that his mother died not long after he left to the city with Sergei, and that the two bullies who threatened him for money as a kid were now local mafia men doing the same thing as adults. A brief stop and two bullets later, Viktor pays a visit to Trafficant in a restaurant. They have a conversation about how Trafficant discovered that Viktor was alive (Viktor's old friend Alexei now works for Interpol, and relays information to Trafficant), why Trafficant sent men the second time, and how Trafficant convinced Sergei to attempt to murder Viktor years ago. After the conversation, Viktor shoots Trafficant and leaves the restaurant.\n\nViktor next pays a visit to Alexei, to discover his reasons for selling him out to Trafficant (and to kill him), but changes his mind upon noticing a picture of Alexei and his family. He orders Alexei to bury the video evidence of him being alive, and warns him that if he has to return, he will kill him.\n\nFinally, the interview nears a conclusion. Bethesda arrives, and Viktor gives the man a ring - a ring that belongs to the interviewer's brother. Bethesda tells the story of two girls taken from their father and sold into service; one sister is weaker, and dies, but the other is stronger, and survives. Bethesda is that sister - she was used by the interviewer when she was only 10. The interview was a trap, to make him dream that he could have his film career back. Viktor shoots him.\n\nUnsettled, Viktor sits down at Bethesda's invitation. She shoots him with the gun the interviewer had dropped, and explains why she went to the elaborate lengths she did to get to this point. It is revealed that Viktor killed Bethesda's parents when he first started his career as a hitman. She is the one who sold him to Trafficant, who engineered the destruction of the interviewer, and ultimately, of Viktor himself. She tells him that the baby is a boy, and when the boy is old enough, she will show him the video of the interview so he can know what kind of man his father was, and despise him.",
  "synopsis": null
}