{
  "imdb_id": "tt2072227",
  "tmdb_id": "100681",
  "douban_id": null,
  "title": "Shanghai (2012)",
  "genres": [
    "Crime",
    "Mystery",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "120 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm1962313",
      "name": "Dibakar Banerjee"
    }
  ],
  "writer": [
    {
      "id": "nm0890825",
      "name": "Vasilis Vasilikos",
      "description": "adapted from the novel 'Z' by"
    },
    {
      "id": "nm1257497",
      "name": "Urmi Juvekar",
      "description": "screenplay and"
    },
    {
      "id": "nm1962313",
      "name": "Dibakar Banerjee",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm1431656",
      "name": "Emraan Hashmi",
      "character": "Jogi Parmar"
    },
    {
      "id": "nm1867717",
      "name": "Abhay Deol",
      "character": "T.A. Krishnan"
    },
    {
      "id": "nm0154146",
      "name": "Prasenjit Chatterjee",
      "character": "Dr. Ahmedi"
    },
    {
      "id": "nm3202701",
      "name": "Kalki Koechlin",
      "character": "Shalini Sahay"
    },
    {
      "id": "nm0665554",
      "name": "Supriya Pathak",
      "character": "Chief Minister Madamji"
    },
    {
      "id": "nm0794818",
      "name": "Tillotama Shome",
      "character": "Mrs. Ahmedi"
    },
    {
      "id": "nm1018224",
      "name": "Anant Jog",
      "character": "Jaggu"
    },
    {
      "id": "nm3329873",
      "name": "Pitobash",
      "character": "Bhaggu"
    },
    {
      "id": "nm0787582",
      "name": "Farooq Shaikh",
      "character": "Kaul"
    },
    {
      "id": "nm5131331",
      "name": "Ashok Pathak",
      "character": "Auto Driver"
    },
    {
      "id": "nm6630090",
      "name": "Arvind Goswami",
      "character": "Agency Head"
    },
    {
      "id": "nm3245943",
      "name": "Kiran Karmarkar",
      "character": ""
    },
    {
      "id": "nm3078280",
      "name": "Megh Pant",
      "character": "Damle"
    },
    {
      "id": "nm7677316",
      "name": "Rajiv Ranjan",
      "character": "Police Inspector"
    },
    {
      "id": "nm4121079",
      "name": "Chandrahas Tiwari",
      "character": "Vinod"
    },
    {
      "id": "nm5805978",
      "name": "Scarlett Mellish Wilson",
      "character": "Tina Ray"
    }
  ],
  "overview": "A small town somewhere in India is poised to become the next Shanghai. Billions of dollars are being poured into an upcoming International Business Park. On the eve of its launch a drunk truck driver mows down a prominent social activist. A lone girl believes it to be a murder, supported by a porn film maker who claims to have the proof that will bring the government down. A high ranking bureaucrat is brought in to investigate the accident. Shanghai, a political thriller, follows the journey of these unlikely heroes as they come together to find justice in the labyrinth of Indian democracy.",
  "storyline": "Prime leader of a campaign against a big government project is killed in what appears to be a road accident. An IAS officer is ordered to probe the incident and the veils of falsehood begin to drop.",
  "plot": "In Istanbul, MI6 agents James Bond and Eve Moneypenny chase a mercenary, Patrice, who has stolen a hard drive containing details of undercover agents. As Bond and Patrice fight atop a train, M, the head of MI6, orders Eve to shoot Patrice from long range. Eve misses and inadvertently hits Bond, who falls into a river. Bond is presumed dead and Patrice escapes.\n\nIn the aftermath of the operation, M comes under pressure from Gareth Mallory, the chairman of the British parliament's Intelligence and Security Committee, to retire. On her return from the meeting, MI6's servers are hacked and M receives a taunting message via computer moments before the MI6 building explodes, killing several employees. Bond, who has used his presumed death to retire, learns of the attack and returns to London. Although he fails a series of physical and psychological examinations, M approves his return to the field. Bond is ordered to identify Patrice's employer, recover the stolen hard drive, and kill Patrice. He meets Q, MI6's new quartermaster, who gives him a radio beacon and a pistol that will only fire when it registers Bond's handprints.\n\nIn Shanghai, Bond follows Patrice into a skyscraper, but is unable to prevent him from killing his target. The two fight, but Patrice falls to his death before Bond can learn of his employer's identity. Searching Patrice's equipment, Bond finds a gambling chip intended as payment for the assassination, which leads him to a casino in Macau. Bond is approached by Séverine, Patrice's accomplice, and asks to meet her employer. She warns him that he is about to be killed by her bodyguards, but promises to help Bond if he will kill her employer. Bond thwarts the attack and joins Séverine on her yacht. They travel to an abandoned island off the coast of Macau, where they are taken prisoner by the crew and delivered to Séverine's employer, Raoul Silva. A former MI6 agent, Silva has turned to cyberterrorism, and orchestrated the attacks on MI6. Silva kills Séverine, but Bond captures Silva for rendition to Britain.\n\nAt MI6's underground headquarters in London, Q attempts to decrypt Silva's laptop but inadvertently gives it access to the MI6 systems, allowing Silva to escape from MI6 custody. Bond realises that Silva wanted to be captured as part of a plan to kill M, whom he resents for leaving him to die after being captured years earlier. Bond gives chase through the London Underground tunnel network. Silva attacks M during a public inquiry into her handling of the stolen hard drive. Bond arrives in time to repel Silva's attack, and M is hurried from the building by her aide, Bill Tanner.\n\nBond takes M to Skyfall, his family estate and childhood home in the Scottish Highlands. Laying a trap, he instructs Q to leave an electronic trail for Silva to follow, a decision Mallory supports. Bond and M are met by Kincade, the Skyfall gamekeeper. The trio set up a series of booby traps throughout the house. When Silva's men arrive, Bond, M and Kincade manage to kill most of them, but M is wounded. Silva arrives by helicopter with a second party and heavy weapons, so Bond sends M and Kincade off through a secret tunnel to a chapel on the grounds. Bond detonates gas canisters and retreats down the same tunnel as M and Kincade. The blast causes the helicopter to crash, destroying the house and killing all but a handful of Silva's men.\n\nSilva survives and, spotting Kincade's torch beam, follows Kincade and M to the chapel. He forces his gun into M's hand, begging her to kill them both. Bond arrives and kills Silva by throwing a knife into his back. M, however, dies from her wounds. Following M's funeral, Eve—formally introducing herself to Bond as Eve Moneypenny—retires from field work to become secretary for the new head of MI6, Mallory. Mallory assumes the title of M.",
  "synopsis": "A small town somewhere in India is poised to become the next Shanghai. Billions of dollars are being poured into an upcoming International Business Park.On the eve of its launch a drunk truck driver mows down a prominent social activist. A lone girl believes it to be a murder, supported by a porn film maker who claims to have the proof that will bring the government down.\nA high ranking bureaucrat is brought in to investigate the accident.Shanghai, a political thriller, follows the journey of these unlikely heroes as they come together to find justice in the labyrinth of Indian democracy."
}