{
  "imdb_id": "tt2049543",
  "tmdb_id": "347945",
  "douban_id": null,
  "title": "Synchronicity (2015)",
  "genres": [
    "Drama",
    "Mystery",
    "Romance",
    "Sci-Fi"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "101 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.5,
  "director": [
    {
      "id": "nm1402180",
      "name": "Jacob Gentry"
    }
  ],
  "writer": [
    {
      "id": "nm1402180",
      "name": "Jacob Gentry",
      "description": "writer"
    },
    {
      "id": "nm1402180",
      "name": "Jacob Gentry",
      "description": null
    },
    {
      "id": "nm1373794",
      "name": "Alex Orr",
      "description": "story"
    }
  ],
  "cast": [
    {
      "id": "nm0572030",
      "name": "Chad McKnight",
      "character": "Jim Beale       (as Chadrian McKnight)"
    },
    {
      "id": "nm1732403",
      "name": "Brianne Davis",
      "character": "Abby"
    },
    {
      "id": "nm1410105",
      "name": "AJ Bowen",
      "character": "Chuck"
    },
    {
      "id": "nm1407651",
      "name": "Scott Poythress",
      "character": "Matty"
    },
    {
      "id": "nm0000461",
      "name": "Michael Ironside",
      "character": "Klaus Meisner"
    },
    {
      "id": "nm1579535",
      "name": "Wade Tilton",
      "character": "Clerk"
    }
  ],
  "overview": "In this mind-bending 'Sci-Fi Noir' a daring physicist folds time to travel into the past, trying to stop a mysterious woman from stealing his invention. But once there, he uncovers a surprising truth about the machine, the woman, and his own fractured reality.",
  "storyline": "From the creators of The Signal (Sundance 2007) comes Synchronicity, a mind-bending 'Sci-fi Noir' in the tradition of Dark City, Blade Runner, and Alphaville. When physicist Jim Beale invents a machine that can fold space-time, a rare Dahlia appears from the future. He must now find the flower's identical match in the present to prove his machine works. Jim soon discovers that the Dahlia lies in the hands of a mysterious girl, who seduces him into revealing his secrets. Convinced that he's fallen prey to a femme fatale trying to steal his invention, Jim travels back in time to stop her betrayal before it happens. But once in the past, Jim uncovers a surprising truth about the machine, the girl, and his own reality.",
  "plot": "Physicist Jim Beale, working with two colleagues (Chuck and Matt), invents a machine that makes time travel possible. The machine operates by creating one half of a wormhole during one run, the other half during a second run. In addition, the process is expensive and dangerous. To activate the process requires radioactive material created by a company owned by Klaus Meisner, a venture capitalist.\n\nIf the material is mishandled as part of the process, the machine will malfunction - creating a devastating explosion. During the first test, Beale receives a genetically-created flower from the wormhole. Beale cannot prove his invention actually works without Meisner's material for a second test. Meisner demands 49% ownership of the process in exchange for the material. The second test is scheduled for one week after the first.\n\nSoon after the first test, Beale meets Abby Ross, who seems to know too much about him for their meeting to be coincidental. He is attracted to her, but also suspicious. His suspicions are apparently confirmed when Chuck calls him on his cell phone and tells Beale that Abby is not to be trusted and the test has succeeded much more than they thought. Beale leaves Abby and rushes back to the lab, but Chuck refuses to explain. Beale later ignores his suspicions and starts a relationship with Abby. They discover a deep bond, which is broken when Chuck's warning is confirmed: Abby tells Meisner about the flower. Meisner threatens Beale with knowledge of the flower, the intellectual property of another of his companies. Meisner extorts Beale for another 50% ownership of Beale's research, leaving Beale with 1%.\n\nHeartbroken and not thinking clearly, during the second test Beale jumps into the wormhole and is transported one week into the past to the time of the first test.\n\nBeale is convinced that on this \"second run\", he can outwit Meisner and Abby and prevent his research from falling into their hands. He seduces Abby but soon learns that she was honestly attracted to him: a science writer herself, she had read an article about him and crafted a fanciful story in a journal about what he must be like. Having learned more about him from Meisner and from learning about his work, she is powerfully attracted to him. Beale reads the fictional story but finds that it is both a somewhat inaccurate representation of his work and is unfinished.\n\nComplications arise: the \"second run\" Beale becomes physically weakened, and experiences pain when in close proximity to \"Jim Prime\", the Beale from before jumping into the wormhole. Beale reveals himself to Chuck and Matt in the hopes of securing their help to protect the research. They both assist Beale and conceal his presence from Jim Prime, explaining several confusing interactions in the week before the second test. Beale is jealous of Jim Prime, but there is no need: Jim Prime is still suspicious of Abby and it is clear that he will have nothing to do with her after the second test because of her betrayal.\n\nBeale continues to weaken. He encounters Abby's journal again (this time in Matt's hands) and is confused - in the first timeline, it was at Abby's apartment. Matt says he found it in Jim's coat pocket when he came out of the wormhole. The journal is now subtly different and it makes it clear that Beale has jumped not back in time, but into the past of a parallel universe, slightly different from the one he left. Slight inconsistencies Beale has not noticed in this timeline are explained. Chuck says that it is impossible for two Beales to exist in the same universe, so the \"second run\" Beale will die and only Jim Prime will remain.\n\nBeale enlists Chuck and Matt's help in making an unscheduled wormhole to send himself to the past with his new knowledge to try and prevent the research from being stolen. A mistake is made in the process, preventing the time jump and wasting the radioactive material.\n\nThe date of the second test arrives. Beale finds another time-displaced Jim dead in a hotel after trying to leave the city. He returns to the Grand Hotel, where he sees Abby's apparent betrayal was to get more material to make the second test happen to send Jim Prime away and save Beale's life. The second test happens as before, but when Abby returns to the Grand Hotel, Beale has already died.\n\nAfter, Abby is alone in a cafe when Jim Prime - apparently healthy - sits down across from her. Jim reveals a deep attraction to Abby, and introduces himself. Abby acknowledges his similarity in appearance to the physicist \"John Bain\" whom she is writing a novel about. However, as far as she knew, John Bain was killed in a devastating explosion in his lab. The unspoken implication is that Jim Prime would not wither away like Beale did, as he entered a universe with no other Jim present.",
  "synopsis": null
}