{
  "imdb_id": "tt2066062",
  "tmdb_id": "166217",
  "douban_id": null,
  "title": "Shortcut Romeo (2013)",
  "genres": [
    "Action",
    "Crime",
    "Romance",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "146 min",
      "description": ""
    }
  ],
  "imdb_rating": 2.5,
  "director": [
    {
      "id": "nm1333986",
      "name": "Susi Ganesan"
    }
  ],
  "writer": [
    {
      "id": "nm1333986",
      "name": "Susi Ganesan",
      "description": "story and screenplay"
    },
    {
      "id": "nm5498584",
      "name": "Ilashree Goswami",
      "description": "dialogue"
    }
  ],
  "cast": [
    {
      "id": "nm1778703",
      "name": "Neil Nitin Mukesh",
      "character": "Suraj"
    },
    {
      "id": "nm0665349",
      "name": "Ameesha Patel",
      "character": "Monica"
    },
    {
      "id": "nm1223967",
      "name": "Puja Gupta",
      "character": "Sherry /              Radhika"
    },
    {
      "id": "nm0340491",
      "name": "Jatin Grewal",
      "character": "Ashish       (as Bunty Grewal)"
    },
    {
      "id": "nm2517742",
      "name": "Rajesh Shringarpore",
      "character": "Rahul"
    },
    {
      "id": "nm1333986",
      "name": "Susi Ganesan",
      "character": "Ganesh"
    },
    {
      "id": "nm0386358",
      "name": "Vrajesh Hirjee",
      "character": "IMC"
    },
    {
      "id": "nm1796211",
      "name": "Bikramjeet Kanwarpal",
      "character": "Suraj's uncle       (as Major Bikramjeet Singh)"
    },
    {
      "id": "nm3243581",
      "name": "Ashutosh Kaushik",
      "character": "Nihal"
    },
    {
      "id": "nm1892086",
      "name": "Mumait Khan",
      "character": "Dancer"
    },
    {
      "id": "nm4447124",
      "name": "Errol Peter Marks",
      "character": "Patrao       (as Errol Marks)"
    },
    {
      "id": "nm3881895",
      "name": "Meherzan Mazda",
      "character": "Aman"
    },
    {
      "id": "nm4908014",
      "name": "Neelima Parandekar",
      "character": "Radhika's stepmother"
    },
    {
      "id": "nm5082618",
      "name": "Rajesh Shringarpure",
      "character": "Rahul"
    }
  ],
  "overview": "Shortcut Romeo is an Indian romantic thriller film to be directed and produced by Susi Ganeshan, under the banner Susi Ganesh Productions. It is the Hindi remake of the director's own Tamil film Thiruttu Payale (2006), starring Neil Nitin Mukesh in the title role with Puja Gupta as his love interest and Ameesha Patel in a negative character.",
  "storyline": "Shortcut Romeo is a predictable but stylishly made masala movie, leave your common sense behind if you want to enjoy this film!",
  "plot": null,
  "synopsis": "Suraj a good for nothing youth, who throws his weight around his house with his violent attitude. One day in a fit of rage, he injures his younger brother, following which he is sent off from Goa to Mumbai to his uncle's house.\nSuraj chances upon a couple indulging in love making on the lawns of a golf course. He has this act shot on a video camera. He then finds out that it is an extramarital affair and that the lovers Monica and Ashish are rich. Despite Monicas offering large sums of money for the tape, Suraj refuses to part with it. His demand is much greater. He wants an assurance from her that she will provide him a luxurious life throughout his life. Monica has no choice; she succumbs to Suraj's blackmail and Suraj foots his holiday in Kenya along with his friends. Monica at every stage of the bilking process tries to outsmart Suraj; the battle of wits is on. Suraj meets Sherry a rich but lonely girl and falls in love with her. Thats when he begins to realize that there are things more important than money in life. The cat and mouse game between Monica and Suraj, and the way one alternately checkmates the other in every round goes on till Rahul (Monicas husband) hires a private detective. Does Suraj join with sherry? Does Monica free herself from the clutches of the blackmailer? Or does the husband punish Suraj? The later part of the story ends with interesting twist and turns."
}