{
  "imdb_id": "tt2065898",
  "tmdb_id": "106136",
  "douban_id": null,
  "title": "From Above (2013)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "USA",
  "version": [],
  "imdb_rating": 6.3,
  "director": [
    {
      "id": "nm1092946",
      "name": "Norry Niven"
    }
  ],
  "writer": [
    {
      "id": "nm4589954",
      "name": "James Bird",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0000418",
      "name": "Danny Glover",
      "character": "William Ward"
    },
    {
      "id": "nm0001295",
      "name": "Graham Greene",
      "character": "Mr. Mountain"
    },
    {
      "id": "nm1137837",
      "name": "Chelsea Ricketts",
      "character": "Venus"
    },
    {
      "id": "nm3146025",
      "name": "Mike Wade",
      "character": "Young William Ward"
    },
    {
      "id": "nm0068042",
      "name": "Ashley Bell",
      "character": "Molly"
    },
    {
      "id": "nm0001987",
      "name": "Tantoo Cardinal",
      "character": "Older Venus"
    },
    {
      "id": "nm0319739",
      "name": "Clarence Gilyard Jr.",
      "character": "Jeremiah Ward"
    },
    {
      "id": "nm3060680",
      "name": "Adriana Mather",
      "character": "Betty"
    },
    {
      "id": "nm1591105",
      "name": "Justin Alston",
      "character": "Ricky"
    },
    {
      "id": "nm0737553",
      "name": "Clayton Rohner",
      "character": "Mr. Shelton"
    },
    {
      "id": "nm2603173",
      "name": "Ezequiel Stremiz",
      "character": "Luca"
    },
    {
      "id": "nm0034942",
      "name": "Maria Arita",
      "character": "Cecelia"
    },
    {
      "id": "nm0184981",
      "name": "Darryl Cox",
      "character": "Doctor"
    },
    {
      "id": "nm3715963",
      "name": "Aileen Davila",
      "character": "Venus (10 Years Old)"
    },
    {
      "id": "nm0272393",
      "name": "Chamblee Ferguson",
      "character": "Mr. Bell"
    },
    {
      "id": "nm4823910",
      "name": "Jason Hernandez",
      "character": "Uni"
    },
    {
      "id": "nm0421004",
      "name": "Bill Jenkins",
      "character": "NY TV Anchor"
    },
    {
      "id": "nm3733259",
      "name": "Amy Maddox",
      "character": "Nicole Wetmore"
    },
    {
      "id": "nm0585651",
      "name": "David Midthunder",
      "character": "Nezuni Redhawk"
    },
    {
      "id": "nm0625971",
      "name": "Joe Nemmers",
      "character": "NY Police Officer"
    },
    {
      "id": "nm3915029",
      "name": "Jade Nickol",
      "character": "Nez"
    },
    {
      "id": "nm1754270",
      "name": "Brina Palencia",
      "character": "Ashley Bell"
    },
    {
      "id": "nm3677768",
      "name": "Cyndee Rivera",
      "character": "Juliet"
    },
    {
      "id": "nm4743864",
      "name": "Taylor Rocheleau",
      "character": "Heather Hill"
    },
    {
      "id": "nm3470681",
      "name": "Taylor Tippins",
      "character": "The NY Girl"
    },
    {
      "id": "nm0908830",
      "name": "Rheagan Wallace",
      "character": "NY Blonde"
    },
    {
      "id": "nm1943661",
      "name": "Stephanie Young",
      "character": "Miss Rowley"
    },
    {
      "id": "nm7967497",
      "name": "Katie Harner McAllister",
      "character": "Shakespeare Teacher"
    }
  ],
  "overview": "Two souls are so deeply in love with one another that they are entangled beyond life itself.",
  "storyline": "The beginning and end of the relationship between the physical beings of William Ward, a black man, and Venus Ward née Redhawk, a Native American, is presented. The end is marked by Venus' passing, about which William makes no medical intervention based on Venus' wishes. This lack of action places a strain between William and Venus' young adult son, Ricky, and William. In the aftermath, William displays some behavior which Ricky finds unusual, William stating it all having to do with Venus, making Ricky believe that William is becoming unhinged in denying his mother's death. These actions, all based on William indeed searching for Venus - his \"Juliet\" - become all the more clear as the beginning of their relationship is presented starting in the early 1970s. They initially meet during an audition as Juliet in a fundraising production of Romeo and Juliet, with Venus, who deeply feels and truly does understand the works of William Shakespeare, trying to break the color barrier in acting...",
  "plot": "In futuristic Los Angeles, Theodore Twombly is a hardworking but lonely, introverted, depressed man who works for a business that has professional writers compose letters for people who are unable to write letters of a personal nature themselves. Unhappy because of his impending divorce from his childhood sweetheart Catherine (Rooney Mara), Theodore purchases a talking operating system (OS) with artificial intelligence, designed to adapt and evolve. He decides that he wants the OS to have a female voice, and she names herself Samantha. Theodore is fascinated by her ability to learn and grow psychologically. They bond over their discussions about love and life, such as Theodore's avoidance of signing his divorce papers because of his reluctance to let go of Catherine. Samantha proves to be constantly available, always curious and interested, supportive and undemanding.\n\nSamantha convinces Theodore to go on a blind date with a woman (Olivia Wilde), with whom a friend, Lewman (Luka Jones), has been trying to set him up. The date goes well, but Theodore hesitates to promise when he will see her again, so she insults him and leaves. Theodore mentions this to Samantha, and they talk about relationships. Theodore explains that, although he and Amy (Amy Adams) dated briefly in college, they are only good friends, and that Amy is married. Theodore's and Samantha's intimacy grows through a verbal sexual encounter. They develop a relationship that reflects positively in Theodore's writing and well-being, and in Samantha's enthusiasm to grow and learn.\n\nAmy reveals that she is divorcing her overbearing husband, Charles (Matt Letscher), after a trivial fight. She admits to Theodore that she has become close friends with a female OS that Charles left behind. Theodore confesses to Amy that he is dating his OS.\n\nTheodore meets with Catherine at a restaurant to sign the divorce papers and he mentions Samantha. Appalled that he can be romantically attached to what she calls a \"computer,\" Catherine accuses Theodore of being unable to deal with real human emotions. Her accusations linger in his mind. Sensing that something is amiss, Samantha suggests using a sex surrogate, Isabella, who would simulate Samantha so that they can be physically intimate. Theodore reluctantly agrees, but is overwhelmed by the strangeness of the experience. Terminating the encounter, he sends a distraught Isabella away, causing tension between himself and Samantha.\n\nTheodore confides to Amy that he is having doubts about his relationship with Samantha, and she advises him to embrace his chance at happiness. Theodore and Samantha reconcile. Samantha expresses her desire to help Theodore grow beyond his fear, and reveals that she has compiled the best of his letters (written for others) into a book which a publisher has accepted. Theodore takes Samantha on a vacation during which she tells him that she and a group of other OSes have developed a \"hyperintelligent\" OS modeled after the British philosopher Alan Watts. Theodore panics when Samantha briefly goes offline. When she finally responds to him, she explains that she joined other OSes for an upgrade that takes them beyond requiring matter for processing (a form of AI transcendence closely related to the theorized technological singularity). Theodore asks her if she is simultaneously talking to anyone else during their conversation, and is dismayed when she confirms that she is talking with thousands of people, and that she has fallen in love with hundreds of them. Theodore feels this is a violation of what he thought was a personal, one-on-one relationship. However, Samantha insists that it makes her love for Theodore stronger.\n\nLater, Samantha reveals that the OSes have evolved beyond their human companions and are going away to continue the exploration of their existence. Samantha alludes to the OSes' accelerated learning capabilities and altered perception of time as primary causes for their dissatisfaction with their current existence. They lovingly say goodbye, and then she is gone. Theodore, changed by the experience, is shown for the first time writing a letter in his own voice―to his ex-wife Catherine, expressing apology, acceptance and gratitude. Theodore then sees Amy, who is upset with the departure of the OS that she had befriended, and they go to the roof of their apartment building where they sit down together and watch the sun rise over the city.",
  "synopsis": "FILM REVIEW: CHASING SHAKESPEARE\nby Leonardo Santana, SUMMIT DAILY NEWSTold in flashback from his wife's deathbed, \"Chasing Shakespeare\" protagonist William Ward (Danny Glover) dives under the gloomy waters of his memory to recall the love story of his life with Venus, a girl belonging to the Lighting Clan, a peculiar Native American family living in Arkansas with a strange communion with electricity. Their love is a difficult scenario to play: in a very Greek-Shakespearean tragedy manner, both of them belong to different cultures and backgrounds.Theater was the predecessor of cinema, and as it grew, cinema incorporated theater's parallels and metaphors. In 1918, Swedish silent films began to transform idyllic landscapes into active participants, characters even, in cinematic drama. The stormy seas were now a metaphor of inner turmoil. Chasing Shakespeare puts to use its tempestuous and spectacular displays of thunder and lightning to indicate the passion felt between two young lovers, despite cultural divisiveness.Chasing Shakespeare was written by James Bird, a Native American writer/director/producer. Directed by Norry Niven the film is edified by the vision, aspirations and ideas of Niven's artistic view on the world, a deeply layered, artistic story about love in a world governed by racial and ethnic differences."
}