{
  "imdb_id": "tt2081194",
  "tmdb_id": "165864",
  "douban_id": null,
  "title": "Hansel & Gretel Get Baked (2013)",
  "genres": [
    "Comedy",
    "Horror"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "86 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.3,
  "director": [
    {
      "id": "nm0431172",
      "name": "Duane Journey"
    }
  ],
  "writer": [
    {
      "id": "nm1196692",
      "name": "David Tillman",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0703939",
      "name": "Molly C. Quinn",
      "character": "Gretel       (as Molly Quinn)"
    },
    {
      "id": "nm0919616",
      "name": "Michael Welch",
      "character": "Hansel"
    },
    {
      "id": "nm0001223",
      "name": "Lara Flynn Boyle",
      "character": "Witch Agnes"
    },
    {
      "id": "nm0000144",
      "name": "Cary Elwes",
      "character": "Meter Man"
    },
    {
      "id": "nm0020264",
      "name": "Andrew James Allen",
      "character": "Ashton"
    },
    {
      "id": "nm1274545",
      "name": "Reynaldo Gallegos",
      "character": "Carlos"
    },
    {
      "id": "nm4222158",
      "name": "Bianca Saad",
      "character": "Bianca"
    },
    {
      "id": "nm0613147",
      "name": "Lochlyn Munro",
      "character": "Officer Ritter"
    },
    {
      "id": "nm0000319",
      "name": "Yancy Butler",
      "character": "Officer Hart"
    },
    {
      "id": "nm1285141",
      "name": "Eddy Martin",
      "character": "Manny"
    },
    {
      "id": "nm0649497",
      "name": "Joe Ordaz",
      "character": "Jorge"
    },
    {
      "id": "nm1379641",
      "name": "Celestino Cornielle",
      "character": "Octavio       (as Celestin Cornielle)"
    },
    {
      "id": "nm1196692",
      "name": "David Tillman",
      "character": "Norm"
    },
    {
      "id": "nm1695726",
      "name": "Claudia Choi",
      "character": "Sam"
    },
    {
      "id": "nm4066675",
      "name": "Edward Zo",
      "character": "Teenager #1"
    },
    {
      "id": "nm0355088",
      "name": "Doug Haley",
      "character": "Teenager #2"
    },
    {
      "id": "nm5917707",
      "name": "Xavier Kai Roy",
      "character": "Bicycle Kid #1"
    },
    {
      "id": "nm5917708",
      "name": "Xander Kekoa Roy",
      "character": "Bicycle Kid #2"
    },
    {
      "id": "nm4570265",
      "name": "Danielle Adams",
      "character": "Paramedic"
    },
    {
      "id": "nm4125280",
      "name": "Lexie Hofer",
      "character": "Coed #1"
    },
    {
      "id": "nm1674760",
      "name": "Karissa Thoma",
      "character": "Coed #2"
    }
  ],
  "overview": "An intense new marijuana strain named “Black Forest” is taking Los Angeles by storm, and Gretel’s stoner boyfriend can’t get enough. But when the old woman growing the popular drug (Lara Flynn Boyle) turns out to be an evil witch, cooking and eating her wasted patrons for their youth, Gretel and her brother Hansel must save him from a gruesome death — or face the last high of their lives.",
  "storyline": "The pothead Ashton Crawford and his girlfriend Gretel are smoking in her room special marijuana called Black Forest supplied by the drug dealer Manny and produced by an old lady named Agnes that lives in Pasadena. Gretel's brother Hansel arrives home and Gretel tells that she will bake gingerbread cookie while Ashton will go directly to Agnes to buy more Black Forest. However Agnes is a witch and captures Ash to eat his flesh and drain his youth to maintain youth. Gretel seeks her boyfriend out and suspects of Agnes, but the police officers Ritter and Hart do not give credit to her words since Ritter knows that Ash is a pothead. Meanwhile the gang that supplies weed to Manny learns that he is selling Black Forest to his costumers and they threaten him and their leader Jorge sends a message to Agnes through Manny. However, the drug dealer is turned into a zombie by Agnes and Jorge and his gang pay a visit to her and are also turned into zombies. Soon Gretel and Manny's girlfriend ...",
  "plot": "The film begins with an electrician (cameo by Cary Elwes) monitoring the electricity box behind an old house. Peering in through a window, he sees a huge marijuana crop. Something pulls him through the window, and we hear him give a dying scream.\n\nWe then cut to see Gretel (Molly Quinn) and her boyfriend Ashton smoking weed in Gretel's room. The weed is a new strain called \"Black Forest\" and is being produced by a little old lady living in Pasadena. When Gretel's older brother Hansel (Michael Welch) comes home, he tantalizes the stoned pair with a box of gingerbread cookie mix. Gretel agrees to bake the cookies while Ashton goes off to buy more Black Forest from the old lady.\n\nAshton is invited into the old lady's house. The lady's name is Agnes (Lara Flynn Boyle) and unbeknownst to everyone, she is a witch. Ashton is drugged and awakens on an operating table guarded by Agnes's demonic dog. Meanwhile, Agnes coats his body in butter before eating parts of his body and eventually sucking out his youth (which restores her youth in turn). Eventually, Hansel and Gretel begin searching for Ashton, but they are ridiculed by the police and the trail ends with Agnes. The siblings interrogate Agnes, but she reveals nothing.\n\nMeanwhile, local drug kingpin Carlos intimidates Agnes' dealer Manny into giving him the address of the house. Manny finds Agnes first to warn her that Carlos is coming, but she just laughs and kills Manny and steals his youth. When Carlos and his two thugs arrive, she easily dispatches Carlos and one of the thugs, while trapping the surviving henchman in a cage. It is also revealed that she can turn her victims into zombies to help in her attacks. Meanwhile, Gretel and Manny's girlfriend Bianca (Bianca Saad) join forces to infiltrate Agnes' house. Before they leave, Gretel emails Hansel that she is going to confront Agnes again.\n\nWhile Bianca distracts Agnes through various means, Gretel sneaks into the basement where she finds the Black Forest crop, the remaining henchman, and the remains of the men Agnes has killed. Gretel leaves a trail of Skittles to help her find her way through the Black Forest. Eventually, Agnes sees through the ruse and the two girls are captured (and Agnes kills the henchman in front of them). Hansel shows up and is confronted by Carlos (now a zombie) after discovering Agnes is a witch. Agnes also shoots two cops who show up to investigate the disappearance of all the teens (but it is later revealed they survived due to wearing bullet proof vests). Although Hansel destroys the zombie, he is knocked out by Agnes and placed in the oven room for cooking preparation.\n\nGretel and Bianca break out of their cage and sing the demonic dog to sleep. They stop Agnes right before she cooks Hansel, but Agnes manages to kill Bianca. During the struggle, Gretel manages to push Agnes into the oven and lock her in. The oven explodes, causing the marijuana crop and house to burn down. Hansel and Gretel manage to escape.\n\nAs various first responders arrive at the scene, we see a cat strolling about the ashes. One of the first responders picks up the cat and takes it into his van with him, planning to take the feline home. We then hear the responder's howls of agony as he is slaughtered in his van. We see that Agnes (who had shape-shifted into the cat and somehow survived the oven) is now behind the wheel. She smiles at the camera as she drives away from the scene.",
  "synopsis": null
}