{
  "imdb_id": "tt2091295",
  "tmdb_id": "173499",
  "douban_id": null,
  "title": "Everyone's Going to Die (2013)",
  "genres": [
    "Drama"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "87 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.0,
  "director": [
    {
      "id": "nm1493122",
      "name": "Jones"
    }
  ],
  "writer": [
    {
      "id": "nm1493122",
      "name": "Jones",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm1160560",
      "name": "Nora Tschirner",
      "character": "Melanie"
    },
    {
      "id": "nm4956587",
      "name": "Rob Knighton",
      "character": "Ray"
    },
    {
      "id": "nm1277450",
      "name": "Kellie Shirley",
      "character": "Ali"
    },
    {
      "id": "nm0302320",
      "name": "Stirling Gallacher",
      "character": "Jackie"
    },
    {
      "id": "nm4956591",
      "name": "Liberty Selby",
      "character": "Grace"
    },
    {
      "id": "nm1728384",
      "name": "Madeline Duggan",
      "character": "Laura"
    },
    {
      "id": "nm4734439",
      "name": "Eliza Harrison-Dine",
      "character": "Megan"
    },
    {
      "id": "nm1904295",
      "name": "Ellie Chidzey",
      "character": "Kate"
    },
    {
      "id": "nm5543983",
      "name": "Dimitrijs Burilov",
      "character": "Shop Assistant"
    },
    {
      "id": "nm0447479",
      "name": "Mark Kempner",
      "character": "The Mark"
    },
    {
      "id": "nm3727612",
      "name": "Ky Discala",
      "character": "Alex       (as Kylie Hutchinson)"
    },
    {
      "id": "nm5544071",
      "name": "Jamie Chung",
      "character": "Danny"
    },
    {
      "id": "nm4957489",
      "name": "Ionut Paliev",
      "character": "Cafe Owner"
    },
    {
      "id": "nm4531933",
      "name": "Dizzy Maggs",
      "character": "Hotel Maid"
    },
    {
      "id": "nm5544002",
      "name": "Reuben Perdios",
      "character": "Jack"
    },
    {
      "id": "nm5543982",
      "name": "Graeme Alexander",
      "character": "Job Advisor"
    },
    {
      "id": "nm5544077",
      "name": "Daniel Barfield",
      "character": "Red Indian"
    },
    {
      "id": "nm4730721",
      "name": "Clayton Thomson",
      "character": "John"
    },
    {
      "id": "nm4875630",
      "name": "Kay McLoughlin",
      "character": "John's Wife"
    },
    {
      "id": "nm2259723",
      "name": "Steve Thomas",
      "character": "Man in Cafe"
    },
    {
      "id": "nm5544040",
      "name": "Glenn Mccance",
      "character": "Train Conductor"
    },
    {
      "id": "nm4645772",
      "name": "Dominic O'Flynn",
      "character": "Boss"
    },
    {
      "id": "nm2073429",
      "name": "Brett Goldstein",
      "character": "Richard"
    },
    {
      "id": "nm7435160",
      "name": "Sophie Claringbold",
      "character": "Nightclub and Restaurant Customer"
    },
    {
      "id": "nm7435159",
      "name": "Spice New",
      "character": "Nightclub and Restaurant Customer"
    }
  ],
  "overview": "Melanie's life in a seaside town is going nowhere until she meets Ray, back in town with a shady job to do. A moment's escape becomes a chance to save themselves, and each other.",
  "storyline": "Two lost souls. One last chance. Melanie's life in a seaside town is going nowhere until she meets Ray, back in town with a shady job to do. A moment's escape becomes a chance to save themselves, and each other. Everyone's Going To Die is a modern British story about coming home, getting by and the redemptive power of feeling you're not alone. A story where porn hotlines rub shoulders with sexy beavers on rollerskates; where the past is laid to rest, two lives are changed and nobody, finally, is going to die.",
  "plot": "We first see Melanie (Nora Tschirner), a young German woman who's moved to an English seaside town to be with her fiancé, dressed as Charlie Chaplin, the morning after a party. Her fiancé has left her there, which is where she meets Ali (Kellie Shirley) who offers to find her a job waitressing. She seems to be drifting, with no job, money or friends - her aimless existence broken up by supervising her fiancé's niece – a task that she doesn't appear to relish.\n\nShe meets 50-something Ray (Rob Knighton), when he offers to pay for the coffee that she can't afford. Ray looks and sounds like a clichéd East End hitman, and we soon learn that it's not far from the truth... but it's not the whole truth. Ray has returned to the town he grew up in to pay his respects to his recently deceased brother's family.\n\nTheir relationship grows slowly, as they reveal confidences, share awkward, darkly funny situations (meeting Ray's eccentric relatives) and enjoy being together.\n\nWhen Ray &amp; Melanie meet Ray's niece Laura (Madeline Duggan) it sparks a new effort in Ray to deal with his family past. For Laura, it’s her chance to find a confidante in her uncle. After a long day together, where they are closer than ever, Melanie gets a call from Ali saying there is a job going at the restaurant she works at, Beavers. Reluctantly, Melanie says yes and leaves Ray to start work as a roller skating waitress. It’s rock bottom for her, and later that night she leaves and wanders to ‘their spot’, on the harbour. Only to find Ray there, in a similar state of mind. This is the turning point for both of them. Melanie jumps into the harbour to challenge Ray’s fear of water. He jumps in after her and together they agree now is the time to stop looking back and start looking forward. Melanie goes home and packs her things – not a lot admittedly – while Ray attends to his own unfinished business. As Melanie takes the train out of town she looks out at the landscape speeding past, whilst a familiar figure walks through the carriage.",
  "synopsis": "Two lost souls. One last chance. Melanie's life in a seaside town is going nowhere until she meets Ray, back in town with a shady job to do. A moment's escape becomes a chance to save themselves, and each other. Everyone's Going To Die is a modern British story about coming home, getting by and the redemptive power of feeling you're not alone."
}