{
  "imdb_id": "tt2040367",
  "tmdb_id": "172785",
  "douban_id": null,
  "title": "Expecting (2013)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "87 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.1,
  "director": [
    {
      "id": "nm1394316",
      "name": "Jessie McCormack"
    }
  ],
  "writer": [
    {
      "id": "nm1394316",
      "name": "Jessie McCormack",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1157358",
      "name": "Michelle Monaghan",
      "character": "Andie"
    },
    {
      "id": "nm0593664",
      "name": "Radha Mitchell",
      "character": "Lizzie"
    },
    {
      "id": "nm0233481",
      "name": "Jon Dore",
      "character": "Peter"
    },
    {
      "id": "nm0922995",
      "name": "Michael Weston",
      "character": "Casey"
    },
    {
      "id": "nm0448252",
      "name": "Mimi Kennedy",
      "character": "Dr. Grayson"
    },
    {
      "id": "nm0017698",
      "name": "Sarah Aldrich",
      "character": "Nurse Butcher"
    },
    {
      "id": "nm1410077",
      "name": "Elizabeth Bond",
      "character": "Feather"
    },
    {
      "id": "nm1037729",
      "name": "Nuala Campbell",
      "character": "Newborn"
    },
    {
      "id": "nm0003740",
      "name": "Julie Dretzin",
      "character": "Mother"
    },
    {
      "id": "nm0333402",
      "name": "Susan Grace",
      "character": "Betty"
    },
    {
      "id": "nm2782098",
      "name": "Erin Hammond",
      "character": "Girl in clinic waiting room"
    },
    {
      "id": "nm4595304",
      "name": "Maximilian Lam",
      "character": "1 Year Old Gus"
    },
    {
      "id": "nm4534577",
      "name": "Randy Liedtke",
      "character": "Stoner Lou"
    },
    {
      "id": "nm3288699",
      "name": "Katharina Magdalena",
      "character": "Floozy Gloria"
    },
    {
      "id": "nm3247840",
      "name": "Ana Isabel Merez",
      "character": "Nurse       (as Ana Isabel Mercado)"
    },
    {
      "id": "nm1999504",
      "name": "Sydelle Noel",
      "character": "Jules"
    },
    {
      "id": "nm0665620",
      "name": "Alejandro Patiño",
      "character": "Handy Man       (as Alejandro Patino)"
    },
    {
      "id": "nm1733438",
      "name": "Lauren Schneider",
      "character": "Hot Girl"
    },
    {
      "id": "nm3961185",
      "name": "Andrew Shea",
      "character": "Justin"
    },
    {
      "id": "nm0884052",
      "name": "Antoinette Valente",
      "character": "Recovering Addict"
    },
    {
      "id": "nm0888327",
      "name": "Erik Van Wyck",
      "character": "Douchebag"
    },
    {
      "id": "nm3114820",
      "name": "Elisha Yaffe",
      "character": "Stoner Barry"
    }
  ],
  "overview": "Lizzie's best friend, Andie, becomes pregnant and offers to give the baby to her. Lizzie's husband, Peter, reluctantly goes along with being the child's father, and Andie moves into the guest room for the remainder of the pregnancy.",
  "storyline": "After years of struggling to conceive with her husband, Lizzie has given up hope of having a baby on her own. But when her best friend Andie finds herself pregnant after a one-night stand, an unexpected solution arises: Andie offers to have the baby and give it to Lizzie. The couple agrees to the plan, on one condition: Andie must move in with them for the duration of the pregnancy. But can the women's friendship survive until birth? Jessie McCormack's debut is a refreshingly candid comedy about planning ahead for life's unexpected detours.",
  "plot": "In 965 AD, Odin, king of Asgard, wages war against the Frost Giants of Jotunheim and their leader Laufey, to prevent them from conquering the nine realms, starting with Earth. The Asgardian warriors defeat the Frost Giants and seize the source of their power, the Casket of Ancient Winters.\n\nIn the present, Odin's son Thor prepares to ascend to the throne of Asgard, but is interrupted when Frost Giants attempt to retrieve the Casket. Against Odin's order, Thor travels to Jotunheim to confront Laufey, accompanied by his brother Loki, childhood friend Sif and the Warriors Three: Volstagg, Fandral, and Hogun. A battle ensues until Odin intervenes to save the Asgardians, destroying the fragile truce between the two races. For Thor's arrogance, Odin strips his son of his godly power and exiles him to Earth as a mortal, accompanied by his hammer Mjolnir, now protected by an enchantment that allows only the worthy to wield it.\n\nThor lands in New Mexico, where astrophysicist Dr. Jane Foster, her assistant Darcy Lewis, and mentor Dr. Erik Selvig, find him. The local populace finds Mjolnir, which S.H.I.E.L.D. agent Phil Coulson soon commandeers before forcibly acquiring Jane's data about the wormhole that delivered Thor to Earth. Thor, having discovered Mjolnir's nearby location, seeks to retrieve it from the facility that S.H.I.E.L.D. quickly constructed but he finds himself unable to lift it, and is captured. With Selvig's help, he is freed and resigns himself to exile on Earth as he develops a romance with Jane.\n\nLoki discovers that he is actually Laufey's son, adopted by Odin after the war ended. A weary Odin falls into the deep \"Odinsleep\" to recover his strength. Loki seizes the throne in Odin's stead and offers Laufey the chance to kill Odin and retrieve the Casket. Sif and the Warriors Three, unhappy with Loki's rule, attempt to return Thor from exile, convincing Heimdall, gatekeeper of the Bifröst—the means of traveling between worlds—to allow them passage to Earth. Aware of their plan, Loki sends the Destroyer, a seemingly indestructible automaton, to pursue them and kill Thor. The warriors find Thor, but the Destroyer attacks and defeats them, prompting Thor to offer himself instead. Struck by the Destroyer and near death, Thor's sacrifice proves him worthy to wield Mjolnir. The hammer returns to him, restoring his powers and enabling him to defeat the Destroyer. Kissing Jane goodbye and vowing to return, he and his fellow Asgardians leave to confront Loki.\n\nIn Asgard, Loki betrays and kills Laufey, revealing his true plan to use Laufey's attempt on Odin's life as an excuse to destroy Jotunheim with the Bifröst Bridge, thus proving himself worthy to his adoptive father. Thor arrives and fights Loki before destroying the Bifröst Bridge to stop Loki's plan, stranding himself in Asgard. Odin awakens and prevents the brothers from falling into the abyss created in the wake of the bridge's destruction, but Loki allows himself to fall when Odin rejects his pleas for approval. Thor makes amends with Odin, admitting he is not ready to be king; while on Earth, Jane and her team search for a way to open a portal to Asgard.\n\nIn a post-credits scene, Selvig has been taken to a S.H.I.E.L.D. facility, where Nick Fury opens a briefcase and asks him to study a mysterious cube-shaped object,[b] which Fury says may hold untold power. An invisible Loki prompts Selvig to agree, and he does.",
  "synopsis": null
}