{
  "imdb_id": "tt2088003",
  "tmdb_id": "230179",
  "douban_id": null,
  "title": "Big Game (2014)",
  "genres": [
    "Action",
    "Adventure"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    },
    {
      "runtime": "85 min",
      "description": "PG-13"
    }
  ],
  "imdb_rating": 5.4,
  "director": [
    {
      "id": "nm1118351",
      "name": "Jalmari Helander"
    }
  ],
  "writer": [
    {
      "id": "nm1118351",
      "name": "Jalmari Helander",
      "description": "screenplay"
    },
    {
      "id": "nm1118351",
      "name": "Jalmari Helander",
      "description": "based on the original story by and"
    },
    {
      "id": "nm0427058",
      "name": "Petri Jokiranta",
      "description": "based on the original story by"
    }
  ],
  "cast": [
    {
      "id": "nm0000168",
      "name": "Samuel L. Jackson",
      "character": "US President William Alan Moore"
    },
    {
      "id": "nm2762369",
      "name": "Onni Tommila",
      "character": "Oskari"
    },
    {
      "id": "nm0829032",
      "name": "Ray Stevenson",
      "character": "Morris"
    },
    {
      "id": "nm0001255",
      "name": "Victor Garber",
      "character": "Vice President"
    },
    {
      "id": "nm0476011",
      "name": "Mehmet Kurtulus",
      "character": "Hazar"
    },
    {
      "id": "nm0505971",
      "name": "Ted Levine",
      "character": "General Underwood"
    },
    {
      "id": "nm0866918",
      "name": "Jorma Tommila",
      "character": "Tapio"
    },
    {
      "id": "nm0758709",
      "name": "Risto Salmi",
      "character": "Hamara"
    },
    {
      "id": "nm0005031",
      "name": "Felicity Huffman",
      "character": "CIA Director"
    },
    {
      "id": "nm0000980",
      "name": "Jim Broadbent",
      "character": "Herbert"
    },
    {
      "id": "nm0433340",
      "name": "Rauno Juvonen",
      "character": "Safari Pilot"
    },
    {
      "id": "nm0124964",
      "name": "Jaymes Butler",
      "character": "Otis"
    },
    {
      "id": "nm1614722",
      "name": "Jason Steffan",
      "character": "Dexter /              Navy Seal 2"
    },
    {
      "id": "nm1350752",
      "name": "Jean-Luc Julien",
      "character": "Clay"
    },
    {
      "id": "nm1149902",
      "name": "Erik Markus Schuetz",
      "character": "Stanley"
    },
    {
      "id": "nm6533027",
      "name": "Moe Abbas",
      "character": "Arab Pilot"
    },
    {
      "id": "nm2092515",
      "name": "Adrian Can",
      "character": "Hazar's Cameraman"
    },
    {
      "id": "nm1581540",
      "name": "Philipp Rafferty",
      "character": "Air Force One Pilot"
    },
    {
      "id": "nm2781217",
      "name": "Gabriel Raab",
      "character": "Afo Analyst 1"
    },
    {
      "id": "nm4007946",
      "name": "Peter Nitzsche",
      "character": "Afo Analyst 2"
    },
    {
      "id": "nm3421825",
      "name": "Lincoln Potwin",
      "character": "Pentagon Analyst 1"
    },
    {
      "id": "nm1288233",
      "name": "Murali Perumal",
      "character": "Pentagon Analyst 2"
    },
    {
      "id": "nm0859104",
      "name": "Ken Thomas",
      "character": "Navy Seal 1"
    },
    {
      "id": "nm0936944",
      "name": "Jörg Witte",
      "character": "Farmer"
    }
  ],
  "overview": "When Air Force One is shot down by terrorists leaving the President of the United States stranded in the wilderness, there is only one person around who can save him - a 13-year old boy called Oskari. In the forest on a hunting mission to prove his maturity to his kinsfolk, Oskari had been planning to track down a deer, but instead discovers the most powerful man on the planet in an escape pod. With the terrorists closing in to capture their own \"Big Game\" prize, the unlikely duo must team up to escape their hunters. As anxious Pentagon officials observe the action via satellite feed, it is up to the President and his new side-kick to prove themselves and survive the most extraordinary 24 hours of their lives.",
  "storyline": "When Air Force One is shot down by terrorists leaving the President of the United States stranded in the wilderness, there is only one person around who can save him - a 13-year old boy called Oskari. In the forest on a hunting mission to prove his maturity to his kinsfolk, Oskari had been planning to track down a deer, but instead discovers the most powerful man on the planet in an escape pod. With the terrorists closing in to capture their own \"Big Game\" prize, the unlikely duo must team up to escape their hunters. As anxious Pentagon officials observe the action via satellite feed, it is up to the President and his new side-kick to prove themselves and survive the most extraordinary 24 hours of their lives.",
  "plot": "When Air Force One is shot down by terrorists leaving the President of the United States William Alan Moore stranded in the wilderness of finland, there is only one person around who can save him: a 13-year-old boy called Oskari. In the forest on a hunting mission to prove his maturity to his kinsfolk, Oskari had been planning to track down a deer, but instead discovers the most powerful man on the planet in an escape pod. With the terrorists closing in to capture their own \"Big Game\" prize while Pentagon officials watch on satellite broadcast—including the Vice President, the CIA director, and former CIA field operative Herbert, brought in as a consultant—the unlikely duo must team up to escape their hunters.\n\nAlready feeling at a disadvantage as a hunter due to his father's reputation—his father having hunted and defeated a bear on his own hunt—Oskari's faith in himself is further shattered when he follows a map his father left him only to find a portable refrigeration unit with a pre-killed deer head in it. Moore attempts to boost Oskari's confidence by reminding Oskari that he managed to save him, but they are subsequently confronted by Morris, the United States Secret Service member who orchestrated the attack from on board Air Force One—having become disillusioned with Moore as president after sustaining a bullet-wound that left a fragment of shrapnel near his heart—and Hazar, the mercenary who hired Morris to get Moore to him. Although Hazar decides to put Moore in the refrigeration unit and take him home to kill, Oskari regains his confidence and leaps onto the unit before it can be carried away, cutting it loose from the helicopter and hiding inside it as it rolls down a mountain to land in a river.\n\nDiscovering that the river leads to the lake where Air Force One crashed, Moore and Oskari swim inside the plane to wait for rescue, but are attacked by Hazar, who sets a time bomb, saying that he has new orders to kill the President now rather than torture him for later execution. Moore manages to grab a gun and shoot Hazar before he and Oskari escape Air Force One via the ejector seats, Oskari subsequently shooting Morris with an arrow as the ex-bodyguard leans out of a helicopter to shoot at them; while the arrow fails to penetrate the protective padding on Morris's chest, the shot is nonetheless fatal as it dislodges the shrapnel inside Morris so that it impales his heart. As Morris plummets, he reflexively fires his gun and the bullets tear into the helicopter, killing the pilot. The explosion of Air Force One destroys Morris's helicopter and sends Moore and Oskari flying all the way back to the camp where Oskari's village is waiting for him, arriving at the same time as the Navy SEAL team sent to search for Moore. With Moore acting as Oskari's 'prize', he assures Oskari's father that his son is the bravest man he has ever met, with Oskari subsequently receiving the Medal of Honor for saving Moore's life.\n\nBack at the Pentagon, the Vice President and Herbert reveal in a private discussion in a bathroom that Hazar was actually a CIA operative; the plan was that he would kill the President to inspire a new War on Terror, but with his survival Moore has instead become a hero. To ensure that nothing can be traced back to them, Herbert kills the Vice President by shoving him back against the sink, subsequently wiping the Vice President's shoe and the floor with soap to give the impression that he just slipped.",
  "synopsis": "The film opens with 13-year-old deer hunter, Oskari (Onni Tommila), and his dad, Tapio, looking at the wall full of picture frames of a man as a deer hunter. Oskari picks one of the picture frames, that is his dad as a hunter when he was teenager.Somewhere in Finland, the Kimmo's Safari's helicopter carrying the terrorist named Hazar. After they land the helicopter, the Kimmo's Safari's helicopter pilot realized that the men he carrying are the terrorists. Hazar told the helicopter pilot to run for his lives. However when the helicopter pilot is in about one mile distance, Hazar fires bazooka to him as a missile test. Hazar sends his fellow terrorist a text message that the missile test was successful.In the mountains, Oskari takes a test of strength of pulling of a bow string (without an arrow), however, he failed to reach its full strength. The leader of the deer hunting says that he will not ready to be a deer hunter but his father asserts that his son is ready to be a hunter. The leader addresses to his men about his bravery of being a hunter and inside the forest. Oskari drives his small tractor through the woods for hunting.Meanwhile, aboard in the Air Force One, U.S. President William Alan \"Bill\" Moore (Samuel L. Jackson) is heading for Pre D8 Summit is Helsinki, 45 miles left. Suddenly, the control room receives an alert of a possible missile shot down in their plane. However, both plane and jet escorts were unable to countermeasures because someone's jamming their control. The men quickly brought the President to an escape pod and it deploys out safely. The rest of the service agents are parachuting down from the plane but Morris (Ray Stevenson) shoots a secret agent after curiously asked that there is something wrong to them - their parachute not deploying. Few minutes after Morris parachuting down, the missiles fly past to him and hit the Air Force One.Oskari is driving his small tractor in the woods when he sees the bright light flashes in the sky. In horror, Oskari quickly runs away from the bright light which is actually the downed Air Force One is on fire. Its debris almost struck Oskari.Morris was landed into the woods, turns out to be traitor, he alerts the terrorist that the plane was down. Oskari then sees a pod and suspiciously approaches to it. Upon approaching, Bill writes the combination (which is \"1492\" ) - for opening the door - in the moisturized window. After Oskari enters the combination, he quickly runs away from it, believing that the pod was came from other planet. Bill goes out and yells to show himself. Oskari shows himself and suspiciously aims his bow to Bill. When Bill tells him that he is the President of the United States, Oskari proves him by showing his passport. Oskari now trusts him.Meanwhile, in the farmhouse somewhere in Norway, a farmer sees the beacon landed outside his house. Shortly, the helicopters arrive but when they searched it, it is not escape pod. The escape pod and the beacon must been separated.Morris, Hazar and his men found the escape pod. As Hazar opens it, they find empty. Bill wants to go to the nearest town using his small tractor but Oskari not allows Bill to drive himself in. Instead, Oskari drives and tells him to sit in the wagon while they heading to the place that is marked by X on his map. Morris sees the small shoe footprint, stating that someone helped the President out. Morris also tells Hazar that the bullet was buried 2mm from his heart (as we see his scar in the chest in the beginning of the film) and if something hits it, it will kill him.Bill and Oskari arrives in the place and he calls it, \"a perfect place to hunt\". They will camp here all night until morning and they chat each other. The next morning, it's Oskari's birthday and time for him to hunt. Bill suddenly wakes up when he hears Oskari imitating deer sounds. Oskari sees a shoe that is belong to Bill (the shoe was fell after the AF1 was shot down). Oskari then sees a freezer and when he opens it, inside is the dead deer and the note embedded in the arrow. The note says happy birthday from his dad. Upon Bill climbing through rocks, he sees his three dead men, turns out the cable ties preventing the parachute from deploying. Bill now realizes that Morris betrayed him. After he retrieved the gun from a dead man, Bill sees Morris and his men and he hides behind the rock.Oskari is disappointed when his father killed the deer for him as birthday. Oskari told Bill that he is not ready to be a hunter. Bill then puts a badge onto Oskari for rescuing and protecting him, and it's a reminder for him. Bill realizes that his plane is not an accident, it is shot down and Morris and his men are there for hunting him. In case he is being hunted, he told Oskari to go in separate ways but Oskari worries about his safety. Shortly, Morris approaches upon them. Bill decides Oskari to go away for lives. Bill tries to shoot Morris but he forgot to cock the gun. Morris manage to fight Bill.Meanwhile, in the Pentagon Headquarters, they find the President and the terrorists who known by one of the President Secret Service Agent, Herbert (Jim Broadbent). All throughout, they're being tracked for their safety.The men forces Bill to get in the freezer. However, Oskari oversees them and the President being put in the freezer. The freezer was carried by the helicopter. Oskari manages to save the president. Oskari jumps off the cliff and stows away to the freezer. A pilot sees stowaway boy in the freezer, trying to save the President. The helicopter descends its altitude to get the boy away from it. Oskari loses the freezer but manage to chase and he cut the rope, allowing it to escape. Morris, in the helicopter, shoots them and Oskari quickly gets in to the freezer. The lid of the freezer protecting them from raining bullets. Oskari decides to roll down the freezer into the cliff just moments after Morris gets on the ground. They ended up in the middle of the lake.Both Bill and Oskari think that they lost them. Shortly, they found the wreck site of Air Force One near them. In the Pentagon, they found the AF1 crash site. Herbert gives the coordinates of the crash site to Hazar and gives a plan to him to kill the President.Bill and Oskari sees the helicopter approaching upon them and they manage to enter the wrecked plane. The plane inside is almost quite intact (the lights are still on and some computers in the control room are still on also). Afterwards, they hear pounding and creaking sound coming from the roof. Suddenly the explosive blown to the roof, allowing Hazar to infiltrate the plane. Hazar then activates a bomb to six minutes left. The fight progress between Bill and Hazar. Hazar manage to strangle Bill to death but Oskari pounds Hazar in the head. Hazar then tries to shoot Oskari using the same gun (that Bill uses and forgot to cock), but also he forgot to cock it. Bill kicks him, throwing a gun onto Bill, this time allowing him to shoot Hazar. Almost 90 seconds left in the bomb, Bill and Oskari manage to escape from the plane through ejecting in the pilot's seat. As they deployed the parachute in their seats, Morris - in the helicopter - is in front of them. Oskari then fires an arrow and hits his chest. The arrow pulls the bullet - buried inside his chest - into his heart, Morris fall to his death and accidentally fires a gun onto the pilot. Shortly, the bomb goes off.Meanwhile at the same time in deer hunters' camp, the US Navy forces the hunters to held hostage until the President reportedly alive. Afterwards, they sees the parachute landing in the background. It is Oskari followed by Bill climbing at the top of the rock. Oskari introduces the President to his dad and the rest of the hunters recognize the President is in the newspaper.In the Pentagon, all of the employees rejoicing the President's salvation. Herbert reveals that Hazar knew him for 15 years and he is a former CIA operative. In order to not to trace back with him, Herbert kills the vice-president by shoving him in the feet. But before he leaves the restroom, Herbert puts some liquid soap in his shoe and in the floor to give the impression that the vice-president was slipped on the floor.The film ends with the hunting leader takes a picture of Oskari and Bill. Oskari's hero of saving the President become known in the press. The newspaper article of Oskari saved the president are putted in the picture frame in their house."
}