{
  "imdb_id": "tt2058710",
  "tmdb_id": "139367",
  "douban_id": null,
  "title": "The Mark (2012)",
  "genres": [
    "Action",
    "Fantasy",
    "Sci-Fi",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.8,
  "director": [
    {
      "id": "nm0151895",
      "name": "James Chankin"
    }
  ],
  "writer": [
    {
      "id": "nm3850078",
      "name": "Paul Duran",
      "description": null
    },
    {
      "id": "nm1837630",
      "name": "Leland Jourdan",
      "description": null
    },
    {
      "id": "nm1146036",
      "name": "John Patus",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0001729",
      "name": "Craig Sheffer",
      "character": "Chad Turner"
    },
    {
      "id": "nm1513736",
      "name": "Sonia Couling",
      "character": "Dao"
    },
    {
      "id": "nm0000616",
      "name": "Eric Roberts",
      "character": "Cooper"
    },
    {
      "id": "nm0199939",
      "name": "Gary Daniels",
      "character": "Joseph Pike"
    },
    {
      "id": "nm0436442",
      "name": "Iván Kamarás",
      "character": "Phyllip Turk"
    },
    {
      "id": "nm0778931",
      "name": "Carey Scott",
      "character": "Ted, Co-Pilot"
    },
    {
      "id": "nm2441623",
      "name": "David Cuddy",
      "character": "Gregory, Captain"
    },
    {
      "id": "nm0151895",
      "name": "James Chankin",
      "character": "Jeremy Turner"
    },
    {
      "id": "nm3057362",
      "name": "Charlie Ruedpokanon",
      "character": "Jiri"
    },
    {
      "id": "nm1927199",
      "name": "Gigi Velicitat",
      "character": "Graham"
    },
    {
      "id": "nm0810653",
      "name": "Ron Smoorenburg",
      "character": "Arlo"
    },
    {
      "id": "nm3137542",
      "name": "Byron Gibson",
      "character": "Jensen"
    },
    {
      "id": "nm0212639",
      "name": "Sarah Deakins",
      "character": "Jodi"
    },
    {
      "id": "nm0546460",
      "name": "John Marengo",
      "character": "Donny"
    },
    {
      "id": "nm4221489",
      "name": "Bruce Blain",
      "character": "Air Marshal       (as Bruce Blian)"
    },
    {
      "id": "nm4702693",
      "name": "Celicia Arnold",
      "character": "Jennifer"
    },
    {
      "id": "nm2886780",
      "name": "Art Supawatt Purdy",
      "character": "Jock"
    },
    {
      "id": "nm3608445",
      "name": "Al Harlow",
      "character": "Older passenger       (as Big Al)"
    },
    {
      "id": "nm4334336",
      "name": "Chanicha Shindejanichakul",
      "character": "Woman Passenger"
    },
    {
      "id": "nm4771950",
      "name": "Jennifer Claesson",
      "character": "Stewardess 1"
    },
    {
      "id": "nm4757991",
      "name": "Paul-Dominique Win Vacharasinthu",
      "character": "Avanti Executive       (as Paul Dominique Vacharasinthu)"
    },
    {
      "id": "nm3066531",
      "name": "Leigh Barwell",
      "character": "Jennifer's Double"
    },
    {
      "id": "nm1403734",
      "name": "Ilka Urbach",
      "character": "German President"
    }
  ],
  "overview": "Chad Turner (Craig Sheffer) has been implanted with a the only working biometric computer chip (aka The Mark of the Beast) in the world. The chip has the power to change the world with whoever controls it and Joseph Pike (Gary Daniels) is determined acquire the chip even in the face of the most unforeseen event \"The Rapture\". Pike has taken hostage Mr.Cooper (Eric Roberts) the head of security of Avanti the chip maker in order to help locate Turner and deliver the chip to his boss. Amongst the chaos Chad Turner must beat all odds to stay alive and keep the chip from falling into the wrong hands",
  "storyline": "Chad Turner (Craig Sheffer) has been implanted with the only working biometric computer chip (aka The Mark of the Beast) in the world. The chip has the power to change the world with whoever controls it and Joseph Pike (Gary Daniels) is determined acquire the chip even in the face of the most unforeseen event \"The Rapture\". Pike has taken hostage Mr.Cooper (Eric Roberts) the head of security of Avanti the chip maker in order to help locate Turner and deliver the chip to his boss. Amongst the chaos Chad Turner must beat all odds to stay alive and keep the chip from falling into the wrong hands.",
  "plot": "In Medieval Scotland, Merida, a young princess of the clan Dunbroch, is given a bow and arrows by her father, King Fergus, for her birthday. Her mother, Queen Elinor, is dismayed. While venturing into the woods to fetch a stray arrow, Merida encounters a will-o'-the-wisp. Soon afterward, Mor'du, a huge demon bear, attacks the family. Merida flees on horseback with Elinor, while Fergus fights off Mor'du and loses his leg.\n\nNow a teenager, Merida discovers that to her dismay, she is to be betrothed to the son of one of her father's allies. Reminding Merida of a legend of a prince whose pride and refusal to follow his father's wishes destroyed his kingdom, Elinor explains to her that failure to consent to the betrothal could harm Dunbroch.\n\nThe allied clan chieftains arrive with their first-born sons to compete in the Highland games for Merida's hand in marriage. Merida twists the rules, announcing that she is eligible to compete for her own hand as the first-born of Clan Dunbroch. She defeats each of her suitors in an archery contest, shaming the other clans and leading to an argument with Elinor. When Merida leaves, she follows the wisps to the hut of an elderly witch. Merida bargains with the witch and receives an enchanted cake that will change her fate.\n\nWhen Merida gives the cake to Elinor, it causes Elinor to transform into a bear. Merida returns to the witch's cottage with Elinor, who still retains most of her human personality. The witch has abandoned the cottage but left a message: unless Merida is able to \"mend the bond torn by pride\" before the second sunrise, the spell will become permanent. Merida and Elinor are led by the wisps to ancient ruins, where they encounter Mor'du. Realizing that Mor'du was the transformed prince in the legend, Merida vows to her mother that she will not let her become a wild animal like Mor'du. She believes that she can reverse the spell by repairing a tapestry she damaged during their argument.\n\nThe clans are on the verge of war. Having learned the importance of responsibility from her experience with her mother, Merida intends to declare herself ready to choose a suitor as tradition demands. However, with silent encouragement from Elinor, she instead insists that the first-born should be allowed to marry in their own time to whomever they choose. The clans agree, breaking tradition but renewing and strengthening their alliance. Merida sneaks into the tapestry room with Elinor. Elinor, who is losing her humanity, attacks Fergus, but suddenly regains her composure and flees the castle. Mistaking the queen for Mor'du, Fergus pursues the bear with the other clans. With the help of her younger triplet brothers, who have been transformed by the enchanted cake into bear cubs, Merida repairs the torn tapestry while riding after her father. The clans and Fergus capture Elinor, but Merida intervenes before Mor'du attacks. Mor'du scatters the clan warriors and targets Merida. Elinor intercedes, using her bear strength to hold off Mor'du until he is crushed by a falling menhir. This releases the spirit of the prince, who silently thanks Merida for freeing him. As the sun rises for the second time, Merida realizes the mistakes she has made and reconciles with Elinor, causing the queen and the triplets to turn back into humans.\n\nWith Mor'du gone, Merida and Elinor work together on a new tapestry when they are called to the docks to bid farewell to the other clans.",
  "synopsis": null
}