{
  "imdb_id": "tt2093270",
  "tmdb_id": "227094",
  "douban_id": null,
  "title": "The Returned (2013)",
  "genres": [
    "Crime",
    "Drama",
    "Horror",
    "Sci-Fi",
    "Thriller"
  ],
  "country": "Spain",
  "version": [
    {
      "runtime": "98 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.9,
  "director": [
    {
      "id": "nm1298542",
      "name": "Manuel Carballo"
    }
  ],
  "writer": [
    {
      "id": "nm1523747",
      "name": "Hatem Khraiche",
      "description": "story"
    },
    {
      "id": "nm1523747",
      "name": "Hatem Khraiche",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0358922",
      "name": "Emily Hampshire",
      "character": "Kate"
    },
    {
      "id": "nm0390285",
      "name": "Kris Holden-Ried",
      "character": "Alex Green"
    },
    {
      "id": "nm0236495",
      "name": "Shawn Doyle",
      "character": "Jacob"
    },
    {
      "id": "nm2218213",
      "name": "Claudia Bassols",
      "character": "Amber"
    },
    {
      "id": "nm3172796",
      "name": "Melina Matthews",
      "character": "Eve"
    },
    {
      "id": "nm0281284",
      "name": "Barry Flatman",
      "character": "Dave"
    },
    {
      "id": "nm1583978",
      "name": "Olunike Adeliyi",
      "character": "Return Unit Nurse       (as Oluniké Adeliyi)"
    },
    {
      "id": "nm1733521",
      "name": "Steven Gallagher",
      "character": "Security Guard"
    },
    {
      "id": "nm5122763",
      "name": "Josh Pattynama",
      "character": "Infected Boy"
    },
    {
      "id": "nm0866971",
      "name": "David Tompa",
      "character": "Father"
    },
    {
      "id": "nm0265217",
      "name": "Megan Fahlenbock",
      "character": "Mother"
    },
    {
      "id": "nm0893875",
      "name": "Bruno Verdoni",
      "character": "Investigating Officer"
    },
    {
      "id": "nm0015468",
      "name": "Rhea Akler",
      "character": "Kate's Mother"
    },
    {
      "id": "nm1062794",
      "name": "Leo Petrus",
      "character": "Man in Conference Room"
    },
    {
      "id": "nm1457826",
      "name": "Paul Anthony",
      "character": "Government Spokesperson"
    },
    {
      "id": "nm5398351",
      "name": "Romy Weltman",
      "character": "Young Kate"
    },
    {
      "id": "nm0482126",
      "name": "Bill Lake",
      "character": "The General"
    },
    {
      "id": "nm4238314",
      "name": "Mark Carins",
      "character": "Shopkeeper"
    },
    {
      "id": "nm2433722",
      "name": "Stephen Chambers",
      "character": "Anti-Returned Activist"
    },
    {
      "id": "nm0738929",
      "name": "Mario Romano",
      "character": "Gas Station Owner"
    },
    {
      "id": "nm3105117",
      "name": "Brian Christopher",
      "character": "Gas Station Attendant       (as Brian Mifsud)"
    },
    {
      "id": "nm3577098",
      "name": "Emily Alatalo",
      "character": "TV Reporter"
    },
    {
      "id": "nm8095169",
      "name": "Claudia Ferreira",
      "character": "Roadside Medical Centre Girl"
    },
    {
      "id": "nm5561641",
      "name": "Patricia Tedford",
      "character": "Newscaster"
    },
    {
      "id": "nm3421074",
      "name": "Mark Roeder",
      "character": "Music Student"
    },
    {
      "id": "nm2109985",
      "name": "Lewis Hodgson",
      "character": "Military Doctor"
    },
    {
      "id": "nm0788141",
      "name": "Roger Shank",
      "character": "TV Presenter"
    },
    {
      "id": "nm0235928",
      "name": "Wayne Downer",
      "character": "Hooded Man #1"
    },
    {
      "id": "nm1002936",
      "name": "Joseph Wynne",
      "character": "Hooded Man #2       (as Joe Wynne)"
    },
    {
      "id": "nm1740973",
      "name": "Jonathan Lewis",
      "character": "Country House Zombie"
    },
    {
      "id": "nm1606153",
      "name": "Andy Boorman",
      "character": "Detective Anderson"
    },
    {
      "id": "nm0637992",
      "name": "Paulino Nunes",
      "character": "Detective Cawl"
    },
    {
      "id": "nm0346240",
      "name": "Phil Guerrero",
      "character": "Lee Fung"
    },
    {
      "id": "nm1610557",
      "name": "Scott McCrickard",
      "character": "Hardware Store Helper"
    },
    {
      "id": "nm3365695",
      "name": "Andy Hull",
      "character": "Mover"
    },
    {
      "id": "nm1725936",
      "name": "Mark Fraser",
      "character": "Moving Company Boss"
    },
    {
      "id": "nm3794912",
      "name": "Garrett M. Ryan",
      "character": "Slingshot Boy       (as Garrett Ryan)"
    }
  ],
  "overview": "In a post-zombie world, where the infected live normal lives, their retroviral drug is running out.",
  "storyline": "In a world where a deadly zombie virus has infected mankind, a single cure has been found. The cure, a treatment called the \"Return Protein\" which stays the effects of the virus in its host. With injections every 36 hours, the \"Returned\" are able to live as though they were never bit, despite the virus still coursing through their veins. When it is discovered that the protein stock is running low, chaos hits the streets. Returned who run out of the protein turn to zombies and wreak havoc, protesters turn to murderers as they try to rid the streets of the returned, and right in the middle of it all are Alex and Kate. Kate a leading doctor in the field of zombie virus' and Alex a musician with a dark secret, he is a Returned. As death and fear run rampant, Alex's secret becomes known and his dosage runs low, he and Kate must fight for a chance to live before he becomes a zombie.",
  "plot": "In 2077, following a war with extraterrestrials that devastated Earth, humanity has relocated to Saturn's moon Titan via a giant space station called the Tet. Gigantic offshore fusion energy generators drain Earth's oceans to power the colonies on Titan.\n\nLed by mission controller Sally (Melissa Leo) and guided by his housemate and communications partner Victoria \"Vika\" Olsen (Andrea Riseborough), \"Tech-49\" Jack Harper (Tom Cruise) regularly leaves his tower post to repair downed combat drones that guard the regions and generators against the alien scavengers or \"scavs.\" Although his memory has been wiped, he has had recurring dreams and visions of being on the observation deck of the Empire State Building with a dark-haired woman. He also collects the occasional artifact he finds from humanity's past. Vika is concerned about Jack's curiosity, questioning whether they are still “an effective team,” and encouraging him to do his job so they can join the others on Titan soon.\n\nAfter scavs destroy a generator, Jack discovers the scavs have been using the Empire State Building's antenna to transmit coordinates to outer space. While taking a break at his secret lake house retreat, he spots a crash-landing module of a pre-war spacecraft called the Odyssey. Thinking the ship contains aliens, he investigates, only to find humans in stasis chambers. One of the humans is the woman from his dreams. Jack protects her chamber from a drone that destroys the others, and later revives the woman, Julia Rusakova (Olga Kurylenko), who makes Vika instinctively jealous. Jack and Julia return to recover her flight recorder but are captured by the scavs, who are revealed to be human survivors.\n\nTheir leader, Malcolm Beech (Morgan Freeman), wants Jack to reprogram their captured drone to carry nuclear fuel cells to blow up the Tet; he has sensed Jack is different because the latter's hobby of collecting relics. Although Jack refuses, Beech releases them to seek the truth beyond the boundaries of the forbidden radiation zone. When they reach the Empire State Building, Julia reveals that she is his wife. Jack then remembers that he proposed to her there. Julia recalls she was on a mission to Titan when they were diverted to investigate an alien presence.\n\nWhen the two return to Jack's tower, Vika refuses them entry and reports her findings to Sally, saying they are \"no longer an effective team.\" Sally acknowledges this, but activates a drone that kills Vika before Julia shoots it down. Jack and Julia escape in his ship, but are shot down by other pursuing drones. The two eject into the radiation zone, which turns out to not be radioactive. Jack discovers another ship with a technician trying to fix a downed drone, and is shocked to see that the tech is a clone of himself who goes by \"Tech-52\". The clone also is shocked to see Julia. Jack fights and incapacitates his clone, but Julia is accidentally shot. After flying to Tech-52's tower, and discovering an inquisitive Vika clone, he returns to treat Julia at the lake house.\n\nAt the scav base, Beech reveals to Jack and Julia that the Tet was the hostile alien force that destroyed the Moon and invaded Earth with thousands of Jack clones and drones to wipe out the people. As Jack repairs the captured drone, the base is attacked by other drones, gravely injuring Beech and ruining the captured drone except for its fuel cells. Jack agrees to deliver Julia to Sally through the stasis chamber. On the way to the Tet, Jack listens to the Odyssey's flight recorder, and learns that he was the mission commander, Vika was his co-pilot, and Sally was their mission controller from Earth. When the Tet started to draw in their ship, Jack jettisoned the pod of stasis chambers containing the crew members (including Julia) leaving himself and Vika to be captured.\n\nBack in the present, Jack enters a large room full of capsules of Jack and Vika clones. He shows Tet the stasis chamber, but it carries Beech and the fuel cells, which they then detonate. On Earth, Julia awakens at the lake house. Years later, she and her daughter meet the resistance members and \"Tech-52\" Jack, who has also recovered his memories.",
  "synopsis": null
}