{
  "imdb_id": "tt2062966",
  "tmdb_id": "130677",
  "douban_id": null,
  "title": "King Kelly (2012)",
  "genres": [
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.1,
  "director": [
    {
      "id": "nm0624157",
      "name": "Andrew Neel"
    }
  ],
  "writer": [
    {
      "id": "nm0624157",
      "name": "Andrew Neel",
      "description": "story"
    },
    {
      "id": "nm4679434",
      "name": "Mike Roberts",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm2106801",
      "name": "Louisa Krause",
      "character": "Kelly"
    },
    {
      "id": "nm3288486",
      "name": "Libby Woodbridge",
      "character": "Jordan"
    },
    {
      "id": "nm1745236",
      "name": "Roderick Hill",
      "character": "Poo Bare"
    },
    {
      "id": "nm2939030",
      "name": "Will Brill",
      "character": "Ryan"
    },
    {
      "id": "nm3314975",
      "name": "Jon Orsini",
      "character": "Matt       (as Jonny Orsini)"
    },
    {
      "id": "nm2055501",
      "name": "Joey Auzenne",
      "character": "Drug Dealer"
    },
    {
      "id": "nm3925911",
      "name": "Aaron Cassara",
      "character": "Tom"
    },
    {
      "id": "nm1101381",
      "name": "Ash Christian",
      "character": "Dean"
    },
    {
      "id": "nm2943622",
      "name": "Beth Dzuricky",
      "character": "Mom"
    },
    {
      "id": "nm0247825",
      "name": "Ian Eaton",
      "character": "Man on Street #2"
    },
    {
      "id": "nm0267009",
      "name": "Ramsey Faragallah",
      "character": "Liquor Store Clerk"
    },
    {
      "id": "nm1788818",
      "name": "Anthony Fazio",
      "character": "Blake"
    },
    {
      "id": "nm4744331",
      "name": "Peter Ferguson",
      "character": "Blow-Job Guy"
    },
    {
      "id": "nm3925887",
      "name": "Emily Fleischer",
      "character": "Girl at Fire"
    },
    {
      "id": "nm2731471",
      "name": "Betina Joly",
      "character": "Party Girl"
    },
    {
      "id": "nm0443244",
      "name": "Michael Kaycheck",
      "character": "Commanding Officer"
    },
    {
      "id": "nm3960456",
      "name": "Orien Longo",
      "character": "Guy on Stairs"
    },
    {
      "id": "nm5122676",
      "name": "Anthony Lumia",
      "character": "Timmy"
    },
    {
      "id": "nm1958464",
      "name": "Diana Masi",
      "character": "Donna"
    },
    {
      "id": "nm3199227",
      "name": "Andrew Mer",
      "character": "Dad"
    },
    {
      "id": "nm2727142",
      "name": "Patrick Murney",
      "character": "Chad"
    },
    {
      "id": "nm4348407",
      "name": "John F. O'Donnell",
      "character": "Jimbo"
    },
    {
      "id": "nm3047181",
      "name": "Jen Ponton",
      "character": "Angela"
    },
    {
      "id": "nm3753746",
      "name": "Joseph Reiver",
      "character": "Troy"
    },
    {
      "id": "nm1759519",
      "name": "Dion Sapp",
      "character": "Man on Street #1"
    },
    {
      "id": "nm4381084",
      "name": "Micah Stock",
      "character": "Josh"
    }
  ],
  "overview": "Kelly strips – her best friend Jordan captures the event on her mobile phone. Kelly’s name is well known among the visitors of (in)appropriate online portals. The two teenagers digitally record anything and everything that crosses their paths and upload the results to the internet. But, today is not their day: Kelly’s ex-boyfriend has taken her car containing a package she was not to lose under any circumstances. While searching for it, the two set off on a peculiar journey through a night peppered with drugs, sex, corrupt police officers and other catastrophes – and always with their trusty mobiles in hand.  Made entirely using mobile phone cameras, KING KELLY is a satirical journey through the boundless narcissism of the YouTube generation.",
  "storyline": "King Kelly is the online username of Kelly, a young girl from Long Island, NY who dreams of becoming famous through her webcam strip tease show. Obsessed with the prospect of celebrity, Kelly stops at nothing to get what she wants.",
  "plot": "King Kelly is a teenage webcam porn performer, reveling in the attention and tips from her assorted admirers. Away from the webcam, she films herself constantly with her cellphone's camera, while also being paid to transport drugs around Long Island. On July 4, also her father's birthday, Kelly's ex-boyfriend Ryan takes back the car he paid for, which unfortunately for Kelly still has a package of drugs in the trunk that she was supposed to deliver. After a failed attempt with her friend Jordan to get the car back, Kelly attends the family birthday party, fights with her aunt, and huffs off on foot. Kelly and Jordan go to a friend's party, where Kelly flirts with Jordan's boyfriend, and learns from her drug contact that if she doesn't recover the drugs – which are not pills as she believed, but $20K of heroin – then the owner of said drugs will kill her.\n\nKelly manages to patch her relationship with Jordan, and they drive off in Jordan's father's SUV to find Ryan, who they learn drove the car to a club on Staten Island. Both girls are high on ADHD pills and cocaine, and crash the SUV into a tree. Desperate, Kelly contacts her biggest fan, \"Poo Bare\", a state trooper. Poo Bare helps them find the car, but the drugs are not there; he now demands that she sleep with him in return for his forcing Ryan to take them to the missing package. After some more misadventures, they recover the heroin from Ryan's dad's garage.\n\nNow very early on July 5, the group goes to a motel. Poo Bare puts both Ryan and the cocaine-addled Jordan in the bathroom – with Ryan handcuffed to the toilet – and he and Kelly proceed to strip and have sex, with Kelly filming them the whole time. Ryan convinces Jordan to get the handcuff keys from Poo Bare's belt; freeing himself, he then shoots Poo Bare in the back with the trooper's gun, then runs outside. Kelly leaves Poo Bare, ordering him to never tell anyone what happened, and with Jordan attempts to chase down Ryan. When they lose him, Jordan runs from the car screaming, but forgets her phone. Kelly discovers that Jordan posted a video of Kelly from early in the film, and the comments on it are less than complimentary. Apparently hurt emotionally, Kelly binges on a pile of cheeseburgers.",
  "synopsis": "King Kelly is an aspiring internet star who performs webcam stripteases. When Kelly's car - filled with illegal narcotics that she must deliver - is stolen by her bitter ex-boyfriend on the 4th of July, Kelly and her best friend Jordan embark on an epic whirlwind of drugs, sex, violence and mischief-making as Kelly tries to reclaim what's hers. Kelly's biggest online fan, a wayward State Trooper, joins the journey as the night spirals into chaos. Made entirely from camera-phone footage, King Kelly is a sensational journey through hedonistic American youth culture and the YouTube generation."
}