{
  "imdb_id": "tt2076213",
  "tmdb_id": "202536",
  "douban_id": null,
  "title": "Hameno Koritsi (2012)",
  "genres": [
    "Short",
    "Drama",
    "Horror"
  ],
  "country": "Greece",
  "version": [
    {
      "runtime": "34 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm3039976",
      "name": "Nikos Pastras"
    }
  ],
  "writer": [
    {
      "id": "nm3039976",
      "name": "Nikos Pastras",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm3219480",
      "name": "Katia Goulioni",
      "character": "Margarita"
    },
    {
      "id": "nm2791558",
      "name": "Kora Karvouni",
      "character": "Margarita"
    },
    {
      "id": "nm3125258",
      "name": "Maria Eglezaki",
      "character": "Margarita"
    },
    {
      "id": "nm3252053",
      "name": "Athina Kotsianouli",
      "character": "Margarita"
    },
    {
      "id": "nm3162420",
      "name": "Nefeli Kouri",
      "character": "Margarita"
    },
    {
      "id": "nm0885091",
      "name": "Michele Valley",
      "character": "TV hostess"
    },
    {
      "id": "nm3039750",
      "name": "Prodromos Tsinikoris",
      "character": "Yannis"
    },
    {
      "id": "nm3316749",
      "name": "Stathis Stamoulakatos",
      "character": "Man #1"
    },
    {
      "id": "nm2290177",
      "name": "Stathis Kokkoris",
      "character": "Rapist"
    },
    {
      "id": "nm3191481",
      "name": "Dimitris Bitos",
      "character": "Man #2"
    },
    {
      "id": "nm0463709",
      "name": "Yannis Kokiasmenos",
      "character": "Hypnotist"
    },
    {
      "id": "nm1163455",
      "name": "Fokion Bogris",
      "character": "Man at party #6       (as Fokionas Bogris)"
    },
    {
      "id": "nm1029210",
      "name": "Yannis Economides",
      "character": "Man at party #7"
    },
    {
      "id": "nm4091941",
      "name": "Stergios Paschos",
      "character": "Man at party #9"
    }
  ],
  "overview": "A short story about a great intrusion and an irreversible loss. Do you even know who you are? How often do you change your mind? How much can you trust what you think you know? Caught between memory and nightmare, Margarita is trying to shut the door.",
  "storyline": "A short story about a great intrusion and an irreversible loss. Do you even know who you are? How often do you change your mind? How much can you trust what you think you know? Caught between memory and nightmare, Margarita is trying to shut the door on her past.",
  "plot": "Michael \"Mike\" Wazowski, a young monster, gets inspired to become a scarer (a monster who enters the human world at night to scare children and harvest their screams for energy) when he grows up after visiting Monsters Inc., Monstropolis' most profitable scaring company, on a school field trip. Eleven years later, Mike is a first-year scare major at Monsters University, where he meets fellow monster James P. \"Sulley\" Sullivan. Mike studies hard, while the privileged Sulley, coming from a family of talented scarers, relies only on his natural ability and begins to falter. As the semester progresses, Mike and Sulley attempt to join a fraternity, but only Sulley is accepted into Roar Omega Roar, the strongest fraternity on campus. At the semester's final exam, a fight between the two causes them to accidentally break Dean Abigail Hardscrabble's cherished Scream Can. Hardscrabble promptly fails both of them immediately, stating that Sulley does not study enough, and Mike is not scary enough.\n\nWanting to prove himself, Mike enters the university's \"Scare Games\" and makes a wager with Hardscrabble to reinstate him and his team to the scare program if they win, but Mike must leave the university if they lose. He joins a group of misfits named Oozma Kappa, the weakest fraternity on campus, but they are denied entry to the Games for being one team member short. Sulley subsequently joins them, seeing the competition as his ticket back into the scare program. Oozma Kappa finish last in the first challenge, but are saved from elimination after another team is disqualified for cheating. Oozma Kappa subsequently improve gradually due to Mike's training and intricate knowledge of scaring, and they advance through each following challenge, finishing just behind competition favourites Roar Omega Roar. In the final round, they defeat Roar Omega Roar with a decisive final scare by Mike in the simulation bedroom. However, Mike soon discovers that he only won because Sulley changed the machine's difficulty to a much easier setting.\n\nDetermined to prove he can become a scarer, Mike breaks into the school's door lab and enters a door to the human world leading to a summer camp, but he is unable to scare a cabin full of children and runs off into the woods. Meanwhile, Roar Omega Roar offers to reinstate Sulley, but he refuses, instead confessing to Hardscrabble that he cheated, just as she is alerted to Mike's break-in. Realizing what happened, Sulley defies Hardscrabble and enters the same door to find Mike. After reconciling, they try to return, but are unable to exit after Hardscrabble deactivates the door while waiting for the authorities to arrive. Pursued by camp rangers, Mike realizes that the only way to escape is to generate enough scream energy to power the door from their side. Working together, Sulley and Mike terrify the camp rangers and generate an overwhelming amount of scream energy to return to the lab seconds before the device overloads and explodes in front of Hardscrabble.\n\nMike and Sulley are led away by the CDA and are expelled from the university as a result of their actions, but the other members of Oozma Kappa are accepted into the scare program the next semester, as Hardscrabble was impressed by their performances in the scare games. As Mike leaves on the bus, Sulley runs after him to raise his spirits. Hardscrabble then appears and wishes the two luck, claiming they were the first students to have surprised her. The two take jobs in the mail room of Monsters, Inc., eventually working their way up to join the Scarer Team and setting the events of Monsters, Inc. in motion.",
  "synopsis": null
}