{
  "imdb_id": "tt2071441",
  "tmdb_id": "121602",
  "douban_id": null,
  "title": "Dangerous Liaisons (2012)",
  "genres": [
    "Drama",
    "Mystery",
    "Romance"
  ],
  "country": "China",
  "version": [
    {
      "runtime": "110 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.9,
  "director": [
    {
      "id": "nm0403297",
      "name": "Jin-ho Hur"
    }
  ],
  "writer": [
    {
      "id": "nm0480166",
      "name": "Choderlos de Laclos",
      "description": "novel"
    },
    {
      "id": "nm0945802",
      "name": "Geling Yan",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0156444",
      "name": "Cecilia Cheung",
      "character": "Mo Jieyu"
    },
    {
      "id": "nm0417520",
      "name": "Dong-Gun Jang",
      "character": "Xie Yifan"
    },
    {
      "id": "nm0955471",
      "name": "Ziyi Zhang",
      "character": "Du Fenyu"
    },
    {
      "id": "nm4081050",
      "name": "Shawn Dou",
      "character": "Dai Wenzhou"
    },
    {
      "id": "nm0523734",
      "name": "Lisa Lu",
      "character": "Du Ruixue"
    },
    {
      "id": "nm6373368",
      "name": "Jean Favie",
      "character": "The French Tailor"
    },
    {
      "id": "nm4318250",
      "name": "Dantong Han",
      "character": "Socialite       (as Dan Tong Han)"
    },
    {
      "id": "nm4382816",
      "name": "Rong Rong",
      "character": "Mrs. Zhu"
    },
    {
      "id": "nm5556060",
      "name": "Candy Wang",
      "character": "Beibei"
    },
    {
      "id": "nm4658408",
      "name": "Shuli Xiao",
      "character": "Gui Zhen"
    },
    {
      "id": "nm5877149",
      "name": "Xiangming Ye",
      "character": "Wu Shaopu"
    },
    {
      "id": "nm2753852",
      "name": "Zhang Yun",
      "character": "A Wen"
    }
  ],
  "overview": "Dangerous Liaisons is a Chinese film by Hur Jin-ho based on the novel with the same title by Pierre Choderlos de Laclos. It has been adapted five times to date, including the eponymous Hollywood film (1988) and Untold Scandal from South Korea (2003).",
  "storyline": "In Shanghai, an aging socialite's infatuation with her ex-boyfriend manifests itself as a risky game, where her former lover agrees to seduce, then abandon a naive young woman.",
  "plot": "Shanghai, September 1931: Wealthy businessman and serial seducer Xie Yifan (Jang Dong-gun) is introduced to his uncle's granddaughter, Du Fenyu (Zhang Ziyi), when his maternal grandmother, Du Ruixue (Lisa Lu), arrives at his apartment one day. Fenyu, a young widow who's just arrived from Northeast China (aka Manchuria) where the Japanese are making incursions, is staying at the country home of Madam Du, her grand-aunt.\n\nAt a glitzy fund-raiser for refugees thrown by Hudong Bank chairwoman Mo Jieyu (Cecilia Cheung) at Yifan's nightclub, Jieyu, an old friend of Yifan who's never succumbed to his advances, asks him to rob Beibei (Candy Wang), the 16-year-old fiancee of tycoon Jin Zhihuan (Zhang Han), of her virginity. Jieyu wants revenge on Jin, for publicly dumping her in favor of a schoolgirl. Yifan turns down Jieyu's request, partly because he has another quarry in his sights—the quiet and retiring Fenyu. Sensing an opportunity for some sport, Jieyu makes Yifan a wager: if he can seduce Fenyu without falling in love, she will finally agree to sleep with him; if he fails, he will sign over a valuable piece of land to her. Yifan accepts the challenge, but finds the virtuous Fenyu apparently immune to his charms.\n\nMeanwhile, Jieyu employs a different strategy to get her revenge on Jin, encouraging an attraction between Beibei and her young drawing teacher, college student Dai Wenzhou (Shawn Dou). Despite Jieyu's strenuous efforts, the relationship is never consummated; but when she finds out about it, Beibei's mother, Mrs. Zhu (Rong Rong), forbids her daughter to see Wenzhou anymore. With time running out, Jieyu suggests to Mrs. Zhu that Beibei should spend some quiet time at Madam Du's estate—and secretly arranges for Yifan to be there, to \"comfort\" Beibei. Mission finally accomplished, Yifan refocuses on seducing Fenyu, but finds himself in deeper emotional waters than he's ever experienced.",
  "synopsis": null
}