{
  "imdb_id": "tt2039393",
  "tmdb_id": "284536",
  "douban_id": null,
  "title": "The Gambler (2014)",
  "genres": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "111 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm1012501",
      "name": "Rupert Wyatt"
    }
  ],
  "writer": [
    {
      "id": "nm1184258",
      "name": "William Monahan",
      "description": "screenplay"
    },
    {
      "id": "nm0864812",
      "name": "James Toback",
      "description": "writer: based upon the film written by"
    }
  ],
  "cast": [
    {
      "id": "nm0000242",
      "name": "Mark Wahlberg",
      "character": "Jim Bennett"
    },
    {
      "id": "nm0001421",
      "name": "George Kennedy",
      "character": "Ed"
    },
    {
      "id": "nm2743940",
      "name": "Griffin Cleveland",
      "character": "Young Jim"
    },
    {
      "id": "nm0001448",
      "name": "Jessica Lange",
      "character": "Roberta"
    },
    {
      "id": "nm2077552",
      "name": "Omar Leyva",
      "character": "Valet"
    },
    {
      "id": "nm0661950",
      "name": "Steve Park",
      "character": "Number 2       (as Stephen Park)"
    },
    {
      "id": "nm0488953",
      "name": "Brie Larson",
      "character": "Amy Phillips"
    },
    {
      "id": "nm1851071",
      "name": "Chil Kong",
      "character": "Blackjack Dealer #1"
    },
    {
      "id": "nm0931324",
      "name": "Michael Kenneth Williams",
      "character": "Neville Baraka"
    },
    {
      "id": "nm1229681",
      "name": "Da'Vone McDonald",
      "character": "Neville's Muscle"
    },
    {
      "id": "nm1514763",
      "name": "Amin Joseph",
      "character": "Neville's Bookkeeper"
    },
    {
      "id": "nm6303353",
      "name": "Cjon Saulsberry",
      "character": "Neville's Posse"
    },
    {
      "id": "nm1843748",
      "name": "Teebone Mitchell",
      "character": "Neville's Posse"
    },
    {
      "id": "nm6823435",
      "name": "Jasmond Carroll",
      "character": "Neville's Posse"
    },
    {
      "id": "nm6996460",
      "name": "Ria Wilkinson",
      "character": "Neville's Posse"
    },
    {
      "id": "nm4987126",
      "name": "J. Denise",
      "character": "Neville's Posse       (as Janet McPhail)"
    },
    {
      "id": "nm0408665",
      "name": "Alvin Ing",
      "character": "Mister Lee"
    },
    {
      "id": "nm6996462",
      "name": "Karen Ritchie",
      "character": "Blackjack Dealer #2"
    },
    {
      "id": "nm6996463",
      "name": "Tina Wang",
      "character": "Roulette Croupier"
    },
    {
      "id": "nm1710309",
      "name": "Emory Cohen",
      "character": "Dexter"
    },
    {
      "id": "nm6525241",
      "name": "Anthony Kelley",
      "character": "Lamar Allen"
    },
    {
      "id": "nm5316848",
      "name": "Josiah Blount",
      "character": "Nebbishy Student"
    },
    {
      "id": "nm3887139",
      "name": "Shakira Ja'nai Paye",
      "character": "Questioning Student"
    },
    {
      "id": "nm4991594",
      "name": "Mel McComb",
      "character": "Mouthy Student       (as Melanie McComb)"
    },
    {
      "id": "nm0105672",
      "name": "Andre Braugher",
      "character": "Dean Fuller"
    },
    {
      "id": "nm0518511",
      "name": "Domenick Lombardozzi",
      "character": "Big Ernie"
    },
    {
      "id": "nm0000422",
      "name": "John Goodman",
      "character": "Frank"
    },
    {
      "id": "nm4717085",
      "name": "Chanon Finley",
      "character": "Pole Dancer"
    },
    {
      "id": "nm5134668",
      "name": "Raquel Pomplun",
      "character": "Bottle Service Girl"
    },
    {
      "id": "nm2626538",
      "name": "Mattie Hawkinson",
      "character": "Wide Eyed Student"
    },
    {
      "id": "nm1017348",
      "name": "Lauren Weedman",
      "character": "Banker"
    },
    {
      "id": "nm0920010",
      "name": "James Wellington",
      "character": "Indian Casino Dealer"
    },
    {
      "id": "nm4201978",
      "name": "Carlos L. Smith",
      "character": "Indian Casino Ranchero       (as Carlos Smith)"
    },
    {
      "id": "nm6996464",
      "name": "Steven Fisher",
      "character": "Indian Casino Gambler #1"
    },
    {
      "id": "nm0672451",
      "name": "Henry Penzi",
      "character": "Indian Casino Gambler #2"
    },
    {
      "id": "nm6996465",
      "name": "Steve Kim",
      "character": "Mister Lee's Heavy #1"
    },
    {
      "id": "nm0722223",
      "name": "Simon Rhee",
      "character": "Mister Lee's Heavy #2"
    },
    {
      "id": "nm0771493",
      "name": "Richard Schiff",
      "character": "Jeweler"
    },
    {
      "id": "nm0650702",
      "name": "Leland Orser",
      "character": "Larry Jones"
    },
    {
      "id": "nm2769493",
      "name": "Todd Tetreault",
      "character": "ROTC Squad Leader"
    },
    {
      "id": "nm0219302",
      "name": "Trevor Denman",
      "character": "Horse Race Announcer"
    },
    {
      "id": "nm2565039",
      "name": "Jessika Van",
      "character": "Sports Bar Waitress"
    },
    {
      "id": "nm2959689",
      "name": "Mike Rylander",
      "character": "Game Announcer"
    },
    {
      "id": "nm0425759",
      "name": "Marques Johnson",
      "character": "Game Color Man"
    },
    {
      "id": "nm6996466",
      "name": "Michael Fisher",
      "character": "Basketball Coach"
    },
    {
      "id": "nm6996467",
      "name": "Mark Schotz",
      "character": "Assistant Basketball Coach"
    },
    {
      "id": "nm6996468",
      "name": "Brian Woods",
      "character": "Referee"
    },
    {
      "id": "nm5019381",
      "name": "Stephen Woo",
      "character": "Karaoke Singer"
    },
    {
      "id": "nm1366393",
      "name": "Kent Avenido",
      "character": "Gambling Den Owner"
    }
  ],
  "overview": "Literature professor and gambler Jim Bennett's debt causes him to borrow money from his mother and a loan shark. Further complicating his situation is his relationship with one of his students. Will Bennett risk his life for a second chance?",
  "storyline": "Jim Bennett is a risk taker. Both an English professor and a high-stakes gambler, Bennett bets it all when he borrows from a gangster and offers his own life as collateral. Always one step ahead, Bennett pits his creditor against the operator of a gambling ring and leaves his dysfunctional relationship with his wealthy mother in his wake. He plays both sides, immersing himself in an illicit, underground world while garnering the attention of Frank, a loan shark with a paternal interest in Bennett's future. As his relationship with a student deepens, Bennett must take the ultimate risk for a second chance.",
  "plot": "Jim Bennett (Mark Wahlberg) is a Los Angeles literature professor with a severe gambling addiction caused by his view of the world as either having it all or having nothing. This view goes unchanged even after the death of his grandfather, Ed (George Kennedy), who names Bennett his successor just before dying. Bennett ends up owing $240,000 to Lee (Alvin Ing), the proprietor of an underground gambling ring, and another $50,000 to Neville Baraka (Michael K. Williams), a loan shark. Lee gives Bennett seven days to pay off his debts or be murdered.\n\nDuring one of his classes, Bennett identifies student Amy Phillips (Brie Larson) as a potential writing prodigy, having previously encountered her as a waitress at the gambling house. Bennett also singles out Dexter (Emory Cohen), a genius tennis star, and confronts Lamar Allen (Anthony Kelley), a student who does not pay attention in class and intends to become an NBA basketball player. Amy develops a personal interest in the professor.\n\nAfter class, Bennett visits his mother Roberta (Jessica Lange) at the family's luxury estate, but she says that she will not give him any more money. Bennett considers borrowing money from Frank (John Goodman), another loan shark, to consolidate his debts and buy himself some time, but refuses to do so after Frank's demands include that Bennett admit, \"I am not a man.\" Bennett convinces Roberta to give him enough money to pay off his debts, expressing no gratitude to her, then during a trip to a casino with Amy gambles it all away. Baraka kidnaps Bennett, has him beaten and forces him into an ultimatum—if he does not convince Lamar to win one of his college basketball games by a margin of 7 points or less, he will murder Amy.\n\nBennett goes to Frank, who advises him to adopt a \"fuck you\" attitude towards life by getting enough money to be completely free. Frank lends him $260,000 to pay his debt to Lee, but also threatens to kill everyone in Bennett's personal life if he is not repaid. Lee's men assault Bennett when he comes to ask Lee to stake him $150,000, saying the only way he can pay his full $410,000 debt to Lee and Frank is to gamble and win. He uses the $150,000 to bribe Lamar into going along with the basketball point-shaving scheme. Bennett sends Dexter to Las Vegas to bet on the game with the $260,000 he got from Frank. Lamar succeeds, barely, so Bennett uses his winnings to pay his debt to Baraka, denying he knows anything about the large bet made in Vegas.\n\nBennett then convinces both Lee and Frank to meet him in a neutral gambling den, where he wagers enough money to pay both men off—if he wins—on a single roulette spin. Successful, he leaves the money at the club for Lee and Frank. The payment to Frank is more than he owed, but he refuses to take the \"cream\" when Frank offers to give back the overpayment. Bennett runs through the city to Amy's apartment, broke but free.",
  "synopsis": "After his grandpa dies, Jim Bennett goes straight to a Mr. Lees illegal casino. He plays a few hands of blackjack, winning at first, but ends up owing Lee and a gangster Baraka big time. Both men give him exactly one week to come up with the money. Jim continues his days as an English professor. A student, Amy, is one of the brightest in class but she happens to be waiting tables at Lees casino and she saw Jim went broke. Jim goes to his wealthy mother to ask for money, who rejects him knowing his gambling addiction. He goes to a loan shark Frank, who agrees to loan him the money but at a later time. Jim talks with a student Lamar, a rising star basketball athlete and finds out that Lamar has been hiding an injury. His mother confronts him about the gangsters spying on her house.She gives him the money when Jim tells her the truth about the debt. But instead Jim takes the money and loses it at blackjack while taking Amy out. As time is nearly out, Baraka forces Jim to reveal Lamar's contact info so he can personally force him to to fix the next game. Jim gives Baraka a wrong number and gets beaten for it, but Jim says he will tell Lamar about the game fixing. Jim then acts - he lets go of everything, giving his car to a complete stranger and quitting his job. He takes Frank's money and goes to Lamar's game. Lamar does as Jim asked him to so Jim wins big, with which he repays Baraka. He calls Frank telling him to meet him at Lees casino. He makes an double-or-nothing all-in betting the black numbers in a roulette. The bet pays off and he surrenders the money split two parts to Lee and Frank."
}