{
  "imdb_id": "tt2083231",
  "tmdb_id": "174645",
  "douban_id": null,
  "title": "Java Heat (2013)",
  "genres": [
    "Action",
    "Crime",
    "Drama",
    "Thriller"
  ],
  "country": "Indonesia",
  "version": [],
  "imdb_rating": 5.2,
  "director": [
    {
      "id": "nm3440937",
      "name": "Conor Allyn"
    }
  ],
  "writer": [
    {
      "id": "nm3440937",
      "name": "Conor Allyn",
      "description": "screenplay"
    },
    {
      "id": "nm3455834",
      "name": "Rob Allyn",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm1553725",
      "name": "Kellan Lutz",
      "character": "Jake Wilde"
    },
    {
      "id": "nm2523085",
      "name": "Ario Bayu",
      "character": "Lieutenant Hashim"
    },
    {
      "id": "nm0000620",
      "name": "Mickey Rourke",
      "character": "Malik"
    },
    {
      "id": "nm2681362",
      "name": "Verdi Solaiman",
      "character": "Ling"
    },
    {
      "id": "nm0876513",
      "name": "Frans Tumbuan",
      "character": "General Sriyono"
    },
    {
      "id": "nm1233777",
      "name": "Tio Pakusadewo",
      "character": "Vizier       (as Tio Pakusodewo)"
    },
    {
      "id": "nm2610299",
      "name": "Atiqah Hasiholan",
      "character": "Sultana"
    },
    {
      "id": "nm2547176",
      "name": "Mike Lucock",
      "character": "Achmed       (as Mike Muliadro)"
    },
    {
      "id": "nm3126674",
      "name": "Rio Dewanto",
      "character": "Anton"
    },
    {
      "id": "nm3991389",
      "name": "Astri Nurdin",
      "character": "Vitria"
    },
    {
      "id": "nm2922103",
      "name": "T. Rifnu Wikana",
      "character": "Captain Agus"
    },
    {
      "id": "nm1127928",
      "name": "Rudy Wowor",
      "character": "Sultan"
    },
    {
      "id": "nm2183803",
      "name": "Uli Auliani",
      "character": "Rani"
    },
    {
      "id": "nm1248119",
      "name": "Mike Duncan",
      "character": "Baron       (as Michael John Duncan)"
    },
    {
      "id": "nm5663250",
      "name": "Kayla Kamala Garin",
      "character": "Ade"
    },
    {
      "id": "nm5664061",
      "name": "Asto Tunas Bawono",
      "character": "Budi"
    },
    {
      "id": "nm5664398",
      "name": "Tegar Starya",
      "character": "Faruq Al Hassan"
    },
    {
      "id": "nm0571791",
      "name": "Nick McKinless",
      "character": "Jim Bretton"
    },
    {
      "id": "nm4479237",
      "name": "Latip Abdul Latip",
      "character": "Motorcyclist"
    },
    {
      "id": "nm4479646",
      "name": "Buserih Lukman",
      "character": "Motorcyclist"
    },
    {
      "id": "nm4480407",
      "name": "R. Eva Wulansari",
      "character": "Motor Bike Shooter"
    },
    {
      "id": "nm3343631",
      "name": "Agung Udijana",
      "character": "Andi"
    },
    {
      "id": "nm5663293",
      "name": "Frendy Kusuma",
      "character": "Surveillance Van Driver"
    },
    {
      "id": "nm2731607",
      "name": "Rahayu Saraswati",
      "character": "Nita"
    },
    {
      "id": "nm4479852",
      "name": "Tirta Wijaya Kusuma",
      "character": "Bomber"
    },
    {
      "id": "nm5663936",
      "name": "Denisa Mathatina",
      "character": "Flight Attendant"
    },
    {
      "id": "nm5662578",
      "name": "Gobby Njoo",
      "character": "Wizened Monk"
    },
    {
      "id": "nm5664573",
      "name": "Disyon Gahezi",
      "character": "Japanese Bodyguard"
    },
    {
      "id": "nm5662486",
      "name": "Wulan Soediro",
      "character": "Massage Clerk"
    },
    {
      "id": "nm5662839",
      "name": "Susumu Kawase",
      "character": "Mr. Yoshiro"
    },
    {
      "id": "nm5663003",
      "name": "Widha Wijayanto",
      "character": "Sniper"
    },
    {
      "id": "nm5664581",
      "name": "Joko Utomo",
      "character": "Cop Partner"
    },
    {
      "id": "nm0171861",
      "name": "Peter Collias",
      "character": "Euro Man"
    },
    {
      "id": "nm5663029",
      "name": "Awang Hartawan",
      "character": "Chinese Man"
    },
    {
      "id": "nm5663595",
      "name": "Ie Djoen Sim",
      "character": "Chinese Mother"
    },
    {
      "id": "nm5662889",
      "name": "Deanisa Affifanda",
      "character": "Young Woman"
    },
    {
      "id": "nm5664494",
      "name": "Andipa Perdana Putra",
      "character": "Young Alley Boy"
    },
    {
      "id": "nm5662781",
      "name": "Airell Maulana",
      "character": "Young Boy"
    },
    {
      "id": "nm4479788",
      "name": "Nanda Giri",
      "character": "Female Vendor 1"
    },
    {
      "id": "nm5664298",
      "name": "Ni Komang Dewi",
      "character": "Female Vendor 2"
    },
    {
      "id": "nm4730024",
      "name": "Brent Duke",
      "character": "Marine MP"
    },
    {
      "id": "nm5664084",
      "name": "Immanuel Cahyo",
      "character": "Doctor"
    },
    {
      "id": "nm5663173",
      "name": "Virdy Kurniawan",
      "character": "Ambulance Driver"
    },
    {
      "id": "nm5662666",
      "name": "Michael Johan",
      "character": "Chinese Bouncer"
    },
    {
      "id": "nm5662779",
      "name": "Kaka Krisna",
      "character": "Royal Guard"
    },
    {
      "id": "nm5663165",
      "name": "Stani Ariftasi",
      "character": "Pretty Masseusse"
    },
    {
      "id": "nm5662545",
      "name": "Sarita",
      "character": "Lady Boy"
    },
    {
      "id": "nm5663726",
      "name": "Fuad Husaen",
      "character": "Young Terrorist"
    },
    {
      "id": "nm3842995",
      "name": "Jonathan Ozoh",
      "character": "Bodyguard"
    }
  ],
  "overview": "An American in Indonesia teams up with a Muslim cop to track down a terrorist.",
  "storyline": "Story centers on the aftermath of a suicide bombing in Indonesia, where a reckless American posing as a grad student is bent on vengeance but quickly finds that the world's problems can't be solved with violence alone. A mysterious American Marine/FBI agent Jake Travers (Kellan Lutz) teams with a Muslim cop Hashim (Ario Bayu) to hunt down a dangerous international jewel thief Malik (Mickey Rourke) who kidnaps a Sultan's daughter Sultana (Atiqah Hasiholan) in a plot to steal the royal treasury: exotic intrigue amid ancient palaces, mosques, temples, subterranean labyrinths and stone pyramids in the heart of Java.",
  "plot": "A suicide bomber detonates himself at a party in Java, Indonesia, and a Javanese Sultan's daughter, Sultana (Atiqah Hasiholan), is believed to be one of the unidentified victims. Jake Travers (Kellan Lutz), an American posing as a graduate student from Cornell University, was at the scene of the blast and is held as a witness by a police detective of Detachment 88, Lieutenant Hashim (Ario Bayu).\n\nAfter interviewing Jake at the crime scene, Hasim and Jake are attacked by terrorists led by Malik (Mickey Rourke) and his henchman Achmed. Jake saves Hashim and kills two terrorists, but Achmed manages to escape. Hashim becomes suspicious after he observes Jake's combat skills. Jake and Hashim are brought to the hospital where Hashim's wife meets Jake. At Hashim's wife's insistence, Hashim invites Jake to their house for breakfast. At the house, Hashim tells Jake that he ran a background check on him through Interpol. Jake tells Hashim he is an FBI agent conducting an undercover investigation, and suggests they cooperate with one another.\n\nReturning to his apartment, Jake faxes to a friend stateside a photo of a tattoo from the corpse believed to be Sultana's. Jake's friend informs him that the tattoo is typically used by Chinese high-class prostitutes, which confirms Jake's suspicion that the body is not Sultana's.\n\nJake follows a lead to a night club, where he brings home a prostitute bearing a similar tattoo. When the prostitute cooperates with Jake, they are ambushed by Hashim's terrorists and a Chinese gang operating the prostitution ring. The police, who had been covertly surveilling Jake, intervene and suffer casualties in the fight. Jake flees the scene, but the police eventually capture him.\n\nHashim arrives home and discovers his family is kidnapped. Malik calls Hashim on a cell phone left at the house and taunts him. Hashim visits the police station, where he observes two U.S. Marines officers talking to his superior. Hashim confronts Jake again about his identity. Jake admits he is not FBI, but a Marine who is tracking terrorist activities because his comrades were killed by bombs from Malik's terrorist group. Jake then suggests that Hashim cooperate with him to find his family. Jake later confesses to Hashim that the terrorists also killed his brother.\n\nSuspecting that Sultana was actually kidnapped rather than killed, Jake and Hashim meet the Sultan, who oddly avoids discussing the matter in front of his vizier. The Sultan then slips Hashim a secret message requesting a private meeting. Later the Sultan meets Hashim and confides to him that Sultana was kidnapped and his throne is the ransom. The Sultan suspects his vizier is behind the plot. The vizier, however, learns about the meeting and a shoot-out ensues. Hashim and Jake manage to escape, but the Sultan is fatally wounded.\n\nHashim and Jake intercept the vizier and his men at a bank as they are carting off the Sultan's royal jewelry. Hashim and Jake hide in a spa when Malik calls Hashim and threatens them. Hashim discovers Malik had intercepted his phone to reveal their location. Malik, who is outside, attacks Hashim and Jake with an RPG. In the ensuing chaos, Jake manages to save a royal jewel. As it turns out, Hashim's family is held captive in a van, and Malik and Achmed argue whether or not to set them free. In rage, Malik stabs Achmed. Disguised as paramedics, Jake and Hashim flee the site in an ambulance with a wounded Achmed inside. Before he dies, Achmed reveals where Hashim's family is being held captive.\n\nJake and Hashim chase Malik through a Vesak ceremony at Borobudur temple. They rescue Sultana and Hashim's family from Malik, and subsequently kill him. Jake secretly switches the jewel held by Malik with the one in his possession.\n\nJake is at the airport where he returns the jewelry to Sultana, as Hashim watches. Jake then boards the plane to face a Court Martial in the U.S.",
  "synopsis": null
}