{
  "imdb_id": "tt2023714",
  "tmdb_id": "95177",
  "douban_id": null,
  "title": "Sun Don't Shine (2012)",
  "genres": [
    "Crime",
    "Drama",
    "Horror",
    "Mystery",
    "Romance",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm1541272",
      "name": "Amy Seimetz"
    }
  ],
  "writer": [
    {
      "id": "nm1541272",
      "name": "Amy Seimetz",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3338354",
      "name": "Kate Lyn Sheil",
      "character": "Crystal"
    },
    {
      "id": "nm2310589",
      "name": "Kentucker Audley",
      "character": "Leo"
    },
    {
      "id": "nm1410105",
      "name": "AJ Bowen",
      "character": "Highway Angel"
    },
    {
      "id": "nm0350337",
      "name": "Kit Gwin",
      "character": "Terri"
    },
    {
      "id": "nm1371821",
      "name": "Mark Reeb",
      "character": "Boatman"
    },
    {
      "id": "nm5085407",
      "name": "Gregory Gordon Schmidt",
      "character": "Dead Man"
    }
  ],
  "overview": "Crystal and her boyfriend Leo embark on a tense and mysterious road trip through the desolate yet hauntingly beautiful landscape of central Florida.",
  "storyline": "\"Sun Don't Shine\" follows Crystal (Kate Lyn Sheil) and her boyfriend Leo (Kentucker Audley) on a tense and mysterious road trip through the desolate yet hauntingly beautiful landscape of central Florida. As the couple travels up the Gulf Coast the disturbing details of their excursion gradually begin to emerge, revealing Crystal's sinister past and the couple's troubling future.",
  "plot": "Crystal (Kate Lyn Sheil) and Leo (Kentucker Audley) are a couple on the run after Crystal murdered her husband when he accused her of cheating on him with Leo. Leo tries to help the weak and needy Crystal by taking them to St. Petersburg, Florida where they hope to ditch the body and he hopes to get help from a friend that Crystal suspects is one of his ex-girlfriends.\n\nWhen they arrive Leo leaves Crystal at a campsite and goes to spend the evening with his ex. Afraid of being alone Crystal goes to the exes house where she sees Leo kissing her and attacks them both, threatening them with a knife. Leo manages to get Crystal to drop the knife and the two leave.\n\nLeo drops Crystal off at Weeki Wachee Springs where she watches the mermaid show. In the meantime he tries to rent a boat, however the owner of the boat rental asks him to leave after he glimpses the inside of the trunk which contains Crystal's husband.\n\nLeo enters Weeki Wachee Springs and retrieves Crystal before returning to the boat place where they go in the water and throw in the bodies of Crystal's husband and the boat man, whom Leo also killed to protect them. Leo angrily berates Crystal who flies into a rage and hits him with an oar. Believing she has killed him she gets out of the boat and wades to the shore where she sees that local police have arrived. Crystal runs off into the swampland. Meanwhile Leo recovers from being knocked out and returns to shore where he turns himself in.\n\nCrystal wanders into someone's back garden. Seeing a pool she gets in and begins to swim. The owner of the property arrives and asks Crystal if she wants her to call the police. Crystal tells her \"Not yet.\"",
  "synopsis": null
}