{
  "imdb_id": "tt2083383",
  "tmdb_id": "87825",
  "douban_id": null,
  "title": "Trouble with the Curve (2012)",
  "genres": [
    "Drama",
    "Sport"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "111 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm0520749",
      "name": "Robert Lorenz"
    }
  ],
  "writer": [
    {
      "id": "nm4720384",
      "name": "Randy Brown",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0000142",
      "name": "Clint Eastwood",
      "character": "Gus"
    },
    {
      "id": "nm0743304",
      "name": "Chelcie Ross",
      "character": "Smitty"
    },
    {
      "id": "nm0859403",
      "name": "Raymond Anthony Thomas",
      "character": "Lucious       (as Ray Anthony Thomas)"
    },
    {
      "id": "nm0491590",
      "name": "Ed Lauter",
      "character": "Max"
    },
    {
      "id": "nm0010736",
      "name": "Amy Adams",
      "character": "Mickey"
    },
    {
      "id": "nm3623484",
      "name": "Clifton Guterman",
      "character": "Neil"
    },
    {
      "id": "nm2378513",
      "name": "Carla Fisher",
      "character": "Law Receptionist"
    },
    {
      "id": "nm0943927",
      "name": "George Wyner",
      "character": "Rosenbloom"
    },
    {
      "id": "nm0348409",
      "name": "Bob Gunton",
      "character": "Watson"
    },
    {
      "id": "nm0319636",
      "name": "Jack Gilpin",
      "character": "Schwartz"
    },
    {
      "id": "nm0000498",
      "name": "Matthew Lillard",
      "character": "Phillip Sanderson"
    },
    {
      "id": "nm0001598",
      "name": "Robert Patrick",
      "character": "Vince"
    },
    {
      "id": "nm0000422",
      "name": "John Goodman",
      "character": "Pete Klein"
    },
    {
      "id": "nm0974596",
      "name": "Nathan Wright",
      "character": "Drunk Fan"
    },
    {
      "id": "nm2207222",
      "name": "Scott Eastwood",
      "character": "Billy Clark"
    },
    {
      "id": "nm1926948",
      "name": "Matt Bush",
      "character": "Danny"
    },
    {
      "id": "nm0005493",
      "name": "Justin Timberlake",
      "character": "Johnny"
    },
    {
      "id": "nm5264460",
      "name": "Sam Collins",
      "character": "Kid #1"
    },
    {
      "id": "nm2867712",
      "name": "Chandler George Brown",
      "character": "Kid #2"
    },
    {
      "id": "nm5264211",
      "name": "Louis Fox",
      "character": "Lloyd"
    },
    {
      "id": "nm3239993",
      "name": "Ricky Muse",
      "character": "Jimmy"
    },
    {
      "id": "nm0237378",
      "name": "Tom Dreesen",
      "character": "Rock"
    },
    {
      "id": "nm0949486",
      "name": "Don Young",
      "character": "Regular #1"
    },
    {
      "id": "nm0482799",
      "name": "Leon Lamar",
      "character": "Regular #2"
    },
    {
      "id": "nm4743192",
      "name": "Julia Walters",
      "character": "Young Mickey"
    },
    {
      "id": "nm0379282",
      "name": "Peter Hermann",
      "character": "Greg"
    },
    {
      "id": "nm2474245",
      "name": "Dane Davenport",
      "character": "Waiter #1"
    },
    {
      "id": "nm3373328",
      "name": "Eric Mendenhall",
      "character": "Waiter #2"
    },
    {
      "id": "nm3172770",
      "name": "James Patrick Freetly",
      "character": "Todd"
    },
    {
      "id": "nm5264281",
      "name": "Norma Alvarez",
      "character": "Grace Sanchez"
    },
    {
      "id": "nm4138152",
      "name": "Tyler Silva",
      "character": "Carlos Sanchez"
    },
    {
      "id": "nm5015212",
      "name": "Jay Galloway",
      "character": "Rigo Sanchez"
    },
    {
      "id": "nm5263149",
      "name": "Melissa Lorenz",
      "character": "Mom in Diner"
    },
    {
      "id": "nm5263754",
      "name": "Jack Lorenz",
      "character": "Boy in Diner"
    },
    {
      "id": "nm5263819",
      "name": "Rory Lorenz",
      "character": "Girl in Diner"
    },
    {
      "id": "nm0169305",
      "name": "Dave Cohen",
      "character": "Announcer #1"
    },
    {
      "id": "nm4115048",
      "name": "Joe Massingill",
      "character": "Bo Gentry"
    },
    {
      "id": "nm5111965",
      "name": "Seth Meriwether",
      "character": "Wilson"
    },
    {
      "id": "nm0019171",
      "name": "Kenny Alfonso",
      "character": "Umpire"
    },
    {
      "id": "nm3570642",
      "name": "Josh Warren",
      "character": "Pitcher"
    },
    {
      "id": "nm0484707",
      "name": "Clayton Landey",
      "character": "Manager"
    },
    {
      "id": "nm1025955",
      "name": "Matthew Brady",
      "character": "Swannanoa Manager       (as Matt Brady)"
    },
    {
      "id": "nm0360593",
      "name": "Bart Hansard",
      "character": "Boy's Father"
    },
    {
      "id": "nm4587099",
      "name": "Ryan Patrick Williams",
      "character": "Grizzly Player #1"
    },
    {
      "id": "nm5263772",
      "name": "Xavier Floyd",
      "character": "Grizzly Player #2"
    },
    {
      "id": "nm0085952",
      "name": "Rus Blackwell",
      "character": "Rick"
    },
    {
      "id": "nm1501128",
      "name": "Brian F. Durkin",
      "character": "Matt Nelson"
    },
    {
      "id": "nm1098160",
      "name": "Darren Le Gallo",
      "character": "Nurse"
    },
    {
      "id": "nm5264040",
      "name": "Sammy Blue",
      "character": "Musician"
    },
    {
      "id": "nm0294170",
      "name": "Patricia French",
      "character": "Diner Waitress"
    },
    {
      "id": "nm1836910",
      "name": "Jackie Prucha",
      "character": "Secretary"
    },
    {
      "id": "nm0429092",
      "name": "Rhubarb Jones",
      "character": "Announcer #2"
    },
    {
      "id": "nm5264237",
      "name": "Scott Estep",
      "character": "Umpire"
    },
    {
      "id": "nm0637441",
      "name": "Tom Nowicki",
      "character": "Red Sox GM"
    },
    {
      "id": "nm0004073",
      "name": "Jason Gondek",
      "character": "Red Sox Exec       (as Jason S. Gondek)"
    },
    {
      "id": "nm0961711",
      "name": "Bud Selig",
      "character": "Allan H. (Bud) Selig       (as Allan H. 'Bud' Selig)"
    },
    {
      "id": "nm0859718",
      "name": "Mark Thomason",
      "character": "Braves Official"
    },
    {
      "id": "nm2278056",
      "name": "Cara Mantella",
      "character": "Assistant"
    }
  ],
  "overview": "Slowed by age and failing eyesight, crack baseball scout Gus Lobel takes his grown daughter along as he checks out the final prospect of his career. Along the way, the two renew their bond, and she catches the eye of a young player-turned-scout.",
  "storyline": "Gus is a baseball scout. The team he works for thinks he should retire. He asks them to let him do one more scouting job to prove himself. His friend, Pete, asks Gus's estranged daughter, Mickey, if she could go with him to make sure he's OK as his eyes are failing. The doctor tells Gus he should get his eyes treated but he insists on doing his scouting assignment, which takes him to North Carolina. Mickey decides to put her work on hold to go with him and she wants him to explain why he pushed her away. Whilst there he runs into Johnny, a scout from another team who was a promising player Gus once scouted. Johnny and Mickey take an interest in each other.",
  "plot": "An aging Atlanta Braves baseball scout, Gus Lobel (Eastwood), is given one last assignment to prove his value to the organization, who views him as unable to adapt to changes within the game. His boss and friend Pete (Goodman) does not want to see him let go, but he must contend with an ambitious junior executive, Philip (Lillard), who is trying to get a promotion to the team's general manager post and wants Gus fired as an obstacle to his own baseball philosophy and methods.\n\nPete suspects Gus is hiding problems with his health, so against Gus's wishes, Pete contacts Gus's daughter Mickey (Adams), a workaholic lawyer pursuing a partnership at her firm, to join her father on a scouting trip to North Carolina. Gus is to review a top prospect named Bo Gentry, a brash amateur whose statistics make him a likely top draft pick.\n\nMickey realizes that Gus's vision is failing and starts to take an active role in his work to make up for his shortcoming. Along the way, Gus reconnects with a former player he once scouted, Johnny \"The Flame\" Flanagan (Timberlake), who is now a scout for the Boston Red Sox, and who takes an interest in Mickey. When Mickey questions Gus about his leaving her with an uncle she barely knew as a child, after her mother's passing, the conversation takes a sour turn, and Mickey storms off, leaving Gus frustrated.\n\nAs Gus, Mickey and a group of other scouts watch Bo play, Gus and Mickey realize he can't hit a curveball. Gus advises Johnny to pass on Bo in the draft, and Johnny takes his advice. However, when Gus calls Pete and the Braves' management with the same advice, Philip disagrees based on statistical analysis and stakes his career on his opinion, leading Braves general manager Vince (Patrick) to draft Bo against Gus's advice. When Johnny learns of the move, he believes that Gus and Mickey double-crossed him to allow the Braves to draft Bo instead and angrily leaves.\n\nGus abandons Mickey at the hotel. She hears a pitcher throwing outside her room, and realizes he is talented just from the sound. She approaches the young man, Rigoberto, and volunteers to catch for him. After seeing him throw a few curveballs, she calls Pete, who reluctantly agrees to have him tryout in Atlanta.\n\nGus returns to the Braves' office where Vince and Philip criticize him for his evaluation of Bo. Pete interrupts to let them know that Mickey has brought Rigo to the field. As Bo practices batting, Philip mocks Gus and Mickey for bringing in Rigo, an unknown. Mickey insists, however, and Pete allows Rigo to pitch. Rigo throws several fastballs, which Bo repeatedly misses. Mickey calls for Rigo to throw a curve and again Bo cannot connect with the ball, and the staff realize they were wrong about both Bo and Gus.\n\nThe management resume their meeting, intent on signing Rigo. Gus suggests Mickey could be Rigo's sports agent, due to her legal background and knowledge of the game. When Philip makes another snide remark towards Gus, Vince fires him and offers Gus a contract extension. Mickey then gets a partnership offer from her firm. Outside the stadium, Mickey and Gus find Johnny waiting. Mickey approaches him and they kiss while Gus lights a cigar and walks away.",
  "synopsis": "Gus Lobel (Clint Eastwood) is a baseball scout for the Atlanta Braves. He wakes up in empty house alone and goes to scout a game where he meets some fellow scouts. While scouting the game, he notices that his vision is blurry even when he puts on his glasses. Mickey Lobel (Amy Adams) is Guss daughter who has been working at a law firm for the past 7 years. She is up for a partnership, but there are concerns about her becoming the only woman partner and they also hint that the partnership will dependent on the outcome of a case that Mickey is currently working.At the Braves headquarters, the General Manager, Vince (Robert Patrick), the head of scouting, Pete Klein (John Goodman) and another scout, Phillip Sanderson (Matthew Lillard) are discussing the teams prospects. They begin to discuss Gus and Phillip brings up that Gus may be getting to old to be a scout and that Guss contract with the team is coming to an end soon. With some reservation, Vince sends Gus to scout one of the top prospects in the upcoming draft, Bo Gentry (Joe Massingill). Pete later goes to see Gus at home to check on him. He reminds Gus that his contract is coming up and warns him about Phillip.Mickey and her boyfriend, Greg (Peter Hermann) are having dinner. He is pressuring her for a decision on having an exclusive relationship with him. She avoids answering him by talking to the waiter about a recent no hitter. She returns to her apartment and gets an encouraging message from work about her partnership. She excitedly calls her dad; however, Gus has nodded off and grumpily answer the phone with who the hell is calling me this time of night? so Mickey hangs up without speaking to him.Pete goes to see Mickey at her office and warns her that Gus may lose his job if something goes wrong with the scouting of Bo Gentry. Gus goes to see grave of wife. He tells her she would be proud of Mickey and says the he still needs her to talk to Mickey because she was always good at that. Mickey calls Gus doctor and finds out about his eye condition. She confronts her father but Gus still cant find a way to talk with her.\nGus drives to North Carolina to scout Bo Gentry. At the ballpark, Gentry is seen as self-centered egotistical player who is already planning his future as a major league player. Bo yells for peanuts from the peanut boy, Rigo Sanchez (Jay Galloway) who happens to be the son of the woman running the hotel where Gus is staying. He gets the peanuts after Rico throws a bag perfectly right to him, but Gentry feels he shouldnt have to pay for them.Johnny Flanagan (Justin Timberlake), an ex-professional pitcher that Gus recruited shows up at the game as a scout. Mickey also shows up having decided to help out her father. At the game, Gentry hits a home run to win the game.Later, Gus meets Flanagan at a bar and Mickey walks in later. She plays a game of pool with a guy in the bar and easily beats him. The guy asks her for a dance but she says no however the guy is insistent and starts to put her hands on her. Gus gets angry and breaks a bottle and threatens the guy; however Flanagan intervenes before the situation worsens. Mickey leaves angered by her fathers perceived overreaction. The next day, they continue to scout Gentry who continues to play well. After the game, Gus and Mickey share a moment together playing baseball together where Mickey hits a home run. Gus drives back to the motel, but gets into a small accident because he didnt see a van coming; however they are not seriously injured. Later at the bar, Gus and Flanagan are talking. Gus admits he didnt handle it well raising Mickey. Flanagan says that he ended up throwing his arm out because when he was traded to the Red Sox from the Braves, he was used too often; a trade which Gus a opposed.They continue to scout Gentry. Gus calls Pete and says he is still not sure of Gentry. However, Phil sent another scout, Matt Nelson (Brian F Durkin) and he is impressed with Gentry after only seeing him one time. Mickey gets a phone a call from her boyfriend and she still cant answer him about an exclusive relationship. He hangs up on her after saying take care. Mickey goes to the local bar and sees Gus and Flanagan. Gus tells them to just go out, which they do. They have a good time quizzing each other on baseball trivia where Mickey is an expert. They dance and have a good time and spend the night talking; however Mickey gets interrupted by phone calls and frustrated, Flanagan takes her home.The next morning, Mickey and Gus go to breakfast. Mickey starts to talk to Gus about going to therapy to deal with her feeling of rejection because Gus left her for a year to live with an uncle. Then, when she was 13 she was placed in boarding school. She wants to know why, but Gus still is unable to talk, so she walks out.\nBack in Atlanta, Phil discloses to Pete that he sent another scout to see Gentry. He tells Pete not to worry, he doesnt want Petes job, he wants to be GM. At Mickeys law firm, another associate, Todd (James Patrick Freetly) who is competing with Mickey for the partnership position, gives one of the partners a brief saying he has different approach and hes there when they need him.Mickey and Gus go to scout Gentry at another game. After Gentry hits a ball, Gus says Gentry has trouble with the off-speed and cant handle a breaking ball. Gus says its the sound and tells Mickey to watch Gentrys closely at his next a bat. Although Gentry is able to hit a home run at his last bat up, Mickey sees that he is shifting so he will have problems hitting pitches in the majors.Mickey calls work and is informed Todd will be presenting Mickeys case to the clients and she doesnt need to hurry back to work. Dejected, she shares a bottle of scotch with Flanagan outside Gus motel room. Gus goes outside and tells Flanagan to not pick Gentry because his hands drift on breaking balls and curves. Flanagan and Mickey go out eventually ending the night kissing while skinny dipping in a lake.Flanagan tells the Red Sox not to pick Gentry so the Red Sox chose to pick someone else. The Braves have the next pick and chose not to take Gus advice and pick Bo Gentry based on Phils advice. Flanagan confronts Gus and Mickey outside the motel as he is driving off in his car. He says that he was fired because of the pick and he feels used by the both of them. He drives off even though Mickey implores him to stay.\nMickey and Gus sit down and talk about what they will do now. Gus tells Mickey his life was no life for a kid. Mickey says she always loved baseball and she didnt want to be lawyer, she only did it to make her dad happy and so he would keep her around. She felt that the best times of her life were those times she spent with Gus while he was scouting. She asks him to talk to her, and he finally reveals that while he was scouting, Gus lost track of her after a game because Mickey wandered off looking for a horse. Gus found her in a shed with a strange man who had his hands on her. Angered, Gus beat the guy and strangled him until he passed out. Feeling that he failed Mickey, he left her to stay at her uncles house when she was 6. Gus says he cant change and Mickey says that he never tried. She then leaves Gus.The next day, she goes to find Gus, but finds out he has already taken the bus back to Atlanta. Mickey hears a baseball sound outside her door and finds Rigo pitching a baseball to his brother outside. Impressed by what she sees, she offers to catch for Rigo. She finds out Rigo wasnt allowed to play baseball for the school because his mother wanted him to concentrate on school. Mickey calls Pete and talks him into giving Rigo a tryout with the Braves.Back in Atlanta, the GM, Pete, and Phil are discussing retirement options with Gus. Gus tells them that he knows about Gentrys hitting problems because of the sound, which they dont believe. They go out to the field and see Gentry hitting balls out of the park. Mickey is there with Rigo and Rigo is given a chance to pitch to Gentry. Gentry degradingly refers to Rigo as the peanut boy. When asked how she found Rigo, Mickey says it was the pure sound. Rigo throws several fastballs which Gentry cant hit. Mickey next tells Rigo to throw the curve which she states is his best pitch, and Gentry still cant hit the ball even though he knows its coming. The GM realizes that they wasted their pick on Gentry. Back in the office, they decide that Rigo needs a contract. Gus is offered a contract extension. Mickey finds out Todds presentation didnt go well and they want her back. Outside the ballpark, Flanagan is waiting. He asks her a baseball trivia question and she answers correctly. They kiss and make up while Gus walks away saying Ill be taking the bus."
}