{
  "imdb_id": "tt2098700",
  "tmdb_id": "286299",
  "douban_id": null,
  "title": "Hard Knocks (2009)",
  "genres": [
    "Short",
    "Sport"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "39 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.2,
  "director": [
    {
      "id": "nm3519396",
      "name": "Arthur Cauty"
    }
  ],
  "writer": [
    {
      "id": "nm3519396",
      "name": "Arthur Cauty",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0175382",
      "name": "A.C. Connor",
      "character": "Himself"
    },
    {
      "id": "nm0199868",
      "name": "Christopher Daniels",
      "character": "Daniels"
    },
    {
      "id": "nm0284201",
      "name": "Mick Foley",
      "character": "Himself"
    },
    {
      "id": "nm0397576",
      "name": "Bob Howard",
      "character": "Himself"
    },
    {
      "id": "nm0416321",
      "name": "Brian James",
      "character": "Himself"
    },
    {
      "id": "nm0506610",
      "name": "Scott Levy",
      "character": "Raven"
    },
    {
      "id": "nm1766117",
      "name": "Chris Mordetzky",
      "character": "Himself"
    },
    {
      "id": "nm1516006",
      "name": "C.M. Punk",
      "character": "CM Punk"
    },
    {
      "id": "nm1649934",
      "name": "Joe Seanoa",
      "character": "Himself"
    },
    {
      "id": "nm0765715",
      "name": "Al Snow",
      "character": "Himself       (as Allen Sarven)"
    },
    {
      "id": "nm0814688",
      "name": "Monty Sopp",
      "character": "Himself"
    },
    {
      "id": "nm1138283",
      "name": "A.J. Styles",
      "character": "Himself       (as Allen Jones)"
    }
  ],
  "overview": "Hard Knocks dives deep into this bizarre fusion of sport and theatre in order to uncover the true art of professional wrestling; blending combat and athleticism with drama and showmanship to captivate the minds of the audience, suspending any disbelief that what they are seeing is not real. Although you can hardly epitomize it as simply \"real\" or \"fake\", there is no denying the tremendous skill and aptitude required of each performer. Yet despite this and the often harsh realities of each match, to most people, professional wrestling is a laughing stock. Director Arthur Cauty interviews wrestlers, referees and promoters alike, with world famous stars of the WWE aligning with the stars of tomorrow to voice their opinions, revealing startling truths about this illusive business. This film will shock and astound, leaving you with a new found respect for professional wrestling and the men and women who dedicate their lives and bodies to this obscure art form.",
  "storyline": "Hard Knocks is a 40 minute documentary short on Professional Wrestling - an industry largely misunderstood by the general public and an industry that has been victim of ridicule time and time again. Over the past few years in particular, the professional wrestling world has been thrust into complete turmoil after the deceiving and biased portrayal of certain events by the national media. The deaths of top wrestlers in their prime as well as numerous steroid scandals have been used to kick the industry when it's down. Hard Knocks dives deep into this bizarre fusion of sport and theatre in order to uncover the true art of professional wrestling; blending combat and athleticism with drama and showmanship to captivate the minds of the audience, suspending any disbelief that what they are seeing is not real. Although you can hardly epitomize it as simply \"real\" or \"fake\", there is no denying the tremendous skill and aptitude required of each performer. Yet despite this and the often harsh ...",
  "plot": null,
  "synopsis": null
}