{
  "imdb_id": "tt2093977",
  "tmdb_id": "183662",
  "douban_id": null,
  "title": "Crush (2013)",
  "genres": [
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm1471703",
      "name": "Malik Bader"
    }
  ],
  "writer": [
    {
      "id": "nm1867458",
      "name": "Sonny Mallhi",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm4219564",
      "name": "Ashleigh Craig",
      "character": "Young Girl"
    },
    {
      "id": "nm3089858",
      "name": "Cody Hamilton",
      "character": "Young Boy"
    },
    {
      "id": "nm1395771",
      "name": "Lucas Till",
      "character": "Scott"
    },
    {
      "id": "nm3706952",
      "name": "Crystal Reed",
      "character": "Bess"
    },
    {
      "id": "nm2248149",
      "name": "Isaiah Mustafa",
      "character": "Coach Evans"
    },
    {
      "id": "nm0018351",
      "name": "Dan Metcalfe",
      "character": "Referee"
    },
    {
      "id": "nm3896526",
      "name": "Derrick Kemp",
      "character": "Brock       (as DJ Kemp)"
    },
    {
      "id": "nm2186221",
      "name": "Preston Davis",
      "character": "Corey (Teammate)"
    },
    {
      "id": "nm2279757",
      "name": "Mariah Buzolin",
      "character": "Karen"
    },
    {
      "id": "nm0092961",
      "name": "Sarah Bolger",
      "character": "Jules"
    },
    {
      "id": "nm0564697",
      "name": "Holt McCallany",
      "character": "Mike"
    },
    {
      "id": "nm0345477",
      "name": "Camille Guaty",
      "character": "Mrs. Brown"
    },
    {
      "id": "nm1495520",
      "name": "Caitriona Balfe",
      "character": "Andie"
    },
    {
      "id": "nm1191481",
      "name": "Leigh Whannell",
      "character": "David"
    },
    {
      "id": "nm2938641",
      "name": "Reid Ewing",
      "character": "Jeffrey"
    },
    {
      "id": "nm4752788",
      "name": "Melissa Young",
      "character": "Barista"
    },
    {
      "id": "nm1840748",
      "name": "Nikki SooHoo",
      "character": "Maya"
    },
    {
      "id": "nm0001694",
      "name": "Meredith Salenger",
      "character": "Bess' Mother"
    },
    {
      "id": "nm0484678",
      "name": "Michael Landes",
      "character": "Mr. Graham"
    }
  ],
  "overview": "A secret admirer's crush on a high school athlete takes a fatal turn.",
  "storyline": "The promising high school soccer player Scott is injured on the knee in a game and two years after, he is still trying to heal his knee. The teenager Jules feels unrequited love for him but Scott is concentrated in recovering his physical condition and considers her as a friend. The also teenager Bess that works in the store owned by David with her mature colleague Andie has a crush on Scott. When Scott is stalked by a mysterious person that threatens Jules, he believes that Bess is responsible for the weird situations. Is his assumption correct?",
  "plot": "A promising high school soccer player, Scott (Lucas Till), injures his knee in a game and doctors say it might take up to two years for his knee to heal. His father is against his playing soccer and wishes that he takes rest until he recovers completely. Later after 6 months, Jules (Sarah Bolger) likes him but Scott is fixated on recovering his physical condition and considers her his best friend. Bess (Crystal Reed) a girl studying in Scott's high school, has a crush on Scott, and works in a store owned by David (Leigh Whannell) with her mature colleague Andie (Caitriona Balfe). Bess keeps sending love letters to Scott but Scott doesn't realize who has sent them and ignores them.\n\nLater, Ms. Brown (Camille Guaty), Scott's teacher favors him by giving higher grades than he deserves and asks him to call her regarding a novel. Bess who hears the conversation, asks Scott whether he will call her and remarks that Scott is someone special, leading him to suspect that Bess is his secret admirer. Ms. Brown is later attacked at a park while jogging. However, the attacker is not revealed. Later, when Scott is stalked by a mysterious person that threatens Jules, he believes that Bess is responsible for the weird situations. Things begin to get worse and worse as the stalker takes extreme measures that humiliate Jules, among others.\n\nDuring a party at a friend's place, someone attempts to suffocate Jules with a pillow while she is asleep. Jules pretends to be unconscious and escapes from the incident. Scared, she informs Scott who is also present at the party. Scott assumes that Bess is responsible for the attack and he escorts Jules to her house. While returning home, he encounters Andie who accidentally crashes her bicycle with Scott's car and is injured. Scott offers to take her to the hospital but she turns down the offer but accepts it when Scott offers to give her a ride home. While Scott is at Andie's house, he is attacked by her and is knocked unconscious, revealing that it was Andie who was the stalker all the time, and not Bess. Andie holds Scott captive in her basement. David visits Andie's house and expresses his feelings for her, which she rejects and then kills David. Scott attacks Andie at a suitable opportunity and tries to escape from the basement. Bess accidentally visits Andie's house and sees Scott and a deceased David. However, Andie attacks both of them and Jeffrey, a guy who has a crush on Bess and followed her there, comes to their rescue. Finally, the cops arrive and Andie is admitted to a mental asylum where she reveals that she had been stalking boys since her childhood and killed a lot of them. Finally Bess dates Jeffrey, and Scott reconciles with Jules. He reciprocates her feelings and they kiss.",
  "synopsis": null
}