{
  "imdb_id": "tt2065967",
  "tmdb_id": "96412",
  "douban_id": null,
  "title": "How to Re",
  "genres": [
    "Documentary",
    "History"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "75 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.8,
  "director": [
    {
      "id": "nm4685920",
      "name": "Daniel Edelstyn"
    }
  ],
  "writer": [
    {
      "id": "nm4685920",
      "name": "Daniel Edelstyn",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0039711",
      "name": "Conrad Asquith",
      "character": "Great Grandfather Ilya Zorokovich"
    },
    {
      "id": "nm4685920",
      "name": "Daniel Edelstyn",
      "character": "Grandpa Max"
    },
    {
      "id": "nm2556437",
      "name": "Daniel Jordan",
      "character": "Aristocrat"
    },
    {
      "id": "nm2451482",
      "name": "Anthony Styles",
      "character": "Evil Bolshevik Stepanovich"
    }
  ],
  "overview": "How To Re-Establish a Vodka Empire is a feature documentary charting the journey of the film director Dan Edelstyn as he tracks down his long lost Jewish Ukrainian heritage and then attempts to relaunch his great grandfather's once glorious vodka empire. The film consists of a whirlwind journey through European time, space and the great events of the 20th century. The story has it all: revolution and romance, exile and entrepreneurship, and at its heart lies a life changing discovery of a vodka distillery in the Ukraine.",
  "storyline": "Feature documentary charting the journey of film director Dan Edelstyn as he tracks down his long lost Jewish Ukrainian heritage and then attempts to relaunch his great grandfather's once glorious vodka empire. The film constitutes a whirlwind journey through European times and spaces - the story has it all, revolution and romance, exile and entrepreneurship, and at its heart lies a life changing discovery of a vodka distillery in Ukraine.",
  "plot": null,
  "synopsis": "A multitude of themes in two over arching time frames. In the first strand we meet film director Dan Edelstyn in the present day and follow his story as he attempts to trace and reconnect with his Jewish Ukrainian routes. Edelstyn, who was three when his father died, grew up in a non-Jewish household in Northern Ireland. Before discovering his dead grandmother's memoir he was only remotely aware of this side of his heritage but the snippets he did hear led to the harbouring of a long-term childhood fantasy of 'returning' to reclaim lost riches and set things right. Grandmother Maroussia Zorokovich's story stands out from the predominant experience of east European Jewery in and around the first World War. Voicing the experiences of a highly educated cosmopolitan Jew it contrasts with the dominant narratives of the Shtetl, and the Jew as the downtrodden victim and represents a rare social strata inhabited by a merchant Jewish family fully integrated with the aristocracy of the day, living in the romantic tradition of 19th century European landed gentry oblivious to the imminent collapse of that world. As an adult, this world discovered through his grandmother's manuscript acted as a powerful call to action for Dan to enact the long held desire for return. The ensuing adventure explores and reveals the inner feelings connected to this heritage in an open and brutally frank manner. The other time frame is that of Grandmother Maroussia's experiences of becoming a young woman during the prolonged throes of the 1917 Russian Revolution, her activities during the ensuing civil war (part of a dance troupe enlisted to keep up the morale of the beleaguered white army) and turbulent journey out of Ukraine, across Europe and into exile. After a harsh period of adaptation she died young in Belfast, Northern Ireland to be buried a Catholic on the Falls Road. With adventurous style, the film interweaves present day documentary, rare archive footage and animation. This animation is an important device to bring the writings and experiences of Dan's grandmother to life as a dark fairytale, recounting the stream of events in the lives of the family and the flight to safety and an unknown and unwelcoming Britain. Lo-fi, subjective and surreal, the animations have a potent ability to shed light on history with vivid emotion. Within the film's structure Dan Edelstyn and his Grandmother Maroussia Zorokovich are constantly on parallel journeys - her by cart from Kiev to the little town of Dubouviazovka - he arriving there by plane,train and decrepit lada. Whilst she waits in trepidation for immigration papers to be stamped he sits, out of his depth in a language and culture he doesn't understand, awaiting a decision for vodka export to be approved by the distillery boss. Their stories intertwine in what is both a kaleidoscopic journey into the heart of the Russian Revolution experienced by a young Jewish girl and the experience of a young film director who has gone in search of the past - a past that very quickly has more influence on his present and future than first expected....... Dan's discovery of the spirits distillery which once belonged to his great grandfather mixed with witnessing the poverty of his ancestral village creates a potent cocktail in his over active mind - and before long he's hatched a plan to try and save the village and to reconnect his family to the place. Dan's impulsive notion of rebranding the vodka created in the village seems simple at first but rapidly descends into a white knuckle ride into a cut throat alcohol business by a naïve film maker. The deeper he gets and the worse it all becomes, the more the viewer becomes ensconced in this strange and unique story. Dan's need to reconnect is costing him dear, but he is determined to see his way through and to bring the vodka into the UK - in the process connecting himself to the village and villagers and connecting them to the same place his grandparents were forced to go so long ago - the new world of opportunity. In this film past and present are not so much woven as welded together, re-invigorating history and experiencing the present in the light of what has gone before."
}