{
  "imdb_id": "tt2005374",
  "tmdb_id": "199373",
  "douban_id": null,
  "title": "The Frozen Ground (2013)",
  "genres": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "105 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm1960428",
      "name": "Scott Walker"
    }
  ],
  "writer": [
    {
      "id": "nm1960428",
      "name": "Scott Walker",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0000115",
      "name": "Nicolas Cage",
      "character": "Sgt. Jack Halcombe"
    },
    {
      "id": "nm1227814",
      "name": "Vanessa Hudgens",
      "character": "Cindy Paulson"
    },
    {
      "id": "nm0000131",
      "name": "John Cusack",
      "character": "Robert Hansen"
    },
    {
      "id": "nm0606487",
      "name": "Dean Norris",
      "character": "Sgt. Lyle Haugsven"
    },
    {
      "id": "nm1213456",
      "name": "Gia Mantegna",
      "character": "Debbie Peters"
    },
    {
      "id": "nm4749828",
      "name": "Robert Forgit",
      "character": "Sgt. Wayne Von Clasen"
    },
    {
      "id": "nm0377034",
      "name": "Brad William Henke",
      "character": "Carl Galenski"
    },
    {
      "id": "nm0569732",
      "name": "Michael McGrady",
      "character": "Vice Det. John Gentile"
    },
    {
      "id": "nm0478762",
      "name": "Katherine LaNasa",
      "character": "Fran Hansen"
    },
    {
      "id": "nm1645352",
      "name": "Ryan O'Nan",
      "character": "Officer Gregg Baker"
    },
    {
      "id": "nm0242656",
      "name": "Kevin Dunn",
      "character": "Lt. Bob Jent"
    },
    {
      "id": "nm4771738",
      "name": "Connor Rockom",
      "character": "Hansen Son"
    },
    {
      "id": "nm0593664",
      "name": "Radha Mitchell",
      "character": "Allie Halcombe"
    },
    {
      "id": "nm0313902",
      "name": "Matt Gerald",
      "character": "Asst. Sgt. Ed Stauber"
    },
    {
      "id": "nm0005281",
      "name": "Jodi Lyn O'Keefe",
      "character": "Chelle Ringell"
    },
    {
      "id": "nm1265067",
      "name": "50 Cent",
      "character": "Pimp Clate Johnson       (as Curtis Jackson)"
    },
    {
      "id": "nm4472799",
      "name": "Olga Valentina",
      "character": "Jodi Brandon"
    },
    {
      "id": "nm0172370",
      "name": "Jason Collins",
      "character": "Det. Kyle Griston"
    },
    {
      "id": "nm0298281",
      "name": "Kurt Fuller",
      "character": "D.A. Pat Clives"
    },
    {
      "id": "nm2142745",
      "name": "Craig Blair",
      "character": "Inlet Inn Manager"
    },
    {
      "id": "nm3330819",
      "name": "Hillarie Putnam",
      "character": "Janice"
    },
    {
      "id": "nm0392197",
      "name": "Ron Holmstrom",
      "character": "Attorney Mike Rule"
    },
    {
      "id": "nm5380951",
      "name": "Leo Grinberg",
      "character": "Asst. D.A. Frank Rothschild"
    },
    {
      "id": "nm2804791",
      "name": "Katie Wallack",
      "character": "Bobby Morehead"
    },
    {
      "id": "nm4751279",
      "name": "Jeff Bell",
      "character": "Motel Officer"
    },
    {
      "id": "nm0048290",
      "name": "Brett Baker",
      "character": "Lt. Pat Kasnick"
    },
    {
      "id": "nm4295492",
      "name": "Mark Robokoff",
      "character": "Dan Boyds"
    },
    {
      "id": "nm4779128",
      "name": "Clara Danielle Engstrom",
      "character": "Halcombe Daughter"
    },
    {
      "id": "nm2197730",
      "name": "Leonardo Walker",
      "character": "Halcombe Son"
    },
    {
      "id": "nm4758299",
      "name": "Jill Bess",
      "character": "Janet"
    },
    {
      "id": "nm2351785",
      "name": "Teresa Koop",
      "character": "Bakery Beryl"
    },
    {
      "id": "nm2081900",
      "name": "Tim Lacatena",
      "character": "Trooper #2"
    },
    {
      "id": "nm5975364",
      "name": "Jonathan Minton",
      "character": "APD Officer #1"
    },
    {
      "id": "nm2486817",
      "name": "A.J. Seims",
      "character": "Duty Officer"
    },
    {
      "id": "nm5975365",
      "name": "Tom Skore",
      "character": "Dr. Dan Rodgers"
    },
    {
      "id": "nm2037338",
      "name": "Princess Lucaj",
      "character": "SA Nurse"
    },
    {
      "id": "nm5975366",
      "name": "Julie Hasquet",
      "character": "Reporter Sheila"
    },
    {
      "id": "nm5492387",
      "name": "Lauren Maxwell",
      "character": "Reporter #2"
    },
    {
      "id": "nm5182533",
      "name": "Sunny Alexander",
      "character": "Rosie"
    },
    {
      "id": "nm5975367",
      "name": "Christopher Murray",
      "character": "Hansen's Neighbor"
    },
    {
      "id": "nm4807662",
      "name": "Danielle Lyons Gonzales",
      "character": "Flirty Girl /              Good Times       (as Alexandra Gonzalez)"
    },
    {
      "id": "nm5975368",
      "name": "Shilo K. Thorp",
      "character": "Pimp Guy"
    },
    {
      "id": "nm5975369",
      "name": "Savanah Graham",
      "character": "Ward Nurse"
    },
    {
      "id": "nm3638025",
      "name": "Bradford James Jackson",
      "character": "Trooper #1"
    },
    {
      "id": "nm1055590",
      "name": "Lydia Hull",
      "character": "News Anchor"
    },
    {
      "id": "nm4776544",
      "name": "Seneca Paris",
      "character": "Skateland Girl"
    },
    {
      "id": "nm5975370",
      "name": "Amy Litson",
      "character": "Doorway Girl"
    },
    {
      "id": "nm0160542",
      "name": "Bostin Christopher",
      "character": "Bakery Friend Al"
    },
    {
      "id": "nm3807150",
      "name": "Joshua Ball",
      "character": "Trooper #3"
    },
    {
      "id": "nm3295260",
      "name": "Kiki Warren",
      "character": "Candy Striper"
    },
    {
      "id": "nm1183986",
      "name": "Mark Rhino Smith",
      "character": "Airport Security"
    },
    {
      "id": "nm5975371",
      "name": "Jekka Rodriguez",
      "character": "Skateland Worker"
    },
    {
      "id": "nm4774128",
      "name": "Taylor Ann Tracy",
      "character": "Sandy Halcombe"
    },
    {
      "id": "nm5975372",
      "name": "Lucy",
      "character": "Debbie's Dog"
    },
    {
      "id": "nm5975373",
      "name": "Kili",
      "character": "Husky"
    },
    {
      "id": "nm5975374",
      "name": "Kaya",
      "character": "Hansen's Dog"
    }
  ],
  "overview": "An Alaska State Trooper partners with a young woman who escaped the clutches of serial killer Robert Hansen to bring the murderer to justice. Based on actual events.",
  "storyline": "Alaska Trooper Jack Holcombe believes Robert Hansen is a serial killer who abducts young girls, tortures and sexually assaults them, then kills them. But Holcombe doesn't have enough evidence to get a search warrant for Hansen's premises. Holcombe knows that one victim, Cyndy Paulsen, somehow survived, so he decides to seek her help, but he finds that she's now a junkie with trust issues. Holcombe has to earn her trust; meanwhile, Hansen is still hunting and killing girls.",
  "plot": "The film opens in an Anchorage motel room in 1983, where 17-year-old Cindy Paulson (Vanessa Hudgens) is handcuffed and screaming for help. She is rescued by an Anchorage Police Department patrol officer. He takes Paulson to the hospital, and her clothes are kept for a rape kit. At an APD station, she explains to detectives that she was abducted and raped. Because she is a prostitute and lying about her age, the detectives do not believe her story, refusing to even look into the man whom she named as her abductor, Robert Hansen (John Cusack). They claim Hansen is an upstanding member of society, a family man who owns his own restaurant, and has alibis from three people.\n\nThe APD patrol officer who rescued Paulson is outraged that the detectives refuse to pursue Hansen. He surreptitiously photocopies information about the case and sends it to the Alaska State Troopers. Meanwhile, state trooper Jack Halcombe (Nicolas Cage) has been called to investigate a female body that was found in the bush, half eaten by bears. The police connect the case to other missing girls, who have disappeared after going to what they thought were legitimate photo shoots. With secret information from the APD officer, Halcombe connects the other cases to Paulson's and starts to put together a portrait of Hansen. Paulson details how Hansen kept her captive, and that she escaped from his car when he tried to transfer her to his bush plane.\n\nMeanwhile in Anchorage, Debbie Peters gets picked up by a man in an RV for a photo shoot. Later, Hansen eats a quiet dinner at home. His wife and children are away, and Hansen relaxes in his trophy room, casually ignoring Debbie who is chained to a post. She has urinated on the floor, and as she cleans up the mess with a towel, Hansen's neighbor enters the house to deliver a plate of food. Hansen warns Debbie not to scream and leaves the trophy room to greet his neighbor. Hansen then takes Debbie to the airport, where he orders her into his plane. After landing in a remote spot in the bush, Hansen frees Debbie, letting her run in a panic through the woods before he shoots her with a .223 caliber rifle. He steals her necklace before finishing her off with a handgun.\n\nHalcombe has a very difficult time assembling a case against Hansen. Because the evidence is circumstantial and Paulson is afraid to testify, the district attorney refuses to issue a search warrant. Paulson keeps falling back into the world of stripping and prostitution, despite Halcombe's efforts to keep her safe. At a strip club, while she is trying to sell lap dances, she notices Hansen trolling for a new victim. Their eyes meet, a chase ensues, and Paulson barely escapes. The encounter makes Hansen nervous, and he hires Carl Galenski to find and kill Paulson. Carl approaches Paulson's erstwhile pimp Clate Johnson (50 Cent) and offers to forgive his sizable debt if Clate turns Paulson over to him.\n\nHalcombe stakes out Hansen's house, causing Hansen to panic. Hansen gathers the evidence of his crimes, including the keepsakes from his victims, and flees with his son to the airport. He flies his plane to the bush and hides his keepsakes. Feeling that the chance to catch Hansen is slipping away, and with the victim count now at 17 girls, Halcombe forces the DA to issue a warrant. The search of Hansen's house yields no evidence, not even in his trophy room. Hansen agrees to be interrogated without a lawyer, but he is not yielding any new evidence. Halcombe arrests Hansen, but unless the police find new evidence, they will be unable to hold him.\n\nHalcombe orders a second search of Hansen's house, which turns up a hidden cache of guns, including the .223 caliber rifle used in many of the murders. Under police watch at a safe location, Paulson slips away and returns to her life of prostitution. Clate picks her up and delivers her to Carl. When Clate attempts to rob Carl, Paulson uses the opportunity to escape, with Carl in pursuit. After making a call to Halcombe, Paulson is almost killed by Carl, but Halcombe rescues her just in time.\n\nHalcombe uses a bracelet identical to one worn by one of the victims in order to trick Hansen into thinking the police have found where he hid the evidence in the bush. The bracelet, combined with the sight of Paulson in the interrogation room, enrages Hansen to the point that he incriminates himself. The epilogue states that Hansen confessed to the murder of 17 women and the kidnap and rape of another 30. He was charged with the abduction and rape of Cindy Paulson and the murders of Joanna Messina, Sherry Morrow, Paula Goulding and \"Eklutna Annie\". He was sentenced to 461 years plus life without parole. Robert Hansen died in 2014 at the age of 75. Only 11 of his victim's bodies were recovered. Jack Halcombe remained with the Alaska State Troopers and was promoted. He is now retired. Cindy Paulson now lives in the lower 48 and married with 3 children.\n\nThe film ends with a dedication and actual pictures of Hansen's victims.",
  "synopsis": "The film opens in an Anchorage motel room in 1983, where 17-year-old Cindy Paulson is handcuffed and screaming for help. She is rescued by an Anchorage Police Department patrol officer. He takes Paulson to the hospital, and her clothes are kept for a rape kit. At an APD station, she explains to detectives that she was abducted and repeatedly raped. Because she is a prostitute and lying about her age, the detectives don't believe her story, refusing to even look into the man she named as her abductor, Robert Hansen. They claim Hansen is an upstanding member of society, a family man who owns his own restaurant, and has alibis from three people.The APD patrol officer who rescued Paulson is outraged that the detectives refuse to pursue Hansen. He surreptitiously photocopies information about the case and sends it to the Alaska State Police. Meanwhile, state trooper Jack Halcombe has been called to investigate a female body that was found in the bush, half eaten by bears. The police connect the case to other missing girls, who have disappeared after going to what they thought were legitimate photo shoots. With secret information from the APD officer, Halcombe connects the other cases to Paulson's and starts to put together a portrait of Hansen. Paulson details how Hansen kept her captive, and that she escaped from his car when he tried to transfer her to his bush plane.Meanwhile in Anchorage, Debbie Peters gets picked up by a man in an RV for a photo shoot. Later, Hansen eats a quiet dinner at home. His wife and children are away, and Hansen relaxes in his trophy room, casually ignoring Debbie who is chained to a post. She has urinated on the floor, and as she cleans up the mess with a towel, Hansen's neighbor enters the house to deliver a plate of food. Hansen warns Debbie not to scream and leaves the trophy room to greet his neighbor. Hansen then takes Debbie to the airport, where he orders her into his plane. After landing in a remote spot in the bush, Hansen frees Debbie, letting her run in a panic through the woods before he shoots her with a .223 caliber rifle. He steals her necklace before finishing her off with a handgun.Halcombe has a very difficult time assembling a case against Hansen. Because the evidence is circumstantial and Paulson is afraid to testify, the District attorney refuses to issue a search warrant. Paulson keeps falling back into the world of stripping and prostitution, despite Halcombe's efforts to keep her safe. At a strip club, while she is trying to sell lap dances, she notices Hansen trolling for a new victim. Their eyes meet, a chase ensues, and Paulson barely escapes. The encounter makes Hansen nervous, and he hires Carl Galenski to find and kill Paulson. Carl approaches Paulson's erstwhile pimp Clate Johnson (50 Cent) and offers to forgive his sizable debt if Clate turns Paulson over to him.Halcombe stakes out Hansen's house, causing Hansen to panic. Hansen gathers the evidence of his crimes, including the keepsakes from his victims, and flees with his son to the airport. He flies his plane to the bush and hides his keepsakes. Feeling that the chance to catch Hansen is slipping away, and with the victim count now at 17 girls, Halcombe forces the DA to issue a warrant. The search of Hansen's house yields no evidence, not even in his trophy room. Hansen agrees to be interrogated without a lawyer, but he is not yielding any new evidence. Halcombe arrests Hansen, but unless the police find new evidence, they will be unable to hold him.Halcombe orders a second search of Hansen's house, which turns up a hidden cache of guns, including the .223 caliber rifle used in many of the murders. Under police watch at a safe location, Paulson slips away and returns to her life of prostitution. Clate picks her up and delivers her to Carl. When Clate attempts to rob Carl, Paulson uses the opportunity to escape, with Carl in pursuit. After making a call to Halcombe, Paulson is almost killed by Carl, but Halcombe rescues her just in time.Halcombe uses a bracelet identical to one worn by one of the victims in order to trick Hansen into thinking the police have found where he hid the evidence in the bush. The bracelet, combined with the sight of Paulson in the interrogation room, enrages Hansen to the point that he incriminates himself. The epilogue states that Hansen confessed to the murder of 17 women and the kidnap and rape of another 30. He was charged with the abduction and rape of Cindy Paulson and the murders of Joananna Messina, Sherry Morrow, Paula Goulding and \"Eklutna Annie.\" He was sentenced to 461 years plus life without parole. Robert Hansen died in 2014 at the age of 75. Only 11 of his victims bodies were recovered. Jack Halcombe remained with the Alaska State Trooper and was promoted. He is now retired. Cindy Paulson now lives in the lower 48 and married with 3 children.The film ends with a dedication and actual pictures of Hansen's victims."
}