{
  "imdb_id": "tt2071571",
  "tmdb_id": "226948",
  "douban_id": null,
  "title": "Scarecrow (TV Movie 2013)",
  "genres": [
    "Action",
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "86 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.0,
  "director": [
    {
      "id": "nm0934135",
      "name": "Sheldon Wilson"
    }
  ],
  "writer": [
    {
      "id": "nm1054974",
      "name": "Rick Suvalle",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0000327",
      "name": "Lacey Chabert",
      "character": "Kristen"
    },
    {
      "id": "nm0242903",
      "name": "Robin Dunne",
      "character": "Aaron"
    },
    {
      "id": "nm1740381",
      "name": "Nicole Muñoz",
      "character": "Maria"
    },
    {
      "id": "nm1243009",
      "name": "Brittney Wilson",
      "character": "Beth"
    },
    {
      "id": "nm2473790",
      "name": "Carlo Marks",
      "character": "Eddie"
    },
    {
      "id": "nm2835897",
      "name": "Reilly Dolman",
      "character": "Daevon"
    },
    {
      "id": "nm4256622",
      "name": "Iain Belcher",
      "character": "Calvin"
    },
    {
      "id": "nm2113653",
      "name": "Richard Harmon",
      "character": "Tyler"
    },
    {
      "id": "nm2324838",
      "name": "Julia Maxwell",
      "character": "Nicki"
    },
    {
      "id": "nm2026124",
      "name": "Kevin O'Grady",
      "character": "Officer Morris"
    },
    {
      "id": "nm0913682",
      "name": "Jerry Wasserman",
      "character": "Murphy"
    },
    {
      "id": "nm1197751",
      "name": "Lanie McAuley",
      "character": "Marcy"
    },
    {
      "id": "nm3485889",
      "name": "Keenan Tracey",
      "character": "Chad"
    }
  ],
  "overview": "For generations, it was an urban legend that lived in the nightmares of children. Now, the season to rejuvenate the tale will revive a town's darkest fears. With the Scarecrow Festival on the horizon, school teacher Aaron Harris is doling out punishment for six students serving detention. Their task: help Aaron's girlfriend Amanda fix her family farm before it's sold. But the cornfields circling the farm come with a legend and Tyler takes macabre delight in recounting the tale: It never sleeps, it never dies, it can't be stopped, hear their cries.",
  "storyline": "For generations, it was an urban legend that lived in the nightmares of children. Now, the season to rejuvenate the tale will revive a town's darkest fears. With the Scarecrow Festival on the horizon, school teacher Aaron Harris is doling out punishment for six students serving detention, including the moody Tyler, Goth girl Nikki, wrestling team captain Daevon, and straight-A student Jun. Their task: help Aaron's ex-girlfriend Kristen fix her family farm before it's sold. But the cornfields circling the farm come with a legend-and Tyler takes macabre delight in recounting the tale: It never sleeps, it never dies, it can't be stopped, hear their cries. The Scarecrow lives to kill us all. Keep it buried in the fall... When the kids play a terrifying game of cat and mouse in the cornfield with what they believe is a wild animal, Kristen tries to convince them that the Scarecrow is a very real creature of fierce strength and power, rejuvenated by the blood of its prey-and proof comes all...",
  "plot": null,
  "synopsis": null
}