{
  "imdb_id": "tt2083271",
  "tmdb_id": "75107",
  "douban_id": null,
  "title": "Nirvana: Live at the Paramount (2011)",
  "genres": [
    "Documentary",
    "Music"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "72 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.7,
  "director": [
    {
      "id": "nm0705044",
      "name": "Mark Racco"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm0001052",
      "name": "Kurt Cobain",
      "character": "Himself"
    },
    {
      "id": "nm0342970",
      "name": "Dave Grohl",
      "character": "Himself       (as David Grohl)"
    },
    {
      "id": "nm1110321",
      "name": "Nirvana",
      "character": "Themselves"
    },
    {
      "id": "nm0637218",
      "name": "Krist Novoselic",
      "character": "Himself"
    }
  ],
  "overview": "Recorded in Seatle, WA on Halloween Night, 1991, Live at the Paramount is the only known Nirvana live show recorded on 16mm film. Now released to conside with the 20th anniversary of the release of Nirvana's watershed album, 'Nevermind', famed documentarian and music video director Lance Bangs has been personally involved in the restoration of the film and the result is, according to Nirvana bassist Krist Novoselic, \"a pretty good representation of [the] band\" in their heyday. Released September 27, 2011, the DVD and Blu-Ray contains the complete concert along with newly remastered stereo and 5.1 surround soundtracks. Setlist : Jesus Doesn't Want Me For A Sunbeam * Aneurysm * Drain You * School * Floyd the Barber * Smells Like Teen Spirit * About A Girl * Polly * Breed * Silver * Love Buzz * Lithium * Been A Son * Negative Creep * On A Plain * Blew * Rape Me * Territorial Pissings * Endless, Nameless",
  "storyline": "Five weeks after releasing what was to become the seminal album of a generation, Nirvana was on a nationwide club and small theatre tour that brought them to Seattle's Paramount Theatre for a very special Halloween 1991 homecoming show. Launching the nineteen song set with a brilliant cover of the Vaselines' \"Jesus Doesn't Want Me For A Sunbeam,\" the band tears through Nevermind hits like \"Smells Like Teen Spirit,\" \"Lithium\" and \"Breed,\" plus earlier favorites like \"School,\" \"Love Buzz\" and \"About A Girl\" and a very early version of \"Rape Me.\" The Paramount concert is the only show ever shot of the band on 16mm film and has been mixed in 5.1 surround sound and stereo from the original multi-tracks. Witness the complete concert for the first time ever.",
  "plot": null,
  "synopsis": null
}