{
  "imdb_id": "tt2100376",
  "tmdb_id": "107227",
  "douban_id": null,
  "title": "23:59 (2011)",
  "genres": [
    "Horror"
  ],
  "country": "Singapore",
  "version": [
    {
      "runtime": "78 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.9,
  "director": [
    {
      "id": "nm2379734",
      "name": "Gilbert Chan"
    }
  ],
  "writer": [
    {
      "id": "nm2379734",
      "name": "Gilbert Chan",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4754277",
      "name": "Tedd Chan",
      "character": "Tan"
    },
    {
      "id": "nm4754105",
      "name": "Stella Chung",
      "character": "Shirley"
    },
    {
      "id": "nm1042831",
      "name": "Philip Hersh",
      "character": "Boss       (voice)"
    },
    {
      "id": "nm4753839",
      "name": "Henley Hii",
      "character": "Jeremy"
    },
    {
      "id": "nm4753619",
      "name": "Lawrence Koh",
      "character": "Dragon"
    },
    {
      "id": "nm4753640",
      "name": "Tommy Kuan",
      "character": "Lim"
    },
    {
      "id": "nm4753679",
      "name": "Josh Lai",
      "character": "Chester"
    },
    {
      "id": "nm0497834",
      "name": "Mark Lee",
      "character": "Sergeant Kuah"
    },
    {
      "id": "nm4754139",
      "name": "Susan Leong",
      "character": "Yi Gu"
    },
    {
      "id": "nm2205575",
      "name": "Benjamin Lim",
      "character": "Captain Hong"
    }
  ],
  "overview": "An army recruit was found dead during a 24km road march. After the death of the recruit, strange things started to happen, haunting all the soldiers in the barracks (Imdb.com).",
  "storyline": "A rumor had been circulating like wild fire amongst the soldiers. A mad woman living on the island had died at the exact hour of 23:59, and it is believed that her spirit had returned to haunt the soldiers at the exact same time. One of the recruits, Tan, the introverted platoon outcast, is adamant that he will be the next victim of the mad woman's spirit. He tries to convince his buddy Jeremy that the woman's spirit has been visiting him every night. Jeremy laughs it off and claims that there are no such things as ghosts in this world. They only exist because of Tan's overactive imagination. However, during the 30 km road march for the platoon in the forest, Tan was found dead by the river, with his limbs contorted in a strange way and an expression of deep fear on his face. Overwhelmed with guilt, Jeremy decides to investigate Tan's death, convinced that it was not an accident as what the military officers believe. Little does he know that the truth behind Tan's death will unearth a...",
  "plot": null,
  "synopsis": null
}