{
  "imdb_id": "tt2124074",
  "tmdb_id": "84166",
  "douban_id": null,
  "title": "28 Hotel Rooms (2012)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "82 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm0743671",
      "name": "Matt Ross"
    }
  ],
  "writer": [
    {
      "id": "nm0743671",
      "name": "Matt Ross",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0582149",
      "name": "Chris Messina",
      "character": "Man"
    },
    {
      "id": "nm1677477",
      "name": "Marin Ireland",
      "character": "Woman"
    },
    {
      "id": "nm1219374",
      "name": "Robert Deamer",
      "character": "Bartender       (as Robert E. Deamer Jr.)"
    },
    {
      "id": "nm7585487",
      "name": "Anne H. Wilson",
      "character": "Bar Patron"
    },
    {
      "id": "nm4021484",
      "name": "Yaitza Rivera",
      "character": "Bar Patron       (as Yaitza Rivera Dimeo)"
    },
    {
      "id": "nm7161938",
      "name": "Paul Day",
      "character": "Bar Patron"
    },
    {
      "id": "nm4023942",
      "name": "Marine Buton",
      "character": "Bar Patron"
    },
    {
      "id": "nm8366802",
      "name": "Matthew L. Oliva",
      "character": "Bar Patron"
    },
    {
      "id": "nm3269305",
      "name": "Brett Collier",
      "character": "Bar Patron       (as Brett Collieb)"
    },
    {
      "id": "nm9944069",
      "name": "Justin Stevenson",
      "character": "Hotel Guest"
    },
    {
      "id": "nm8257562",
      "name": "Brandon Dexter",
      "character": "Hotel Guest"
    },
    {
      "id": "nm7585490",
      "name": "Courtney Krings",
      "character": "Hotel Guest"
    },
    {
      "id": "nm5656932",
      "name": "Jomar Gomez",
      "character": "Hotel Guest"
    }
  ],
  "overview": "While traveling for work in a city far from their homes, a novelist and a corporate accountant find themselves in bed together. Although she’s married, and he’s seeing someone, their intense attraction turns a one-night stand into an unexpected relationship and a respite from the obligations of daily life. Through a series of moments – some profound, some silly, some intensely intimate – we see a portrait of an evolving relationship that could become the most significant one of their lives.",
  "storyline": "Spanning several years involving two persons, a young man (Chris Messina) and a young woman (Marin Ireland), who have a one night stand in a hotel room. Despite going their different paths, the man, a struggling writer, and the woman, an accountant, meet over the next several years in various different hotel rooms across the USA while they travel on business. Despite they are both involved with different people, they find their romantic tryst a getaway from their everyday lives. But as they both mature and grow apart, will they ever learn that they may be soul mates really meant for each other and their secret rendezvous for sex is something more?",
  "plot": "In 1989, scientist Hank Pym resigns from S.H.I.E.L.D. after discovering their attempt to replicate his Ant-Man shrinking technology. Believing the technology is dangerous, Pym vows to hide it as long as he lives.\n\nIn the present day, Pym's estranged daughter, Hope van Dyne, and former protégé, Darren Cross, have forced him out of his company, Pym Technologies. Cross is close to perfecting a shrinking suit of his own, the Yellowjacket, which horrifies Pym.\n\nUpon his release from prison, well-meaning thief Scott Lang moves in with his old cellmate, Luis. Lang visits his daughter Cassie unannounced and is rebuked by his former wife Maggie and her police-detective fiancé, Paxton, for not providing child support. Unable to hold a job because of his criminal record, Lang agrees to join Luis' crew and commit a burglary. Lang breaks into a house and cracks its safe, but only finds what he believes to be an old motorcycle suit, which he takes home. After trying the suit on, Lang accidentally shrinks himself to the size of an insect. Terrified by the experience, he returns the suit to the house, but is arrested on the way out. Pym, the homeowner, visits Lang in jail and smuggles the suit into his cell to help him break out.\n\nPym, who manipulated Lang through an unknowing Luis into stealing the suit as a test, wants Lang to become the new Ant-Man to steal the Yellowjacket from Cross. Having been spying on Cross after discovering his intentions, van Dyne helps Pym train Lang to fight and to control ants. While van Dyne harbors resentment towards Pym about her mother Janet's death, he reveals that Janet, known as the Wasp, disappeared into a subatomic quantum realm while disabling a Soviet nuclear missile. Pym warns Lang that he could suffer a similar fate if he overrides his suit's regulator. They send him to steal a device that will aid their heist from the Avengers' headquarters, where he briefly fights Sam Wilson.\n\nCross perfects the Yellowjacket and hosts an unveiling ceremony at Pym Technologies' headquarters. Lang, along with his crew and a swarm of flying ants, infiltrates the building during the event, sabotages the company's servers, and plants explosives. When he attempts to steal the Yellowjacket, he, along with Pym and Hope, are captured by Cross, who intends to sell both the Yellowjacket and Ant-Man suits to Hydra. Lang breaks free and he and Hope dispatch most of the Hydra agents, though one flees with a vial of Cross' particles and Pym is shot. Lang pursues Cross, while the explosives detonate, imploding the building as Pym and van Dyne escape.\n\nCross dons the Yellowjacket and attacks Lang before Lang is arrested by Paxton. Cross takes Cassie hostage to lure Lang into another fight. Lang overrides the regulator and shrinks to subatomic size to penetrate Cross' suit and sabotage it to shrink uncontrollably, killing Cross. Lang disappears into the quantum realm but manages to reverse the effects and returns to the macroscopic world. Out of gratitude for Lang's heroism, Paxton covers for Lang to keep him out of prison. Seeing that Lang survived and returned from the quantum realm, Pym wonders if his wife is alive as well. Later, Lang meets up with Luis, who tells him that Wilson is looking for him.\n\nIn a mid-credits scene, Pym shows van Dyne a new Wasp prototype suit and offers it to her. In a post-credits scene, Wilson and Steve Rogers have Bucky Barnes in their custody. Unable to contact Tony Stark because of \"the accords\",[a] Wilson mentions that he knows someone who can help.",
  "synopsis": null
}