{
  "imdb_id": "tt2147277",
  "tmdb_id": "127542",
  "douban_id": null,
  "title": "Escape (2012)",
  "genres": [
    "Drama",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.6,
  "director": [
    {
      "id": "nm1164403",
      "name": "Paul Emami"
    }
  ],
  "writer": [
    {
      "id": "nm0621665",
      "name": "Andrea Gyertson Nasfell",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0001367",
      "name": "C. Thomas Howell",
      "character": "Paul Jordan"
    },
    {
      "id": "nm0722636",
      "name": "John Rhys-Davies",
      "character": "Malcom Andrews"
    },
    {
      "id": "nm2085114",
      "name": "Anora Lyn",
      "character": "Kim Jordan"
    },
    {
      "id": "nm0409410",
      "name": "Prinya Intachai",
      "character": "Chakan       (as Prinya Intacha)"
    },
    {
      "id": "nm5302579",
      "name": "Khanchit Chompoos",
      "character": "The Captain"
    },
    {
      "id": "nm5302653",
      "name": "Chayut Buanar",
      "character": "Rarong"
    },
    {
      "id": "nm5302584",
      "name": "Wathana Suksongroh",
      "character": "Lek"
    },
    {
      "id": "nm0095465",
      "name": "Sahajak Boonthanakit",
      "character": "Dr. Kiet       (as Sahajak Boonthanaki)"
    },
    {
      "id": "nm7408464",
      "name": "Puttaya Chaimongkolepetc",
      "character": "Somsri Andrews"
    },
    {
      "id": "nm4334336",
      "name": "Chanicha Shindejanichakul",
      "character": "Kanya       (as Chanicha Shindejanichaku)"
    },
    {
      "id": "nm1758782",
      "name": "Tanapol Chuksrida",
      "character": "Police Inspector       (as Tanapol Chuksrid)"
    },
    {
      "id": "nm4702693",
      "name": "Celicia Arnold",
      "character": "Michelle       (as Celicia 'Terry' Arnold)"
    },
    {
      "id": "nm1753855",
      "name": "Ken Streutker",
      "character": "Steve       (as Ken Strutker)"
    },
    {
      "id": "nm3432378",
      "name": "Somprasong Vejasilp",
      "character": "Old Thai Man"
    },
    {
      "id": "nm5302648",
      "name": "Nophand Chantharasorn",
      "character": "Street Boy"
    },
    {
      "id": "nm3673624",
      "name": "Noppawong Khamtonwong",
      "character": "Clerk"
    },
    {
      "id": "nm4458982",
      "name": "Mary Totten",
      "character": "Sue Griggs"
    }
  ],
  "overview": "Husband and wife doctors Paul and Kim Jordan need a drastic change. Distraught by the inexplicable death of their baby, Paul (C. Thomas Howell) convinces Kim to abandon their American lives and join a medical mission in Thailand. It seems to be just the distraction they need, until the day Paul is kidnapped by human traffickers who need a surgeon to operate on their wounded leader. Kim is left alone in a strange country, trying desperately to find her husband with no proof of what happened. While captive on the gangs' secluded island, Paul is caged with Malcolm Andrews (John Rhys-Davies), an Englishman being held for ransom. With nothing to do but talk, the two men quickly clash over philosophy, as Malcolm relies on a bold faith in God and Paul believes no god would allow these evils to happen in the world. Paul takes another hit when he finds his patient's condition much worse than he can handle on his own in such primitive conditions... Written by Anonymous  (IMDB.com).",
  "storyline": "Husband and wife doctors Paul and Kim Jordan need a drastic change. Distraught by the inexplicable death of their baby, Paul (C. Thomas Howell) convinces Kim to abandon their American lives and join a medical mission in Thailand. It seems to be just the distraction they need, until the day Paul is kidnapped by human traffickers who need a surgeon to operate on their wounded leader. Kim is left alone in a strange country, trying desperately to find her husband with no proof of what happened. While captive on the gangs' secluded island, Paul is caged with Malcolm Andrews (John Rhys-Davies), an Englishman being held for ransom. With nothing to do but talk, the two men quickly clash over philosophy, as Malcolm relies on a bold faith in God and Paul believes no god would allow these evils to happen in the world. Paul takes another hit when he finds his patient's condition much worse than he can handle on his own in such primitive conditions. With his value to the criminals plummeting, the ...",
  "plot": "Ray Breslin is a former prosecutor who co-owns Breslin-Clark, a Los Angeles–based security firm specializing in testing the reliability of maximum security prisons. He spends his life getting into prisons to study their designs and the guards' habits to find and exploit their weaknesses, thus enabling him to escape without a hitch or a victim. His goal is to ensure that criminals sent to prison stay inside by eliminating the weakness of every prison; Breslin's wife and child were murdered by an escaped convict he had successfully prosecuted.\n\nBreslin and his business partner Lester Clark are offered a multimillion-dollar deal by CIA agent Jessica Mayer to test a top-secret, off-grid prison housing disappeared persons and see if it is escape-proof. However, this time around, he and his colleagues are not allowed to know where the prison is, as this helps minimize the risk of outside help when escaping. Breslin goes against all his own rules and agrees to the deal, allowing himself to be captured in New Orleans, Louisiana, under the guise of a Spanish terrorist named \"Anthony Portos.\" However, the plan goes awry when his captors remove a tracking microchip from his arm and drug him on the way to the prison, which stops his colleagues from knowing where he has been taken.\n\nBreslin wakes up in a complex of glass cells with no outside windows to indicate the prison's location. He discovers that he has been played when he realizes the warden is not the one he is supposed to meet. He meets fellow inmate Emil Rottmayer, who works for a man named Victor Mannheim who is portrayed as a modern-day Robin Hood. The duo stage a fight for Breslin to study the solitary confinement cell, which uses high-powered halogen lights to disorient and dehydrate prisoners. Seeing that the cell floors are made of steel, but the rivets are aluminium, Breslin has Rottmayer acquire a metal plate from Warden Hobbes's office floor before the two of them and Muslim inmate Javed are once again thrown into confinement. Using the metal plate, Breslin focuses the reflection from the lights to heat the steel around the rivets, shearing the rivets when the steel expands, and pops open the floor panel to reveal a passageway below. He discovers that the prison is inside a cargo ship in the middle of the ocean, making a simple escape impossible. Breslin and Rottmayer continue to study the complex by learning the guards' daily routines. However, Hobbes reveals to Breslin that he is aware of his identity, and with chief security officer Drake watching him, he wants to ensure that Breslin spends the rest of his life in prison. Breslin offers Hobbes information on Mannheim from Rottmayer in exchange for being released; Hobbes agrees.\n\nBreslin feeds Hobbes false information about Mannheim. Meanwhile, Breslin's colleagues Abigail Ross and Hush grow suspicious of Clark when Breslin's paycheck for the job is frozen. They discover from hacked documents that the prison, codenamed \"The Tomb,\" is owned by a for-profit organization linked to a privately owned security provider. Meanwhile, Clark is in contact with Hobbes about keeping Breslin imprisoned. Rottmayer has Javed convince Hobbes that he is double crossing them, and as payment he only wants to be allowed up on deck to do his nightly prayer. When up on deck, Javed uses a makeshift sextant to get the ship's latitude. Using the latitude and weather, Breslin and Rottmayer deduce that they are in the Atlantic Ocean near Morocco. Breslin visits the infirmary of Dr. Kyrie and convinces him to help him and Rottmayer escape by sending an email to Mannheim. Breslin then transmits a false tap code message from his cell, giving Hobbes the impression that a riot will occur in cell block C. With the majority of the security stationed at cell block C, Javed instigates a riot at cell block A, giving him, Breslin, and Rottmayer time to run toward the deck while a lockdown is initiated. Breslin kills Drake, but Javed is shot dead by Hobbes and his men during their escape. Breslin goes to the engine room to shut down the electrical systems, giving Rottmayer time to open the deck hatch before the backup generators come online while a helicopter sent by Mannheim engages in a gunfight with the ship's crew. Rottmayer boards the helicopter while Breslin is flushed to the bottom of the ship by the automated water system when Hobbes has the main electrical system rebooted. The helicopter picks up Breslin, but when Hobbes starts shooting at them, Breslin kills the warden by shooting and blowing up a group of oil barrels.\n\nThey land on a beach in Morocco, where Rottmayer reveals that he is actually Mannheim, Mayer is his daughter, \"Portos\" was a codeword used to alert Mannheim that Breslin was an ally, and Hobbes was originally unaware that Breslin's cover story was fake. Later, on a Moroccan beach, Ross informs Breslin that they discovered Clark was offered a $5 million annual salary to become CEO of the security company, should Breslin's imprisonment prove that the ship is escape-proof. Clark had fled, but Hush tracked him in Miami, and locked him in a container aboard an MSC cargo ship headed for an unknown destination.",
  "synopsis": null
}