{
  "imdb_id": "tt2182972",
  "tmdb_id": "244783",
  "douban_id": null,
  "title": "Song One (2014)",
  "genres": [
    "Drama",
    "Music"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "86 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm2293399",
      "name": "Kate Barker-Froyland"
    }
  ],
  "writer": [
    {
      "id": "nm2293399",
      "name": "Kate Barker-Froyland",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0004266",
      "name": "Anne Hathaway",
      "character": "Franny"
    },
    {
      "id": "nm0005460",
      "name": "Mary Steenburgen",
      "character": "Karen"
    },
    {
      "id": "nm1926865",
      "name": "Johnny Flynn",
      "character": "James Forester"
    },
    {
      "id": "nm3860305",
      "name": "Lola Kirke",
      "character": "Rema"
    },
    {
      "id": "nm1511685",
      "name": "Sarah Steele",
      "character": "iPod autograph girl"
    },
    {
      "id": "nm3495649",
      "name": "Sharon Van Etten",
      "character": "Herself"
    },
    {
      "id": "nm4050835",
      "name": "Li Jun Li",
      "character": "James Forester's Journalist"
    },
    {
      "id": "nm3008160",
      "name": "Kitty Crystal",
      "character": "James' Friend       (as Crystal Lonneberg)"
    },
    {
      "id": "nm4101208",
      "name": "Ben Rosenfield",
      "character": "Henry"
    },
    {
      "id": "nm1921376",
      "name": "Gideon Glick",
      "character": "Everett"
    },
    {
      "id": "nm0859824",
      "name": "Al Thompson",
      "character": "Andy"
    },
    {
      "id": "nm3185990",
      "name": "Grace Rex",
      "character": "Bride"
    },
    {
      "id": "nm2001061",
      "name": "Shawn Parsons",
      "character": "Roadie"
    },
    {
      "id": "nm0416838",
      "name": "Peter Francis James",
      "character": "Neurosurgeon"
    },
    {
      "id": "nm6219142",
      "name": "Emily McKinley Hill",
      "character": "Henry's Friend"
    },
    {
      "id": "nm4984062",
      "name": "Jessamine Kelley",
      "character": "Tess"
    },
    {
      "id": "nm4443462",
      "name": "Steven Anderson",
      "character": "Merch Guy"
    },
    {
      "id": "nm1745236",
      "name": "Roderick Hill",
      "character": "The Groom"
    },
    {
      "id": "nm2904710",
      "name": "Katrina E. Perkins",
      "character": "Hippie Woman       (as Katrina Elizabeth Perkins)"
    },
    {
      "id": "nm4192143",
      "name": "Monna Sabouri",
      "character": "Bedouin Bride"
    },
    {
      "id": "nm4677506",
      "name": "Alan Davis",
      "character": "Concert Fan"
    },
    {
      "id": "nm2394191",
      "name": "Steve Antonucci",
      "character": "Bartender"
    },
    {
      "id": "nm4843086",
      "name": "Cass Dillon",
      "character": "Paul"
    },
    {
      "id": "nm4719895",
      "name": "Lavinia Jones Wright",
      "character": "College Girl"
    },
    {
      "id": "nm5078729",
      "name": "Jonah Larrama",
      "character": "Hospital visitor"
    },
    {
      "id": "nm5356479",
      "name": "Stefano Villabona",
      "character": "Rock Concert Goer"
    },
    {
      "id": "nm7785535",
      "name": "Johnathan Pratt",
      "character": "Henry's roommate"
    },
    {
      "id": "nm6051172",
      "name": "Elizabeth Ziman",
      "character": "Accordion Player"
    },
    {
      "id": "nm1463057",
      "name": "Walter DeForest",
      "character": "Handlebar Moustache Doorman"
    },
    {
      "id": "nm5758168",
      "name": "J. Michael Kent",
      "character": "Tattooed Hipster"
    },
    {
      "id": "nm6405226",
      "name": "Arun Bhatt",
      "character": "Taxi Cab Driver       (credit only)"
    },
    {
      "id": "nm7063745",
      "name": "Ariana Ionescu",
      "character": "Concert Dancer"
    },
    {
      "id": "nm2397455",
      "name": "Susan Millard",
      "character": "Nurse"
    }
  ],
  "overview": "Estranged from her family, Franny returns home when an accident leaves her brother comatose. Retracing his life as an aspiring musician, she tracks down his favorite musician, James Forester. Against the backdrop of Brooklyn’s music scene, Franny and James develop an unexpected relationship and face the realities of their lives.",
  "storyline": "Estranged from her family, Franny returns home when an accident leaves her brother comatose. Retracing his life as an aspiring musician, she tracks down his favorite musician, James Forester. Against the backdrop of Brooklyn's music scene, Franny and James develop an unexpected relationship and face the realities of their lives.",
  "plot": "After being rescued from the destroyed arena in the 75th Hunger Games, Katniss Everdeen, along with fellow tributes Beetee and Finnick Odair, are taken to District 13, now an underground district isolated from Panem that has been spearheading the rebellion. There she is reunited with her mother and sister Prim. While recuperating, she is introduced to President Alma Coin, the rebel leader, and is told that her actions in the arena sparked riots and strikes against the Capitol. Coin asks her to become the \"Mockingjay\"—the symbol of the rebellion—as part of their \"hearts and minds\" strategy but Katniss declines. After seeing how Peeta is being manipulated by Capitol state television to quell the rebellion, Katniss reluctantly agrees to become Coin's Mockingjay on the condition that Peeta and the other captured victors will be rescued and pardoned at the earliest opportunity at Coin's initial admonition, who had originally planned to have Peeta, Enobaria, Johanna and Annie tried for war crimes.\n\nAfter Haymitch notes that Katniss thrives on spontaneity, she meets her film team (led by Capitol escapee Cressida), is dressed up in a specially-designed outfit, and is given Effie Trinket as a stylist and close friend Gale as a bodyguard. They go out to District 8 to visit a hospital, but as the visit concludes, a Capitol bombing squadron arrives and bombs the hospital, killing everyone inside. In her rage, Katniss gives a rousing speech to the camera, which is broadcast when Beetee hijacks the Capitol's news feed. After it is broadcast, strikers in District 7 kill an entire team of Peacekeepers with hidden land mines, with them climbing trees to safety.\n\nAfter seeing a weakened Peeta on a TV propo (propaganda shots) the team return to District 12, where Gale reports on District 12's destruction; Katniss is filmed singing \"The Hanging Tree\". Soon after, hundreds of protesters in District 5, singing the same anthem, launch a suicidal human wave attack against a hydroelectric dam that is the Capitol's primary source of electricity. The attack destroys the dam, and causes a power cut in the Capitol, forcing the Capitol to revert to backup power generators and weakening their ability to broadcast propaganda.\n\nThat night, Katniss watches Peeta being interviewed by Caesar Flickerman, the Games' former presenter, when Coin and Beetee hijack the signal to air a clip of Katniss. After seeing it, Peeta shouts a warning that the Capitol is about to attack District 13. Coin orders a mass evacuation into deep underground shelters and the facility survives the attack unharmed. Upon emerging, Katniss discovers the area littered with white roses, and realizes President Snow sent them to taunt her, and presumes that he will kill Peeta. As Peeta's warning gave the District an additional eight minutes evacuation time, Coin dispatches an elite special forces team, which includes Gale, to rescue him, along with Johanna Mason, and Annie Cresta, the remaining Victors, from their prison in the Capitol's Tribute center. Finnick distracts the Capitol by narrating a propo revealing of how he had been forced by Snow to sell himself for the Capitol, like other attractive tributes. Despite Snow taunting Katniss of his awareness of the rescue, it is successful with surprisingly minimum opposition from Capitol, indicating that they have reduced the security on purpose. When Katniss goes to greet Peeta, he unexpectedly attacks and strangles her into unconsciousness, before being knocked unconscious himself by Boggs.\n\nKatniss wakes up in the medical facility, and is informed that Peeta has been \"hijacked\"&#160;— a form of physical/mental torture in which he is brainwashed into wanting to kill Katniss by associating memories of her with the psychological terror created by tracker jacker venom, which explains why the Capitol allowed Boggs's team to escape. Peeta is restrained to a bed and placed in solitary confinement, while a serum is being developed to reverse the hijacking effects. Meanwhile, Coin announces that the Victors have been rescued; their next objective is the Capitol's principal military stronghold in the ravines on District 2. The film ends with Katniss looking over at Peeta as he thrashes around to try to escape from his bindings.",
  "synopsis": null
}