{
  "imdb_id": "tt2115295",
  "tmdb_id": "121872",
  "douban_id": null,
  "title": "Ginger & Rosa (2012)",
  "genres": [
    "Drama"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.3,
  "director": [
    {
      "id": "nm0006845",
      "name": "Sally Potter"
    }
  ],
  "writer": [
    {
      "id": "nm0006845",
      "name": "Sally Potter",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0376716",
      "name": "Christina Hendricks",
      "character": "Natalie"
    },
    {
      "id": "nm0562003",
      "name": "Jodhi May",
      "character": "Anoushka"
    },
    {
      "id": "nm0005273",
      "name": "Alessandro Nivola",
      "character": "Roland"
    },
    {
      "id": "nm5461862",
      "name": "Luke Cloud",
      "character": "Rosa's Father"
    },
    {
      "id": "nm5790149",
      "name": "Poppy Bloor",
      "character": "Young Ginger"
    },
    {
      "id": "nm5790150",
      "name": "Magdalene Mountford",
      "character": "Young Rosa"
    },
    {
      "id": "nm1102577",
      "name": "Elle Fanning",
      "character": "Ginger"
    },
    {
      "id": "nm0519546",
      "name": "Ray Lonnen",
      "character": "Radio Announcer"
    },
    {
      "id": "nm2129444",
      "name": "Alice Englert",
      "character": "Rosa"
    },
    {
      "id": "nm1309883",
      "name": "Brock Everitt-Elwick",
      "character": "Beatnik"
    },
    {
      "id": "nm5790743",
      "name": "Max Scully",
      "character": "Beatnik"
    },
    {
      "id": "nm2432897",
      "name": "Marcus Shakesheff",
      "character": "Teddy Boy in Car"
    },
    {
      "id": "nm5790744",
      "name": "Charlie Smith",
      "character": "Teddy Boy in Car"
    },
    {
      "id": "nm5505672",
      "name": "Rupert Rixon",
      "character": "Boy on Beach"
    },
    {
      "id": "nm0001758",
      "name": "Timothy Spall",
      "character": "Mark"
    },
    {
      "id": "nm2959893",
      "name": "Andrew Hawley",
      "character": "Tony"
    },
    {
      "id": "nm4084628",
      "name": "Ben Wimsett",
      "character": "YCND Boy"
    },
    {
      "id": "nm0001624",
      "name": "Oliver Platt",
      "character": "Mark Two"
    },
    {
      "id": "nm0000906",
      "name": "Annette Bening",
      "character": "Bella"
    },
    {
      "id": "nm5790745",
      "name": "Aine Garvey",
      "character": "Child Playing"
    },
    {
      "id": "nm5790746",
      "name": "Madison Deluca-Perry",
      "character": "Child Playing"
    },
    {
      "id": "nm5790747",
      "name": "Amelie Deluca-Perry",
      "character": "Child Playing"
    },
    {
      "id": "nm6085062",
      "name": "Rory Finn",
      "character": "Boy in café       (as Rory James)"
    },
    {
      "id": "nm0586958",
      "name": "Oliver Milburn",
      "character": "Roger"
    },
    {
      "id": "nm0833380",
      "name": "Richard Strange",
      "character": "Dinner Guest"
    },
    {
      "id": "nm0101540",
      "name": "Stephen Boxer",
      "character": "Police Doctor"
    }
  ],
  "overview": "A look at the lives of two teenage girls - inseparable friends Ginger and Rosa -- growing up in 1960s London as the Cuban Missile Crisis looms, and the pivotal event the comes to redefine their relationship.",
  "storyline": "London, 1962. Two teenage girls - Ginger and Rosa -- are inseparable; they play truant together, discuss religion, politics and hairstyles, and dream of lives bigger than their mothers' frustrated domesticity. But, as the Cold War meets the sexual revolution, and the threat of nuclear holocaust escalates, the lifelong friendship of the two girls is shattered - by the clash of desire and the determination to survive.",
  "plot": "In 1945, teenager Nat is giving birth in a hospital bed. Whilst she is in labour, Anoushka- the pregnant woman in the next bed- reaches out and takes her hand, beginning a lifelong friendship. Nat's daughter- Ginger, and Anoushka's daughter- Rosa, grow up and become close friends. Rosa's father leaves whilst she's still a child, profoundly affecting her view of relationships.\n\nBy 1962, 17-year-old Ginger and Rosa are spending all their time together, and even dressing the same. Rosa begins drinking and behaving promiscuously. Nat disapproves of their friendship, as she thinks Rosa is a bad influence (Rosa's own mother agrees with this). Ginger's father, Roland, takes the opposite view to Nat and encourages his daughter's wildness and independence. Roland and Nat are having trouble in their marriage and have broken up often in the past. Roland is an attractive, free-spirited professor who is implied to have been unfaithful several times. Meanwhile, Nat gave up a possible career as a painter to raise Ginger, and often feels resentful and bored.\n\nRosa and Ginger attend different schools (due to Rosa failing the 11-plus exam, which Ginger passed). However, they often skip school to spend time together, and Ginger's grades suffer as a result. Ginger (who dreams of being a poet) starts to become interested in the anti-nuclear movement and attends rally meetings. Despite her wild behaviour, Rosa is a practising Catholic, and she takes Ginger to church so they can pray for the world together.\n\nSoon after this, Ginger's parents break up after an argument over dinner. Roland moves out and enjoys his independent, bohemian lifestyle more. Nat visits Ginger's school and suggests that the school ought to offer more 'Domestic Science' classes, which one of the teachers informs Ginger of. Nat believes that her daughter will eventually become a housewife, and she wants Ginger to be better prepared than she herself was. Ginger and Nat argue over this, and Ginger moves in with her father.\n\nRosa begins spending more time with Roland after a boat trip the three take together, following which she writes him a letter telling him she understands his pain. After Ginger has moved in with him, Rosa begins a relationship with him. Ginger is disturbed by the romance between her father and best friend. She is tempted to leave Roland's home and move back in with her mother, but she changes her mind after seeing Nat is happy and has begun painting again. Roland knows his behaviour is making his daughter unhappy, but while he sympathises with her sadness, he does not stop the affair. Rosa believes that she and Roland will have everlasting love, but Ginger tells her she will end up like Nat- with Roland leaving her when she gets old. Rosa tells Ginger that she thinks she's pregnant. Ginger is devastated and runs off to a protest rally, where she is arrested. In the prison, a psychiatrist comes in to talk with her, but she won't speak. He tells the two Marks and Bella that he believes her protest activity is a cover, and that he believes she has a severe mental illness. Mark II says that on the contrary, she is quite sane - who wouldn't be depressed in the face of possible world annihilation?\n\nRoland and Nat and their family friends confront Ginger, who reveals that she has a terrible fear that the world is going to end. In reality, Ginger's growing worries about the world are masking her greater fear of what's happening between Roland and Rosa. As Ginger blurts out the truth of the affair, Nat is devastated. Ginger's two God-fathers confront Roland and accuse him of acting irresponsibly towards his daughter, but he replies that Ginger is an independent adult. They try to show Roland that Ginger still needs a responsible father figure.\n\nRosa and her mother then arrive at the house, where Nat confronts Rosa. Seeing Rosa clutch her stomach, Nat deduces that she's pregnant and runs upstairs. Ginger and Mark follow her, but she has locked the door. They call Roland, who breaks the door in, and they find that Nat (though still conscious) has taken an overdose, she is then rushed to hospital. Rosa asks Ginger to forgive her, but Ginger doesn't answer, simply walking off instead.\n\nAs Roland and Ginger wait for news of Nat in the hospital, Ginger writes a letter to Rosa, in the form of a poem. In it, she discusses their friendship and differing outlooks, pointing out that Rosa dreams of 'everlasting love', whilst Ginger 'loves this world'. The poem ends on a hopeful note - Ginger tells Rosa that if everything works out, then there will be nothing to forgive, but she'll forgive her anyway. Roland awakens from his slumber on the bench next to Ginger's one and apologizes to her saying he is sorry. Ginger turns away from him and continues writing her poem to Rosa.",
  "synopsis": "London, 1962. Two teenage girls - Ginger and Rosa - are inseparable; they play truant together, discuss religion, politics and hairstyles and dream of lives bigger than their mothers' frustrated domesticity. But, as the Cold War meets the sexual revolution, and the threat of nuclear holocaust escalates, the lifelong friendship of the two girls is shattered - by the clash of desire and the determination to survive."
}