{
  "imdb_id": "tt2101314",
  "tmdb_id": "103215",
  "douban_id": null,
  "title": "Anton Corbijn Inside Out (2012)",
  "genres": [
    "Documentary",
    "Biography"
  ],
  "country": "Netherlands",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm1908380",
      "name": "Klaartje Quirijns"
    }
  ],
  "writer": [
    {
      "id": "nm1908380",
      "name": "Klaartje Quirijns",
      "description": "writer and"
    },
    {
      "id": "nm2227985",
      "name": "Thomas den Drijver",
      "description": "co-writer"
    }
  ],
  "cast": [
    {
      "id": "nm0179221",
      "name": "Anton Corbijn",
      "character": "Himself"
    },
    {
      "id": "nm0095104",
      "name": "Bono",
      "character": "Himself"
    },
    {
      "id": "nm0330756",
      "name": "Martin Gore",
      "character": "Himself"
    },
    {
      "id": "nm0344963",
      "name": "Herbert Grönemeyer",
      "character": "Himself"
    },
    {
      "id": "nm0381723",
      "name": "James Hetfield",
      "character": "Himself"
    }
  ],
  "overview": "An intimate portrait of Anton Corbijn as he travels the world as a photographer, film maker and video artist…",
  "storyline": "An intimate portrait of Anton Corbijn as he travels the world as a photographer, film maker and video artist. A unique and revelatory look at the drama and conflict inherent in the man himself: the sacrifice of his private life versus his meteoric career, his commercial success versus his desire for artistic recognition, and his audience's admiration versus his personal loneliness.",
  "plot": null,
  "synopsis": "Anton Corbijn's prolific work has shaped the image of artists such as Joy\nDivision, U2, Nirvana, Metalica, Depeche Mode or R.E.M. But what drives\nthe photographer, filmmaker and video artist who has been hidden from the\npublic for so long?INSIDE OUT explores Corbijn's persona, uncovering his motivation and\ninherent conflict as an artist, between audience's admiration and personal\nloneliness and the unique iconography he created. With critical and\ninsightful interviews of artists like Bono, George Clooney, but most of\nall Corbijn himself, we follow him to his current and childhood homes and\nhis places of work, studio and film set to reveal the portrait of one of\nthe most significant artists of post-modern pop culture."
}