{
  "imdb_id": "tt2186781",
  "tmdb_id": "142115",
  "douban_id": null,
  "title": "Five Dances (2013)",
  "genres": [
    "Drama",
    "Music",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "83 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm1135014",
      "name": "Alan Brown"
    }
  ],
  "writer": [
    {
      "id": "nm1135014",
      "name": "Alan Brown",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm4857666",
      "name": "Ryan Steele",
      "character": "Chip Daniel"
    },
    {
      "id": "nm3802424",
      "name": "Reed Luplau",
      "character": "Theo"
    },
    {
      "id": "nm4244034",
      "name": "Catherine Miller",
      "character": "Katie"
    },
    {
      "id": "nm3139343",
      "name": "Kimiye Corwin",
      "character": "Cynthia"
    },
    {
      "id": "nm4856722",
      "name": "Luke Murphy",
      "character": "Anthony"
    },
    {
      "id": "nm1192383",
      "name": "LuLu Roche",
      "character": "Chip's Mother       (voice) (as Louise Roche)"
    },
    {
      "id": "nm2367103",
      "name": "Michael Borrelli",
      "character": "Cynthia's Husband       (voice)"
    }
  ],
  "overview": "FIVE DANCES, written and directed by Alan Brown, is a creatively adventurous narrative feature film set in the New York 'downtown' modern dance world.  The story follows the rocky emotional journey of an 18-year old dancer (the amazing Ryan Steele) with talent to burn, who must choose between his responsibility to his broken family in the Midwest, and forging a life and career for himself.  The film features five of New York's most gifted dancers acting on film for the very first time, and performing the choreography of internationally acclaimed choreographer Jonah Bokaer.",
  "storyline": "FIVE DANCES is a creatively adventurous narrative feature film set in the New York 'downtown' modern dance world. The story follows the rocky emotional journey of an 18-year old dancer with talent to burn, who must choose between his responsibility to his broken family in the Midwest, and forging a life and career for himself.",
  "plot": "Chip, a young dancer who recently arrived in New York City, starts to train and practice with three other dancers and the ballet master; the dancing room where they practice is in SoHo. While patiently rehearsing each figure of the five dances making up the ballet, Chip has to choose between going back to his family home in the Midwest and starting his own career and personal life.",
  "synopsis": null
}