{
  "imdb_id": "tt2194826",
  "tmdb_id": "312797",
  "douban_id": "25749515",
  "title": "The Barber (2014)",
  "genres": [
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm3101882",
      "name": "Basel Owies"
    }
  ],
  "writer": [
    {
      "id": "nm0258098",
      "name": "Max Enscoe",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0001277",
      "name": "Scott Glenn",
      "character": "Eugene Van Wingerdt"
    },
    {
      "id": "nm2421211",
      "name": "Chris Coy",
      "character": "John McCormack"
    },
    {
      "id": "nm0864997",
      "name": "Stephen Tobolowsky",
      "character": "Chief Gary Hardaway"
    },
    {
      "id": "nm1982266",
      "name": "Kristen Hager",
      "character": "Audrey Bennet"
    },
    {
      "id": "nm1362980",
      "name": "Max Arciniega",
      "character": "Luis"
    },
    {
      "id": "nm2772584",
      "name": "Olivia Taylor Dudley",
      "character": "Kelli"
    },
    {
      "id": "nm0212498",
      "name": "Tim DeZarn",
      "character": "Capt. Phil Baroni       (as Tim De Zarn)"
    },
    {
      "id": "nm0826186",
      "name": "Richard Steinmetz",
      "character": "Businessman"
    },
    {
      "id": "nm0399237",
      "name": "Valorie Hubbard",
      "character": "Grace"
    },
    {
      "id": "nm1935905",
      "name": "Lydia Hearst",
      "character": "Melissa"
    },
    {
      "id": "nm4181008",
      "name": "Justine Acciani",
      "character": "Judy Lynn"
    },
    {
      "id": "nm3234843",
      "name": "Lexi Sakowitz",
      "character": "Debbie Ann Skokie"
    },
    {
      "id": "nm3030494",
      "name": "Shelly West",
      "character": "Susie"
    },
    {
      "id": "nm4887998",
      "name": "Tabitha Ellis",
      "character": "Girl in Coffin"
    },
    {
      "id": "nm0129248",
      "name": "Thomas Calabro",
      "character": "Thomas McCormack"
    },
    {
      "id": "nm7260287",
      "name": "Lucas Dieudonne",
      "character": "Young John"
    },
    {
      "id": "nm7260288",
      "name": "Matt Leonard",
      "character": "Ese"
    }
  ],
  "overview": "Eugene is a small town barber, beloved by the local community, but hiding a deadly secret. John is hunting for a serial killer not to expose him but to learn the business! They form a twisted bond and turn the town upside down as Eugene teaches John to kill.",
  "storyline": "The Barber, examines two men fixated on what triggers the enormity of evil: a father whose life is destroyed in pursuit of a killer, a son caught in a deadly charade as he tries to unravel his father's obsession.",
  "plot": "On a cold winter, Calvin Palmer, Jr. (Ice Cube) decides he has had enough of trying to keep open the barbershop his father handed down to him. He cannot borrow, revenues are falling, and he seems more interested in get-rich-quick schemes to bring in easy money. Without telling his employees, or the customers, he sells the barbershop to a greedy loan shark, Lester Wallace (Keith David), who lies about its future by announcing plans to turn it into a strip club.\n\nAfter spending a day at work, and realizing just how vital the barbershop is to the surrounding community, Calvin rethinks his decision and tries to get the shop back - only to find out Wallace wants double the $20,000 he paid Calvin to return it, and before 7 pm that day. Right after he admits to the employees that he sold the barber shop, and that it would be closing at the end of the day, the police arrive to arrest one of the barbers, named Ricky (Michael Ealy). He is accused of driving his pickup truck into a nearby market to steal an ATM, but the ATM thief, JD (Anthony Anderson), a cousin of Ricky's, is revealed to be actually the one who committed the crime after borrowing Ricky's truck. Because this is, potentially, Ricky's 'third strike', he could be sentenced to life in prison. Calvin uses the $20,000 from Lester to bail Ricky out of jail, yet Ricky is still angry, as JD set him up.\n\nCalvin reveals that he found a gun in Ricky's locker in the barbershop and shows it to him. They stop the car and Ricky throws the gun into the river, proving that he does not want to get into any more trouble. Then they both go to confront Lester. Lester, as well as JD and his best friend Billy (Lahmard Tate) (who were still trying to pry the ATM open and took it to Lester's place without his knowledge) are confronted by Calvin and Ricky. They demand Lester give the barbershop back. Lester is angered and orders his bodyguard Monk to pull out his gun. The police arrive just in time to save Calvin and Ricky, but JD and Billy are arrested. Calvin and Ricky see the ATM, and get a $50,000 reward for returning it to police. They get the money, and the barbershop reopens with even better business than before. In the meantime, Calvin's wife, Jennifer (Jazsmin Lewis), has given birth to a baby boy.",
  "synopsis": null
}