{
  "imdb_id": "tt2105055",
  "tmdb_id": "259392",
  "douban_id": null,
  "title": "Within the Darkness (2016)",
  "genres": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm1151848",
      "name": "Jonathan Zuck"
    }
  ],
  "writer": [
    {
      "id": "nm0174012",
      "name": "Cheryl Compton",
      "description": "co-writer"
    },
    {
      "id": "nm0174012",
      "name": "Cheryl Compton",
      "description": "story"
    },
    {
      "id": "nm0174012",
      "name": "Cheryl Compton",
      "description": null
    },
    {
      "id": "nm1151848",
      "name": "Jonathan Zuck",
      "description": "co-writer"
    }
  ],
  "cast": [
    {
      "id": "nm0047329",
      "name": "John C. Bailey",
      "character": "Bruce"
    },
    {
      "id": "nm1599810",
      "name": "Erin Cline",
      "character": "Lucy"
    },
    {
      "id": "nm1145107",
      "name": "Dave Coyne",
      "character": "Austin"
    },
    {
      "id": "nm4761506",
      "name": "Kaitlyn J. Dye",
      "character": "Spirit"
    },
    {
      "id": "nm2082525",
      "name": "Shanna Forrestall",
      "character": "Megan"
    },
    {
      "id": "nm0363811",
      "name": "Annette Harper",
      "character": "Nevet"
    },
    {
      "id": "nm1800223",
      "name": "Tonya Kay",
      "character": "Jesse"
    },
    {
      "id": "nm4015504",
      "name": "Jennifer Osborn",
      "character": "Anna Hewitt"
    },
    {
      "id": "nm5117870",
      "name": "Cheyenne Phillips",
      "character": "Actress"
    },
    {
      "id": "nm0714720",
      "name": "Jill Redding",
      "character": "Dora"
    },
    {
      "id": "nm5984265",
      "name": "Laura Thompson",
      "character": "Ghost Spotters Host"
    }
  ],
  "overview": "A group of wannabe ghost hunters set out to shoot a pilot in the old Hewitt house which is rumored to be haunted, faking everything, and get more than they bargain for. Eventually, things begin to happen at the house that cannot be easily explained. Is the house really haunted? Can anyone be trusted? We are at our most vulnerable when presented with our greatest desires or confronted with our greatest fears.",
  "storyline": "Within the Darkness is the story of a group of friends with aspirations of fame and fortune in the \"ghost hunting\" business. They set out to shoot a spec pilot for a TV series \"The Paranormal Dimension, with Austin Barnett.\" Austin, Lucy, Jessie and Bruce are prepared with video cameras and the tools of the trade but not prepared for what awaits them in the Hewit House. Be careful what you wish for.",
  "plot": "Peter and Bronny Taylor go on a vacation to the Grand Canyon with their teenage daughter, Stephanie, and their adolescent autistic son, Mikey. Mikey discovers a small cave, where he finds black rocks with symbols on them. He takes the rocks, not telling anybody what happened.\n\nWhen the Taylors return home, strange things begin to happen. Bronny finds that the sink keeps turning on, and Stephanie sees handprints on a steamy mirror, both of which Mikey blames on “Jenny”. After Stephanie gets home from school, she vomits into a container and puts it under her bed. Bronny catches her, and she and Peter learn that Stephanie has been throwing up for a while; there are many such containers under her bed. They take Stephanie to a hospital for help, leaving Mikey at Bronny's mother's house. Bronny's mother finds Mikey trying to kill her cat, much to Peter’s disbelief.\n\nAt home, Bronny searches online for answers to the strange activity and learns about the Anasazi Indians, who believed that demons were bound to rocks hidden in underground caves. If the rocks are taken, the demons take the shape of a crow, snake, coyote, wolf, and buffalo. The family has already had encounters with a crow and a snake. The demons connect to young children who are dragged into their world, triggering an event known as 'The Darkness'. The only way they can be banished is if the rocks are returned to where they were found by someone who is not afraid.\n\nBronny finds a wall on fire in Mikey's room, but Peter rules out the possibility of ghosts. They later find Mikey covered in black marks from the fire, with blood pouring from his mouth. Later that night, Bronny has a nightmare of a wolf. Depressed, she starts drinking. In Mikey's room, the fire-damaged part of the wall is revealed to be a portal. Stephanie begins being choked by handprints appearing all over her wall and body. In the tree house, Peter sees a coyote, and then sees the shadow of a demon in Stephanie's window. The force stops choking Stephanie as Peter rushes in. Peter then breaks down Mikey's bathroom door, and finds him with marks all over the walls and ceiling.\n\nPeter calls a number given to him by his boss. It is a woman named Teresa, who is said to perform spiritual healings. Teresa comes over with her granddaughter, Gloria, who acts as a translator. As they cleanse the house, Teresa and Gloria go into Mikey's room, and note that this is where the real evil lives. They recite a chant as Mikey tries to enter the portal.\n\nWhen they realize Mikey's gone, the family races upstairs. Peter sees Mikey walking into the portal with the demons. He finds the stones and follows Mikey into the portal, but can't set the stones down due to his fear. He offers to swap places with Mikey but Mikey picks up the stones and puts them back down, saying he is not afraid. The demons are banished and Peter and Mikey jump out of the portal together. It disappears, and Gloria declares that the house is clean of evil energy.",
  "synopsis": null
}