{
  "imdb_id": "tt2181542",
  "tmdb_id": "308269",
  "douban_id": null,
  "title": "Gore, Quebec (2014)",
  "genres": [
    "Horror",
    "Thriller"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "79 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.7,
  "director": [
    {
      "id": "nm5083646",
      "name": "Jean Benoit Lauzon"
    }
  ],
  "writer": [
    {
      "id": "nm5083646",
      "name": "Jean Benoit Lauzon",
      "description": "story"
    },
    {
      "id": "nm5082759",
      "name": "Rick Mele",
      "description": "screenplay"
    },
    {
      "id": "nm5082759",
      "name": "Rick Mele",
      "description": "story"
    }
  ],
  "cast": [
    {
      "id": "nm5125886",
      "name": "Myrthin Stagg",
      "character": "Amanda"
    },
    {
      "id": "nm1399910",
      "name": "Blake Mawson",
      "character": "Mike       (as Daniel Jones-Wood)"
    },
    {
      "id": "nm4131792",
      "name": "Andy Malone",
      "character": "David Edward Reynolds"
    },
    {
      "id": "nm3137452",
      "name": "Kate Elyse Forrest",
      "character": "Katie Farrell"
    },
    {
      "id": "nm5178003",
      "name": "Luke Madigan",
      "character": "The Killer"
    },
    {
      "id": "nm5083646",
      "name": "Jean Benoit Lauzon",
      "character": "Brandon"
    },
    {
      "id": "nm3940942",
      "name": "Kurt Ogilvie",
      "character": "Sean Reynolds"
    },
    {
      "id": "nm5111555",
      "name": "Peri Greig",
      "character": "Stacey"
    },
    {
      "id": "nm5082759",
      "name": "Rick Mele",
      "character": "Colin"
    },
    {
      "id": "nm6976939",
      "name": "Rachel Atherstone",
      "character": "Erin"
    },
    {
      "id": "nm0186950",
      "name": "Rufus Crawford",
      "character": "Nick Gleason       (as Rufus C.)"
    },
    {
      "id": "nm3183626",
      "name": "Kyle Fowler",
      "character": "Neighbour"
    },
    {
      "id": "nm2247315",
      "name": "Ryan Gibbs",
      "character": "Frozen Corpse"
    },
    {
      "id": "nm6976940",
      "name": "Gillian Gibbs",
      "character": "Reporter       (voice)"
    }
  ],
  "overview": "Gore, Quebec tells the story of two acquaintances who are set up by their mutual friends on a cottage weekend in Quebec. What was supposed to be an exciting and fun weekend, quickly turns into the blind date from hell, as the Couple discover that the cottage is not safe, and that their friends are already dead. The film begins in a home movie found-footage style, but quickly shifts into a more cinematic style once things start unraveling. With a serial killer terrorizing them, the Couple have to either protect one another to survive, or try to escape separately. Do you protect your fellow man, or is survival a solitary journey?",
  "storyline": "Gore, Quebec tells the story of two acquaintances who are set up by their mutual friends on a cottage weekend in Quebec. What was supposed to be an exciting and fun weekend, quickly turns into the blind date from hell, as the Couple discover that the cottage is not safe, and that their friends are already dead. The film begins in a home movie found-footage style, but quickly shifts into a more cinematic style once things start unraveling. With a serial killer terrorizing them, the Couple have to either protect one another to survive, or try to escape separately. Do you protect your fellow man, or is survival a solitary journey?",
  "plot": "A voiceover announces that the following footage was recovered from the camera of Dave Reynolds, who, in 2011, had left Ontario to spend a weekend in his parents' cottage in Gore, Quebec with his brother Sean, and their friends Katie, Brandon, Stacey, Colin, Erin, and Mike.\n\nWhen Sean and Dave reach the cottage, they find a note informing them that the alarm was tripped a week ago, but that there were no signs of vandalism or theft; they also spot someone watching them from the woods, though Sean dismisses the observer as a neighbor or a hiker. Most of the others arrive, and mention that Brandon, Mike, and Mike's blind date Amanda should be there by tomorrow afternoon. A few hours into the group's partying, Katie stumbles into the cottage bleeding, followed by a man who attacks the others, and turns Dave's camera off. The film switches to a traditional third-person narrative, and shows the intruder breaking Erin's neck with an oar.\n\nThe next day, Brandon, Mike, and Amanda drive to the cottage as a newscast announces that new DNA evidence has cast doubt on the guilt of Nick Gleason, who was convicted of five counts of first-degree murder in 2003. Upon reaching the cottage, Brandon goes for a walk, and Mike and Amanda go out on the boat, and discover Katie's body in the lake. Mike and Amanda go in search of Brandon, who has stumbled onto a series of abandoned structures, some of which are covered in graffiti that appears to have been drawn with blood. The killer mutilates and hangs Brandon, and uses his blood to add to the graffiti.\n\nElsewhere, the wounded Dave awakens in the woods, surrounded by the corpses of Erin and Sean, and runs off in search of aid, finding Mike and Amanda. Dave tells the two what happened to the others, and as they head back to the cottage, the killer throws an axe into Dave's back. The killer chases Amanda and Mike to where Colin and Stacey's remains are, and a flashback shows how he framed Nick Gleason for the five murders he committed in 2003.\n\nAmanda and Mike reach the cottage, as does the killer, who axes a visiting neighbor. When the killer enters, Amanda bludgeons him with an oar, and she and Mike make a run for it, reaching Brandon's car, which they crash. The film returns to the \"found footage\" format used at the beginning, with the killer using Dave's camera to film the posed bodies of his victims, and the captive Mike and Amanda.",
  "synopsis": null
}