{
  "imdb_id": "tt2167266",
  "tmdb_id": "203819",
  "douban_id": null,
  "title": "Tracks (2013)",
  "genres": [
    "Adventure",
    "Biography",
    "Drama"
  ],
  "country": "Australia",
  "version": [
    {
      "runtime": "112 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm0192845",
      "name": "John Curran"
    }
  ],
  "writer": [
    {
      "id": "nm5327453",
      "name": "Marion Nelson",
      "description": "screenplay"
    },
    {
      "id": "nm0203475",
      "name": "Robyn Davidson",
      "description": "book"
    }
  ],
  "cast": [
    {
      "id": "nm5659346",
      "name": "Lily Pearl",
      "character": "Young Robyn"
    },
    {
      "id": "nm1985859",
      "name": "Mia Wasikowska",
      "character": "Robyn"
    },
    {
      "id": "nm0230109",
      "name": "Philip Dodd",
      "character": "Publican"
    },
    {
      "id": "nm0696216",
      "name": "Fiona Press",
      "character": "Publican's Wife"
    },
    {
      "id": "nm5326885",
      "name": "Daisy Walkabout",
      "character": "Ada"
    },
    {
      "id": "nm0090674",
      "name": "Rainer Bock",
      "character": "Kurt"
    },
    {
      "id": "nm1535537",
      "name": "Felicity Steel",
      "character": "Gladdy"
    },
    {
      "id": "nm0281313",
      "name": "John Flaus",
      "character": "Sallay"
    },
    {
      "id": "nm2900824",
      "name": "Ian Conway",
      "character": "Chilpi"
    },
    {
      "id": "nm2345601",
      "name": "Evan Casey",
      "character": "Evan"
    },
    {
      "id": "nm6763893",
      "name": "David Pearce",
      "character": "David"
    },
    {
      "id": "nm2141404",
      "name": "Jessica Tovey",
      "character": "Jenny"
    },
    {
      "id": "nm5311657",
      "name": "Darcy Crouch",
      "character": "Tolly"
    },
    {
      "id": "nm3296031",
      "name": "Brendan Maclean",
      "character": "Peter       (as Brendan MacLean)"
    },
    {
      "id": "nm2317782",
      "name": "Jamie Timony",
      "character": "Bernard"
    },
    {
      "id": "nm3148372",
      "name": "Melanie Zanetti",
      "character": "Annie"
    },
    {
      "id": "nm3485845",
      "name": "Adam Driver",
      "character": "Rick"
    },
    {
      "id": "nm5706489",
      "name": "Ryan McMillan",
      "character": "Bob"
    },
    {
      "id": "nm6763894",
      "name": "Leah Michelle",
      "character": "Niece"
    },
    {
      "id": "nm1134439",
      "name": "Emma Booth",
      "character": "Marg"
    },
    {
      "id": "nm0170347",
      "name": "Robert Coleby",
      "character": "Pop"
    },
    {
      "id": "nm4591270",
      "name": "Steven Parker",
      "character": "Pete"
    },
    {
      "id": "nm6169287",
      "name": "Leo Payten",
      "character": "Young Boy"
    },
    {
      "id": "nm6169288",
      "name": "Jed Payten",
      "character": "Young Boy"
    },
    {
      "id": "nm2159255",
      "name": "Bryan Probets",
      "character": "Geoff"
    },
    {
      "id": "nm6763895",
      "name": "Elsie Wanatjura",
      "character": "Dancing Woman"
    },
    {
      "id": "nm6763896",
      "name": "Rene Kulitja",
      "character": "Dancing Woman"
    },
    {
      "id": "nm6763897",
      "name": "Happy Reid",
      "character": "Dancing Woman"
    },
    {
      "id": "nm6763898",
      "name": "Lydia Angus",
      "character": "Dancing Woman"
    },
    {
      "id": "nm6763899",
      "name": "Yvonne Yiparti",
      "character": "Singing Woman"
    },
    {
      "id": "nm6763900",
      "name": "Awalari Teamay",
      "character": "Singing Woman"
    },
    {
      "id": "nm6763901",
      "name": "Edith Richards",
      "character": "Singing Woman"
    },
    {
      "id": "nm5511262",
      "name": "Vincent Forster",
      "character": "Vincent"
    },
    {
      "id": "nm1779507",
      "name": "Rolley Mintuma",
      "character": "Mr. Eddy"
    },
    {
      "id": "nm0737235",
      "name": "Tim Rogers",
      "character": "Glendle"
    },
    {
      "id": "nm6763902",
      "name": "Chelsea Haywood",
      "character": "Tourist One"
    },
    {
      "id": "nm6763903",
      "name": "Andrew Harper",
      "character": "Tourist Two"
    },
    {
      "id": "nm0118983",
      "name": "Tom Budge",
      "character": "Suzuki Man"
    },
    {
      "id": "nm0388122",
      "name": "Edwin Hodgeman",
      "character": "Mr. Ward"
    },
    {
      "id": "nm0122609",
      "name": "Carol Burns",
      "character": "Mrs. Ward"
    },
    {
      "id": "nm1706616",
      "name": "Chris Duncan",
      "character": "TV Reporter"
    },
    {
      "id": "nm6763904",
      "name": "Ricardo Anasco",
      "character": "TV Reporter"
    },
    {
      "id": "nm6763905",
      "name": "Morgan",
      "character": "Dookie"
    },
    {
      "id": "nm6763906",
      "name": "Mona",
      "character": "Zelly"
    },
    {
      "id": "nm6763907",
      "name": "Istan",
      "character": "Bub"
    },
    {
      "id": "nm6763908",
      "name": "Mindie",
      "character": "Goliath"
    },
    {
      "id": "nm6614246",
      "name": "Special Agent Gibbs",
      "character": "Diggity"
    },
    {
      "id": "nm6763909",
      "name": "Mitch",
      "character": "Goldie"
    }
  ],
  "overview": "Accompanied only by her faithful dog and four camels, an Australian satisfies her craving for solitude by embarking on a solo trip across the desert from Alice Springs to the Indian Ocean.",
  "storyline": "A young woman goes on a 1,700-mile trek across the deserts of West Australia with four camels and her faithful dog.",
  "plot": "Four stage magicians, J. Daniel \"Danny\" Atlas (Jesse Eisenberg), Merritt McKinney (Woody Harrelson), Henley Reeves (Isla Fisher), and Jack Wilder (Dave Franco), are each given a tarot card that lead them to the same empty New York City apartment, where they find information from an unknown benefactor.\n\nA year later, the four perform their first major performance as the Four Horsemen in an elaborate Las Vegas show funded by insurance magnate Arthur Tressler (Michael Caine). Their final trick appears to transport one of the audience members to the vault of his bank, the Crédit Républicain in Paris, where stacks of new euro bills are stored. At the magicians' commands, the fans in the vault activate, drawing the bills into the vents and then showering the Las Vegas crowd with them. The euros are shown to be real, and the vault in Paris is found to be empty of its recent shipment of euros, leading FBI agent Dylan Rhodes (Mark Ruffalo), and Interpol agent Alma Dray (Mélanie Laurent), to be partnered and investigate the Horsemen. The two question the magicians but have no evidence to hold them. Dylan and Alma turn to Thaddeus Bradley (Morgan Freeman), a former magician who now helps to explain the tricks behind other magic acts. Thaddeus demonstrates how they used a mock vault under the Las Vegas stage, and that the group must have stolen the money in Paris before it arrived at the bank, replacing it with flash paper that left no evidence.\n\nDylan, Alma, and Thaddeus follow the Horsemen to their next show in New Orleans, where their final trick appears to transfer millions of dollars from Tressler's private accounts to those in the audience, made up of people that were denied insurance claims by Tressler's company in the wake of Hurricane Katrina. Dylan and Alma attempt to apprehend the four, but the magicians elude capture. Tressler hires Thaddeus to expose the Horsemen in revenge for the loss of his money. Alma investigates the Horsemen and determines they are connected to a group called the Eye, a small group of magicians that claim to have access to real magic. She finds out one of the Eye's members, Lionel Shrike, had previously been exposed by Thaddeus but died in a locked-safe escape trick he was performing to try to regain his standing. Alma suspects a fifth person is aiding the Horsemen.\n\nAlma's research leads the FBI to the New York City apartment. When they raid it, the other three escape while Jack recovers numerous documents and then leads the authorities on a high-speed car chase. Jack loses control of his car, causing it to flip and catch fire. Dylan is unable to save Jack, but manages to recover the papers, pointing to the Horsemen's next planned crime, stealing millions of dollars in cash out of a large Elkhorn safe. Dylan, Alma, and Thaddeus find the safe has already been stolen, and when they track it down, its contents have been replaced with balloon animals. The Horsemen broadcast they will perform their final show that night at 5 Pointz, inviting the public to attend. The FBI and police converge on the scene and amid the chaos search for the Horsemen. The remaining Horsemen appear to the crowd, giving their fans a farewell and a message about an ulterior purpose, and then run to jump off a roof; Dylan attempts to shoot them but Alma holds him back. The three jump, turning into a shower of money over the crowd. The money is counterfeit, but the audience's race to collect it prevents the authorities from tracking the real Horsemen.\n\nAfter the show, Thaddeus walks to his car, only to find it full of the money stolen from the Elkhorn safe, and he is arrested. Dylan speaks to Thaddeus in jail, where Thaddeus slowly comes to realize that Alma's theory was correct, and Dylan was the fifth Horseman. Dylan quietly walks away. Elsewhere, the Horsemen, including Jack who had faked his death, meet at the carousel in Central Park, and use their tarot cards to turn it on. Dylan arrives and welcomes the four to the Eye.\n\nLater, at the Pont des Arts, Dylan meets with Alma and reveals he is Shrike's son. He brought the Horsemen together to get retribution for his father's death: the Elkhorn Safe Company for providing a faulty safe that led to the accident, Thaddeus for humiliating him, and the Crédit Républicain and Tressler's insurance companies for failing to pay out afterwards. Alma, who has come into a romantic relationship with Dylan, decides not to turn him in. She takes a lock and a key that Dylan produces, putting the lock on a chain fence and throwing the key into the Seine.",
  "synopsis": "Robyn Davidson (Mia Wasikowska), a young Brisbane woman, arrives in a country town with her dog, Diggity. She plans on travelling to Ayers rock and across Western Australia to the ocean. She finds work in the town at a local pub and then offers to exchange several months of her time with a local farmer named Kurt Posel (Rainer Bock) in exchange for 2 camels. He teaches her how to handle camels and eventually fires her after his partner leaves him. She is angry that he won't honour their deal.She finds a shell of a house in the middle of the bush in which to live.She goes to work for an camel wrangler, Sallay Mahomet (John Flaus), for a month at half pay in exchange for one feral camel, who she tames. She is now known by the local as \"camel lady\". He is doubtful about her ability to travel that distance by herself.One night a group of her friends arrive unexpectedly and Robyn looks slightly put out by their presence. They introduce a young American photographer, Rick Smolan (Adam Driver) who is awkward yet seems fascinated with her. She says she is trying to get money and supplies together for her trip and he suggests finding sponsorship. He offers to put her in touch with some editors. Her friend Jenny (Jessica Tovey) offers to come with her if she shortens the trip and only goes til Ayers rock. She declines. She wants to to the trip alone and on her terms. Her friends drink, smoke, and talk furiously under the night sky. Robyn sits removed from them all, then gets up and goes to visit her camels alone. She is happy with them.Jenny leaves her with an old tape deck of her mother's favourite album. She leaves a message on the tape and says she is uncertain as to why Robyn is determined to go through with the journey alone. Rick has left the contact details of National Geographic and Robyn writes to them informing them of her journey. They agree to sponsor her on the condition that Rick be able to meet up with her regularly to photograph her trek.Robyn convinces the farmer to whom Kurt sold his farm to give her the two camels Kurt owed her.Robyn's father, sister and niece arrive from out of town to wish her farewell. Her sister is somewhat aghast at the conditions in which Robyn in living. Rick arrives that evening and Robyn introduces him to her family, disinterestedly. As she says goodbye the next day, Robyn's sister tells her that there is no shame in turning back if there is trouble.Day 1: Robyn sets off on her trip with her four camels: Dookie and Bub from Kurt's farm and Zelly and her baby Goliath from Sallay. She noted earlier that she is \"remarkably unqualified for such a hazardous undertaking: this is precisely the point of [her] journey\".Rick follows in a Landrover. Over the course of the next few weeks, he comes to photograph her and she is frustrated and annoyed with his requests to pose for the camera.Day 61. Robyn awakes to find her camels have disappeared. She goes looking for them and finds them. She whips Dookie and then apologises.Eventually one night when Rick is with her again she shouts in frustration. She doesn't like his constant presence while she is on this arduous journey. He comforts her and they kiss.The next day they visit an Aboriginal settlement. They share a room together. At night, Rick sneaks out to take photos of a private ritual and Robyn is upset with him for disrespecting their hosts' rules. The next day she is told she has to take a longer route than she anticipated as her planned route takes her through sacred land and none of the elders will accompany her once they uncovered Rick's transgression.After trekking through particularly inhospitable land and having to shoot feral camel bulls in heat, Robyn is relieved to find a watering hole. A group of elders arrive at Robyn's campsite. When she says she can't take the short route as it will pass through sacred land, an elder offers to accompany her across that area to the campsite of a man called Glendle.Eddy and Robyn arrive at Glendle's camp site. She complains to Glendle that Rick is nice but he annoys her. Robyn asks Eddy to walk the rest of the way to Warburton with her. She gives him a new pair of shoes in exchange for accompanying her. Along the way Eddy helps her care for her camels, and teaches her about traditional Aboriginal medicine and culture and they slowly come to mutual understanding and enjoy each other's company.Rick drops in on them after Robyn sends a telegram requesting she bring a gun to gift to Eddy, who had fawned over her gun earlier in the trip. Eddy is thrilled. They travel on and come to a run-down settlement. Robyn insists on doing the next stretch of travel alone (2 months' travel with no water in sight), despite Eddy and Rick's misgivings. Ricks says he thinks Robyn has a problem with people. He insists on driving 1000 miles out of his way to drop water supplies along the way for her.Eddy wishes Robyn good luck and gives her a stone for her journey.She loses a clock her father gave to her and heads off away from her camels into the bush to find it, which she eventually does, with relief. Once she does, she realises she has lost her way. Diggity leads her back to the campsite. She hallucinates that a wild camel is racing towards her in the distance and run towards it to defend her pack. It is a mirage and disappears in a plume of dust.Day 124. She finishes her last drop of water from a canister. The watering holes are all dried up. Robyn continues to trek through the desert. She is caked in dust , severely sunburned and looks exhausted. She stumbles across another canister of water and smiles gratefully.At night a motorcycle pulls up to her campsite. A man dressed in white walks up asking for the Camel Lady. He is chatty: in the middle of an overland trip and has been following her tracks since Warburton, attempting to set a record from Bundaberg to Ningaloo. She ignores him, turns over and goes back to sleep.She walks further, past many animals who have perished along the way. She comes across an old farmhouse and stands hesitantly outside as she waits for the someone to appear. An old lady sweeps her stoep, looks up curiously and invites her in for tea with her husband. She tells them the story of growing up in Queensland farming Hereford cattle. A 7 year drought resulted in her family going broke. Robyn spends a quiet evening with the old couple.That night she dreams of a day when she was a child. her father tells her that her mother is dead and that she will have to live with her aunt Gillian. Her dog, Goldie, had to be put down.The old couple give her directions and supplies. She looks refreshed. The couple look worried as she sets off.She stumbles across a dead kangaroo. As she leans down to gut it, she sees a vision of Eddy trying to stop her telling her, \"Women never break the law\". She stands back up and moves on.At night she goes looking for her dog. She walks past a bottle of poison. Diggity looks ill and is foaming at the mouth. In the morning she is forced to shoot Diggity. It is painful to watch and she is distraught. She thinks back to her childhood dog who was euthanised.She falls into a depressed state and sleeps all day in the dust. She tries to use her radio but to no avail. A snake crawls over her in her sleep. The camels bay for her.Day 157. Robyn stumbles, naked, along a barren plain in the hot midday sun. She sees her camels in the distance. A small airplane flies overhead. Two cars appears in the distance. She puts on a sarong, but they drive past. Later a who series of cars drive past and she hides from them. They are tourists, come to photograph her and her camels. Rick arrives and she emerges from the bush. The tourists rush her. Rick asks if she is ok, that he has been trying to find her for a week. She screams at the tourists.It is evening and a number of international visitors & reporters have made camp nearby. Robyn tells Rick that her trip doesn't matter.The next morning she awakes to find him making coffee/tea over the fire. The visitors have left. Rick brushes out her tangled hair. Robyn cried and tells Rick she is \"so alone.\" He embraces her as she cries into his shoulder. She cannot go on and misses her dog.She continues her trek and smiles as she see Rick playing with some local children and women. They ride the camels, giggling.Robyn reads newspaper clippings of her journey that have made The West Australian and other papers.Robyn decides to continue with her journey, and to escape the reporters.She passes through sand dunes, urging her camels forward and looks travel-weary. She crests a dune and smiles as she sees the ocean. Rick is waiting for her on the beach and they laugh and hug.The camels warily approach the ocean. The youngest camel is the first to wade out into the azure sea.Robyn dives into the calm, cool ocean as Rick looks on, taking photos from afar, saying nothing. She smiles freely as she stares into the depths of the ocean.We are told that after completing her 1700 mile journey, Robyn wrote the article that accompanies Rick's photos for Nat Geographic magazine. She then wrote an international bestselling novel, \"Tracks\". They quote her: \"Camel trips do not begin or end, they merely change form.\""
}