{
  "imdb_id": "tt2102472",
  "tmdb_id": "81344",
  "douban_id": "5908477",
  "title": "White Vengeance (2011)",
  "genres": [
    "Action",
    "Drama",
    "History"
  ],
  "country": "China",
  "version": [
    {
      "runtime": "135 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm0496752",
      "name": "Daniel Lee"
    }
  ],
  "writer": [
    {
      "id": "nm0496752",
      "name": "Daniel Lee",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2682046",
      "name": "Shaofeng Feng",
      "character": "Xiang Yu"
    },
    {
      "id": "nm0481709",
      "name": "Leon Lai",
      "character": "Liu Bang"
    },
    {
      "id": "nm1833620",
      "name": "Hanyu Zhang",
      "character": "Zhang Liang"
    },
    {
      "id": "nm0938893",
      "name": "Anthony Chau-Sang Wong",
      "character": "Fan Zeng"
    },
    {
      "id": "nm1703577",
      "name": "Yifei Liu",
      "character": "Yu Ji"
    },
    {
      "id": "nm0150952",
      "name": "Jordan Chan",
      "character": "Fan Kuai"
    },
    {
      "id": "nm0648499",
      "name": "Andy On",
      "character": "Han Xin"
    },
    {
      "id": "nm3218962",
      "name": "Qing Xiu",
      "character": "Xiao He"
    },
    {
      "id": "nm0227620",
      "name": "Haifeng Ding",
      "character": "Xiang Zhuang"
    },
    {
      "id": "nm0232475",
      "name": "Xiangdong Xu",
      "character": "Xiang Bo       (as Xiang Dong Xu)"
    },
    {
      "id": "nm2705327",
      "name": "Zhi-Hui Chen",
      "character": "Xiahou Ying"
    },
    {
      "id": "nm0155291",
      "name": "Kuan Tai Chen",
      "character": "Bearded warrior"
    },
    {
      "id": "nm3330760",
      "name": "Huinan Zhao",
      "character": "King Huai II of Chu"
    },
    {
      "id": "nm4803632",
      "name": "Qing Jia",
      "character": "Female assassin"
    },
    {
      "id": "nm4803584",
      "name": "Wenting Sun",
      "character": "One of the Nangong Sisters       (as Wen-Ting Sun)"
    },
    {
      "id": "nm4803599",
      "name": "Tong-di Meng",
      "character": "One of the Nangong Sisters"
    },
    {
      "id": "nm4803619",
      "name": "Zi-qi Huang",
      "character": "One of the Nangong Sisters"
    },
    {
      "id": "nm0943138",
      "name": "Wu Ma",
      "character": "Grand Tutor"
    },
    {
      "id": "nm4803560",
      "name": "John Do",
      "character": "Assassin"
    },
    {
      "id": "nm4803589",
      "name": "Zhao Wen Hao",
      "character": "Student Bofu"
    }
  ],
  "overview": "White Vengeance tells the story of two brothers contending for supremacy during the fall of the Qin Dynasty, which ruled Imperial China from 221 to 206 BC. As rebels rose, the nation fell into chaos. Liu Bang and Xiang Yu, became leaders of the rebellious army, and also became sworn brothers in battle.Xiang Yu and Liu Bang are close friends who both serve King Huai of Chu. King Huai uses a plot, saying that whoever can subvert the Qin kingdom in Guanzhong would be the Lord Qin, in order to benefit from the competition between Xiang Yu and Liu Bang. Xiang Yu is over-confident. He fights against the main force of Qin army, and entrusts Liu Bang with Yu Ji, the woman he loves.Liu Bang expresses his love to Yu Ji and takes the chance to invade Guanzhong first when most of Qin army is outside fighting against Xiang Yu’s army.",
  "storyline": "White Vengeance tells the story of two brothers contending for supremacy during the fall of the Qin Dynasty, which ruled Imperial China from 221 to 206 BC. As rebels rose, the nation fell into chaos. Liu Bang (Leon Lai) and Xiang Yu (Feng Shaofeng), became leaders of the rebellious army, and also became sworn brothers in battle. Xiang Yu and Liu Bang are close friends who both serve King Huai of Chu. King Huai uses a plot, saying that whoever can subvert the Qin kingdom in Guanzhong would be the Lord Qin, in order to benefit from the competition between Xiang Yu and Liu Bang. Xiang Yu is over-confident. He fights against the main force of Qin army, and entrusts Liu Bang with Yu Ji (Liu Yifei), the woman he loves. Liu Bang expresses his love to Yu Ji and takes the chance to invade Guanzhong first when most of Qin army is outside fighting against Xiang Yu's army. Xiang Yu is furious & betrayed when he found it. Xiang planned to kill Liu at a banquet held in Hong Men, during which Zhang ...",
  "plot": "In 1944 German-occupied Poland, young Erik Lehnsherr is separated from his parents upon entering a concentration camp. While trying to reach them, he causes a set of metal gates to bend towards him before being knocked out by guards. Sixty years later, U.S. Senator Robert Kelly attempts to pass a \"Mutant Registration Act\" in Congress, which would force mutants to publicly reveal their identities and abilities. Present are the mutants Lehnsherr and the telepathic Professor Charles Xavier. Seeing Lehnsherr in attendance, Xavier becomes concerned with how he will respond to the Registration Act.\n\nIn Meridian, Mississippi, 17-year-old Marie D'Ancanto accidentally puts her boyfriend into a coma upon kissing him, her mutant ability to absorb the powers and life force of others manifesting. She runs away from home and adopts the name Rogue. In Alberta she meets a mutant named Logan, also known as Wolverine, who possesses superhuman healing abilities and metal claws that protrude from his knuckles. While on the road together, they are attacked by a mutant named Sabretooth, and mutants Cyclops and Storm arrive and save them. Wolverine and Rogue are brought to Xavier's mansion and school for mutants in Westchester County, New York. Xavier tells Logan that Lehnsherr, also known as Magneto, has taken an interest in Wolverine, and he asks him to stay while Xavier's mutants, the X-Men, investigate why. Rogue meanwhile enrolls in the school.\n\nSenator Kelly is abducted by Magneto's allies Toad and the shapeshifter Mystique. Magneto uses Kelly as a test subject for a machine powered by his magnetic abilities that regenerates a field of radiation, inducing mutation in normal humans. Kelly later escapes. When Rogue uses her power on Wolverine in view of her classmates, she is convinced by Mystique (disguised as classmate Bobby Drake) that Xavier is angry with her and she should leave the school. Xavier uses his mutant-locating machine Cerebro to find Rogue at a train station, and the X-Men go to retrieve her. Meanwhile Mystique enters Cerebro and sabotages it.\n\nAt the train station, Magneto reveals he does not want Wolverine but Rogue, whom he abducts. Kelly arrives at Xavier's school and Xavier reads his mind to learn about Magneto's machine. Realizing the strain of powering it nearly killed Magneto, the group deduces he intends to transfer his powers to Rogue and use her to power it at the cost of her life. Kelly's newly gained powers backfire and dies when his body transforms into a slimy goop of substance. Xavier attempts to locate Rogue using Cerebro, but Mystique's sabotage incapacitates him and he falls into a coma. Fellow telekinetic/telepath Jean Grey fixes Cerebro and uses it, learning that Magneto plans to place his mutation-inducing machine on Liberty Island and use it to \"mutate\" the world leaders meeting at a summit on nearby Ellis Island. The X-Men scale the Statue of Liberty battling Magneto's mutants while Magneto transfers his powers to Rogue and activates the mutating machine. As Wolverine confronts and distracts Magneto, Cyclops blasts him away, allowing Wolverine to destroy the machine. He transfers his powers to Rogue and his healing abilities rejuvenate her.\n\nProfessor Xavier recovers from his coma. The group also learn that Mystique escaped the island battle and is impersonating Senator Kelly. Xavier gives Wolverine a lead to his past at an abandoned military installation in Canada. Magneto is imprisoned in a complex constructed of plastic and is visited by Xavier, and warns him he intends to escape one day and continue the fight.",
  "synopsis": null
}