{
  "imdb_id": "tt2191888",
  "tmdb_id": "211065",
  "douban_id": null,
  "title": "Proxy (2013)",
  "genres": [
    "Drama",
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "120 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm1556132",
      "name": "Zack Parker"
    }
  ],
  "writer": [
    {
      "id": "nm5090076",
      "name": "Kevin Donner",
      "description": "written by"
    },
    {
      "id": "nm1556132",
      "name": "Zack Parker",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm1640351",
      "name": "Kristina Klebe",
      "character": "Anika Barön"
    },
    {
      "id": "nm1473159",
      "name": "Alexa Havins",
      "character": "Melanie Michaels"
    },
    {
      "id": "nm1846132",
      "name": "Joe Swanberg",
      "character": "Patrick Michaels"
    },
    {
      "id": "nm3083352",
      "name": "Alexia Rasmussen",
      "character": "Esther Woodhouse"
    },
    {
      "id": "nm3506982",
      "name": "Adam Stephenson",
      "character": "Mr. Verdel"
    },
    {
      "id": "nm1346040",
      "name": "Jim Dougherty",
      "character": "Store Manager"
    },
    {
      "id": "nm4033048",
      "name": "Erika Hoveland",
      "character": "Mary Wilkens"
    },
    {
      "id": "nm1018581",
      "name": "Mark A. Nash",
      "character": "Anchorman"
    },
    {
      "id": "nm2963206",
      "name": "Faust Checho",
      "character": "Detective Allen"
    },
    {
      "id": "nm4138267",
      "name": "Kitsie Duncan",
      "character": "Support Victim"
    },
    {
      "id": "nm2011143",
      "name": "Dianne Bischoff",
      "character": "Moderator #1"
    },
    {
      "id": "nm2820689",
      "name": "Bruce Spielbauer",
      "character": "Marshall Michaels"
    },
    {
      "id": "nm5096298",
      "name": "Shayla Hardy",
      "character": "Technician"
    },
    {
      "id": "nm6129042",
      "name": "Angel Kerns",
      "character": "Support Group Attendee"
    },
    {
      "id": "nm4340211",
      "name": "Melissa O'Brien",
      "character": "Receptionist"
    },
    {
      "id": "nm3944084",
      "name": "Erica Stikeleather",
      "character": "Tattoo Artist"
    },
    {
      "id": "nm2437773",
      "name": "Dennis Crosswhite",
      "character": "Tattoo Manager"
    },
    {
      "id": "nm2566872",
      "name": "Jennifer Wilkens",
      "character": "Anchorwoman"
    },
    {
      "id": "nm5095367",
      "name": "Adam King",
      "character": "Guy Playing Pool"
    },
    {
      "id": "nm4023145",
      "name": "Phyllis Munro",
      "character": "Nurse"
    },
    {
      "id": "nm3409434",
      "name": "Brittany Wagner",
      "character": "Counter Girl"
    },
    {
      "id": "nm2500309",
      "name": "Steven Durgarn",
      "character": "Newspaper Man"
    },
    {
      "id": "nm4329078",
      "name": "Jennifer Bales",
      "character": "Doctor"
    },
    {
      "id": "nm0228727",
      "name": "Jason Dixie",
      "character": "Playground Father"
    },
    {
      "id": "nm1540424",
      "name": "Kelron Mixon",
      "character": "Moderator #2"
    },
    {
      "id": "nm3016663",
      "name": "Raymond Kester",
      "character": "Raymond Sheeley"
    },
    {
      "id": "nm1817349",
      "name": "Rachel Illingworth",
      "character": "Detective Oler"
    },
    {
      "id": "nm3851431",
      "name": "Glenna Reinhardt",
      "character": "ER Nurse"
    },
    {
      "id": "nm5115527",
      "name": "Jason Nelson",
      "character": "Pool Guy's Buddy"
    },
    {
      "id": "nm3707523",
      "name": "Ronnie Johnstone",
      "character": "Elliot"
    },
    {
      "id": "nm5096781",
      "name": "Mike DeIulio",
      "character": "Security Guard"
    },
    {
      "id": "nm2874719",
      "name": "Leland Franklin",
      "character": "Tom Warren"
    },
    {
      "id": "nm5089476",
      "name": "Xavier Parker",
      "character": "Peyton Michaels"
    },
    {
      "id": "nm6430626",
      "name": "Dave Snow",
      "character": "Man On Bus"
    },
    {
      "id": "nm1855872",
      "name": "Samantha Eileen DeTurk",
      "character": "Laurie"
    }
  ],
  "overview": "While walking home from her latest OB appointment, a very pregnant Esther Woodhouse is brutally attacked and disfigured by a hooded assailant. This horrible event seems to be a blessing in disguise when Esther finds consolation in a support group. Her life of sadness and solitude is opened up to friendship, understanding, and even acceptance. However, friendship and understanding can be very dangerous things when accepted by the wrong people.",
  "storyline": "While walking home from her latest OB appointment, a very pregnant Esther Woodhouse is brutally attacked and disfigured by a hooded assailant. This horrible event seems to be a blessing in disguise when Esther finds consolation in a support group. Her life of sadness and solitude is opened up to friendship, understanding, and even acceptance. However, friendship and understanding can be very dangerous things when accepted by the wrong people.",
  "plot": "While walking home from a doctor's appointment, the pregnant Esther Woodhouse (Alexia Rasmussen) is knocked unconscious by a person in a hoodie who hits her belly repeatedly with a brick. Despite the efforts of emergency room doctors, her baby is already dead when removed by Caesarian section. Noticing that Esther doesn't seem to have any friends or family (the baby was conceived via sperm bank), a social worker at the hospital forwards her to a support group for grieving parents.\n\nIn the support group meetings, Esther meets and befriends Melanie Michaels (Alexa Havins), a woman who claims her husband and child were killed by a drunk driver. Later on, while visiting a department store, Esther sees Melanie walking in alone and suddenly start screaming that her son Peyton was kidnapped and begging a security guard for help. Esther follows Melanie to the parking lot and witnesses her taking Peyton out of the car and into the store. Esther is strangely pleased by this.\n\nWhile Esther is home, her attacker suddenly appears. Esther is dragged from the kitchen and is raped by lover Anika Barön (Kristina Klebe) who has performed the attack at Esther's request. Esther then performs oral on Anika. She asks about Melanie, clearly jealous but Esther dismisses her. Esther is next seen in a bar. She is in a toilet where she is having sex while one guy watches another. Once he has finished, the watching guy takes over and the sex gets rougher.\n\nEsther later invites Melanie into her home. Esther asks about Melanie's family and she sticks to her drunk driver story. Esther then tries to seduce Melanie, claiming that she's the only person who understands her. Melanie rejects Esther and when the latter says she knows what happened at the department store, Melanie slaps her and tells her to never contact her again.\n\nEsther takes Anika's truck and tracks down Melanie's house. Sneaking in with a crowbar, Esther finds Peyton in the bathroom and drowns him in the bathtub. Melanie enters and distraughtly asks why Esther did this and she claims that she did \"the things that [Melanie] couldn't do\" and now they can be together. After she says this, Melanie's husband Patrick (Joe Swanberg) walks in with a shotgun and kills Esther.\n\nDays pass and the Michaels are heavily grieving. Patrick is particularly unhinged and fantasizes about having left Esther alive so he could torture her. After noticing Anika's truck and the fact that it hasn't moved ever since the murder, he enters it and finds the registration. However, when he reports it to the police, he is told to stop since it would constitute theft (even though the door was unlocked). Patrick also starts attending a support group but then finds out from a regular that his wife had been secretly attending for a year and that she had claimed Peyton was kidnapped. Patrick confronts Melanie who denies everything and apparently leaves her.\n\nMeanwhile, Anika, enraged by Esther's death, tries to track down the Michaels and finds out where they are from the police informing her about her truck. She goes to Melanie's house, ties her up and plans to wait for Patrick, so she can torture and kill them both. She then hears running water from the bathroom and investigates, believing it is Patrick taking a shower. Instead, she finds him dead. Melanie breaks free and holds Anika at gunpoint and thanks her, claiming she just made a \"much better story\". Melanie fantasizes about being interviewed on TV two years later, having written a book about her experiences on having both her son and husband murdered by a deranged woman and her revenge seeking lover, respectively, as well as advocating for child safety and self-defense and ending the interview by announcing that she has remarried and is now pregnant. Anika then manages to reach for a hammer while Melanie fires the shotgun, ending the movie with a black screen and the sound of the gunshot, the outcome unknown.",
  "synopsis": null
}