{
  "imdb_id": "tt2199711",
  "tmdb_id": "117319",
  "douban_id": null,
  "title": "Vishwaroopam (2013)",
  "genres": [
    "Action",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "148 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm0352032",
      "name": "Kamal Haasan"
    }
  ],
  "writer": [
    {
      "id": "nm0352032",
      "name": "Kamal Haasan",
      "description": null
    },
    {
      "id": "nm0864605",
      "name": "Atul Tiwari",
      "description": "hindi dialogue"
    }
  ],
  "cast": [
    {
      "id": "nm0352032",
      "name": "Kamal Haasan",
      "character": "Vishwanathan /              Wisam Ahmed Kashmiri"
    },
    {
      "id": "nm0097893",
      "name": "Rahul Bose",
      "character": "Omar"
    },
    {
      "id": "nm0001408",
      "name": "Shekhar Kapur",
      "character": "Col. Jaganaathan"
    },
    {
      "id": "nm1136881",
      "name": "Pooja Kumar",
      "character": "Dr. Nirupama"
    },
    {
      "id": "nm1942975",
      "name": "Andrea Jeremiah",
      "character": "Ashmita"
    },
    {
      "id": "nm4188433",
      "name": "Jaideep Ahlawat",
      "character": "Salim"
    },
    {
      "id": "nm0621937",
      "name": "Nassar",
      "character": "Terrorist Leader       (as Nasser)"
    },
    {
      "id": "nm0906226",
      "name": "Zarina Wahab",
      "character": "Psychiatrist"
    },
    {
      "id": "nm1589782",
      "name": "Samrat Chakrabarti",
      "character": "Deepak"
    },
    {
      "id": "nm0027215",
      "name": "Miles Anderson",
      "character": "Dawkins"
    },
    {
      "id": "nm1186736",
      "name": "James Babson",
      "character": "Tom Black"
    },
    {
      "id": "nm0908351",
      "name": "Jude S. Walko",
      "character": "Captain Joe, USMC POW"
    },
    {
      "id": "nm3253151",
      "name": "Chris Kotcher",
      "character": "Tollbooth Operator"
    },
    {
      "id": "nm3814024",
      "name": "Greg Sammis",
      "character": "F.B.I. Agent"
    },
    {
      "id": "nm4035707",
      "name": "David Scott Diaz",
      "character": "FBI Agent Dave"
    },
    {
      "id": "nm2720701",
      "name": "Melissa Bayer",
      "character": "Store Customer"
    },
    {
      "id": "nm1568696",
      "name": "Hayat Asif",
      "character": "Afghan Militant"
    },
    {
      "id": "nm4593503",
      "name": "Kriz Chris Henri Harriz",
      "character": "FBI Agent"
    },
    {
      "id": "nm2364438",
      "name": "Brandon T. David",
      "character": "Bob"
    },
    {
      "id": "nm4301161",
      "name": "Rajesh M. Selva",
      "character": "Abu"
    },
    {
      "id": "nm6069728",
      "name": "Naren Weiss",
      "character": "Osama Bin Laden       (as Nareen)"
    },
    {
      "id": "nm3573347",
      "name": "Matt Fowler",
      "character": "Multiple       (voice)"
    },
    {
      "id": "nm10047233",
      "name": "Vidyuth Sreenivasan",
      "character": "Imtiaz       (as Vidyuth)"
    },
    {
      "id": "nm0864605",
      "name": "Atul Tiwari",
      "character": "Detective Peter Parwani"
    }
  ],
  "overview": "Vishwanathan, a Kathak dance teacher in New York, is in a rather happy marriage with Nirupama who is a nuclear oncologist. Nirupama is from a middle class family in Chennai, she marries Vishwanath (a dance master) to pursue her higher studies in the USA. But when Nirupama wants to break up with her husband, she engages a private detective. That's when the pandora's box opens up.",
  "storyline": "Vishwanathan, a Kathak dance teacher in New York, is in a rather happy marriage with Nirupama who is a nuclear oncologist. She hires a detective to keep a watch on her husband, who apparently ends up in a wrong place that reveals Vishwanathan's true identity.",
  "plot": "The film opens in a rundown pigeon shop in New York City where an old man feeds them. He then sends one pigeon away. It flies high and lands in a skyscraper off the office window of a psychologist who is conducting a session with her client Nirupama (Pooja Kumar), a nuclear oncologist, who begins to confide that hers was a marriage of convenience that provided a safe haven for pursuing her PhD in the U.S.A. for past three years and that her husband Vishwanath alias Viz (Kamal Haasan) is a middle-aged Kathak teacher. She is also put off by Viz's effeminate bearing and is attracted to her boss, Deepankar (Samrat Chakrabarti). Doubting whether her husband has secrets of his own, she hires a private investigator to tail him to probe grounds for divorce. She learns from the private investigator that Viz is a Muslim. In a sudden turn of events, the investigator is killed in a sea-side warehouse by Farukh, a prominent member of the terrorist outfit led by Omar (Rahul Bose). A diary on him gives away Nirupama and the terror group led by Farukh nabs the couple. Deepankar is later killed by Farukh's men.\n\nViz surprises Nirupama by having a fight with the terrorists, kills Farukh and his men at the warehouse and escapes with Nirupama. Omar and Viz have a past, one that takes the story back to circa 2002, to the Al-Qaeda training camps in Afghanistan-Pakistan border. Viz's real name was Wisam Ahmad Kashmiri. He claims to be a Tamil Jihadi in Kashmir, wanted by the Indian Army, with a reward of ₹ 500,000 on his head. Omar accepts him into his team and drives him off to Afghanistan. Wisam becomes a trainer to the Al-Qaeda Jihadi's and also a family friend to Omar. One day, Omar tells Wisam that American prisoners of war are still alive, incarcerated and shifted each fortnight. He orders his deputy Salim (Jaideep Ahlawat) to behead the Captain and capture it on video. The next day, Salim tells Wisam that a new tall guest is expected in the town. Wisam later that night sees Osama bin Laden (Naren Weiss) greeting the Al Qaeda chieftains in a cave. Then, a joint US-led air force begins bombing raid on the town. Omar begins to doubt that there is an informer in the team but mistakenly orders lynching of an innocent man. What follows is a maze of events that go back and forth in time, unraveling a plot where in the terrorists are scraping cesium from oncological equipment to build and trigger a Dirty bomb in New York City.\n\nNirupama is stunned to discover the true identity of Viz, his \"uncle\" (Shekhar Kapur), British \"friend\" Dr Dawkins (Miles Anderson) and the young \"dancer\" Ashmita (Andrea Jeremiah). Viz later reveals that he has a lot of emotional baggage and that he had executed many terrorists including Nassar (Nassar), Omar's boss. His mission is to bust the sleeper-cell of Al Qaeda in the US, which is planning to divert the attention through \"capsules\" capable of emitting mild nuclear radiation tied to pigeons while enabling Abbasi, a Nigerian suicide bomber to detonate the cesium dirty bomb in the city.\n\nTogether, the Wisam team try to counter the plans of Omar. In the ensuing events, Wisam is arrested by the FBI before being rescued by his \"uncle\" Colonel Jagannath and Dr Dawkins is murdered by Salim while picking up a video tape from an antique shop. The FBI later releases Wisam after a call from the Indian embassy and Prime Minister of India, where the true identity of Wizam is revealed as an agent of Research and Analysis Wing (RAW), India. Wisam along with the FBI, take down Abbasi and defuse the Cesium bomb with the help of Nirupama by using a microwave oven as Faraday cage to avoid incoming calls from any mobile phone. Omar and Salim try to escape in a plane. Omar tries to activate bomb through his phone, but fails. He then calls Abbasi, but call is answered by Wisam, who tells him that Abbasi is not alive. Omar is shocked to hear this but escapes with Salim in his plane. The film ends with Wisam indicating that he would now go after Omar, alluding to a sequel set in India.",
  "synopsis": "An Afghani Al-Qaeda Jihadi Omar (Rahul Bose), his accomplice Salim (Jaideep Ahlawat) and their international terror network, plots to attack New York with a \"Cesium-bomb\". Vishwanath alias Wiz (Kamal Haasan) is a Kathak teacher who lives with his wife Nirupama (Pooja Kumar), a nuclear oncologist, in New York. Nirupama confides with a psychologist that its a marriage of convenience that provided her a safe haven for pursuing her Ph.D in the U.S.A. The age gap between them notwithstanding, she is put off by Vishwanaths effeminate traits and is attracted to her boss, Deepak (Samrat Chakrabarti). Doubting whether her husband has secrets of his own, she hires a private investigator to trail him. She learns from the private investigator that Vishwanath is not a Hindu but a Muslim. In a sudden turn of events, the investigator gets killed by Farukh, a prominent member of the terrorist outfit led by Omar. A business card on his wallet gives away Nirupama and the terror group led by Farukh nabs the couple. The outfit operates from a warehouse on the outskirts of the city where the couple is being interrogated. It is revealed that Deepak was ensuring funds for the jihadi sleeper cell.\nVishwanath is involved in a fight with the terrorists, kills Farukh and his men at the warehouse and escapes with Nirupama. Omar and Vishwanath have a past, one that takes the story back by almost a decade, to the Al-Qaeda training camps in Afghanistan. Vishwanath alias Wisam Ahmad Kashmiri was one of the trainers in the Al-Qadea terror camps across the Durand Line. It also showcases Inter-Services Intelligence support to the terror groups. Wisam is shown as a jihadi in Kashmir, wanted by the Indian Army, who fled to Waziristan. He doesn't know Pashto, but knows Hindi. It also shows American forces attacking Afghanistan. What follows is a maze of events that go back and forth in time, unraveling a plot where in the terrorists are accumulating cesium from oncology devices to trigger a blast in New York.\nNirupama is stunned to discover the true identity of her husband Vishwanath, his uncle (Shekhar Kapur), American accomplice Dawkins (Miles Anderson) and the young dancer Ashmita (Andrea Jeremiah) at her husbands dance school. Vishwanath is revealed to be Wisam Ahmad Kashmiri, an Indian Muslim RAW agent who married Nirupama to investigate Deepak and his boss Omar in connection with a bomb blast in the heart of New York. He had assassinated many prominent terrorists in Afghanistan, including Nassar (Nassar), Omar's boss. His mission is to bust the sleeper-cell of the Jihadis in the United States of America, which is planning to divert the attention through \"capsules\" capable of emitting mild nuclear radiation tied to pigeons in New York city while enabling Abbasi, a Nigerian suicide bomber to detonate the cesium bomb in the city.\nTogether, the team try to counter the plans of Omar and his group that could destroy the most of the New York city. In the ensuing events, Vishwanath is arrested by the FBI before being rescued by his uncle and Dawkins is murdered by Salim. Angered by this murder, Colonel Jagnath, Wisam's boss, goes after Omar and Salim. The Prime Minister of India directs Wisam to take any step to avert the catastrophe. Wisam along with the FBI, take down Abbasi and defuse the Ceasium bomb. Omar and Salim try to escape in a plane. Omar tries to activate bomb through his phone, but failed. He then called Abbasi, but call is attended by Wisam, who tells him that Abbasi is not alive, Omar is shocked to hear this but escapes with Salim in his plane. The film ends with Wisam indicating that he would now go after Omar alluding to Vishwaroopam 2 set in India."
}