{
  "imdb_id": "tt2195548",
  "tmdb_id": "113148",
  "douban_id": null,
  "title": "Prince Avalanche (2013)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm0337773",
      "name": "David Gordon Green"
    }
  ],
  "writer": [
    {
      "id": "nm0337773",
      "name": "David Gordon Green",
      "description": "written by"
    },
    {
      "id": "nm2619779",
      "name": "Hafsteinn Gunnar Sigurðsson",
      "description": "based on the film \"Either Way\""
    }
  ],
  "cast": [
    {
      "id": "nm0748620",
      "name": "Paul Rudd",
      "character": "Alvin"
    },
    {
      "id": "nm0386472",
      "name": "Emile Hirsch",
      "character": "Lance"
    },
    {
      "id": "nm0499223",
      "name": "Lance LeGault",
      "character": "Truck Driver"
    },
    {
      "id": "nm5370274",
      "name": "Joyce Payne",
      "character": "Lady"
    },
    {
      "id": "nm5371145",
      "name": "Gina Grande",
      "character": "Madison"
    },
    {
      "id": "nm1119645",
      "name": "Lynn Shelton",
      "character": "Madison       (voice)"
    },
    {
      "id": "nm5370909",
      "name": "Larry Kretschmar",
      "character": "Lumberjack"
    },
    {
      "id": "nm5371251",
      "name": "Enoch Moon",
      "character": "Lumberjack"
    },
    {
      "id": "nm5370212",
      "name": "David L. Osborne Jr.",
      "character": "Lumberjack"
    },
    {
      "id": "nm5370223",
      "name": "Danni Wolcott",
      "character": "Lumberjack"
    },
    {
      "id": "nm5371218",
      "name": "Morgan Calderoni",
      "character": "Kid"
    },
    {
      "id": "nm5370370",
      "name": "Savanna Porter",
      "character": "Kid"
    },
    {
      "id": "nm5370592",
      "name": "Juniper Smith",
      "character": "Kid"
    }
  ],
  "overview": "Two highway road workers spend the summer of 1988 away from their city lives. The isolated landscape becomes a place of misadventure as the men find themselves at odds with each other and the women they left behind.",
  "storyline": "After a rough time working a night shift job in the city, Alvin is spending the summer on a remote two-man public works crew, painting lines on newly paved roads through what is a recently wildfire-ravaged region of Texas. He is camping along the way, living off the land, even doing so on his days off. He is what he considers a responsible man, earning and sending money to his girlfriend, Madison, a single mother, so that she need not concern herself with anything besides child rearing. The junior second that Alvin hires for his crew is Madison's brother, Lance. Alvin's controlling and judgmental nature comes to the surface in his dealings with more immature and irresponsible Lance, who goes back to the city on the weekends so that he can have \"his little man squeezed\", something he cannot understand in Alvin being without Madison or any woman for such a long stretch of time. Alvin prefers to stay in the burnt out woods on the weekends as being alone with his thoughts and his chores -...",
  "plot": "In 1988, an odd pair of sorts, meditative and stern Alvin (Paul Rudd) and his girlfriend's brother, Lance (Emile Hirsch), dopey and insecure, leave the city behind to spend the summer in solitude repainting traffic lines down the center of a country highway ravaged by wildfire. As they sink into their job in the remarkable landscape, they learn more than they want to about each other and their own limitations. An unlikely friendship develops through humor and nasty exchanges, leading to surprising affection.",
  "synopsis": null
}