{
  "imdb_id": "tt2119511",
  "tmdb_id": "131198",
  "douban_id": null,
  "title": "Sea, No Sex & Sun (2012)",
  "genres": [
    "Comedy"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "89 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.3,
  "director": [
    {
      "id": "nm1290014",
      "name": "Christophe Turpin"
    }
  ],
  "writer": [
    {
      "id": "nm1290014",
      "name": "Christophe Turpin",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0856493",
      "name": "Fred Testot",
      "character": "Guillaume"
    },
    {
      "id": "nm0241383",
      "name": "Antoine Duléry",
      "character": "Pierre"
    },
    {
      "id": "nm1922676",
      "name": "Julie Ferrier",
      "character": "Justine"
    },
    {
      "id": "nm0563254",
      "name": "Arthur Mazet",
      "character": "Alex"
    },
    {
      "id": "nm0222066",
      "name": "Armelle Deutsch",
      "character": "Raphaëlle"
    },
    {
      "id": "nm0342393",
      "name": "Anouk Grinberg",
      "character": "Claude"
    },
    {
      "id": "nm0099084",
      "name": "Patrick Bouchitey",
      "character": "Serge"
    },
    {
      "id": "nm2300160",
      "name": "Alma Jodorowsky",
      "character": "Diane"
    },
    {
      "id": "nm2808900",
      "name": "Daphné Chollet",
      "character": "Camille"
    },
    {
      "id": "nm1912032",
      "name": "Arnaud Prusak",
      "character": "Hugo"
    },
    {
      "id": "nm2253175",
      "name": "Jérémy Denisty",
      "character": "Dimitri"
    },
    {
      "id": "nm5049071",
      "name": "Louna Portefaix",
      "character": "Ariane"
    },
    {
      "id": "nm3226187",
      "name": "Anthony Sonigo",
      "character": "Nico"
    },
    {
      "id": "nm3332179",
      "name": "Esther Comar",
      "character": "Jeune fille bar Les Chandelles"
    },
    {
      "id": "nm5049054",
      "name": "Robin Le Clève",
      "character": "Copain surfeur de Camille"
    },
    {
      "id": "nm5048967",
      "name": "Quentin Bellamy",
      "character": "Copain surfeur de Camille"
    },
    {
      "id": "nm5049059",
      "name": "Loïc Guego",
      "character": "Copain surfeur de Camille"
    },
    {
      "id": "nm5049015",
      "name": "Matthieu Kassimo",
      "character": "Pote du lycée 1"
    },
    {
      "id": "nm5049096",
      "name": "Simon Ferray",
      "character": "Pote du lycée 2"
    },
    {
      "id": "nm5049032",
      "name": "Adrian Vinatier",
      "character": "Pote du lycée 3"
    },
    {
      "id": "nm5049051",
      "name": "Christophe Kergosien",
      "character": "Jeune homme contraception"
    },
    {
      "id": "nm5049105",
      "name": "Charline Pénin",
      "character": "Jeune femme contraception"
    },
    {
      "id": "nm5049079",
      "name": "Emma Rigoulay",
      "character": "Doublure Ariane"
    },
    {
      "id": "nm5048956",
      "name": "Pelelo Malama Suve",
      "character": "Videur Les Chandelles"
    },
    {
      "id": "nm5048962",
      "name": "Daniel Le Furaut",
      "character": "Physio Les Chandelles"
    },
    {
      "id": "nm0895527",
      "name": "Alain Veyssier",
      "character": "L'autre quinqua des Chandelles       (as Alain Veissier)"
    },
    {
      "id": "nm8152413",
      "name": "Diane Martin",
      "character": ""
    }
  ],
  "overview": "A comedy that affectionately pokes fun at men and their eternal quest for satisfaction. At last, a film about self-acceptance and renunciation.",
  "storyline": "A comedy that affectionately pokes fun at men and their eternal quest for satisfaction. At last, a film about self-acceptance and renunciation.",
  "plot": "In an African desert millions of years ago, a tribe of ape-men is driven away from their water hole by a rival tribe. They awaken to find a featureless black monolith has appeared before them. Guided in some fashion by the monolith, they learn how to use a bone as a weapon and drive their rivals away from the water hole.\n\nMillions of years later, a Pan Am space plane carries Dr. Heywood Floyd to a space station orbiting Earth for a layover on his trip to Clavius Base, a United States outpost on the moon. After Floyd has a videophone call with his daughter, his Soviet scientist friend and her colleague ask about rumors of a mysterious epidemic at Clavius. Floyd declines to answer. At Clavius, Floyd heads a meeting of base personnel, apologizing for the epidemic cover story but stressing secrecy. His mission is to investigate a recently found artifact buried four million years ago. Floyd and others ride in a Moonbus to the artifact, a monolith identical to the one encountered by the ape-men. Sunlight strikes the monolith and a loud high-pitched radio signal is heard.\n\nEighteen months later, the United States spacecraft Discovery One is bound for Jupiter. On board are mission pilots and scientists Dr. David Bowman and Dr. Frank Poole, along with three other scientists in cryogenic hibernation. Most of Discovery's operations are controlled by the ship's computer, HAL 9000, referred to by the crew as \"Hal\". Hal states that he is \"foolproof and incapable of error\". When Bowman questions Hal on the purpose of the mission, Hal responds by reporting the imminent failure of an antenna control device. The astronauts retrieve it in an EVA pod but find nothing wrong. Hal suggests reinstalling the device and letting it fail so the problem can be found. Mission Control advises the astronauts that results from their twin HAL 9000 indicate that Hal is in error. Hal insists that the problem, like previous issues ascribed to HAL series units, is due to human error. Concerned about Hal's behavior, Bowman and Poole enter an EVA pod to talk without Hal overhearing, and agree to disconnect Hal if he is proven wrong. Hal secretly follows their conversation by lip reading.\n\nWhile Poole is on a space walk outside his EVA pod attempting to replace the unit, Hal takes control of the pod, severs his oxygen hose and sets him adrift. Bowman takes another pod to attempt rescue. Meanwhile, Hal turns off the life support functions of the crewmen in suspended animation. When Bowman returns to the ship with Poole's body, Hal refuses to let him in, stating that the astronauts' plan to deactivate him jeopardizes the mission. Bowman opens the ship's emergency airlock manually, enters the ship, and proceeds to Hal's processor core. Hal tries to reassure Bowman, then pleads with him to stop, and finally expresses fear. As Bowman gradually deactivates the circuits controlling HAL's higher intellectual functions, HAL regresses to his earliest programmed memory, the song \"Daisy Bell\", which he sings for Bowman.\n\nWhen Bowman finally disconnects Hal, a prerecorded video message from Floyd reveals the existence of the monolith on the moon, its purpose and origin unknown. With the exception of one short but extremely powerful radio emission aimed at Jupiter, the object has been inert.\n\nAt Jupiter, Bowman leaves Discovery One in an EVA pod to investigate another monolith discovered in orbit around the planet. The pod is pulled into a vortex of colored light, and Bowman races across vast distances of space, viewing bizarre cosmological phenomena and strange landscapes of unusual colors.\n\nBowman finds himself in a bedroom appointed in the neoclassical style. He sees, and then becomes, older versions of himself, first standing in the bedroom, middle-aged and still in his spacesuit, then dressed in leisure attire and eating dinner, and finally as an old man lying in the bed. A monolith appears at the foot of the bed, and as Bowman reaches for it, he is transformed into a fetus enclosed in a transparent orb of light. The new being floats in space beside the Earth, gazing at it.",
  "synopsis": null
}