{
  "imdb_id": "tt2147439",
  "tmdb_id": "179927",
  "douban_id": null,
  "title": "My Neighbourhood (2012)",
  "genres": [
    "Documentary",
    "Short",
    "News"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "25 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.7,
  "director": [
    {
      "id": "nm1646089",
      "name": "Julia Bacha"
    },
    {
      "id": "nm1768778",
      "name": "Rebekah Wingert"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm4822698",
      "name": "Sara Benninga",
      "character": ""
    },
    {
      "id": "nm4821910",
      "name": "Terry Benninga",
      "character": ""
    },
    {
      "id": "nm4821881",
      "name": "Zvi Benninga",
      "character": ""
    },
    {
      "id": "nm4822764",
      "name": "Mohammed el Kurd",
      "character": ""
    },
    {
      "id": "nm4822780",
      "name": "Rifqa el Kurd",
      "character": ""
    }
  ],
  "overview": "Mohammed El Kurd is a Palestinian boy growing up in the neighbourhood of Sheikh Jarrah in the heart of East Jerusalem. When Mohammed turns 11, his family is forced to give up part of their home to Israeli settlers, who are leading a campaign of court-sanctioned evictions to guarantee Jewish control of the area.  Shortly after their displacement, Mohammed’s family and other residents begin peacefully protesting against the evictions, determined not to lose their homes for good. In a surprising turn, they are quickly joined by scores of Israeli supporters who are horrified to see what is being done in their name. Among them is Jewish West Jerusalem resident Zvi Benninga and his sister Sara, who develop a strong relationship with Mohammed and his family as they take on a leading role in organizing the protests.",
  "storyline": "Mohammed El Kurd is a Palestinian teenager growing up in the heart of East Jerusalem. When Mohammed's family is forced to give up a part of their home to Israeli settlers, local residents begin peaceful protests and in a surprising turn, are quickly joined by scores of Israeli supporters. Mohammed comes of age in the face of unrelenting tension with his neighbors and unexpected cooperation with Israeli allies in his backyard.",
  "plot": null,
  "synopsis": null
}