{
  "imdb_id": "tt2112210",
  "tmdb_id": "128136",
  "douban_id": null,
  "title": "My Awkward Sexual Adventure (2012)",
  "genres": [
    "Comedy",
    "Romance"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "98 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.1,
  "director": [
    {
      "id": "nm0308498",
      "name": "Sean Garrity"
    }
  ],
  "writer": [
    {
      "id": "nm0155913",
      "name": "Jonas Chernick",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0155913",
      "name": "Jonas Chernick",
      "character": "Jordan Abrams"
    },
    {
      "id": "nm0358922",
      "name": "Emily Hampshire",
      "character": "Julia Bowe"
    },
    {
      "id": "nm0543215",
      "name": "Sarah Manninen",
      "character": "Rachel Stern"
    },
    {
      "id": "nm0006710",
      "name": "Vik Sahay",
      "character": "Dandak"
    },
    {
      "id": "nm1740097",
      "name": "Melissa Marie Elias",
      "character": "Reshma       (as Melissa Elias)"
    },
    {
      "id": "nm1011431",
      "name": "Marina Stephenson Kerr",
      "character": "Ruth"
    },
    {
      "id": "nm0068411",
      "name": "Mike Bell",
      "character": "Naked Tom"
    },
    {
      "id": "nm3870572",
      "name": "Andrea del Campo",
      "character": "Sapphire"
    },
    {
      "id": "nm1568554",
      "name": "Onalee Ames",
      "character": "Gypsy the Stripper"
    },
    {
      "id": "nm0032140",
      "name": "Randy Apostle",
      "character": "Rabbi Finklestein"
    },
    {
      "id": "nm1969106",
      "name": "Dean Harder",
      "character": "Bank Manager"
    },
    {
      "id": "nm0331341",
      "name": "Tamara Gorski",
      "character": "Tanya"
    },
    {
      "id": "nm0176164",
      "name": "Sarah Constible",
      "character": "Kelly"
    },
    {
      "id": "nm1779181",
      "name": "Jessica Burleson",
      "character": "Melanie"
    },
    {
      "id": "nm0570819",
      "name": "Stephen Eric McIntyre",
      "character": "Spike the Bouncer"
    },
    {
      "id": "nm0849637",
      "name": "Gordon Tanner",
      "character": "Flight Attendant       (as Gord Tanner)"
    },
    {
      "id": "nm4789039",
      "name": "Curt Keilback",
      "character": "Reporter"
    },
    {
      "id": "nm4383217",
      "name": "Ryan Miller",
      "character": "Transvestite"
    },
    {
      "id": "nm4696861",
      "name": "Adrian McLean",
      "character": "Cabbie"
    },
    {
      "id": "nm3647084",
      "name": "Alan Castanaga",
      "character": "Bartender       (as Alan Castanage)"
    },
    {
      "id": "nm2819205",
      "name": "Steed Crandell",
      "character": "Massage Parlor Owner"
    },
    {
      "id": "nm4127156",
      "name": "Aisha Alfa",
      "character": "Young Woman"
    },
    {
      "id": "nm4789051",
      "name": "Andrew Johnson",
      "character": "Naked Man #1"
    },
    {
      "id": "nm4789032",
      "name": "Laura Olafson",
      "character": "Naked Woman"
    },
    {
      "id": "nm2176276",
      "name": "Matthew Stefanson",
      "character": "Naked Man #2"
    },
    {
      "id": "nm2183502",
      "name": "Robert Kostyra",
      "character": "Skeet"
    }
  ],
  "overview": "A hyper-repressed and schlubby accountant (Jonas Chernick) strikes a deal with a worldly but disorganized stripper (Emily Hampshire): he'll help her with her crushing debt if she helps him become a better lover. Sharp direction by the versatile Sean Garrity and a very funny script by Chernick ensure for an uproarious — and surprisingly educational — sex comedy. (TIFF)",
  "storyline": "Thirty-seven year old Winnipeg-based accountant Jordan Abrams, a proverbial doormat of a man, has pined after Rachel Stern since he was twelve. He finally got her to be his girlfriend last year after she being a peripheral or not so peripheral part of his life all these years. Now, in a relationship for a year, Jordan plans on asking her to marry him on a week-long romantic vacation they are taking to Niagara Falls. Rachel not only decides not to go on the trip, but dumps him when he, learning that she isn't going, asks her to marry him the day before the trip instead. The primary reason she dumps him?: he's lousy in bed, she not being able to envision bad, boring sex with him for the rest of her life. Rachel convinces him to take the vacation by himself, instead hanging out in Toronto with his college friend Dandak, his return from the vacation when they will talk about the break-up in more detail. Dandak, a sex machine, sees his role in his mending his friend's broken heart as ...",
  "plot": "Jordan Abrams (Chernik), a conservative Jewish accountant, lives a stable but rather boring life with his girlfriend Rachel Stern (Manninen). The night before they are supposed to leave for an extended vacation where Jordan had been planning to propose, Rachel says she cannot marry him due to his sexual ineptitude. Rachel leaves him in order to explore her own sexuality.\n\nDetermined to change so that he can win Rachel back, Jordan first seeks advice from his lady-killer friend Dandak (Sahay), who advises him to try attending a strip club. While there, he meets stripper Julia and buys her chips from the club vending machine when she has no money, for the sole reason of \"good karma payback.\" After Jordan drinks too much and is thrown out into the back trash pile, where he is then robbed of his pants and wallet. Julia finds him and, out of a guilty conscience, brings him back to her place to sleep off the alcohol.\n\nNext morning, Jordan wakes up in Julia's apartment and happens to see her financial papers showing a large amount of debt, as well as boxes of sex toys and a spotless kitchen. Julia gives Jordan some cookies which are the best Jordan has ever tasted; it turns out Julia is a talented cook as well as a dancer. Jordan recruits Julia to be his teacher to broaden his sexual horizons, in exchange for managing her finances.\n\nTogether, they explore strip clubs, sensual massage parlors, cross-dressing, oral sex techniques, and sadomasochism. Meanwhile, Rachel tries to live a wild sex life of her own, dating several men, having group sex, and attending sexy costume parties, but is consistently left thoroughly unsatisfied by her experiences.\n\nOne night, in Julia's apartment and under her direction, Jordan handcuffs and gags Julia in order to practice a dominant posture, and Rachel chooses that moment to show up and beg Jordan to come back to her. Rachel sees and hears him with the bound Julia and impulsively runs from the apartment. Jordan runs after her. While they try to reconcile on the stairs, repo men ascend past them to Julia's apartment, remove all her furniture and rob her of all the cash in her savings box, while she remains helplessly bound.\n\nJordan eventually decides not to get back together with Rachel after all, as he comes to realize he loves Julia. But Julia's experience of watching all her stuff removed from her house while Jordan did nothing to help makes her not want to see him again. After agonizing, Jordan returns to the strip club where he first met Julia to reconcile with her. Eventually Julia accepts his apology, and Jordan surprises her by purchasing a nearby vacant building and remodeling it into the restaurant that Julia always desired to own.",
  "synopsis": null
}