{
  "imdb_id": "tt2181889",
  "tmdb_id": "212814",
  "douban_id": null,
  "title": "Death Do Us Part (2014)",
  "genres": [
    "Horror",
    "Thriller"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "89 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.3,
  "director": [
    {
      "id": "nm2288083",
      "name": "Nicholas Humphries"
    }
  ],
  "writer": [
    {
      "id": "nm3149293",
      "name": "Ryan Copple",
      "description": null
    },
    {
      "id": "nm1193045",
      "name": "Peter Benson",
      "description": null
    },
    {
      "id": "nm1365460",
      "name": "Julia Benson",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1365460",
      "name": "Julia Benson",
      "character": "Kennedy Jamieson"
    },
    {
      "id": "nm1193045",
      "name": "Peter Benson",
      "character": "Ryan Harris"
    },
    {
      "id": "nm2422305",
      "name": "Emilie Ullerup",
      "character": "Emily Hawkins"
    },
    {
      "id": "nm0154000",
      "name": "Christine Chatelain",
      "character": "Hannah Jamieson"
    },
    {
      "id": "nm1004124",
      "name": "Kyle Cassie",
      "character": "Chet Donovan"
    },
    {
      "id": "nm1534707",
      "name": "Benjamin Ayres",
      "character": "Derrick Harris"
    },
    {
      "id": "nm1733492",
      "name": "Dave Collette",
      "character": "Bo Emery"
    },
    {
      "id": "nm0234928",
      "name": "Aaron Douglas",
      "character": "Harry Simpson"
    },
    {
      "id": "nm0494892",
      "name": "Viv Leacock",
      "character": "Steve"
    },
    {
      "id": "nm3720732",
      "name": "Willis Horst",
      "character": "Gunther"
    }
  ],
  "overview": "Kennedy Jamieson, a wealthy socialite, has waited her whole life to have the perfect wedding. Engaged to the charming Ryan Harris, the young couple is just a week away from the big day but hasn't had a chance to celebrate their respective bachelor/bachelorette parties. Ryan's best man Chet books a remote cabin in the woods to throw them a 'Jack and Jill' stag that they'll never forget. Out in the middle of nowhere, things take a horrifying turn as members of the group are brutally picked off one by one. What started out as a celebration quickly descends into a bloody nightmare. Friendships are ripped apart and accusations fly in this blood filled psychological horror with a whodunit twist.",
  "storyline": "Kennedy Jamieson, a wealthy socialite, has waited her whole life to have the perfect wedding. Engaged to the charming Ryan Harris, the young couple is just a week away from the big day but hasn't had a chance to celebrate their respective bachelor/bachelorette parties. Ryan's best man Chet books a remote cabin in the woods to throw them a 'Jack and Jill' stag that they'll never forget. Out in the middle of nowhere, things take a horrifying turn as members of the group are brutally picked off one by one. What started out as a celebration quickly descends into a bloody nightmare. Friendships are ripped apart and accusations fly in this blood filled psychological horror with a whodunit twist.",
  "plot": "A disheveled woman in a bridal gown is found stumbling along a highway, and is brought to a ranger station. As they wait for the sheriff, the only on-duty ranger asks the woman her name, and what happened to her. The bride refers to herself as Kennedy, and the film flashes back to the previous day, to when Kennedy, her fiancé Ryan, Kennedy's half-sister Hannah, their friend Emily, Ryan's cousin Derrick, and Ryan's friend Chet travelled to a secluded cabin for a Stag and doe party.\n\nAs the characters set up at the cabin, it is revealed that almost all of them have a dark secret; Kennedy's unspecified mental illness is flaring up due to wedding-related stress, Ryan is having an affair with Hannah, Derrick intends to extort Kennedy through Ryan in order to get the money he owes a drug dealer, and the caretaker, Bo, is the prime suspect in the disappearance of his wife, Susan. That night, while everyone else is participating in a scavenger hunt, Derrick is murdered with an axe. Upon noticing that Derrick is missing, the others go to look for him, and become separated, with Kennedy and Ryan finding Derrick's corpse, and Emily presumably being murdered after she, Chet, and Hannah encounter Bo, who has the axe that was used to kill Derrick. The remaining partiers regroup at the cabin, and discover that the power has been cut, the vehicle has been sabotaged, and that all of the cellular phones have been thrown into the stove. Chet then goes missing, Bo is found dying from a head wound, and Hannah is knifed by someone wearing a burlap sack as a mask. Kennedy stumbles onto Emily and Chet's bodies, and then Hannah's, which Ryan is with. Thinking Ryan is the killer, Kennedy attacks him, and runs off.\n\nAt dawn, Ryan returns to the cabin, where he and Kennedy fight, ending with Kennedy stabbing Ryan to death after Ryan spitefully declares that he never loved her. Kennedy then goes into hysterics, puts on her wedding dress, and runs into Emily, who claims that she had only been injured, and had faked being dead. The two women begin to walk to safety, until Emily lets slip information that only the killer could know. Kennedy confronts Emily, who asserts that she slew Derrick and Hannah, and had intended to murder Ryan, to protect her, with Chet and Bo being collateral damage. Kennedy snaps, and strangles Emily.\n\nThe film returns to the intro, and the bride lifts her veil to reveal that she is Emily, who had recovered, bludgeoned Kennedy, and taken her gown. The ranger offers his condolences for all that \"Kennedy\" has gone through, and when he gives Emily a pen to write down who he should contact for her, she stabs him in the neck with it, and walks out into the woods, leaving her fate unknown.",
  "synopsis": null
}