{
  "imdb_id": "tt2103254",
  "tmdb_id": "226486",
  "douban_id": null,
  "title": "Tammy (2014)",
  "genres": [
    "Comedy",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    },
    {
      "runtime": "100 min",
      "description": "extended cut"
    }
  ],
  "imdb_rating": 4.9,
  "director": [
    {
      "id": "nm1229520",
      "name": "Ben Falcone"
    }
  ],
  "writer": [
    {
      "id": "nm0565250",
      "name": "Melissa McCarthy",
      "description": "written by &"
    },
    {
      "id": "nm1229520",
      "name": "Ben Falcone",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0565250",
      "name": "Melissa McCarthy",
      "character": "Tammy"
    },
    {
      "id": "nm0000215",
      "name": "Susan Sarandon",
      "character": "Pearl"
    },
    {
      "id": "nm0000870",
      "name": "Kathy Bates",
      "character": "Lenore"
    },
    {
      "id": "nm0005049",
      "name": "Allison Janney",
      "character": "Deb"
    },
    {
      "id": "nm0000101",
      "name": "Dan Aykroyd",
      "character": "Don"
    },
    {
      "id": "nm0243233",
      "name": "Mark Duplass",
      "character": "Bobby"
    },
    {
      "id": "nm0170550",
      "name": "Gary Cole",
      "character": "Earl"
    },
    {
      "id": "nm0269542",
      "name": "Nat Faxon",
      "character": "Greg"
    },
    {
      "id": "nm0001057",
      "name": "Toni Collette",
      "character": "Missi"
    },
    {
      "id": "nm0644897",
      "name": "Sandra Oh",
      "character": "Susanne"
    },
    {
      "id": "nm1229520",
      "name": "Ben Falcone",
      "character": "Keith Morgan"
    },
    {
      "id": "nm1807222",
      "name": "Sarah Baker",
      "character": "Becky"
    },
    {
      "id": "nm0931528",
      "name": "Rich Williams",
      "character": "Larry"
    },
    {
      "id": "nm1776820",
      "name": "Steve Little",
      "character": "Jet Ski Rental Guy"
    },
    {
      "id": "nm5880899",
      "name": "Dakota Lee",
      "character": "Kathleen"
    },
    {
      "id": "nm1171196",
      "name": "Mark L. Young",
      "character": "Jesse"
    },
    {
      "id": "nm3221437",
      "name": "Mia Rose Frampton",
      "character": "Karen"
    },
    {
      "id": "nm1133719",
      "name": "Steve Mallory",
      "character": "Cashier"
    },
    {
      "id": "nm6583243",
      "name": "Big Al Hall",
      "character": "Possum Creek Bluegrass Band"
    },
    {
      "id": "nm6583244",
      "name": "Jones Smith",
      "character": "Possum Creek Bluegrass Band"
    },
    {
      "id": "nm6583245",
      "name": "Joe Baxter",
      "character": "Possum Creek Bluegrass Band"
    },
    {
      "id": "nm6583246",
      "name": "Benjamin Chontos",
      "character": "Possum Creek Bluegrass Band"
    },
    {
      "id": "nm6583247",
      "name": "Sean Gould",
      "character": "Possum Creek Bluegrass Band"
    },
    {
      "id": "nm4882635",
      "name": "Keith Welborn",
      "character": "DJ"
    },
    {
      "id": "nm4460264",
      "name": "Oscar Gale",
      "character": "Javier"
    },
    {
      "id": "nm0808865",
      "name": "Justin Smith",
      "character": "Paramedic"
    },
    {
      "id": "nm5702129",
      "name": "Willie Hill",
      "character": "Prison Guard"
    },
    {
      "id": "nm0360393",
      "name": "Zach Hanner",
      "character": "Man at Blue Post Bar-B-Que"
    },
    {
      "id": "nm0883195",
      "name": "Jason Vail",
      "character": "Man at Blue Post Bar-B-Que"
    },
    {
      "id": "nm0482799",
      "name": "Leon Lamar",
      "character": "Old Man with Walker"
    },
    {
      "id": "nm0233539",
      "name": "Larry Dorf",
      "character": "Officer Mannis"
    },
    {
      "id": "nm3239993",
      "name": "Ricky Muse",
      "character": "Officer Curtis"
    },
    {
      "id": "nm0917430",
      "name": "Barbara Weetman",
      "character": "Officer Carty       (as Barbara Wheetman)"
    },
    {
      "id": "nm0280952",
      "name": "William Flaman",
      "character": "La Grange Bail Cop"
    },
    {
      "id": "nm1411388",
      "name": "Rey Hernandez",
      "character": "Cop at Lakehouse"
    },
    {
      "id": "nm2011573",
      "name": "Penn Holderness",
      "character": "News Anchor"
    },
    {
      "id": "nm3316394",
      "name": "Michelle Li",
      "character": "News Reporter"
    },
    {
      "id": "nm0924219",
      "name": "Raven Angeline Whisnant",
      "character": "Charlotte"
    },
    {
      "id": "nm0427828",
      "name": "Damon Jones",
      "character": "Jerry Miller"
    },
    {
      "id": "nm6583248",
      "name": "Sandy McCarthy",
      "character": "Two Old Ladies Leaving a Bar"
    },
    {
      "id": "nm6583249",
      "name": "Margo Passas",
      "character": "Two Old Ladies Leaving a Bar"
    },
    {
      "id": "nm1229014",
      "name": "Kent Sublette",
      "character": "Man Ordering Ribs       (as Ken Sublette)"
    },
    {
      "id": "nm1131775",
      "name": "Justin Matthew Smith",
      "character": "Paramedic"
    }
  ],
  "overview": "After losing her job and learning that her husband has been unfaithful, a woman hits the road with her profane, hard-drinking grandmother.",
  "storyline": "Tammy, who was recently fired from a Topper Jack's fast food restaurant, returns home only to find her husband enjoying a romantic meal with the neighbor. She quickly packs her necessities, and travels down three houses to her parent's home. Upon denied use of her mom's car to drive to Niagara Falls, she quickly resorts to an \"ailing\" grandmother, who also lives in the home...Only instead of traveling alone, Grandma Pearl wants in on the road trip. After realizing Grandma Pearl has the funds, they hit the road. Pearl soon proves to be quite the alcoholic despite her diabetes, and Tammy quickly turns into the \"baby-sitter.\" From finding love in a bar to robbing a Topper Jack's in order to bail Pearl out of jail,the quirky adventure will have you finding yourself riding along for the misadventures of Tammy.",
  "plot": "In Murphysboro, Illinois, Tammy Banks (Melissa McCarthy) strikes a deer on the way to her job at Topper Jack's (a fictional fast food restaurant), causing significant damage to her vehicle. Once she arrives at Topper Jack's, her supervisor, Keith Morgan (Ben Falcone), is forced to fire her for her frequent tardiness. Upon leaving, Tammy indignantly contaminates and steals food. After her car stalls on the way home on Illinois Route 13, she walks home to find her husband, Greg (Nat Faxon), eating a romantic meal with their neighbor, Missi (Toni Collette). Upset, Tammy leaves and walks two doors down to her parents' house.\n\nShe tells her mother, Deb (Allison Janney), about her plans to leave and takes her grandmother Pearl's (Susan Sarandon) car. Pearl requests to come along. Tammy initially refuses but ultimately agrees when Pearl proves that she has a large sum of cash. Tammy has beer with Pearl, and the next morning they wake up near a park where Pearl convinces Tammy not to go back home. Pearl wants to go to Niagara Falls with Tammy since she hadn't gone as a child. Along the way the two stop in a bar in Louisville, Kentucky, Tammy meets Earl Tillman (Gary Cole) and his son Bobby (Mark Duplass), and Earl hooks up with Pearl. Tammy and Bobby begin to make a love connection as Pearl and Earl drunkenly make out in the car. Bobby gives Tammy his number to call him so he can pick up Earl. Back at the hotel, Tammy is forced to sleep outside. The next morning, Bobby picks up Earl, and the two leave. Tammy, infuriated with Pearl, leaves her, but returns after feeling guilty. Tammy and Pearl are arrested after Pearl gets caught buying a case of beer for two teenagers (Mark L. Young and Mia Rose Frampton) as well as shoplifting a pint of whiskey for herself. Tammy is released, but Pearl stays at the jail for possessing illegal prescription drugs.\n\nTo bail out Pearl, Tammy robs a Topper Jack's, where she converses with employees Becky (Sarah Baker) and Larry (Rich Williams). Finally having obtained the money, she rushes to the prison to bail Pearl out, but Bobby has already bailed her out. With the help of Pearl's wealthy lesbian cousin Lenore (Kathy Bates) (who made her fortune off of a small chain of pet supply stores), they destroy the car to hide the evidence from the robbery. The two then stay at the home of Lenore and her wife, Susanne (Sandra Oh). At a 4th of July party thrown at the house, Pearl gets drunk and humiliates Tammy by making rude comments about her weight and appearance in front of all the guests. After Tammy runs off to the dock on the lake by the house, Lenore follows her to both comfort her and offer her some tough love, telling her that she always complains about her life, but never does anything to change it. She tells Tammy that if she wants to make things better for herself she needs to work hard to make it happen.\n\nLater in the morning, Tammy brings coffee to Pearl, who is presumably asleep outside. After repeatedly trying to wake her, Pearl does not wake up and Tammy assumes she is dead. She, Lenore, and Susanne grieve Pearl's death, but Pearl suddenly awakens, much to everyone's shock. Pearl was actually unconscious due to the large amount of alcohol she drank the previous night. Tammy is relieved, and she tearfully demands Pearl to get help for her drinking problem. The ambulance arrives and takes Pearl to the hospital. The police arrive as well, and Tammy is arrested for her robbery of Topper Jack's.\n\nTammy is released from prison 38 days later, and her father, Don (Dan Aykroyd), picks her up. He offers to kill Greg for her, though she declines. Returning home, Tammy finds that Greg and Missi have packed Tammy's belongings. She and Greg agree to an amicable divorce. She walks down the street to her parents' place and finds out that Pearl is now living in Brookview Retirement Home. Tammy goes to Brookview to break her out, but Pearl is actually happy there. She has been attending Alcoholics Anonymous meetings at the home, and she is dating one of the men there. However, they do still take a trip to Niagara Falls.\n\nAt Niagara Falls, Bobby surprises Tammy there and they kiss. Tammy tells him about her choice to move to Louisville to get a fresh start in life and get closer to him. The last scene shows Missi leaving Greg to be with Keith and Tammy befriends Becky and Larry.",
  "synopsis": "Tammy (Melissa McCarthy) is an overweight, potty-mouthed, bad-luck-prone, lower-working-class woman who is having a horrible day. On her way to work at a fast-food place called Topper Jacks, she hits a deer while shes looking for Chapstick in the backseat of her car. Once she gets there, her boss Keith (Ben Falcone) fires her for showing up late and looking like a mess. Her nose is bloody from the car accident.She heads back home, but her car dies. She eventually gets home and finds her husband Greg (Nat Faxon) eating a romantic meal with their neighbor, Missi (Toni Collette). Upset, Tammy leaves and walks two doors down to her parents' house.She tells her mother Deb (Allison Janney) that she's leaving town and shes taking her grandmother Pearl's (Susan Sarandon) car. Her grandmother insists on going too. She not only has a car, she has thousands of dollars in cash, while Tammy has only $68, plus change. She and Tammy don't get along at all. Deb doesn't want them to go because Pearl needs her medication and they were planning on putting her in the Brookview Retirement Home.Pearl convinces Tammy to lighten up and have a beer. Tammy doesn't want to drink and drive, but Pearl insists. Soon, they're doing drunken donuts in a grassy area.The next morning, they wake up near a park and Pearl convinces Tammy not to go back home and finish what she started. Pearl has always wanted to go to Niagara Falls. Tammy goes jet skiing, while Pearl drinks more booze on the dock. Tammy crashes and they have to pay for the broken jet ski. So they do, but they take it with them.They head to Louisville, for the best barbecue in town, according to Pearl's cousin Lenore. There, they meet Earl (Gary Cole) and his son Bobby (Mark Duplass). Earl is smitten with Pearl and they have sex in the backseat of Pearl's car. Bobby and Tammy awkwardly sit outside while it happens, but eventually Bobby has to head home and take care of his mom. Earl is still married, but his wife is dying and they have some sort of arrangement.Earl, Pearl, and Tammy head back to the hotel and Tammy is locked outside the room while Earl and Pearl continue touching private parts.The next morning, an angry Tammy decides to leave a still drunk Pearl so she knows what it feels like to be abandoned. When Tammy was a child, Pearl was her best friend, but stopped coming around. Tammy calls her mom, who is worried because Pearl didn't bring her medicine. Tammy turns around and finds Pearl inside a liquor store mixing whiskey in a Slurpee. The cashier is mad because Pearl keeps drinking inside the store and he calls the police.They leave and we find out that Pearl was also in the process of buying beer for minors. Tammy tells the minors to run off, there's a fight and the police show. Tammy and Pearl are arrested. Pearl pays for Tammy's bail, but Pearl is stuck because she also had a bag full of illegal Oxycontin.Tammy asks her family for money, but doesn't tell them Pearl is in jail. No one will pay, so Tammy robs a local Topper Jacks for the rest of the money. During the robbery she bonds a little with the two employees Becky (Sarah Baker) and Larry (Rich Williams).Tammy heads back to the police station to bail out Pearl, but she's already free because Earl took care of everything.Tammy and Pearl go back to the hotel and the Topper Jacks robbery is on the news and there's a pretty good description of Tammy's shirt and vehicle towing the jet ski. Pearl makes Tammy return the money to Topper Jacks the next day. Becky is there, but says Larry took the day off because he was still shook up a bit.Pearl and Tammy meet up with Lenore (Kathy Bates) who blows up Pearl's car because Tammy is now a fugitive. They go back to Lenore's house where she and her girlfriend/life partner Susanne (Sandra Oh) are getting ready to throw a giant 4th of July party. Pearl apologizes for her behavior and explains that she quit coming around when Tammy was a kid because she got drunk and made a pass at Tammy's dad and was embarrassed.Tammy asks that Pearl promise not to get drunk. During the party, they have a Viking funeral for the jet ski, sending it out onto the lake in a flaming raft. Earl and Bobby show up. Bobby tells Tammy that he digs her, but Tammy explains that shes still married and feels weird about that.A drunk Pearl starts to make a horrible toast over the PA and Tammy tries to stop her. Pearl calls her a fat slob and says she sees why Greg left her. Angrily, Tammy responds that at least she didn't try to fuck her son-in-law. Its heated. Tammy storms off. Lenore finds her and tells her that she needs to get her own life together because she can try to take care of Pearl.The next morning Tammy finds Pearl in a lawn chair dead. Everyone is crying, but it turns out that Pearl was actually just passed out hard. She gets up, they call the EMTs take make sure she's okay. The cops show up as well. Tammy fits the description of the Topper Jacks robber and there was a call about the burning jet ski the night before. Tammy goes to prison.38 days later, Tammy is released from prison and her father (Dan Aykroyd) picks her up. He offers to kill Greg for her. She declines the offer. She brings up that she knows Pearl made a pass at him. He dismisses that and says that she made a pass at everyone, but the only person who ever took her up on it was the ice cream man (who Tammy also had a little bit of hanky panky with).Tammy goes home and finds that Greg and his mistress have packed Tammy's belongings. She walks down the street to her parents' house and finds out that Pearl is now living in Brookview Retirement Home after all.Tammy goes to Brookview to break out Pearl, but Pearl is actually happy there. She's dating one of the guys there. However, they do still take a trip to Niagara Falls. Bobby shows up and he and Tammy finally kiss. Tammy tells him she decided she'd like to move to Louisville and be closer to him.There are a few scenes during the credits......Missi leaves Greg for Keith because he now owns a few Topper Jacks franchises.Tammy hangs out with Becky and Larry from the robbery.And finally, there's an alternate take of the opening scene when Tammy gets fired."
}