{
  "imdb_id": "tt2186933",
  "tmdb_id": "138370",
  "douban_id": null,
  "title": "Luv Shuv Tey Chicken Khurana (2012)",
  "genres": [
    "Comedy"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "140 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm1343477",
      "name": "Sameer Sharma"
    }
  ],
  "writer": [
    {
      "id": "nm4856427",
      "name": "Sumit Batheja",
      "description": null
    },
    {
      "id": "nm1343477",
      "name": "Sameer Sharma",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1577858",
      "name": "Kunal Kapoor",
      "character": "Omi Khurana"
    },
    {
      "id": "nm4806622",
      "name": "Huma Qureshi",
      "character": "Harman"
    },
    {
      "id": "nm0619405",
      "name": "Vinod Nagpal",
      "character": "Daar ji"
    },
    {
      "id": "nm0788903",
      "name": "Rajesh Sharma",
      "character": "Titu Mamaji"
    },
    {
      "id": "nm4119309",
      "name": "Rahul Bagga",
      "character": "Jeet Khurana"
    },
    {
      "id": "nm1217893",
      "name": "Rajendra Sethi",
      "character": "Hemraj Khurana"
    },
    {
      "id": "nm3853047",
      "name": "Seema Kaushal",
      "character": "Lata Khurana"
    },
    {
      "id": "nm3880187",
      "name": "Anjum Batra",
      "character": "Dalidri"
    },
    {
      "id": "nm0014081",
      "name": "Dolly Ahluwalia",
      "character": "Buaji"
    },
    {
      "id": "nm2977431",
      "name": "Anangsha Biswas",
      "character": "Shama Chatterjee"
    },
    {
      "id": "nm1784638",
      "name": "Munish Makhija",
      "character": "Shanty"
    },
    {
      "id": "nm3822788",
      "name": "Herry Tangiri",
      "character": "Manty       (as Herry Tangri)"
    },
    {
      "id": "nm1479650",
      "name": "Vipin Sharma",
      "character": "Kehar Singh"
    },
    {
      "id": "nm2535507",
      "name": "Mukesh Chhabra",
      "character": "Lovely"
    },
    {
      "id": "nm1909661",
      "name": "Nimrat Kaur",
      "character": "Muskaan Khurana"
    },
    {
      "id": "nm4002765",
      "name": "Faisal Rashid",
      "character": "young Omi"
    },
    {
      "id": "nm5636431",
      "name": "Gurpreet Brar",
      "character": "Harman's mother"
    },
    {
      "id": "nm3814236",
      "name": "Peter Wong",
      "character": "Chinese man at the bar"
    },
    {
      "id": "nm5580341",
      "name": "Michael Chang",
      "character": "Chinese man at the bar"
    },
    {
      "id": "nm5584795",
      "name": "Balwinder Singh",
      "character": "Harman's father"
    },
    {
      "id": "nm1655815",
      "name": "Mandeep Kaur",
      "character": "Rimpy's mother"
    },
    {
      "id": "nm2528699",
      "name": "Kishore",
      "character": "Old man at funeral"
    },
    {
      "id": "nm4566494",
      "name": "John Duggan",
      "character": "Pub customer"
    },
    {
      "id": "nm4174737",
      "name": "Sophie Karl",
      "character": "Bartender"
    },
    {
      "id": "nm5142917",
      "name": "Blazena Kovalikova",
      "character": "Girlfriend"
    },
    {
      "id": "nm1882579",
      "name": "Zachary Coffin",
      "character": "Businessman at the Bar"
    },
    {
      "id": "nm4745327",
      "name": "Natasha Jenssen",
      "character": "Girlfriend of Gangster"
    },
    {
      "id": "nm5817249",
      "name": "Vicky Kaushal",
      "character": ""
    },
    {
      "id": "nm4372817",
      "name": "Rajinder Sharma Nanu",
      "character": "(as Rajinder Sharma)"
    },
    {
      "id": "nm5636790",
      "name": "Rosy",
      "character": "Patient"
    }
  ],
  "overview": "Omi Khurana is on the run from a dangerous UK gangster. He returns to his native village in Punjab, pretending to be a London lawyer. Much has changed since Omi ran away from home a decade back Grandfather Darji has become senile and most importantly, forgotten the secret recipe of \"Chicken Khurana\" a dish that made the Khurana dhaba famous across Punjab. Will Omi be able to cover his deceit and lies for long, even as he tries to recover the lost recipe of Chicken Khurana - the family's only hope to reclaim their pride &amp; wealth.",
  "storyline": "Omi Khurana's London dream has just ended. On the run from a dangerous UK gangster who he owes money to, Omi returns to his native village in Punjab, pretending to be a well-heeled London lawyer. Much has changed since Omi ran away from home a decade back after stealing money from his doting grandfather, Darji. The old man has since become senile and most importantly, forgotten the secret recipe of \"Chicken Khurana\" a dish that made the Khurana dhaba (restaurant) famous across Punjab. Omi's childhood sweetheart, Harman is soon to be married to his cousin, Jeet, though neither seems too happy about it. Adding to the quirkiness of the Khurana family is a free loader uncle, Titu, who once did a stint at a mental asylum. Will Omi be able to cover his deceit and lies for long, even as he tries to recover the lost recipe of Chicken Khurana - the family's only hope to reclaim their pride & wealth.",
  "plot": "Omi Khurana’s London dream has just ended. On the run from a dangerous UK gangster who he owes money to, Omi returns to his native village in Punjab, pretending to be a well-heeled London lawyer. Much has changed since Omi ran away from home a decade back after stealing money from his doting grandfather, Daarji. The old man has since become senile and most importantly, forgotten the secret recipe of \"Chicken Khurana\" a dish that made the Khurana dhaba (restaurant) famous across Punjab. Omi’s childhood sweetheart, Harman is soon to be married to his cousin, Jeet, though neither seems too happy about it. Adding to the quirkiness of the Khurana family is a free loader uncle, Titu, who once did a stint at a mental asylum. Omi's grandfaher has a cousin sister who ran away from home at early age and is now a saint. His grand father dies on his last visit to his restaurant. Omi tries to restore their family restaurant with the help of Harman. While working on restaurant both of them reconcile and start to have feelings for each other. Meanwhile, Omi discovers the secret ingredient from his grandfathers famous chicken recipe was a narcotic herbal medicine but keeps it a secret forever. While the family comes together, Jeet surprises everybody by revealing his love for a Bengali war-widow Shama and has a daughter with her. Omi and Harman's marriage is fixed. In the end the whole family seems happy and celebrating when the gangster from whom Omi is hiding comes looking for him and is revealed to be Titu's long lost friend.",
  "synopsis": null
}