{
  "imdb_id": "tt2140237",
  "tmdb_id": "306128",
  "douban_id": null,
  "title": "Painkiller (2011)",
  "genres": [
    "Short",
    "Comedy",
    "Drama",
    "Thriller"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "12 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm3674533",
      "name": "Mustapha Kseibati"
    }
  ],
  "writer": [
    {
      "id": "nm4815863",
      "name": "Selina Lim",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2621030",
      "name": "Franz Drameh",
      "character": "Dominic"
    },
    {
      "id": "nm0938950",
      "name": "Benedict Wong",
      "character": "Jay"
    },
    {
      "id": "nm4267212",
      "name": "Kris Saddler",
      "character": "Mark"
    },
    {
      "id": "nm0156464",
      "name": "Daphne Cheung",
      "character": "Jay's Wife"
    },
    {
      "id": "nm4818952",
      "name": "Henry Wu",
      "character": "Jay's Son"
    }
  ],
  "overview": "Street-smart Dominic's armed robbery of a convenience store goes wrong when he crosses paths with hard-working Jay, a taxi driver with nothing left to lose. Mutual contempt soon turns into a kind of understanding, but not without some pain along the way.",
  "storyline": "Street-smart Dominic's armed robbery of a convenience store goes wrong when he crosses paths with hard-working Jay, a taxi driver with nothing left to lose. Mutual contempt soon turns into a kind of understanding, but not without some pain along the way.",
  "plot": "The game revolves around a young man named Daniel Garner (Cam Clarke), who is happily married to his wife Catherine (Vanessa Marshall). At the start of the game, Daniel is about to take Catherine out for a birthday meal. As they drive towards their destination at high speed, in the pouring rain, Daniel takes his eyes off the road to look at his wife and while his attention is diverted, he ploughs their car into a truck. Both of them are killed instantly in the crash.\n\nWhile Catherine manages to make it to Heaven and lives in harmony, Daniel is trapped in Purgatory. One day, an angel called Samael (John Cygan) tells him that in order to receive purification, he has to kill four of Lucifer's generals in order to prevent a war between Heaven and Hell. Lucifer has been secretly organizing a massive army that could overwhelm Heaven, taking over Purgatory in the process. Small portions of the army are already beginning the march. With little choice available to him, Daniel accepts the task. With the forces of Hell seizing and corrupting various parts of Purgatory, Daniel goes through different and random phases of history within Purgatory, which range greatly from ancient times to the modern era. These include Medieval Europe, Babylon, the Crusades, 1800s and even a time slice of modern industry.\n\nAfter killing the first general, Daniel meets a woman named Eve (Vanessa Marshall), another soul who has been in Purgatory for a long time. She gives him information about the whereabouts of the remaining generals and small elements of Lucifer's army already mobilizing. She also tells him about life in Purgatory, and the possibility that he could be dragged to Hell should he fall in battle and become lost forever. While this is all understood, what Daniel does not understand is why he came here, but Eve insists it is because of something in his past, and it is up to him to find out.\n\nAfter the second general's defeat and reuniting with Eve, Daniel travels to meet a demonic friend named Asmodeus (Jim Ward), for information about new rallying positions for Lucifer's armies. Asmodeus once saved Daniel's life after he single-handedly defeated four demons at once one day, almost losing himself in the process. Eve is wary of Asmodeus and questions as to why he did not finish Daniel when he was weak, but he insists that he did not come to Purgatory to fill the graves with lost souls like the others. He also questions Eve if she is really \"The Eve\" referenced in the Bible, to which Daniel jokes \"Where is Adam?\" before continuing on.\n\nAfter the third general's defeat, he confronts Samael, having had enough of the fighting and wanting out of Purgatory, but Samael remains firm with Daniel that it is not that simple to leave and he must finish the task given to him. After being directed to the whereabouts of Alastor (Jim Cummings), Lucifer's right-hand and final general, Daniel is warned that Alastor is already aware that he is being pursued and his own elite soldiers are prepared and waiting. Daniel reluctantly continues his quest for purification.\n\nAfter Daniel kills Alastor, Eve arrives at the scene in shock, realizing Lucifer will no doubt be on his way and they should make themselves ready. Surprisingly, Asmodeus arrives, complimenting Daniel for his victory and examining the scene. Suddenly, both Eve and Daniel find Asmodeus highly suspicious and try questioning him as to why he is really in Purgatory, to which he eventually replies, \"I dig graves\". Suddenly, he dissolves into a ball of fire and Lucifer himself (Lex Lang) appears. He mocks Daniel while recognizing him as a worthy opponent and thanking him for removing Alastor, who had been constantly arguing with Lucifer that the armies should have attacked sooner rather than wait. He snatches Eve, whom he claims had escaped from Hell, and takes her with him before disappearing back into Hell.\n\nSamael appears, congratulating Daniel for his success and informs him his task is done. Now he may proceed to Heaven and reunite with Catherine. But Daniel refuses, knowing that it is not over yet, \"not even close\" to use his words. He also knows that it would be only a matter of time before Lucifer can fledge a new and massive enough army, but the next time would be far worse. He decides to go after them, but Samael tries to make him reconsider, for if Daniel goes to Hell, there will be no escaping from there. Daniel turns down the offer once more and asks that Catherine be told not to wait for him, for he will not be coming. Samael gives in and shows him the direction to the gates of Hell, warning that they are protected from the inside by the most elite of the demonic forces for the purpose of keeping the souls of those who are damned within Hell.\n\nDaniel eventually emerges in Hell, a twisted landscape made of torn fragments from various wars throughout history (a play on the phrase \"War Is Hell\"). After vanquishing enough souls of the damned, most of which are recognizable as foes he has defeated, he confronts Lucifer in Demon Mode and kills him, rescuing Eve in the process, who has been rendered unconscious. After killing Lucifer, Alastor reappears before him, with hordes of demons around him. Daniel learns that he did not really kill Alastor as he could only be defeated in Hell. With Lucifer gone, the position of Hell's ruler is open. Alastor has already taken it and announced his ultimatum. He leaves Daniel to the mercy of the demons around him, who eagerly accepts the challenge. The game ends with Daniel defending himself against the never-ending hordes.\n\nIf the game is finished in Trauma (the hardest difficulty in the game), an extra ending is presented. Daniel is now finally able to go to Heaven and reunite with Catherine at last.",
  "synopsis": "A 2011 BBC Writersroom / B3 Media short film.Street-smart Dominics armed robbery of a convenience store goes wrong when he crosses paths with hard-working Jay, a taxi driver with nothing left to lose. Mutual contempt soon turns into a kind of understanding, but not without some pain along the way."
}