{
  "imdb_id": "tt2188741",
  "tmdb_id": "158900",
  "douban_id": null,
  "title": "Sanctuary (2013)",
  "genres": [
    "Adventure",
    "Drama"
  ],
  "country": "Sweden",
  "version": [
    {
      "runtime": "88 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm0249189",
      "name": "Fredrik Edfeldt"
    }
  ],
  "writer": [
    {
      "id": "nm0037238",
      "name": "Karin Arrhenius",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0147767",
      "name": "Jakob Cedergren",
      "character": "Pappan /              The Dad"
    },
    {
      "id": "nm4859138",
      "name": "Clara Christiansson",
      "character": "Hella"
    },
    {
      "id": "nm0374685",
      "name": "Maria Heiskanen",
      "character": "Socialkvinnan /              The Social Services Woman"
    },
    {
      "id": "nm0822236",
      "name": "Göran Stangertz",
      "character": "Polismannen /              The Police Man"
    },
    {
      "id": "nm0292708",
      "name": "Gunnel Fred",
      "character": "Tanten /              The Lady"
    },
    {
      "id": "nm0121062",
      "name": "Per Burell",
      "character": "Poliskollegan /              The Police Colleague"
    },
    {
      "id": "nm0138107",
      "name": "Lena Carlsson",
      "character": "Mamman /              mother"
    },
    {
      "id": "nm0351388",
      "name": "Elisabeth Göransson",
      "character": "Stugägarkvinnan"
    },
    {
      "id": "nm0638872",
      "name": "Thomas Nystedt",
      "character": "Stugägarmannen"
    },
    {
      "id": "nm8511734",
      "name": "Mats Björklund",
      "character": "Polis med hund"
    },
    {
      "id": "nm4871143",
      "name": "Magnus Andersson",
      "character": "Polisassistent"
    },
    {
      "id": "nm8511735",
      "name": "Gunnar Abrahamsson",
      "character": "Gubben i skogen"
    },
    {
      "id": "nm2938158",
      "name": "Maria Karlsson",
      "character": "Receptionist på polisstationen"
    },
    {
      "id": "nm8511736",
      "name": "Bessie",
      "character": "Hellas hund /              Hella's dog"
    },
    {
      "id": "nm8511737",
      "name": "Kurt",
      "character": "polishunden /              Police dog"
    }
  ],
  "overview": "Faro is about a man who flees into the forest with his daughter to escape a prison sentence.",
  "storyline": "A movie about a young girl and her dad, and their relationship to each other. Hella's dad is questioned by the police over a murder. Hella only has her dad, so if he get arrested she will go into foster care. So they take their things leave the house to live in the woods.",
  "plot": "Five years after the Viking village of Berk and the dragons made peace, they now live together in harmony. Hiccup goes on adventures with his dragon, Toothless, as they discover and map unexplored lands. Now 20 years old, he is being pressed by his father, Stoick the Vast, to succeed him as chieftain, although Hiccup remains unsure if he is ready for this responsibility.\n\nWhile investigating a burnt forest, Hiccup and Astrid discover the remains of a fort encased in ice and meet a group of dragon trappers led by Eret, who blames them for his fort's destruction and attempts to capture their dragons for an insane conqueror named Drago Bludvist. The two dragon riders escape and return to Berk to warn Stoick about the dragon army that Drago is amassing. Stoick orders the villagers to fortify the island and prepare for battle. Hiccup, however, refuses to believe that war is inevitable. After Stoick interrupts Hiccup's plan to get Eret to take him to Drago, Stoick explains that he once met Drago at a gathering of chiefs, where Drago, mocked after offering the chiefs his service in return for their servitude, murdered them all using armored dragons, with Stoick as the only survivor. Undeterred, Hiccup flies off with Toothless in search of Drago to try to reason with him.\n\nThey run into a dragon rider named Valka, who is revealed to be Hiccup's long-lost mother. She explains that she, like her son, could not bring herself to kill dragons. After being carried off during a dragon raid, she spent 20 years rescuing dragons from Drago's traps and bringing them to an island nest created out of ice by a gigantic Alpha dragon called a \"Bewilderbeast\", which is able to control smaller dragons. Stoick tracks Hiccup to the nest, where he discovers that his wife is still alive. Meanwhile, Astrid and the other riders kidnap Eret to find Drago, but Drago captures them and learns of Berk's dragons.\n\nDrago and his armada lay siege to the nest, where he reveals that he has his own Bewilderbeast to challenge the Alpha. A battle ensues between the two colossal dragons, which ends with Drago's Bewilderbeast killing its opponent and becoming the new Alpha. Drago's Bewilderbeast then seizes control of all the adult dragons, which hypnotically obey. Hiccup tries to persuade Drago to end the violence, but Drago orders him killed. Toothless, under the Bewilderbeast's influence, approaches Hiccup and launches a blast, but Stoick pushes Hiccup out of the way and is hit instead, killing him. The Bewilderbeast momentarily relinquishes control of Toothless, but Hiccup drives him away in a fit of despair. Drago maroons Hiccup and the others on the island and rides Toothless, again under the control of the Bewilderbeast, to lead his army to conquer Berk. Stoick is given a Viking funeral and Hiccup, now having lost both his father and dragon, is unsure what to do. Valka encourages him by telling him that he alone can unite humans and dragons, and inspired by her words and his father's, Hiccup decides to return to Berk to stop Drago.\n\nThe dragon riders fly baby dragons back to Berk, as they are immune to the Bewilderbeast's control. They find that Drago has already attacked the village and taken control of its dragons. Hiccup confronts Drago and a brainwashed Toothless while the other riders work to distract the Bewilderbeast. Hiccup succeeds in freeing Toothless from the Bewilderbeast's control, much to Drago's surprise. Hiccup and Toothless briefly separate Drago from the Bewilderbeast and confront Drago on the ground, but the Bewilderbeast attacks them, encasing them in ice. However, Toothless blasts away the ice, revealing that both Hiccup and he are unharmed. He then challenges the Bewilderbeast, shooting it in the face repeatedly, which breaks its control over the other dragons, which now side with Toothless as the new Alpha dragon. All the dragons repeatedly fire at the Bewilderbeast until Toothless fires a final massive blast, breaking its left tusk. Defeated, the Bewilderbeast retreats under the sea with Drago on its back. The Vikings and dragons celebrate their victory and Hiccup is made chieftain of Berk.\n\nAfterwards, Berk undergoes repairs while feeling secure knowing that its dragons can defend it.",
  "synopsis": null
}