{
  "imdb_id": "tt2120857",
  "tmdb_id": "257125",
  "douban_id": null,
  "title": "White Rabbit (2015)",
  "genres": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "87 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.3,
  "director": [
    {
      "id": "nm0454265",
      "name": "Bill Kinder"
    }
  ],
  "writer": [
    {
      "id": "nm4787458",
      "name": "Kevin Warner",
      "description": "story"
    },
    {
      "id": "nm4787458",
      "name": "Kevin Warner",
      "description": "writer"
    },
    {
      "id": "nm4787458",
      "name": "Kevin Warner",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2615129",
      "name": "Carla Pauli",
      "character": "Kerryann Terkel"
    },
    {
      "id": "nm1550056",
      "name": "Eric Michael Kochmer",
      "character": "Ricky Ray"
    },
    {
      "id": "nm0007063",
      "name": "James Anthony Cotton",
      "character": "Mel Walter Booth"
    },
    {
      "id": "nm3524453",
      "name": "Nicholas Russell",
      "character": "Dale Dossier       (as Nick Russell)"
    },
    {
      "id": "nm3777549",
      "name": "Kip Baldwin",
      "character": "Guy at Bar"
    },
    {
      "id": "nm2048735",
      "name": "Todd Aaron Brotze",
      "character": "Security Guard"
    },
    {
      "id": "nm1687563",
      "name": "Gail Fenton",
      "character": "Deirdre"
    },
    {
      "id": "nm0328678",
      "name": "Craig Good",
      "character": "Additional Voice       (voice)"
    },
    {
      "id": "nm4295445",
      "name": "Anne Hallinan",
      "character": "Cat Friedman"
    },
    {
      "id": "nm7496735",
      "name": "Jennifer Lee",
      "character": "Jessie"
    },
    {
      "id": "nm3826987",
      "name": "Jarvis Moore",
      "character": "E. Don Russell"
    },
    {
      "id": "nm5247962",
      "name": "Gino Rose",
      "character": "Bode Friedman"
    },
    {
      "id": "nm0027406",
      "name": "Sandy Rouge",
      "character": "Yesenia Frias"
    },
    {
      "id": "nm4902496",
      "name": "Linda Sparks",
      "character": "Mandy"
    },
    {
      "id": "nm1552646",
      "name": "Christine Wilcock",
      "character": "Tattoo Technician"
    }
  ],
  "overview": "After three tours in Iraq, traumatized and adrift Kerryann struggles to regain her sense of purpose. Cut off from family and friends and arguing with the constant static in her head, she falls in with a corrupt cop and his Tea Party accomplice , filling her with drive and direction. Her new companions seize on her military training as the key to a big- money heist. Will she be able to assimilate into civilian life, or will her need for a mission destroy her?",
  "storyline": "WHITE RABBIT is a gritty crime thriller about a veteran of the Iraq War, Kerryann Terkel. Back home, Kerryann battles Post Traumatic Stress Disorder as she tries to establish a stable civilian life. Instead, she gets tangled up in the schemes of a corrupt cop and his Tea Party sidekick, who exploit her military training to pull off a heist involving cell phone hacking at a political rally. The crime forces Kerryann to confront violent wartime memories - and her new domestic enemies. WHITE RABBIT is about what happens when war comes home.",
  "plot": "Troubled by a strange recurring dream and mourning the loss of her father, 19-year-old Alice Kingsleigh attends a garden party at Lord Ascot's estate. There she is confronted by an unwanted marriage proposal to Hamish Ascot and the stifling expectations of the society in which she lives. Unsure of how to proceed, she pursues a rabbit wearing a blue waistcoat and accidentally falls into a large rabbit hole under a tree. She emerges in a forest where she is greeted by the White Rabbit, the Dormouse, the Dodo, the Talking Flowers, and Tweedledee and Tweedledum. They argue over her identity as \"the right Alice\" who must slay the Red Queen's Jabberwocky and restore the White Queen to power, as foretold by Absolem the Caterpillar and his prophetic scroll. The group is then ambushed by the Bandersnatch and a group of playing-card soldiers led by the Knave of Hearts. Alice, Tweedledum and Tweedledee escape into the woods. The Knave steals the Caterpillar's scroll. The Dormouse leaves the others behind with one of the Bandersnatch's eyes in her possession. Tweedledum and Tweedledee are then captured by the Red Queen's Jubjub bird.\n\nThe Knave informs the Red Queen that Alice threatens her reign, and the soldiers and Bayard the Bloodhound are ordered to find Alice immediately. Meanwhile, the Cheshire Cat guides Alice to the March Hare and the Hatter. The Hatter helps Alice avoid capture by allowing himself to be seized instead. Later, Alice is found by Bayard the Bloodhound; but Alice insists upon helping the Hatter. At the Queen's citadel, the Red Queen is unaware of Alice's true identity and therefore welcomes her as a guest, named Um from Umbridge. Alice learns that the Vorpal Sword, the only weapon capable of killing the Jabberwock, is locked inside the den of the Bandersnatch. The Knave crudely attempts to seduce Alice, but she rebuffs him, and a jealous Red Queen orders Alice beheaded. Alice obtains the sword and befriends the Bandersnatch by returning its eye. She then escapes on the back of the grateful Bandersnatch and delivers the sword to the White Queen. The Cheshire Cat saves the Hatter from the executioner, and the Hatter calls for rebellion against the Red Queen. The rebellion is quickly put down by the Jubjub bird, but the resistance flees to the White Queen's castle, and both armies prepare for battle. Former caterpillar Absolem advises Alice to fight the Jabberwocky just before completing his transformation into a pupa.\n\nOn the appointed day, the White and Red Queens gather their armies on a chessboard-like battlefield and send Alice and the Jabberwocky to decide the battle in single combat. Encouraged by the advice of her late father, Alice fights the Jabberwocky among the ruins surrounding the battlefield and finally jumps from the remains of a spiral staircase onto the Jabberwocky's neck and beheads it. The White Queen sends the Red Queen and the Knave into exile. After the Hatter performs a celebration dance called Futterwacken, the White Queen gives Alice a vial of the Jabberwocky's purple blood whose power will bring her whatever she wishes. She decides to rejoin the everyday world. Back in England, Lord Ascot takes Alice as his apprentice with the idea of establishing oceanic trade routes to Hong Kong. As the story closes, Alice prepares to set off on a trading ship. A light-blue butterfly lands on her shoulder, and Alice recognizes him as Absolem.",
  "synopsis": "This movie is not a political thriller, rather it is a sleeper in all sense of the word. This is a Liberal snooze fest, using the back drop of Occupy Oakland. It has many comical ironies.... Female Iraq Vet who is a telcom expert with PTSD... I guess fighting virus attacks inside an A/C office in safety can be daunting...and oh yeah she's hispanic. Then there is a so called \"Tea Party\" candidate, who of course is white, but is running in California... yeah right. He couldn't just be a politician, he couldn't just be a Republican....no he had to be \"Tea Party\"... you know those awful people who riot, loot, occupy streets and parks, burn down businesses.. oh wait that is Black Lives Movement, Occupy Movement and La Raza. The Tea Party are patriotic Americans calling for fiscal responsibility and constitutionality of government... like the original tea party.\nLets not forget that today every liberal movies out there needs a bad cop. The only thing missing was a global warming or climate change message.\nI am sure that this film will be heralded by liberal critics and shown at as many colleges as possible this year. But don't waste your money on this trash, just watch it for free on the many torrent websites."
}