{
  "imdb_id": "tt2137267",
  "tmdb_id": "80590",
  "douban_id": null,
  "title": "All.I.Can. (2011)",
  "genres": [
    "Documentary",
    "Sport"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "76 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.0,
  "director": [
    {
      "id": "nm4871298",
      "name": "Eric Crosland"
    },
    {
      "id": "nm4870743",
      "name": "Dave Mossop"
    },
    {
      "id": "nm0041503",
      "name": "J.P. Auclair"
    }
  ],
  "writer": [
    {
      "id": "nm4870743",
      "name": "Dave Mossop",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm2363078",
      "name": "Mark Abma",
      "character": "Himself"
    },
    {
      "id": "nm0041503",
      "name": "J.P. Auclair",
      "character": "Himself"
    },
    {
      "id": "nm2635644",
      "name": "Ingrid Backstrom",
      "character": "Herself"
    },
    {
      "id": "nm5540575",
      "name": "Cody Barnhill",
      "character": "Himself"
    },
    {
      "id": "nm4781587",
      "name": "Rory Bushfield",
      "character": "Himself"
    },
    {
      "id": "nm1755936",
      "name": "John Collison",
      "character": "Himself"
    },
    {
      "id": "nm4284437",
      "name": "Arthur Dejong",
      "character": "Himself"
    },
    {
      "id": "nm0235186",
      "name": "Mike Douglas",
      "character": "Himself"
    },
    {
      "id": "nm4205027",
      "name": "Lynsey Dyer",
      "character": "Herself"
    },
    {
      "id": "nm5789715",
      "name": "Kristoffer Erickson",
      "character": "Himself"
    },
    {
      "id": "nm3368654",
      "name": "Dana Flahr",
      "character": "Herself - Skier"
    },
    {
      "id": "nm5789718",
      "name": "Kim Havell",
      "character": "Herself"
    },
    {
      "id": "nm5035024",
      "name": "James Heim",
      "character": "Himself"
    },
    {
      "id": "nm5789720",
      "name": "Dennis Hergott",
      "character": "Himself"
    },
    {
      "id": "nm5789712",
      "name": "Greg Hill",
      "character": "Himself"
    },
    {
      "id": "nm4409965",
      "name": "Eric Hjorleifson",
      "character": "Himself"
    },
    {
      "id": "nm5789713",
      "name": "Shannon Kernahan",
      "character": "Herself"
    },
    {
      "id": "nm3369253",
      "name": "Ian McIntosh",
      "character": "Himself"
    },
    {
      "id": "nm2103540",
      "name": "Kye Petersen",
      "character": "Himself"
    },
    {
      "id": "nm4781596",
      "name": "Callum Pettit",
      "character": "Himself"
    },
    {
      "id": "nm2092297",
      "name": "Sean Pettit",
      "character": "Himself"
    },
    {
      "id": "nm5789716",
      "name": "Matty Richard",
      "character": "Himself"
    },
    {
      "id": "nm4813271",
      "name": "Chris Rubens",
      "character": "Himself"
    },
    {
      "id": "nm5789717",
      "name": "Chad Sayers",
      "character": "Himself"
    },
    {
      "id": "nm5789721",
      "name": "Auden Schendler",
      "character": "Herself"
    },
    {
      "id": "nm5789719",
      "name": "Bud Stoll",
      "character": "Himself"
    },
    {
      "id": "nm2053984",
      "name": "Dan Treadway",
      "character": "Himself"
    },
    {
      "id": "nm1102993",
      "name": "Mary Woodward",
      "character": "Herself"
    }
  ],
  "overview": "The time has come for a ski film that stands for something. Join us as we unite spectacular cinematography with creative cinematic language to fuse our passion for skiing with our potential to help the environment. In bringing the planet to life and drawing parallels between our daily existence, we find common ground between the global situation and the real individual. Epic natural cinematography, ground breaking skiing from Chile to Greenland, and an environmental engagement that creates an accessible identification point for the viewer, leaving them with an inspiring new perspective.",
  "storyline": "All.I.Can is a stunning exploratory essay that compares the challenges of big mountain skiing to the challenges of global climate change. Shot on 6 continents over 2 years, the world's best skiers deliver inspirational performances while ground-breaking cinematography expands our vision of the natural world. Journey through Morocco's majestic desert peaks, Greenland's icy fjords, Chile's volcanic craters, Alaskan spine walls, and more. Join the revolution and experience one of the most spectacular, captivating, and thought-provoking films ever created in the action sports genre.",
  "plot": "John Smith is an alien from the planet Lorien. He was sent to Earth as a child with eight others to escape the invading Mogadorians, who destroyed Lorien. Here, John is protected by a Cepan, or guardian, Henri. Together, they live in a beach-side bungalow in Florida.\n\nThe Mogadorians, led by the Commander, learn about the nine children and come to Earth to find them. The Loric Garde can only be killed in sequence; from Number One to Number Nine. Three of them have already been killed. John becomes aware that he is next while swimming in the ocean with a girl. He suffers sharp pain, his leg begins to glow, and he sees a vision of Number Three warning him of the coming danger. The girl and the other people on the beach, who record the event happening in the ocean, run from John. When the video and pictures surface on the internet, Henri deletes them all, gathers up his and John's belongings, and decides to move to an old farm in Paradise, Ohio. A small lizard is able to crawl in along with their belongings.\n\nJohn and Henri arrive in Paradise and begin settling into their new home. As night falls, the lizard transforms into a dog. That night, Henri and John hear a noise outside and, upon investigation, find the dog, who is then brought inside by John. He decides to name the dog Bernie Kosar (after Cleveland Browns quarterback Bernie Kosar). The following morning, at John's insistence, Henri allows John to go to the local high school rather than be home schooled.\n\nOn his first day there, John goes to the office to receive his class schedule. While waiting, he sees a girl being scolded by a teacher in the principal's office. After John is given his schedule and the girl is let off by the principal, the girl is asked by the secretary to guide John to his locker and first class. At this time, John falls for the girl, who is an amateur photographer named Sarah Hart. As Sarah walks away, a guy walks up to John with a couple of his friends and introduces himself as Mark James. As Mark walks away, John watches him slam another boy into the lockers and throw the boy's skateboard away. John retrieves it and gives it back to the boy, whose name is Sam Goode. Later that day at lunch, John befriends Sam when one of Mark's friends throws a football at Sam's head, knocking him to the ground. John helps Sam up and throws the ball back with enough force to knock Mark's friend to the ground. After this, John notices Sarah taking an interest in him, as she's taking pictures of him from a distance.\n\nThat night at home, John discovers a website run by Sarah. It contains pictures of many of the people of Paradise, including a section dedicated to him. As he views the site, it is erased by Henri. At the same time back in Florida, the Mogadorians discover the burnt wreck of Henri and John's old home and determine that John was not killed in the fire.\n\nThe next day, while John is being bothered by Mark during a film in one of his classes, John's hands begin to glow and burn brightly, similar to the glow on his leg in the ocean, and he sweats profusely. He runs from the classroom and into a janitorial closet to soak his hands in water to calm the burning. Henri, alerted by a Loric box that he has kept, comes to John and explains that the glowing is the awakening of John's \"legacies\". As these powers grow, John will become more powerful but, in order to maintain a low profile, Henri forbids John from using these powers. John disobeys, sneaks out of his house, and goes to a nearby forest where he finds that he is able to throw large rocks at supersonic speeds, run faster than he ever could before, and survive long falls with ease.\n\nLater that night, John goes into town to walk around for a bit and runs into Sarah. He confronts her about the pictures that he found on her website and she admits to being an avid photographer. As they walk together, they see Sam across the street being yelled at by his step-father. John walks Sarah the rest of the way to her house, where she invites him in for dinner with her family. Her parents seem to like John and suggest that he and Sarah go to the carnival together. After dinner, John and Sarah head up to her room. She shows John some of her favorite photos that she has taken. John finds a scrapbook of personal photos that Sarah's taken of herself along with things she's written but she takes it back before he can read much of it. Bernie Kosar shows up outside of Sarah's house, barking loudly, and John gets up to leave. Sarah gives him one of her cameras. They nearly kiss but John leaves quickly because of Bernie Kosar's constant barking.\n\nThe following day at school, Sam asks about the lights in class but John passes it off as a prank with some flashlights. As Sam is warning John to stay away from Sarah, their lockers explode with pink paint placed by Mark. John's hands begin to glow again but he's able to hide it by clenching his fists, as he narrowly avoids getting into a fight with Mark. While John and Sam are cleaning up in the bathroom, Sam tells John about how he and his father used to go looking for aliens, though his father suddenly disappeared one day.\n\nDuring the Spring Fair, Sarah explains to John that she and Mark used to date. She talked about how she had \"refused to be his personal cheerleader\" and instead wanted to be a photographer. Mark had told her that she was being snobby and convinced the entire school that she was crazy. John and Sarah go on a haunted wagon ride through the woods. When they get off, Mark's friends tackle John and begin to beat him while one brings Sarah to Mark. John uses his legacies to fend them off and rescue Sarah. Sam witnesses John's use of his legacies and John reveals his true origins to Sam. The next day, Mark's father, the local sheriff, interrogates Henri on John's whereabouts when his son and his friends were attacked, where John says he wasn't paying any attention to Mark, since he was with a girl.\n\nHenri tells John that too many people are suspicious of them, so they have to leave. John refuses because he doesn't want to leave Sarah. Meanwhile, the Mogadorians continue searching for John, while being trailed by a mysterious woman who is also trying to locate Number Four.\n\nThe Mogadorians eventually locate John and manipulate two conspiracy theorists into capturing Henri. When John and Sam go to rescue him, they are attacked, but manage to fend the Mogadorians off. Just before escaping, John and Sam grab Henri's knife and a Loric artifact; a blue rock that acts as the first half of a tracking device that locates other Loric children. Knowing who Sam is, Henri reveals that his father was an ally that was helping them. As John, Henri, and Sam begin to drive away in Sam's truck, Henri is stabbed through the chest while trying to protect John from a Mogadorian. John throws the Mogadorian from the truck with his telekinesis and they drive away. Henri later dies in John's arms after telling him to find the remaining children, as their combined powers would be enough to stop the Mogadorians. Sam reveals to John that he has another rock, very similar to the one found with the conspiracy theorists. While Sam searches for it in his house, John tries to say goodbye to Sarah at a party. Mark sees John and calls his father, who corners John and Sarah on the roof of the house that the party is being thrown at. As Sarah stands up, she slips from the roof. John saves Sarah from a fall with his telekinesis, revealing his powers in the process, and they escape to their high school.\n\nMeanwhile, the Commander arrives in Paradise in a convoy of trucks. He confronts Mark and his father. After injuring the sheriff, the Commander forces Mark to lead him to where John is hiding. Mark takes him to the school, which he knows is Sarah's hideout.\n\nThere, John, Sarah and Sam are attacked by the Mogadorians, who brought two giant monsters to hunt the trio. They are saved by Number Six and Bernie Kosar. Number Six reveals that Bernie Kosar is a Chimera that can shapeshift and was sent by John's biological parents to protect him. John and Number Six fight the Mogadorians using their powers; Number Six uses her invisibility powers and John blocks energy attacks with telekinesis. Meanwhile, Bernie Kosar, now in his true chimera form, fights one of the Mogadorians' monsters in the school's showers. He is able to defeat the monster. Eventually, having ended up on the school's football stadium, John and Number Six defeat all of the Mogadorians, including the Commander, who dies in a large explosion triggered by John igniting the Commander's bandoleer of ammunition. John survives this explosion when Number Six stands between him and the blast, revealing her ability to resist fire.\n\nThe following day, Number Six unites John's and Sam's blue rocks and discovers the location of the other four surviving Garde. John allows Sam to come with them with the hope of one day finding Sam's father. They set off to find the others so they can all protect Earth from the Mogadorians. They leave behind Sarah and a repentant Mark, who lies to his father about John's whereabouts and returns the box left to John by his dad that was in police evidence. Before leaving, John promises to return to Paradise one day and kisses Sarah one last time. Just before getting in to Sam's truck, Bernie Kosar, with a visibly injured paw, limps up to John.\n\nJohn, Sam, and Bernie Kosar leave together in Sam's truck, being led by Number Six on her motorcycle to where ever the next of the Loric Garde may be.",
  "synopsis": "All.I.Can is an exploratory essay that compares the challenges of big mountain skiing to the challenges of global climate change. Shot on 6 continents over 2 years, the worlds best skiers deliver inspirational performances while ground-breaking cinematography expands our vision of the natural world. Journey through Moroccos majestic desert peaks, Greenlands icy fjords, Chiles volcanic craters, Alaskan spine walls, and more. Join the revolution and experience one of the most spectacular, captivating, and thought-provoking films ever created in the action sports genre."
}