{
  "imdb_id": "tt2125435",
  "tmdb_id": "84175",
  "douban_id": null,
  "title": "Beasts of the Southern Wild (2012)",
  "genres": [
    "Adventure",
    "Drama",
    "Fantasy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "93 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm1022455",
      "name": "Benh Zeitlin"
    }
  ],
  "writer": [
    {
      "id": "nm3599054",
      "name": "Lucy Alibar",
      "description": "screenplay &"
    },
    {
      "id": "nm1022455",
      "name": "Benh Zeitlin",
      "description": "screenplay"
    },
    {
      "id": "nm3599054",
      "name": "Lucy Alibar",
      "description": "stage play \"Juicy and Delicious\""
    }
  ],
  "cast": [
    {
      "id": "nm4832920",
      "name": "Quvenzhané Wallis",
      "character": "Hushpuppy"
    },
    {
      "id": "nm4833412",
      "name": "Dwight Henry",
      "character": "Wink"
    },
    {
      "id": "nm3017611",
      "name": "Levy Easterly",
      "character": "Jean Battiste"
    },
    {
      "id": "nm3017935",
      "name": "Lowell Landes",
      "character": "Walrus"
    },
    {
      "id": "nm4864612",
      "name": "Pamela Harper",
      "character": "Little Jo"
    },
    {
      "id": "nm2366843",
      "name": "Gina Montana",
      "character": "Miss Bathsheba"
    },
    {
      "id": "nm4864745",
      "name": "Amber Henry",
      "character": "LZA"
    },
    {
      "id": "nm3599531",
      "name": "Jonshel Alexander",
      "character": "Joy Strong"
    },
    {
      "id": "nm4863882",
      "name": "Nicholas Clark",
      "character": "Boy with Bell"
    },
    {
      "id": "nm4996892",
      "name": "Joseph Brown",
      "character": "Winston"
    },
    {
      "id": "nm3017496",
      "name": "Henry D. Coleman",
      "character": "Peter T"
    },
    {
      "id": "nm4864273",
      "name": "Kaliana Brower",
      "character": "T-Lou"
    },
    {
      "id": "nm4864728",
      "name": "Philip Lawrence",
      "character": "Dr. Maloney"
    },
    {
      "id": "nm4863894",
      "name": "Hannah Holby",
      "character": "Open Arms Babysitter"
    },
    {
      "id": "nm3018029",
      "name": "Jimmy Lee Moore",
      "character": "Sgt. Major"
    },
    {
      "id": "nm4864844",
      "name": "Jovan Hathaway",
      "character": "The Cook"
    },
    {
      "id": "nm4864411",
      "name": "Kendra Harris",
      "character": "Baby Hushpuppy"
    },
    {
      "id": "nm5455014",
      "name": "Windle Bourg",
      "character": "Herself"
    }
  ],
  "overview": "Hushpuppy, an intrepid six-year-old girl, lives with her father, Wink, in “the Bathtub,” a southern Delta community at the edge of the world. Wink’s tough love prepares her for the unraveling of the universe; for a time when he’s no longer there to protect her. When Wink contracts a mysterious illness, nature flies out of whack—temperatures rise, and the ice caps melt, unleashing an army of prehistoric creatures called aurochs. With the waters rising, the aurochs coming, and Wink’s health fading, Hushpuppy goes in search of her lost mother.",
  "storyline": "Hushpuppy, an intrepid six-year-old girl, lives with her father, Wink, in the Bathtub, a southern Delta community at the edge of the world. Wink's tough love prepares her for the unraveling of the universe; for a time when he's no longer there to protect her. When Wink contracts a mysterious illness, nature flies out of whack, temperatures rise, and the ice caps melt, unleashing an army of prehistoric creatures called aurochs. With the waters rising, the aurochs coming, and Wink's health fading, Hushpuppy goes in search of her lost mother.",
  "plot": "As a storm approaches a southern Louisiana bayou community called the \"Bathtub\" (a community cut off from the rest of the world by a levee), six-year-old Hushpuppy and her ailing, hot-tempered father Wink are optimistic about their life and their future. The children in school are being taught by Miss Bathsheba about nature and the release of prehistoric creatures called \"Aurochs\" from the melting ice caps. At home, Hushpuppy fends for herself while her father is missing. When he returns, he is wearing a hospital gown and bracelet. They argue, and when Hushpuppy returns to her house, she deliberately sets it on fire. A chase ensues between the two, and she ends up getting slapped by Wink. When she retaliates by punching him in the chest, Wink collapses. Hushpuppy, realizing the damage she has caused, runs for help only to find her father missing when she returns.\n\nMeanwhile, in the Arctic, the frozen Aurochs in an ice shelf start drifting into the ocean.\n\nMany of the Bathtub residents start fleeing due to the threat of an approaching storm. Wink reappears, staggering along the side of the road; he finds Hushpuppy and takes her home to start barricading before the storm hits. In an effort to make his daughter feel better, Wink attempts to scare off the storm by firing a rifle at the clouds. The next day, the two tour the devastation and connect with surviving residents.\n\nThe Bathtub residents celebrate the end of the storm and make plans to rebuild their community, but the environment is damaged because the salt water surge from the storm has contaminated the fresh water supply. Wink hatches a plan to drain the water away by destroying the levee. He and a small group of friends plant dynamite and blow a hole in the wall using an alligator gar, and the water recedes. Authorities arrive and enforce a mandatory evacuation order, removing the residents of the Bathtub to an emergency shelter. Wink receives surgery, but it is too late to restore his health. At the first opportunity, the evacuees leave and escape back to their homes.\n\nAware of her father’s condition, Hushpuppy searches for her absent mother. She and her friends swim to a boat, which takes them to a floating bar, known as the Elysian Fields. Hushpuppy meets a cook who may be her mother, though the woman doesn't recognize her. The cook says that the girl can stay with her if she wants, but Hushpuppy says that she's got to go home. Hushpuppy and her friends return home where she confronts the Aurochs. As the Aurochs leave, Hushpuppy returns home. She says her last goodbyes to the dying Wink, listening to his last heartbeat. She sets his funeral pyre ablaze, standing together with the remaining residents of the Bathtub.",
  "synopsis": "In a forgotten yet defiant bayou community called the Bathtub, cut off from the rest of the world by a sprawling levee, six-year-old Hushpuppy(Quvenzhané Wallis) exists on the brink of orphan-hood. Her mother is long gone, and her beloved father Wink(Dwight Henry) is a wildman on a perpetual spree. When Wink is home, he lives under a different roof: Wink in a rusted-out shack, and Hushpuppy in a trailer propped on two oil drums. More often than not, Hushpuppy is left to her own devices on their isolated compound filled with feral wildlife, where she perceives the natural world to be a fragile web of living, breathing, squirting things, wherein the entire universe depends on everything fitting together just right.While life in the Bathtub is defined by both resilience and celebration, at the local elementary school(boat), Hushpuppy's no-nonsense teacher, Miss Bathsheba(Gina Montana), educates her ragtag students about natural selection, global warming, and the huge ecological shifts that have pitted the Bathtub on the front line for extinction. \"Learn to live with one another, and adapt!\" she instructs. \"Y'all better learn how to survive, now...\"Reality crashes down on Hushpuppy's world when Wink comes down with a mysterious illness, and nature\nbegins to spiral out of control. A massive storm brews, the ice caps melt, and Wink shakes on the ground at her feet after a mere punch. Hushpuppy becomes convinced that the science attacking her environment and her father's insides are inextricably linked.Half a world away, in an unforeseen result of these sudden global shifts, fierce prehistoric beasts thaw out of the ice, righting themselves on firm ground after centuries immobile.As the waters rise around the bayou shrimping town, while all the practical people run for higher ground, Wink and his brigade of drunken sweethearts insist on staying put. He and Hushpuppy are forced to hole up together in Wink's rickety shack and ride out the hurricane, Wink firing a shotgun into the sky, defying the forces of nature. When morning breaks, the two find the Bathtub destroyed, empty, and almost totally submerged.Wink and Hushpuppy collect the other holdouts, and as is custom, greet their situation with celebration instead of remorse: They throw a party with all the remaining shrimp, crab, and beer. Miss Bathsheba kills the mood by\nreminding Wink that the excess of salt water in the Bathtub has likely killed all the flora and fauna that had\nprovided their sustenance; they could be consuming the last the bayou has to offer. Wink takes a swig of\nbeer and shrugs her off: \"I got it under control\". But his attempts to teach Hushpuppy to survive on her own in this altered environment fall short; a lesson on how to fish with bare hands leaves her in pain.The next morning, Hushpuppy is awoken by Wink and company sneaking out with a giant garfish filled with\nexplosives, the crackpot plan being to blow up the levee keeping all the water in, and drain out their homeland. Miss Bathsheba, the only one who understands the science of why this is a very bad idea, stops Wink, but not Hushpuppy, from executing the kamikaze scheme. The results are disastrous: The drained Bathtub, now resembling, a mushy, scorched-earth land formerly bursting with plants and animals, is now dead. Though Wink refuses to accept it, Hushpuppy can tell that the fabric of nature has unraveled around her, and that the \"unending\" bounty of the bayou is over.The fearsome beasts now cut looming shadows against the horizon and charge their way across continents, snarling, growling, knife-sharp horns glimmering as they head south...Soon afterwards, suddenly reminded of their existence, the government subjects the Bathtub to a mandatory\nevacuation, and men with bullhorns and strange accents whisk away Hushpuppy, Wink, and the other residents. They are taken to a sterile, gloomy refugee camp hospital, where everyone looks as bleak as \"fish in a fish tank without water\", according to Hushpuppy. In the care of the state, she is immediately dressed in unnatural-feeling \"acceptable\" clothing with the other unruly Bathtub kids. Confronted with his diagnosis from the doctors, Wink tries to give Hushpuppy away. Furious, Hushpuppy refuses, and Wink must finally tell her the truth: He's dying.At last, it hits Hushpuppy that her father isn't the maniacal superman she believed him to be. Out of his natural environment, he begins coughing up blood, and asks his friends to take him to the only place he knows as home. Unable to watch Wink on his deathbed, Hushpuppy flees across the water toward a light in the distance she believes to be her mother. A mysterious boatman plucks her out of the sea and takes her to his favorite nightclub, the Elysian Fields Floating Catfish Shack: \"GIRLS GIRLS GIRLS\". As Hushpuppy wanders this ethereal paradise, out of the kitchen steps a woman who stares at her with eyes like hers. \"Let me show you a magic trick\", she tells the awed Hushpuppy. Whipping up some killer grits n' gator and dishing out no-nonsense advice, she gives Hushpuppy a moment of love she's been looking for her whole life. But as they dance together, Hushpuppy realizes she has a duty to return to her father and The Bathtub before it's too late for both of them.The creatures suddenly appear on the parched crest before the dried-up bayou, a tiny girl in their crosshairs. They charge up behind her, when suddenly she swirls around to face them with eyes as fearless as theirs. They share a moment of primal understanding, and the beasts kneel before her. She goes on her way...Back in the Bathtub, Hushpuppy shares a last supper of fried gator with Wink in his broken shack. Having reconciled with her father and accepted nature's chosen path, she returns to her friends and family, a hardened warrior, and they parade into the Southern Wild as water laps at their feet.(\"Long Synopsis\" from the Festival de Cannes press kit for Beasts of the Southern Wild)."
}