{
  "imdb_id": "tt2168854",
  "tmdb_id": "137174",
  "douban_id": null,
  "title": "Marfa Girl (2012)",
  "genres": [
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "105 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.4,
  "director": [
    {
      "id": "nm0164187",
      "name": "Larry Clark"
    }
  ],
  "writer": [
    {
      "id": "nm0164187",
      "name": "Larry Clark",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm5071221",
      "name": "Adam Mediano",
      "character": "Adam"
    },
    {
      "id": "nm5071271",
      "name": "Drake Burnette",
      "character": "Marfa Girl"
    },
    {
      "id": "nm5071471",
      "name": "Jeremy St. James",
      "character": "Tom"
    },
    {
      "id": "nm2729831",
      "name": "Mary Farley",
      "character": "Mary"
    },
    {
      "id": "nm5071386",
      "name": "Mercedes Maxwell",
      "character": "Inez"
    },
    {
      "id": "nm4171545",
      "name": "Indigo Rael",
      "character": "Donna"
    },
    {
      "id": "nm0735270",
      "name": "Tina Rodriguez",
      "character": "Tina       (as Tina Thérèse)"
    },
    {
      "id": "nm5071102",
      "name": "Jessie Tejada",
      "character": "Jessie"
    },
    {
      "id": "nm5071408",
      "name": "Richard Covurrubias",
      "character": "Chachi"
    },
    {
      "id": "nm5071223",
      "name": "Erik Quintana",
      "character": "Erik"
    },
    {
      "id": "nm5071328",
      "name": "Lindsay Jones",
      "character": "Miss Jones"
    },
    {
      "id": "nm4689345",
      "name": "Ulysses Lopez",
      "character": "Ulysses"
    },
    {
      "id": "nm1281943",
      "name": "Jimmy Gonzales",
      "character": "Oscar"
    },
    {
      "id": "nm5071707",
      "name": "Elizabeth Castro",
      "character": "Angie"
    },
    {
      "id": "nm5071763",
      "name": "Nathan Stevens",
      "character": "Ty"
    },
    {
      "id": "nm4031352",
      "name": "Rodrigo Lloreda",
      "character": "Rodrigo"
    },
    {
      "id": "nm5071612",
      "name": "Sarah Laymon",
      "character": "Young Waitress"
    },
    {
      "id": "nm5337315",
      "name": "Paul Zeraldo",
      "character": "Paul"
    },
    {
      "id": "nm5071450",
      "name": "Angel Maxwell",
      "character": "Angel"
    }
  ],
  "overview": "A disaffected Texas teen spends his 16th birthday getting high, hanging out and having casual sex.",
  "storyline": "A story centered on a directionless 16-year-old living in Marfa, Texas and his relationships with his girlfriend, his neighbor, his teacher, a newly arrived local artist, and a local Border Patrol officer.",
  "plot": "This section may need to be rewritten entirely to comply with Wikipedia's quality standards, as its tone sounds like a press release. You can help. The discussion page may contain suggestions. (May 2015)\nThe film follows Adam, a directionless 16-year-old living in the working class town of Marfa, Texas, and his sexual relationships with his teenage girlfriend, twenty something neighbor, aggressive local artist and high school teacher, while an unhinged, misogynistic border patrol agent watches over the neighborhood. What ensues is a web of sex, drugs, and violence as the Latino skater punks adjust to their gritty, aimless life in the dead end town.",
  "synopsis": "Renowned and notorious photographer, artist, and filmmaker, Larry Clark has written and directed his new film, Marfa Girl, which takes place in Marfa, Texas (pop. 1,800).Marfa exists at a particular cultural nexus with a constant clash between the art community (inspired to come to Marfa by the American sculptor, Donald Judd), the white community and the Mexican American community. On top of that theres a smothering Border Patrol presence despite the fact the Mexican border is 68 miles away. There is an 11pm curfew for teenagers and they still have corporal punishment in the schools. They paddle kids in school from kindergarten through high school.Navigating all of this and more is Adam, a half-white half-Hispanic teenager thats just trying to figure shit out. His mother, Mary, loves him but is mostly consumed with tending to her collection of birds. His neighbor, Donna, a 23 year old mother to a year old son and girlfriend to a jailed drug dealer, is determined to seduce Adam on his 16th birthday despite his loving relationship to his age-appropriate girlfriend, Inez. To further complicate things for Adam, a nameless promiscuous young woman, sweeps into town as an artist-in-residence at a local art foundation and sets out to give Adam a full sex education.Tom, a border patrol agent with a lot of emotional baggage, is fixated on Adams mother and Adams girlfriend and Adam too. He longs for the family that he doesnt have.The film, ultimately, is about peoples internal life and why people become who they become. One character is a New Age spiritual healer. At the end she performs a much needed spiritual cleansing. The film is very Catholic in that the end is a new beginning, all sins are washed away and life goes on as each new day brings us a new start in life."
}