{
  "imdb_id": "tt2126362",
  "tmdb_id": "115210",
  "douban_id": null,
  "title": "Stitches (2012)",
  "genres": [
    "Comedy",
    "Horror"
  ],
  "country": "Ireland",
  "version": [
    {
      "runtime": "86 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm1114700",
      "name": "Conor McMahon"
    }
  ],
  "writer": [
    {
      "id": "nm1114700",
      "name": "Conor McMahon",
      "description": null
    },
    {
      "id": "nm1734511",
      "name": "David O'Brien",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0633665",
      "name": "Ross Noble",
      "character": "Stitches"
    },
    {
      "id": "nm1740366",
      "name": "Tommy Knight",
      "character": "Tom"
    },
    {
      "id": "nm0615331",
      "name": "Shane Murray-Corcoran",
      "character": "Vinny       (as Shane Murray Corcoran)"
    },
    {
      "id": "nm3845450",
      "name": "Gemma-Leah Devereux",
      "character": "Kate       (as Gemma Leah Devereux)"
    },
    {
      "id": "nm5245763",
      "name": "Thommas Kane-Byrne",
      "character": "Bulger       (as Thommas Kane Byrne)"
    },
    {
      "id": "nm4308537",
      "name": "Eoghan McQuinn",
      "character": "Richie       (as Eoghan Mcquinn)"
    },
    {
      "id": "nm5441162",
      "name": "Roisin Barron",
      "character": "Sarah       (as Róisín Barron)"
    },
    {
      "id": "nm5441149",
      "name": "Hugh Mulhern",
      "character": "Paul"
    },
    {
      "id": "nm5524278",
      "name": "Tommy Cullen",
      "character": "Dan"
    },
    {
      "id": "nm0218742",
      "name": "Lorna Dempsey",
      "character": "Mary"
    },
    {
      "id": "nm3983535",
      "name": "Jemma Curran",
      "character": "Jenny"
    },
    {
      "id": "nm5524377",
      "name": "Ryan Burke",
      "character": "Young Tom"
    },
    {
      "id": "nm0817719",
      "name": "Valerie Spelman",
      "character": "Tom's Mum"
    },
    {
      "id": "nm5246405",
      "name": "Kelianne Coughlan",
      "character": "Young Sarah       (as Kellianne Coughlan)"
    },
    {
      "id": "nm5524829",
      "name": "Kevin Smith",
      "character": "Young Paul"
    },
    {
      "id": "nm4958283",
      "name": "Callum Maloney",
      "character": "Young Bulger"
    },
    {
      "id": "nm5524259",
      "name": "Gerald Ahern",
      "character": "Young Vinny"
    },
    {
      "id": "nm4958213",
      "name": "Harry Behan",
      "character": "Young Richie"
    },
    {
      "id": "nm5074050",
      "name": "Laila Stack",
      "character": "Young Kate"
    },
    {
      "id": "nm1221808",
      "name": "Karl Shiels",
      "character": "Boss Clown"
    },
    {
      "id": "nm0568107",
      "name": "John McDonnell",
      "character": "The Motley       (as John Mcdonnell)"
    },
    {
      "id": "nm5524237",
      "name": "Yvonne McCloskey",
      "character": "The Motley       (as Yvonne Mccloskey)"
    },
    {
      "id": "nm5524813",
      "name": "Hilary Adam White",
      "character": "The Motley"
    },
    {
      "id": "nm3638943",
      "name": "Michael McGinley",
      "character": "The Motley       (as Michael Mcginley)"
    },
    {
      "id": "nm5524562",
      "name": "Tomomi Ando",
      "character": "The Motley"
    },
    {
      "id": "nm5524541",
      "name": "Edel Hayes",
      "character": "Stitches Mistress"
    },
    {
      "id": "nm3494555",
      "name": "Clyde Mowlds",
      "character": "Mr. Barnum"
    },
    {
      "id": "nm1120021",
      "name": "Eoin Whelan",
      "character": "Principle Ashley       (as Cathal Ceaunt)"
    },
    {
      "id": "nm5524789",
      "name": "Linda Byrne",
      "character": "Bulger's Mother"
    },
    {
      "id": "nm3467013",
      "name": "Bryan Quinn",
      "character": "Smokey O'Rourke"
    },
    {
      "id": "nm5524759",
      "name": "Eanna O'Dowd",
      "character": "Rowdy Guy at Window"
    },
    {
      "id": "nm9924783",
      "name": "Conal Gilmartin",
      "character": "Rowdy Guy at Window"
    },
    {
      "id": "nm9924784",
      "name": "Joseph Ryan",
      "character": "Rowdy Guy at Window"
    },
    {
      "id": "nm9924785",
      "name": "Conor Slattery",
      "character": "Priest"
    },
    {
      "id": "nm9924786",
      "name": "Jacqueline Logan",
      "character": "Stitches' Mourning Woman"
    },
    {
      "id": "nm4505096",
      "name": "Lorraine Harton",
      "character": "Stitches' Mourning Woman"
    }
  ],
  "overview": "The clumsy and unfunny clown Richard \"Stitches\" Grindle entertains at the 10th birthday party of little Tom, but the boy and his friends play a prank with Stitches, tying his shoelaces. Stitches slips, falls and dies. Six years later, Tom gives a birthday party for his friends at home, but Stitches revives to haunt the teenagers and revenge his death.",
  "storyline": "The clumsy and unfunny clown Richard \"Stitches\" Grindle goes to the birthday party of little Tom and the boy and his friends play a prank with Stitches, tying his shoelaces. Stitches slips, falls and dies. Six years later, Tom gives a birthday party for his friends at home and the clown revives to haunt the teenagers and revenge his death.",
  "plot": "Richard Grindle (Ross Noble), a clown with the stage name \"Stitches\", is having sex with a woman in his van. While they are having sex, she notices an egg encased in a glass tube with a face painted on it. Stitches explains that \"they\" made him do it when he signed up. Stitches arrives late at Tommy's (Ryan Burke) tenth birthday party. He attempts to entertain the children, but they instead ridicule him. Tommy's best friend Vinnie (Gerald Ahern) ties Stitches' shoelaces together, and Tommy throws a football on his face, causing him to trip and land on a kitchen knife on the other side of the room, unseen to the children, which penetrates his face. As the children come to find out, Stitches slowly gets up. Seeing him, all kids scream in terror and run away.However, Tommy stays transfixed, but when Stitches removes the knife, blood gushes out of the gaping wound, causing him to fall, and the knife flies above him. Stitches falls onto the floor as the knife falls onto his eye, killing him. Tommy visits Stitches' grave and finds a group of clowns performing a ritual. The group's leader, The Motley, threatens Tommy.\n\nSix years later, Tommy (Tommy Knight) is preparing for his sixteenth birthday. He is still haunted by the memory of his past birthday, and begins to have frightening hallucinations, such as a teacher turning into a clown and ripping off Vinnie's testicles before tying them to a party balloon. Hesitating at the idea of throwing a large party, he considers instead inviting only a few friends. Ultimately, he settles on a large gathering, and Vinnie secretly distributes many more invitations over the internet. Tommy, Vinnie, Richie (Eoghan McQuinn) and Bulger (Thommas Kane Byrne), all of whom had been present when Stitches died, prepare the house. As the guests, including Tommy's childhood crush Kate (Gemma-Leah Devereux), arrive, Stitches comes back to life and leaves his grave.\n\nTommy, startled by Paul (Hugh Mulhern) dressed as a clown as a joke, injures his head. Bulger takes Tommy to find a first-aid kit, and Tommy retreats to his treehouse with Kate. There, Tommy discusses his memories of the ritual he encountered as a child. Meanwhile, Paul is attacked by Stitches, who rips off his ear and one of his arms and pulls a live rabbit out of his throat before kicking his head off. The clown then finds Bulger, opens up his skull with a can opener, and removes his brain with an ice cream scooper. After serving up three perfectly round scoops of brain in a glass bowl, Stitches adds blood as a topping to complete his grisly ice cream sundae. Sarah, (Roisin Barron) Paul's girlfriend, enters the attic to look for him. There, she is attacked by Stitches, and manages to fight back. As she escapes, Stitches drives an umbrella through her skull, killing her. Through his telescope, Tommy sees Stitches in the house, and goes to warn Vinnie of his presence, but is at first unsuccessful, due to Vinnie's desire to have sex with a formerly overweight classmate. Tom asks Kate to leave, but her boyfriend Dan (Tommy Cullen) stops her.\n\nOutside, Stitches attacks Richie. Richie attempts to flee but trips and falls. Stitches rips out his intestines and fashions them into a balloon animal before stabbing him with a bike pump and inflating him. Stitches manages to pump enough air into Richie to cause his head to explode. Vinnie, on discovering Tommy to be telling the truth, attempts to leave, but Stitches attacks them. Tommy stabs him, Vinnie covers him with a blanket, and they escape. Tommy and Vinnie rescue Kate, but Stitches knocks her unconscious as they attempt to escape. Tom tries to resuscitate her, and Vinnie leaves them behind, and Stitches attempts to drown Tommy in a sink that Vinnie had previously vomited in. Kate awakens and throws a knife at Stitches, while Tommy deduces a manner in which to defeat the clown; to kill him, they must destroy the egg he kept in his van. Tommy and Kate, pursued by Stitches, make their way to the den in the graveyard. While hiding, Tommy begins to hiccup, and Kate kisses him in order for him to stay quiet and hidden. Tommy searches for Stitches' egg among a collection of them while Kate keeps an eye out for Stitches, but the pair are soon discovered by him. While deciding which of the two to kill, Vinnie ties Stitches' shoelaces together again. He trips, and drops his egg. Tommy forces Stitches to smash the egg, and Stitches explodes in a mixture of magic trick supplies and yolk.\n\nSix months later, Tommy has moved to a new house and is dating Kate. While the couple are in Tommy's old treehouse, Kate gives Tommy a new telescope, and his old one is positioned so as to focus on the den in the graveyard. There, The Motley is attempting to piece Stitches' broken egg back together while receiving a blow job. The egg is now fully restored indicating that Stitches will return. After the film cuts to black, Stitches' catchphrase, \"Everybody happy?\", is heard.",
  "synopsis": "STITCHES, starring funny man ROSS NOBLE, is the black comedy-horror which tells the story of jaded Richard Grindle, the sleaziest clown working the childrens' party circuit in Ireland. Arriving late to one birthday, his timing is off, the bratty kids a nightmare and a prank goes horribly wrong - he falls on a kitchen knife and goes to that Big Top in the sky. Years later the same nasty kids attend another more grown up bash. Little do they know, thanks to a black magic clown cult, Stitches will be the uninvited guest of honour seeking revenge on those responsible for his untimely death.Laughs and gore combine in this twisted tale which also sees some fantastic performances from its young and upcoming cast that includes; TOMMY KNIGHT (Doctor Who) and GEMMA-LEAH DEVEREUX (The Tudors)."
}