{
  "imdb_id": "tt2171993",
  "tmdb_id": "96664",
  "douban_id": null,
  "title": "Nightfall (2012)",
  "genres": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "country": "Hong Kong",
  "version": [
    {
      "runtime": "108 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm3469952",
      "name": "Roy Hin Yeung Chow"
    }
  ],
  "writer": [
    {
      "id": "nm3469952",
      "name": "Roy Hin Yeung Chow",
      "description": "screenplay"
    },
    {
      "id": "nm1644613",
      "name": "Chi-long To",
      "description": "screenplay as Christine To Chi Long"
    }
  ],
  "cast": [
    {
      "id": "nm0156533",
      "name": "Nick Cheung",
      "character": "Wang Yuen-yeung"
    },
    {
      "id": "nm0945189",
      "name": "Simon Yam",
      "character": "Lam Ching Chung"
    },
    {
      "id": "nm2906761",
      "name": "Janice Man",
      "character": "Tsui Suet /              Tsui Eva"
    },
    {
      "id": "nm3280986",
      "name": "Kay Tse",
      "character": "Au Yeung Ying"
    },
    {
      "id": "nm1320632",
      "name": "Chi Kui Chow",
      "character": "Wang's Brother"
    },
    {
      "id": "nm1326593",
      "name": "Hei-Yi Cheng",
      "character": "Lam's Wife"
    },
    {
      "id": "nm5772300",
      "name": "Chi-Yeung Chow",
      "character": "Ah Keung       (as Hinson Chow)"
    },
    {
      "id": "nm2252717",
      "name": "Phat Chan",
      "character": "Ah Phat"
    },
    {
      "id": "nm3780782",
      "name": "Julius Brian Siswojo",
      "character": "Little B       (as JBS - Brian)"
    },
    {
      "id": "nm2907784",
      "name": "Ho Ming Luk",
      "character": "Coroner"
    },
    {
      "id": "nm3276013",
      "name": "Clifton Kwan",
      "character": "Ah Tung"
    },
    {
      "id": "nm6579531",
      "name": "Ka-Lok Wong",
      "character": "Young Lam       (as Stephen Wong)"
    },
    {
      "id": "nm3230812",
      "name": "Kim-Wing Lee",
      "character": "Prisoner       (as Li Kim Wing)"
    },
    {
      "id": "nm7546336",
      "name": "Ladnongkhee Adul",
      "character": "Prisoner"
    },
    {
      "id": "nm6260397",
      "name": "Anthony Au",
      "character": "Prisoner"
    },
    {
      "id": "nm7546337",
      "name": "Yuen-yee Man",
      "character": "News Anchor       (as Paula Wong)"
    },
    {
      "id": "nm7546338",
      "name": "Juno Leung",
      "character": "Friend of Lam's Daughter"
    },
    {
      "id": "nm4102256",
      "name": "Oi-Ling Lau",
      "character": "School Dean       (as Ellen Liu)"
    },
    {
      "id": "nm7546339",
      "name": "Nicholas Atkinson",
      "character": "Supervisor Spencer"
    },
    {
      "id": "nm0498566",
      "name": "Mike Leeder",
      "character": "80's British CID"
    },
    {
      "id": "nm7546340",
      "name": "David Clive Balcer Oxley",
      "character": "80's British CID"
    },
    {
      "id": "nm2511855",
      "name": "Wai-Keung Tung",
      "character": "80's CID       (as Tung Wai Keung)"
    },
    {
      "id": "nm7546341",
      "name": "Alex Lee",
      "character": "80's CID"
    },
    {
      "id": "nm1708543",
      "name": "Chi-Wai Lai",
      "character": "80's CID       (as Lai Chi Wai)"
    },
    {
      "id": "nm2694853",
      "name": "Mason Chiu",
      "character": "80's Correctional Services Officer"
    },
    {
      "id": "nm7546342",
      "name": "Meg Cheung",
      "character": "Wang's Classmate"
    },
    {
      "id": "nm7546343",
      "name": "Vinson Lam",
      "character": "Wang's Classmate"
    },
    {
      "id": "nm7546344",
      "name": "Zoe Lee",
      "character": "School Staff"
    },
    {
      "id": "nm5688424",
      "name": "Wylie Chan",
      "character": "Saleman"
    },
    {
      "id": "nm4960132",
      "name": "Piggy Chan",
      "character": "Landlord       (as Gam-Chuen Chan)"
    },
    {
      "id": "nm0939255",
      "name": "Michael Wong",
      "character": "Han Tsui"
    },
    {
      "id": "nm0950546",
      "name": "On-On Yu",
      "character": "Mrs. Tsui"
    },
    {
      "id": "nm4081050",
      "name": "Shawn Dou",
      "character": "Young Wang Yuen-yeung"
    },
    {
      "id": "nm7546346",
      "name": "Tian Zhuang Shuang",
      "character": "Former Prison Guard"
    },
    {
      "id": "nm0514904",
      "name": "Chia-Hui Liu",
      "character": "Retired CID Officer Lung       (as Gordon Lau)"
    },
    {
      "id": "nm0719016",
      "name": "Jun Kung",
      "character": "Wang's Former Acquaintance"
    },
    {
      "id": "nm0516310",
      "name": "Ken Lo",
      "character": "Prisoner       (as Kenneth Lo)"
    },
    {
      "id": "nm0156506",
      "name": "Kwok Keung Cheung",
      "character": "Interviewee       (as KK Cheung)"
    },
    {
      "id": "nm0518074",
      "name": "Ying Kwan Lok",
      "character": "Yu       (as Felix Lok)"
    },
    {
      "id": "nm2978731",
      "name": "Cheuk-lap Hung",
      "character": "Zoe's Friend       (as Ken Hung)"
    },
    {
      "id": "nm5753377",
      "name": "Cherry Ngan",
      "character": "George's daughter"
    }
  ],
  "overview": "Inspector Lam investigates the brutal murder of Tsui, a famous musician. Wong, the designated suspect, just spent 20 years in jail for the murder of Tsui's daughter but has always claimed his innocence.",
  "storyline": "A mutilated corpse appears to be a straightforward case of revenge killing, but as Inspector Lam zeroes in on the ex-con prime suspect, he finds himself confronting a web of lies. To reach the truth, Lam must delve into the details of a 20-year-old case for answers (a case in which he finds himself to have had an incidental part).",
  "plot": "20 years ago, a 19-year-old Wong Yuen-yeung was convicted of murdering an 18-year-old Eva and was sentenced to life imprisonment. Now, after being released on parole, he starts stalking Zoe, young pianist. Zoe is the daughter of Han Tsui, a famous musician, and she resembles Eva in appearance. Han Tsui is very abusive and controlling towards Zoe. He does not allow her to have any male friends, and justifies his actions as \"protecting\" her from harm.\n\nGeorge Lam, a police inspector, is unable to accept the fact that his wife committed suicide many years ago and remains deeply troubled by it. He occupies himself with work and neglects his daughter.\n\nOne day, Han Tsui is found dead near the beach with his face completely mashed up. Lam and his team are assigned to investigate the incident. While searching for links to the victim, Lam inadvertently uncovers the murder case involving Wong and learns that Eva was actually Han Tsui's daughter. When he asks Zoe and Mrs Tsui about it, he is surprised to hear that the tragedy had been kept secret from Zoe all this while and that she never knew she had an elder sister who was murdered.\n\nLam tracks down Wong and questions him about the case but receives only frosty responses. The police are rather convinced that Wong is the murderer after finding out more about his background from people who knew him, and after he attacked Lam and Ying (Lam's colleague) on two separate occasions.\n\nWhile the police are out on a manhunt for Wong, Lam carefully considers the entire case again and realises that Wong's behaviour appears to be for the purpose of drawing attention towards himself. Throughout that period of time, they have also visited the Tsuis a few times. Ying points out to Lam that Mrs Tsui is suspicious because every time they visited her, she is always busy cleaning the same patch of ground outside her house. They comb the area and discover traces of blood.\n\nDuring interrogation, Mrs Tsui reveals the truth about Han Tsui's treatment of Zoe, and how she has remained silent all this while to protect her husband's reputation. More shockingly, she tells Lam that Zoe is, in fact, the illegitimate daughter of Eva and Eva's lover. Han Tsui had treated Eva in the same manner as he did to Zoe, and he killed Eva in anger after discovering her secret affair. Eva's lover is Wong, who rushed to the scene of Eva's death after Han Tsui killed her, and was arrested on the spot. The police investigators strongly believed that Wong tried to rape Eva and then killed her, so they resorted to violent means to make him confess to the crime. Lam, who was still a young rookie then, caught a glimpse of the investigators beating up Wong in the room. Wong eventually succumbed to the torture and admitted to murdering Eva. During his time in prison, Wong attempted suicide by piercing his throat with a pencil but failed and became mute as a consequence. He was ostracised by the other prisoners and once beat up four inmates who harassed him.\n\nHan Tsui's death is actually an accident: He was hitting Zoe, who tried to defend herself by pushing him away, but missed his step and fell off the balcony to his death. His dead body was taken away by Wong, who abandoned it at the beach after deliberately disfiguring his face so that no one could recognise him. Lam comes to the conclusion that Wong's true intention in doing everything he did so far is to divert the police's attention away from Zoe and make them think that he is the murderer.\n\nIn the meantime, the police have tracked down Wong and cornered him on the rooftop of a high building. Wong manages to convey the words – \"Have you ever given your daughter a piggyback ride?\" – to Lam before throwing himself off the roof to his death. Later, Lam receives a message sent to him by Wong before his death, in which Wong said he was envious of Lam because Lam had the privilege of watching his own daughter grow up while he did not because he was in jail. Lam breaks down after reading Wong's message as he feels sorry for having neglected his daughter since his wife's death.\n\nTowards the end of the film, Zoe goes to the police station to turn herself in, and is received by Lam, who says he expected her to do so. When she asks Lam about the identity of the mysterious man who has been trying to protect her, he shows her Wong's photos. In a post-credits scene, Lam and Ying have a brief discussion on the conclusion of the case, after which they go to Lam's house to celebrate.",
  "synopsis": null
}