{
  "imdb_id": "tt2109184",
  "tmdb_id": "82990",
  "douban_id": "10429695",
  "title": "Paranormal Activity 4 (2012)",
  "genres": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "88 min",
      "description": ""
    },
    {
      "runtime": "96 min",
      "description": "unrated"
    }
  ],
  "imdb_rating": 4.6,
  "director": [
    {
      "id": "nm1160962",
      "name": "Henry Joost"
    },
    {
      "id": "nm1413364",
      "name": "Ariel Schulman"
    }
  ],
  "writer": [
    {
      "id": "nm0484907",
      "name": "Christopher Landon",
      "description": "screenplay"
    },
    {
      "id": "nm1739039",
      "name": "Chad Feehan",
      "description": "story"
    },
    {
      "id": "nm2305431",
      "name": "Oren Peli",
      "description": "film \"Paranormal Activity\""
    }
  ],
  "cast": [
    {
      "id": "nm2209370",
      "name": "Katie Featherston",
      "character": "Katie"
    },
    {
      "id": "nm1105980",
      "name": "Kathryn Newton",
      "character": "Alex"
    },
    {
      "id": "nm2397866",
      "name": "Matt Shively",
      "character": "Ben"
    },
    {
      "id": "nm4851831",
      "name": "Aiden Lovekamp",
      "character": "Wyatt"
    },
    {
      "id": "nm4745504",
      "name": "Brady Allen",
      "character": "Robbie"
    },
    {
      "id": "nm0242295",
      "name": "Stephen Dunham",
      "character": "Doug"
    },
    {
      "id": "nm0496782",
      "name": "Alexondra Lee",
      "character": "Holly"
    },
    {
      "id": "nm5515726",
      "name": "Georgica Pettus",
      "character": "Sarah"
    },
    {
      "id": "nm2647981",
      "name": "Alisha Boe",
      "character": "Tara"
    },
    {
      "id": "nm3293813",
      "name": "Brendon Eggertsen",
      "character": "Derek"
    },
    {
      "id": "nm5396803",
      "name": "Constance Esposito",
      "character": "Robbie's Mom's Friend"
    },
    {
      "id": "nm5515833",
      "name": "Ty Dawson",
      "character": "Shadow Boy"
    },
    {
      "id": "nm5516025",
      "name": "Jonah Pasco",
      "character": "Shadow Boy"
    },
    {
      "id": "nm2943328",
      "name": "Rightor Doyle",
      "character": "Referee"
    },
    {
      "id": "nm5935485",
      "name": "Tamara Bersane",
      "character": "Wyatt's Soccer Coach"
    },
    {
      "id": "nm0354937",
      "name": "Jennifer Hale",
      "character": "(voice)"
    },
    {
      "id": "nm0167139",
      "name": "Robert Clotworthy",
      "character": "(voice)"
    },
    {
      "id": "nm7230670",
      "name": "Esther Austin",
      "character": "(voice)"
    },
    {
      "id": "nm5167091",
      "name": "Mary Payne Moran",
      "character": "(voice)"
    },
    {
      "id": "nm7230671",
      "name": "Taj",
      "character": "Agnes the Cat"
    },
    {
      "id": "nm0240269",
      "name": "John Duerler",
      "character": "Mr. Kramer"
    },
    {
      "id": "nm7231032",
      "name": "Jake Plotkin",
      "character": "Jake Skywalker"
    }
  ],
  "overview": "It has been five years since the disappearance of Katie and Hunter, and a suburban family witness strange events in their neighborhood when a woman and a mysterious child move in.",
  "storyline": "The story takes place in 2011, five years after Katie killed her boyfriend Micah, sister Kristi, her husband Daniel; and took their baby, Hunter. Story focuses on Alex and her family experiencing weird stuff since the new neighbors moved in the town.",
  "plot": "On October 9, 2006, Kristi Rey and her husband Daniel are killed by her demon-possessed sister Katie, who then abducts Kristi's one-year-old son, Hunter. Text states that Katie and Hunter's whereabouts remained unknown.\n\nIn November 2011, Alex Nelson lives in suburban Henderson, Nevada with her father Doug, mother Holly, and little brother Wyatt. Alex and her boyfriend Ben discover their new neighbor's son, Robbie, hiding in their family treehouse. The next day, Robbie's mother falls ill and is taken to the hospital, leaving Robbie, who begins mentioning an invisible friend named Toby, in the care of the family. Over the next few days, many supernatural occurrences begin to take place.\n\nThe activity soon becomes violent; a chandelier falls from the ceiling and almost lands on Alex. One night, Alex notices several cars parked outside of Robbie's house and goes to investigate, but flees after being confronted by a strange woman. Later, Robbie draws a green symbol on Wyatt's back, which Alex later discovers is associated with witchcraft and demonic possession. Robbie takes Wyatt to his house and when Alex chases after him she meets Robbie's mother, revealed to be Katie. Then the knife that disappeared almost kills Doug. Wyatt later confides in Alex that Katie told him he was adopted, like Robbie, and that his birth family needs him. Later Wyatt, while taking a bath, is pulled underwater in the bathtub by an unseen force, he rises in an apparent trance. Later that night, Wyatt goes into Alex's room and levitates her while she sleeps. The next day, Wyatt refers to himself as \"Hunter\", telling Alex it is his true name.\n\nWhile alone in the house with Wyatt, Alex video-chats with Ben about her parents being mad at her when she hears the garage door open by itself; upon entering she is locked inside. Katie appears in the house and goes upstairs to Wyatt's room, where she tells him that she'll wait until he is \"ready\". The family's car turns on by itself and begins spewing exhaust, but Alex escapes by breaking into the car and crashing through the garage door. The next day, Holly is violently thrown against the ceiling by the demon and dropped to the floor, killing her; Katie then appears and drags her dead body away. Ben arrives and leaves Alex a message before he is killed by Katie, who snaps his neck.\n\nAlex and Doug arrive home and Doug goes next door, thinking he saw Holly and Wyatt. As he goes to investigate, Alex finds Ben's body before she is attacked. She flees to Katie's home, and searches for Doug but cannot find him. Alex eventually finds a screaming and helpless Doug being dragged down the hall to an undisclosed room. As she continues to search for Doug, she encounters the demonically possessed Katie who sprints towards the camera shrieking. She escapes Katie and finds Wyatt in the yard, who refuses to leave. When Alex looks up, she sees the coven approaching her; as she turns around a demonic Katie attacks her while the camera falls to the ground and the screen cuts to black.\n\nIn a post-credits scene, two Spanish-speaking men go into a mysterious store. After finding witchcraft products, they decide to leave but a woman encounters the two and says \"esto es solo el comienzo\" (\"This is only the beginning\"). Frightened by her, the men abruptly leave the store and the camera cuts out, setting up the events for Paranormal Activity: The Marked Ones.",
  "synopsis": "Alex (Kathryn Newton) films her younger brother Wyatt's football match. At Alex's house, she shows her boyfriend Ben (Matt Shively) the treehouse in the garden. Here they discover Robbie, the neighbours' child. Puzzled with why he is here she takes him back to his own house across the road. In the early hours of the next morning Alex hears an ambulance outside at Robbie's house. The next day Robbie turns up at the house after Alex's mom offered to look after him for a few days because his mother went into the hospital. Later on that day Alex finds Wyatt and Robbie in her treehouse talking to Robbie's invisible friend. In the evening Wyatt is playing multi-player on the Kinect by himself with Robbie sitting on the sofa.Ben asks who Wyatt is playing with and Robbie tells him it's his friend. When Alex arrives in the lounge Ben turns the lights off in the lounge and shows Wyatt through the camera the infra-red tracking dots. As Alex, Ben and Wyatt dance in the dark and Robbie sits on the sofa, the camera picks up something moving on the sofa next to him.The next day Ben shows Alex that his computer automatically records their webcam chats and in the middle of the night while Alex was sleeping, Robbie came in and slept next to her. He suggests that he can set up laptops around the house to record everything. Over the next couple of days strange occurrences happen around the house, such as Robbie waking up in the middle of the night and talking to the TV, Robbie and Wyatt running around the house in the early hours of the morning chasing a silhouette of a small child figure. Robbie draws a strange symbol on Wyatt's back, which Alex later finds to be part of an old cult (first appeared in Paranormal Activity 3). When alone in the house Alex hears noises and follows them to the hallway where the chandelier falls down from the ceiling and smashes into the floor.Her father later blames this on the light fitters, but Alex is suspicious of Robbie. The next day she sees from her bedroom window that Robbie and Wyatt have ran across to his house. Alex follows them to discover that Robbie's mother - Katie from the previous movies (Katie Featherston) - is actually home. After Alex takes Wyatt back home he tells her that Katie told him he was adopted like Robbie. Alex questions her parents about Wyatt's real parents but they refuse to say anything. Wyatt later on then talks to an invisible figure, we only hear Wyatt's responses but Wyatt says that his name isn't Hunter. He later insists that his name is Hunter. At several points, Katie sneaks into the house to talk to Hunter, telling him she'll be with him until he's \"ready.\" In the evening Wyatt appears in Katie's room and Alex is picked up into the air.The next day when Alex's mother is downstairs alone in the house and starts to hear strange noises. Katie appears in the house and heads upstairs. When Alex's mother enters the lounge an unseen entity suddenly picks her up before dropping her onto the floor, instantly killing her. Katie comes back downstairs and drags her body off screen. Sometime later Ben arrives at the house to discover no one is home. He goes to view the footage in Alex's bedroom but Katie appears and snaps his neck. Katie finds Wyatt in the house and tells him that he is Hunter.Alex and her father arrive back home, and he thinks he sees Alex's mother with Wyatt walking to Katie's house. As he goes to explore Alex goes home to discover Ben's body. She runs out of the house and over to Katie's house to warn her dad who she witnesses being dragged violently through the house by the unseen entity. She runs to a bedroom at the far end of the house but can't find his body. As she turns around to head back out Katie appears and storms forward demonically screaming at Alex. Alex quickly runs and climbs out of the window where she discovers Wyatt standing outside. Just as she is about to run away with Wyatt, numerous blank-faced people appear in Katie's garden. Alex turns the other way only to be attacked by Katie before the camera cuts out."
}