{
  "imdb_id": "tt2118624",
  "tmdb_id": "293970",
  "douban_id": "25881628",
  "title": "The Final Girls (2015)",
  "genres": [
    "Comedy",
    "Drama",
    "Fantasy",
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "88 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm0833889",
      "name": "Todd Strauss-Schulson"
    }
  ],
  "writer": [
    {
      "id": "nm4784201",
      "name": "M.A. Fortin",
      "description": "written by &"
    },
    {
      "id": "nm0588679",
      "name": "Joshua John Miller",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm3920288",
      "name": "Taissa Farmiga",
      "character": "Max Cartwright"
    },
    {
      "id": "nm0015196",
      "name": "Malin Akerman",
      "character": "Nancy"
    },
    {
      "id": "nm1573253",
      "name": "Alexander Ludwig",
      "character": "Chris Briggs"
    },
    {
      "id": "nm2400045",
      "name": "Nina Dobrev",
      "character": "Vicki Summers"
    },
    {
      "id": "nm0790057",
      "name": "Alia Shawkat",
      "character": "Gertie Michaels"
    },
    {
      "id": "nm3042755",
      "name": "Thomas Middleditch",
      "character": "Duncan"
    },
    {
      "id": "nm2796745",
      "name": "Adam Devine",
      "character": "Kurt"
    },
    {
      "id": "nm1640326",
      "name": "Angela Trimbur",
      "character": "Tina"
    },
    {
      "id": "nm1821410",
      "name": "Chloe Bridges",
      "character": "Paula"
    },
    {
      "id": "nm3402269",
      "name": "Tory N. Thompson",
      "character": "Blake"
    },
    {
      "id": "nm4754558",
      "name": "Reginald Robinson",
      "character": "Hunky Hiker"
    },
    {
      "id": "nm4754232",
      "name": "Lauren Gros",
      "character": "Mimi"
    },
    {
      "id": "nm3571476",
      "name": "Daniel Norris",
      "character": "Billy Murphy"
    },
    {
      "id": "nm6472230",
      "name": "Eric Michael Carney",
      "character": "Young Billy Murphy       (as Eric Carney)"
    },
    {
      "id": "nm1346346",
      "name": "Cory Hart",
      "character": "Doctor"
    },
    {
      "id": "nm4766309",
      "name": "Jackie Tuttle",
      "character": "Nurse"
    },
    {
      "id": "nm4504897",
      "name": "Dave Davis",
      "character": "50's Counselor"
    },
    {
      "id": "nm4753789",
      "name": "Bryce Romero",
      "character": "Mean Kid"
    },
    {
      "id": "nm3381101",
      "name": "Steve French",
      "character": "Bloodbath Trailer VO"
    }
  ],
  "overview": "A young woman grieving the loss of her mother, a famous scream queen from the 1980s, finds herself pulled into the world of her mom's most famous movie. Reunited, the women must fight off the film's maniacal killer.",
  "storyline": "When Max (Taissa Farmiga) and her friends reluctantly attend a tribute screening of an infamous '80s slasher film that starred Max's late mother (Malin Akerman), they are accidentally sucked into the silver screen. They soon realize they are trapped inside the cult classic movie and must team up with the fictional and ill-fated \"Camp Bloodbath\" counselors, including Max's mom as the shy scream queen, to battle the film's machete-wielding, masked killer. With the body count rising in scene after iconic scene, who will be THE FINAL GIRLS left standing and live to escape this film?",
  "plot": "Following Gareth Mallory's promotion to M, James Bond takes leave from MI6. Receiving a posthumous message from the previous M, Bond carries out an unauthorised mission in Mexico City, killing three men plotting a terrorist bombing on a stadium during Day of the Dead celebrations, before giving chase to their leader, Marco Sciarra. In the ensuing struggle, Bond steals Sciarra's ring, which is emblazoned with a stylised octopus, and kills him. Upon returning to London, Bond is indefinitely suspended from field duty by M. Parallel to this, M is in the midst of a power struggle with Max Denbigh (whom Bond dubs \"C\"), the head of a privately backed agency, the Joint Intelligence Service. C campaigns for Britain to form \"Nine Eyes\", a global surveillance and intelligence co-operation initiative and uses his influence to close down the '00' section as he believes it to be outdated.\n\nBond disobeys M's order and travels to Rome to attend Sciarra's funeral. That evening he seduces Sciarra's widow Lucia, who tells him about Spectre, an organisation of businessmen with criminal and terrorist connections to which her husband belonged. Bond uses Sciarra's ring to infiltrate a Spectre meeting, where he identifies the leader, Franz Oberhauser. When Oberhauser addresses Bond by name, he is pursued across the city by Spectre's assassin, Mr. Hinx. Moneypenny informs Bond that the information he collected leads to Mr. White, a former member of Quantum—a subsidiary of Spectre—who has fallen afoul of Oberhauser and has been marked for assassination. Bond asks her to investigate Oberhauser, who was presumed dead years earlier.\n\nBond locates White in Austria, where he learns that White is dying of thallium poisoning. He admits to having grown disenchanted with Quantum and tells Bond to find and protect his daughter, Dr. Madeline Swann, who will take him to L'Américain; this will in turn lead him to Spectre. White then commits suicide. Bond approaches Swann, and after he rescues her from Hinx, the two meet Q. Through Sciarra's ring, Q forensically links Oberhauser to Bond's previous missions, identifying Le Chiffre, Dominic Greene and Raoul Silva as Spectre agents. Swann reveals that L'Américain is a hotel in Tangier.\n\nThe two travel to the hotel and discover White left evidence directing them to Oberhauser's operations base in the desert. After an encounter with Hinx that sees the assassin killed, Bond and Swann are escorted to Oberhauser's base. There, Oberhauser reveals that Spectre has been funding the Joint Intelligence Service while staging terrorist attacks around the world, creating a need for the Nine Eyes programme. In return C will give Spectre unlimited access to intelligence gathered by Nine Eyes, allowing them to anticipate and counter-act investigations into their operations. Bond is tortured as Oberhauser discusses their shared history: after the younger Bond was orphaned, Oberhauser's father, Hannes, became his temporary guardian. Believing that Bond supplanted his role as son, Oberhauser killed his father and staged his own death, subsequently adopting the name Ernst Stavro Blofeld and going on to form Spectre. Bond and Swann overpower him and escape, destroying the base in an explosion and leaving Blofeld to die.\n\nAs the Moroccan facility was one node in a wider network, Bond and Swann return to London where they meet M, Bill Tanner, Q, and Moneypenny with the intention of arresting C and stopping Nine Eyes from being activated. Swann and Bond are abducted separately, while the rest of the group proceed with the plan. After Q succeeds in preventing the Nine Eyes from going online, a brief struggle between M and C ends with C falling to his death. Meanwhile, Bond is taken to the old MI6 building, which is scheduled for demolition. Moving throughout a ruined labyrinth, he encounters a disfigured Blofeld, who tells him that he has a choice between escaping the building before explosives are detonated or die trying to save Swann. Bond finds Swann and the two escape by boat as the building collapses.\n\nBond gives chase and manages to shoot down Blofeld's helicopter, which crashes onto Westminster Bridge. Blofeld crawls away from the wreckage and is confronted by Bond, with Blofeld attempting to goad Bond into shooting him. Bond unloads his gun, sparing Blofeld. As Blofeld is arrested by M, Bond throws his gun into the Thames and leaves the bridge with Swann.",
  "synopsis": "The film starts with a trailer for an old school \"Friday The 13th\"-esque slasher film called \"Camp Bloodbath\", which features a group of counselors at Camp Blue Finch being terrorized by a masked killer named Billy Murphy (Dan B. Norris). Watching the trailer on her phone is Max Cartwright (Taissa Farmiga). Her mother Amanda (Malin Akerman) was one of the leads in that film. Max waits for her mom as she leaves an audition. Amanda is a bit discouraged since she feels she is only known for \"Camp Bloodbath\" and has thus been typecast.The two drive away with Max telling Amanda all the bills she has to pay. She puts on the radio, which is playing Kim Carnes' \"Bette Davis Eyes\", Amanda's favorite song. Max then accidentally spills her milkshake on Amanda's headshot, distracting Amanda and causing her to hit a car, and then roll against traffic cones and tumble hard across the deserted street.Three years later, Max is now living with her aunt. Her best friend Gertie (Alia Shawkat) picks her up to go study at a diner with their friend Chris (Alexander Ludwig). Gertie's stepbrother Duncan (Thomas Middleditch) enters and pleads with Max to attend a double feature for \"Camp Bloodbath\" and its sequel, \"Camp Bloodbath 2: Cruel Summer\". Since the show falls on the anniversary of Amanda's death, Max refuses, but Duncan eventually convinces her to show up as a special guest.The four go to the double feature. They encounter Chris's ex-girlfriend and Max's former best friend Vicki (Nina Dobrev), who becomes a nuisance to the friends. They later watch the first movie, which plays to a huge crowd. Max feels a bit emotional watching her mom on the screen again. In the crowd, two guys pass around a liquor bottle, which gets dropped and rolls across the floor, spilling booze everywhere. Another guy lights up a cigarette, and the ash falls onto the liquor, igniting it and setting a curtain on fire that eventually spreads through the whole theater. The audience runs for the exits, blocking it for Max and her friends. She grabs a sharp item and leads Gertie, Chris, Duncan, and Vicki toward the screen. Max cuts through the screen and they enter through a blinding white light.The friends find themselves in the woods, right at the start of \"Camp Bloodbath\". The main counselors - horny idiot Kurt (Adam Devine) and bimbo Tina (Angela Trimbur) - drive by the friends and ask where Camp Blue Finch is. Not realizing what happened, the friends let the counselors drive away from them. They wait over two 92-minute periods (the film's runtime, twice) before the counselors return and Duncan tells Tina they are also counselors and would like a ride to the camp. In the van, the friends meet another counselor, Blake (Tory N. Thompson), and Amanda, in character as Nancy, the \"shy girl with a clipboard and guitar\".The group arrives at Camp Blue Finch. Duncan tries to get Kurt to give him the keys to the van so they can find a way out of the movie, but Kurt tosses the keys into the woods. Max tries to get Nancy away from Kurt, because her character is fated to die after having losing her virginity to him. The five friends then go into the woods to look for the keys, just as the first kills in the film are set to take place. The five watch as Billy shows up and kills two horny counselors. Billy appears to spot them, and everyone except Duncan runs. He realizes that since they're not part of the movie, Billy doesn't know what to do with them. Duncan thinks he's invincible, until Billy hurls his machete into Duncan's side, apparently killing him, and proving to the other four that they have no immunity.The film's badass final girl, Paula (Chloe Bridges), shows up to the camp. Since she is the one that kills Billy at the end of the film, the friends decide to stick with her, while also trying to stop anyone from having sex so that Billy won't show up. Billy is mentioned, and Nancy tells his urban legend, taking Max and her friends into a black-and-white flashback to 1957 when Billy was a camper. He was always made fun of for being different and ugly, so he hid in an outhouse to escape the bullying. One camper throws firecrackers into the outhouse, burning Billy's face and scarring him. After eight months in the burn ward, Billy went back to camp to exact his revenge. Now wearing a creepy mask and wielding his machete, he murdered eight counselors (one for each month of his time in the ward). As the friends watch Billy's murders, some blood sprays on Gertie's face. When they return from the flashback, the counselors see the blood on her face. Paula and Kurt panic, and Paula drives them both away in her car. Duncan emerges alive, but he gets hit by the car. Paula crashes into a totem pole, ejecting Kurt from the passengers seat and causing him to die with all his bones breaking. Paula meets her end when her car explodes.Max and her friends then reveal to the surviving counselors that they are all in a movie and that they need a new final girl to kill Billy. They even made Tina put on a life jacket with mittens (she is fated to die after doing a striptease). Since the final girl has to be a virgin, everyone thinks it should be Max. Max says Nancy should be the new final girl, but Vicki comments that she can't be because of who her character is (shy girl with a clipboard and guitar). Nancy runs away crying, so Max goes to console her. She wants to have Nancy survive so that they can make it out of the movie together and perhaps start a new life for Nancy/Amanda.The gang prepares for Billy's arrival that night. Vicki apologizes to Max and Gertie for her behavior, because she used to be good friends with Max before Amanda's death, and Max shut Vicki out and became friends with Gertie, making Vicki feel jealous and hurt. The girls forgive Vicki.The cabin has been booby-trapped in anticipation of Billy. Tina, who is hopped up on Vicki's adderall, does a crazy striptease and flashes her breasts, summoning Billy to the cabin. As he walks toward the cabin, Tina panics and runs away, tripping over a string and getting her head caught in a bear trap. Chris sets off another trap as Billy enters, wherein a log swings from the ceiling and knocks Billy into some antlers on the door to impale him. Thinking they've won, Gertie and Blake kiss. However, Billy is still alive and he kills Blake. The others run upstairs where Billy chases them. The heroes shoot flaming arrows at Billy's chest. He knocks a bookcase on top of Gertie and Vicki, and then impales Gertie with his machete. Max, Nancy, and Chris flee while Vicki takes Gertie's hand and drops a bucket of lighter fluid from the ceiling, causing an explosion. This doesn't kill Billy, and he bursts out the window on fire and in slow motion.The three run away (still in slo-mo) until Billy grabs Chris's leg and breaks the slo-mo. Chris gets stabbed while Billy kidnaps Nancy. Max brings Chris into an abandoned chapel and stays with him so he won't die alone, but Max assures him that he won't die. She runs to find Nancy in Billy's barn. Max fights Billy, but gets stabbed. Nancy gets Billy off Max and they run back to the chapel.Nancy realizes that since only the final girl can kill Billy, it has to be Max. Max breaks down in tears and tells Nancy who she is outside of the movie and how Max wished she could make her mom's dream of becoming a star come true. Nancy tells Max that she knows where to find her. Nancy walks out of the chapel and does a striptease to summon Billy. The killer emerges and impales Nancy with his machete. Max then walks out and dukes it out with Billy, eventually taking his machete and chopping his head off. Chris walks over to Nancy as the sun rises and the credits roll. They share a kiss. The film's rating stamp shows up before the reel starts to break off.Max wakes up in a hospital with Chris in the bed next to her. She hears voices and pulls back the curtain to find Duncan, Gertie, and Vicki, all alive. Max asks if it was a dream, but Duncan disproves that by showing off his machete wound. The friends look outside the room to find a doctor and nurse about to get intimate. Billy then bursts through the window, as the friends realize they are in the sequel. Max wastes no time in grabbing the nearest item and running to fight Billy again."
}