{
  "imdb_id": "tt2188965",
  "tmdb_id": "171046",
  "douban_id": null,
  "title": "Wolwedans in die Skemer (2012)",
  "genres": [
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "country": "South Africa",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm2321778",
      "name": "Jozua Malherbe"
    }
  ],
  "writer": [
    {
      "id": "nm4569950",
      "name": "Leon van Nierop",
      "description": "based on his radio serial"
    },
    {
      "id": "nm4569950",
      "name": "Leon van Nierop",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm1035706",
      "name": "Rolanda Marais",
      "character": "Sonja Daniel"
    },
    {
      "id": "nm4858982",
      "name": "David Louw",
      "character": "Ryno /              tour guide"
    },
    {
      "id": "nm0748911",
      "name": "Gérard Rudolf",
      "character": "Lt. Conrad /              investigator"
    },
    {
      "id": "nm4146913",
      "name": "Desiré Gardner",
      "character": "Adéle /              Diana and Jan's daughter"
    },
    {
      "id": "nm3067264",
      "name": "Lelia Etsebeth",
      "character": "Maggie /              Diana and Jan's daughter"
    },
    {
      "id": "nm4858879",
      "name": "Riana Wilkens",
      "character": "Diana /              Jan's wife"
    },
    {
      "id": "nm0740547",
      "name": "Andre Roothman",
      "character": "Jan /              Diana's husband"
    },
    {
      "id": "nm2745804",
      "name": "Karen Wessels",
      "character": "Sgt. Berta /              Conrad's assistant"
    },
    {
      "id": "nm4858824",
      "name": "Jacques Bessenger",
      "character": "Armand"
    },
    {
      "id": "nm0740415",
      "name": "Illse Roos",
      "character": "Arista Daniel"
    },
    {
      "id": "nm4444374",
      "name": "Mish'a el de Beer",
      "character": "Sonja /              Young"
    },
    {
      "id": "nm3997593",
      "name": "Justin Carlse",
      "character": "Ryno /              Young"
    },
    {
      "id": "nm5621089",
      "name": "Marielise van Rooyen",
      "character": "Petra"
    },
    {
      "id": "nm2653768",
      "name": "Quentin Krog",
      "character": "Barman"
    }
  ],
  "overview": "A young woman, Sonja Daneel, crashes her car near the spectacular Hotel Njala in Hazyview and loses her memory.  Upon her arrival at the hotel, she gets involved with an obsessed family whose lives are controlled by this spooky, eerie hotel. She also quickly discovers that family secrets and an obsession with the past haunt and control their every move.  Sonja soon falls in love with the enigmatic Ryno Lategan, a tour guide who befriends her and promises to help her regain her memory. But when a vicious axe murderer starts terrorising Sonja, she realizes that she has some strange connection to this hotel in her past and that this connection could cost her her life.  Things change when an eccentric investigator, Lieutenant Conrad Nolte and his assistant, Sergeant Berta van Schalkwyk, start investigating the murders at Hotel Njala and make some startling discoveries that even shock these two hardened investigators.",
  "storyline": "Shrouded in a veil of mystery, Sonja Daneel arrives at the luxurious Hotel Njala, which belongs to the Joubert family, to start as the establishment's new receptionist. However, following a freak car accident, Daleen can't remember who she is, where she comes from or why she chose to accept a position at this place. With the help of the cynical lieutenant Conrad Nolte, Sonja hesitantly sweeps aside the veil of her forgotten memories and begins to uncover disturbing details about Hotel Njala and the Jouberts. A series of murders shocks all involved with the Hotel to the core. Sonja Daneel realises - only by confronting her true identity can she save her life and put the ghost that has haunted her past to rest.",
  "plot": null,
  "synopsis": "Njala Hotel, built in 1981 on the farm Wolwedans (\"Wolf Dance\") near Hazyview in the scenic Lowveld area of South Africa, is owned by a family consisting of Jan Joubert (André Roothman), his wife Diana (Riana Wilkens) and his daughters, Adèle (Desiré Gardner) and the teenaged Maggie (Lelia Etsebeth). Jan withdrew from the running of the hotel about twelve years before the action starts, and now spends his afternoons in the surrounding forest without telling anyone what he is doing. Diana is still the nominal owner of the hotel, but Adèle is the manager. Adèle's bad people skills have led to a gradual loss of popularity of the hotel among tourists.Jan has nevertheless insisted that Sonja Daneel (Rolanda Marais) be appointed as receptionist, although Adèle was opposed to the idea. The action opens when Sonja is driving through the forest on her way to the hotel. Her mind is not on her driving. She is visibly distraught, tries to phone someone, has one eye on the map, and is sure she sees wolves in the woods. She fails to see in time that a large tree, chopped down by a red-cloaked axe-wielder, has fallen across the road. She overturns the car and just manages to crawl out before the leaking fuel catches fire.Concussed, she imagines that a whole pack of wolves is pursuing her and screams for help. She is found by Adèle and Maggie and taken back to the hotel. Fortunately the bulk of her luggage was sent on in advance, but while she lies sleeping, someone wearing a red cloak sneaks in and removes a packet of letters from it. When she wakes up, she cannot remember anything earlier than the wolf in the road, not even her name. Jan entertains her with eerie stories of wolves and their habits. Diana informs her that her name is Sonja Daneel and that she is the new receptionist. She takes up her new duties without having recovered any memories of her own past except that of a voice whispering \"The hotel will give us freedom again\".Sonja is interrogated by the chain-smoking, hardboiled Lt Conrad Nolte (Gérard Rudolf), who is in charge of a police investigation into a series of attacks on lodges in the vicinity. His junkfood-guzzling assistant Sgt Berta (Karen Wessels) has discovered that Sonja's mother was killed in a axe murder about a month previously. He suspects that she may be withholding something, and leaves his business card after failing to elicit any useful information from her.One of the tour guides attached to the hotel is Ryno Lategan (David Louw), who claims to have every personable girl in the vicinity \"on the menu\". This includes Adèle, who is almost engaged to but not really in love with Armand (Jacques Bessenger). At this stage Adèle is still holding out, but her resolve is weakening. Also wanting to be on the menu is Maggie, but Ryno treats her as a child. He wastes no time in chatting up Sonja, though, and starts calling her by the nickname \"Skivvy\", much to her distaste.One evening, after yet another family quarrel at lunchtime, the cloaked axe-wielder surprises Jan in his study and chops him down. Lt Nolte is soon on the scene. From Adèle, who seems eager to spill the beans, he elicits the information that the farm had been bought from Jan's first fianceé Arista by Diana's family, in order to build the hotel. After the property transfer he broke off the engagement and married Diana instead. He did not also transfer his affections from Arista to Diana, and he resented the hotel that was built on the farm, which was his real love.Sonja hopes that a visit to the accident scene will jog her memory, and is shown a shortcut through the woods by Armand. She notices an apparently abandoned log cabin and enters it, discovering that it is in good repair and was clearly regularly used by Jan. It is full of paintings of a woman uncannily resembling herself. Memories of her mother's murder flood back, and she flees the cabin in panic.Ryno takes Sonja on his Harley to revisit her previous house. He breaks a window and lets her in. On entering the bathroom, it seems to her to be covered again with the pool of blood that her mother lay in. In a flash she remembers that Skivvy is her childhood nickname, that she is actually Ryno's half-sister, and that shortly before the murder her mother, who turns out to have been Arista, hatched a plot whereby Ryno is to ensnare Adèle and bring his mother and sister to live on the farm. That was when Arista said \"The hotel will give us freedom again\". After the murder, she and Ryno decided to carry on with the scheme, modified to have her take the receptionist's job. When driving to the hotel, she was actually trying to phone Ryno to tell him she wants to opt out.In the meanwhile, the relationship between Adèle and Armand has soured to the point where she tells him that he can take lessons from Ryno in how to handle a woman. She has also discovered that Ryno has several bright ideas on how to restore the hotel to its previous glory and decides, as anticipated, that he is the ideal mate. She ditches Armand and announces her engagement to Ryno at a large and lavish party.This is the last straw for Sonja, who reproaches Ryno for having involved her emotionally. He insists that he never touched her in an erotic way, although the two of them had been very close before and sometimes bewailed the fact that fate made them siblings. She decides to leave the hotel, but before she can do so, the axe murderer strikes again. This time, Ryno himself is killed. Sonja has barely discovered his corpse when she realizes that the murderer is pursuing her also. She flees to the cabin in the woods, again imagining that wolves are hot on her track.Lt Nolte and Berta have not been idle. They, too, visited Arista's house, discovering the broken window and finding a cardboard box with the name of a removal firm on it. They rush to the firm's depot in order to examine Arista's household effects, among which they discover a family photograph of Arista with Ryno and Sonja. Appreciating its significance, they rush back to the hotel in Nolte's ancient Peugeot 404.The murderer tracks Sonja to the cabin and in the final showdown throws off the cloak. It is Maggie. Before striking the final blow, she reveals all. Maggie wanted to be the heir of the hotel with Ryno at her side, but he spurned her. Sonja is in fact not a half-sister of Ryno, but of Adèle and Maggie, since when Jan abandoned her, Arista was pregnant and hastily married Ryno's father. (Sonja's real surname must have been Lategan, Daneel being an assumed name to hide her identity from the Jouberts, but this is not actually stated). Sonja tells Maggie just to do it and finish her off. This unexpected passivity makes Maggie pause long enough to allow Adèle, who followed them to the cabin, to point an elephant gun at her. However, Lt Nolte has arrived on the scene and in turn has his service pistol aimed at Adèle. When Adèle and Lt Nolte lower their weapons, Maggie goes into action, but a shot even from a no-longer-aimed elephant gun proves fatal."
}