{
  "imdb_id": "tt2195652",
  "tmdb_id": "316163",
  "douban_id": null,
  "title": "Mop King (2013)",
  "genres": [
    "Comedy"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "89 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm3695953",
      "name": "Ace Dixon"
    }
  ],
  "writer": [
    {
      "id": "nm3695953",
      "name": "Ace Dixon",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm3901596",
      "name": "Bruce Novakowski",
      "character": "Jed Wilkins"
    },
    {
      "id": "nm5092266",
      "name": "Dayna Mahannah",
      "character": "Deborah Keats"
    },
    {
      "id": "nm5092011",
      "name": "Levi Hildebrand",
      "character": "Neil Wilcox"
    },
    {
      "id": "nm4472397",
      "name": "Adrian Drakes",
      "character": "Craig Dillard"
    },
    {
      "id": "nm3765494",
      "name": "Lisa Ovies",
      "character": "Marsha Booth"
    },
    {
      "id": "nm4036931",
      "name": "Brian Cook",
      "character": "Marcus Wilkins"
    },
    {
      "id": "nm3981381",
      "name": "Ken McNicol",
      "character": "Bert Wilkins"
    },
    {
      "id": "nm3289043",
      "name": "Deborah Finkel",
      "character": "Lonnie Wilkins"
    },
    {
      "id": "nm2875792",
      "name": "José Alfaro",
      "character": "Robert West       (as Jose Luis-Alfaro)"
    },
    {
      "id": "nm4466861",
      "name": "Dominika Zybko",
      "character": "Fish Creature Model"
    },
    {
      "id": "nm5092341",
      "name": "Sharlene Roth",
      "character": "Fisherwoman Model"
    },
    {
      "id": "nm5101969",
      "name": "Thomas Dixon",
      "character": "Angry Old Man"
    },
    {
      "id": "nm5101898",
      "name": "Peggy Giraud",
      "character": "Woman With Groceries"
    },
    {
      "id": "nm1240092",
      "name": "Bill Marles",
      "character": "Blind Man"
    },
    {
      "id": "nm5101994",
      "name": "Shawn Muffty",
      "character": "Glaring Driver"
    },
    {
      "id": "nm6333308",
      "name": "Ryan Younge",
      "character": "Referee"
    },
    {
      "id": "nm2784156",
      "name": "Jason Burkart",
      "character": "Dragomir"
    },
    {
      "id": "nm4617310",
      "name": "Cameron Crosby",
      "character": "Puking Security Guard"
    },
    {
      "id": "nm5092568",
      "name": "Nic Tagg",
      "character": "Romanian Coach       (as Nicolas Taggart)"
    },
    {
      "id": "nm5101992",
      "name": "Connor Polishak",
      "character": "#1 Romanian Fan"
    },
    {
      "id": "nm5101919",
      "name": "Devon Thor",
      "character": "Leering Girl"
    },
    {
      "id": "nm4495820",
      "name": "Kane Stewart",
      "character": "Sleeping Man"
    },
    {
      "id": "nm3463629",
      "name": "Rami Katz",
      "character": "Volleyball Player 1"
    },
    {
      "id": "nm3673692",
      "name": "Perry Miotto",
      "character": "Volleyball Player 2"
    },
    {
      "id": "nm6333309",
      "name": "Jairus Alexis-Payne",
      "character": "Volleyball Player 3"
    },
    {
      "id": "nm2017931",
      "name": "Juan Riedinger",
      "character": "Liam"
    },
    {
      "id": "nm1602196",
      "name": "Ian McAndrew",
      "character": "Tom Wurlington"
    },
    {
      "id": "nm4101003",
      "name": "Robyn Thomas",
      "character": "Tatiana Wurlington"
    },
    {
      "id": "nm3586646",
      "name": "Thomas Koch",
      "character": "German Cowboy"
    },
    {
      "id": "nm5101899",
      "name": "Megan McPhee",
      "character": "Yoga Girl"
    },
    {
      "id": "nm3701179",
      "name": "Sonia Suvagau",
      "character": "Stripper On Crutches"
    },
    {
      "id": "nm4761789",
      "name": "Gabrielle Giraud",
      "character": "Jill Pocker"
    },
    {
      "id": "nm5045196",
      "name": "Paula McGlynn",
      "character": "Army Recruitment Secretary"
    },
    {
      "id": "nm2203021",
      "name": "Victor Vidal",
      "character": "Smoking Soldier"
    },
    {
      "id": "nm3772131",
      "name": "Vladimir Fedulov",
      "character": "Man Pushed Aside"
    },
    {
      "id": "nm0004357",
      "name": "Michael Roberds",
      "character": "Pigeon Man"
    },
    {
      "id": "nm5093437",
      "name": "Silvaine Zimmermann",
      "character": "Jupiter Mole Lady       (as Silvaine Zimmerman)"
    },
    {
      "id": "nm5092127",
      "name": "Liezl Bezuidenhout",
      "character": "Shannon West"
    },
    {
      "id": "nm4671770",
      "name": "Dominic Chan",
      "character": "PishPish"
    }
  ],
  "overview": "Jed Wilkins is a free-lance maid and an embarrassment to his family. While his parents are on vacation, he runs into a drifter girl who changes the maid business forever.",
  "storyline": "Jed Wilkins is a free-lance maid and an embarrassment to his family. While his parents are on vacation, he runs into a drifter girl who changes the maid business forever.",
  "plot": "Raja Krishnamoorthy (Vikram) is the only son of Shanmugam (Nasser) and they both live in Hong Kong. One day while travelling, their car meets with an accident and both get admitted to the hospital. Dr. Cheenu (Santhana Bharathi) is their family doctor who diagnoses their blood and finds that Shanmugam is infected with multiple sclerosis, a disease for which therapy is only at primitive stage.\n\nDr. Cheenu, being a close friend of Shanmugam informs this to Raja alone. Shanmugam’s life is expected to last only for the next 60 days and Dr. Cheenu requests Raja to keep his father happy for the short period he is expected to be alive. Raja is shocked hearing this but makes up his mind and pretends to be casual. Raja does not inform about his father’s disease instead tries to keep him happy.\n\nNow Raja insists his father to get back to India to meet his family. A small flashback is shown where Shanmugam married a girl by his choice against his family’s wishes which made him leave the home along with his wife. Shanmugam relocated to Hong Kong and had set up a business there. Shanmugam’s wife died when Raja was born and it was only Shanmugam who had taken care of Raja after that.\n\nRaja knows that his father longs to meet his family again and so he decides to get the family united again to make his father’s last few days memorable. Raja convinces his father and both leave to India to meet their family members who all live together as a joint family. Everyone in the family is surprised seeing Shanmugam after so many years and they share some good old memories with him except Shanmugam’s father (Janaka Raj) who is still angry at him.\n\nRaja feels happy seeing his father having good time with his family while on the other side he feels sad that he will die soon. Raja is skilled in magical tricks and also in mimicry and he impresses everyone in the family with his skills. Tamil (Sneha) is the niece of Shanmugam. Tamil is responsible and loved by everyone in the family. She takes care of everyone in the family with love and affection. Raja decides to love Tamil after knowing that Shanmugam also likes her. Raja proposes his love to Tamil but she does not accept and instead says that she will marry only the guy as per their family’s wish. Raja creates a scene that Janaka Raj should talk with Shanmugam and if not Raja will commit suicide. Now Shanmugam also gets united with his father.\n\nMeanwhile, Raja keeps on frequent touch with Dr. Cheenu to keep him updated with Shanmugam’s condition. One day, Raja suddenly feels headache and he could not visualize any colour. Raja gets puzzled and takes some rest. At that time, Shanmugam’s mobile gets a call from Dr. Cheenu. Raja picks it up and modulates as Shanmugam. Dr. Cheenu enquires about the health of Raja believing the person at the other end to be Shanmugam. Now Raja understands that the disease is actually for him and not for his father.\n\nRaja continues speaking like his father to confirm the symptoms related to the disease such as colour blindness, headache etc. But he does not reveal this and tries to behave normally. Raja understands that his father has requested Dr. Cheenu to lie to Raja, so that Raja, in the process of making his father happy will eventually be happy himself.\n\nRaja feels sad knowing that he has only a few more days to live. Despite knowing the truth, he does not disclose this to his father and Dr. Cheenu and maintains the situation as before. One day, Dr. Cheenu calls Raja and informs about a research going on for multiple sclerosis in Europe and insists him to take Shanmugam there to get treated which might provide a chance for revival. Raja understands that the therapy is intended for him but pretends not knowing it.\n\nRaja again convinces his father to get back to Hong Kong saying some false reasons for which Shanmugam agrees. Everyone in the family does not want Shanmugam and Raja to leave and they insist them to stay with them. Raja says that there are some pending works and they need to get back immediately. On the day of leaving, Tamil proposes her love to Raja for which he does not reply.\n\nThe movie ends with an open climax where it is shown that Raja and Shanmugam leave for treatment.",
  "synopsis": null
}