{
  "imdb_id": "tt2106476",
  "tmdb_id": "103663",
  "douban_id": "6985810",
  "title": "The Hunt (2012)",
  "genres": [
    "Drama"
  ],
  "country": "Denmark",
  "version": [
    {
      "runtime": "115 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.3,
  "director": [
    {
      "id": "nm0899121",
      "name": "Thomas Vinterberg"
    }
  ],
  "writer": [
    {
      "id": "nm2105585",
      "name": "Tobias Lindholm",
      "description": "screenplay and"
    },
    {
      "id": "nm0899121",
      "name": "Thomas Vinterberg",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0586568",
      "name": "Mads Mikkelsen",
      "character": "Lucas"
    },
    {
      "id": "nm0488917",
      "name": "Thomas Bo Larsen",
      "character": "Theo"
    },
    {
      "id": "nm5038871",
      "name": "Annika Wedderkopp",
      "character": "Klara"
    },
    {
      "id": "nm5039026",
      "name": "Lasse Fogelstrøm",
      "character": "Marcus"
    },
    {
      "id": "nm0937622",
      "name": "Susse Wold",
      "character": "Grethe"
    },
    {
      "id": "nm0368482",
      "name": "Anne Louise Hassing",
      "character": "Agnes"
    },
    {
      "id": "nm1046521",
      "name": "Lars Ranthe",
      "character": "Bruun"
    },
    {
      "id": "nm0710658",
      "name": "Alexandra Rapaport",
      "character": "Nadja"
    },
    {
      "id": "nm3781410",
      "name": "Sebastian Bull Sarning",
      "character": "Torsten"
    },
    {
      "id": "nm5164600",
      "name": "Steen Ordell Guldbrand Jensen",
      "character": "Lars T"
    },
    {
      "id": "nm3352804",
      "name": "Daniel Engstrup",
      "character": "Johan"
    },
    {
      "id": "nm2344099",
      "name": "Troels Thorsen",
      "character": "Bent"
    },
    {
      "id": "nm5164640",
      "name": "Søren Rønholt",
      "character": "Big Carsten"
    },
    {
      "id": "nm3769297",
      "name": "Hana Shuan",
      "character": "Tiny"
    },
    {
      "id": "nm0476989",
      "name": "Jytte Kvinesdal",
      "character": "Inger"
    },
    {
      "id": "nm3199538",
      "name": "Josefine Gråbøl",
      "character": "Kindergarden Teacher"
    },
    {
      "id": "nm0377580",
      "name": "Bjarne Henriksen",
      "character": "Ole"
    },
    {
      "id": "nm1514468",
      "name": "Nicolai Dahl Hamilton",
      "character": "Owner of convenient store"
    },
    {
      "id": "nm1795793",
      "name": "Øyvind Hagen-Traberg",
      "character": "Butcher"
    },
    {
      "id": "nm5164598",
      "name": "Allan Wibor Christensen",
      "character": "Butcher's assistant       (as Allan Wibor 'Killer' Christensen)"
    },
    {
      "id": "nm5164507",
      "name": "Rikke Bergmann",
      "character": "Cashier at the convenient store"
    },
    {
      "id": "nm3527144",
      "name": "Rasmus Lind Rubin",
      "character": "Pede"
    },
    {
      "id": "nm2147450",
      "name": "Frank Rubæk",
      "character": "Elias"
    },
    {
      "id": "nm0406059",
      "name": "Jacob Højlev Jørgensen",
      "character": "Erik"
    },
    {
      "id": "nm5164520",
      "name": "Nina Christrup",
      "character": "Bruun's 1. sister"
    },
    {
      "id": "nm5164564",
      "name": "Birgit Petersen",
      "character": "Bruun's 2. sister"
    },
    {
      "id": "nm5164593",
      "name": "Karina Fogh Holmkjær",
      "character": "Ulla"
    },
    {
      "id": "nm5786880",
      "name": "Heidi Gross",
      "character": "Wife of Big Carsten"
    },
    {
      "id": "nm5786881",
      "name": "Marie Aktor",
      "character": "Wife of Tiny"
    },
    {
      "id": "nm4475506",
      "name": "Mona C. Soliman",
      "character": "Wife of Bent       (as Mona Soliman)"
    },
    {
      "id": "nm5786882",
      "name": "Mie Ravn Nielsen",
      "character": "Wife of Lars T"
    },
    {
      "id": "nm3543751",
      "name": "Kim Westi",
      "character": "Police officer 1"
    },
    {
      "id": "nm0712520",
      "name": "Thomas Ravn",
      "character": "Police officer 2"
    },
    {
      "id": "nm7239101",
      "name": "Rosa",
      "character": "Fanny the dog"
    },
    {
      "id": "nm0758894",
      "name": "Katrine Brygmann Salomon",
      "character": "Kirsten       (as Katrine Brygmann)"
    }
  ],
  "overview": "A teacher lives a lonely life, all the while struggling over his son’s custody. His life slowly gets better as he finds love and receives good news from his son, but his new luck is about to be brutally shattered by an innocent little lie.",
  "storyline": "Lucas is a Kindergarten teacher who takes great care of his students. Unfortunately for him, young Klara has a run-away imagination and concocts a lie about her teacher. Before Lucas is even able to understand the consequences, he has become the outcast of the town. The hunt is on to prove his innocence before it's taken from him for good.",
  "plot": "Lucas is a well-liked kindergarten teacher in a close-knit Danish community. Divorced, he struggles to maintain a relationship with his teenage son, who lives with his ex-wife, but the boy eventually decides to live with him. Lucas' coworker Nadja makes advances towards him and eventually becomes his girlfriend.\n\nOne of Lucas' students is Klara, the daughter of his best friend Theo. She has a crush on Lucas, and one day she puts a heart-shaped ornament into his coat pocket, then gives him a kiss on the lips. After Lucas rebuffs the kiss, Klara's feelings are hurt. Drawing on a memory of a pornographic picture her older brother showed her, she makes comments that lead the kindergarten director to believe Lucas indecently exposed himself to her. The director asks Klara leading questions, and the girl gives unclear testimony against Lucas. The adults in the community believe the director's story of abuse, dismissing Klara's later contradictions as denial.\n\nLucas is shunned by the community as a pedophile and sexual predator. His friendship with Theo and his relationship with Nadja are destroyed, and his son is publicly ostracised. The kindergarten staff ask leading questions of the other children, who also say they were abused. However, the children's accounts involve Lucas abusing them in his basement, which supports Lucas' innocence - his house has no basement. After a hearing, he is released without charge.\n\nThe community is still suspicious of Lucas, however, and the ostracism turns to violence. Someone kills his dog, Fanny, while another assailant throws a stone through his window. When he goes grocery shopping, the grocery store employees attack him. On Christmas Eve, Lucas confronts Theo during a public church service. Later, Theo overhears Klara apologizing to Lucas as she drifts off to sleep. He realizes that Lucas is innocent, and he visits him on Christmas Day with food and alcohol as a peace offering.\n\nA year later, tensions in the community have lessened. Lucas and Nadja are in a relationship again, and Lucas' son is accepted into the local hunting society as an adult. On a hunting expedition to commemorate the event, an unseen person apparently shoots at Lucas and misses him. Blinded by the setting sun, Lucas is unable to identify his attacker, who flees. A moment later the unknown shooter, real or metaphorical, is gone.",
  "synopsis": "Lucas (Mads Mikkelsen) is a member of a close-knit Danish community and works at a local kindergarten. Divorced, he struggles to maintain a relationship with his teenage son, Marcus (Lasse Fogelstrøm), who lives with his ex-wife, but enjoys wholesome interaction with the children at the kindergarten. His coworker Nadja (Alexandra Rapaport) makes advances towards him and eventually moves in as his girlfriend.One of the kindergarten pupils is Klara (Annika Wedderkopp), the daughter of Lucas' best friend Theo (Thomas Bo Larsen). Drawing on memory of a pornographic picture her brother showed her, she makes comments that lead the kindergarten director to believe Lucas indecently exposed himself to her. When interviewed with leading questions, Klara gives unclear testimony against Lucas. The adults in the community believe the director's story of abuse, dismissing Klara's later contradictions as denial.Lucas is shunned by the community as a pedophile sexual predator. His friendship with Theo is destroyed, the pressure causes him to break up with Nadja, and his son is publicly ostracised. The kindergarten staff ask leading questions of other children at the kindergarten, who also \"admit\" to being abused. However, the children's accounts mention details of Lucas's basement, which supports Lucas's innocence, as his house has no basement. After a hearing, he is released without charge.The community is still suspicious of Lucas, and the ostracism turns to violence. His dog, Fanny, is killed, a stone is thrown through his window, and he is beaten by grocery store employees when he tries to buy food. On Christmas Eve, Lucas confronts Theo during a church service. Later, Theo overhears Klara apologizing to Lucas as she drifts off to sleep. His doubts about Lucas' innocence are resolved, and he visits him on Christmas Day with food and alcohol as a peace offering.A year later, tensions in the community have lessened. Lucas and Nadja are in a relationship again, and Lucas' son is accepted into the local hunting society as an adult. On a hunting expedition to commemorate the event, an unseen person shoots at Lucas. Blinded by the setting sun, Lucas is unable to identify his attacker, who reloads but flees."
}