{
  "imdb_id": "tt2179211",
  "tmdb_id": "279677",
  "douban_id": null,
  "title": "Secret Sharer (2014)",
  "genres": [
    "Drama",
    "Romance",
    "Thriller"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "103 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm0297317",
      "name": "Peter Fudakowski"
    }
  ],
  "writer": [
    {
      "id": "nm0297317",
      "name": "Peter Fudakowski",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2713087",
      "name": "Jack Laskey",
      "character": "Konrad"
    },
    {
      "id": "nm4356709",
      "name": "Zhu Zhu",
      "character": "Li"
    },
    {
      "id": "nm0398740",
      "name": "Ching-Ting Hsia",
      "character": "Mong Lin"
    },
    {
      "id": "nm0197240",
      "name": "Leon Dai",
      "character": "Captain Wang"
    },
    {
      "id": "nm4934072",
      "name": "Si Qin Chao Ke Tu",
      "character": "Engineer"
    },
    {
      "id": "nm4936899",
      "name": "Sittinont Ananvorakhun",
      "character": "Assistant Cook"
    },
    {
      "id": "nm4934056",
      "name": "Zhongyou Guo",
      "character": "Cook"
    },
    {
      "id": "nm2014589",
      "name": "K.M. Lo",
      "character": "Chang"
    },
    {
      "id": "nm4936881",
      "name": "Aroon Wanasbodeewong",
      "character": "Steward"
    },
    {
      "id": "nm4936878",
      "name": "Ying Wang",
      "character": "Yang Shu's Girl"
    },
    {
      "id": "nm4934043",
      "name": "Bao Yin Ni Mu Hu",
      "character": "Yang Shu"
    },
    {
      "id": "nm5729589",
      "name": "Song Bin Zhu",
      "character": "The Boss"
    }
  ],
  "overview": "On a rusting cargo ship in the South China Sea, it's the young Polish captain's first command. His mutinous Chinese crew suspect him and his unscrupulous Boss of planning to scuttle the ship for an insurance scam. When the crew abandon ship, the young captain is left alone on board, helpless, anchored in a bay. That night while waiting anxiously on deck, he finds a naked body floating in the sea below, tangled up in the ship's rope ladder. Pulling the ladder, the captain discovers a Chinese woman in distress. She climbs on board, saying only \"Hide me\". Dawn comes a few hours later and so does a search party, looking for a murderer.....",
  "storyline": "On a rusting cargo ship in the South China Sea, it's the young Polish captain's first command. His mutinous Chinese crew suspect him and his unscrupulous Boss of planning to scuttle the ship for an insurance scam. When the crew abandon ship, the young captain is left alone on board, helpless, anchored in a bay. That night while waiting anxiously on deck, he finds a naked body floating in the sea below, tangled up in the ship's rope ladder. Pulling the ladder, the captain discovers a Chinese woman in distress. She climbs on board, saying only \"Hide me\". Dawn comes a few hours later and so does a search party, looking for a murderer..... (In English & Mandarin.) Inspired by Joseph Conrad's \"The Secret Sharer\"",
  "plot": "In the present day Gulf of Thailand, novice sea captain Konrad (Jack Laskey) tries to master a Chinese cargo ship and its resentful crew, who suspect he has orders from his boss to scuttle the vessel as part of an insurance scam.\n\nThe crew abandons ship, and later Konrad finds a naked body clinging to the ship’s rope ladder. Pulling on the ladder, he finds a young Chinese woman named Li (Zhu Zhu), exhausted from swimming across from the only other ship anchored in the bay. She whispers \"Hide me\", and he agrees to give her shelter.\n\nThe next morning a search party arrives from the other ship, along with Konrad’s crew, looking for a woman they claim to be a murderer.\n\nKonrad takes a risk and does not give Li up. Over the remainder of the journey, he shares his food, thoughts, clothes and cabin with his stowaway, keeping her presence on board the ship a secret from his crew, who would use any excuse to strip him of his captaincy. Konrad sets a course that avoids Chinese territorial waters and puzzles over how to help Li escape to freedom and start a new life.\n\nAs the journey progresses and romance grows within the captain’s cabin, Konrad begins to win the respect of his crew under Li’s guidance. Updated orders come from the ship’s owner instructing Konrad to scuttle the ship before an upcoming storm, and promising a large bonus for doing so. Konrad, however, begins to question his mission.",
  "synopsis": null
}