{
  "imdb_id": "tt2190451",
  "tmdb_id": "351067",
  "douban_id": null,
  "title": "Bachelor Games (2016)",
  "genres": [
    "Action",
    "Adventure",
    "Comedy",
    "Horror",
    "Thriller"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "86 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.7,
  "director": [
    {
      "id": "nm2793828",
      "name": "Edward McGown"
    }
  ],
  "writer": [
    {
      "id": "nm3728604",
      "name": "Chris Hill",
      "description": "writer"
    },
    {
      "id": "nm3544739",
      "name": "Sam Michell",
      "description": "writer"
    },
    {
      "id": "nm3544739",
      "name": "Sam Michell",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3404934",
      "name": "Charlie Bewley",
      "character": "Leon"
    },
    {
      "id": "nm1660027",
      "name": "Jack Doolan",
      "character": "Terence"
    },
    {
      "id": "nm2807846",
      "name": "Jack Gordon",
      "character": "Henry"
    },
    {
      "id": "nm2518190",
      "name": "Obi Abili",
      "character": "Max"
    },
    {
      "id": "nm4707183",
      "name": "Mike Noble",
      "character": "Roy"
    },
    {
      "id": "nm4407758",
      "name": "Daniel Elías",
      "character": ""
    }
  ],
  "overview": "A group of friends on a stag weekend in the mountains of Argentina are picked off by a dark force called \"The Hunter\", but all is not what it seems.",
  "storyline": "The best man usually has a few tricks up his sleeve for the bachelor party, but in Bachelor Games, the groom has a deadly one of his own. Henry is getting married. So he rallies together his best man Leon, and his buddies Terence and Roy to head deep into the mountains of Argentina for an epic bachelor party trip. At their hotel in a remote village, they are surprised when Max, one of Henry's oldest friends, shows up unexpectedly. The guys drink heavily and get down to the usual bachelor party business. Everyone seems to be having a good time, except for a few nasty outbursts from Max, who seems a bit unhinged. The next day, despite warnings from locals about a spirit protecting the mountain, the guys set off hiking. Shortly into the hike that nobody but Henry really wants to be on, tempers fray, old feuds re-emerge, and Terence storms off. When the guys find his bloody shirt, they fear the worst. What actually happens is more terrifying than anyone - even Henry -could have imagined.",
  "plot": "Henry (Gordon) is getting married and heads to Argentina with his best mates for an epic bachelor party trip. Henry and his best man, Leon (Bewley), and close friends Roy (Noble) and Terence (Doolan) arrive at a remote village in the foothills of the Andes and are surprised to find Henry's buddy Max (Abili) is already there. Amongst the drunken antics of the five boys something is wrong - Max seems unhinged and there warnings from the locals about a mysterious figure known as 'The Hunter'. The next morning they head out on a trek into the mountains that nobody really wants to go on. Tempers fray, old arguments reemerge and soon Terence storms off. The group soon find a bloody shirt but it is unclear what has happened. But not everything is as it seems and soon an elaborate scheme for revenge goes horribly awry.",
  "synopsis": null
}