{
  "imdb_id": "tt2132324",
  "tmdb_id": "110393",
  "douban_id": null,
  "title": "White Elephant (2012)",
  "genres": [
    "Drama"
  ],
  "country": "Argentina",
  "version": [
    {
      "runtime": "105 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm0871086",
      "name": "Pablo Trapero"
    }
  ],
  "writer": [
    {
      "id": "nm1375024",
      "name": "Alejandro Fadel",
      "description": null
    },
    {
      "id": "nm1375777",
      "name": "Martín Mauregui",
      "description": null
    },
    {
      "id": "nm1377207",
      "name": "Santiago Mitre",
      "description": null
    },
    {
      "id": "nm0871086",
      "name": "Pablo Trapero",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0201857",
      "name": "Ricardo Darín",
      "character": "Julián"
    },
    {
      "id": "nm0753737",
      "name": "Jérémie Renier",
      "character": "Nicolás       (as Jeremie Renier)"
    },
    {
      "id": "nm1089900",
      "name": "Martina Gusman",
      "character": "Luciana"
    },
    {
      "id": "nm5242886",
      "name": "Miguel Arancibia",
      "character": "Capataz"
    },
    {
      "id": "nm7617354",
      "name": "Diego Baretta",
      "character": "Franciscano"
    },
    {
      "id": "nm1705194",
      "name": "Federico Barga",
      "character": "Monito       (as Federico Benjamin Barga)"
    },
    {
      "id": "nm2599817",
      "name": "Esteban Díaz",
      "character": "Chato"
    },
    {
      "id": "nm1251441",
      "name": "Pablo Gatti",
      "character": "Sandoval"
    },
    {
      "id": "nm0415926",
      "name": "Walter Jakob",
      "character": "Cruz"
    },
    {
      "id": "nm1018525",
      "name": "Mauricio Minetti",
      "character": "Cruz       (as Mauricio Sergio Minetti)"
    },
    {
      "id": "nm2418930",
      "name": "Raul Ramos",
      "character": "Obispo"
    },
    {
      "id": "nm1253593",
      "name": "Susana Varela",
      "character": "Carmelita"
    },
    {
      "id": "nm2902336",
      "name": "Julio Zarza",
      "character": "Danilo"
    }
  ],
  "overview": "Gerónimo is a 45 year old man devastated by a tragic event. His friend Julian tries out afloat by encouraging him to participate in the project of a marginal town near Buenos Aires. Both are Catholic priests who decided to dedicate their life to the poorest: Geronimo in the Third World and Julian in Argentina. While working in Villa Virgen, Geronimo begins to wonder if the Church is the right institution to protect the weak. Julian, meanwhile, decides that the best way to change the lives of the needy people is politics. The counterpoint is Luciana, an atheist lawyer who has a different perspective on social reforms.",
  "storyline": "The \"Villa Virgin\", a shantytown in the slums of Buenos Aires. Julian and Nicolas, two priests and long-standing friends, work tirelessly to help the local people. Julian uses his political connections to oversee the construction of a hospital. Nicolas joins him following the failure of a project he was leading in the jungle, after paramilitary forces assassinated members of the community. Deeply troubled, he finds a little comfort in Luciana, a young, attractive, atheist social worker. As Nicolas' faith weakens, tension and violence between the slum drug dealing cartels grow. And when work on the hospital is halted by ministerial decree, the fuse is lit...",
  "plot": "Two priests, the old veteran Father Julián and his new younger Belgian colleague, Father Nicolás, and the social worker Luciana, work in a slum area of Buenos Aires, Argentina known as Ciudad Oculta. Together they fight to resolve the issues of the neighborhood’s society. Their work will have them face the clerical hierarchy, the organized crime and the repression, risking their lives defending their commitment and loyalty towards the people of the neighbourhood.\n\nThe film's title comes from the gigantic abandoned hospital that dominates the area, described by Peter Bradshaw in The Guardian as, \"a deserted wreck and cathedral of poverty known as the 'white elephant' where the homeless camp and drug-dealers ply their trade.\"",
  "synopsis": null
}