{
  "imdb_id": "tt2165765",
  "tmdb_id": "287524",
  "douban_id": null,
  "title": "Fear Clinic (2014)",
  "genres": [
    "Horror"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.2,
  "director": [
    {
      "id": "nm0356042",
      "name": "Robert Hall"
    }
  ],
  "writer": [
    {
      "id": "nm3499357",
      "name": "Aaron Drane",
      "description": "written by as Aaron R. Drane and"
    },
    {
      "id": "nm0356042",
      "name": "Robert Hall",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0000387",
      "name": "Robert Englund",
      "character": "Dr. Andover"
    },
    {
      "id": "nm1875040",
      "name": "Fiona Dourif",
      "character": "Sara"
    },
    {
      "id": "nm3037819",
      "name": "Felisha Terrell",
      "character": "Osborn"
    },
    {
      "id": "nm1671147",
      "name": "Cleopatra Coleman",
      "character": "Megan"
    },
    {
      "id": "nm0852173",
      "name": "Corey Taylor",
      "character": "Bauer"
    },
    {
      "id": "nm0066447",
      "name": "Brandon Beemer",
      "character": "Dylan"
    },
    {
      "id": "nm0604507",
      "name": "Bonnie Morgan",
      "character": "Paige"
    },
    {
      "id": "nm0300824",
      "name": "Kevin Gage",
      "character": "Gage"
    },
    {
      "id": "nm2942047",
      "name": "Angelina Armani",
      "character": "Caylee"
    },
    {
      "id": "nm0215281",
      "name": "Thomas Dekker",
      "character": "Blake"
    },
    {
      "id": "nm1151325",
      "name": "Nancy Telzerow",
      "character": "Mrs. Patton"
    },
    {
      "id": "nm5447120",
      "name": "Ryder Gage",
      "character": "Kevin"
    },
    {
      "id": "nm3239525",
      "name": "Cherie McClain",
      "character": "Reporter #1"
    },
    {
      "id": "nm7409666",
      "name": "Ashley Jean Ross",
      "character": "Reporter #2"
    },
    {
      "id": "nm7409667",
      "name": "Will Ujek",
      "character": "Reporter #3"
    },
    {
      "id": "nm6897237",
      "name": "Max Federman",
      "character": "Diner Customer #1"
    },
    {
      "id": "nm10746150",
      "name": "Carter Daniel",
      "character": "Guy at Diner       (as Extra)"
    },
    {
      "id": "nm4738404",
      "name": "Michael Leavy",
      "character": "Young Andover /              Black"
    }
  ],
  "overview": "A doctor works to cure patients suffering from crippling phobias by placing them inside his invention which induces and controls hallucinations.",
  "storyline": "Sara (Fiona Dourif) is one of five people that was attacked in a small diner by a masked shooter. Dr. Andover (Robert Englund), a brilliant scientist and doctor that developed a new way of treating fear-related ailments by way of his \"Fear Chamber\", initially seemed to be the perfect cure but one by one the patients have all returned to the clinic due to their fears re-emerging worse than they had before. Sara returns to the clinic as well.",
  "plot": "Sara (Fiona Dourif) is one of five people that developed PTSD after surviving a bloody shooting attack in a small diner by a masked shooter, which had the unfortunate side effect of either worsening pre-existing phobias or developing new ones. Like the others, she sought treatment from Dr. Andover (Robert Englund), a brilliant scientist and doctor that developed a new way of treating fear-related ailments by way of his \"Fear Chamber\". Initially the treatments seemed to be a success, but years later the patients have all returned to the clinic due to their fears re-emerging worse than they had before. After urging from her best friend Megan (Cleopatra Coleman), Sara returns to the clinic as well. Andover is reluctant to resume treatment because one of his previous patients, Paige (Bonnie Morgan), died as a result of her treatment in the Fear Chamber. He ends up giving in due to both the patients and his assistant Osborn (Felisha Terrell) insistence that this is the only way to solve their problems. However he finds that his reluctance may have been well-founded as one of the patients, Caylee (Angelina Armani), vomits a black substance that gives Andover a strange vision once he touches the fluid. The vision shows a monstrous version of Paige that states that Andover's treatments opened a passage for a sinister being to come over and that all that it needs to finish its travels is for Andover to resume treatment and \"open the door\". Realizing that this is not Paige but the creature itself, he is shocked back to consciousness.\n\nWhile settling in, a new patient by the name of Blake (Thomas Dekker) arrives in the clinic. His mother reveals that he was also one of the victims of the shooting, but that he had only recently began to develop severe night terrors that she believes are related to the attack. Blake is unable to communicate with others due to a head wound that left him wheelchair-bound and severely brain damaged. Andover begins treatment on Blake, which they discover has the unintended side effect of healing his brain damage and giving him the ability to speak once more. This, along with his earlier vision of Paige, makes Andover believe that something sinister is at work and that Blake's miraculous healing only occurred so he could once more feel fear, which the creature needs to exist. Megan, who had previously checked herself in the clinic before and has now done it again to be with Sara, has a small cyst on her back and has Osborn cut into it. Osborn sees that the same black fluid that Caylee vomited earlier is leaking from Megan's wound. Andover begins to suspect that Blake is hiding something, as Blake is reluctant to discuss some elements of the shooting during a therapy session. This proves to be the case after Blake discovers a mask identical to the one worn by the shooter. A series of flashbacks reveals that Blake was not a victim of the shooting but the perpetrator himself and that his head wound was a botched suicide attempt. Wandering through the building, Sara discovers Andover's records where he states that the creature is actually a manifestation of fear and that his Fear Chamber was effectively starving it of what it needed to survive: more fear.\n\nAndover is pulled into a strange cocoon-like structure on the wall, which enables the fear creature to take over his body. Meanwhile, Blake ended up succumbing to the influence of fear and becomes the shooter once more. He then proceeds to murder one of the clinic's employees while the fear creature incapacitates or kills several of the clinic's inhabitants through its influence. Sara encounters Blake, who chases her until she remembers a statement Andover made about Paige- that her time in the Fear Chamber incapacitated her but that she did not die until her eyes were closed. Sara realizes that although this killed Paige, it also deprived the fear creature of its food source. She manages to close Blake's eyes. She then does so to Caylee, Bauer (Corey Taylor) and Osborn, but the creature attacks her before she get to Megan. Dylan (Brandon Beemer) kills himself, depriving the creature. Sara saves Megan's life and closes her eyes, after which Andover is freed from the influence of the fear creature- only for him to say that this is not over and that the creature will only return and try to open the door once more. Sara replies that the only thing left is to \"change the locks\", and the film ends with Andover stepping into the Fear Chamber to receive treatment while Sara oversees the process, reversing their positions.",
  "synopsis": null
}