{
  "imdb_id": "tt2107648",
  "tmdb_id": "123359",
  "douban_id": null,
  "title": "Here Comes the Devil (2012)",
  "genres": [
    "Horror",
    "Thriller"
  ],
  "country": "Mexico",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm0305563",
      "name": "Adrián García Bogliano"
    }
  ],
  "writer": [
    {
      "id": "nm0305563",
      "name": "Adrián García Bogliano",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm2442431",
      "name": "Francisco Barreiro",
      "character": "Felix"
    },
    {
      "id": "nm1501565",
      "name": "Laura Caro",
      "character": "Sol"
    },
    {
      "id": "nm5242974",
      "name": "Alan Martinez",
      "character": "Adolfo"
    },
    {
      "id": "nm5243946",
      "name": "Michele Garcia",
      "character": "Sara"
    },
    {
      "id": "nm4985967",
      "name": "David Arturo Cabezud",
      "character": "Lucio"
    },
    {
      "id": "nm2775820",
      "name": "Enrique Saint-Martin",
      "character": "Encargado gasolinera"
    },
    {
      "id": "nm5243437",
      "name": "Michele Estrada",
      "character": "Doctora"
    },
    {
      "id": "nm5244252",
      "name": "Jessica Iris",
      "character": "Sandra"
    },
    {
      "id": "nm4985737",
      "name": "Dana Dorel",
      "character": "Abril"
    },
    {
      "id": "nm5243742",
      "name": "Juan Carlos Arreguin",
      "character": "Hombre"
    },
    {
      "id": "nm1802321",
      "name": "Giancarlo Ruiz",
      "character": "Sgt. Flores"
    },
    {
      "id": "nm5245721",
      "name": "Barbara Perrin Rivemar",
      "character": "Marcia"
    },
    {
      "id": "nm4091218",
      "name": "Paco Mufote",
      "character": "Psychiatrist"
    }
  ],
  "overview": "A married couple loses their children while on a family trip near some caves in Tijuana. The kids eventually reappear without explanation, but it becomes clear that they are not who they used to be, that something terrifying has changed them.",
  "storyline": "A married couple lose their children while on a family trip near some caves in Tijuana. The kids eventually reappear without explanation, but it becomes clear that they are not who they used to be, that something terrifying has changed them.",
  "plot": "A married couple (Barreiro and Caro) lose their two pre-teen children (Martinez and Garcia) during a family outing on the outskirts of Tijuana. After the loss on a nearby hill, luck and good fortune brings them back to their parents the next day, both parents trying to find out what happened during the disappearance. Following their return, changes occur in the behavior of the children that suggest ominous and unspeakable events that recall the night when the children were lost.\n\nThe couple hear of legends about unwary people and diabolical secrets of the caves in the area and have a friend investigate the caves. The children are distraught after his return and he is shaken. The mother ventures to the legends' cave and discovers her children's bodies, finally confirming the two imposters are dangerous and the friend saw the dead bodies. She poisons the pair and takes her husband to the cave where he confirms the bodies. He then shoots his wife and himself. Minutes later, imposter bodies drive away in the parents' car.",
  "synopsis": null
}