{
  "imdb_id": "tt2132405",
  "tmdb_id": "92499",
  "douban_id": null,
  "title": "Spellbound (2011)",
  "genres": [
    "Comedy",
    "Horror",
    "Romance"
  ],
  "country": "South Korea",
  "version": [
    {
      "runtime": "114 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.0,
  "director": [
    {
      "id": "nm1672163",
      "name": "In-ho Hwang"
    }
  ],
  "writer": [
    {
      "id": "nm1672163",
      "name": "In-ho Hwang",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1162030",
      "name": "Ye-jin Son",
      "character": "Kang Yeo-Ri"
    },
    {
      "id": "nm2523105",
      "name": "Min-ki Lee",
      "character": "Ma Jo-Goo"
    },
    {
      "id": "nm4806437",
      "name": "Seong-hoon Sin",
      "character": "Ambulance worker"
    },
    {
      "id": "nm2297861",
      "name": "Ji-min Yun",
      "character": ""
    },
    {
      "id": "nm3746857",
      "name": "Seung-eon Hwang",
      "character": ""
    },
    {
      "id": "nm1059148",
      "name": "Cheol-min Park",
      "character": "Pil-Dong"
    },
    {
      "id": "nm2613190",
      "name": "Hyun-sook Kim",
      "character": "Min-Jung"
    },
    {
      "id": "nm3011544",
      "name": "Mi-do Lee",
      "character": "Yoo-Jin"
    }
  ],
  "overview": "A magician meets a weird girl and offers her to work together in his magic show. It's only until a year later that he starts to know her personally and develops a feeling towards her despite her own problems.",
  "storyline": "Jo-Goo is a magician who is seeking new ways to improve his magic show. When he meets a weird girl in one of his shows, he finds a new idea and offers her to work together. It's only until a year later that he starts to know her personally and gets involved in her problem - ghosts problem. Soon he develops a feeling towards her and finds out that he doesn't care about her problems if only he could be with her.",
  "plot": "Jo-goo, a street magician (Lee Min-ki), notices a miserable looking girl, Yeo-ri (Son Ye-jin), in the audience during one of his performances, and she winds up being the inspiration for his “Horror magic show.” The show becomes a runaway success almost overnight and Jo-goo in turn, is now a successful stage magician with a model girlfriend. Yeo-ri works for Jo-goo, playing the specter in his show. Forward to almost a year later, the darkness inside her, something her colleagues sense, keeps her from truly connecting with them. When Jo-goo’s attempts to include Yeo-ri in a staff dinner finally succeeds, hilarious disaster ensues when she ends up blindingly drunk. Jo-goo calls Yeo-ri the next morning to sort things out, but when the phone disconnects with a weird sound, he decides to drop by her place for a visit instead. There, Jo-goo meets and engages in a game of hide-and-seek with a ghost child, which then scares the bejesus out of him later that night. As the two of them spend more time together, developing a fast friendship, Yeo-ri confesses the long story behind her gray, wan face.\n\nYeo-ri has acquired an 'unwanted' ability to see the dead ever since she survived a high school automobile accident. She not only sees dead people, but these 'dead people' also appear in her life on a regular basis. In particular, the vengeful ghost of her best friend Joo-hee, who died during that automobile incident, follows her everywhere scaring people around her relentlessly. Yeo-ri eventually ends up leading a solitary life, even her family has fled the country and left her behind. She sleeps in a tent in her living room, speaks to a friend sometimes and only through the phone, resigning herself to the idea that her solitary life is best in the grand scheme of things.\n\nDuring the course of Jo-goo’s failed attempts to find his lonely friend Yeo-ri a boyfriend, the pair start to develop feelings for each other. And though Jo-goo is sometimes scared witless himself, he loves Yeo-ri enough to overcome his fear. Joo-hee, consumed by jealousy, becomes a threat during the show, prompting Yeo-ri to head off to join her family in order to protect Jo-goo from herself and the ghost. Is getting away going to be that easy, or does Joo-hee have more tricks up her sleeves?",
  "synopsis": null
}