{
  "imdb_id": "tt2197242",
  "tmdb_id": "123479",
  "douban_id": null,
  "title": "Polski film (2012)",
  "genres": [
    "Comedy"
  ],
  "country": "Czech Republic",
  "version": [
    {
      "runtime": "113 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.3,
  "director": [
    {
      "id": "nm0619851",
      "name": "Marek Najbrt"
    }
  ],
  "writer": [
    {
      "id": "nm1430722",
      "name": "Robert Geisler",
      "description": "screenplay and"
    },
    {
      "id": "nm0875715",
      "name": "Benjamin Tucek",
      "description": "screenplay and"
    },
    {
      "id": "nm0619851",
      "name": "Marek Najbrt",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0514090",
      "name": "Pavel Liska",
      "character": "Pavel Liska"
    },
    {
      "id": "nm1224392",
      "name": "Tomás Matonoha",
      "character": "Tomás Matonoha"
    },
    {
      "id": "nm1225525",
      "name": "Josef Polásek",
      "character": "Josef Polásek"
    },
    {
      "id": "nm0199687",
      "name": "Marek Daniel",
      "character": "Marek Daniel /              Emil Havlát"
    },
    {
      "id": "nm1212577",
      "name": "Jan Budar",
      "character": "Jan Budar"
    },
    {
      "id": "nm2377879",
      "name": "Jana Plodková",
      "character": "Jana Plodáková"
    },
    {
      "id": "nm1671924",
      "name": "Katarzyna Zawadzka",
      "character": "Kasia"
    },
    {
      "id": "nm1220531",
      "name": "Krzysztof Czeczot",
      "character": "Glowacki"
    },
    {
      "id": "nm2751030",
      "name": "Marcin Kobierski",
      "character": "Grzywa"
    },
    {
      "id": "nm0070905",
      "name": "Lucie Benesová",
      "character": "Lucie Benesová"
    },
    {
      "id": "nm1569223",
      "name": "Kristýna Boková",
      "character": "Kristýna Liska Boková       (as Kristýna Liska Boková)"
    },
    {
      "id": "nm5588107",
      "name": "Ladislav Cumba",
      "character": "Muz v tramvaji"
    },
    {
      "id": "nm3371627",
      "name": "Vladislav Georgiev",
      "character": "Exekutor"
    },
    {
      "id": "nm3160590",
      "name": "Lukás Hejlík",
      "character": "nový manzel Lucie Benesové"
    },
    {
      "id": "nm5588104",
      "name": "Jan Herma",
      "character": "Vymahac"
    },
    {
      "id": "nm0389384",
      "name": "Martin Hofmann",
      "character": "Martin Hofmann"
    },
    {
      "id": "nm0405402",
      "name": "Krystof Hádek",
      "character": "Krystof Hádek"
    },
    {
      "id": "nm5588601",
      "name": "Janusz Kaczmarski",
      "character": "Vymahac"
    },
    {
      "id": "nm2846982",
      "name": "Marcin Kalisz",
      "character": "Recepcní"
    },
    {
      "id": "nm5588510",
      "name": "Benjamin Kristof",
      "character": "Poláskuv filmový syn"
    },
    {
      "id": "nm5588090",
      "name": "Sára Kristofová",
      "character": "Poláskova filmová dcera"
    },
    {
      "id": "nm4782154",
      "name": "Pawel Kumiega",
      "character": "Policista"
    },
    {
      "id": "nm3413986",
      "name": "Barbora Milotová",
      "character": "Poláskova filmová zena Marie"
    },
    {
      "id": "nm3407865",
      "name": "Lubor Novotný",
      "character": "Psychologoped"
    },
    {
      "id": "nm5588278",
      "name": "Marek Novotný",
      "character": "Fotograf"
    },
    {
      "id": "nm1416606",
      "name": "Martin Pechlát",
      "character": "Martin Pechlát"
    },
    {
      "id": "nm0670732",
      "name": "Simona Peková",
      "character": "moderátorka CRo"
    },
    {
      "id": "nm5588301",
      "name": "Mísa Polásková",
      "character": "Poláskova skutecná zena Mísa"
    },
    {
      "id": "nm5588021",
      "name": "Petr Prehnil",
      "character": "Farár"
    },
    {
      "id": "nm1186098",
      "name": "Krystof Rímský",
      "character": "Asistent rezie"
    },
    {
      "id": "nm1845994",
      "name": "Marek Sawicki",
      "character": "Policista"
    },
    {
      "id": "nm1965614",
      "name": "Roman Slovák",
      "character": "Koutný"
    },
    {
      "id": "nm0904555",
      "name": "Jirí Vyorálek",
      "character": "Záchranár"
    }
  ],
  "overview": "“The fact that I’m playing myself doesn’t mean that it’s me.” Four old schoolmates, today well-known Czech actors (Pavel Liška, Tomáš Matonoha, Josef Polášek and Marek Daniel), decide to make a movie together. Their ambitious colleague Jan Budař takes up directing duties and financing has arrived from Poland. What started out pleasantly enough, however, soon goes awry. Liška’s pronunciation difficulties, Daniel’s alter ego Havlát, and Matonoha’s financial machinations turn the shoot into a fight for survival. More than just a film about friendship and the absurdity of actors’ lives, director Marek Najbrt gives us a witty meditation on reality and illusion, and a unique take on the reality film genre. One of Pavel Liška’s on-set comments (“I didn’t know if I should act as if I were acting, or act as if I weren’t acting, or just not act at all”) illustrates the provocative nature of Najbrt’s subversive, quasi-documentary game.",
  "storyline": "Tomás Matonoha, Pavel Liska, Josef Polásek and Marek Daniel met during their studies at JAMU (Janacek's Academy of Performing Arts) and created a creative foursome bound together with close friendship. As time went by, it turned out that despite all four of them are rather successful, they are struggling for life and encountering existential problems and doubts. In their forties, they decide to \"travel back in time\" and shoot a film about their youth, vanished energy, lost illusions and long gone naivety. Unexpectedly, a story about friendship, crisis and absurdity in the life of an actor, balancing between reality and illusions, is created.",
  "plot": "After residents of an apartment building complain of a weird smell coming from one of the apartments, the brigade of firemen and police break down the door of the apartment in Paris to find the corpse of Anne (Emmanuelle Riva) lying on a bed, adorned with cut flowers.\n\nThe film goes back to several months before the opening scene, and Anne and her husband Georges (Jean-Louis Trintignant), both retired piano teachers in their eighties, attend a performance by one of Anne's former pupils, Alexandre. They return home to find that someone has unsuccessfully tried to break in to their apartment. The next morning while they are eating breakfast, Anne silently suffers a stroke. She sits in a catatonic state, not responding to Georges. She comes around as Georges is about to get help, but doesn't remember anything that took place. Georges thinks she was playing a prank on him. Anne is unable to pour herself a drink.\n\nAnne undergoes surgery on a blocked carotid artery, but the surgery goes wrong, leaving her paralyzed on her right side and confined to a wheelchair. She makes Georges promise not to send her back to the hospital or into a nursing home. Georges becomes Anne's dutiful, though slightly irritated, caretaker. One day, Anne tells Georges that she doesn't want to go on living.\n\nAlexandre, her former pupil whose performance they attended, stops by and Anne gets dressed up and carries on a lively conversation during the visit, giving Georges hope that her condition was temporary. However, she soon suffers a second stroke that leaves her demented and incapable of coherent speech. Georges continues to look after Anne, despite the strain it puts on him.\n\nGeorges begins employing a nurse three days a week. Their daughter, Eva (Isabelle Huppert), wants her mother to go into care, but Georges says he will not break the promise he made to his wife. He employs a second nurse, but fires her after he discovers she is mistreating his wife.\n\nOne day, Georges sits next to Anne's bedside and tells her a story of his childhood, which calms her. As he reaches the story's conclusion, he picks up a pillow and smothers her.\n\nGeorges returns home with bundles of flowers in his hands, which he proceeds to wash and cut. He picks out a dress from Anne's wardrobe and writes a long letter. He tapes the bedroom door shut and catches a pigeon which has flown in from the window. In the letter, Georges explains that he has released the pigeon. Georges imagines that Anne is washing dishes in the kitchen and, speechless, he gazes at her as she cleans up and prepares to leave the house. Anne calls for Georges to bring a coat, and he complies, following her out the door.\n\nThe film concludes with a continuation of the opening scene, with Eva seated in the living room, after she has wandered around the now-empty home.",
  "synopsis": null
}