{
  "imdb_id": "tt2193151",
  "tmdb_id": "125675",
  "douban_id": null,
  "title": "Mantera (2012)",
  "genres": [
    "Action",
    "Sci-Fi"
  ],
  "country": "Malaysia",
  "version": [
    {
      "runtime": "117 min",
      "description": "original"
    }
  ],
  "imdb_rating": 2.7,
  "director": [
    {
      "id": "nm4862933",
      "name": "Aliyar Ali Kutty"
    },
    {
      "id": "nm4863454",
      "name": "Miza Mohamad"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm4862954",
      "name": "Tomok Shah Indrawan",
      "character": "Azman"
    },
    {
      "id": "nm3164017",
      "name": "Kamaliya",
      "character": "Dr.Natasya Irina Pushkin"
    },
    {
      "id": "nm1669939",
      "name": "Mikhail Dorozhkin",
      "character": "Sam Weston"
    },
    {
      "id": "nm1463034",
      "name": "Said Dashuk-Nigmatulin",
      "character": "Ryan Matsumori"
    },
    {
      "id": "nm4862736",
      "name": "Wael Al-Masri",
      "character": "Kolonel Ayman"
    },
    {
      "id": "nm2940929",
      "name": "Taj Addin",
      "character": "Major"
    },
    {
      "id": "nm3933154",
      "name": "Elai Faezah",
      "character": "Lady X - Malaysia"
    },
    {
      "id": "nm4893348",
      "name": "Shikin Kamal",
      "character": "Deena"
    },
    {
      "id": "nm5372258",
      "name": "Shiqin Kamal",
      "character": ""
    },
    {
      "id": "nm0440879",
      "name": "Yusof B. Mohd Kassim",
      "character": "Chief Bodyguard       (as Yang Kassim)"
    },
    {
      "id": "nm4893617",
      "name": "Masab Korobov",
      "character": "Lead Agent"
    },
    {
      "id": "nm4894064",
      "name": "Salleh Mahfoz",
      "character": "Josh"
    },
    {
      "id": "nm4894525",
      "name": "Dasha Markova",
      "character": "Dasha"
    },
    {
      "id": "nm4894062",
      "name": "Sam Shariff",
      "character": "Sam Bully"
    },
    {
      "id": "nm1741007",
      "name": "Joe Thomas",
      "character": "Ryan Mori       (voice)"
    },
    {
      "id": "nm4894029",
      "name": "Jayson Lee Yit Zhing",
      "character": "Kevin"
    }
  ],
  "overview": "About a boy, Azman who stumbles upon a nano-tech glove which can transform his motorbike into body armor. The technology was designed by Dr.Natasya Irina Pushkin, a scientist at the Western Tech. Corporation. However, when she realizes that her creation will be used by a man with the power to destroy the world, she is determined to sabotage it.",
  "storyline": "Sam Weston, the owner of Weston Technologies is furious over the security breach in his Research Lab. The prototype of his latest weapon system \"Mantera\" or MAN - Transformable Exo-Robotic Armour was sabotaged and destroyed. Invaluable research data was stolen and deleted from the company's mainframe. His main scientist who is leading the research team, Dr. Natasya was missing. The buyer for the new technology is pressuring Sam to deliver the prototype or the deal is off. To make matter worse, the wreckage and debris from the destroyed \"Mantera\" was accidentally shipped to the other side of the world.... to a young man by the name of Azman, in Malaysia. Who is Azman, and what makes him the chosen one? Everything will be revealed in 'MANTERA'.",
  "plot": null,
  "synopsis": "....for countless generations, the Dark Legions of the Apocalypse, operating under the guise of large multinational corporations, have amassed their foot soldiers and underlings in secrecy. Scheming, planning and waiting for the arrival of their Dark Messiah to lead them on their resurgence to dominate mankind under their evil reign.We, the Alliance of Light have been given the sacred task to watch over them and to maintain hegemony over the Dark Legions. So far, we have been successful in neutralizing their influence and restraining their strength through our superior technology and know-how. As we enter the new millennium, a new threat has emerged in the form of a ground-breaking weapon system called Mantera that almost tilt the delicate balance of power.I am Col. Ayman of the Alliance of Light, and this is the story of a brave young man who saved Mantera from falling into the hands of the Dark Legions of the Apocalypse by becoming a Mantera...Moscow, Russia\nSam Weston, the owner of Weston Technologies is furious over the security breach in his Research Lab. The prototype of his latest weapon system Mantera or MAN - Transformable Exo-Robotic Armour was sabotaged and destroyed. Invaluable research data was stolen and deleted from the companys mainframe. His main scientist who is leading the research team, Dr. Natasya was missing. The buyer for the new technology is pressuring Sam to deliver the prototype or the deal is off. To make matter worse, the wreckage and debris from the destroyed Mantera was accidentally shipped to the other side of the world.... to a young man by the name of Azman, in Malaysia. Who is Azman, and what makes him the chosen one? Everything will be revealed in 'MANTERA'.MANTERA Official Blog"
}