{
  "imdb_id": "tt2178941",
  "tmdb_id": "88284",
  "douban_id": null,
  "title": "Barbara (2012)",
  "genres": [
    "Drama"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "105 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm0678857",
      "name": "Christian Petzold"
    }
  ],
  "writer": [
    {
      "id": "nm0678857",
      "name": "Christian Petzold",
      "description": "screenplay"
    },
    {
      "id": "nm0267943",
      "name": "Harun Farocki",
      "description": "collaborator on screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0396125",
      "name": "Nina Hoss",
      "character": "Barbara"
    },
    {
      "id": "nm1665537",
      "name": "Ronald Zehrfeld",
      "character": "André"
    },
    {
      "id": "nm0090674",
      "name": "Rainer Bock",
      "character": "Klaus Schütz"
    },
    {
      "id": "nm2322467",
      "name": "Christina Hecke",
      "character": "Assistenzärztin Schulze"
    },
    {
      "id": "nm0312036",
      "name": "Claudia Geisler-Bading",
      "character": "Stationsschwester Schlösser       (as Claudia Geisler)"
    },
    {
      "id": "nm3748603",
      "name": "Peter Weiss",
      "character": "Medizinstudent"
    },
    {
      "id": "nm4881530",
      "name": "Carolin Haupt",
      "character": "Medizinstudentin"
    },
    {
      "id": "nm4056141",
      "name": "Deniz Petzold",
      "character": "Angelo"
    },
    {
      "id": "nm1384908",
      "name": "Rosa Enskat",
      "character": "Hausmeisterin Bungert"
    },
    {
      "id": "nm3672175",
      "name": "Jasna Fritzi Bauer",
      "character": "Stella"
    },
    {
      "id": "nm0856274",
      "name": "Peer-Uwe Teska",
      "character": "Kellner im Ausflugslokal"
    },
    {
      "id": "nm4185641",
      "name": "Elisabeth Lehmann",
      "character": "Junge Kellnerin"
    },
    {
      "id": "nm2409219",
      "name": "Mark Waschke",
      "character": "Jörg"
    },
    {
      "id": "nm0070802",
      "name": "Peter Benedict",
      "character": "Gerhard"
    },
    {
      "id": "nm0627130",
      "name": "Thomas Neumann",
      "character": "Rentner am Auto"
    },
    {
      "id": "nm1333612",
      "name": "Anette Daugardt",
      "character": "Mitarbeiterin Schütz"
    },
    {
      "id": "nm0046157",
      "name": "Thomas Bading",
      "character": "Klavierstimmer"
    },
    {
      "id": "nm0097008",
      "name": "Susanne Bormann",
      "character": "Steffi"
    },
    {
      "id": "nm2583479",
      "name": "Jannik Schümann",
      "character": "Mario"
    },
    {
      "id": "nm2736690",
      "name": "Alicia von Rittberg",
      "character": "Angie"
    },
    {
      "id": "nm2860534",
      "name": "Barbara Petzold",
      "character": "Maria       (as Selin Barbara Petzold)"
    },
    {
      "id": "nm4881874",
      "name": "Jean Parschel",
      "character": "Mitarbeiter Schütz"
    },
    {
      "id": "nm0471797",
      "name": "Christoph Krix",
      "character": "Andrés Nachbar"
    },
    {
      "id": "nm0088744",
      "name": "Kirsten Block",
      "character": "Friedl Schütz"
    },
    {
      "id": "nm0727477",
      "name": "Irene Rindje",
      "character": "Friedls Schwester"
    }
  ],
  "overview": "Summer, 1980. Barbara, a doctor, has applied for an exit visa from the GDR (East Germany). Now, as punishment, she has been transferred from Berlin to a small hospital out in the country, far from everything. Jörg, her lover from the West, is already planning her escape.  Barbara waits, keeping to herself. The new apartment, the neighbors, summertime, the countryside – none of that means anything to her. Working as a pediatric surgeon under her new boss Andre, she is attentive when it comes to the patients, but quite distanced toward her colleagues. Her future, she feels, will begin later.  But Andre confuses her. His confidence in her professional abilities, his caring attitude, his smile. Why does he cover for her when she helps the young runaway Sarah? Does he have an assignment to keep track of her? Is he in love? But as the day of her planned escape quickly approaches, Barbara starts to lose control. Over herself, her plans, over love.",
  "storyline": "In 1980s East Germany, Barbara is a Berlin doctor banished to a country medical clinic for applying for an exit visa. Deeply unhappy with her reassignment and fearful of her co-workers as possible Stasi informants, Barbara stays aloof, especially from the good natured clinic head, Andre. Instead, Barbara snatches moments with her lover as she secretly prepares to defect one day. Despite her plans, Barbara learns more about her life that puts her desires and the people around her in a new light. With her changing perspective, Barbara finds herself facing a painful moral dilemma that forces her to choose what she values.",
  "plot": "East Germany in 1980: Barbara (Nina Hoss) is a physician who arrives for her first day at a small rural hospital near the Baltic Sea. She had been at the prestigious Charité hospital in East Berlin but, after she'd filed an \"Ausreiseantrag\" – an official request to leave East Germany – she had been incarcerated and transferred to the small town where she is still monitored by the Stasi. She is punished - for the hours in which they cannot find her - by searching her house, strip-searching and cavity-searching her.\n\nIn her new job, she works in pediatric surgery, a department led by chief physician André Reiser. Reiser eventually tells her a story (whose veracity she questions) of how he too had lost his job at a more prestigious hospital in Berlin – he was responsible for an accident with an incubator that left two premature infants blind. The Stasi had agreed to keep it quiet if he agreed to relocate to the provincial hospital and to work for them. So now Reiser reports on suspected people including Barbara.\n\nEarly on, when the police deliver Stella, a young runaway from a labour camp, to the hospital for the fourth time, Reiser thinks Stella is malingering. Barbara intervenes and orders removal of the restraints on the patient, readily diagnosing her with meningitis. During her recovery, Stella develops a strong attachment to Barbara, whose welcome bedside manner includes reading the Adventures of Huckleberry Finn to her. Stella is pregnant and wants to raise the child. Wanting to escape from the country and to have her child in a new land, she implores Barbara to take her with her. However, they cannot find grounds for keeping Stella longer and soon she is returned against her will to the labour camp.\n\nMeanwhile, Barbara makes secretive bicycle treks, to a place to stash her secretly received funds for escape, and to the woods where she meets with her West German lover Jörg, who has been supplying her with prized goods and is preparing for her escape. When she meets him for a second rendezvous in an \"Interhotel\" (an East-German hotel for foreigners), he tells her of his finalised plan for her escape the following weekend: she will be picked up in a small boat in the Baltic Sea and taken the short distance to Denmark.\n\nAs the two doctors spend more and more time together, Reiser begins making romantic overtures, which she rebuffs even while she is impressed by Reiser in turn. He has built a laboratory, to test samples on-site, and he has created his own serums with which to treat patients.\n\nOne day before her planned escape, Barbara is on duty caring for a critically ill patient named Mario, whose suicide attempt had landed him in the hospital. Barbara discovers that Mario has not been recovering from his traumatic head injury as well as believed and requires immediate brain surgery. She tracks Reiser down on his day off, to inform him of Mario's urgent need of surgery. She finds him at the home of the Stasi agent who has been overseeing her monitoring. Reiser is treating the agent's wife, who is dying of cancer. Reiser persuades her to return to the hospital – the same night of her planned escape – to perform the surgery, with her assistance as anaesthesiologist during the operation.\n\nFollowing her agreement to be there, yet still planning her escape, Barbara accepts Reiser's invitation to let him cook a lunch for her at his home on the same day. When Reiser finally tells Barbara that he is happy to have her there with him, she kisses him. Then she abruptly pulls away from him, and returns to her house to continue preparations for the escape.\n\nDuring this time, Stella flees the labour youth detention programme again and stumbles onto Barbara's doorstep the very night of Barbara's intended escape by sea. Barbara takes her to the agreed-upon area on the beach, where she is to meet a person who will help smuggle her out. Barbara writes a note to accompany Stella that is presumably addressed to Jörg, explaining why she has chosen to let Stella escape, instead of herself. After helping Stella to a waiting raft, and a skin diver who will help her escape by sea, she returns to the hospital. She takes a seat, across from André who is watching over Mario, at his bedside. The implication of this last scene is that she has decided to stay in the East, to be with Reiser. In a final close-up, their eyes meet in mutual understanding.",
  "synopsis": "Set in 1980, director Christian Petzold's latest work centres on a doctor (Nina Hoss) exiled to a small town from East Berlin as punishment for applying for an exit visa from the GDR (East Germany). Planning to flee for Denmark with her boyfriend, Barbara remains icy and withdrawn around her colleagues, particularly with the lead physician (Ronald Zehrfeld), who is hiding a secret of his own. With her patients, however, the guarded doctor is kind, warm, and protective, even risking her own safety for one of her charges. But as the day of her planned escape quickly approaches, Barbara starts to lose control, over herself, her plans and over love. Masterfully controlled and totally absorbing, this Cold War thriller expertly details the costs of telling and withholding the truth"
}