{
  "imdb_id": "tt2125425",
  "tmdb_id": "84195",
  "douban_id": null,
  "title": "Father's Chair (2012)",
  "genres": [
    "Drama",
    "Thriller"
  ],
  "country": "Brazil",
  "version": [
    {
      "runtime": "96 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.7,
  "director": [
    {
      "id": "nm0609931",
      "name": "Luciano Moura"
    }
  ],
  "writer": [
    {
      "id": "nm0609931",
      "name": "Luciano Moura",
      "description": null
    },
    {
      "id": "nm0811709",
      "name": "Elena Soarez",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0609944",
      "name": "Wagner Moura",
      "character": "Theo Gadelha"
    },
    {
      "id": "nm0239114",
      "name": "Lima Duarte",
      "character": "Theo's Father"
    },
    {
      "id": "nm0510678",
      "name": "Mariana Lima",
      "character": "Branca"
    },
    {
      "id": "nm4857595",
      "name": "Brás Antunes",
      "character": "Pedro"
    },
    {
      "id": "nm8064857",
      "name": "Lucas de Araujo",
      "character": "China - garoto carona"
    },
    {
      "id": "nm8578206",
      "name": "Gabriel Marin",
      "character": "Branco - Menino       (as Gabriel de Marin)"
    }
  ],
  "overview": "Theo is living the good life in an upscale Brazilian neighborhood. He’s a hardworking doctor, husband, and father. However, Theo has chosen his career over his family, and little by little he discovers that his world is crumbling around him. His beloved mentor and surrogate father is dying, and his wife announces that she wants a divorce. Yet nothing prepares him for the day when he comes home to discover that his 15-year-old son, Pedro, has disappeared. Theo takes to the road in search of his son. In a journey that leads him throughout Brazil, Theo discovers what really matters to him. Searching for his missing son, Theo finds himself.",
  "storyline": "A man who has put his career ahead of everything else in life learns the value of family when his son goes missing.",
  "plot": null,
  "synopsis": "On the weekend of his 15th birthday, Pedro takes a trip but doesnt come back. His father Doctor Theo Gadelha, 35 sets out to find him and bring him home. His sons sudden and unexplainable disappearance is the last card to fall as Theos castle in the air crumbles to the ground. His marriage of fifteen years with Branca, a doctor like himself has already taken its toll. Theo heads out in pursuit of his son, but winds up finding his own father, with whom he hasnt spoken in years. Face to face with him at last, he sees himself in his fathers eyes, rediscovers his son and reconciles with the woman he has never really stopped loving."
}