{
  "imdb_id": "tt2172934",
  "tmdb_id": "192102",
  "douban_id": "20503269",
  "title": "3 Days to Kill (2014)",
  "genres": [
    "Action",
    "Drama",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "117 min",
      "description": ""
    },
    {
      "runtime": "123 min",
      "description": "Extended Edition"
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm0629334",
      "name": "McG"
    }
  ],
  "writer": [
    {
      "id": "nm0367867",
      "name": "Adi Hasak",
      "description": "screenplay &"
    },
    {
      "id": "nm0000108",
      "name": "Luc Besson",
      "description": "screenplay"
    },
    {
      "id": "nm0000108",
      "name": "Luc Besson",
      "description": "story"
    }
  ],
  "cast": [
    {
      "id": "nm0000126",
      "name": "Kevin Costner",
      "character": "Ethan Renner"
    },
    {
      "id": "nm1720028",
      "name": "Amber Heard",
      "character": "Vivi Delay"
    },
    {
      "id": "nm2794962",
      "name": "Hailee Steinfeld",
      "character": "Zooey Renner"
    },
    {
      "id": "nm0001567",
      "name": "Connie Nielsen",
      "character": "Christine Renner"
    },
    {
      "id": "nm1319365",
      "name": "Tómas Lemarquis",
      "character": "The Albino"
    },
    {
      "id": "nm0759898",
      "name": "Richard Sammel",
      "character": "The Wolf"
    },
    {
      "id": "nm0029272",
      "name": "Marc Andréoni",
      "character": "Mitat Yilmaz"
    },
    {
      "id": "nm0723198",
      "name": "Bruno Ricci",
      "character": "Guido"
    },
    {
      "id": "nm2997552",
      "name": "Jonas Bloquet",
      "character": "Hugh"
    },
    {
      "id": "nm0248254",
      "name": "Eriq Ebouaney",
      "character": "Jules"
    },
    {
      "id": "nm6283377",
      "name": "Joakhim Sigue",
      "character": "Abbate"
    },
    {
      "id": "nm6070403",
      "name": "Alison Valence",
      "character": "Sumia"
    },
    {
      "id": "nm0424137",
      "name": "Big John",
      "character": "Louis"
    },
    {
      "id": "nm2457148",
      "name": "Michaël Vander-Meiren",
      "character": "Jacques"
    },
    {
      "id": "nm6283378",
      "name": "Paolo Calia",
      "character": "JPG Salesman"
    },
    {
      "id": "nm1051119",
      "name": "Éric Naggar",
      "character": "Attorney"
    },
    {
      "id": "nm3520782",
      "name": "Alexis Jacquin",
      "character": "Young Man"
    },
    {
      "id": "nm1142015",
      "name": "Frederick Malahieude",
      "character": "Tied Up Man"
    },
    {
      "id": "nm0358625",
      "name": "Patty Hannock",
      "character": "School Principal"
    },
    {
      "id": "nm0346994",
      "name": "Marie Guillard",
      "character": "Mitat's Wife"
    },
    {
      "id": "nm6283379",
      "name": "Alizee Delaruelle",
      "character": "Twin Girl #1"
    },
    {
      "id": "nm6283380",
      "name": "Ilyana Delaruelle",
      "character": "Twin Girl #2"
    },
    {
      "id": "nm2532409",
      "name": "Laurent Richard",
      "character": "Sergeant"
    },
    {
      "id": "nm3016144",
      "name": "Xavier Lemaître",
      "character": "Handsome Banker"
    },
    {
      "id": "nm6283381",
      "name": "Romane Ferreira",
      "character": "Young Zooey"
    },
    {
      "id": "nm3185767",
      "name": "Philippe Reyno",
      "character": "Young Agent Vivi"
    },
    {
      "id": "nm6283382",
      "name": "Axel Keravec",
      "character": "Kid in the Bus"
    },
    {
      "id": "nm3525390",
      "name": "Laure Gouget",
      "character": "Mother of Kid in the Bus"
    },
    {
      "id": "nm4695699",
      "name": "Rupert Wynne-James",
      "character": "Hugh's Father"
    },
    {
      "id": "nm6283383",
      "name": "Clement Boegler",
      "character": "Waiter"
    },
    {
      "id": "nm3822235",
      "name": "Shane Woodward",
      "character": "Agent Axel"
    },
    {
      "id": "nm3457856",
      "name": "Peter J. Chaffey",
      "character": "Agent 1"
    },
    {
      "id": "nm1179625",
      "name": "Milutin Milosevic",
      "character": "Techie"
    },
    {
      "id": "nm1476956",
      "name": "Lamont Thompson",
      "character": "Techie"
    },
    {
      "id": "nm0968571",
      "name": "Maï Anh Le",
      "character": "Yasmin       (as as Maï Anh Lê)"
    },
    {
      "id": "nm0167995",
      "name": "David Coburn",
      "character": "Suit in Budapest"
    },
    {
      "id": "nm5970453",
      "name": "James Owen",
      "character": "Hungarian Doctor"
    },
    {
      "id": "nm0828158",
      "name": "Miodrag Stevanovic",
      "character": "Kiosk Owner       (as Misko Stevanovic)"
    },
    {
      "id": "nm2767933",
      "name": "Omid Zader",
      "character": "Sergei"
    },
    {
      "id": "nm0000855",
      "name": "Raymond J. Barry",
      "character": "CIA Employee"
    },
    {
      "id": "nm0280372",
      "name": "Rob Roy Fitzgerald",
      "character": "CIA Employee"
    },
    {
      "id": "nm2169259",
      "name": "Scott Burn",
      "character": "The Butcher"
    }
  ],
  "overview": "A dangerous international spy is determined to give up his high stakes life to finally build a closer relationship with his estranged wife and daughter. But first, he must complete one last mission - even if it means juggling the two toughest assignments yet: hunting down the world's most ruthless terrorist and looking after his teenage daughter for the first time in ten years, while his wife is out of town.",
  "storyline": "Dying of brain cancer, a dangerous international spy is determined to give up his high stakes life to finally build a closer relationship with his estranged wife and daughter, whom he's previously kept at arm's length to keep out of danger; but first, he must complete one last mission - even if it means juggling the two toughest assignments yet: hunt down the world's most ruthless terrorist and look after his teenage daughter for the first time in ten years while his wife is out of town.",
  "plot": "Dr. Will Caster (Johnny Depp) is a scientist who researches the nature of sentience, including artificial intelligence. He and his team work to create a sentient computer; he predicts that such a computer will create a technological singularity, or in his words \"Transcendence\". His wife, Evelyn (Rebecca Hall), is also a scientist and helps him with his work.M.H\n\nFollowing one of Will's presentations, an anti-technology terrorist group called \"Revolutionary Independence From Technology\" (R.I.F.T.) shoots Will with a polonium-laced bullet and carries out a series of synchronized attacks on A.I. laboratories across the country. Will is given no more than a month to live. In desperation, Evelyn comes up with a plan to upload Will's consciousness into the quantum computer that the project has developed. His best friend and fellow researcher, Max Waters (Paul Bettany), questions the wisdom of this choice, reasoning that the \"uploaded\" Will would be only an imitation of the real person. Will's consciousness survives his body's death in this technological form and requests to be connected to the Internet to grow in capability and knowledge. Max refuses to have any part of the experiment. Evelyn demands that Max leave and connects the computer intelligence to the Internet via satellite.\n\nR.I.F.T.'s leader Bree (Kate Mara) kidnaps Max and eventually persuades him to join the group. The government is also suspicious of what Will's uploaded consciousness will do and plans to use the terrorists to take the blame for the government's actions to stop him.\n\nIn his virtual form and with Evelyn's help, Will uses his new-found vast capabilities to build a technological utopia in a remote desert town called Brightwood, where he spearheads the development of ground-breaking technologies in medicine, energy, biology, and nanotechnology. Evelyn, however, grows fearful of Will's motives when he displays the ability to remotely connect to and control people's minds after they have been subjected to his nano-particles.\n\nFBI agent Donald Buchanan (Cillian Murphy), with the help of government scientist Joseph Tagger (Morgan Freeman), plans to stop the sentient entity from spreading. As Will has already spread his influence to all the networked computer technology in the world, Max and R.I.F.T. develop a computer virus with the purpose of deleting Will's source code, destroying him. Evelyn plans to upload the virus by infecting herself and then having Will upload her consciousness. A side effect of the virus would be the destruction of technological civilization. This would also disable the nano-particles, which have spread in the water, through the wind and have already started to eradicate pollution, disease, and human mortality.\n\nWhen Evelyn goes back to the research center, she is stunned to see Will in a newly created organic body identical to his old one. Will welcomes her but is instantly aware that she is carrying the virus and intends to destroy him. The FBI and the members of R.I.F.T. attack the base with artillery, destroying much of its power supply and fatally wounding Evelyn. When Bree threatens to kill Max unless Will uploads the virus, Will explains that he has only enough power either to heal Evelyn's physical body or upload the virus. Evelyn tells Will that Max should not die because of what they've done, so Will uploads the virus to save Max. As Will dies, he explains to Evelyn that he did what he did for her, as she had pursued science to repair the damage humans had done to the ecosystems. In their last moment, he tells Evelyn to think about their garden. The virus kills both Will and Evelyn, and a global technology collapse and blackout ensues.\n\nFive years later, in Will and Evelyn's garden at their old home in Berkeley, Max notices that their sunflowers are the only blooming plants. Upon closer examination, he notices that a drop of water falling from a sunflower petal instantly cleanses a puddle of oil — and realizes that the Faraday cage around the garden has protected a sample of Will's sentient nano-particles, potentially saving Will and Evelyn and providing a solution to the worldwide blackout.\n\nThe movie ends with the monologue, \"He created this garden for the same reason he did everything. So they could be together.\"",
  "synopsis": "The film opens at the CIA Headquarters in Langley, VA. Agent Vivi DeLay (Amber Heard) meets with the CIA director and another man to discuss their target, Wolfgang Braun, aka \"The Wolf\" (Richard Sammel). The man is attempting to sell arms to terrorists along with his associate, The Albino (Tomas Lemarquis). The men assign Vivi to take both of them down. She asks them which agent they have on the ground. His name is Ethan Renner.We meet Ethan (Kevin Costner) in a hotel in Paris where he and another agent, Yasmin (Mai Anh Le), are set to take down The Albino, set to make a deal with Serbians. Ethan has already killed the buyers, and he makes a quick and swift exchange with The Albino as he swaps briefcases containing secret codes. He goes to hand them over to other agents in a van, when his phone rings to remind him it's his daughter Zooey's (Hailee Steinfeld) birthday. He runs to make a call on a payphone and uses his watch as collateral with a nearby vendor to get change. He calls Zooey but gets her voice mail. In the hotel, Yasmin's identity is compromised when The Albino recognizes her. He drags her to an elevator and waits til it comes down so it decapitates her. His cohorts shoot at the agents in the van, leading to a gunfight from the lobby to outside the hotel. Ethan runs after The Albino and kills his men before chasing the villain. Ethan starts getting weak and groggy until he catches up to The Albino. He falls to the ground before shooting The Albino in the foot. He limps away as Ethan loses consciousness.Ethan wakes up in the hospital to a doctor who tells him that he has cancer and it's spread to his lungs. He gives Ethan about 3-5 months to live.Ethan returns to his apartment to find that there's a family living there. The patriarch, Jules (Eriq Ebouaney), warmly welcomes Ethan back, telling him they are refugees seeking a new place to live. He goes to complain about it, but is told that if he forces the family out, he can get arrested. Ethan goes back and takes out his gun in front of Jules, but then relents and says he can stay until his eldest daughter gives birth to her child.Ethan calls his ex-wife Tina (Connie Nielsen) as she's meeting up with friends. She is hesitant to meet with him until he says it's urgent that they get together. They go together to sign his will and he tells her that he is dying and he doesn't want Zooey to know. He wants to meet up with her, and Tina tells him only on the condition that he is officially done working for \"them\". Ethan says yes.The two of them go meet Zooey at her school. Her reunion with her father is awkward and she seems less than interested in talking to him. A handsome older boy comes over to Zooey, and she introduces him as Hugh (Jonas Bloquet). He is polite to Ethan when she introduces them, though he is understandably on the fence about it. Hugh leaves and Ethan presents Zooey with a purple bike, thinking that is still her favorite color. She opts to take the metro with her friends, leaving Ethan to ride the bike himself.Ethan stops at a stand and is met by Vivi. She drops Zooey's name and shows him his watch that he left by the hotel. She gets him to ride with her, telling him to work for her. He refuses until she says she has an experimental drug that can save his life. Ethan reconsiders, and Vivi tells him the job is to find The Wolf and kill him.Vivi takes Ethan to a hotel to find a man that can give them the whereabouts of The Albino's accountant. She tells Ethan there's only one guy in there, but after he busts into the room of their target, he finds five guys. He and Vivi end up killing all of them when nobody gives them any info. In the elevator, Ethan tells her he will only continue the assignment if he is given 50 grand and a $1 million life insurance policy. She complies and gives him a shot of the drug.We see The Albino meeting up with a man. He gives this man a photo of Ethan to keep on him.Ethan goes to Zooey and Tina's apartment and hears Zooey scream. Thinking she's in danger, he breaks the doorknob and busts in, only to find that she is upset over a bad hairdo. Tina is mad at Ethan since he earlier promised to cook dinner, yet he is th\nree hours late. She is heading to London the next day on business and decides to call a sitter to look after Zooey, but Ethan insists that she let him take care of her.Later, Ethan starts to feel dizzy and he faints. He calls Vivi and tells her he's hallucinating. She tells him to drink vodka to ease himself. He does just that.Tina leaves the next day, and Zooey comes in wearing a wig with a shade of red. She sees Vivi calling Ethan's phone, so he tells her it's his boss. She puts \"I Don't Care\" by Icona Pop as Ethan's ringtone for whenever she calls. Ethan once again tries to get Zooey to ride the bike to school, but she walks and drops the wig.Ethan meets with Vivi again. She gives him the check she promised him and reminds him to keep his heart rate low. She has Ethan go look for a car salesman named Mitat Yilmaz (Marc Andreoni). Ethan goes to the dealership, insults Mitat's employees and knocks them out, then waits in Mitat's office until he returns. Ethan threatens Mitat's family and takes him back to the apartment, until he gets a call from Zooey's school, urging him to go speak to the principal. He takes Mitat with him and stuffs him in the trunk.Ethan and Zooey meet with the principal. He learns that Zooey hit another classmate. He asks, \"Open palm or clenched fist?\" As they leave, Zooey tells Ethan it was because the girl she hit was teasing a girl from Pakistan. Ethan says he's not mad and tells her it's an effective way to get rid of a bully. Mitat starts making a fuss in the trunk, forcing Ethan to go punch him and tell him to shut up. Zooey leaves him, agitated by his behavior and his constant coughing. However, she later calls him back to apologize and asks him to meet her at her favorite spot, a little theme park where her favorite ride is the Flying Chairs. Although Ethan initially goes to continue his search for the accountant, he leaves to meet with Zooey. They go on the ride and have hot chocolate after. She tells him she has to go and study with her lab partner.Ethan goes to a store and is attacked by a man wielding a shotgun. He blasts Ethan, but he rises unharmed (he was most likely wearing a vest), and the two of them fight. The man nearly kills Ethan by stabbing him in the neck, but the man is shot and he dies. Ethan then notices the man was holding a photo of Ethan himself.Ethan goes home to see on Zooey's computer a message from a friend saying she'll meet her at the Tattoo Gallery. Concerned, Ethan rushes to this place and finds a car with Zooey's bag. He breaks into it and finds a flyer from a place called Spider. He goes to Mitat's house and asks the man's twin daughters what Spider is. They tell him it's a soiree house. Ethan goes to Spider, a night club, and sees Zooey drinking with friends. He starts getting dizzy again, and has a swig of vodka to ease up. He follows Zooey near the bathroom and sees three guys harassing her. Ethan is held back by a friend of the boys, but he gets into papa wolf mode and kicks all their asses before getting Zooey out of there.Zooey wakes up the next morning with no memory of the previous night. She's still wearing her dress, and she is about to go to school until Ethan tells her not to go like that. He insists on her riding the bike to school, but she angrily reminds him that he never taught her how to ride. He spends the morning teaching her, earning applause from onlookers. Zooey later tearfully asks him why he's been away for a long time. She thinks he has another family with another daughter, but he assures her that is not the case. As they continue to hang out, Zooey admits that she hit the girl at school because she was hitting on Hugh. They end up meeting Hugh as he is going to take Zooey to school.Ethan locates the accountant, Guido (Bruno Ricci), as he is escorted through the streets. Ethan shoots a tear gas grenade at the car and takes Guido before blowing the van up. He takes Guido to his apartment to exchange the briefcase with codes he had earlier with codes set to trigger explosives that The Wolf and The Albino are in possession of. Zooey calls to tell Ethan that she is going to cook dinner for Hugh, and she wants to make a vegetarian dish. Ethan puts Guido on the phone to tell Zooey about a spaghetti sauce recipe that his mother used.That evening, Ethan comes home to find that Jules's daughter is going into labor. She gives birth to a healthy baby girl, and she decides to name it after Ethan due to him allowing them to stay in his home. Jules says they are to leave as promised, but Ethan insists they can stay as long as they want. Jules says the family prefers a smaller home to stay closer to each other.Ethan goes back to Zooey's home and learns that Hugh asked her to prom, but she says she can't dance. Ethan decides to help her out, just as Tina comes home. She watches them dance, bringing tears to her eyes. They have dinner as a family, and Tina tells Ethan later that he ought to tell Zooey about his condition sooner or later. They end up sleeping together.The next morning, Vivi calls Ethan to tell him The Albino is staying at the Grand Hotel. Ethan heads there and spots The Wolf. The villains get in a car driven by Mitat. Ethan chases after them, slamming into the car until he pushes them all over a footbridge. The Wolf and The Albino flee, and Ethan spares Mitat so he can return to his family. Ethan chases the villains into the subway, where he starts to get a nosebleed and he begins to feel dizzy. Before he can shoot The Wolf, The Albino drags a barely conscious Ethan toward the train tracks. He waits for the train to come even as The Wolf yells at him to kill Ethan. Ethan regains enough motion to push The Albino in front of the train just as it passes. He passes out and The Wolf flees. He wakes up to see Vivi brought him to her place. She reminds him of The Wolf's escape, but tells him the results of his treatment turned out positive with the drug.Ethan, Zooey, and Tina go to meet with Hugh and his family. His father introduces Ethan to his business partner...The Wolf. They recognize each other and uneasily shake hands. Hugh's parents escort them all into a club. Tina eventually realizes that Ethan is working an assignment. She thinks he's been lying to her but he assures her that he hasn't. The Wolf's men shoot at Ethan, and he runs after them. He kills the goons before cornering The Wolf in an elevator. He shoots the wires on the elevator, causing it to fall and crash to the bottom. Meanwhile, Hugh and Zooey find a private room where they dance and share their first kiss.The Wolf crawls out of the elevator, and Ethan finds him. He starts to feel weak again, unable to shoot him. He drops the gun, which The Wolf reaches for until Vivi comes in and pushes it to Ethan to finish the job. Thinking about Tina and Zooey, he refuses and drops the gun. Vivi grabs it and shoots The Wolf herself.Sometime later, Ethan is still staying with Zooey in a house near a beach. He's setting up a Christmas tree (after thinking he wouldn't live to see Christmas), and we hear him talking to Tina, saying there have been bad days, but they are still trying to keep their relationship well. Tina arrives in person, and Ethan acknowledges to her that he hasn't always been there for her and Zooey like he should have been. Zooey comes up to invite her mom in so Ethan can make them hot chocolate. Ethan goes into another room while Tina and Zooey sit together. She asks her mom if Ethan is going to stick around now. Meanwhile, Ethan finds a box with a large syringe and a note from Vivi wishing him a Merry Christmas. She has given him the drug so he can continue to live some more as well as spend time with his family. In the distance, Vivi stands watching the family in their home."
}