{
  "imdb_id": "tt2113822",
  "tmdb_id": "139329",
  "douban_id": null,
  "title": "Back to 1942 (2012)",
  "genres": [
    "Drama"
  ],
  "country": "China",
  "version": [
    {
      "runtime": "145 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.9,
  "director": [
    {
      "id": "nm0271815",
      "name": "Xiaogang Feng"
    }
  ],
  "writer": [
    {
      "id": "nm1532265",
      "name": "Zhenyun Liu",
      "description": "novel"
    },
    {
      "id": "nm1532265",
      "name": "Zhenyun Liu",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0955346",
      "name": "Guoli Zhang",
      "character": "Master Fan Dianyuan"
    },
    {
      "id": "nm1833620",
      "name": "Hanyu Zhang",
      "character": "Brother Sim"
    },
    {
      "id": "nm1981215",
      "name": "Wei Fan",
      "character": "Lao Ma"
    },
    {
      "id": "nm0271821",
      "name": "Yuanzheng Feng",
      "character": "Xia Lu"
    },
    {
      "id": "nm0944624",
      "name": "Fan Xu",
      "character": "Hua Zhi"
    },
    {
      "id": "nm0155203",
      "name": "Daoming Chen",
      "character": "Chiang Kai-shek"
    },
    {
      "id": "nm0508554",
      "name": "Xuejian Li",
      "character": "Li Peiji"
    },
    {
      "id": "nm6051127",
      "name": "Jingyi Yao",
      "character": "Lingdang"
    },
    {
      "id": "nm6051129",
      "name": "Jiale Peng",
      "character": "Liubao"
    },
    {
      "id": "nm7089029",
      "name": "Qian Li",
      "character": "Master Fan's Daughter-in-Law       (as Li Qian)"
    },
    {
      "id": "nm6051130",
      "name": "Huifang Yuan",
      "character": "Master Fan's Wife"
    },
    {
      "id": "nm3385826",
      "name": "Shaohua Zhang",
      "character": "Xia Lu's Mother"
    },
    {
      "id": "nm2422449",
      "name": "Ziwen Wang",
      "character": "Xing Xing"
    },
    {
      "id": "nm3677548",
      "name": "Mo Zhang",
      "character": "Shuan Zhu"
    },
    {
      "id": "nm0955513",
      "name": "Yi Zhao",
      "character": "Master Fan's Son"
    },
    {
      "id": "nm1982108",
      "name": "Shu Zhang",
      "character": "Dong Jiayao"
    },
    {
      "id": "nm4550206",
      "name": "Xiaojie Tian",
      "character": "Officer"
    },
    {
      "id": "nm0443750",
      "name": "Lan Ke",
      "character": "Soong May-ling"
    },
    {
      "id": "nm3590261",
      "name": "Guoqiang Zhang",
      "character": "Guo Jiquao"
    },
    {
      "id": "nm5480935",
      "name": "Zhen Yu",
      "character": "Jiang Dingwen"
    },
    {
      "id": "nm3756798",
      "name": "Morning Chang",
      "character": "Chang /              Tao-fan       (as Chenguang Zhang)"
    },
    {
      "id": "nm3599591",
      "name": "Yongjian Lin",
      "character": "County Magistrate"
    },
    {
      "id": "nm0000209",
      "name": "Tim Robbins",
      "character": "Bishop Megan"
    },
    {
      "id": "nm0004778",
      "name": "Adrien Brody",
      "character": "Theodore Harold White"
    },
    {
      "id": "nm1443336",
      "name": "Yihong Duan",
      "character": "Chen Bulei"
    },
    {
      "id": "nm6051128",
      "name": "Nathaniel Boyd",
      "character": "American Embassy Translator"
    },
    {
      "id": "nm3330312",
      "name": "Chun Du",
      "character": ""
    },
    {
      "id": "nm8276776",
      "name": "Xu Guangyu",
      "character": "Train station owner"
    },
    {
      "id": "nm3268484",
      "name": "Zhong Lü",
      "character": "Zhang Fang's mother"
    },
    {
      "id": "nm3371493",
      "name": "Zhenyu Qiao",
      "character": "Secretary Han"
    },
    {
      "id": "nm1451398",
      "name": "Alec Su",
      "character": "T. V. Soong (aka Soong Tse-ven)"
    },
    {
      "id": "nm5504518",
      "name": "Jiahui Yang",
      "character": "Orphan girl"
    }
  ],
  "overview": "In 1942, Henan Province was devastated by the most tragic famine in modern Chinese history, resulting in the deaths of at least three million men, women and children. Although the primary cause of the famine was a severe drought, it was exacerbated by locusts, windstorms, earthquakes, epidemic disease and the corruption of the ruling Kuomintang government.",
  "storyline": "A famine with multiple contributing factors and devastating effects during the Second Sino-Japanese war is chronicled from the official perspective of reporters, generals, politicians and real families whose lives were forever altered by drastic measures they were forced to take in order to survive. Alternately ignoring the dire nature of the famine and its subsequent exodus of millions of people from the Hunen province, and minimizing its devastation to the outside world, the Chinese Nationalist government of the time is one which seems to be over burdened by ongoing war efforts and corruption in the distribution of relief supplies. Policy and private life are worlds apart in stopping the devastation shown through the portrayals of those who lived to tell the tale and their accounts of those who were not so lucky, of whom there were many (3 million.) This is a true story based upon Liu Zhenyun's novel \"Remembering 1942,\" Zhenyun himself is the descendant of a survivor of the 1942 ...",
  "plot": "The film is set in Henan, China in the winter of 1942, during the Second Sino-Japanese War. Master Fan is a wealthy landlord in a village in Henan. When the village is suffering from famine, Fan still has plenty of food to feed his family and the villagers. A group of bandits come and rob the village, eventually burning it down to the ground. Fan's son dies in the process of stopping the bandits.\n\nFan flees his hometown with his daughter, wife and daughter-in-law. They are accompanied by a servant, Shuanzhu. While they are fleeing to the west, they meet Xialu, a fellow villager, and the latter's family. They decide to travel together, but Fan's food supply and money are stolen by NRA soldiers amidst the chaos caused by Japanese bombing.\n\nBrother Sim insists on preaching the Catholic faith in the starving province. After surviving a few Japanese bombings and witnessing many innocent people dying, he takes refuge under Father Megan but starts doubting the presence of God.\n\nMeanwhile, TIME correspondent Theodore H. White treks to Henan to investigate the famine. He discovers that while people are dying every day and some have even resorted to cannibalism, the Nationalist Government is still not doing anything to help the refugees. Chiang Kai-shek even wants to give up defending Henan, leaving the refugees to the Japanese. White's report is eventually published in the magazine, causing the Nationalist Government to make a U-turn on their policy. However, when relief supplies are being distributed in the province, the local officials and soldiers start fighting over who should receive a larger share.\n\nThe plight of Master Fan continues as his family members die one by one. He is eventually forced to sell his daughter into prostitution in return for food. Losing hope on life, he heads back to the east in the hope of dying somewhere near his home. On his way back, he meets a little girl who has just lost her mother. He adopts the girl as his granddaughter and they continue their journey.",
  "synopsis": null
}