{
  "imdb_id": "tt2106670",
  "tmdb_id": "103750",
  "douban_id": null,
  "title": "The Taste of Money (2012)",
  "genres": [
    "Drama",
    "Thriller"
  ],
  "country": "South Korea",
  "version": [
    {
      "runtime": "115 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm0407992",
      "name": "Sang-soo Im"
    }
  ],
  "writer": [
    {
      "id": "nm0407992",
      "name": "Sang-soo Im",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1279937",
      "name": "Kang-woo Kim",
      "character": "Joo Young-jak"
    },
    {
      "id": "nm1328575",
      "name": "Yun-shik Baek",
      "character": "Chairman Yoon"
    },
    {
      "id": "nm0950926",
      "name": "Yuh Jung Youn",
      "character": "Baek Geum-ok       (as Yeo-jeong Yoon)"
    },
    {
      "id": "nm1043651",
      "name": "Hyo-jin Kim",
      "character": "Yoon Na-mi"
    },
    {
      "id": "nm1087617",
      "name": "Maui Taylor",
      "character": "Eva"
    },
    {
      "id": "nm1759395",
      "name": "Joo-Wan On",
      "character": "Yoon Chul       (as Ju-wan On)"
    },
    {
      "id": "nm0477299",
      "name": "Byung-gil Kwun",
      "character": "President Roh"
    },
    {
      "id": "nm1405439",
      "name": "Jung-min Hwang",
      "character": "President Roh's Assistant"
    },
    {
      "id": "nm2231139",
      "name": "Darcy Paquet",
      "character": "Robert"
    },
    {
      "id": "nm1255246",
      "name": "Eung-soo Kim",
      "character": "Boss 1"
    },
    {
      "id": "nm3035447",
      "name": "Jin-yeong Park",
      "character": "Boss 2"
    },
    {
      "id": "nm1040397",
      "name": "Won-joong Jung",
      "character": "The Director of Public Prosecutions"
    },
    {
      "id": "nm1828177",
      "name": "Jae-goo Lee",
      "character": "Head of Abductors"
    }
  ],
  "overview": "In this suspenseful erotic drama, the private male secretary and lover of Madam Baek, a Korean conglomerate's middle-aged matriarch, falls for her more genuine daughter. Meanwhile, Madam Baek's husband has an affair with the Filipino nanny.",
  "storyline": "Newly-hired gofer Young-Jak Joo becomes a key pawn in a powerful South Korean corporate-crime family obsessed with sex, money, and intrigue. The family bribes a government official to take the heat off its young heir. The Yoons are so rich, they have no qualms letting the young bag-man cull the cash he's to deliver, from a storeroom jammed with 6 foot high stacks of money. Mr. Joo seems too obsequious and obedient to worry about, but when the wife of the company CEO sees on her spy cameras, that her husband is having an affair with their maid, the infuriated matriarch orders Mr. Joo to have sex with her, then entrusts the befuddled Mr. Joo with monitoring the video screens.",
  "plot": "In a luxurious house outside Seoul lives one of the country's richest families: company president Yoon, his wife Baek Geum-ok, their divorced daughter Nami, and son Chul. Yoon is company president but the reins of power are held by his wife Geum-ok, whose aged father was once a powerful businessman, and whom Yoon married for her money and influence. Yoon's private secretary is Joo Young-jak, from humble origins. His current job is making sure a U.S. businessman, Robert Altman, is kept happy with hookers, as part of a major business deal that could prove crucial to the family's fortunes. When Geum-ok sees Yoon having an affair with their Filipina maid, Eva, on her hidden CCTV, she beds Young-jak in revenge. When Chul is arrested for organizing a slush fund for Altman, Geum-ok decides to further punish her husband for his \"mistake\" in bringing the family's name into public disrepute, by having Eva killed. At the same time, Nami and Young-jak, start an affair. Yoon commits suicide over Eva's death (and takes the blame for his son's activities). After his funeral, Young-jak quits the family, glad to be rid of their influences. He accompanies Eva's coffin to the Philippines, where he is joined on the plane by Nami.",
  "synopsis": null
}