{
  "imdb_id": "tt2106533",
  "tmdb_id": "203778",
  "douban_id": null,
  "title": "Marafon (2013)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "Russia",
  "version": [
    {
      "runtime": "101 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm2420471",
      "name": "Karen Oganesyan"
    }
  ],
  "writer": [
    {
      "id": "nm1506266",
      "name": "Sergey Kaluzhanov",
      "description": null
    },
    {
      "id": "nm0652541",
      "name": "Gennadiy Ostrovskiy",
      "description": null
    },
    {
      "id": "nm2790035",
      "name": "Irina Pivovarova",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0943894",
      "name": "H.M. Wynant",
      "character": "David"
    },
    {
      "id": "nm2099738",
      "name": "Yuliya Peresild",
      "character": "Inna"
    },
    {
      "id": "nm5218822",
      "name": "Scott Engrotti",
      "character": "Runner"
    },
    {
      "id": "nm0707780",
      "name": "Michael Ralph",
      "character": "Passer"
    },
    {
      "id": "nm0586485",
      "name": "Anna Mikhalkova",
      "character": "Landlord Natalia"
    },
    {
      "id": "nm0691717",
      "name": "Mikhail Porechenkov",
      "character": "Tolik"
    },
    {
      "id": "nm0311059",
      "name": "Sergey Gazarov",
      "character": "Zhorek"
    },
    {
      "id": "nm0890610",
      "name": "Yekaterina Vasilyeva",
      "character": "Anna"
    },
    {
      "id": "nm1688754",
      "name": "Igor Savochkin",
      "character": "Vova"
    },
    {
      "id": "nm0901549",
      "name": "Olga Volkova",
      "character": "Valentina Ivanovna"
    },
    {
      "id": "nm0069783",
      "name": "Anatoliy Belyy",
      "character": "Stas"
    },
    {
      "id": "nm0036924",
      "name": "Mariya Aronova",
      "character": "Nurse"
    },
    {
      "id": "nm2024658",
      "name": "Chris Ranta",
      "character": "Reporter"
    },
    {
      "id": "nm2633465",
      "name": "Aleh Neliubin",
      "character": "News Crew Photographer"
    },
    {
      "id": "nm4575495",
      "name": "Dennis DeCamp",
      "character": "Race Registration Worker"
    },
    {
      "id": "nm0343045",
      "name": "Leonid Gromov",
      "character": "Pool director"
    },
    {
      "id": "nm2790035",
      "name": "Irina Pivovarova",
      "character": "Vova's wife"
    },
    {
      "id": "nm0570717",
      "name": "Ari McIntyre",
      "character": "Volunteer"
    },
    {
      "id": "nm4978983",
      "name": "Ruslan Kim",
      "character": "Firefighter"
    },
    {
      "id": "nm8600866",
      "name": "Anna Reshetneva",
      "character": "Teen"
    },
    {
      "id": "nm6982810",
      "name": "Alen Ershov",
      "character": "Young Tolik"
    },
    {
      "id": "nm8600870",
      "name": "Vartan Tovmasyan",
      "character": "Watchman"
    },
    {
      "id": "nm8600867",
      "name": "Lyudmila Kozino",
      "character": "Saleswoman"
    },
    {
      "id": "nm8601121",
      "name": "Vladimir Fonarev",
      "character": "Male nurse"
    },
    {
      "id": "nm3968215",
      "name": "Dmitriy Mezhevich",
      "character": "Murykin"
    },
    {
      "id": "nm4987972",
      "name": "Mark L. Colbenson",
      "character": "Runner"
    },
    {
      "id": "nm2618006",
      "name": "Olga Khokhlova",
      "character": "Galina Nikolaevna"
    },
    {
      "id": "nm8600864",
      "name": "Elizaveta Kruglik",
      "character": "Dasha"
    },
    {
      "id": "nm8600865",
      "name": "Angelina Goncharova",
      "character": "Travel agency employee"
    },
    {
      "id": "nm2971643",
      "name": "Paula Wynant",
      "character": "Nurse"
    },
    {
      "id": "nm8600868",
      "name": "Roman Usachev",
      "character": "Maloy"
    },
    {
      "id": "nm8600869",
      "name": "Viktor Saveliev",
      "character": "Guard"
    }
  ],
  "overview": "Tolik, a man disappointed in life, meets mysterious woman who proposes him to participate in the big marathon in the US.",
  "storyline": "Tolik didn't succeed in life, sports career did not work, his wife left him. Unsuccessful, unloved, hopeless, he has lost faith in himself. All changes when he encounter with a strange stranger Anna Ilinichna, who invites him to take part in an unusual marathon in faraway America.",
  "plot": "Childhood friends Reed Richards and Ben Grimm have worked together on a prototype teleporter since youth, eventually attracting the attention of Professor Franklin Storm, director of the Baxter Foundation, a government-sponsored research institute for young prodigies. Reed is recruited to join them and aid Storm's children, scientist Sue Storm and the somewhat reckless technician and her younger brother Johnny Storm, into completing a \"Quantum Gate\" designed by Storm's wayward protégé, Victor von Doom, who begrudgingly agrees to help due to his unrequited feelings for Sue.\n\nThe experiment is successful, and the facility's supervisor, Dr. Allen, plans to send a group from NASA to venture into a parallel dimension known as \"Planet Zero\". Disappointed at being denied the chance to join the expedition, Reed, Johnny, and Victor along with Ben use the Quantum Gate to embark on an unsanctioned voyage to Planet Zero, which they learn is a world filled with otherworldly substances. Victor attempts to touch the green-lava like substance, causing the surface they are on to collapse and the ground to erupt. Reed, Johnny, and Ben return to their shuttle just as Sue brings them back to Earth. Victor is seemingly killed after he falls into the collapsing landscape. The machine explodes, altering Reed, Sue, Johnny, and Ben on a molecular-genetic level, affording them superhuman abilities beyond their control: Reed can stretch like rubber, Susan can become invisible and generate force shields, Johnny can engulf his entire body in fire and fly, and Ben becomes bigger and develops a rock-like hide which gives him superhuman strength and durability. They are then placed in government custody and confinement to be studied and have their conditions and abilities tested. Blaming himself for the accident, Reed escapes from the facility and tries to find a cure for their changes.\n\nOne year later, Reed is now a fugitive and has built a suit that is able to adapt to his body's plasticity and help him control his ability. Hiding in Central America, he is eventually found by the United States military with Sue's help and captured by Ben, who has become a military asset along with Johnny and Sue. Johnny and Sue have been outfitted with specialized suits designed to help them stabilize and control their abilities. Reed is brought to Area 57, where Dr. Allen conscripts him to open another portal to Planet Zero in exchange for giving Reed the necessary resources to find a cure. Arriving in Planet Zero, Dr. Allen's explorers find Victor, who has been fused to his spacesuit and can now control the elements, as well as having telekinetic abilities, and bring him back to Earth. Believing the human race needs to be destroyed so he can rebuild Planet Zero in his image, Victor kills scientists and soldiers in the base including Dr. Allen and Professor Storm and returns to Planet Zero using the Quantum Gate, with Ben, Johnny, Reed, and Sue in pursuit.\n\nNow dubbing himself \"Doom\", Victor activates a portal on Planet Zero using the Quantum Gate II, and a structure consisting of the rock formations in Planet Zero he made while in the realm, that begins consuming the landscape of the Earth. He is confronted by the four and, after a short battle, Ben punches Doom into the portal's energy beam, disintegrating him while Johnny closes the portal. Returning to Earth, the group is rewarded for their heroics by being given a new base of operations by the US military known as \"Central City\" to study their abilities. They decide to use their powers to help people and adopt the mantle of the \"Fantastic Four\".",
  "synopsis": null
}