{
  "imdb_id": "tt2111254",
  "tmdb_id": "119142",
  "douban_id": null,
  "title": "A Way Out (2011)",
  "genres": [
    "Action",
    "Horror",
    "Sci-Fi"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "71 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm3806503",
      "name": "Nicholas Holland"
    }
  ],
  "writer": [
    {
      "id": "nm3806503",
      "name": "Nicholas Holland",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm4772523",
      "name": "Chelsea Rauss",
      "character": "Erin"
    },
    {
      "id": "nm3806503",
      "name": "Nicholas Holland",
      "character": "Ben"
    },
    {
      "id": "nm4771579",
      "name": "Colin Wilson",
      "character": "Davy"
    },
    {
      "id": "nm4772349",
      "name": "Devin Wilson",
      "character": "Brian"
    },
    {
      "id": "nm4771595",
      "name": "Jeremy Darby",
      "character": "Dan"
    },
    {
      "id": "nm4771474",
      "name": "Chris Friday",
      "character": "Tim"
    },
    {
      "id": "nm4772408",
      "name": "Tyler Priest",
      "character": "Adam"
    },
    {
      "id": "nm4771757",
      "name": "Robby Ritzenthaler",
      "character": "Drake"
    },
    {
      "id": "nm4772579",
      "name": "Andy Price",
      "character": "Military Radio Operator"
    },
    {
      "id": "nm4772419",
      "name": "Greg Wilson",
      "character": "Conspiracy Theorist"
    },
    {
      "id": "nm4772772",
      "name": "Shawn Benscoter",
      "character": "CDC Correspondent"
    },
    {
      "id": "nm5425593",
      "name": "Benjamin Ashley",
      "character": "Zombie"
    },
    {
      "id": "nm5720455",
      "name": "Cindy Przystep",
      "character": "Zombie"
    },
    {
      "id": "nm5418645",
      "name": "Nick Vernier",
      "character": "Zombie"
    }
  ],
  "overview": "The government has quarantined a small town where either a disease similar to rabies has appeared in the local human population or where (what seems impossible) the dead are beginning to come back to life and attack the living. Having missed most of the evacuation while barricaded inside of an old house, Ben, his younger sister Erin, and their friends remain trapped within the quarantine zone. Hell-bent on getting his sister to safety at all costs, Ben must lead the group across a ravaged city filled with flesh craving zombies in search of a working radio to contact the military and ensure them a ride on the last evacuation helicopter out of the quarantine zone. But with pre-existing personal tensions in the group and an entire city of zombies driven by hunger to find and kill anyone they come across, the odds are stacked against them.",
  "storyline": "The government has quarantined a small town where either a disease similar to rabies has appeared in the local human population or where (what seems impossible) the dead are beginning to come back to life and attack the living. Having missed most of the evacuation while barricaded inside of an old house, Ben, his younger sister Erin, and their friends remain trapped within the quarantine zone. Hell bent on getting his sister to safety at all costs, Ben must lead the group across a ravaged city filled with flesh craving zombies in search of a working radio to contact the military and ensure them a ride on the last evacuation helicopter out of the quarantine zone. But with pre-existing personal tensions in the group and an entire city of zombies driven by hunger to find and kill anyone they come across, the odds are stacked against them.",
  "plot": null,
  "synopsis": null
}