{
  "imdb_id": "tt2115325",
  "tmdb_id": "225405",
  "douban_id": null,
  "title": "Harrigan (2013)",
  "genres": [
    "Action",
    "Crime"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.9,
  "director": [
    {
      "id": "nm3807209",
      "name": "Vince Woods"
    }
  ],
  "writer": [
    {
      "id": "nm0571481",
      "name": "Arthur McKenzie",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0867017",
      "name": "Stephen Tompkinson",
      "character": "Harrigan"
    },
    {
      "id": "nm0443937",
      "name": "Gillian Kearney",
      "character": "Bridie Wheland"
    },
    {
      "id": "nm0289234",
      "name": "Ronnie Fox",
      "character": "Cole"
    },
    {
      "id": "nm0176660",
      "name": "Craig Conway",
      "character": "Dunstan"
    },
    {
      "id": "nm1123403",
      "name": "Mark Stobbart",
      "character": "Larson"
    },
    {
      "id": "nm0604418",
      "name": "Darren Morfitt",
      "character": "Swift"
    },
    {
      "id": "nm2240061",
      "name": "Amy Manson",
      "character": "Vickey Frizell"
    },
    {
      "id": "nm0747687",
      "name": "Maurice Roëves",
      "character": "Billy Davidson"
    },
    {
      "id": "nm0271499",
      "name": "Bill Fellows",
      "character": "Moss"
    },
    {
      "id": "nm1322496",
      "name": "Jamie Hayden",
      "character": "Lau       (as Jamie Cho)"
    },
    {
      "id": "nm1613839",
      "name": "Ian Whyte",
      "character": "Ronnie"
    },
    {
      "id": "nm0101202",
      "name": "John Bowler",
      "character": "Jenkins"
    },
    {
      "id": "nm2969142",
      "name": "Niek Versteeg",
      "character": "Garry Cole"
    },
    {
      "id": "nm4857941",
      "name": "Neil Armstrong",
      "character": "Frankie Phillipson"
    },
    {
      "id": "nm0254290",
      "name": "Mike Elliot",
      "character": "Alan Trimble       (as Mike Elliott)"
    },
    {
      "id": "nm4857907",
      "name": "Tom Booth",
      "character": "Bobby"
    },
    {
      "id": "nm0678924",
      "name": "Peter Peverley",
      "character": "Whopper"
    },
    {
      "id": "nm2094856",
      "name": "Sammy T. Dobson",
      "character": "Betsy Cole       (as Sammy T Dobson)"
    },
    {
      "id": "nm4668464",
      "name": "Sarah Martin",
      "character": "Sheila"
    },
    {
      "id": "nm1544272",
      "name": "Jane Holman",
      "character": "Mother in Law /              Band in Club"
    },
    {
      "id": "nm5370523",
      "name": "Kit Alexander",
      "character": "Kelly"
    },
    {
      "id": "nm0695970",
      "name": "Shaun Prendergast",
      "character": "Atkins"
    },
    {
      "id": "nm0385082",
      "name": "Steven Hillman",
      "character": "Stringer"
    },
    {
      "id": "nm0572189",
      "name": "Val McLane",
      "character": "Lily"
    },
    {
      "id": "nm3158600",
      "name": "Dan Styles",
      "character": "Scott"
    },
    {
      "id": "nm0564292",
      "name": "Donald McBride",
      "character": "Elderly Man"
    },
    {
      "id": "nm3879485",
      "name": "Darren Beaumont",
      "character": "Photographer"
    },
    {
      "id": "nm1475013",
      "name": "Nick Rowntree",
      "character": "Mr. Wheland"
    },
    {
      "id": "nm5119375",
      "name": "David Anthony Thomas",
      "character": "Alfie       (as David McNally)"
    },
    {
      "id": "nm3348953",
      "name": "Ellie Fletcher",
      "character": "Sandra"
    },
    {
      "id": "nm1528696",
      "name": "Vin Welch",
      "character": "Barman"
    },
    {
      "id": "nm6452244",
      "name": "John Sumner",
      "character": "Taxi Driver"
    },
    {
      "id": "nm1724384",
      "name": "Steve Wraith",
      "character": "Man"
    },
    {
      "id": "nm6874397",
      "name": "Mark Anthony Bolton",
      "character": "Man 2       (as Mark Bolton)"
    },
    {
      "id": "nm1269600",
      "name": "Joan Murphy",
      "character": "Lady in Street"
    },
    {
      "id": "nm5010503",
      "name": "Harrison Twentyman",
      "character": "Boy 1"
    },
    {
      "id": "nm6230023",
      "name": "Louis Atkinson",
      "character": "Boy 2"
    },
    {
      "id": "nm8055276",
      "name": "Lois Smith",
      "character": "Girl"
    },
    {
      "id": "nm1834047",
      "name": "Kate Sandison",
      "character": "Police Operator"
    }
  ],
  "overview": "Amongst the desperation and fear growing in a crime ridden estate in northern England, one man becomes embroiled into saving what community life exists.",
  "storyline": "Amongst the desperation and fear growing in a crime-ridden estate in northern England, one man becomes involved in. saving what little decency and community life exists. It's the winter of 1974: power cuts and coal strikes cripple the country, which is reduced to a three-day working week alongside police 'centralisation'. Everything, it seems, is falling apart -- along with the community's only hope and protector, the nearly retired Detective Sergeant Barry Harrigan.",
  "plot": null,
  "synopsis": "Detective Sergeant Barry Harrigan Leaves Hong Kong psychologically and physically battered. He is released from a two year secondment there having killed a triad leader, who is also a police inspector. The back story is, this triad gave the orders for Harrigan's home, in Newcastle, to be torched two years earlier - a fire that killed his eleven year old daughter. The reason being Harrigan had been getting too near to Triads in Newcastle operating a Bean Shoot war and protection racket. Harrigan's wife died some years earlier of cancer leaving him to look after his daughter and he is determined to root out all those involved in the fire.With only 6 months left before his retirement he bumps up against a fastidious and pedantic acting detective inspector, Larson and the job is changing. Larson wants Harrigan to see his time out without 'rocking the boat'. The miners' strike is crippling the country, reduced to a 3 day week, and sporadic power cuts have taken their toll on urban life. Harrigan soon gets sucked in and the murder of an old con and informant of his set his natural instincts away.As he investigates a simple burglary he unearths the crime riddled estate, which was his old beat when he started as a rooky officer. The section house was closed 18 months ago and Billy, his previous sergeant, now retired, gives Harrigan the clear message that the Monkshire Estate is under the boot of a local criminal team. Harrigan finds that Cole a vicious, ugly thug and his family are the poison creating the fear. Their enforcer is Arty Dunstan, one of those arrested for the fire at Harrigan's home, but found not guilty, and Harrigan is determined to nail him. Then a young child is killed by two youths on a motor cycle and the evidence leads back to the Coles.Billy then becomes involved and is later beaten to death by Cole. Harrigan persuades Supt. Atkins that he can open up the boarded up section station on the estate to make a difference, and Larson is ordered to give him staff. Harrigan gathers his motley crew, and immediately gets them to paint the police station black. Still boarded up and semi functional, electricity and water are still on, but no phones. He paints 'Police station open' in bright red letters beside the door.Harrigan and his crew move fast to find evidence of a link between the murder of his daughter and Billy and also the fatal accident of the child. He takes the fight to the enemy and events escalate when he arrests Cole, publicly dragging him to the station, triggering a riot where they attempt to torch the station.A wave of power cuts hits the city, tying up much of the force, added to which a devious Larson leaves Harrigan and his team alone to face the riot, out of communication as their radios are now useless. The street is ablaze, shops are ransacked and screams are heard through the night. Harrigan confronts Dunston alone in the street, as his team, some injured, deal with chaos in the police station. Curtains twitch as Harrigan comes face to face with the man responsible for his daughter's death and Dunstan thinks he has won."
}