{
  "imdb_id": "tt2199439",
  "tmdb_id": "268187",
  "douban_id": null,
  "title": "La distancia más larga (2013)",
  "genres": [
    "Drama"
  ],
  "country": "Venezuela",
  "version": [
    {
      "runtime": "113 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.7,
  "director": [
    {
      "id": "nm2323201",
      "name": "Claudia Pinto"
    }
  ],
  "writer": [
    {
      "id": "nm2323201",
      "name": "Claudia Pinto",
      "description": "as Claudia Pinto Emperador"
    },
    {
      "id": "nm2323201",
      "name": "Claudia Pinto",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0255979",
      "name": "Carme Elias",
      "character": "Martina"
    },
    {
      "id": "nm4869077",
      "name": "Omar Moya",
      "character": "Lucas"
    },
    {
      "id": "nm4104285",
      "name": "Alec Whaite",
      "character": "Kayemó"
    },
    {
      "id": "nm0848515",
      "name": "Iván Tamayo",
      "character": "Julio"
    },
    {
      "id": "nm1050436",
      "name": "Isabel Rocatti",
      "character": "Lola"
    },
    {
      "id": "nm4111032",
      "name": "Marcos Moreno",
      "character": "Nasak"
    },
    {
      "id": "nm1993135",
      "name": "Malena Gonzalez",
      "character": "Sara       (as Malena González)"
    },
    {
      "id": "nm0904666",
      "name": "Beatriz Vázquez",
      "character": "Teresa       (as Beatriz Vásquez)"
    },
    {
      "id": "nm1207954",
      "name": "José Roberto Díaz",
      "character": "Federico"
    },
    {
      "id": "nm0746667",
      "name": "Alberto Rowinsky",
      "character": "Tomás"
    },
    {
      "id": "nm6387122",
      "name": "Alejandro Bello",
      "character": "Thug       (voice)"
    },
    {
      "id": "nm3558527",
      "name": "Rafael Humberto Carrillo",
      "character": "Pordiosero       (as Rafael Carrillo)"
    },
    {
      "id": "nm7358350",
      "name": "Luis Silva",
      "character": "Malandro persecusión       (as Luis Alejandro Silva)"
    }
  ],
  "overview": "Two sides of the same country: a chaotic and violent city contrasting against a natural paradise where the oldest mountains on the planet can be found. Two main characters that find each other at a crucial moment. Two fearless journeys, one that begins as a childlike adventure and ends up on the other side of the country and a one-way journey, free and determined. The same destiny will inevitably bond a woman with her grandson. Without knowing it they are part of an unbreakable family circle that deeply unites them. Second opportunities will arise while individual freedom of choice will become imposing. Everything comes together to tell us: there is only one destiny, the one you choose for yourself.",
  "storyline": "Two sides of the same country: a chaotic and violent city contrasting against a natural paradise where the oldest mountains on the planet can be found. Two main characters that find each other at a crucial moment. Two fearless journeys, one that begins as a childlike adventure and ends up on the other side of the country and a one-way journey, free and determined. The same destiny will inevitably bond a woman with her grandson. Without knowing it they are part of an unbreakable family circle that deeply unites them. Second opportunities will arise while individual freedom of choice will become imposing. Everything comes together to tell us: there is only one destiny, the one you choose for yourself.",
  "plot": null,
  "synopsis": "Two sides of the same country: a chaotic and violent city contrasting against a natural paradise where the oldest mountains on the planet can be found. Two main characters that find each other at a crucial moment. Two fearless journeys, one that begins as a childlike adventure and ends up on the other side of the country and a one-way journey, free and determined. The same destiny will inevitably bond a woman with her grandson. Without knowing it they are part of an unbreakable family circle that deeply unites them. Second opportunities will arise while individual freedom of choice will become imposing. Everything comes together to tell us: there is only one destiny, the one you choose for yourself.Distance speaks to us point blank and very bluntly about life and death. It is not by chance that the story is built around two deaths, very different in their nature: on one hand we experience a violent and sudden death and on the other, a chosen path to the afterlife. And in between, there we are, witnesses of this journey involving characters who struggle to live and to choose their own destiny.The film argues whether we have or not the right to choose, if in our hands, how and where we would like to live and to die. This proposal is done without assuming there is a right answer or focusing on just one particular point of view. On the contrary, it allows us to be part of this journey of others and it offers a kaleidoscopic outlook of a theme that involves us all.The Longest Distance takes us from the suffocating Caracas to the plenitude that we find on top of one of the oldest geological formations on our planet, the Roraima, south of the Amazon. The speech relies in the magnificence and eloquence of the landscapes that transmit the inner journey of every character, allowing them to leave behind feelings of guilt and regret in order to learn how to communicate with each other. It is only by shortening all the distances between them that they will be able to give a new direction to their lives; thus becoming this journey, the real story we have decided to tell.In short, The Longest Distance talks about the freedom of choice we have when defining our lives, how strong family ties can be and how second opportunities are all around us. It is an ode to freedom which reminds us that is never to late to take the reins of life.\n__________________________________________________________________________Dos caras de un mismo país, una ciudad agresiva y caótica, y un paraíso con las montañas más antigua del planeta. Dos protagonistas en momentos vitales opuestos. Y dos viajes temerarios, una aventura infantil que cruza un país entero, y un viaje sin retorno, pero libre y decidido. El destino vincula irremediablemente a una abuela y su nieto. Aunque no se conocen forman parte de un círculo que no pueden romper. Las segundas oportunidades aparecen, pero la libertad individual se impone. Todo se conjura para decirnos: sólo hay un destino, el que tú eliges.La distancia más larga nos habla de frente, y sin rodeos, de la vida y de la muerte. No es casualidad que la historia se enmarque entre dos muertes de naturaleza tan diferente: por un lado, una violenta y repentina; y por otro, una muerte elegida. Y lo hace precisamente, para hablarnos de la vida, del viaje que emprendemos los que seguimos aquí, los que aún podemos elegir nuestro destino.La distancia más larga es una historia de comienzos y finales, un cúmulo de encuentros y desencuentros que nos llevan desde la convulsa Caracas hasta la cima del Roraima, una de las formaciones geológicas más antiguas del planeta. La película nos lleva de viaje por las carreteras de Venezuela hasta adentrarnos en paisajes milenarios, mientras nos va narrando el viaje interior y de crecimiento de unos personajes que creen que huyen, pero que en realidad se están buscando. Solo acortando todas las distancias podrán respirar y reconducir sus vidas, y este es el verdadero viaje que nos interesa narrar.En definitiva, La distancia más larga nos habla de la libertad que tenemos de elegir nuestro destino, de la fuerza de los lazos familiares, y de las segundas oportunidades. Es un canto a la libertad que nos recuerda que nunca es tarde para tomar las riendas de la vida."
}