{
  "imdb_id": "tt2124959",
  "tmdb_id": "241207",
  "douban_id": null,
  "title": "Altered Minds (2013)",
  "genres": [
    "Drama",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "106 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm0917057",
      "name": "Michael Z. Wechsler"
    }
  ],
  "writer": [
    {
      "id": "nm0917057",
      "name": "Michael Z. Wechsler",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0002139",
      "name": "Judd Hirsch",
      "character": "Dr. Nathaniel Shellner"
    },
    {
      "id": "nm1645352",
      "name": "Ryan O'Nan",
      "character": "Tommy Shellner"
    },
    {
      "id": "nm0496934",
      "name": "C.S. Lee",
      "character": "Harry"
    },
    {
      "id": "nm0628120",
      "name": "Jaime Ray Newman",
      "character": "Julie"
    },
    {
      "id": "nm0481222",
      "name": "Caroline Lagerfelt",
      "character": "Lillian"
    },
    {
      "id": "nm0852668",
      "name": "Joseph Lyle Taylor",
      "character": "Leonard Shellner"
    },
    {
      "id": "nm3629927",
      "name": "Jake Miller",
      "character": "Sasha"
    },
    {
      "id": "nm1425780",
      "name": "Lily Pilblad",
      "character": "Sylvia"
    },
    {
      "id": "nm1769761",
      "name": "Dennis Flanagan",
      "character": "Sergeant Joseph Robbins"
    },
    {
      "id": "nm4129698",
      "name": "Hayden Signoretti",
      "character": "Young Tommy"
    },
    {
      "id": "nm3389267",
      "name": "Isaac Jin Solstein",
      "character": "Young Harry Shellner"
    },
    {
      "id": "nm0159629",
      "name": "Marilyn Chris",
      "character": "Elizabeth Robbins"
    },
    {
      "id": "nm4810793",
      "name": "Dana Konner",
      "character": "Young Julie Shellner"
    },
    {
      "id": "nm4808045",
      "name": "John Havel",
      "character": "Young Harry"
    },
    {
      "id": "nm4814753",
      "name": "Ish Singh",
      "character": "Child #2 Playing"
    },
    {
      "id": "nm4811298",
      "name": "Ishi Singh",
      "character": "Child in Pictures"
    },
    {
      "id": "nm1325201",
      "name": "Emma Chelsey",
      "character": "Child in Pictures       (as Emma Barnes)"
    },
    {
      "id": "nm3338860",
      "name": "Darly Wanatick",
      "character": "Samantha /              the neighbor"
    },
    {
      "id": "nm5907245",
      "name": "Justice Samuel Korn",
      "character": "Young Nathaniel Shellner"
    }
  ],
  "overview": "A family reunion goes awry when the oldest son makes the accusation that his dying father, a famed psychiatrist who also did work for the CIA, adopted his children for the purposes of psychological experimentation.",
  "storyline": "A tense psychological thriller exploring the troubled past, conflict-filled present, and uncertain future of the Shellners. 75 year-old Dr. Nathaniel Shellner's led an extraordinary life as a psychiatrist, earning himself a Nobel Prize. After having one child with his wife, Lillian, they decide to adopt from the camps where Dr. Shellner worked. Ultimately the Shellners have 5 children; Tommy, Julie, and Harry. As Dr. Shellner lies on his death bed, the family gathers for a final farewell. Untill Tommy arrives and accuses his father of adopting his children not out of love, but to use them for psychological experiments.",
  "plot": "75-year-old Dr. Nathaniel Shellner has led an extraordinary life as a psychiatrist, working with traumatized patients fleeing war zones in refugee camps, earning himself a Nobel Prize for his work. After having one child, Leonard, with his wife, Lillian, the Shellners elect to adopt the remainder of their family from the camps where Dr. Shellner worked. Ultimately, the Shellners incorporated five children from all over the world into their family – Tommy, Julie, Harry, and twins Sylvia and Sasha. As Dr. Shellner lies on his death bed on a frigid, icy day on the fringes of New York City in suburban New Jersey, the family convenes at the house where the couple raised the children for a final, bittersweet farewell to a sensational and inspiring public figure. Or, that's the idea, until all hell breaks loose after Tommy arrives and accuses his father of adopting his children, not out of concern for their future well-being, but to use them for some warped psychological experiment.\n\nThe proceedings from Tommy's accusation forward during the remainder of the evening offer a cocktail of incidents between the family members own interpersonal issues and a relentless exploration of the clues Tommy manufactures as evidence of his father's alleged wrongdoing. The allegations not only stun the family, they stir up anger and resentment, not only because of Dr. Shellner’s failing health, but also because he has been held up as a paragon of selflessness and virtue not only within the family but from all his public recognition and numerous awards he was festooned with. As Tommy relentlessly pursues his own 'evidence' of his father's ostensible experiments with his children's minds and feelings, he simultaneously stirs up a whole load of simmering resentments, shifting alliances, and old traumas form the family's internal relations and dynamics.",
  "synopsis": null
}