{
  "imdb_id": "tt2112287",
  "tmdb_id": "53567",
  "douban_id": null,
  "title": "Thale (2012)",
  "genres": [
    "Drama",
    "Fantasy",
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "Norway",
  "version": [
    {
      "runtime": "76 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm2063500",
      "name": "Aleksander Nordaas"
    }
  ],
  "writer": [
    {
      "id": "nm2063500",
      "name": "Aleksander Nordaas",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3292413",
      "name": "Silje Reinåmo",
      "character": "Thale"
    },
    {
      "id": "nm2065025",
      "name": "Erlend Nervold",
      "character": "Elvis"
    },
    {
      "id": "nm2070870",
      "name": "Jon Sigve Skard",
      "character": "Leo"
    },
    {
      "id": "nm0028440",
      "name": "Morten Andresen",
      "character": "Hvittkledd"
    },
    {
      "id": "nm5291732",
      "name": "Roland Astrand",
      "character": "Voice       (voice) (as Roland Åstrand)"
    },
    {
      "id": "nm5291751",
      "name": "Sunniva Lien",
      "character": "Thale, ung"
    }
  ],
  "overview": "Norwegian folklore turns out to be real when Leo and Elvis encounter a girl called Thale in a basement. A regular cleaning job turns into a struggle for survival, while they're trying to figure out what or who Thale is.  Could Thale be a huldra?  A seductive forest spirit who appears from the front to be a beautiful young woman, but who also has a cow's tale and whose back appears to be like a hollowed out tree. The huldra has been known to offer rewards to those who satisfy them sexually, while death to those who fail to do so and are also prone to stealing human babies.",
  "storyline": "Estranged friends Leo (a crime-scene cleaner) and hired-hand Elvis are cleaning up a particularly messy casualty deep in the Norwegian woods. When Elvis accidentally finds a secret passage that leads to a subterranean living space, he also encounters Thale, a beautiful young woman who sings, but does not speak. Though they are intrigued and concerned for her, they are ill-prepared when others, tracking Thale, finally catch up to her.",
  "plot": null,
  "synopsis": "Two men are in plastic biohazard-type suits working as a cleaning crew on a crime scene. One of the men, Elvis, is vomiting continuously in a bucket; and you get a sense that he is inexperienced at this type of work. The second man, Leo, is calmly using handfuls of paper towels to mop up a large pool of congealed blood on the floor. Leo's cell phone rings and Elvis answers the phone for Leo and holds the phone to Leo's ear to speak as Leo still has the bloody rubber gloves on. Leo answers the phone, \"no shit cleaning service, Leo speaking.\" As he is listening to the details of their next cleaning job, Elvis makes the mistake of glancing over at the bloody crime scene for just a second and immediately doubles over vomiting again, dropping Leo's cell phone in the bloody mess in the process. Leo calmly kneels down and bends his ear down next to the phone on the floor to finish receiving the address to the next job. He finishes speaking and announces to Elvis, \"lunchtime\" Elvis says, \"great!\" Elvis is standing on the shore of a lake in a heavily wooded area. The wind is blowing and he's swaying slightly in the breeze with his eyes closed. Leo walks up and tells him that it's an elderly man they are about to clean up. (You see a cabin in the background, they are at their next job already.) Leo says that the police only found half of the body as they are in a remote area with wild animals around and the animals have scattered the remains. Elvis continues swaying with his eyes closed, but answers, \"so we have to find the other half.\" Leo gives his usual nonchalant shrug, he's obviously not surprised by the details of this kind of work. He asks Elvis what he is doing, Elvis says he's swaying in the breeze. Leo asks why and Elvis says, \"why not?\" Leo closes his eyes and sways also. He tells Elvis that they have to tear up the outhouse floor to recover all of the human remains that have been scattered around. Elvis is inside the outhouse throwing assorted clutter out, in order to make room to start removing the outhouse floor."
}