{
  "imdb_id": "tt2179191",
  "tmdb_id": "414780",
  "douban_id": null,
  "title": "After the Rain (2016)",
  "genres": [
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm2614264",
      "name": "Daniel Bonjour"
    }
  ],
  "writer": [
    {
      "id": "nm2614264",
      "name": "Daniel Bonjour",
      "description": "additional scenes"
    },
    {
      "id": "nm4849803",
      "name": "Ryan James Russell",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2614264",
      "name": "Daniel Bonjour",
      "character": "Ryan"
    },
    {
      "id": "nm2618310",
      "name": "Jelly Howie",
      "character": "Paisley"
    },
    {
      "id": "nm0382819",
      "name": "Catherine Hicks",
      "character": "Linda"
    },
    {
      "id": "nm1874681",
      "name": "Ida Anderson",
      "character": "Nurse #2"
    },
    {
      "id": "nm1206123",
      "name": "Potsch Boyd",
      "character": "Friend #1"
    },
    {
      "id": "nm2752810",
      "name": "Rachel Ann Courtney",
      "character": "Friend #3"
    },
    {
      "id": "nm2679121",
      "name": "Victoria Cruz",
      "character": "Nurse Patricia"
    },
    {
      "id": "nm1378329",
      "name": "Edward Finlay",
      "character": "Patrick"
    },
    {
      "id": "nm0291266",
      "name": "Steve Franken",
      "character": "Doctor"
    },
    {
      "id": "nm2126686",
      "name": "Howard Gibson",
      "character": "Friend"
    },
    {
      "id": "nm1587983",
      "name": "Chris Jarvis",
      "character": "Keith"
    },
    {
      "id": "nm0495698",
      "name": "Henry LeBlanc",
      "character": "Steve"
    },
    {
      "id": "nm2999413",
      "name": "Laura Ornelas",
      "character": "Flower shop customer"
    },
    {
      "id": "nm1668655",
      "name": "Roy Vongtama",
      "character": "Eddie"
    },
    {
      "id": "nm3826820",
      "name": "Barrie Wild",
      "character": "CT Operator"
    }
  ],
  "overview": "A young man at the end of his life tries to find hope and meaning through the relationships he will leave behind.",
  "storyline": "The mental and emotional trials of a young man suffering from terminal cancer, and the loved ones he will ultimately leave behind. The dynamics of love earned, life to be lived, and dreams shattered are explored as the strength of a few is tested in a very real story about letting go. \"Only when you learn to let go, does the beauty of life and everything in it reveal itself.\"",
  "plot": "Mexican filmmaker Sebastián (Gael García Bernal) and his executive producer Costa (Luis Tosar) arrive in Cochabamba, Bolivia, accompanied by a cast and crew, prepared to create a historical film depicting Christopher Columbus's first voyage to the New World, the imposition of Columbus’ will upon the natives, and the subsequent indigenous rebellion by Hatuey. Cognizant of his limited budget, Costa elects to film in Bolivia, the poorest country in South America. There, impoverished locals are thrilled to earn just two dollars a day as extras in the film, and willingly engage in physical labor for set preparation. Costa saves many thousands of dollars by having underpaid extras perform tasks meant to be completed by experienced engineers.\n\nSebastián casts a local man named Daniel (Juan Carlos Aduviri) in the role of Atuey, the Taíno chief who led a rebellion against Columbus; and Daniel's daughter Belén in a crucial role as well. Their first encounter with Daniel gives Costa pause and causes him to oppose his casting, but Sebastian gives him the role. Sebastian is unaware that fictional actor Daniel is leading demonstrations against the historically real event of water privatization that the Bolivian government has agreed to. Filming begins smoothly despite the alcoholism of actor Anton, (Karra Elejalde) cast as Colón (Columbus), but when Costa observes Daniel’s revolutionary involvement, he grows uneasy.\n\nDaniel pretends to acquiesce to Costa's insistence that he stop protesting, but heedlessly continues and sustains facial wounds in a clash with the police. At this point, Costa bribes Daniel to wait for filming to conclude before participating in the rebellion again. Daniel agrees, accepting the money, but spends it on funding the protesters and remains involved, eventually becoming bloodied and imprisoned. Sebastián experiences moral conflict and begins to doubt the likelihood of the film’s completion, but is reassured by Costa, who bribes the police for Daniel’s temporary release in order to film a key scene. Upon this scene’s completion, police arrive in the Bolivian jungle to once again detain Daniel but are besieged by the film’s extras, aiding Daniel's escape.\n\nThat night, when actors Juan and Alberto see the latest news reports showing violence in Cochabamba, they become worried to the extent that they demand to leave. Sebastián begs that they stay and they hesitantly agree. The next day, as the cast and crew prepare to depart for filming, Costa is met by Daniel’s wife, Teresa, who desperately implores him to assist her in finding her daughter Belén, who has disappeared into the protests and is reportedly wounded and needing hospitalization. Teresa’s persistence wins over Costa’s conscience, and despite Sebastián's equally impassioned insistence against it, he leaves with her.\n\nAfter Costa and Teresa's obstacle-laden drive through riotous Cochabamba, Belén’s life is saved, but her leg is badly injured and may never fully heal. Meanwhile, the rest of the crew is stopped by a military blockade and all except Antón leave Sebastián to journey home. The revolution ends shortly thereafter with the departure of the multinational water company, but Cochabamba is left in ruins from the conflict. Costa expresses hope that the film will be finished after all, and Daniel emotionally presents him with a vial of Bolivian water in appreciation for his life-saving efforts.",
  "synopsis": null
}