{
  "imdb_id": "tt2137442",
  "tmdb_id": "229580",
  "douban_id": null,
  "title": "CrazySexyCool: The TLC Story (TV Movie 2013)",
  "genres": [
    "Biography",
    "Drama",
    "Music"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "105 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.8,
  "director": [
    {
      "id": "nm0831690",
      "name": "Charles Stone III"
    }
  ],
  "writer": [
    {
      "id": "nm0486824",
      "name": "Kate Lanier",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1551130",
      "name": "Keke Palmer",
      "character": "Chilli"
    },
    {
      "id": "nm1468674",
      "name": "Rochelle Aytes",
      "character": "Pebbles"
    },
    {
      "id": "nm1963091",
      "name": "Evan Ross",
      "character": "Dallas Austin"
    },
    {
      "id": "nm1485940",
      "name": "Donny Boaz",
      "character": "Bill Diggins"
    },
    {
      "id": "nm0668241",
      "name": "Carl Anthony Payne II",
      "character": "Antonio 'L.A.' Reid"
    },
    {
      "id": "nm0796676",
      "name": "Drew Sidora",
      "character": "T-Boz"
    },
    {
      "id": "nm2674657",
      "name": "Niatia 'Lil Mama' Kirkland",
      "character": "Left Eye"
    },
    {
      "id": "nm4578163",
      "name": "Ariana Neal",
      "character": "Young Lisa"
    },
    {
      "id": "nm0593301",
      "name": "E. Roger Mitchell",
      "character": "Hospital Doctor"
    },
    {
      "id": "nm3759165",
      "name": "Antonio Madison",
      "character": "DJ"
    },
    {
      "id": "nm0024194",
      "name": "Ed Amatrudo",
      "character": "Clive Davis"
    },
    {
      "id": "nm3201868",
      "name": "Rico Ball",
      "character": "Andre Rison"
    },
    {
      "id": "nm0561907",
      "name": "Daniel Thomas May",
      "character": "Lawyer"
    },
    {
      "id": "nm6220255",
      "name": "Jock McKissic",
      "character": "Correctional Officer"
    },
    {
      "id": "nm0171078",
      "name": "Jim R. Coleman",
      "character": "Dr. Sebi"
    },
    {
      "id": "nm3309959",
      "name": "Renell Gibbs",
      "character": "Larry"
    },
    {
      "id": "nm0079925",
      "name": "Karen Beyer",
      "character": "Clive's Secretary"
    },
    {
      "id": "nm1564061",
      "name": "Chantell D. Christopher",
      "character": "Tionne's Mother"
    },
    {
      "id": "nm3649826",
      "name": "Rachelle Neal",
      "character": "Female Dancer"
    },
    {
      "id": "nm8412661",
      "name": "Brave Williams",
      "character": "Singer"
    },
    {
      "id": "nm5216434",
      "name": "Marcus Lewis",
      "character": "Left Eye's Bodyguard"
    },
    {
      "id": "nm1138105",
      "name": "Tasia Sherel",
      "character": "Chilli's Mom"
    },
    {
      "id": "nm0675195",
      "name": "L.A. Winters",
      "character": "VMA Reporter       (as Lisa Winters II)"
    },
    {
      "id": "nm1296890",
      "name": "Shamea Morton",
      "character": "Pregnant Girl"
    },
    {
      "id": "nm5931147",
      "name": "Amahre Palmer",
      "character": "Publicist"
    },
    {
      "id": "nm5045785",
      "name": "Nick DeKay",
      "character": "Bartender"
    },
    {
      "id": "nm5229198",
      "name": "Raven-Danielle Baker",
      "character": "Andre's Girl       (as Raven Baker)"
    },
    {
      "id": "nm1989212",
      "name": "Charlotte Haynes Hazzard",
      "character": "Counselor"
    },
    {
      "id": "nm5619155",
      "name": "Brooke Montalvo",
      "character": "Crystal Jones"
    },
    {
      "id": "nm5645066",
      "name": "Saidah Nairobi",
      "character": "Receptionist"
    },
    {
      "id": "nm3708252",
      "name": "Shaun Clay",
      "character": "Puffy       (as Lashaun Clay)"
    },
    {
      "id": "nm5260516",
      "name": "Mary Shaw",
      "character": "Tionne's Doctor"
    },
    {
      "id": "nm5722496",
      "name": "Wadette Bradford",
      "character": "Fan Mail Dancer"
    },
    {
      "id": "nm5435577",
      "name": "Mariama Diallo",
      "character": "Dallas's Friend"
    },
    {
      "id": "nm1554620",
      "name": "Frank Faucette",
      "character": "Lisa's Dad"
    },
    {
      "id": "nm3468825",
      "name": "Dawntavia Bullard",
      "character": "Lisa's Friend"
    },
    {
      "id": "nm2317467",
      "name": "Hajji Golightly",
      "character": "Roadie"
    },
    {
      "id": "nm5663961",
      "name": "Cori Sims",
      "character": "Skater"
    },
    {
      "id": "nm5086096",
      "name": "Carl Windom Carlito",
      "character": "Dancer       (as Carl Windom)"
    },
    {
      "id": "nm5572508",
      "name": "Jeffrey Karantza",
      "character": "Video Crew"
    },
    {
      "id": "nm2937645",
      "name": "DeMontrez Spears",
      "character": "Dalvin"
    },
    {
      "id": "nm3778118",
      "name": "Hakim Callender",
      "character": "Tionne's Bodyguard: Daryl"
    },
    {
      "id": "nm1988037",
      "name": "Thomas Elliott",
      "character": "Club Goer"
    },
    {
      "id": "nm2902065",
      "name": "Haji Abdullah",
      "character": "Club Bouncer"
    },
    {
      "id": "nm6241608",
      "name": "Vincent Howard",
      "character": "Skater /              Dancer"
    },
    {
      "id": "nm5576207",
      "name": "Jas Hardy",
      "character": "Throw Momma (Lisa's Friend /              Detainee)       (as Laidee P. Jas)"
    },
    {
      "id": "nm5125429",
      "name": "Melissa Youngblood",
      "character": "Cheri"
    },
    {
      "id": "nm2845763",
      "name": "Paul Bednarz",
      "character": "EMT"
    },
    {
      "id": "nm0782509",
      "name": "Martin Seifert",
      "character": "Press"
    },
    {
      "id": "nm2873570",
      "name": "Tyrone Beasley",
      "character": "Policeman"
    },
    {
      "id": "nm5314033",
      "name": "Marshall Hood",
      "character": "MC Hammer       (credit only)"
    },
    {
      "id": "nm3416293",
      "name": "Nadiyah Hollis",
      "character": "Bleached Weave Girl"
    },
    {
      "id": "nm5590876",
      "name": "Haley Covalli",
      "character": "Make-up Artist"
    },
    {
      "id": "nm5669784",
      "name": "Tiffany Ryland",
      "character": "Dallas Austin's Friend"
    },
    {
      "id": "nm2711528",
      "name": "Sedrick Ward",
      "character": "Roller Skater"
    },
    {
      "id": "nm7014610",
      "name": "Asha Crawford",
      "character": "Dancer"
    },
    {
      "id": "nm5604779",
      "name": "Anthony Williams",
      "character": "Chili's Son Tron"
    },
    {
      "id": "nm7245992",
      "name": "Jonathan Smith",
      "character": "Skater"
    },
    {
      "id": "nm8233657",
      "name": "Johnny Burgess",
      "character": "Dancer"
    },
    {
      "id": "nm7761573",
      "name": "David Coffey",
      "character": "Video Crew"
    },
    {
      "id": "nm6404542",
      "name": "Hannah Cartwright",
      "character": "Young Chilli"
    },
    {
      "id": "nm5602186",
      "name": "Anthony Jordan Williams",
      "character": "Chili's Son Tron"
    },
    {
      "id": "nm4076050",
      "name": "Chaka Idris",
      "character": "Security Guard"
    },
    {
      "id": "nm3705688",
      "name": "Joshua Tanksley",
      "character": "Skater"
    },
    {
      "id": "nm5739112",
      "name": "Ravan-Simone Jarrett",
      "character": "Hip Club Patron /              Dancer in Club"
    },
    {
      "id": "nm5421365",
      "name": "Mia D. Braswell",
      "character": "Scantily Clad Girl"
    },
    {
      "id": "nm6168092",
      "name": "Taryn Kae'lyn Mcfarthing",
      "character": "Lisa's Friend (pink hair)"
    },
    {
      "id": "nm5741380",
      "name": "Ashley Abrams",
      "character": "MC Hammer Crew"
    },
    {
      "id": "nm5752206",
      "name": "Eboni A. Johnson",
      "character": "Dancer"
    },
    {
      "id": "nm6106231",
      "name": "Ninita McCan",
      "character": "Diandre"
    },
    {
      "id": "nm6583302",
      "name": "Alexandra T. Carter",
      "character": "Marie"
    },
    {
      "id": "nm5498590",
      "name": "Charles Walton",
      "character": "Radio Host"
    },
    {
      "id": "nm5462821",
      "name": "Daniel T. Martin",
      "character": "Hotel Guest"
    }
  ],
  "overview": "TLC's humble beginnings in Atlanta quickly led to an unprecedented rise to fame in the 1990's as one of the world's most talented, celebrated and highest-selling female groups of all time. Through very public and high profile success, turmoil and tragedy, TLC left an indelible stamp of female empowerment that changed the face of the music industry forever.",
  "storyline": "The story of Legendary hip hop/r&b/pop trio TLC. The group rose to fame in 1991 when they signed to LaFace Records, releasing their multi-platinum debut. Their 1994 follow-up, CrazySexyCool sold over 22 million copies, and Fanmail sold over 10 million copies in 1999. This group experienced bankruptcy, illness, group fights, and death. All the while dominating the charts and the music industry.",
  "plot": "This article's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (May 2014) (Learn how and when to remove this template message)\nThe film begins with Tionne Watkins (Drew Sidora) narrating, telling about the girls' lives as children and summarizing their story. The film then jumps to the year 1990 in Atlanta, Georgia. Tionne, after being rejected for an all-male street dance crew despite impressing the crowd at a rollerskating center, is approached by her friend, Marie, who informs her about a girl group being formed by Ian Burke and persuades her to audition for LaFace Records. Tionne, although reluctant, brings Crystal (Brooke Montalvo), the founder of the group, to meet her rapper friend Lisa Lopes (Natia \"Lil Mama\" Kirkland) and see her perform and Crystal says that she will be perfect for the group. After singing \"Meeting in the Ladies Room\", they receive a mixed reception, mostly in part due to Crystal's ill-fated off key performance. However, both Tionne and Lisa garner interest from both Perri \"Pebbles\" Reid (Rochelle Aytes) and her husband, co-founder of LaFace Antonio \"L.A.\" Reid (Carl Anthony Payne II). After receiving the good news from both Pebbles and L.A. Reid, Lisa decides that she should call her family in Philadelphia and tell them the great news, especially her father, who told her that she would never make it as a rapper. She calls her family only to learn that her father has been shot and killed, which causes her to begin drinking heavily in her grief.\n\nThe film jumps ahead to a dance class where we see Rozonda Thomas (Lauren \"Keke\" Palmer) dancing. Rozonda sees Pebbles walk in and talk to her teacher. She asks one of the other girls why Pebbles was there. The girl tells her about Pebbles looking for another girl for a girl group. Rozanda rushes over and immediately talks to Pebbles and when her dance teacher tells her to go back, she starts singing, amazing everyone listening. Pebbles brings Rozonda to meet Lisa, Tionne, and music producer Dallas Austin (Evan Ross), who is Tionne's longtime friend. The girls become fast friends and start working on their audition with L.A. Reid. At the audition, where they perform \"What About Your Friends\", L.A. gives them a green light to go ahead and cut their first video and record, and Rozonda is rechristened \"Chilli\" for the group. After the audition, Chilli asks Tionne and Lisa about Dallas, and they state that he is a player - a guy who has flings with several women and will not settle down with anyone. Pebbles takes the girls out to lunch to sign the contracts telling them that they have a weekly stipend of $25.00 and will only get paid when they have sold records and tickets to shows.\n\nThe girls are given studio sessions, where Pebbles forces the girls to do sections of their dance routines repeatedly to get them right. During the rehearsal, Pebbles notices Chilli eying Dallas, who is producing some tracks for the album, and Lisa complains she is hungry whilst swearing. She pulls all the girls aside and tells them that they will not cuss or be \"loose\", this seems to rub Chilli and Tionne the wrong way, but they get back to work. Pebbles later leaves the girls during a studio session to attend a meeting. She tells Dallas to keep the girls working, but instead a fun food fight breaks out between the girls and Dallas. Dallas chases Chilli into one of the sound booths and proceeds to kiss her. After re-entering the studio Pebbles sees the two lip-locked lovers and begins to reprimand the girls and Dallas for their behavior while she was gone. After docking the girls two weeks' pay, she then pulls Chilli into the sitting area and tells her that she is suspended for two days and that she may or may not get her job back. Pebbles tells Chilli to leave the studio and says that she has a lot of thinking to do.\n\nPebbles goes and talks to Tionne and Lisa who both tell her that they want Chilli to stay. Pebbles still insists on putting out an advertisement on the radio about the auditions to see if there is another singer who fits the vision she has for the group. During the auditions, an upset Chilli is with Dallas, who comforts her by kissing her, which leads to them making love while Tionne and Lisa sit through a day of auditionees. After a day of bad auditions, Pebbles decides to let Chilli stay in the group. Lisa and Tionne call Chilli to tell her that she is back in the group and that everything will go according to plan. Right after Chilli gets that call she looks down at a pregnancy test that she has just taken and it is positive. She tells Dallas that she is uncertain what to do, despite her desire to be a mother, and Dallas says that he will support her in whatever decision she makes. Chilli decides that it's best that she get an abortion because of the fragile state her career is in. Tionne and Lisa come to visit Chilli after the operation to cheer her up. After Chilli has recovered, they are seen working on their first music video for their song \"Ain't 2 Proud 2 Beg\" from their debut album, Ooooooohhh... On the TLC Tip. During the video shoot, Chilli begins to suspect that Dallas is cheating on her when she sees him talking to another girl. Later in a car, Lisa proposes that they do a video and an album with a futuristic theme, but Tionne says that they should wait until they get recognized. The girls are then estatic when they hear \"What About Your Friends\" on the radio for the first time.\n\nThe girls begin their first nationwide tour as an opening act for MC Hammer, and their first concert is met with rousing acclaim from the stadium audience. Midway through the successful tour, during which their album and singles also sell well, after learning that they will only get paid once the label is reimbursed for the costs spent on them, the girls ask Pebbles if they can review their initial contracts. A hurt Pebbles, who thinks that the girls don't trust her, storms out, so they decide to wait before pursuing the matter any further. Backstage following a concert, Chilli eyes Dallas talking to yet another girl, arousing her suspicions, and Tionne collapses on the floor and is taken to the hospital. A doctor informs Lisa, Chilli and Pebbles that Tionne's collapse was due a crisis from her sickle-cell anemia, a fact previously unknown to the girls, and she needs two weeks to recover, resulting in several cancelled shows. Tionne's mother complains to the doctor about not being given reassurance on the ongoing prognosis, but Tionne says that as long as she is living her dream of performing in front of thousands of people, she will be okay.\n\nAfter the girls return home from their tour, they receive their platinum records for 1 million copies sold of their album and they receive their brand new cars, but still wonder where the rest of the money is. They go to their attorney so that they can go over their contracts, only to find out that their attorney works for Pebbles. The attorney tells them that L.A. Reid has all their money and they are to only get a stipend while the rest goes into an account so that they don't spend it all. They go talk to L.A. and tell him that they don't want Pebbles on their second album because they want more artistic freedom. L.A. tells them that since Pebbles owns the trademarks and copyrights of the name TLC they will either have to buy her out or change their name. They decide to buy her out in order to achieve the creative freedom that they need.\n\nIn 1993, the girls begin working on their second album CrazySexyCool, believing that their new creative freedom will come with more rights to their money. When Chilli rejects a night out with Tionne and Lisa to get some rest at home, they go clubbing at a nearby club. However, Lisa gets drunk and dances on top of the bar, and she smashes the bar owner in the head with a beer bottle when he tries to get her to stop, causing her to be banned from the club. Tionne takes her to a hotel, where she has a nervous breakdown about people taking things away from her. The same night, Chilli comes home only to find Dallas has thrown a party there without informing her, but he calms her down by kissing her. The next morning, Chilli admits to her mother that she is uncertain, saying she shouldn't be with Dallas but she cannot let him go. During a recording session, Tionne notices Dallas talking to another woman, so scolds him on his behaviour while he is still dating Chilli, who walks in, witnesses the confrontation and sees the woman. During a night of clubbing with her friend, Lisa complains about a man watching her from afar. Her friend says that the man is Andre Rison, a wide receiver with the NFL's Atlanta Falcons. Andre walks up to Lisa, proclaiming that he is her biggest fan and requests that she honor him with a dance, to which Lisa obliges. Later, as Lisa and her friend are leaving the club, Andre picks Lisa up and carries her in his arms, and despite Lisa's demands that he put her down, he persuades her to come home with him. As they arrive in his house, Lisa asks him why there is no furniture inside; he says he was waiting for her and they kiss passionately.\n\nLater in 1994, Lisa moves in with Andre and Chilli is horrified when another girl announces that she is pregnant with Dallas' baby, so she pours her heartbreak into the recording of \"Creep\". Later that night, Lisa comes home and finds Andre cheating on her with another woman, she slaps him and storms out. Dallas arrives at Chilli's house the next night to apologise to her, and they make love again. At the same time, Lisa and her friend notice newly-bought tennis shoes on her and Andre's bed. Realising that Andre did not buy the shoes for her, she takes some of the shoes, puts them in a bathtub and sets fire to them to get back at Andre. However, the fire quickly spreads and their entire house is burnt down, which makes the news. Lisa flees and Tionne and Chilli find her in a forest, coming to terms with all that she has been through. Eventually, Lisa turns herself in to the police and is charged for first-degree arson and sentenced to five years of probation and a $10,000 fine. She spends time in rehab, and is only released during her stay for two recording sessions with Tionne and Chilli, during which she contributes an introspective rap verse to what will become the group's biggest hit, \"Waterfalls\", after seeing a rainbow on the ride to the studio. During the video shoot for \"Creep\", Lisa complains to Tionne that they never get to do her \"futuristic\" idea and threatens to wear tape on her mouth, which turns into Lisa and Chilli complaining that they spoke with L.A. who told them that he isn't in control of the money, that Clive Davis (Ed Amatrudo) has all their money and that they need to speak with him. Tionne then urges them not to fixate on it, as she believes that getting rid of Pebbles is supposed to fix their problems in the first place.\n\nIn 1995, after receiving awards and other acknowledgements they still don't see any money come in. At the 1996 Grammy Awards, they announce that they are broke - because of greedy people at their record company. The film flashes back to 1995, where they complain to each other about only receiving $50,000 a year, whereas most people make more money than they do. So the girls band a group together to go storm the record label's building to speak with Clive, who is in the middle of a meeting with Sean \"Puffy\" Combs (Shaun Davis). Clive tells the girls that they will get the attorneys and the accountants in a meeting and see what the record label owes them. They are all cut small checks of $25,000, and Lisa reveals in an on-air radio interview that the group owe $200,000 that they don't have in order to pay back managers, lawyers and damages that Pebbles is suing them for. The group then file for bankruptcy and find a new manager, Bill Diggins (Donny Boaz), who gives them a worldwide headlining tour, the Budweiser Fest Tour, and an improved profit margin after they record their next album.\n\nIn late 1996, following the tour, Chilli announces to Tionne and Lisa that she is pregnant with Dallas' baby. By 1997, the girls are recording their third album FanMail, dedicated to their fans whose letters they have received, and Chilli gives birth to her and Dallas' son, Tron. In 1998, during a sickle-cell scare in hospital after being comforted by her mother, Tionne writes a poem dealing with a woman's struggle with her self-image and unrealistic concepts of beauty portrayed in the media, which Dallas helps her adapt into \"Unpretty\", an empowering song for the group's female fan base to overcome feelings of physical inadequacy. During the song's recording, Chilli breaks up with Dallas, saying that even though they have a son together, they are still very different people and they are not right for each other.\n\nIn October 1999, the girls are about to go on tour to support FanMail. However, by this time, friction between the girls has increased because Lisa is complaining to her new boyfriend Larry about Tionne and Chilli rejecting her ideas and apparently plagiarizing them, and she has challenged Tionne and Chilli to make their own solo albums in a bid to see who is most successful member of the group. Following a confrontation between Tionne and Bill and Lisa and Larry before a scheduled appearance at TRL, during which Tionne reveals that Larry is married, Bill urges Lisa to sort out her issues with Tionne and Chilli before going on tour or they will all fall back into bankruptcy again.\n\nIn February 2000, Bill offers the girls 10 shows in Europe for their tour the following week with estimated earnings of $25 million, which Tionne and Chilli are ecstatic about, but Lisa declines, stating that she is going to Honduras that week for spiritual healing and she is beginning work on her debut solo album. Later, while Lisa is in Honduras, Tionne learns in hospital that she is pregnant with her first child and chooses to keep the baby, despite the risks for her and the baby. Shortly after, Bill urges the girls to do another album and another tour, but Tionne, due to her pregnancy, and Lisa, awaiting the release of her album Supernova, are reluctant. Later, Lisa learns that her record company isn't releasing Supernova in the U.S. due to poor sales and reception overseas, so she has a nervous breakdown. After she admits to Tionne and Chilli that she feels that the numbers aren't aligning properly, they comfort her and urge her to go back to Honduras for more spiritual healing and work on her second solo album in addition to working with them on their next album. Tionne then gives birth to her daughter, Chase.\n\nBy early 2002, the group are recording their fourth album 3D, with Tionne and Chilli adjusting to life as mothers with growing children and Lisa contributing raps to some of the songs before heading to Honduras. Lisa promises to record more songs with them when she gets back from Honduras, and vows that there will be no more friction between them. However, on April 25, 2002, a devastated Tionne and Chilli learn that Lisa has been killed on impact in a car accident in La Ceiba, Honduras while filming what will become her documentary. During a radio interview, Tionne and Chilli vow to always stay together despite Lisa's death, although they are uncertain about the group's fate.\n\nThe film ends 10 years later with Tionne and Chilli reuniting in the studio to begin recording their next album. The film then transitions into real-life studio footage of Tionne and Chilli recording \"Meant to Be\" in the studio with singer-songwriter Shaffer \"Ne-Yo\" Smith, as vigils in the career of TLC play during the song.",
  "synopsis": null
}