{
  "imdb_id": "tt2109094",
  "tmdb_id": "171615",
  "douban_id": null,
  "title": "Black Briefs (Video 2012)",
  "genres": [
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm1144594",
      "name": "Christopher Banks"
    },
    {
      "id": "nm1483934",
      "name": "Camille Carida"
    },
    {
      "id": "nm0360887",
      "name": "Jim Hansen"
    },
    {
      "id": "nm0393234",
      "name": "Hong Khaou"
    },
    {
      "id": "nm0687443",
      "name": "Jack Plotnick"
    },
    {
      "id": "nm3233546",
      "name": "Greg Ivan Smith"
    },
    {
      "id": "nm1377975",
      "name": "Lalo Vasquez"
    }
  ],
  "writer": [
    {
      "id": "nm1752025",
      "name": "Hunter Lee Hughes",
      "description": "segment segment \"Winner Takes All\""
    }
  ],
  "cast": [
    {
      "id": "nm2817517",
      "name": "Korken Alexander",
      "character": "Stu (segment \"Promise\")"
    },
    {
      "id": "nm3348068",
      "name": "Joshua Blanaru",
      "character": "Joseph (segment \"Promise\")"
    },
    {
      "id": "nm3784037",
      "name": "Alexander Campbell",
      "character": "Andrew (segment \"Communication\")"
    },
    {
      "id": "nm2246211",
      "name": "Rick Cornette",
      "character": "Chris (segment \"Promise\")"
    },
    {
      "id": "nm3249912",
      "name": "Michael Fitzpatrick",
      "character": "Sam (segment \"Remission\")"
    },
    {
      "id": "nm0360887",
      "name": "Jim Hansen",
      "character": "Jim (segment \"Video Night\")"
    },
    {
      "id": "nm1752025",
      "name": "Hunter Lee Hughes",
      "character": "Brian (segment \"Winner Takes All\")"
    },
    {
      "id": "nm3262818",
      "name": "Annie Iskenderian",
      "character": "Monica (segment \"Promise\")"
    },
    {
      "id": "nm1631867",
      "name": "Jonathan Keane",
      "character": "Tim (segment \"Spring\")"
    },
    {
      "id": "nm1045898",
      "name": "Richard Lambeth",
      "character": "Charles (segment \"Communication\")"
    },
    {
      "id": "nm3265369",
      "name": "Jason Leyden",
      "character": "Bartender (segment \"Promise\")"
    },
    {
      "id": "nm1051089",
      "name": "Jeremy Lucas",
      "character": "Nate (segment \"Promise\")"
    },
    {
      "id": "nm0544568",
      "name": "Alec Mapa",
      "character": "Simon (segment \"Winner Takes All\")"
    },
    {
      "id": "nm1937461",
      "name": "Gavyn Michaels",
      "character": "Ryker (segment \"Winner Takes All\")"
    },
    {
      "id": "nm4131906",
      "name": "Chris O'Donnell",
      "character": "Joe (segment \"Spring\")"
    },
    {
      "id": "nm3392094",
      "name": "Todd Jennison Parmley",
      "character": "The Figure (segment \"Remission\")"
    },
    {
      "id": "nm0687443",
      "name": "Jack Plotnick",
      "character": "(segment \"Video Night\")"
    },
    {
      "id": "nm1840138",
      "name": "Adrian Quinonez",
      "character": "(segment \"Winner Takes All\")"
    },
    {
      "id": "nm3049501",
      "name": "Jesse James Rice",
      "character": "Jesse (segment \"Video Night\")       (as Jesse Rice)"
    },
    {
      "id": "nm0733812",
      "name": "Kali Rocha",
      "character": "Kali (segment \"Video Night\")"
    },
    {
      "id": "nm2777067",
      "name": "Rita Lefau Ryan",
      "character": "The Stranger (segment \"Communication\")"
    },
    {
      "id": "nm2858386",
      "name": "Rudi Vodanovich",
      "character": "Jacob (segment \"Communication\")"
    },
    {
      "id": "nm1047150",
      "name": "Jull Weber",
      "character": "Art (segment \"Promise\")"
    }
  ],
  "overview": "Six dark-themed gay short films, including:  SPRING,  A young man meets a stranger for S&amp;M sex, an experience that will change his life forever.  REMISSION, As a man awaits the results of a biopsy at his secluded cabin, his dread amplifies when he suspects that he may not be alone\r WINNER TAKES ALL, The unapologetic manipulator Ryker engineers a fight between his two boyfriends ... with Ryker himself as the ultimate prize.\r PROMISE, Stu and Chris appear to be the perfect couple, but past indiscretions are revealed on the eve of their wedding, causing unforgivable actions that both will regret.\r VIDEO NIGHT, What starts out as a fun night making videos goes terribly wrong when a group of friends discover something unexpected in the raw footage.\r COMMUNICATION, The story of an Orthodox Jewish student who unexpectedly inherits the estate of his estranged mentor and discovers a painful truth about their relationship.",
  "storyline": "Featuring six award-winning short films with suspenseful story lines and themes, this collection aims to entertain and chill your bones! Included here are the shorts 'Communication', 'Promise', 'Remission', 'Spring', 'Video Night' and 'Winner Takes All'.",
  "plot": "In 1963 Jackson, Mississippi, Aibileen Clark is a black maid who raises the children of Elizabeth Leefolt, a white woman suffering from postpartum depression, who refuses to acknowledge her daughter Mae Mobley other than by disciplining her. Aibileen's best friend is Minny Jackson, an outspoken black maid who works for Hilly Holbrook's senile mother, Mrs. Walters. While Minny may have an outspoken attitude, she has won favor with her great cooking skills. Eugenia \"Skeeter\" Phelan is a young white woman returning home after graduating from the University of Mississippi to discover that her mother Charlotte has fired her childhood nanny and maid Constantine.\n\nMuch to her mother's chagrin, Skeeter aspires to have a successful writing career. After spending time with Aibileen, forward-thinking Skeeter becomes increasingly disgusted with the attitudes and poor treatment of their \"help\" by her white socialite friends (who even begin campaigning to require the maids to only use the restroom in dingy, shabby, and non-air conditioned outhouses in the extreme heat and exposed to the elements, with Hilly saying that \"[Black people] carry different diseases\") and decides to write about the experiences of their housekeepers. The maids are reluctant to comply, afraid of retribution from their employers and the Anti-Civil Rights movement, but Aibileen eventually agrees, becoming emotionally attached to the project as it allows her to find closure on the death of her son four years earlier. Minny also complies after Hilly fires her for using the guest-bathroom and refusing to go out in tornado weather to use the help's toilet, and later makes false claims that Minny had been fired for stealing, making it nearly impossible for her to get new employment.\n\nMinny eventually finds work with working-class Celia Foote, who is married to wealthy socialite (and former beau of Hilly) Johnny Foote. Celia is starved for friendship due to Hilly's efforts to ensure she remains a social pariah. Celia informs Minny that she is pregnant and befriends her over cooking lessons, while hiding the fact that she has hired a maid from Johnny. The relationship between Celia and Minny deepens further after Celia miscarries.\n\nSkeeter submits the draft book to Harper &amp; Row. Her editor, Elaine Stein, advises her that more maids' stories need to be included. Following the assassination of Medgar Evers and the brutal arrest of Yule May, Hilly's replacement maid, more maids decide to offer their insight to Skeeter.\n\nAs the writing of the book continues, Skeeter, Aibileen and Minny worry that some maids and families will be recognized in the book. Minny, as a form of insurance, reveals her \"Terrible Awful\" story. In a fit of pique over being fired and having her reputation damaged by Hilly's lies, Minny baked her own excrement into a chocolate pie for Hilly. Hilly ate two slices before Minny told her what was in it, as she prevented Mrs. Walters from having a slice. Minny predicts its inclusion will keep the other maids safe from retribution, as Hilly will wield her social influence to convince everyone that the story did not take place in Jackson to protect her own reputation.\n\nWith the book almost finished, Skeeter confronts her mother about the firing of Constantine. Charlotte reveals that during a lunch with the local chapter of the Daughters of America, Constantine's daughter Rachel arrived and embarrassed Charlotte by disobeying her order to enter through the kitchen. In order to save face, Charlotte fired Constantine and ordered her and Rachel to leave immediately. Afterward, Rachel took Constantine home with her to Chicago. Charlotte had every intention of bringing Constantine back, but by the time she sent her son to bring her back, Constantine had died.\n\nThe book, published anonymously, is a success. Minny confesses about the Terrible Awful to Celia and Hilly does everything in her power to protect her reputation when she notices the Terrible Awful in the book. She becomes unhinged when a contribution from Celia to one of Hilly's charitable works is made out to \"Two Slice Hilly.\" She drives intoxicated to the Phelan plantation to confront Skeeter and inform Charlotte about her daughter's \"hippie ways\". Charlotte implies that she already knows that Hilly is the subject of the story and orders her off the property. Charlotte and Skeeter reconcile, and Charlotte offers to help Skeeter prepare to move to Manhattan where she has been offered a job with Harper &amp; Row.\n\nJohnny reveals that he knows that Minny has been helping Celia and that Celia had informed him of the babies she miscarried. Johnny and Celia inform Minny she has a job with them for as long as she wants. This kindness gives Minny the courage to leave her abusive husband and take her children to live with the Footes.\n\nHilly returns to her old ways. Since she cannot expose herself as the subject in the book, Hilly attempts to frame Aibileen for theft and, after pressuring weak-willed Elizabeth into silence, tells Aibileen that she is fired. Aibileen condemns Hilly as a godless, vindictive woman. Defeated and humiliated, Hilly breaks down in tears and leaves. After saying farewell to Mae Mobley, Aibileen leaves for a new life, reflecting on her desire to become a writer.",
  "synopsis": "Six dark-themed gay short films, including: SPRING, Directed by Hong Khaou (13 minutes) - A young man meets a stranger for S&M sex, an experience that will change his life forever (Official Selection - Frameline, NewFest, Outfest; Finalist - Iris Prize); REMISSION, Directed by Greg Ivan Smith (14 minutes) - As a man awaits the results of a biopsy at his secluded cabin, his dread amplifies when he suspects that he may not be alone - from the director of the award-winning THE BACK ROOM (Winner - Horror Film Award, Rhode Island International Film Festival); WINNER TAKES ALL, Directed by Camille Carida (17 minutes) - The unapologetic manipulator Ryker engineers a fight between his two boyfriends ... with Ryker himself as the ultimate prize - featuring gay favorite Alec Mapa (Official Selection - Atlanta Film Festival, Philadelphia QFest); PROMISE, Directed by Lalo Vasquez (20 minutes) - Stu and Chris appear to be the perfect couple, but past indiscretions are revealed on the eve of their wedding, causing unforgivable actions that both will regret (Official Selection - FilmOut San Diego); VIDEO NIGHT, Directed by Jim Hansen and Jack Plotnick (6 minutes) - What starts out as a fun night making videos goes terribly wrong when a group of friends discover something unexpected in the raw footage (Official Selection - Outfest); and COMMUNICATION, Directed by Christopher Banks (19 minutes) - From the creators of the critically acclaimed TEDDY comes the story of an Orthodox Jewish student who unexpectedly inherits the estate of his estranged mentor and discovers a painful truth about their relationship (Winner - Outstanding Short Film, QBliss Creating Change Community Awards)."
}