{
  "imdb_id": "tt2147319",
  "tmdb_id": "104524",
  "douban_id": null,
  "title": "Helter Skelter (2012)",
  "genres": [
    "Drama",
    "Horror"
  ],
  "country": "Japan",
  "version": [],
  "imdb_rating": 6.3,
  "director": [
    {
      "id": "nm2242451",
      "name": "Mika Ninagawa"
    }
  ],
  "writer": [
    {
      "id": "nm4822259",
      "name": "Kyôko Okazaki",
      "description": "manga"
    },
    {
      "id": "nm1939516",
      "name": "Arisa Kaneko",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm1847329",
      "name": "Erika Sawajiri",
      "character": "Lilico"
    },
    {
      "id": "nm3460467",
      "name": "Kiko Mizuhara",
      "character": "Kozue Yoshikawa"
    },
    {
      "id": "nm1071413",
      "name": "Nao Ohmori",
      "character": "Makoto asada       (as Nao Ômori)"
    },
    {
      "id": "nm1687017",
      "name": "Gô Ayano",
      "character": "Shin Okumura"
    },
    {
      "id": "nm1078422",
      "name": "Hirofumi Arai",
      "character": "Kinji Sawanabe"
    },
    {
      "id": "nm0840551",
      "name": "Anne Suzuki",
      "character": "Kumi Hosuda"
    },
    {
      "id": "nm0855398",
      "name": "Susumu Terajima",
      "character": "Assistant Prosecutor Keita Tsukahara"
    },
    {
      "id": "nm0014558",
      "name": "Shô Aikawa",
      "character": "Movie Producer Mikio Hamaguchi"
    },
    {
      "id": "nm2832600",
      "name": "Yumiko Hara",
      "character": ""
    },
    {
      "id": "nm7014801",
      "name": "Mieko Harada",
      "character": "Doctor Hisako Waku"
    },
    {
      "id": "nm6514852",
      "name": "Yô Kobayashi",
      "character": ""
    },
    {
      "id": "nm5145387",
      "name": "Daimaô Kosaka",
      "character": "TV Show Host"
    },
    {
      "id": "nm0473577",
      "name": "Yôsuke Kubozuka",
      "character": "Takao nanbu"
    },
    {
      "id": "nm5219300",
      "name": "Matsuyû",
      "character": ""
    },
    {
      "id": "nm1515422",
      "name": "Megumi",
      "character": ""
    },
    {
      "id": "nm0597390",
      "name": "Kaori Momoi",
      "character": "Hiroko Tada"
    },
    {
      "id": "nm5954647",
      "name": "May Pakdee",
      "character": ""
    },
    {
      "id": "nm6514851",
      "name": "Mei Sakura",
      "character": ""
    },
    {
      "id": "nm3463654",
      "name": "Yukari Shiomi",
      "character": ""
    },
    {
      "id": "nm0855429",
      "name": "Shinobu Terajima",
      "character": "Michiko Hada"
    },
    {
      "id": "nm4579365",
      "name": "Junki Tozuka",
      "character": ""
    },
    {
      "id": "nm0948897",
      "name": "Kôtarô Yoshida",
      "character": ""
    }
  ],
  "overview": "Through round after round of extensive plastic surgery and vigorous maintenance, Ririko has become the absolute manifestation of beauty, and becomes a wildly successful model, actress, and singer. However, soon, her body, unable to withstand the burdens of surgery, begins to crumble, and along with it so does her mind, as she plummets towards a frightening and inevitable end.",
  "storyline": "Top star Lilico undergoes multiple cosmetic surgeries to her entire body. As her surgeries show side effect, Lilico makes the lives of those around her miserable as she tries to deal with her career and her personal problems.",
  "plot": "Supermodel Liliko (りりこ, Ririko?) has undergone full body plastic surgery to attain the perfect body and face in order to stay on top of the modeling world. However, her body begins to break down as an effect of the treatments and she grows desperate and unhinged, lashing out at first to her manager, Hiroko Tada (alias Mom) and agency and later to the public as she realizes that her current lifestyle cannot last long. The matter is made worse when Tada introduces Liliko to Kozue Yoshikawa whose natural beauty and friendly demeanor makes her a popular fashion icon to women all around. The process of her popularity makes Liliko more unhinged and fearful that she will fade to obscurity. In an attempt to stay ahead, Liliko forces her overly stressed out assistant, Michiko Hada, and her boyfriend to sabotage Kozue.\n\nMeanwhile, an inspector investigating a series of mysterious suicides and organ theft believes that Liliko and her unnatural beauty may be the key to unearthing an underground industry of unsafe medical practice and save lives. Spending time with her less attractive younger sister, Chiharu, the inspector is given a photo of what she used to look like. He is able to meet with Liliko with a warning that she may not be able to keep hiding behind her unnatural beauty forever. Eventually Liliko meets with Chiharu discussing her problems at school. Liliko sefishly suggests that her sister lose weight by getting a full body makeover with plastic surgery done to her. This makes Chiharu uncomfortable about it and makes her realize that the Liliko she once remembered is gone. She meets with the inspector again who sympathetically suggests she goes for a more natural approach by exercising and eating healthier.\n\nTada talks to Kozue in what she wants to do five years and if she plans to keep modeling. To her surprise, Kozue admits that she actually looks forward to having a normal, obscure life and doesn't really care if anyone remembers her or not. Later on, Tada has a talk with the makeup artist who had long worked for her agency and Kozue learns Liliko's dark secret in having plastic surgery. Although she doesn't say anything about it, trouble is in the horizon.\n\nAfter losing her job and her boyfriend ending their relationship, Hada had enough of Liliko's manipulation and cruelty towards her. Out of spite and revenge, she sends every information of Liliko's dirty secrets to tabloid magazines everywhere. Hada's exposure brings trouble to Liliko, Tada's modeling agency, and the hospital. Soon everyone starts spurning Liliko by deriding her as a fake for her actions against her assistant, sabotage against Kozue and hiding what she used to look like underneath her fake body. Despite Tada's best efforts, upon realizing how much no one loves her, Liliko decides to destroy herself during a press conference. She seemingly disappears from the spotlight after that.\n\nFive years later, Kozue is now the top supermodel and the hospital has been further investigated. Tada's agency has shut down as the result of losing her models to the controversy surrounding her involvement with the hospital. The investigator has been transferred to another department where he encounters Chiharu who is more attractive as the result of plastic surgery. While partying with her makeup artist and friends after a photo shoot in Mexico, Kozue spies Tada for a moment before disappearing. She heads down to the room where she is face to face with Liliko who is wearing an eye-patch covering her left eye.",
  "synopsis": null
}