{
  "imdb_id": "tt2193215",
  "tmdb_id": "109091",
  "douban_id": null,
  "title": "The Counsellor (2013)",
  "genres": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "117 min",
      "description": ""
    },
    {
      "runtime": "138 min",
      "description": "unrated extended cut"
    }
  ],
  "imdb_rating": 5.3,
  "director": [
    {
      "id": "nm0000631",
      "name": "Ridley Scott"
    }
  ],
  "writer": [
    {
      "id": "nm0565092",
      "name": "Cormac McCarthy",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm1055413",
      "name": "Michael Fassbender",
      "character": "Counselor"
    },
    {
      "id": "nm0004851",
      "name": "Penélope Cruz",
      "character": "Laura"
    },
    {
      "id": "nm0000139",
      "name": "Cameron Diaz",
      "character": "Malkina"
    },
    {
      "id": "nm0000849",
      "name": "Javier Bardem",
      "character": "Reiner"
    },
    {
      "id": "nm6053309",
      "name": "Cesar Aguirre",
      "character": "Truck Driver #1       (as César Aguirre)"
    },
    {
      "id": "nm0390486",
      "name": "Daniel Holguín",
      "character": "Truck Driver #2       (as Daniel Holguin)"
    },
    {
      "id": "nm1259158",
      "name": "Chris Obi",
      "character": "Malkina's Bodyguard"
    },
    {
      "id": "nm0004486",
      "name": "Bruno Ganz",
      "character": "Diamond Dealer"
    },
    {
      "id": "nm3450051",
      "name": "Richard Cabral",
      "character": "Young Biker"
    },
    {
      "id": "nm3842446",
      "name": "Provence Maydew",
      "character": "Woman in Grocery Store"
    },
    {
      "id": "nm0000093",
      "name": "Brad Pitt",
      "character": "Westray"
    },
    {
      "id": "nm0420219",
      "name": "Paris Jefferson",
      "character": "Waitress"
    },
    {
      "id": "nm3520393",
      "name": "Dar Dash",
      "character": "Barman"
    },
    {
      "id": "nm0001609",
      "name": "Rosie Perez",
      "character": "Ruth"
    },
    {
      "id": "nm3727971",
      "name": "Alex Hafner",
      "character": "Highway Patrolman"
    },
    {
      "id": "nm3342825",
      "name": "Andrea Deck",
      "character": "Watching Girl"
    },
    {
      "id": "nm0819874",
      "name": "Sam Spruell",
      "character": "Wireman"
    },
    {
      "id": "nm1527905",
      "name": "Toby Kebbell",
      "character": "Tony"
    },
    {
      "id": "nm2050746",
      "name": "Emma Rigby",
      "character": "Tony's Girlfriend"
    },
    {
      "id": "nm1183149",
      "name": "Edgar Ramírez",
      "character": "Priest"
    },
    {
      "id": "nm2940429",
      "name": "Eben Young",
      "character": "Bike Clerk"
    },
    {
      "id": "nm0104114",
      "name": "Richard Brake",
      "character": "Second Man"
    },
    {
      "id": "nm0244167",
      "name": "Barbara Durkin",
      "character": "Cafe Waitress"
    },
    {
      "id": "nm0264857",
      "name": "Giannina Facio",
      "character": "Woman with Mobile Phone"
    },
    {
      "id": "nm0867677",
      "name": "Velibor Topic",
      "character": "Sedan Man"
    },
    {
      "id": "nm0735943",
      "name": "Juan José Rodríguez",
      "character": "Junkyard Man       (as Juan José Rodriguez)"
    },
    {
      "id": "nm2099459",
      "name": "Alexander Biggie",
      "character": "Junkyard Boy #1"
    },
    {
      "id": "nm2824925",
      "name": "Pablo Paredes",
      "character": "Junkyard Boy #2"
    },
    {
      "id": "nm6026267",
      "name": "Cavassa Ventura",
      "character": "Third Man Killer"
    },
    {
      "id": "nm0816874",
      "name": "Frank Spano",
      "character": "Man with Bar"
    },
    {
      "id": "nm1468321",
      "name": "Alejandro Marzal",
      "character": "Man with Pistol"
    },
    {
      "id": "nm6235536",
      "name": "Kolya Dam De Nogales",
      "character": "Scared Boy"
    },
    {
      "id": "nm3379590",
      "name": "William Henry Mulvihill",
      "character": "Scared Boy 2       (as William Mulvihill)"
    },
    {
      "id": "nm1828986",
      "name": "John Hugill",
      "character": "Scared Dad"
    },
    {
      "id": "nm1456647",
      "name": "Gerard Monaco",
      "character": "Hotel Waiter"
    },
    {
      "id": "nm0147308",
      "name": "Fernando Cayo",
      "character": "Abogado"
    },
    {
      "id": "nm0606487",
      "name": "Dean Norris",
      "character": "Buyer"
    },
    {
      "id": "nm1711674",
      "name": "Carlos Julio Molina",
      "character": "Workman"
    },
    {
      "id": "nm0001952",
      "name": "Rubén Blades",
      "character": "Jefe"
    },
    {
      "id": "nm0014756",
      "name": "Donna Air",
      "character": "Chauffeur"
    },
    {
      "id": "nm1754059",
      "name": "Natalie Dormer",
      "character": "Blonde"
    },
    {
      "id": "nm2146281",
      "name": "Marco Tulio Luna",
      "character": "Cafe Man       (as Marco Tulio Luna Ramirez)"
    },
    {
      "id": "nm3424321",
      "name": "Lidia Cardona",
      "character": "Mourning Lady       (as Lida Cardona)"
    },
    {
      "id": "nm4962541",
      "name": "Roger Dalmases",
      "character": "Delivery Boy"
    },
    {
      "id": "nm2135316",
      "name": "Julien Vialon",
      "character": "Maitre'd"
    },
    {
      "id": "nm0899681",
      "name": "Goran Visnjic",
      "character": "Banker"
    }
  ],
  "overview": "A rich and successful lawyer named Counselor is about to get married to his fiancée but soon meets up with the middle-man known as Westray who tells him his drug trafficking plan has taken a horrible twist and now he must protect himself and his soon bride-to-be lover as the truth of the drug business uncovers and targets become chosen.",
  "storyline": "A rich and successful lawyer, the Counselor, is about to get married to his fiancée but soon becomes entangled in a complex drug plot with a middle-man known as Westray. The plan ends up taking a horrible twist and he must protect himself and his soon to be bride as the truth of the drug business is uncovered and targets are eliminated.",
  "plot": "A high-level cartel lawyer (never addressed by any name except as \"the Counselor\") and his girlfriend Laura are talking sexily in bed. Meanwhile, somewhere in Mexico, cocaine is packaged in barrels and concealed in a sewage truck, driven across the border and stored at a sewage treatment plant.\n\nAfter the Counselor goes to Amsterdam to meet with a diamond dealer to purchase an engagement ring for Laura, he proposes and she accepts. At a party back in Texas thrown by Reiner and girlfriend Malkina, a former call girl with a greedy lust for money, the Counselor discusses a nightclub he and Reiner intend to run, as well as an upcoming drug deal, which would be his first.\n\nThe Counselor meets with Westray, a business associate of Reiner's. He hears of the deal's four-thousand percent return rate, but Westray warns the Counselor about becoming involved, saying that Mexican cartels are merciless. The Counselor remains outwardly confident and unconcerned.\n\nMalkina gains knowledge of the deal through her access to Reiner and by conveniently overhearing various intercoms in Reiner's home. Reiner describes an execution device called \"the bolito\" which gradually strangles and decapitates the victim. Reiner also tells the Counselor how disturbed and oddly aroused he was from an incident where he witnessed Malkina masturbate with his Ferrari California's windshield.\n\nThe Counselor visits a client, a prison inmate named Ruth who is on trial for murder. Ruth's son is a biker and a valued cartel member known as \"the Green Hornet,\" recently arrested for speeding. The Counselor agrees to bail him out of jail.\n\nMalkina senses an opportunity to undermine the Counselor's upcoming deal and to profit for herself. She employs \"the Wireman\" to steal the drugs. He decapitates the biker, Ruth's recently released son, with a wire stretched across the highway. Then the Wireman steals the truck containing the cocaine.\n\nLearning of the theft, Westray meets with the Counselor to notify him that the biker is dead and the cocaine stolen, bleakly intoning the Counselor's culpability. Westray says he is leaving town immediately and suggests the Counselor do the same. Westray explains that the cartel's ruthlessness extends to creating \"snuff films\" where murder victims are filmed having necrophilia performed on them on camera. The Counselor makes an urgent call to Laura, arranging to meet her in another state, where he will explain.\n\nThe cartel has learned that the Counselor bailed out the Green Hornet, which appears as suspicious timing and fully blameworthy for the punitive purposes of the cartel. In Texas, two cartel members pretending to be police officers pull over the Wireman and his accomplice, killing both and also gunning down an innocent driver who comes upon the scene.\n\nReiner is accidentally killed by cartel members while they are attempting to capture him. The cartel then kidnaps Laura. In a last-ditch effort, The Counselor contacts Jefe, a high-ranking cartel member, for suggestions on what to do next. Jefe darkly and mordantly advises the Counselor to resign himself to the choices he made long beforehand.\n\nThe Counselor goes to Mexico, hoping to find and rescue Laura there. A package is slipped under the door of his hotel room and in it he finds a DVD with \"Hola!\" written on it, breaking down in heavy sobs at the awareness that the disk likely contains a snuff film of Laura sent by the cartel. Laura's headless body is dumped into a landfill.\n\nMalkina's failed effort to steal the drugs does not deter her. She tracks Westray to London, where she hires a blonde woman to seduce him and steal his bank codes. She then has accomplices steal Westray's laptop, and he is killed with the \"bolito\" device that Reiner had previously described. Malkina then meets her banker at a restaurant, coolly explaining how she wants her profits and accounts to be handled.",
  "synopsis": "The movie begins with Counselor (Michael Fassbender) and his girlfriend Laura (Penélope Cruz) in bed engaging in sexual activity and then switches back and forth to another scene where Mexicans are concealing cocaine in a sewerage truck.Counselor then goes to Amsterdam for \"business\", but he is really going there to buy Laura a diamond ring because he intends proposing to her.Later, Counselor meets with Reiner (Javier Bardem) who influences the Counselor to get involved in drug trafficking to make a substantial amount of money. Counselor agrees with Reiner and a meeting is organised with Westray (Brad Pitt), a business associate of Reiner, to get the ball rolling.Westray explains to the Counselor the severe consequences that could ensue as a result of getting into bed with the Mexican cartel. However, Counselor is keen to continue on with the drug deal.The Counselor then visits Ruth (Rosie Perez), a client in prison, at her request. At the meeting, Ruth notifies the Counselor of her son (Richard Cabral) who has been imprisoned for speeding on his motorbike. Ruth also outlines to the Counselor that Richard was caught with $12,000, but she does not know where the money came from and what further charges were laid against Richard. Counselor assures Ruth that he will get Richard out of prison as a favour for her.However, little does Counselor know that Richard possesses an engine component, held inside his bike helmet, which operates the sewerage truck holding the cocaine.In the next scene, Reiner and Counselor have a lengthy conversation regarding Reiner's girlfriend Malkina (Cameron Diaz). Reiner explains to Counselor that although he loves Malkina, he is also afraid of her because of her unpredictable and questionable behaviour.Unsurprisingly to the viewer, we see Malkina chatting with \"the Wireman\" (Sam Spruell) whereby her intentions are revealed - to follow Richard (who holds the component to the truck containing the cocaine) and obtain the component.In a brutal killing scene, Wireman beheads Richard and obtains the component and the truck containing the cocaine. Later on, Wireman is stopped by some men in a police car, however, Wireman is cautious and suspects the 'police' to really be the Mexican drug cartel wanting their cocaine back. Wireman's suspicions lead his partner to initiate a shootout: one member of the cartel is killed and his partner manages to kill both Wireman and his partner thereby re-securing the drugs stolen from the cartel.Nevertheless, the cartel is out for blood because somebody stole their cocaine. Unfortunately for the Counselor, all clues lead to him given that he was the lawyer who 'represented' and got Richard out of jail. The Westray opines that the cartel view this as no coincidence and that Counselor had a part to play in the attempted robbery of the cartel's cocaine.Subsequently, the cartel initiates a mental breakdown of the Counselor and kidnap his girlfriend Laura. Meanwhile, Reiner is killed in a gunfight with the cartel because his girlfriend, Malkina, who was really the person behind the attempted robbery of the cocaine, is short of money.Malkina decides to escape the cartel and go after Westray, who, after discovering the messy situation, fled to London. Malkina tracks down Westray and hires an American girl to seduce him and acquire his computer password, bank account details etc which she does successfully.Malkina hires more men to kill Westray using a self-tightening 'suicide collar' and acquire his computer in one of the most brutal killings in a movie. Malkina then expresses to her banker her intentions to move to Hong Kong.As for Counselor, he contacts a man by the name of \"Jefe\" (Rubén Blades), a high ranking cartel member, to try and track down Laura. However, Jefe refuses, and merely explains to the Counselor that his fate was sealed as soon as he made the decision to initiate the drug trafficking and implies to Counselor that instead of trying to fix his mistakes, he should rather accept his fate.Counselor has a breakdown and in the next scene we see the Counselor take delivery of a DVD with the word \"Hola!\" which implies it is a \"snuff film\" of his girlfriend Laura being brutally murdered by the cartel."
}