{
  "imdb_id": "tt2100575",
  "tmdb_id": "79067",
  "douban_id": null,
  "title": "Lost Place (2013)",
  "genres": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "101 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.4,
  "director": [
    {
      "id": "nm4900471",
      "name": "Thorsten Klein"
    }
  ],
  "writer": [
    {
      "id": "nm4900471",
      "name": "Thorsten Klein",
      "description": "written by &"
    },
    {
      "id": "nm2681561",
      "name": "Lena Vurma",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm1307426",
      "name": "François Goeske",
      "character": "Daniel"
    },
    {
      "id": "nm1715205",
      "name": "Jytte-Merle Böhrnsen",
      "character": "Elli"
    },
    {
      "id": "nm1460749",
      "name": "Pit Bukowski",
      "character": "Thomas"
    },
    {
      "id": "nm1011962",
      "name": "Josefine Preuß",
      "character": "Jessica"
    },
    {
      "id": "nm0851458",
      "name": "Anatole Taubman",
      "character": "Falk Geisinger"
    },
    {
      "id": "nm2550335",
      "name": "Björn Bugri",
      "character": "Cop"
    },
    {
      "id": "nm3680078",
      "name": "Georg Kammerer",
      "character": "Cop"
    },
    {
      "id": "nm0248591",
      "name": "Rike Eckermann",
      "character": "Innkeeper"
    },
    {
      "id": "nm8778133",
      "name": "Oliver Koch",
      "character": "(voice)"
    },
    {
      "id": "nm2407991",
      "name": "Jenny Bins",
      "character": "(voice)"
    }
  ],
  "overview": "While on a GPS treasure hunt in the Palatinate forest four teenagers come across an old US military radio tower station. Back in the days of the Cold War it was part of a secret military program that produced horrific side effects, but has long since abandoned. Until now, when the station is mysteriously powered up again.",
  "storyline": "While on a GPS treasure hunt in the Palatinate forest four teenagers come across an old US military radio tower station. Back in the days of the Cold War it was part of a secret military program that produced horrific side effects, but has long since abandoned. Until now, when the station is mysteriously powered up again.",
  "plot": "Dan Mulligan (Mark Ruffalo) is a formerly successful record label executive living in New York City who is estranged from his wife Miriam (Catherine Keener) and struggling to keep up with the changing music industry. After being fired from his job, he goes on a drinking binge which leads him to a bar in the Lower East Side where he encounters Gretta James (Keira Knightley). Gretta is a young and fiercely independent songwriter who has just broken up with her long-time boyfriend and songwriting partner Dave Kohl (Adam Levine), a newly successful musician who had an affair with one of his producers' assistants. Captivated by Gretta's music, Dan offers her to sign her to his former record label, and although she initially refuses she reconsiders the offer and agrees.\n\nDan and Gretta meet with Saul, Dan's business partner and co-founder of their record label, but he does not see the same potential in Gretta and turns her away. Undeterred, Dan proposes that he and Gretta produce their own album together, to be recorded live during the summer at various public locations around New York City. Recruiting a team of talented musicians, including Gretta's best friend Steve, Dan sets out to make an album worthy of being published by his label. During this time, Dan and Gretta bond both personally and professionally, and Gretta takes Dan's teenage daughter Violet, a fledgling guitarist, under her wing and encourages her to play on the album. When the album is finished, Dan and Gretta meet again with Saul, who is very impressed with their collaboration. Gretta demands that Saul give Dan his job back and give her a bigger share in the deal. They leave without reaching an agreement, but Dan feels confident that Saul will eventually sign Gretta to the label.\n\nWhen Gretta sees Dave accepting an award on television, she criticizes him for selling out to the music industry and she expresses her grievances with him in a song which she records on his voice mail. A remorseful Dave, who is back in New York to promote his new album, returns her call and asks to see her. After some consideration, she decides to meet with him and they critique each other's albums. Gretta feels betrayed by Dave's heavily commercialized rendition of \"Lost Stars,\" a love ballad she had once written and composed for him as a Christmas present, believing that the true meaning of the song has been lost. Dave tells her that the audiences love when he plays it in the new way, and that their energy fills the room. He believes that music is about sharing it with people, but Gretta tells him that's not what she intended for that song. Nevertheless, Dave invites her to come and hear him play the song at the Gramercy Theatre that weekend so that she can see the impact it has had on his fans. She arrives at the venue just in time to watch him play her original arrangement of the song, but as the song crescendos Dave segues into his own rendition. After tearfully watching him play and seeing the reaction of the crowd to the song, Gretta leaves the concert and cycles through the city with a smile slowly dawning on her face.\n\nAfterwards, Gretta visits Dan at his apartment as he prepares to move back home, having made amends with his wife. She tells him that she does not want him to release her album, instead preferring to distribute it online for $1. Although Dan returns to work with Saul, he agrees to let Gretta release the album online and helps her to promote the release. The next day, Saul jokingly fires Dan for promoting Gretta's album and informs him that it sold 10,000 copies in its first day of release.",
  "synopsis": null
}