{
  "imdb_id": "tt2218003",
  "tmdb_id": "146223",
  "douban_id": null,
  "title": "Closed Circuit (2013)",
  "genres": [
    "Crime",
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "96 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm1259871",
      "name": "John Crowley"
    }
  ],
  "writer": [
    {
      "id": "nm1140275",
      "name": "Steven Knight",
      "description": "screenplay as Steve Knight"
    }
  ],
  "cast": [
    {
      "id": "nm0516693",
      "name": "Kate Lock",
      "character": "Mother"
    },
    {
      "id": "nm4113365",
      "name": "Katherine Press",
      "character": "Pregnant Daughter"
    },
    {
      "id": "nm5529001",
      "name": "Patrick Warner",
      "character": "Young Man on Cellphone"
    },
    {
      "id": "nm1635501",
      "name": "Ricky Nixon",
      "character": "Fish Trader"
    },
    {
      "id": "nm1264590",
      "name": "Daniel Tuite",
      "character": "Drinks Trader"
    },
    {
      "id": "nm4856223",
      "name": "Zora Bishop",
      "character": "Mother of Toddler"
    },
    {
      "id": "nm5247135",
      "name": "Vicky Jam",
      "character": "Teenage Girl"
    },
    {
      "id": "nm2013934",
      "name": "Zahra Ahmadi",
      "character": "Woman on Cellphone"
    },
    {
      "id": "nm1061647",
      "name": "Steve North",
      "character": "Angry Trader       (as Stephen North)"
    },
    {
      "id": "nm0608324",
      "name": "Denis Moschitto",
      "character": "Farroukh Erdogan"
    },
    {
      "id": "nm1802004",
      "name": "Pinar Ögün",
      "character": "Ilkay Erdogan"
    },
    {
      "id": "nm5738932",
      "name": "Hasancan Cifci",
      "character": "Emir Erdogan"
    },
    {
      "id": "nm0369854",
      "name": "Andrew Havill",
      "character": "News Reporter 1"
    },
    {
      "id": "nm2547340",
      "name": "James Lowe",
      "character": "Simon Fellowes"
    },
    {
      "id": "nm0000980",
      "name": "Jim Broadbent",
      "character": "Attorney General"
    },
    {
      "id": "nm0402103",
      "name": "John Humphrys",
      "character": "Himself       (as John Humphreys)"
    },
    {
      "id": "nm0051509",
      "name": "Eric Bana",
      "character": "Martin Rose"
    },
    {
      "id": "nm5433785",
      "name": "Nazaire Gbolo",
      "character": "Belmarsh Guard 2"
    },
    {
      "id": "nm0796287",
      "name": "David Sibley",
      "character": "Vicar"
    },
    {
      "id": "nm0356017",
      "name": "Rebecca Hall",
      "character": "Claudia Simmons-Howe"
    },
    {
      "id": "nm0001354",
      "name": "Ciarán Hinds",
      "character": "Devlin"
    },
    {
      "id": "nm0186469",
      "name": "Kenneth Cranham",
      "character": "Cameron Fischer"
    },
    {
      "id": "nm1981893",
      "name": "Riz Ahmed",
      "character": "Nazrul Sharma"
    },
    {
      "id": "nm0020464",
      "name": "Doug Allen",
      "character": "Ryan"
    },
    {
      "id": "nm0694121",
      "name": "Jemma Powell",
      "character": "Elizabeth"
    },
    {
      "id": "nm3652842",
      "name": "Isaac Hempstead Wright",
      "character": "Tom Rose"
    },
    {
      "id": "nm1568589",
      "name": "Luing Andrews",
      "character": "Belmarsh Guard"
    },
    {
      "id": "nm0005466",
      "name": "Julia Stiles",
      "character": "Joanna Reece"
    },
    {
      "id": "nm0195937",
      "name": "Neil D'Souza",
      "character": "Iqbal"
    },
    {
      "id": "nm0240359",
      "name": "Anne-Marie Duff",
      "character": "Melissa"
    },
    {
      "id": "nm0090469",
      "name": "Barbora Bobulova",
      "character": "Piccola"
    },
    {
      "id": "nm5167147",
      "name": "Dexter Galang",
      "character": "Chinese Waiter"
    },
    {
      "id": "nm0151187",
      "name": "Jonathan Chan-Pensley",
      "character": "Chinese Chef"
    },
    {
      "id": "nm0191639",
      "name": "Matthew Cullum",
      "character": "Safe House Security Man"
    },
    {
      "id": "nm2977699",
      "name": "Sam Woodward",
      "character": "MI5 Agent"
    },
    {
      "id": "nm2102207",
      "name": "Ben Loyd-Holmes",
      "character": "MI5 Jogger"
    },
    {
      "id": "nm2064986",
      "name": "Robert McCafferty",
      "character": "Football Steward"
    },
    {
      "id": "nm0942202",
      "name": "Angus Wright",
      "character": "Andrew Altman"
    },
    {
      "id": "nm0027957",
      "name": "Adjoa Andoh",
      "character": "News Reporter 2"
    },
    {
      "id": "nm1644286",
      "name": "Adam Tedder",
      "character": "Court Clerk"
    },
    {
      "id": "nm2054580",
      "name": "Munir Khairdin",
      "character": "Indian Restaurant Manager"
    },
    {
      "id": "nm0694733",
      "name": "Huseyin Poyraz",
      "character": "Older Turkish Restaurant Man"
    },
    {
      "id": "nm2688024",
      "name": "Hemi Yeroham",
      "character": "Turkish Restaurant Man"
    },
    {
      "id": "nm1052263",
      "name": "Baris Celiloglu",
      "character": "Mine Kemmal"
    }
  ],
  "overview": "A terrorist attack in London results in the capture of suspect Farroukh Erdogan (Denis Moschitto). The attorney general appoints Claudia Simmons-Howe (Rebecca Hall) as special advocate on Erdogan's legal team. On the eve of the trial, Erdogan's lawyer dies, and a new defense attorney, Martin Rose (Eric Bana), steps in. Martin and Claudia are former lovers, a fact which must remain hidden. As Martin assembles his case, he uncovers a sinister conspiracy, placing him and Claudia in danger.",
  "storyline": "It was a typical morning in London when a powerful bomb exploded in the heart of the city. After the smoke cleared, sole surviving terrorist cell member Farroukh Erdogan (Denis Moschitto) was quickly taken into custody. As preparations for his trial begin, however, the government's plan to use classified evidence to prosecute the suspect leads the Attorney General (Jim Broadbent) to appoint Special Advocate Claudia Simmons-Howe (Hall) to the case. Claudia's unique position as a government-approved defense lawyer ensures that she can review the top-secret evidence, and advocate for full disclosure during the inevitable \"closed\" session portion of the trial. Once Claudia has reviewed the evidence, however, any communication with the defense team and the defendant himself is strictly forbidden. Later, When Erdogan's lawyer dies just before the trial begins, Claudia's driven ex-lover, attorney Martin Rose (Bana), takes his place. Realizing that their previous affair could jeopardize their...",
  "plot": "A bomb planted in a lorry detonates in London's Borough Market killing 120 people. The London police receive an anonymous tip and arrest Farroukh Erdogan, a Turkish immigrant, as the terror cell leader and mastermind of the attack. Two other members of the cell die in the bombing and the fourth is killed by police in a shoot-out during the raid to apprehend him. When Erdogan's Defense Barrister commits suicide, Martin Rose is appointed by the Attorney General to replace him, joining Special Advocate Claudia Simmons-Howe. Due to national security concerns, Erdogan's case follows closed material procedures; Claudia represents Erdogan during closed sessions with a judge ruling what evidence is permissible for Martin to use in the open public trial. MI5 Agent Nazrul Sharma is assigned to provide Claudia with the closed material and monitor her activities.\n\nMartin discovers that despite his extensive criminal record, Erdogan was somehow quickly approved for immigration from his previous residence in Germany to England and within six months was living well beyond his income. He finds proof that Farroukh Erdogan is really Mussi Kartal, a member of a terror cell responsible for bombing a U.S. Air Force base in Munich a few years prior. Kartal cut a deal with prosecutors to avoid prison, agreeing to work as an informant for MI5 by infiltrating the London terror cell and providing MI5 with information to make arrests. Martin suspects that after the Borough Market bombing, MI5 feared their botched operation would be publicly blamed as directly financing terrorism and sought to have Kartal take the fall and suppress any evidence of MI5 involvement.\n\nIn the first closed court session, MI5 Agent Melissa Fairbright reveals that Kartal's son Amir had hacked into his father's laptop and had provided valuable information to MI5. The judge orders Amir's testimony in court, deeming it relevant to the case. Amir, who is being monitored by MI5 agents at a safe house with his mother, manages to escape to his aunt's home. He meets with Martin and Claudia, giving them a flash drive detailing his father's involvement with the MI5 terror cell operation. Martin and Claudia realize MI5 will kill Amir to protect themselves and go on the run with him overnight, planning to have him testify in court the next day. Amir testifies in closed session, but Kartal is later murdered in prison and made to look like a suicide by hanging. With Kartal dead, the case collapses and all evidence of the MI5 operation is suppressed from public disclosure. Amir and his mother, however, are allowed to remain in England.\n\nThree months later, as Martin and Claudia rekindle their romance that resulted in Martin's divorce from his wife, information of MI5's involvement in the Borough Market bombing is anonymously leaked to the media.",
  "synopsis": "Borough market in London can be seen via numerous closed circuit TV cameras, and we can hear snippets of conversations. A large truck is driven to the centre of the market as vendors yell that it cannot park there. It explodes.Scotland Yard raids a storage garage and finds the chemicals that made the bomb. They arrest the owner of the garage in front of his wife and 14 year-old child. He is to be tried in public by one barrister, however a private hearing will be held to determine what government evidence will be permitted to be used. If the evidence will compromise the state's terrorism investigations, it will be withheld from the public hearing.At a funeral for a barrister, we learn that the deceased (Simon) was to represent the terrorist at the upcoming public hearing, but committed suicide. He is being replaced by Martin Rose (Eric Bana). Martin is recently divorced because he was caught having an affair with Claudia Simmons-Howe (Rebecca Hall). They have since broken up.Claudia will be representing the terrorist's interests in the private hearing. The 2 are not to have any contact with each other once the confidential government information is shown to Claudia so as not to compromise the public trial.A reporter from the New York Times arranges for a mutual friend to invite Martin to a party, where she suggests to him that Simon's death may not have been suicide.Martin notices that the same taxi picks him up whenever he hails a cab. He goes over Simon's files, and finds that:The terrorist was arrested in Germany for heroin possession, but was able to emigrate to England without standingtrial.\nThe terrorist drives a swanky Mercedes.He called the person that rented the garage, and drove the truck to the market 27 times in the month prior to the bombing.He buys his heroin uncut - an expensive habitThe terrorist is not cooperating at all in the investigation - not even for his own defence.Simon died when his investigation reached this point.Martin discloses this to the NY Times reporter at a secret meeting, but they both feel others are watching.Martin arranges to meet Claudia secretly at a football match, and tells her his findings. He begs her not to bring this information up at the private trial, hoping to do it himself in public.At the trial, the judge decides to conduct the private hearing first. Claudia questions Melissa, an MI5 witness - who was at the party where Martin met the NY Times reporter. Claudia accuses MI5 of botching a sting operation, and planning a cover-up. Melissa avoids answering the questions. She does state that the secret informant is the terrorist's son. The judge says he will question the boy himself the next day at 10am.Martin is accosted by the Attorney General (Jim Broadbent), who warns him that he should just follow the easy path, and not bring MI5 into the trial. He implies that he was put on the case specifically because he had an affair with Claudia, and if any of her private information shows up in the public case, a mistrial would result on the assumption that they had met after she had seen the confidential government information. The terrorist would be found guilty, and would serve some time before getting out of jail and freed for his service.Walking out of the courthouse, Martin sees a newspaper headline that the reporter he met with has been found dead.Martin hails a cab (this time with a different number). The cab is hit by a truck, but Martin is only injured and goes to the hospital for a short time. He is again warned to back off.Martin warns Claudia that her life is in danger. She is jumped in her apartment, but fights off the attacker. They discover that the boy has escaped from the \"safe\" house where he was being held. From an earlier interview, Claudia believes he is hiding out at his Aunt's house. They head there, elude the shadowy people watching the house, and get the boy to a truly safe place for the night. He has a memory stick with all the information necessary to blame the situation on MI5.The next morning, the 3 are allowed to walk to the courthouse - all the time being watched. As they make their way into the courtroom, 2 people enter the terrorist's cell and strangle him. They rip his bedsheet to make a noose, and rig the cell to look like he has committed suicide.The judge is notified that the defendant is dead. He closes the trial before the boy can give any evidence.3 months later, we hear the opposition ripping strips off the Attorney General, accusing him of orchestrating a cover-up. Apparently word has leaked out about the situation despite all of MI5's efforts."
}