{
  "imdb_id": "tt2205401",
  "tmdb_id": "235271",
  "douban_id": null,
  "title": "Addicted (2014)",
  "genres": [
    "Drama",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "106 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.2,
  "director": [
    {
      "id": "nm0937306",
      "name": "Bille Woodruff"
    }
  ],
  "writer": [
    {
      "id": "nm0920530",
      "name": "Christina Welsh",
      "description": "screenplay and"
    },
    {
      "id": "nm0053228",
      "name": "Ernie Barbarash",
      "description": "screenplay"
    },
    {
      "id": "nm2268532",
      "name": "Zane",
      "description": "based on the novel by"
    }
  ],
  "cast": [
    {
      "id": "nm0462673",
      "name": "Boris Kodjoe",
      "character": "Jason Reynard"
    },
    {
      "id": "nm3057836",
      "name": "Brandon Gonzales",
      "character": "Tony"
    },
    {
      "id": "nm5386132",
      "name": "Cameron Mills",
      "character": "10-year-old Zoe"
    },
    {
      "id": "nm0639955",
      "name": "Daniel O'Callaghan",
      "character": "Chubby Businessman"
    },
    {
      "id": "nm1538675",
      "name": "Emayatzy Corinealdi",
      "character": "Brina"
    },
    {
      "id": "nm2584077",
      "name": "Garrett Hines",
      "character": "Benny"
    },
    {
      "id": "nm3363398",
      "name": "Hunter Burke",
      "character": "Shane"
    },
    {
      "id": "nm2010301",
      "name": "John Newberg",
      "character": "Balthazar Crayne"
    },
    {
      "id": "nm0334159",
      "name": "Kat Graham",
      "character": "Diamond       (as Katerina Graham)"
    },
    {
      "id": "nm6097572",
      "name": "Landon Runion",
      "character": "Peter Reynard"
    },
    {
      "id": "nm7071118",
      "name": "Lauren Marquez",
      "character": "Kayla Reynard"
    },
    {
      "id": "nm0398016",
      "name": "Maria Howell",
      "character": "Nina"
    },
    {
      "id": "nm3630223",
      "name": "Omer Mughal",
      "character": "Handsome Man"
    },
    {
      "id": "nm7071119",
      "name": "Paul Hall",
      "character": "Marley"
    },
    {
      "id": "nm0495095",
      "name": "Sharon Leal",
      "character": "Zoe Reynard"
    },
    {
      "id": "nm0810103",
      "name": "Tasha Smith",
      "character": "Dr. Marcella Spencer"
    },
    {
      "id": "nm0004734",
      "name": "Tyson Beckford",
      "character": "Corey"
    },
    {
      "id": "nm2126101",
      "name": "William Levy",
      "character": "Quinton Canosa"
    }
  ],
  "overview": "A gallerist risks her family and flourishing career when she enters into an affair with a talented painter and slowly loses control of her life.",
  "storyline": "Desire and the dangers of indiscretion. Successful businesswoman Zoe Reynard (Sharon Leal) appears to have attained it all - the dream husband she loves (Boris Kodjoe), two wonderful children and a flourishing career. As perfect as everything appears from the outside, Zoe is still drawn to temptations she cannot escape or resist. As she pursues a secretive life, Zoe finds herself risking it all when she heads down a perilous path she may not survive.",
  "plot": "On the outside Zoe Reynard (Sharon Leal) seems to have the perfect life. She has a perfect marriage to her husband Jason (Boris Kodjoe) and the couple share two kids. Despite this, Zoe is not happy in her marriage. After sex one night with her husband, Zoe is displeased that Jason was done&#160;; so she wakes up to watch porn and plays with a dildo. She attends an art show for a possibly new client to sign on with her company and runs into the artist of the show, Quinton Canosa (William Levy) and the two quickly share some flirtation. Later, Zoe goes over to his apartment for him to sign a contract but Canosa stops her and the two have sex. Despite Zoe trying to maintain her sanity, she could not resist Canosa's charms and the two have sex again when he takes her out to his special spot. The couple breaks up regularly but always inevitably end up getting back together. On one particular occasion, when Zoe goes to get back with Quinton, she finds him having sex with his next door neighbor.\n\nZoe, throughout the story, is telling this as a flashback to her psychotherapist, Dr. Marcella Spencer (Tasha Smith), who is treating her for sex addiction. After diagnosing her with sex addiction, Dr. Spencer assumes it might have been something from Zoe's past that keeps coming back to hurt her and pressures her to confess. However, each time she asks, Zoe avoids the question and walks out. Her addiction begins to take over her life and she soon begins to sleep with another man, Corey (Tyson Beckford), whom she met at a club. One day, when she comes home from work, she sees Corey at her home talking to her mother. Seeing the danger she had put her family into, Zoe decides that she wants to try to fix her marriage with her husband. She invites both Corey and Quinton to meet her at Quinton's apartment. Saying she does not want to say it twice, she breaks up with the two and through this they realize that she had been sleeping with both of them. Corey becomes angry and lunges at her, but Quinton blocks him. As Corey leaves, Quinton knocks him out with a vase. Zoe becomes afraid of him and tries to calm him down, but Quinton tells her that she is not going to leave him anymore. Frightened that he was walking closer, Zoe shoves a glass artwork between them, smashing it to pieces. Quinton walks straight over them, pulling bits of glass out of his feet. While hiding from Quinton, who is chasing after her with a palette knife, Jason suddenly appears and smashes a heart-shaped sculpture over Quinton's head and saves Zoe before leaving. Zoe runs after Jason, apologizing profusely but he rejects her, telling her he does not want to be with a 'lying, cheating whore.' and for him she is dead. Out of desperation, Zoe walks out in front of car, injuring herself. The two split up and Jason stays in a hotel. Zoe becomes a recluse but soon goes to a sex addiction group therapy session. It is discovered that the root of Zoe's addiction was a rape committed by three boys earlier in her life when she was 10 years old. At the session she speaks of her deep love for her husband and Jason walks into the session. He kisses and accepts her back.",
  "synopsis": null
}