{
  "imdb_id": "tt2202928",
  "tmdb_id": "257244",
  "douban_id": null,
  "title": "Down River (2013)",
  "genres": [
    "Drama"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "93 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm0711838",
      "name": "Ben Ratner"
    }
  ],
  "writer": [
    {
      "id": "nm0711838",
      "name": "Ben Ratner",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0001726",
      "name": "Helen Shaver",
      "character": "Pearl"
    },
    {
      "id": "nm0588364",
      "name": "Gabrielle Miller",
      "character": "Fawn"
    },
    {
      "id": "nm0817780",
      "name": "Jennifer Spence",
      "character": "Aki"
    },
    {
      "id": "nm0719705",
      "name": "Colleen Rennison",
      "character": "Harper"
    },
    {
      "id": "nm0106319",
      "name": "Jay Brazeau",
      "character": "Larry"
    },
    {
      "id": "nm0335242",
      "name": "Teach Grant",
      "character": "Todd"
    },
    {
      "id": "nm1650932",
      "name": "Ali Liebert",
      "character": "Molly"
    },
    {
      "id": "nm0281759",
      "name": "Peter Flemming",
      "character": "Peter"
    },
    {
      "id": "nm0548498",
      "name": "Brian Markinson",
      "character": "Otto"
    },
    {
      "id": "nm0671886",
      "name": "Tahmoh Penikett",
      "character": "Chris"
    },
    {
      "id": "nm0118313",
      "name": "David Avalon",
      "character": "Murray       (as David-Paul Grove)"
    },
    {
      "id": "nm0014599",
      "name": "Stuart Aikins",
      "character": "Casting Director"
    },
    {
      "id": "nm3152621",
      "name": "Kevin House",
      "character": "Dooley"
    },
    {
      "id": "nm0803337",
      "name": "Nancy Sivak",
      "character": "Lili"
    },
    {
      "id": "nm0437032",
      "name": "Hiro Kanagawa",
      "character": "Aki's Father"
    },
    {
      "id": "nm0913682",
      "name": "Jerry Wasserman",
      "character": "Dr. Leonard"
    },
    {
      "id": "nm0564245",
      "name": "Tom McBeath",
      "character": "Bob"
    },
    {
      "id": "nm1479098",
      "name": "Loretta Walsh",
      "character": "Victoria"
    },
    {
      "id": "nm3666289",
      "name": "Kimberley Sustad",
      "character": "Christie       (as Kimberly Sustad)"
    },
    {
      "id": "nm7135662",
      "name": "Russell Kennedy",
      "character": "Blood Nurse"
    },
    {
      "id": "nm1583845",
      "name": "Malcolm Holt",
      "character": "Harper's Band"
    },
    {
      "id": "nm5159830",
      "name": "Parker Bossley",
      "character": "Harper's Band"
    },
    {
      "id": "nm7135663",
      "name": "Daniel Knowlton",
      "character": "Harper's Band"
    },
    {
      "id": "nm5923787",
      "name": "Nadia Vanessa Rose",
      "character": "Molly's New Girlfriend       (as Nadia Blanchfield)"
    },
    {
      "id": "nm7135664",
      "name": "Max Clement-Gale",
      "character": "Little Boy"
    },
    {
      "id": "nm1438320",
      "name": "Mike Branham",
      "character": "Harper's Dealer"
    },
    {
      "id": "nm7135665",
      "name": "Scott Marshal",
      "character": "Harper's Buddy"
    },
    {
      "id": "nm7135666",
      "name": "Ronan Boyle",
      "character": "Harper's Buddy"
    }
  ],
  "overview": "Down River is the emotionally stirring story of three young women teetering on the edge between creative breakthroughs and personal breakdowns, and their connection with the older woman they rely on for guidance, support and inspiration.",
  "storyline": "Three young women artists all live in the same building. Their guide in life is a neighbor named Pearl, a charismatic and caring older woman who inspires them to new heights. When Pearl unexpectedly leaves their lives, the three are forced to overcome their fears and face the future without the guidance they've come to rely on.",
  "plot": "In 1929, Nick Carraway, a World War I veteran, is receiving treatment for alcoholism at a psychiatric hospital. He talks about Jay Gatsby, the most hopeful man he had ever met. Nick's doctor suggests that he writes his thoughts down, since writing is Nick's passion.\n\nIn the summer of 1922, Nick moves from the Midwest to New York after abandoning writing. He rents a small house in the North Shore village of West Egg, next to the mansion of Gatsby, a mysterious business magnate who often holds extravagant parties. One day, while Nick has dinner with his cousin, Daisy Buchanan, and her husband, Tom, he is introduced to Jordan Baker by Daisy, who hopes to make a match between them. When Nick returns home, he sees Gatsby standing on the dock, reaching towards the green light coming from the Buchanan dock.\n\nJordan tells Nick that Tom has a mistress who lives in the \"valley of ashes\", an industrial dumping site between West Egg and New York City. Nick and Tom visit the valley and stop at a garage owned by George Wilson and his wife, Myrtle, who is Tom's mistress. Later, Nick receives an invitation to one of Gatsby's parties. Upon arrival, Nick learns he is the only one to receive an invitation and none of the guests have ever met Gatsby. Nick encounters Jordan, and both meet Gatsby. Gatsby offers Nick a ride to town for lunch. On the way, Gatsby tells Nick he is an Oxford graduate and war hero from a wealthy Midwestern family. They go to a speakeasy, where Gatsby introduces Nick to his business partner, Meyer Wolfsheim.\n\nJordan tells Nick that Gatsby had a relationship with Daisy years ago and is still in love with her, and that Gatsby threw parties in the hopes that Daisy would attend. Gatsby asks Nick to invite Daisy to tea. After an awkward reunion, Gatsby and Daisy begin an affair. Gatsby is dismayed when Daisy wants to run away with him and wants her to get a divorce. He asks Nick and Jordan to accompany him to the Buchanan home, where he and Daisy plan to tell Tom that Daisy is leaving him. During the luncheon, Tom becomes suspicious of Gatsby and Daisy, but Daisy stops Gatsby from revealing anything and suggests they all go to the Plaza Hotel. Tom drives Nick and Jordan in Gatsby's car, while Gatsby drives Daisy in Tom's car. Tom stops for gas at George's garage, where George tells him that he and Myrtle are moving and that he suspects Myrtle is unfaithful.\n\nAt the Plaza, Gatsby tells Tom of his affair with Daisy. Tom accuses Gatsby of having never attended Oxford and having made his fortune through bootlegging with mobsters. Daisy says she loves Gatsby but cannot bring herself to say she never loved Tom. Eventually, both Gatsby and Daisy leave. After a fight with George over her infidelity, Myrtle runs into the street and is fatally struck by Gatsby's car after mistaking it for Tom's. After learning about Myrtle's death, Tom tells George that the car belongs to Gatsby and that he suspects Gatsby was Myrtle's lover. Nick deduces Daisy was the driver, though Gatsby intends to take the blame. Nick overhears Daisy accepting Tom's promise to take care of everything, but he does not tell Gatsby. Gatsby admits to Nick that he was born penniless; his real name is James Gatz, and he had asked Daisy to wait for him until he had made something of himself.\n\nThe next morning, Gatsby hears the phone ringing and thinks it is Daisy. Before he can answer it, he is shot and killed by George, who then kills himself. Nick is the only person other than reporters to attend Gatsby's funeral, as Daisy and Tom are leaving New York. The media paints Gatsby as Myrtle's lover and killer. Disgusted with both the city and its inhabitants, Nick leaves after taking a final walk through Gatsby's deserted mansion and reflecting on Gatsby's ability to hope. In the sanatorium, Nick finishes typing his memoir and eventually titles it The Great Gatsby.",
  "synopsis": "Fawn (Gabrielle Miller) is an in-demand but insecure actress. While striving to honour her religious beliefs, she battles the uncertainty between living out her career opportunities and settling down to begin a family with the man she loves (Peter Flemming). Aki (Jennifer Spence) is a dynamic abstract artist who hides under her paint-stained hoodie. She has talent, but with a widowed father (Hiro Kanagawa) whose traditional values constantly undermine her, not to mention her struggle with her own crippling shyness, she finds herself resorting to drastic measures to make an impact on an art dealer (Brian Markinson). Harper (Colleen Rennison) is a gifted but self- destructive rock singer. Desperately trying to fill the void, she careens happily between drugs, a sugar daddy (Teach Grant) and the one that got away (Ali Liebert). Pearl (Helen Shaver) is a charismatic, caring older woman who lives in the same building as the three younger artists. Estranged from her own daughter, she takes Fawn, Aki, and Harper under her wing, keeping them on track and inspiring them to new heights, while sharing her own secret with only her kindhearted neighbour (Jay Brazeau) . When Pearl suddenly leaves their lives, the three women must summon the courage to overcome their fears and face the future on their own. Inspired by Ben Ratner's long-time comradeship with actress Babz Chula, who passed away in 2010, Down River is a film about mentorship, friendship, living life to the fullest, and ultimately letting go."
}