{
  "imdb_id": "tt2296893",
  "tmdb_id": "240615",
  "douban_id": null,
  "title": "Outsiders: Japan (2012)",
  "genres": [
    "Documentary"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "92 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.6,
  "director": [
    {
      "id": "nm4945336",
      "name": "Al Clark"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm4227786",
      "name": "Daniel Bridle",
      "character": "Himself"
    },
    {
      "id": "nm4944839",
      "name": "Pieter Gouwy",
      "character": "Himself"
    },
    {
      "id": "nm4945109",
      "name": "Phil Morrison",
      "character": "Himself"
    },
    {
      "id": "nm4945486",
      "name": "James Robinson",
      "character": "Himself"
    },
    {
      "id": "nm4945665",
      "name": "Mitto Steele",
      "character": "Himself"
    }
  ],
  "overview": "Join Phil Morrison and James Robinson from Driftworks, Mitto Steele from MeiNoMai and Pieter Gouwy from Garage Portello on a mind blowing tour of the real drift scene in Japan and the culture behind it.",
  "storyline": "A unique insight into the world of drifting in Japan. More than 20 years ago in the hills of Japan, the rules of driving began to be re-written. Over this time to the present, Japan has always been at the forefront of drifting. From the streets in the cities to the Touge passes in the mountains to the dedicated drifting circuits, one thing never changes - Drifting is fun. It is the reason every driver we met does it. Not for the fame or the glory, not for money, not for corporate support, but just pure thrills. See the guys visiting the whole of the south prefecture of Japan including Bihoku, Suzuka Twin and Meihan, plus the crazy city of Nagoya and the surrounding areas and much much more. We capture one of the most insane nights of street drifting for the first time using professional equipment at night. We visit some of the biggest (and smallest) shops in the business including Bee*R, Mind Control, Kids Heart, 326 Power and V-Factory. We hang out with D1 legends and current drivers...",
  "plot": null,
  "synopsis": null
}