{
  "imdb_id": "tt2290934",
  "tmdb_id": "128106",
  "douban_id": null,
  "title": "The Interval (2012)",
  "genres": [
    "Crime",
    "Drama"
  ],
  "country": "Italy",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm0182450",
      "name": "Leonardo di Costanzo"
    }
  ],
  "writer": [
    {
      "id": "nm2828827",
      "name": "Maurizio Braucci",
      "description": "story &"
    },
    {
      "id": "nm0182450",
      "name": "Leonardo di Costanzo",
      "description": "story"
    },
    {
      "id": "nm0182450",
      "name": "Leonardo di Costanzo",
      "description": "screenplay &"
    },
    {
      "id": "nm0053205",
      "name": "Mariangela Barbanente",
      "description": "screenplay &"
    },
    {
      "id": "nm2828827",
      "name": "Maurizio Braucci",
      "description": "screenplay"
    },
    {
      "id": "nm6477277",
      "name": "Antonio Calone",
      "description": "dialogue adaptation"
    }
  ],
  "cast": [
    {
      "id": "nm2954640",
      "name": "Salvatore Ruocco",
      "character": "Mimmo"
    },
    {
      "id": "nm5174990",
      "name": "Francesca Riso",
      "character": "Veronica"
    },
    {
      "id": "nm5174691",
      "name": "Alessio Gallo",
      "character": "Salvatore"
    },
    {
      "id": "nm2991708",
      "name": "Carmine Paternoster",
      "character": "Bernardino"
    },
    {
      "id": "nm0125663",
      "name": "Antonio Buíl",
      "character": "Padre di Salvatore"
    },
    {
      "id": "nm5251995",
      "name": "Jean-Yves Morard",
      "character": "Lo Slavo"
    }
  ],
  "overview": "A boy and a girl are locked in an enormous abandoned building in a rundown area. She is a prisoner and the local clan leader has forced him to be her warder. Despite their youth, both of them have grown up too fast. Veronica acts like a mature and open-minded woman whilst Salvatore is like a man who wants to hold on to his job and lead a quiet life. Thus, when faced with the violence of this incarceration, the two young people have different reactions: Veronica is restless and rebellious; Salvatore is more remissive and accommodating, either out of fear or realism. They are both victims but it is almost as though each blames the other for their reclusion. However, as the hours go by, their mutual hostility is transformed into an inevitable intimacy, consisting of reciprocal discoveries and confessions. Between the walls of that isolated and frightening place, Veronica and Salvatore fi nd a way to rekindle those adolescent dreams and ideas put aside too soon.",
  "storyline": "Because of an offense to a Camorra chief's neighborhood, the sixteen-year-old Veronica become hostage inside an abandoned building on the far outskirts of Naples, pending punishment. One to watch her is Salvatore, a timid fear and a clamor with which in the hours of waiting Veronica establishes a relationship of complicity and affection.",
  "plot": "Astronaut Jim Lovell hosts a house party where guests watch Neil Armstrong's televised first human steps on the Moon. Afterwards Lovell, who had orbited the Moon on Apollo 8, tells his wife Marilyn that he intends to return to the Moon to walk on its surface.\n\nThree months later, as Lovell conducts a VIP tour of NASA's Vertical Assembly Building, his boss Deke Slayton informs him that his crew will fly Apollo 13 instead of 14. Lovell, Ken Mattingly, and Fred Haise train for their new mission. A few days before launch, Mattingly is exposed to the measles, and the flight surgeon demands his replacement with Mattingly's backup, Jack Swigert. Lovell resists breaking up his team, but relents when Slayton threatens to bump his crew to a later mission. As the launch date approaches, Marilyn has a nightmare about her husband's safety, but goes to the Kennedy Space Center the night before launch to see him off.\n\nOn April 11, 1970, Flight Director Gene Kranz gives the go-ahead from Houston's Mission Control Center for the Apollo 13 launch. As the Saturn V rocket climbs through the atmosphere, a second stage engine cuts off prematurely, but the craft reaches its Earth parking orbit. After the third stage fires to send Apollo 13 to the Moon, Swigert performs the maneuver to connect the Command/Service Module Odyssey to the Lunar Module Aquarius and pull it away from the spent rocket.\n\nThree days into the mission, the crew makes a television transmission, which the networks decline to broadcast live. After Swigert turns on the liquid oxygen tank stirring fans as requested, one of the tanks explodes, emptying its contents into space and sending the craft tumbling. The other tank is soon found to be leaking. Mission Control aborts the Moon landing, and Lovell and Haise must hurriedly power up Aquarius to use as a \"lifeboat\" for the return home, as Swigert shuts down Odyssey before its battery power runs out. In Houston, Kranz rallies his team to come up with a plan to bring the astronauts home safely, declaring \"failure is not an option\". Controller John Aaron recruits Mattingly to help him invent a procedure to restart Odyssey for the landing on Earth.\n\nAs Swigert and Haise watch the Moon pass beneath them, Lovell laments his lost chance of walking on its surface, then turns their attention to the business of getting home. With Aquarius running on minimal electrical power, the crew suffers freezing conditions, and Haise contracts a urinary infection and a fever. Swigert suspects Mission Control is withholding their inability to get them home; Haise angrily blames Swigert's inexperience for the accident; and Lovell quickly squelches the argument. When carbon dioxide approaches dangerous levels, ground control must quickly invent a way to make the Command Module's square filters work in the Lunar Module's round receptacles. With the guidance systems on Aquarius shut down, the crew must make a difficult but vital course correction by manually igniting the Lunar Module's engine.\n\nMattingly and Aaron struggle to find a way to turn on the Command Module systems without drawing too much power, and finally transmit the procedure to Swigert, who restarts Odyssey by transferring extra power from Aquarius. When the crew jettisons the Service Module, they are surprised to see the extent of the damage. As they release Aquarius and re-enter the Earth's atmosphere, no one is sure that Odyssey's heat shield is intact. The tense period of radio silence due to ionization blackout is longer than normal, but the astronauts report all is well and splash down in the Pacific Ocean.\n\nAs helicopters bring the three men aboard the recovery ship USS Iwo Jima for a hero's welcome, Lovell's voice-over describes the subsequent investigation into the explosion, and the careers of Haise, Swigert, Mattingly, and Kranz. He wonders if and when mankind will return to the Moon.",
  "synopsis": null
}