{
  "imdb_id": "tt2265934",
  "tmdb_id": "258851",
  "douban_id": null,
  "title": "Blood Cousins (2012)",
  "genres": [
    "Comedy",
    "Drama",
    "Horror"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.7,
  "director": [
    {
      "id": "nm2959903",
      "name": "Regan Arevalos"
    },
    {
      "id": "nm5156105",
      "name": "Jess Castro"
    },
    {
      "id": "nm5157059",
      "name": "Larry Garza"
    }
  ],
  "writer": [
    {
      "id": "nm2959903",
      "name": "Regan Arevalos",
      "description": "writer"
    },
    {
      "id": "nm5156105",
      "name": "Jess Castro",
      "description": "writer"
    },
    {
      "id": "nm5157059",
      "name": "Larry Garza",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm5156443",
      "name": "Joel Settles",
      "character": "Stevie"
    },
    {
      "id": "nm2959903",
      "name": "Regan Arevalos",
      "character": "Ray"
    },
    {
      "id": "nm5157059",
      "name": "Larry Garza",
      "character": "Von"
    },
    {
      "id": "nm5156105",
      "name": "Jess Castro",
      "character": "Eric"
    },
    {
      "id": "nm0308965",
      "name": "Rodney Garza",
      "character": "Tio Lencho"
    },
    {
      "id": "nm5156982",
      "name": "Roy Lopez Jr.",
      "character": "Tio Carlos"
    },
    {
      "id": "nm4010381",
      "name": "Martina Griffin",
      "character": "Tia Dolores"
    },
    {
      "id": "nm1072239",
      "name": "Veronica Rodriguez",
      "character": "Young Pregnant Woman"
    },
    {
      "id": "nm2450005",
      "name": "Theo Gutierrez",
      "character": "Botanica Shopkeeper"
    },
    {
      "id": "nm5296115",
      "name": "Aaron Cheatham",
      "character": "Gas Station Clerk"
    },
    {
      "id": "nm3142367",
      "name": "Carla Gomez",
      "character": "Dairy Burger Waitress"
    },
    {
      "id": "nm4012263",
      "name": "Mari Rodriguez",
      "character": "Tia Mari"
    }
  ],
  "overview": "On the anniversary of their grandmother's death, four cousins, as close as brothers, reconnect on a road trip to the Texas Rio Grande Valley to pay respects to the woman who helped raise them. Hidden beneath their friendship, the truth of their childhood surfaces to reveal a darkness in the family that won't stop until the cousin's lives are changed forever.  Blending comedy, Mexican folklore and terror, Blood Cousins puts a new spin on revenge films and defines the word,'retribution'.",
  "storyline": "When the anniversary of their grandmother's death arrives, four cousins who are as close as brothers use it as an opportunity to reconnect on a road trip to the Texas Rio Grande Valley in an effort to pay their respects and visit distant relatives. As they close in on their destination, they learn about their family's shrouded past and uncover dark secrets that wearily tread the line between real issues and unreal powers. What begins as a long drive filled with laughter and memories ends in a chaotic culmination of past and present transgressions. In a film that blends comedy, Mexican folklore and terror - BLOOD COUSINS puts a new spin on the typical revenge film and defines the word, 'retribution'.",
  "plot": "Paul, a dissolute, profligate and jaded Parisian, takes in his naive, innocent and idealistic cousin Charles from the provinces who is something of a mama's boy while they both attend law school. Paul takes Charles to a club at which he meets the beautiful Florence, who has the reputation of being a slut because she has slept around with every man in Paul's circle of friends. She takes an interest in Charles, who knows nothing of her past, and he kisses and falls desperately in love with her.\n\nPaul refuses to study for their law-school exam, cavalierly boasting that he is smart enough to pass it without opening a book, while Charles studies frantically for it in order to make sure that he will not disappoint his mother, to whom he writes daily. But one day, through a misunderstanding, two hours before Charles had told Florence to meet him outside the law school after his class, she comes to meet him at Paul's flat. The only ones there are Paul and Clovis, a thoroughly corrupt friend of Paul's who operates as a kind of hustler, pimp and purveyor of bizarre entertainments for Paul and his friends; Clovis has previously expressed to Florence his disapproval and resentment of her trying to break away from her past by pretending to Charles to be the virtuous maid she isn't. Clovis then lewdly proposes with insidiously lascivious suggestiveness to Florence that she have sex with Paul, to which she succumbs, and they adjourn to the bedroom, so that, by the time Charles comes home he discovers that the Florence he loves has given herself to Paul.\n\nPaul, without studying at all, passes the law-school exam anyway, as he had predicted, but Charles, despite all his study, yet distraught and in an emotional turmoil over his loss of Florence to his cousin, flunks. Torn between a desire to kill Paul and to kill himself, Charles loads one of Paul's revolver pistols with a single bullet in one of its six chambers, spins the cylinder and pulls the trigger while pointing the gun at the sleeping Paul's head, only to hear just an empty click. Later, Paul, not realizing that the pistol has a bullet in it, points it playfully at Charles, whose panic-stricken gesticulations are not enough to dissuade Paul from pulling the trigger, thereby killing Charles. The doorbell rings and Paul goes to open it with the gun in his hand. The movie ends before Paul reaches the door.",
  "synopsis": null
}