{
  "imdb_id": "tt2258685",
  "tmdb_id": "130750",
  "douban_id": null,
  "title": "The World Before Her (2012)",
  "genres": [
    "Documentary"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    },
    {
      "runtime": "52 min",
      "description": "PBS"
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm1263934",
      "name": "Nisha Pahuja"
    }
  ],
  "writer": [
    {
      "id": "nm1263934",
      "name": "Nisha Pahuja",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3194282",
      "name": "Pooja Chopra",
      "character": "Herself"
    },
    {
      "id": "nm6466916",
      "name": "Manasvi Mamgai",
      "character": "Herself"
    },
    {
      "id": "nm5065249",
      "name": "Marc Robinson",
      "character": "Himself"
    },
    {
      "id": "nm4664662",
      "name": "Ankita Shorey",
      "character": "Herself"
    },
    {
      "id": "nm5065283",
      "name": "Ruhi Singh",
      "character": "Herself"
    },
    {
      "id": "nm5065399",
      "name": "Prachi Trivedi",
      "character": "Herself"
    }
  ],
  "overview": "Moving between two extremes - the intimate verite drama of the Miss India pageant's rigorous beauty \"bootcamp\" and the intense regime of a militant Hindu fundamentalist camp for young girls.  The World Before Her delivers a provocative portrait of India and its current cultural conflicts during a key transitional era in the country's modern history.",
  "storyline": "Ruhi Singh is a small town girl with big city dreams. She sets off to Bombay to win the title of Miss India--a launching pad to fame and a surefire way to stand out in a country of 1.2 billion people. Just hours from the Miss India beauty boot camp is another training ground for girls--that of the Durga Vahini, a Hindu nationalist group exclusively for women. Here we meet Prachi Trivedi, a young, fearsome drill sergeant training Indian girls to fight against Western culture, Islam and Christianity by any means necessary including violence. Gliding back and forth between the action of the two camps, the dreams and conflicts of India and young Indian women are laid bare-- the two opposing worlds aren't as far away from each other as they seem.",
  "plot": null,
  "synopsis": "Twenty young women from across India arrive for an intense, month-long beauty boot camp - they are the hand-picked contestants for the Miss India pageant. Winning the coveted title means instant stardom, a lucrative career path and freedom from the constraints of a patriarchal society. In another corner of India we visit a camp for young girls run by the militant fundamentalist movement. Through lectures and physical combat training, the girls learn what it means to be good Hindu women. Moving between the transformative action at both camps and the characters private lives, The World Before Her creates a lively, provocative portrait of the worlds largest democracy at a critical transitional moment."
}