{
  "imdb_id": "tt2242176",
  "tmdb_id": "285549",
  "douban_id": null,
  "title": "Horsehead (2014)",
  "genres": [
    "Fantasy",
    "Horror"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "89 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.9,
  "director": [
    {
      "id": "nm3373941",
      "name": "Romain Basset"
    }
  ],
  "writer": [
    {
      "id": "nm3373941",
      "name": "Romain Basset",
      "description": null
    },
    {
      "id": "nm3940352",
      "name": "Karim Chériguène",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0688455",
      "name": "Lilly-Fleur Pointeaux",
      "character": "Jessica"
    },
    {
      "id": "nm0531529",
      "name": "Catriona MacColl",
      "character": "Catelyn"
    },
    {
      "id": "nm0372158",
      "name": "Murray Head",
      "character": "Jim"
    },
    {
      "id": "nm2314664",
      "name": "Gala Besson",
      "character": "Rose"
    },
    {
      "id": "nm2227118",
      "name": "Fu'ad Aït Aattou",
      "character": "Winston"
    },
    {
      "id": "nm0229943",
      "name": "Vernon Dobtcheff",
      "character": "George"
    },
    {
      "id": "nm0619600",
      "name": "Philippe Nahon",
      "character": "Priest"
    },
    {
      "id": "nm0792189",
      "name": "Joe Sheridan",
      "character": "Doctor"
    },
    {
      "id": "nm0051720",
      "name": "Paul Bandey",
      "character": "Winston       (voice)"
    },
    {
      "id": "nm1655586",
      "name": "Emmanuel Bonami",
      "character": "Horsehead"
    },
    {
      "id": "nm3822235",
      "name": "Shane Woodward",
      "character": "Jessica's Boyfriend"
    },
    {
      "id": "nm1229301",
      "name": "Nathan Willcocks",
      "character": "Pr Sean F. Rutledge"
    }
  ],
  "overview": "Since her childhood, Jessica has been haunted by recurrent nightmares whose meaning escapes her. This peculiarity has led her to study the psychophysiology of dreams and to follow a therapy with Sean, her mentor and boyfriend, to try and understand the origin of her nightmares. Following the death of her maternal grandmother she hardly knew, Jessica reluctantly returns to the family home. Jessica then begins to wander in a nightmarish world inhabited by twisted versions of her family members. She gradually improves her skills as a lucid dreamer and investigates to solve the mystery that gnaws her and haunts the family home...",
  "storyline": "Since her childhood, Jessica has been haunted by recurrent nightmares whose meaning escapes her. This peculiarity has led her to study the psychophysiology of dreams and to follow a therapy with Sean, her mentor and boyfriend, to try and understand the origin of her nightmares. Following the death of her maternal grandmother she hardly knew, Jessica reluctantly returns to the family home. She doesn't get along with her mother very well and is not looking forward to seeing her again. Upon her arrival, Jessica discovers that her late grandmother is lying in the adjoining room to her own during the wake. After a rough first night made restless by a strange nightmare in which she meets her dead grandmother, Jessica suddenly becomes ill. Stuck in bed with a high fever, the young woman decides to use her lethargic state to try out lucid dreaming. In order to do so, and on Sean's advice, Jessica breathes a little bit of ether whenever she needs to sink deeper into the other world to try and ...",
  "plot": null,
  "synopsis": null
}