{
  "imdb_id": "tt2238879",
  "tmdb_id": "197736",
  "douban_id": null,
  "title": "Olhe pra mim de novo (2012)",
  "genres": [
    "Documentary"
  ],
  "country": "Brazil",
  "version": [
    {
      "runtime": "77 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm1463602",
      "name": "Kiko Goifman"
    },
    {
      "id": "nm1754549",
      "name": "Claudia Priscilla"
    }
  ],
  "writer": [
    {
      "id": "nm1754549",
      "name": "Claudia Priscilla",
      "description": null
    }
  ],
  "cast": null,
  "overview": "Syllvio Luccio is a transsexual male being transformed in the middle of the Brazilian dry lands, a region of high temperatures, poverty and where male’s virility is extreme.",
  "storyline": "This is a road trip about an individual (Sillvyo Lucio) who is in search of a long awaited dream - finding a doctor in Brazil who will perform gender re-assignment surgery. Born a female, this search reveals our subject's ideas and loathing of the male touch, shame and embarrassment of being pregnant and giving birth at an early age, and an endearing need to allow deep-seeded masculine traits to surface. Sillvyo explains his unique understanding of experiencing life from a masculine perspective, tips on how to win over a woman's affection, and many dark secrets from his past. Interviews include his mother (who explains the family's need to maintain a decent image of who their \"dauther\" really is, other family members who describe what life was like as Sillvyo grew up, and a special segment with Sillvyo's daughter, where she shares her beliefs and desires for her \"mother\" (which she refuses to accept as a man). All of this makes for a journey into very interesting regions of a desolate...",
  "plot": null,
  "synopsis": "This is a road trip about an individual (Sillvyo Lucio) who is in search of a long awaited dream - finding a doctor in Brazil who will perform gender re-assignment surgery. Born a female, this search reveals our subject's ideas and loathing of the male touch, shame and embarrassment of being pregnant and giving birth at an early age, and an endearing need to allow deep-seeded masculine traits to surface. Sillvyo explains his unique understanding of experiencing life from a masculine perspective, tips on how to win over a woman's affection, and many dark secrets from his past. Interviews include his mother (who explains the family's need to maintain a decent image of who their \"dauther\" really is, other family members who describe what life was like as Sillvyo grew up, and a special segment with Sillvyo's daughter, where she shares her beliefs and desires for her \"mother\" (which she refuses to accept as a man). All of this makes for a journey into very interesting regions of a desolate parts of Brazil's countryside."
}