{
  "imdb_id": "tt2201532",
  "tmdb_id": "356366",
  "douban_id": null,
  "title": "Guns for Hire (2015)",
  "genres": [
    "Comedy",
    "Drama",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "83 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.0,
  "director": [
    {
      "id": "nm0767680",
      "name": "Donna Robinson"
    }
  ],
  "writer": [
    {
      "id": "nm0112085",
      "name": "Katherine Brooks",
      "description": null
    },
    {
      "id": "nm0767680",
      "name": "Donna Robinson",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0139936",
      "name": "Ever Carradine",
      "character": "Athena"
    },
    {
      "id": "nm0382920",
      "name": "Michele Hicks",
      "character": "Beatle"
    },
    {
      "id": "nm0604742",
      "name": "Jeffrey Dean Morgan",
      "character": "Bruce"
    },
    {
      "id": "nm0578853",
      "name": "Ben Mendelsohn",
      "character": "Kyle Sullivan"
    },
    {
      "id": "nm0001724",
      "name": "Tony Shalhoub",
      "character": "Parking Violations Bureau Agent"
    },
    {
      "id": "nm1083404",
      "name": "Sarah Shahi",
      "character": "Carla"
    },
    {
      "id": "nm0428963",
      "name": "Orlando Jones",
      "character": "Dr. Vanderark"
    },
    {
      "id": "nm0587431",
      "name": "Ivana Milicevic",
      "character": "Friday Green"
    },
    {
      "id": "nm0000724",
      "name": "Brooke Adams",
      "character": "Secretary"
    },
    {
      "id": "nm0214860",
      "name": "Raffaello Degruttola",
      "character": "Detective Holt"
    },
    {
      "id": "nm0232721",
      "name": "Jamie Donnelly",
      "character": "Waitress"
    },
    {
      "id": "nm0235004",
      "name": "Cullen Douglas",
      "character": "Patient"
    },
    {
      "id": "nm1017853",
      "name": "William Stanford Davis",
      "character": "Liquor Store Clerk"
    },
    {
      "id": "nm0106976",
      "name": "Mickey Breitenstein",
      "character": "Detective"
    },
    {
      "id": "nm0256789",
      "name": "Jeff Enden",
      "character": "Salesman"
    },
    {
      "id": "nm5097973",
      "name": "Jerry Jones",
      "character": "Old Man"
    },
    {
      "id": "nm1193110",
      "name": "Mark Kelly",
      "character": "Patient #2"
    },
    {
      "id": "nm1770183",
      "name": "Wayne Douglas Morgan",
      "character": "Nick"
    },
    {
      "id": "nm1798624",
      "name": "Tyson Power",
      "character": "Police Office /              Detective"
    },
    {
      "id": "nm5513792",
      "name": "Katie Sills",
      "character": "Bartender"
    },
    {
      "id": "nm6722439",
      "name": "Jamie Franklin",
      "character": "Girl in the Park"
    }
  ],
  "overview": "Beatle is a quirky loner who refuses to live by society's rules. Her business cards read \"Towing/Assassination,\" and she even has a hit man infomercial to go along with it. Her only human contact is with her psychiatrist and the stripper/hooker she employs once a week. Everything changes the night she meets Athena Klendon, a suicidal blonde with a secret. With a demented killer on their tail, courtesy of Athena's crooked former employer, the two quickly strike a bargain. Athena will change her life insurance policy to reflect Beatle as the beneficiary in exchange for her own execution. And while they wait for the paperwork to come through, Beatle will provide room and board and get some extra help on her infomercial. The two have no idea that Detective Holt has been on their case reviewing their every move. Just when he thinks he's got Beatle pinned beyond a shadow of a doubt, this comedic mystery takes a wild and unexpected turn.",
  "storyline": "Beatle is a quirky loner who refuses to live by society's rules. Her business cards read \"Towing/Assassination,\" and she even has a hit man infomercial to go along with it. Her only human contact is with her psychiatrist and the stripper/hooker she employs once a week. Everything changes the night she meets Athena Klendon, a suicidal blonde with a secret. With a demented killer on their tail, courtesy of Athena's crooked former employer, the two quickly strike a bargain. Athena will change her life insurance policy to reflect Beatle as the beneficiary in exchange for her own execution. And while they wait for the paperwork to come through, Beatle will provide room and board and get some extra help on her infomercial. The two have no idea that Detective Holt has been on their case reviewing their every move. Just when he thinks he's got Beatle pinned beyond a shadow of a doubt, this comedic mystery takes a wild and unexpected turn.",
  "plot": "Draenor, the homeworld of the orcs, is being torn apart by a mysterious force known as fel magic. Gul'dan, a powerful orc warlock, unites the orc clans and forms the Horde, and creates a portal to the world of Azeroth. The orcs begin to use fel magic to drain the life out of captive draenei in order to sustain the portal. Once it is operational, Gul'dan leads a small warband to capture prisoners on Azeroth and sacrifice them to bring the rest of the Horde through the portal. Durotan, the chieftain of the Frostwolf Clan, his pregnant mate Draka, and his friend Orgrim Doomhammer join this initial warband. While crossing through the portal, Draka goes into labor. When the orcs arrive on Azeroth, Gul'dan assists Draka with giving birth, but the baby is stillborn. Gul'dan then drains the life out of a nearby deer to revive and infuse fel magic into the baby, which Durotan later names Go'el.\n\nThe orcs raid several settlements throughout Azeroth. Anduin Lothar, the military commander of the human forces in the Stormwind Kingdom, looks over some of the men that were killed, and finds a trespassing mage named Khadgar, who explains that he was investigating the dead bodies because they contained traces of fel magic. Khadgar persuades Stormwind's king, Llane Wrynn, to consult Medivh, the renowned Guardian of Tirisfal, and Llane sends Anduin and Khadgar to Medivh's stronghold, Karazhan, to inform him of the fel magic's presence on Azeroth. In the Karazhan library, a ghostly shadow leads Khadgar to a mysterious book, which he takes.\n\nAnduin, Khadgar and Medivh join a scouting team following traces of fel magic, but are ambushed by orcs. Medivh uses a spell to kill the fel-corrupted orcs, leaving the Horde's warchief, Blackhand to flee along with Durotan and Orgrim. Khadgar restrains a half-orc slave, Garona, and the soldiers take her prisoner. King Llane frees Garona in exchange for loyalty to Stormwind, and she leads the humans to spy on the orc camp, where they learn of Gul'dan's plan to bring the Horde to Azeroth. Meanwhile, Durotan realizes that the fel magic is responsible for the destruction of Draenor, and if Gul'dan is not thwarted, Azeroth will suffer the same fate. Despite Orgrim's objections, Durotan invites Llane to a secret meeting so that the Frostwolf Clan and the humans can unite to defeat Gul'dan. While studying the book he took from Karazhan, Khadgar learns that Gul'dan could not have opened the portal on his own; he had help from someone on Azeroth. He is confronted by Medivh, who burns Khadgar's research when Khadgar offers to help him with his work.\n\nThe Frostwolf Clan meets with the humans to negotiate an alliance, but the group is ambushed by Blackhand. As the humans retreat, Medivh forms a magical barrier to protect them, but Lothar's son Callan is separated from the rest of the group and killed by Blackhand. Medivh is severely weakened, and Garona and Khadgar take him back to Karazhan to recover. After noticing Medivh's eyes shine green, showing that he is infected by fel magic, Khadgar returns to his former home, Dalaran, to seek help from the Kirin Tor, the authority of human and high elven mages. The Kirin Tor facilitate a meeting with Alodi, revealed to be the shadow who led Khadgar to the book; she confirms that Medivh has indeed been corrupted by fel magic and turned into a demon. At the orc camp, Blackhand purges the Frostwolf Clan. Orgrim helps Draka to escape, and she sends Go'el down a river in a basket, but is then found and killed by another orc. Durotan challenges Gul'dan to Mak'gora, a traditional orcish duel to the death for leadership of a clan – in this case, all of the orcs. During the fight, Gul'dan violates the honorable combat rules by draining the life out of Durotan with his magic, killing him and earning the disapproval of the orcs watching, and he empowers Blackhand with the same magic. Medivh, now in a half-demonic state, starts to open the portal to Draenor, and Gul'dan begins sacrificing the captured human villagers to allow the rest of the Horde to enter Azeroth.\n\nLlane leads the human army in an assault on the orc camp, while Anduin and Khadgar fight Medivh and destroy the demon that had begun to manifest on the outside. Medivh is left mortally wounded, and uses the last of his strength to close the portal to Draenor and instead open a portal to Stormwind, allowing Llane to evacuate most of the freed prisoners. When Medivh eventually dies, the portal closes, leaving Llane, Garona and a small number of human soldiers to fight the orcs. Llane secretly orders Garona to kill him, bringing her honor among the orcs and putting her in a position of power to bring peace between the two races. Garona reluctantly does so, and is welcomed into the Horde by Gul'dan. As the orcs celebrate, Lothar arrives to retrieve King Llane's body and discovers Garona's knife in the body, realizing that it was she who had killed their king. Blackhand challenges Lothar to Mak'gora, and Lothar quickly disposes of him. Against Gul'dan's demands, the orcs, bound by tradition, allow Lothar to depart with Llane's body. At Llane's funeral in Stormwind, the leaders of the other human nations, along with the high elves and dwarves, proclaim an alliance against the orcs and rally behind Lothar as the leader of the Alliance forces. Elsewhere, Orgrim takes one of Durotan's tusks to one day give to Go'el, and the basket containing Go'el is found by a human.",
  "synopsis": null
}