{
  "imdb_id": "tt2281159",
  "tmdb_id": "204349",
  "douban_id": null,
  "title": "Contracted (2013)",
  "genres": [
    "Drama",
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.3,
  "director": [
    {
      "id": "nm3146718",
      "name": "Eric England"
    }
  ],
  "writer": [
    {
      "id": "nm3146718",
      "name": "Eric England",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm1680142",
      "name": "Najarra Townsend",
      "character": "Samantha"
    },
    {
      "id": "nm0930226",
      "name": "Caroline Williams",
      "character": "Sam's Mom"
    },
    {
      "id": "nm3948907",
      "name": "Alice Macdonald",
      "character": "Alice"
    },
    {
      "id": "nm0580290",
      "name": "Matt Mercer",
      "character": "Riley"
    },
    {
      "id": "nm3224822",
      "name": "Katie Stegeman",
      "character": "Nikki"
    },
    {
      "id": "nm3825890",
      "name": "Charley Koontz",
      "character": "Zain"
    },
    {
      "id": "nm1440023",
      "name": "Simon Barrett",
      "character": "BJ"
    },
    {
      "id": "nm0006604",
      "name": "Ruben Pla",
      "character": "The Doctor"
    },
    {
      "id": "nm2908671",
      "name": "E-Kan Soong",
      "character": "George"
    },
    {
      "id": "nm0391790",
      "name": "Dave Holmes",
      "character": "The Therapist"
    },
    {
      "id": "nm1641199",
      "name": "Kaela Crawford",
      "character": "The Waitress"
    },
    {
      "id": "nm1894575",
      "name": "Andre Boyer",
      "character": "The Sign-In Guy"
    },
    {
      "id": "nm3080438",
      "name": "Celia Finkelstein",
      "character": "Nice Customer #1"
    },
    {
      "id": "nm0046632",
      "name": "Laura Baggett",
      "character": "Nice Customer #2"
    },
    {
      "id": "nm1101505",
      "name": "Chris Candy",
      "character": "Random Guy"
    },
    {
      "id": "nm6235550",
      "name": "Dale Stegeman",
      "character": "Upset Customer #1"
    },
    {
      "id": "nm6235551",
      "name": "Kay Stegeman",
      "character": "Nail In Her Salad Lady"
    },
    {
      "id": "nm6235552",
      "name": "Benjamina Watts",
      "character": "Accident Witness #1"
    },
    {
      "id": "nm2720979",
      "name": "Jennifer Gonzalez",
      "character": "The Nurse"
    },
    {
      "id": "nm1062059",
      "name": "Lionel D. Carson",
      "character": "Officer #1"
    },
    {
      "id": "nm4309786",
      "name": "Mike Jerome Putnam",
      "character": "Officer #2"
    },
    {
      "id": "nm5223022",
      "name": "Joey Mar",
      "character": "The Bartender"
    },
    {
      "id": "nm4110487",
      "name": "Jessica Joan",
      "character": "Drunk Girl in Bar"
    },
    {
      "id": "nm4630108",
      "name": "Kelsey Todd",
      "character": "Background person"
    },
    {
      "id": "nm2466457",
      "name": "Ryan Ridley",
      "character": "Background person"
    },
    {
      "id": "nm5071795",
      "name": "Phillis Kemp",
      "character": "Woman in Cafe"
    },
    {
      "id": "nm3083311",
      "name": "David Baughman",
      "character": "Customer"
    },
    {
      "id": "nm3131531",
      "name": "Lissy Smith",
      "character": "Kent Finkleberg"
    },
    {
      "id": "nm5324645",
      "name": "Rebecca Brownlee",
      "character": "Customer"
    },
    {
      "id": "nm5103213",
      "name": "Jordan Iheaso",
      "character": "Benjamin Peyser"
    },
    {
      "id": "nm4155897",
      "name": "Matt Blackwood",
      "character": "Saleem"
    },
    {
      "id": "nm5102639",
      "name": "David Gomez",
      "character": "Party Guy"
    },
    {
      "id": "nm5103359",
      "name": "Chris Burgos",
      "character": "Camplen"
    },
    {
      "id": "nm5102501",
      "name": "Roderick Griffin",
      "character": "Man on Street"
    }
  ],
  "overview": "A young girl contracts what she thinks is a sexually-transmitted disease - but is actually something much worse.",
  "storyline": "During a rough period in her life, beautiful Samantha reluctantly decides to attend her best friend's party, and even though she still struggles with a previous addiction, she unwisely accepts a drink from a complete stranger. As a result, shortly after, hapless Samantha considerably inebriated, she will end up raped in the backseat of the malicious predator's car, however, from that point on, the terrible incident will be the least of her problems. Straight away and rather inexplicably, poor Samantha will begin noticing rapid and drastic organic changes in her body, and being unable to pinpoint the origin of the dramatic transformation, within the next 72 hours, she will embrace her gruesome and pitiless fate as well as the certainty that she is falling apart. Literally.",
  "plot": null,
  "synopsis": "In a morgue, a worker, named BJ, has sex with a corpse that has a bio-hazard symbol on the toe tag; afterward, he handles an empty test tube while washing up.Meanwhile, Samantha is at a local house party, trying to get over a recent break-up with her girlfriend, Nikki. The party's host, Alice, plies her with strong drinks, while Zain offers her drugs. After she becomes heavily inebriated, Samantha is approached by BJ, who offers her a drink. Even though she tells him that she is a lesbian, when she begins to black out, BJ takes her to his car and rapes her.The next morning, Samantha thinks she is suffering from a bad hangover. She bickers with her mother, who struggles to accept her daughter's lesbianism and is worried that she might have relapsed into hard drug use. Alice tells Samantha that the police are searching for BJ, who Alice had never met. At the restaurant where she works, Samantha has trouble eating and is overly sensitive to noise. When she bleeds heavily from her vagina, she visits her doctor. Despite her protests that she is a lesbian who has not had sex with men for nearly a year, he is suspicious that she has contracted a sexually transmitted disease from heterosexual intercourse because of a rash that has developed in her groin.Samantha tries to repair her relationship with Nikki, who is rude to her. Samantha is hurt to learn that Nikki had not let her know that a scholarship offer had come in the mail. Meanwhile, her symptoms continue to worsen. Her eyes turn bloodshot, her hair falls out in clumps. When she is called into the restaurant on a short-notice shift her fingernails begin to fall off. Samantha flees the restaurant and returns to her doctor, who advises her to avoid contact with other people until tests can determine the nature of her disease. Instead, Samantha visits Zain, who gives her heroin. When Alice arrives, she encourages Samantha to talk to the police about her encounter with BJ. Believing that Alice wants to isolate her from her other friends, Samantha argues with her and storms off. It is here that Zain reveals to Alice that he sold Rohypnol to BJ at the party.Samantha stops off at home and argues violently with her mother. She abruptly leaves for her flower competition but is turned away at the door because of her appearance and the condition of her flowered plant.Samantha turns to Nikki for consolation, but Nikki coldly rejects her and calls her sexually confused. Enraged, Samantha chokes Nikki to death. She then drives to Alice's house in a rage and murders her by biting out her throat. Losing her sanity, Samantha invites Riley, a man who has had a crush on her, to Alice's house and tries to seduce him. Riley sees maggots fall out of Samantha's vagina and becomes repulsed. When he goes to the bathroom to inspect himself, he discovers Alice's body. Samantha flees the house. As she drives, she fades out of consciousness and is involved in a car crash. She emerges from the wreckage transformed fully into a zombie. Her mother, who has arrived at the scene, begs the police not to shoot Samantha. As the police caution Samantha against moving, she lunges at her screaming mother....."
}