{
  "imdb_id": "tt2275802",
  "tmdb_id": "217446",
  "douban_id": null,
  "title": "Satyagraha (2013)",
  "genres": [
    "Drama"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "152 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm0422552",
      "name": "Prakash Jha"
    }
  ],
  "writer": [
    {
      "id": "nm3673852",
      "name": "Ram Goutam",
      "description": "script supervisor"
    },
    {
      "id": "nm0422552",
      "name": "Prakash Jha",
      "description": null
    },
    {
      "id": "nm0707304",
      "name": "Anjum Rajabali",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0000821",
      "name": "Amitabh Bachchan",
      "character": "Dwarka Anand"
    },
    {
      "id": "nm0004626",
      "name": "Kareena Kapoor",
      "character": "Yasmin Ahmed       (as Kareena Kapoor Khan)"
    },
    {
      "id": "nm0222426",
      "name": "Ajay Devgn",
      "character": "Manav Raghvendra"
    },
    {
      "id": "nm0048075",
      "name": "Manoj Bajpayee",
      "character": "Balram Singh       (as Manoj Bajpai)"
    },
    {
      "id": "nm1182255",
      "name": "Amrita Rao",
      "character": "Sumitra"
    },
    {
      "id": "nm0992000",
      "name": "Arjun Rampal",
      "character": "Arjun"
    },
    {
      "id": "nm5788330",
      "name": "Natasa Stankovic",
      "character": "Dancer"
    },
    {
      "id": "nm2585918",
      "name": "Mugdha Godse",
      "character": "Malini Mishra"
    },
    {
      "id": "nm4405794",
      "name": "Anjali Patil",
      "character": ""
    },
    {
      "id": "nm1479650",
      "name": "Vipin Sharma",
      "character": "Gauri Shankar"
    },
    {
      "id": "nm1778890",
      "name": "Indraneil Sengupta",
      "character": "Akhilesh"
    },
    {
      "id": "nm4702221",
      "name": "Mukul Chadda",
      "character": "Harinath"
    },
    {
      "id": "nm5704026",
      "name": "Ivan Rodrigues",
      "character": "Channel Head ABP News"
    },
    {
      "id": "nm7060124",
      "name": "Jagat Singh",
      "character": "Bulbul Singh"
    },
    {
      "id": "nm2933689",
      "name": "Shireesh Sharma",
      "character": "CHIEF MINISTER"
    },
    {
      "id": "nm2983553",
      "name": "Ajay Trehan",
      "character": "Durgalal"
    },
    {
      "id": "nm4577706",
      "name": "Arti Rautela",
      "character": "Reporter"
    },
    {
      "id": "nm7967976",
      "name": "Shruti Singh",
      "character": "Reporter"
    },
    {
      "id": "nm4439646",
      "name": "Anil Jatav",
      "character": ""
    },
    {
      "id": "nm2372008",
      "name": "Sherard Parker",
      "character": "Vijay Bhatt"
    }
  ],
  "overview": "Satyagraha is the story of a son who yearns for a father. Of a father, who grieves for his lost son. Of a young woman who fights so hard with life that she has forgotten to love. Of an ambitious rabble-rouser, for whom action is the knee-jerk mantra. It is the story of how these four discover one another, and come together to raise hell, shaking the powers that be to their very roots! But, Satyagraha is also the story of an influential power-hungry despot who will stop at nothing to destroy them.",
  "storyline": "Satyagraha is the story of a son who yearns for a father. Of a father, who grieves for his lost son. Of a young woman who fights so hard with life that she has forgotten to love. Of an ambitious rabble-rouser, for whom action is the knee-jerk mantra. It is the story of how these four discover one another, and come together to raise hell, shaking the powers that be to their very roots! But, Satyagraha is also the story of an influential power-hungry despot who will stop at nothing to destroy them. Satyagraha: The revolution has begun!",
  "plot": "Retired teacher and ex-principal Dwarka Anand (Amitabh Bachchan) is an idealistic man. His engineer son Akhilesh's friend Manav (Ajay Devgan) is an ambitious capitalist. Manav cherishes his friend Akhilesh (Indraneil Sengupta) who suddenly dies in a road accident maliciously conducted by Sangram Singh, brother of India's minister Minister Balram Singh (Manoj Bajpai), who, unknown to all of India, is the mastermind behind Akhilesh's murder. Balram Singh announces compensation, which Akhilesh's wife Sumitra (Amrita Rao) cannot get in spite of submitting daily applications in the government office. Incensed, Dwarka slaps the DM and is imprisoned. Manav starts a campaign to free him, using social media, roping in Arjun Singh (Arjun Rampal) and journalist Yasmin (Kareena Kapoor). As hopeful students, hungry laborers and angry middle-class citizens join in the agitation, politicians start panicking. Eventually, Dwarka Anand gets freedom after the DM takes his complaint back upon pressure from Balram Singh.\n\nDwarka Anand gives a notice of 30 days to the government to clear all pending claims in the entire district. After a series of dramatic events, he sits on hunger strike and asks the government to bring ordinance in the district. Meanwhile, Lal Bahadur, a youth, commits suicide to support the agitation. During his cortege, four policemen brutally get killed by the mob. Soon after this, riots break out, forcing Balram Singh to send paramilitary force. His henchman shoot Dwarka Anand who dies in Manav's lap, requesting the public to stop the riots. Balram Singh is then caught by the police. Manav and Arjun decide to construct a regional party to eliminate corruption and reconstruct the system for the common welfare.",
  "synopsis": "Satyagraha is a story of a son who yearns for a father. Of a father, who grieves for his lost son. Of a young woman who fights so hard with life that she has forgotten to love. Of an ambitious rabble-rouser,for whom action is the knee-jerk mantra. It is the story of how these four discover one another, and come together to raise hell, shaking the powers that be to their very roots! But, Satyagraha is also the story of an influential power-hungry despot who will stop at nothing to destroy them. Satyagraha - welcome to the fight!"
}