{
  "imdb_id": "tt2274752",
  "tmdb_id": "341671",
  "douban_id": null,
  "title": "Model Hunger (2016)",
  "genres": [
    "Horror"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm0004193",
      "name": "Debbie Rochon"
    }
  ],
  "writer": [
    {
      "id": "nm3497963",
      "name": "James Morgart",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0523344",
      "name": "Lynn Lowry",
      "character": "Ginny Reilly"
    },
    {
      "id": "nm3376493",
      "name": "Mary Bogle",
      "character": "Debbie's Mom"
    },
    {
      "id": "nm2239040",
      "name": "Babette Bombshell",
      "character": "Suzi's Secret Model"
    },
    {
      "id": "nm2710153",
      "name": "Bob Bozek",
      "character": "Reginald Burke       (as Robert Bozek)"
    },
    {
      "id": "nm0135292",
      "name": "Carmine Capobianco",
      "character": "Sal Lombardo"
    },
    {
      "id": "nm1354603",
      "name": "Bette Cassatt",
      "character": "Chloe"
    },
    {
      "id": "nm5240039",
      "name": "Jayne Caswell",
      "character": "Young Ginny Reilly"
    },
    {
      "id": "nm5124697",
      "name": "Rachel Jane Conn",
      "character": "The Hitchhiker"
    },
    {
      "id": "nm1779231",
      "name": "Lisa Dee",
      "character": "Missy"
    },
    {
      "id": "nm1987270",
      "name": "Brian Fortune",
      "character": "Colin"
    },
    {
      "id": "nm4507586",
      "name": "Erika Frase",
      "character": "Cheerleader"
    },
    {
      "id": "nm4383601",
      "name": "Gerica Horn",
      "character": "Suzi's Secret Model       (as Geri Horn)"
    },
    {
      "id": "nm4998706",
      "name": "Samantha Hoy",
      "character": "Katie"
    },
    {
      "id": "nm1217063",
      "name": "Suzi Lorraine",
      "character": "TV Show Host Suzi"
    },
    {
      "id": "nm3395623",
      "name": "David Marancik",
      "character": "Officer Jason O'Bannon"
    },
    {
      "id": "nm1941692",
      "name": "Jennifer McMahon",
      "character": "The Reporter"
    },
    {
      "id": "nm4411886",
      "name": "Kathy Murphy",
      "character": "Coach Lisa O'Bannon"
    },
    {
      "id": "nm6941546",
      "name": "Myles Gregory Nickerson",
      "character": "Suzi Street Team"
    },
    {
      "id": "nm2430531",
      "name": "Michael O'Hear",
      "character": "Officer Dan O'Leary"
    },
    {
      "id": "nm5205451",
      "name": "Mia Page",
      "character": "Young Debbie"
    },
    {
      "id": "nm5582028",
      "name": "Lauretta Ryan",
      "character": "Suzi Street Team"
    },
    {
      "id": "nm5557378",
      "name": "Maria Ryan",
      "character": "Suzi Street Team"
    },
    {
      "id": "nm0791898",
      "name": "Tiffany Shepis",
      "character": "Debbie Lombardo"
    },
    {
      "id": "nm4235541",
      "name": "Michael Thurber",
      "character": "Arnold Winters"
    },
    {
      "id": "nm3623156",
      "name": "Michael Varrati",
      "character": "Jose the Hairdresser"
    },
    {
      "id": "nm0901807",
      "name": "Aurelio Voltaire",
      "character": "Verrill"
    },
    {
      "id": "nm2545114",
      "name": "Kaylee Williams",
      "character": "Melanie"
    }
  ],
  "overview": "Former pin-up model and actress Ginny had been cast aside by the heartless and exploitative modeling industry when she was a young woman due to her body type. Ginny didnt take rejection well and over the years developed into a revenge seeking, blood thirsty, broken woman. When her new neighbors Debbie and Sal move in, Debbie begins to notice strange things going on next door. Sal credits it to Debbies psychological instability and believes she is seeing things, falling deeper into her psychosis. Debbie is obsessively determined to figure out what secret life Ginny is leading. Her new nosey neighbor throws a damper on Ginnys lifestyle activities; such as her cannibalistic food addictions and ever growing body count. Both women become determined to put an end to the others obsession.",
  "storyline": "A former model (Lynn Lowry) forced into retirement due to her age exacts her revenge on young beautiful women in this horror thriller.",
  "plot": "This section needs expansion with: the rest of the plot. You can help by adding to it. (April 2015)\nFive strangers wake in a dim, dry well with no memory of how they got there. Grant (Linden Ashby) is the intrepid, leader-type. Jordan (Lori Heuring), a surgeon, is the group's moral compass. The younger Anna (Lea Kohl) is manipulative and willing to do anything to survive. Luke (Joe Egender) is an insane-yet-rational Darwinist who's only looking out for himself. Alex (Julian Rojas) is a timid outsider on the verge of breaking down.\n\nWhen a note attached to a scalpel informs them that the average person can survive for, at most, 30 days without food, they realize to their horror what their captor wants them to do. As days go by and endeavours to escape prove futile, the inviolable becomes a distinct prospect. All the while, a scientist with a history observes from his study.",
  "synopsis": "Former pin-up model and actress Ginny (Lynn Lowry) had been cast aside by the heartless and exploitative modeling industry when she was a young woman due to her body type. Ginny didnt take rejection well and over the years developed into a revenge seeking, blood thirsty, broken woman. When her new neighbors Debbie (Tiffany Shepis) and Sal (Carmine Capobianco) move in, Debbie begins to notice strange things going on next door. Sal credits it to Debbies psychological instability and believes she is seeing things, falling deeper into her psychosis. Debbie is obsessively determined to figure out what secret life Ginny is leading. Her new nosey neighbor throws a damper on Ginnys lifestyle activities; such as her cannibalistic food addictions and ever growing body count. Both women become determined to put an end to the others obsession."
}