{
  "imdb_id": "tt2231253",
  "tmdb_id": "265208",
  "douban_id": null,
  "title": "Wild Card (2015)",
  "genres": [
    "Action",
    "Crime",
    "Drama",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "92 min",
      "description": ""
    },
    {
      "runtime": "102 min",
      "description": "Extended Cut"
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm0922346",
      "name": "Simon West"
    }
  ],
  "writer": [
    {
      "id": "nm0001279",
      "name": "William Goldman",
      "description": "screenplay"
    },
    {
      "id": "nm0001279",
      "name": "William Goldman",
      "description": "novel"
    }
  ],
  "cast": [
    {
      "id": "nm0005458",
      "name": "Jason Statham",
      "character": "Nick Wild"
    },
    {
      "id": "nm0029400",
      "name": "Michael Angarano",
      "character": "Cyrus Kinnick"
    },
    {
      "id": "nm0306572",
      "name": "Dominik García-Lorido",
      "character": "Holly"
    },
    {
      "id": "nm0204706",
      "name": "Hope Davis",
      "character": "Cassandra"
    },
    {
      "id": "nm0893257",
      "name": "Milo Ventimiglia",
      "character": "Danny DeMarco"
    },
    {
      "id": "nm0143295",
      "name": "Max Casella",
      "character": "Osgood"
    },
    {
      "id": "nm0001804",
      "name": "Stanley Tucci",
      "character": "Baby"
    },
    {
      "id": "nm0005527",
      "name": "Sofía Vergara",
      "character": "DD"
    },
    {
      "id": "nm0004517",
      "name": "Jason Alexander",
      "character": "Pinky"
    },
    {
      "id": "nm0000162",
      "name": "Anne Heche",
      "character": "Roxy"
    },
    {
      "id": "nm0115152",
      "name": "Chris Browning",
      "character": "Tiel"
    },
    {
      "id": "nm2200632",
      "name": "Matthew Willig",
      "character": "Kinlaw"
    },
    {
      "id": "nm0898798",
      "name": "François Vincentelli",
      "character": "Benny"
    },
    {
      "id": "nm0568672",
      "name": "Davenia McFadden",
      "character": "Millicent       (as Daviena McFadden)"
    },
    {
      "id": "nm0660244",
      "name": "Michael Papajohn",
      "character": "Pit Boss"
    },
    {
      "id": "nm2049732",
      "name": "Jean Claude Leuyer",
      "character": "Julian Reeves"
    },
    {
      "id": "nm5338419",
      "name": "Greice Santo",
      "character": "Cocktail Waitress - Veronica"
    },
    {
      "id": "nm1336664",
      "name": "Freddie Poole",
      "character": "Frank"
    },
    {
      "id": "nm3144096",
      "name": "Nick Epper",
      "character": "Tony"
    },
    {
      "id": "nm1305056",
      "name": "Lara Grice",
      "character": "First Doctor"
    },
    {
      "id": "nm3979145",
      "name": "D'Arcy Allen",
      "character": "Hotshot Dealer"
    },
    {
      "id": "nm2082525",
      "name": "Shanna Forrestall",
      "character": "Marie"
    },
    {
      "id": "nm1330060",
      "name": "Boyana Balta",
      "character": "Woman"
    },
    {
      "id": "nm0674101",
      "name": "Lee Perkins",
      "character": "Mean Dealer"
    },
    {
      "id": "nm6935182",
      "name": "Allison Wirges",
      "character": "Nurse"
    },
    {
      "id": "nm2356797",
      "name": "Kyle Clements",
      "character": "Orderly"
    },
    {
      "id": "nm4688280",
      "name": "Billy Tilk",
      "character": "Thug #1"
    },
    {
      "id": "nm0031055",
      "name": "Pete Antico",
      "character": "Thug #2"
    },
    {
      "id": "nm3946231",
      "name": "J. Travis Merendino",
      "character": "Thug #3       (as Travis Merindino)"
    },
    {
      "id": "nm0053366",
      "name": "Clayton J. Barber",
      "character": "Thug #4"
    }
  ],
  "overview": "When a Las Vegas bodyguard with lethal skills and a gambling problem gets in trouble with the mob, he has one last play… and it's all or nothing.",
  "storyline": "Nick Wild (Jason Statham) is a Las Vegas bodyguard with lethal professional skills and a personal gambling problem. When a friend is beaten by a sadistic thug, Nick strikes back, only to find out the thug is the son of a powerful mob boss. Suddenly Nick is plunged into the criminal underworld, chased by enforcers and wanted by the mob. Having raised the stakes, Nick has one last play to change his fortunes...and this time, it's all or nothing.",
  "plot": "Nick Wild (Jason Statham) is a recovering gambling addict who takes odd jobs in Las Vegas as a \"chaperone\" (his version of a bodyguard) to support his addiction. After helping a client impress a woman (Sofia Vergara), he accepts a proposition from a young man Cyrus Kinnick (Michael Angarano) to show him around Vegas and provide him with protection while he gambles.\n\nWhile eating at a diner, Nick's waitress friend Roxy (Anne Heche) hands him a message from a woman he knows, Holly (Dominik Garcia-Lorido), who wants him to stop by her house. Holly, a professional escort, explains she had a date the previous night at the Golden Nugget. Afterward, she was brutally raped and beaten by three unknown men in their hotel room. Holly asks Nick to find out who they are so that she can sue them.\n\nNick discovers that the man responsible for raping Holly is Danny DeMarco (Milo Ventimiglia), a gangster. DeMarco had his two thugs dump her in a hospital car park. Nick goes to the hotel to confront DeMarco, disguised as someone sent by another criminal. A confrontation develops but Nick defends himself, overpowering DeMarco and his men, who are tied up as Nick calls Holly. In the room, Holly contemplates castrating DeMarco, who breaks down and begs her forgiveness, Holly decides to take the $50,000 from DeMarco's desk and leaves.\n\nHolly splits the money with Nick and leaves Las Vegas. Nick takes Cyrus to a casino. Playing blackjack with dealer friend Cassandra (Hope Davis), Nick then goes on a huge winning streak with the next dealer, amassing over a half a million. But when he goes to the cashier, he has a sudden anxiety attack, and loses his winnings as well as his original $25,000 on a single blackjack bet with Cassandra. The next morning, Cyrus, revealed to be a self-made millionaire, wants Nick to mentor him on being brave, but Nick declines. At the bar, DeMarco's men arrive to deliver Nick to DeMarco, but Nick beats them off.\n\nNick meets with Baby (Stanley Tucci), the mafia boss of Las Vegas. Baby has received a complaint from DeMarco, who claims that Nick broke into his hotel room, pistol-whipped him, and killed two of his men – all to fund his gambling addiction. Baby takes Nick to a room with DeMarco, where Nick tells his side of the story: that DeMarco killed his men later and that DeMarco bears a cut on his penis. Baby tells DeMarco to drop his pants to prove Nick wrong, but he refuses, and leaves.\n\nAt the local diner, Cyrus offers Nick a check for $500,000 and a plane ticket to Corsica for what he has learned from Nick. DeMarco and his men appear in the diner. Cyrus starts singing loudly distracting Nick so he can escape. Nick thinks about his sailboat and then kills the thugs and DeMarco with his utensils behind the diner. Afterwards, Cyrus insists Nick take the check and the ticket, and Nick accepts. Nick then drives out of Las Vegas.",
  "synopsis": null
}