{
  "imdb_id": "tt2246724",
  "tmdb_id": "192097",
  "douban_id": null,
  "title": "Ghanchakkar (2013)",
  "genres": [
    "Comedy",
    "Crime",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "137 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm2955107",
      "name": "Raj Kumar Gupta"
    }
  ],
  "writer": [
    {
      "id": "nm2955107",
      "name": "Raj Kumar Gupta",
      "description": "screenplay"
    },
    {
      "id": "nm5151578",
      "name": "Parveez Sheikh",
      "description": "screenplay"
    },
    {
      "id": "nm5151578",
      "name": "Parveez Sheikh",
      "description": "story"
    }
  ],
  "cast": [
    {
      "id": "nm1799038",
      "name": "Vidya Balan",
      "character": "Neetu Atre (Mrs. Ghanchakkar)"
    },
    {
      "id": "nm1431656",
      "name": "Emraan Hashmi",
      "character": "Sanjay Atre (Mr. Ghanchakkar)"
    },
    {
      "id": "nm5843593",
      "name": "Vikram Kochhar",
      "character": ""
    },
    {
      "id": "nm0788903",
      "name": "Rajesh Sharma",
      "character": "Pandit"
    },
    {
      "id": "nm3603873",
      "name": "Amar Kaushik",
      "character": "Stud hussain"
    },
    {
      "id": "nm2955107",
      "name": "Raj Kumar Gupta",
      "character": "Cameo       (as Rajkumar Gupta)"
    },
    {
      "id": "nm3721677",
      "name": "Vishwanath Chatterjee",
      "character": ""
    },
    {
      "id": "nm4432942",
      "name": "Sunil Vishrani",
      "character": "Fat Man"
    },
    {
      "id": "nm0196375",
      "name": "Parvin Dabas",
      "character": "Uttam Nagpal"
    },
    {
      "id": "nm2981021",
      "name": "Namit Das",
      "character": "Idris"
    },
    {
      "id": "nm3583019",
      "name": "Shashank Shende",
      "character": "Baba"
    },
    {
      "id": "nm8413604",
      "name": "Helena Fonseca",
      "character": "In 3D whimp"
    },
    {
      "id": "nm5732315",
      "name": "Tarun Dudeja",
      "character": "Male Nurse"
    },
    {
      "id": "nm3837249",
      "name": "Frank M. Ahearn",
      "character": "Ello"
    },
    {
      "id": "nm0595354",
      "name": "Mahabanoo Mody-Kotwal",
      "character": "Neighbour"
    }
  ],
  "overview": "When Sanju a master safe cracker teams up with two dangerous criminals to commit one last heist. The robbery is successful and Sanju is given the task of hiding the money till things cool down and the booty can be split. Three months later, the associates return to collect their share of the loot, but Sanju refuses to even recognize them! They realize he enrolled into an accident and is suffering from strong amnesia and decide to stay with Sanju and his wife Neetu until Sanju remembers where he hid the money. What dangerous game is Sanju playing?",
  "storyline": "Sanju, Pandit and Idris rob a bank and decide to share the money. After executing the robbery successfully, the trio decide that Sanju keep the money for 3 months until the heat has died down. Problems arise Sanju forgets where he put the money, and when his partners return for their share. This leads to comedic scenes and wild chases for any leads that might get them close to the money.",
  "plot": "Sanjay Athray aka 'Sanju' (Emraan Hashmi) is a master safe cracker who maintains a casual lifestyle with his wife Neetu (Vidya Balan). He meets two criminals, Pandit and Idris and they offer him a chance to assist a bank robbery. If the heist is successful, they will ensure that he never has to worry about money again, so he accepts the offer. The three thieves make off with 35 crore rupees. After the bank robbery, Pandit tells them that they'll meet after three months and then they'll spilt the money, so Pandit and Idris let Sanjay hid the money. After 3 months, Pandit and Idris discovers that Sanjay lost his memory. Pandit and Idris decide that they will stay at Sanjay and Neetu's house until Sanjay remembers where he hid the money and to make sure they're not cheated and they give Sanjay for one week time. Sanjay tries to remember where he hid the money.\n\nWhen Sanjay learns that his college friend Uttam Nagpal (Parvin Dabas) has become an overnight millionaire, apparently by winning a lottery, he suspects Neetu of knowing the hiding place of the money and of conspiring with his friend. Uttam moves to London after being confronted about the money. Sanjay finds out that Neetu has purchased a one-way ticket for London.\n\nAn unknown person contacts Sanjay and urges him to divulge the location of the money. Under pressure, Pandit and Idris kidnap Neetu and ask Sanjay to meet them in a train station, on the third platform at 1:30am. When both Pandit and Idris confront Sanjay and demand the money, Sanjay claims that he doesn't even recognise the two.\n\nWhen Sanjay tells them that Neetu knew where the money was, Idris begins to lose control. When he pulls his gun, he is shot by an unknown person and kills Pandit in a rage in the train. It turns out he was that unknown person who called Sanjay earlier and he originally devised the bank robbery plan and now wants his share. Sanjay tries to defend himself with his only weapon, a fork. After persistently questioning and trying to blackmail Sanjay, the unknown person shoots Neetu, hoping that the traumatic vision of his wife's suffering will make Sanjay reveal the truth. This fails, however, since Sanjay has in fact lost his memory. He searches Sanjay's pockets, only to find his second weapon, a banana. In retaliation he shoots Sanjay in the shoulder and leaves the train.\n\nSanjay's phone rings and he finds his mother on the line. Sanjay has completely forgotten his identity and doesn't recognise his mother, but she says she has a suitcase that Sanjay gave her to keep three months ago, and if he doesn't come soon, she'll give it to the junk dealer. It reveals that Sanjay's mother has the money. The unknown person overhears this and jumps on the train just as it's starting, but he slips on Sanjay's banana and impales his neck on Sanjay's fork. Sanjay, bereft, confused and tired, throws his phone out of the train while Neetu smiles. Sanjay has no idea what's going on, but the train goes on its way with the dead bodies of the unknown person, Pandit and Idris.",
  "synopsis": null
}