{
  "imdb_id": "tt2264082",
  "tmdb_id": "137678",
  "douban_id": null,
  "title": "Broche de Oro (2012)",
  "genres": [
    "Comedy"
  ],
  "country": "Puerto Rico",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.5,
  "director": [
    {
      "id": "nm0845157",
      "name": "Raúl Marchand Sánchez"
    }
  ],
  "writer": [
    {
      "id": "nm0845157",
      "name": "Raúl Marchand Sánchez",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0602630",
      "name": "Jacobo Morales",
      "character": "Rafael Medina"
    },
    {
      "id": "nm0305082",
      "name": "Adrian Garcia",
      "character": "Anselmo Rodríguez"
    },
    {
      "id": "nm0856730",
      "name": "Diego de la Texera",
      "character": "Pablo Díaz"
    },
    {
      "id": "nm0655056",
      "name": "Marian Pabon",
      "character": "Madre Superiora"
    },
    {
      "id": "nm0892774",
      "name": "Carmen Nydia Velásquez",
      "character": "Margarita"
    },
    {
      "id": "nm0284655",
      "name": "Carlos Esteban Fonseca",
      "character": "Alberto Medina"
    },
    {
      "id": "nm3321074",
      "name": "Luis Omar O'Farrill",
      "character": "Carlos Medina"
    },
    {
      "id": "nm2494620",
      "name": "Maria Coral Otero Soto",
      "character": "Sofía"
    },
    {
      "id": "nm0712070",
      "name": "Luis Raul",
      "character": "Norberto"
    },
    {
      "id": "nm4562239",
      "name": "Odalis Carela",
      "character": "Wanda"
    },
    {
      "id": "nm5177922",
      "name": "Willie Carrasco",
      "character": "Manolo"
    },
    {
      "id": "nm3185855",
      "name": "Eyra Aguero Joubert",
      "character": "Bartender Paloma"
    },
    {
      "id": "nm1098431",
      "name": "Flavia Manes Rossi",
      "character": "Michelle"
    },
    {
      "id": "nm2897624",
      "name": "Geronimo Mercado",
      "character": "Dj"
    },
    {
      "id": "nm2488817",
      "name": "Sara Pastor",
      "character": "Coco Galore"
    },
    {
      "id": "nm1083393",
      "name": "Wanda Rovira",
      "character": "Young Nun"
    },
    {
      "id": "nm1746694",
      "name": "Michael Stuart",
      "character": "Julio"
    }
  ],
  "overview": "Rafael, Elmo, and Pablo run away from the strict Catholic retirement home where they live with Carlos, Rafael's grandson, to embark on an adventure and prove life does not stop because of age.",
  "storyline": "Rafael, Elmo and Pablo run away from the strict Catholic retirement home where they live to enjoy one last weekend of debauchery and fun. Broche de Oro is a comedy road-trip of adventure and discovery. It celebrates the true power of friendship and living life to the fullest.",
  "plot": "Carlos (Luis Omar O'Farrill) is an aspiring surfer, whose father, Alberto (Carlos Esteban Fonseca), disapproves of his passion. They both visit Alberto's father, Rafael (Jacobo Morales), at the Catholic retirement home he lives in. Carlos is left with his grandfather and his friends Pablo (Diego de la Texera) and Anselmo (Adrián García), whom Pablo nicknames \"Elmo\". Alberto later picks up Carlos, he tells Rafael he and Carlos are moving to Orlando for his job, leaving Rafael without words. After leaving the retirement home and realizing what little time he has before he moves, Carlos calls Rafael later that night to invite him and his elder friends to a road trip to Loíza for a surfing competition and for Rafael to show him the family land. Early the next morning, the elders manage to sneak out of the retirement home through the kitchen and head out to Loíza with Carlos driving his father's car. After realizing their absence, the Madre Superiora of the retirement home (Marian Pabón) recurs to the help of Noberto (Luis Raúl), the home's security guard, to retrieve the elders and bring them back.\n\nMeanwhile, just arriving at the Medina family's land, Rafael shows Carlos the tree where the ashes of Rafael's wife are buried and leave afterwards for lunch at a nearby restaurant run by Margarita (Carmen Nydia Velázquez), a single mother whom Rafael helped her give birth before he retired from medicine, and her son Julio (Michael Stuart). Margarita develops a crush towards Anselmo, to which he does not like at first. Carlos, Rafael, Anselmo and Pablo head to Aviones Beach for the surfing competition, where Carlos meets Manolo (Willie Carrasco), another competitor, his girlfriend Sofía (Maria Coral Otero Soto) and her friend Wanda (Odalis Carela). Having placed second place, Carlos and the elders leave for a nearby bar run by Coco Galore (Sara Pastor), a French former porn actress and Pablo's film partner in such films, whose stage name was Chi-Chi Le Grand. Sofía and Wanda join Carlos at the bar where Manolo interrupts her and leaves the establishment angrily after punching Carlos and later puncturing the tires of Carlos' car.\n\nAlready packing up for Orlando, Alberto desperately calls Carlos but is answered by Rafael to which he tells he will pick up the car the next day while Carlos and the elders stay the night at Coco's. Later that night, Coco throws a party to which Carlos, Rafael, Anselmo, Pablo, Sofía, Wanda and Margarita join. Meanwhile, the Madre Superiora and Norberto experience what appears to be alien activity calling out his name and ends up on the car's roof claiming \"it was all so fast\". Rafael is later found collapsed inside Coco's guestroom by his grandson and helps him recover; Rafael confesses he's dealing with an illness but does not reveal which one.\n\nThe last day of the competition arrives and the Madre Superiora and Roberto finally found where the elders have been staying, after seeing Anselmo outside the street. As the competition starts, the Madre Superiora and Norberto finally caught the elders at the beach but the nun admires the surfing and reveals she used to surf when she was younger. Carlos wins first place and an infuriated Manolo pushes him and creates a commotion to which Rafael tries to defend his grandson but Manolo pushes him down on the sand and begins to have health complications. He is immediately rushed to the hospital with the help from Carlos, the Madre Superiora, Roberto, Alberto and a changed-of-heart Manolo. Alberto reconciles with his father after being so harsh on him and both have a heartfelt father-and-son moment in the hospital.\n\nAfter being released, Rafael returns to the retirement home. Anselmo marries Margarita and Pablo marries Coco in a double wedding with all their friends and family including Rafael, Carlos, Sofía and Julio, who is seen crying over his mother's marriage. Some time after the wedding, Rafael died, and his ashes were buried besides his wife's under the tree in the Medina family land in Loíza. In an additional scene before the credits, an off-camera elder tries to sneak out the retirement home but the Madre Superiora and Norberto confront the elder from escaping.",
  "synopsis": "Rafael, Elmo and Pablo run away from the strict Catholic retirement home where they live to enjoy one last weekend of debauchery and fun. Broche de Oro is a comedy road-trip of adventure and discovery. It celebrates the true power of friendship and living life to the fullest.Los amigos Rafael, Pablo y Anselmo escapan de un hogar de ancianos, y descubren que no hay edad para ser joven. Su viaje los lleva a la playa de Piñones, donde Carlos el nieto de Rafael participa en una competencia de surfing. Juntos viven un día lleno de aventuras, risas, amor y amistad que cambia la vida de todos y hace posible el reencuentro de tres generaciones. Broche de Oro celebra la vida y los lazos familiares que nos unen."
}