{
  "imdb_id": "tt2214863",
  "tmdb_id": "221562",
  "douban_id": null,
  "title": "Ghetto Goblin (2013)",
  "genres": [
    "Horror"
  ],
  "country": "South Africa",
  "version": [
    {
      "runtime": "72 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.9,
  "director": [
    {
      "id": "nm3408794",
      "name": "Jordan Harland"
    }
  ],
  "writer": [
    {
      "id": "nm3408794",
      "name": "Jordan Harland",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm4882687",
      "name": "Siphiwe Masinga",
      "character": "Sangoma Bheka"
    },
    {
      "id": "nm3492869",
      "name": "Vera Ephraim",
      "character": "Ayanda"
    },
    {
      "id": "nm5200537",
      "name": "Msimbithi Mahamba",
      "character": "Mthunzi"
    },
    {
      "id": "nm6263682",
      "name": "Sipho Xaba",
      "character": "Mutilated Corpse"
    },
    {
      "id": "nm5063611",
      "name": "Prince Mathebula",
      "character": "Prince"
    },
    {
      "id": "nm6263686",
      "name": "Njabulo Qindi",
      "character": "Tavern Patron"
    },
    {
      "id": "nm4976035",
      "name": "Ayanda Sunduza",
      "character": "Bongani"
    },
    {
      "id": "nm6263687",
      "name": "Taisen Mazibuko",
      "character": "Tokoloshe"
    },
    {
      "id": "nm4882458",
      "name": "Simon Msizi Nwamba",
      "character": "Reverend Simon"
    },
    {
      "id": "nm6263681",
      "name": "Andiswa Correta",
      "character": "Lindiwe"
    },
    {
      "id": "nm4882667",
      "name": "Refilwe Magane",
      "character": "Sindi"
    },
    {
      "id": "nm6263684",
      "name": "Nomthandazo Mokoena",
      "character": "Girl's mother"
    },
    {
      "id": "nm3874469",
      "name": "Itumeleng Mokoena",
      "character": "Journalist"
    },
    {
      "id": "nm6263683",
      "name": "Cora Mazibuko",
      "character": "Church Victim"
    },
    {
      "id": "nm6263685",
      "name": "Nokulunga Sophazi",
      "character": "Attacked girl in the bedroom"
    },
    {
      "id": "nm4882566",
      "name": "Petunia Gabrielle Modisapodi",
      "character": "Boithumelo"
    },
    {
      "id": "nm3409063",
      "name": "Graeme Read",
      "character": "Tokoloshe Growls"
    },
    {
      "id": "nm6263688",
      "name": "Bonga Nkomo",
      "character": "Voice of Tokoloshe"
    }
  ],
  "overview": "Strange attacks plague the township's women, leaving the town leaders at a loss to defend them. At the same time Mthnuzi, a shrewd businessman, is becoming wealthier and more popular with the ladies - something is amiss. The local reverend, Simon Nkosi, learns that Mthunzi is controlling a Tokoloshe to fulfill his greedy desires. In his greed he breaks a golden rule of maintaining control over the beast and it goes on a rampage. Now its thirst for blood is strong and comes after Mthunzi's women, saving the one he loves for last. Together with Reverend Simon they must take on a mythical beast that has never been defeated, to try and save.",
  "storyline": "Strange attacks plague the township's women, leaving the town leaders at a loss to defend them. At the same time Mthnuzi, a shrewd businessman, is becoming wealthier and more popular with the ladies - something is amiss. The local reverend, Simon Nkosi, learns that Mthunzi is controlling a Tokoloshe to fulfill his greedy desires. In his greed he breaks a golden rule of maintaining control over the beast and it goes on a rampage. Now its thirst for blood is strong and comes after Mthunzi's women, saving the one he loves for last. Together with Reverend Simon they must take on a mythical beast that has never been defeated, to try and save.",
  "plot": "Security Chief Odo (René Auberjonois) is having a succession of problems with Klingons. First, Quark (Armin Shimerman) complains about an elderly drunken Klingon monopolizing a holosuite. Odo removes the man, Kor (John Colicos), and takes him to a holding cell. A short time later, another Klingon, Koloth (William Campbell), comes to release him, but changes his mind when he sees he is still quite drunk. Jadzia Dax (Terry Farrell) overhears their names and realizes why they have come, which is confirmed when they are joined by a third Klingon, Kang (Michael Ansara). Eighty-one years ago, the three Klingons destroyed the power base of a pirate leader known as \"The Albino\" (Bill Bolender). The pirate retaliated by infecting each of their firstborn sons with a deadly virus. Curzon Dax, a close friend of the three Klingons, was godfather to Kang's murdered son, and the four of them swore a Klingon \"blood oath\" to find and kill the Albino. Now, eighty-one years later, Kang says he has finally found him.\n\nJadzia confides in Major Kira Nerys (Nana Visitor) that she feels obligated to pursue Curzon's oath, but Kira warns her about what killing someone will do to her. Kang, likewise, tells Jadzia that she is not bound by Curzon's oath, but she insists on joining their quest. Kor, as buoyant as ever, is delighted to have her along. Koloth is dismissive, until she shows him her skills with a Klingon bat'leth. Kang refuses to accept her, until she shames him with his own devotion to Klingon honor, and insists that she have the chance to avenge her godson. Before Jadzia can request a leave of absence, Commander Benjamin Sisko (Avery Brooks) confronts her in her quarters, refusing her request before she can make it. Jadzia tells him that she is going and begs him not to make her disobey a direct order. He does not give her permission to go but does not stop her either.\n\nWhilst en route to the Albino's hideout, the four plan their attack. Kang suggests an aggressive frontal assault, which the Klingons agree to. Jadzia confronts him afterwards and finds out that he had already been in contact with the Albino who offered him a glorious death at the hands of forty of his best men, and Kang accepted as he believes the Albino's defences are impenetrable. Dax creates an alternative plan to disable all energy weapons in the Albino's base, requiring them to use hand-to-hand combat only. Kang agrees to the new plan. They transport to the surface and find that the Albino attempted to booby trap the main gate to kill Kang and the others before a fight started. The four move through the compound and confront the Albino in his chambers. During the fight, Koloth is killed and Kang is mortally wounded. Jadzia disarms the Albino and allows Kang to kill him, before he dies himself. Kor and Jadzia leave the compound as the Klingon sings a song to his fallen comrades.",
  "synopsis": null
}