{
  "imdb_id": "tt2294619",
  "tmdb_id": "136928",
  "douban_id": null,
  "title": "First Winter (2012)",
  "genres": [
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "88 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.8,
  "director": [
    {
      "id": "nm2196568",
      "name": "Benjamin Dickinson"
    }
  ],
  "writer": [
    {
      "id": "nm2196568",
      "name": "Benjamin Dickinson",
      "description": "as Ben Dickinson"
    }
  ],
  "cast": [
    {
      "id": "nm2204368",
      "name": "Samantha Jacober",
      "character": "Sam"
    },
    {
      "id": "nm3026487",
      "name": "Jennifer Kim",
      "character": "Jen"
    },
    {
      "id": "nm2698115",
      "name": "Lindsay Burdge",
      "character": "Marie"
    },
    {
      "id": "nm3674882",
      "name": "Haruka Hashimoto",
      "character": "Haruka"
    },
    {
      "id": "nm5122208",
      "name": "Monika Heidemann",
      "character": "Monika"
    },
    {
      "id": "nm5122363",
      "name": "Fonlin Nyeu",
      "character": "Fonlin"
    },
    {
      "id": "nm3349012",
      "name": "Luke Simon",
      "character": "Luke"
    },
    {
      "id": "nm5122293",
      "name": "Jeff Thrope",
      "character": "Jeff"
    },
    {
      "id": "nm4961492",
      "name": "Matthew Chastain",
      "character": "Matt"
    },
    {
      "id": "nm2196568",
      "name": "Benjamin Dickinson",
      "character": "Thomas"
    },
    {
      "id": "nm5122322",
      "name": "Bill Dunn",
      "character": "Radio Announcer"
    },
    {
      "id": "nm5122370",
      "name": "Paul Green",
      "character": "Radio DJ"
    },
    {
      "id": "nm4961176",
      "name": "Paul Manza",
      "character": "Paul"
    },
    {
      "id": "nm3338354",
      "name": "Kate Lyn Sheil",
      "character": "Kate"
    },
    {
      "id": "nm3598576",
      "name": "Jaffe Zinn",
      "character": "Jaffe"
    }
  ],
  "overview": "When winter begins, life is serene for a group of new-age Brooklynites living in a remote country farmhouse. Sex, drugs, yoga, and organic cooking absorb their days, safely tucked away from the stresses of urban life. But when a blackout of apocalyptic proportions strands them with no heat and no electricity during the coldest winter on record, their utopian commune is breached by anxiety and their idyllic harmony begins to lose its tune. As time wears on and the food supply dwindles, power struggles, jealousy, and desire threaten the group's ability to work together in order to survive.",
  "storyline": "During a winter of record-breaking cold; an apocalyptic blackout strands a group of Brooklynites in a remote farmhouse. At first it's a party of sex; drugs; and yoga. But as supplies dwindle; they turn against one another.",
  "plot": null,
  "synopsis": "When winter begins, life is serene for a group of new-age Brooklynites living in a remote country farmhouse. Sex, drugs, yoga, and organic cooking absorb their days, safely tucked away from the stresses of urban life. But when a blackout of apocalyptic proportions strands them with no heat and no electricity during the coldest winter on record, their utopian commune is breached by anxiety and their idyllic harmony begins to lose its tune. As time wears on and the food supply dwindles, power struggles, jealousy, and desire threaten the group's ability to work together in order to survive. In this extraordinary debut feature, filmmaker Benjamin Dickinson explores the fundamental instincts of human nature that arise when perseverance and beliefs are not only tested, but taken to their limits. Nuanced, authentic performances escalate with heightened emotion, while ethereal landscapes intimate that the poetic world of First Winter exists in an undefined time and space, perhaps not so far apart from our own."
}