{
  "imdb_id": "tt2253939",
  "tmdb_id": "135281",
  "douban_id": null,
  "title": "Camille Rewinds (2012)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "115 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.3,
  "director": [
    {
      "id": "nm0527852",
      "name": "Noémie Lvovsky"
    }
  ],
  "writer": [
    {
      "id": "nm1444949",
      "name": "Maud Ameline",
      "description": "screenplay"
    },
    {
      "id": "nm0527852",
      "name": "Noémie Lvovsky",
      "description": "screenplay"
    },
    {
      "id": "nm0559782",
      "name": "Pierre-Olivier Mattei",
      "description": "screenplay"
    },
    {
      "id": "nm0786905",
      "name": "Florence Seyvos",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0527852",
      "name": "Noémie Lvovsky",
      "character": "Camille Vaillant"
    },
    {
      "id": "nm0346363",
      "name": "Samir Guesmi",
      "character": "Éric"
    },
    {
      "id": "nm2349395",
      "name": "Judith Chemla",
      "character": "Josepha"
    },
    {
      "id": "nm4280460",
      "name": "India Hair",
      "character": "Alice"
    },
    {
      "id": "nm1029367",
      "name": "Julia Faure",
      "character": "Louise"
    },
    {
      "id": "nm0603446",
      "name": "Yolande Moreau",
      "character": "La mère de Camille"
    },
    {
      "id": "nm0904273",
      "name": "Michel Vuillermoz",
      "character": "Le père de Camille"
    },
    {
      "id": "nm0687914",
      "name": "Denis Podalydès",
      "character": "Alphonse Da Costa - le prof de physique"
    },
    {
      "id": "nm0529543",
      "name": "Jean-Pierre Léaud",
      "character": "Monsieur Dupont, l'horloger"
    },
    {
      "id": "nm3228320",
      "name": "Vincent Lacoste",
      "character": "Vincent"
    },
    {
      "id": "nm0503919",
      "name": "Micha Lescot",
      "character": "Le prof de théâtre"
    },
    {
      "id": "nm0023348",
      "name": "Anne Alvaro",
      "character": "La prof d'anglais à qui Camille demande de l'adopter"
    },
    {
      "id": "nm0023832",
      "name": "Mathieu Amalric",
      "character": "Le prof de français sadique"
    },
    {
      "id": "nm3176551",
      "name": "Riad Sattouf",
      "character": "Le réalisateur"
    },
    {
      "id": "nm1117318",
      "name": "Elsa Amiel",
      "character": "L'assistante réalisatrice"
    },
    {
      "id": "nm5268080",
      "name": "Christian Dubouis",
      "character": "Le boucher assassin"
    },
    {
      "id": "nm0903845",
      "name": "Gaëtan Vourc'h",
      "character": "L'agent immobilier"
    },
    {
      "id": "nm1081257",
      "name": "Esther Garrel",
      "character": "Mathilde"
    },
    {
      "id": "nm2002983",
      "name": "Jana Bittnerova",
      "character": "La prof d'histoire"
    },
    {
      "id": "nm3035751",
      "name": "Aurore Broutin",
      "character": "L'infirmière"
    },
    {
      "id": "nm1130095",
      "name": "Nathalie Kanoui",
      "character": "La conseillère d'éducation"
    },
    {
      "id": "nm4773891",
      "name": "Alice Amiel",
      "character": "Le première peste"
    },
    {
      "id": "nm0126899",
      "name": "Marie Béraud",
      "character": "La deuxième peste"
    },
    {
      "id": "nm3333908",
      "name": "Adeline D'Hermy",
      "character": "La troisième peste       (as Adeline d'Hermy pensionnaire de la Comédie Française)"
    },
    {
      "id": "nm3226187",
      "name": "Anthony Sonigo",
      "character": "Nourredine"
    },
    {
      "id": "nm5268071",
      "name": "Gildas Milin",
      "character": "Le médecin"
    },
    {
      "id": "nm6466492",
      "name": "Christophe Daci",
      "character": "L'assistant réalisateur"
    },
    {
      "id": "nm3292138",
      "name": "Salim Torki",
      "character": "L'homme du bar"
    }
  ],
  "overview": "Camille was only sixteen and still in high school when she fell in love with Eric, another student. They later married and a child and were happy for a while. But now twenty-five years have passed and Eric leaves her for a younger woman. Bitter and desperate Camille drinks so much liquor at a New Year Eve's party that she falls into an ethylic coma and she finds herself... propelled into her own past! Camille is sixteen again when she wakes up this morning, her parents are not dead anymore and she must go to school, where she will meet her schoolmates and, of course, Eric. Is she going to fall for him again and... be miserable twenty-five years later? Or will she avoid him with the result never having her beloved daughter? Who ever said that time traveling was fun?",
  "storyline": "Camille was only sixteen and still in high school when she fell in love with Eric, another student. They later married and a child and were happy for a while. But now twenty-five years have passed and Eric leaves her for a younger woman. Bitter and desperate Camille drinks so much liquor at a New Year Eve's party that she falls into an ethylic coma and she finds herself... propelled into her own past! Camille is sixteen again when she wakes up this morning, her parents are not dead anymore and she must go to school, where she will meet her schoolmates and, of course, Eric. Is she going to fall for him again and... be miserable twenty-five years later? Or will she avoid him with the result never having her beloved daughter? Who ever said that time traveling was fun?",
  "plot": "Jack Frost awakens from a frozen pond with amnesia. Upon realizing no one can see or hear him, he disappears. Three hundred years later Jack, as the spirit of Winter, enjoys delivering snow days to school kids, but resents that they don't believe in him. At the North Pole, the Man in the Moon warns Nicholas St. North that Pitch Black is threatening the children of the world with his nightmares. He calls E. Aster Bunnymund, Sandy, and Tooth, to arms. They are then told that Jack Frost has been chosen to be a new Guardian. Jack is unimpressed by this position, as he still resents not being believed in, but North convinces him to aid them.\n\nVisiting Tooth's world, Jack learns that baby teeth contain childhood memories of the children who lost them; Jack's teeth are included, but tells Tooth he doesn't remember. However, Pitch raids Tooth's home in order to kidnap all of her subordinate tooth fairies except Baby Tooth, whom Jack saved, so that the children's teeth can't be collected and steals all the teeth, thus preventing Tooth from sharing Jack's memories and causing children to not believe in Tooth. In order to thwart Pitch's plan, the group decides to collect children's teeth. During their journey, a quarrel between North and Bunnymund awakens a boy, Jamie. Since he still believes, he can see everybody except for Jack. Pitch's nightmares then attack, provoking Sandy as the Guardian of Dreams. Jack aids, but Sandy is killed by Pitch.\n\nAs Easter approaches, the dejected Guardians gather in Bunnymund's home. With the unexpected aid of Jamie's little sister, Sophie, they begin the process of painting eggs for Easter. After Jack takes Sophie home, he is lured to Pitch's lair by a voice. Pitch taunts him with his memories and fear of non-belief, distracting him long enough for Pitch to destroy the eggs, causing children to stop believing in Easter and Bunnymund. Losing his trust in the Guardians, Jack isolates himself in Antarctica, where Pitch tries to convince him to join his side. When Jack refuses, Pitch threatens to kill Baby Tooth unless Jack gives him his staff. He agrees, but Pitch breaks Jack's staff and throws him down a chasm. Unlocking his memories, he learns that he was a mortal teenager who fell into ice while saving his younger sister. Inspired, Jack fixes his staff and returns to the lair to rescue the kidnapped baby fairies.\n\nDue to Pitch, every child in the world except Jamie disbelieves, weakening the Guardians. Finding Jamie's belief wavering, Jack makes it snow in his room, renewing belief and causing Jack to be seen and heard for the first time. Jack and Jamie gather the boy's friends, whose renewed belief bolsters their fight against Pitch. Pitch threatens them, but their dreams prove stronger than his nightmares, resulting in Sandy's resurrection. Defeated and disbelieved in, Pitch tries to retreat, but his nightmares turn on him and trap him in his lair. Afterward, Jamie and his friends bid goodbye to the Guardians as Jack accepts his place as the Guardian of Fun.",
  "synopsis": null
}