{
  "imdb_id": "tt2273326",
  "tmdb_id": "168583",
  "douban_id": null,
  "title": "Move On (2012)",
  "genres": [
    "Action",
    "Drama",
    "Thriller"
  ],
  "country": "Denmark",
  "version": [
    {
      "runtime": "140 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm1300606",
      "name": "Asger Leth"
    }
  ],
  "writer": [
    {
      "id": "nm0339043",
      "name": "Matt Greenhalgh",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0586568",
      "name": "Mads Mikkelsen",
      "character": "Mark"
    },
    {
      "id": "nm4387549",
      "name": "Gabriela Marcinková",
      "character": "Agent"
    },
    {
      "id": "nm0279010",
      "name": "Karl Fischer",
      "character": "Contact"
    },
    {
      "id": "nm0275708",
      "name": "Béla Ficzere",
      "character": "Mike (Hungary)"
    },
    {
      "id": "nm5337791",
      "name": "Zsolt Fehérvári",
      "character": "Best Man (Hungary)"
    },
    {
      "id": "nm4245079",
      "name": "David Akinloye",
      "character": "Pedestrian"
    },
    {
      "id": "nm3131371",
      "name": "Virág Bárány",
      "character": "Bride (Hungary)"
    },
    {
      "id": "nm5337835",
      "name": "Ágnes Gáspár",
      "character": "Bride's mother (Hungary)"
    },
    {
      "id": "nm6929998",
      "name": "Raphaela Holden",
      "character": "Bodyguard"
    },
    {
      "id": "nm1772697",
      "name": "Ottó Juhász",
      "character": "Keyboard Player (Hungary)"
    },
    {
      "id": "nm2198564",
      "name": "Bence Lajkó",
      "character": "Groom (Hungary)"
    },
    {
      "id": "nm0487884",
      "name": "Alexandra Maria Lara",
      "character": "Szefowa Lena"
    },
    {
      "id": "nm2540265",
      "name": "Andrea Lehoczky",
      "character": "Mike's wife (Hungary)"
    },
    {
      "id": "nm0559043",
      "name": "Paul Matic",
      "character": "Hotel manager Vienna"
    },
    {
      "id": "nm5058658",
      "name": "Nadja Laura Mijthab",
      "character": "Female Bodyguard"
    },
    {
      "id": "nm0592285",
      "name": "Petar Mircevski",
      "character": ""
    },
    {
      "id": "nm2936885",
      "name": "Rob Rafalat",
      "character": "Wedding Videographer (Hungary)"
    }
  ],
  "overview": "Move On is a road movie like no other, because it is inspired by film fans from all over Europe! This breath-taking movie directed by Asger Leth features Mads Mikkelsen on a secret mission in 8 episodes, each taking place in a different European country.",
  "storyline": "An unusual road trip beginning in the Netherlands takes a series of unexpected turns through Germany and Eastern Europe.",
  "plot": "Ex-fighter pilot and taxi driver Ted Striker (Robert Hays) became traumatized during the War, leading to a pathological fear of flying. As a result, he is unable to hold a responsible job. His wartime girlfriend, Elaine Dickinson (Julie Hagerty), now a flight attendant, leaves him. Striker nervously boards a Boeing 707 (Trans American Flight 209) from Los Angeles to Chicago on which she is serving, hoping to win her back, but she rebuffs him.\n\nAfter dinner is served, many of the passengers fall ill, and fellow passenger Dr. Rumack (Leslie Nielsen) deduces that the passengers have contracted food poisoning from the fish. The cockpit crew, including pilot Clarence Oveur (Peter Graves) and co-pilot Roger Murdock (Kareem Abdul-Jabbar), have also been affected, leaving no one to fly the plane. Elaine contacts the Chicago control tower for help, and is instructed by tower supervisor Steve McCroskey (Lloyd Bridges) to activate the plane's autopilot, a large inflatable pilot doll (listed as \"Otto\" in the end credits), which will get them to Chicago, but will not be able to land the plane. Rumack convinces Striker to fly the plane, though Striker feels unable to handle the pressure and the unfamiliar aircraft.\n\nMcCroskey knows that he must get someone else to help take the plane down and calls Rex Kramer (Robert Stack), Striker's commanding officer in the war. Despite their hostile relationship, he is the best choice to instruct Striker. As the plane nears Chicago, Striker is overcome by stress but regains confidence after a pep talk from Dr. Rumack. With Kramer's advice, Striker is able to land the plane safely with only minor injuries to some passengers. Striker's courage rekindles Elaine's love for him, and the two share a kiss. Both then wave farewell to \"Otto\" as he takes off in the evacuated plane after inflating a female companion.",
  "synopsis": null
}