{
  "imdb_id": "tt2298780",
  "tmdb_id": "203584",
  "douban_id": null,
  "title": "The Last Ocean (2012)",
  "genres": [
    "Documentary"
  ],
  "country": "New Zealand",
  "version": [
    {
      "runtime": "88 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.0,
  "director": [
    {
      "id": "nm4430531",
      "name": "Peter Young"
    }
  ],
  "writer": [
    {
      "id": "nm0486718",
      "name": "Richard Langston",
      "description": null
    },
    {
      "id": "nm4430531",
      "name": "Peter Young",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0229652",
      "name": "Dave Dobbyn",
      "character": "Himself"
    }
  ],
  "overview": "Californian ecologist David Ainley has been traveling to the Ross Sea to study this unique ecosystem for more than thirty years. He has written scientific papers describing it as a ‘living laboratory’. Largely untouched by humans, it is one of the last places where the delicate balance of nature prevails. But an international fishing fleet has recently found its way to the Ross Sea. It is targeting Antarctic toothfish, sold as Chilean sea bass in up-market restaurants around the world.  The catch is so lucrative it is known as white gold. Ainley knows that unless fishing is stopped the natural balance of the Ross Sea will be lost forever. Together they form ‘the Last Ocean’ and begin a campaign taking on the commercial fishers and governments in a race to protect Earth’s last untouched ocean from our insatiable appetite for fish.",
  "storyline": "The Last Ocean The Ross Sea, Antarctica is the most pristine stretch of ocean on Earth. A vast, frozen landscape that teems with life - whales, seals and penguins carving out a place on the very edge of existence. Californian ecologist David Ainley has been traveling to the Ross Sea to study this unique ecosystem for more than thirty years. He has written scientific papers describing it as a 'living laboratory'. Largely untouched by humans, it is one of the last places where the delicate balance of nature prevails. But an international fishing fleet has recently found its way to the Ross Sea. It is targeting Antarctic toothfish, sold as Chilean Seabass in up-market restaurants around the world. The catch is so lucrative it is known as white gold. Ainley knows that unless fishing is stopped the natural balance of the Ross Sea will be lost forever. He rallies his fellow scientists and meets up with a Colorado nature photographer and New Zealand filmmaker who also share a deep passion ...",
  "plot": "This article's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (June 2016) (Learn how and when to remove this template message)\nIn Canada, novelist Yann Martel meets Pi Patel, who has been told that Pi's life story would be a good subject for a book. Pi tells his story to Yann:\n\nPi's father names him Piscine Molitor after the swimming pool in France. In secondary school in Pondicherry, he adopts the name \"Pi\" (the Greek letter, π) to avoid the sound-alike nickname \"Pissing Patel\". He is raised Hindu family with both vegetarian and non-vegetarian, but at 12 years old, is introduced to Christianity and then Islam, and decides to follow all three religions as he \"just wants to love God\". His mother supports his desire to grow, but his father, a rationalist, tries to convert him. Pi's family owns a zoo, and Pi takes interest in the animals, especially a Bengal tiger named Richard Parker. After Pi gets dangerously close to Richard Parker, his father forces him to witness the tiger killing a goat.\n\nWhen Pi is 16, his father announces that they must move to Canada, where he intends to settle and sell the animals. The family books passage with the animals on a Japanese freighter. During a storm, the ship founders while Pi is on deck. He tries to find his family, but a member of the crew throws him into a lifeboat. A freed zebra jumps onto the boat with him, breaking its leg as it lands. The ship is submerged into the Mariana Trench with the crew and his family. Pi sees what appears to be a survivor, but it turns out to be Richard Parker, which evades his efforts to keep him out of the boat.\n\nAfter the storm, Pi awakens in the lifeboat with the zebra, and is shortly joined by a surviving orangutan. A spotted hyena emerges from a tarpaulin covering half of the lifeboat and snaps at Pi, forcing him to retreat to the end of the boat. It kills the zebra and later the orangutan. Richard Parker emerges from under the tarpaulin, killing the hyena and attempting to kill Pi, before retreating back to cover for several days.\n\nPi fashions a small tethered raft from flotation vests which he retreats to for safety from Richard Parker. Despite his moral code against killing, he begins fishing, enabling him to sustain the tiger as well. When the tiger jumps into the sea to hunt for fish, Pi considers letting him drown, but ultimately helps him back into the boat. One night, a humpback whale breaches near the boat, destroying the raft and its supplies. Pi trains Richard Parker to accept him in the boat, and realizes that caring for the tiger is also keeping himself alive.\n\nWeeks later they encounter a floating island of interconnected trees. It is a lush jungle of edible plants, fresh water pools and a large population of meerkats, enabling Pi and Richard Parker to eat and drink freely and regain strength. At night, the island transforms into a hostile environment. Richard Parker retreats to the lifeboat while Pi and the meerkats sleep in the trees; the water pools turn acidic, digesting the fish in them. Pi deduces that the island is carnivorous after finding a human tooth embedded in a flower.\n\nPi and Richard Parker leave the island, and eventually reach the coast of Mexico. Pi is saddened that Richard Parker does not acknowledge him before disappearing into the jungle. He is rescued and brought to a hospital. Insurance agents for the Japanese freighter company interview him, but do not believe his story and ask what \"really\" happened. He tells a different story, in which the animals are replaced by human survivors of the shipwreck: his mother for the orangutan, an amiable sailor for the zebra, and the ship's brutish cook for the hyena. In this story, Pi kills the cook and feeds on his flesh until he reaches Mexico. The insurance agents are not satisfied with this story either, but they leave without questioning Pi further.\n\nYann recognizes the parallels between the two stories, noting that in the second one, Pi fills the role of the tiger. Pi asks which story the writer prefers, and Yann chooses the first, to which Pi replies, \"and so it goes with God\". Glancing at a copy of the insurance report, Yann sees that the agents also chose the first story.",
  "synopsis": null
}