{
  "imdb_id": "tt2263814",
  "tmdb_id": "278348",
  "douban_id": null,
  "title": "The Maid's Room (2013)",
  "genres": [
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "98 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm0908037",
      "name": "Michael Walker"
    }
  ],
  "writer": [
    {
      "id": "nm0908037",
      "name": "Michael Walker",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0305519",
      "name": "Paula Garcés",
      "character": "Drina"
    },
    {
      "id": "nm0001711",
      "name": "Annabella Sciorra",
      "character": "Mrs. Crawford"
    },
    {
      "id": "nm0131966",
      "name": "Bill Camp",
      "character": "Mr. Crawford"
    },
    {
      "id": "nm3464684",
      "name": "Philip Ettinger",
      "character": "Brandon Crawford"
    },
    {
      "id": "nm0041280",
      "name": "Remy Auberjonois",
      "character": "Father Niles"
    },
    {
      "id": "nm3936560",
      "name": "John Brodsky",
      "character": "Victor"
    },
    {
      "id": "nm3408439",
      "name": "Stefanie Brown",
      "character": "Stacy"
    },
    {
      "id": "nm1156914",
      "name": "Herman Chavez",
      "character": "Carlos"
    },
    {
      "id": "nm1216253",
      "name": "Bonnie Dennison",
      "character": "Alice"
    },
    {
      "id": "nm6341651",
      "name": "Paco Lozano",
      "character": "Migrant Farm Worker"
    },
    {
      "id": "nm6553870",
      "name": "Billy Martin",
      "character": ""
    },
    {
      "id": "nm2556266",
      "name": "Julio C. Peña",
      "character": "Juan"
    },
    {
      "id": "nm1426836",
      "name": "Alexis Suarez",
      "character": "Rodrigo"
    }
  ],
  "overview": "Drina, a young immigrant working as a live-in maid for a wealthy Long Island family, finds herself entangled in the family's web of dark secrets once she begins to suspect her employer's son has committed a terrible crime.",
  "storyline": "Set entirely on the posh east end of Long Island (where it was filmed), THE MAID'S ROOM centers around Drina, an attractive, intelligent immigrant who takes a job for the season as live-in maid to the Crawfords, a privileged New York family who maintain a splendid home in the Hamptons. The job could be worse, since Mr. and Mrs. Crawford spend most of their time in the city, but their teenage son, Brandon, who is starting Princeton in the fall, is summering at the beach, and Drina must look after him and his spoiled friends. Since the maid's room is next to the garage, Drina can't help noticing when Brandon returns late one night, noisily and obviously drunk. The next day, she sees that Brandon's car is battered and bloodied and, when she reads in the local paper that there has been a fatal hit and run, it's clear who's responsible. Knowing the Crawford's will do anything to protect their precious son, Drina realizes that, for once, she has some power over her employers. Though the ...",
  "plot": "Solange and Claire are two housemaids who construct elaborate sadomasochistic rituals when their mistress (Madame) is away. The focus of their role-playing is the murder of Madame, and they take turns portraying either side of the power divide. The deliberate pace and devotion to detail guarantees that they always fail to actualize their fantasies by ceremoniously \"killing\" Madame at the ritual's denouement.",
  "synopsis": null
}