{
  "imdb_id": "tt2268573",
  "tmdb_id": "196830",
  "douban_id": null,
  "title": "Stranded (2013)",
  "genres": [
    "Horror",
    "Sci-Fi"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    },
    {
      "runtime": "90 min",
      "description": "Extended Edition"
    }
  ],
  "imdb_rating": 3.5,
  "director": [
    {
      "id": "nm0002337",
      "name": "Roger Christian"
    }
  ],
  "writer": [
    {
      "id": "nm3588335",
      "name": "Christian Piers Betley",
      "description": null
    },
    {
      "id": "nm0002337",
      "name": "Roger Christian",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0000225",
      "name": "Christian Slater",
      "character": "Gerard"
    },
    {
      "id": "nm1287928",
      "name": "Amy Matysio",
      "character": "Ava"
    },
    {
      "id": "nm0857576",
      "name": "Michael Therriault",
      "character": "Bruce"
    },
    {
      "id": "nm0270451",
      "name": "Brendan Fehr",
      "character": "Lance"
    },
    {
      "id": "nm2422851",
      "name": "Ryland Alexander",
      "character": "Marrietta"
    },
    {
      "id": "nm2886691",
      "name": "Lyndon Bray",
      "character": "Madsen"
    },
    {
      "id": "nm2965043",
      "name": "Mark D. Claxton",
      "character": "Guard #1       (as Mark Claxton)"
    }
  ],
  "overview": "The Lunar Base Ark explores ore and unexpectedly is hit by a meteor shower and has severe damages. Colonel Gerard Brauchman sends the crewwoman Ava Cameron to repair a wing that is full of CO2. Dr. Lance Krauss warns that the gas may cause paranoia and hallucinations. Ava brings a sample of the meteor for analysis and Dr. Krauss finds that there are spores attached to the meteor. Ava accidentally cuts her finger in a sample but she hides the cut from the doctor. Soon Ava gets pregnant and delivers an alien offspring. However, neither Col. Brauchman nor Dr. Kraus believes in her words and they believe that Ava is delusional. He offspring bites the crewman Bruce Johns and the crew discovers that Bruce has been cloned by the alien. Soon they find how dangerous the clone is.",
  "storyline": "The Lunar Base Ark is hit by a meteor shower and has severe damage. Colonel Gerard Brauchman sends Ava Cameron to repair a wing that is full of carbon monoxide. Dr. Lance Krauss warns that the gas may cause paranoia and hallucinations. Ava brings a sample of the meteor for analysis and Dr. Krauss finds that there are spores attached to the meteor. Ava accidentally cuts her finger in a sample but she hides the cut from the doctor. Soon Ava gets pregnant and delivers an alien offspring. Brauchman and Kraus believe that Ava is delusional. The offspring bites the crewman Bruce Johns and produces a clone of him.",
  "plot": "Four isolated astronauts in the lunar mining base Ark suffer a meteor storm. While inspecting the damage caused by the meteors, astronaut Ava Cameron discovers spores contained in one of the fragments and brings them back to the base for investigation. The medical officer discovers that these spores can grow rapidly, and in the process Ava is contaminated with them. Shortly afterward, Ava shows evident signs of a rapidly progressing pregnancy and, a few hours later, she goes into labor. The life form escapes the lab, and none of the others believe Ava's stories; they instead attribute her pregnancy to a cyst. The alien stalks crew member Johns, eventually taking his shape and killing him. Using notes posthumously left by Johns, Ava and Col. Brauchman attempt to kill the alien before it can kill them. Eventually, Ava and Brauchman prepare to abandon the base in an escape pod, but it is hijacked by the alien. Ava and Brauchman, having expended most of the base's remaining power to ready the escape pod, are resigned to their fates until a rescue ship arrives from Earth. Brauchman sends a message to Earth from the rescue ship, warning them to kill whatever they discover in the escape pod, but it's revealed that the alien has escaped.",
  "synopsis": null
}