{
  "imdb_id": "tt2293750",
  "tmdb_id": "242033",
  "douban_id": null,
  "title": "Scorned (2013)",
  "genres": [
    "Comedy",
    "Crime",
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "86 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.7,
  "director": [
    {
      "id": "nm0428751",
      "name": "Mark Jones"
    }
  ],
  "writer": [
    {
      "id": "nm0428751",
      "name": "Mark Jones",
      "description": null
    },
    {
      "id": "nm2048731",
      "name": "Sadie Katz",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0000708",
      "name": "Billy Zane",
      "character": "Kevin"
    },
    {
      "id": "nm1715118",
      "name": "AnnaLynne McCord",
      "character": "Sadie"
    },
    {
      "id": "nm2130586",
      "name": "Viva Bianca",
      "character": "Jennifer"
    },
    {
      "id": "nm4095508",
      "name": "Doug Drucker",
      "character": "Scary Guy"
    },
    {
      "id": "nm4835083",
      "name": "Marian Weage",
      "character": "Mrs. Wilkes"
    },
    {
      "id": "nm5178294",
      "name": "Jim Midock",
      "character": "Heavier Cop       (as Jim M. Midock)"
    },
    {
      "id": "nm2244220",
      "name": "Juan-Pablo Veizaga",
      "character": "Other Cop       (as Juan-Pablo Vega)"
    },
    {
      "id": "nm4094292",
      "name": "Scott Knisley",
      "character": "Detective       (as Scott M. Knisley)"
    },
    {
      "id": "nm5178259",
      "name": "Martin Sprock",
      "character": "Detective Partner"
    },
    {
      "id": "nm2048731",
      "name": "Sadie Katz",
      "character": "Waitress"
    },
    {
      "id": "nm2677642",
      "name": "Denise Glass",
      "character": "Cute Waitress"
    },
    {
      "id": "nm5197488",
      "name": "Nathan R. Wheeler",
      "character": "Male Paramedic       (as Nathan Wheeler)"
    },
    {
      "id": "nm5301115",
      "name": "Brooklynn Brokaw",
      "character": "Female Paramedic"
    },
    {
      "id": "nm4545014",
      "name": "Joe Kurak",
      "character": "Handsome Guy       (as Joe A. Kurak)"
    },
    {
      "id": "nm8465576",
      "name": "Christopher Maggio",
      "character": "Bartender"
    },
    {
      "id": "nm0428751",
      "name": "Mark Jones",
      "character": "Cop Holding Bootsie"
    },
    {
      "id": "nm5568145",
      "name": "Bootsie",
      "character": "Bootsie"
    },
    {
      "id": "nm8465577",
      "name": "Victoria Davidoff",
      "character": "Young Sadie"
    },
    {
      "id": "nm8465578",
      "name": "Alivia Haines",
      "character": "Sister"
    },
    {
      "id": "nm0061442",
      "name": "Rich Grosso",
      "character": "Dead Guy in Alley"
    }
  ],
  "overview": "Sadie and Kevin have decided to spend a romantic weekend together at his lake house.  But when an unexpected- and unfortunate- text from her best friend Jennifer to Kevin reveals a lurid love affair between the two, Sadie spirals a into a hunger for revenge.",
  "storyline": "If you're going to cheat on your lover, don't get caught. And if you do get caught, you'd better hope your lover isn't secretly insane. Kevin learns the hard way when his girlfriend Sadie (AnnaLynne McCord of \"90210\") discovers that he's having a scorching affair with her best friend (Viva Bianca of \"Spartacus\"). Now Sadie has planned a romantic weekend getaway for just the three of them, complete with terror, torture and twisted psychosexual games. The trap is set. The party has begun. And tonight, hell hath no fury like a woman SCORNED.",
  "plot": "Kevin (Billy Zane) and Sadie (AnnaLynne McCord) have been dating for six months, and Sadie tells her friend Jennifer (Viva Bianca) that she believes Kevin will propose to her on a weekend getaway, and invited her to be maid of honor. Jennifer cautions Sadie about marrying a man she has only known six months. At their weekend away, Sadie finds a sexual text from another woman on Kevin's phone\n\nAn argument ensues, and Sadie pepper-sprays Kevin and knocks him out with a fireplace log. Kevin awakens tied to a chair. At first confused and seemingly believing it to be some sexual fantasy, he remains calm. However, Sadie tells him that she knows about his affair with Jennifer. Sadie, pretending to be Kevin, says Sadie and Kevin have broken up and invites Jennifer to join him. Sadie takes Kevin to their bedroom, ties him to the bed and gags him, then places candles and rose petals as well as some spiked champagne for Jennifer. Jennifer arrives, follows the petals, drinks the champagne and quickly undresses.\n\nAs Jennifer reclines atop Kevin, believing his gag and other ties to be a sexual fantasy, Sadie knocks her out. Jennifer wakes up in a bathtub in which Sadie tells her that in olden days adulterers had their hair cut off, which Sadie proceeds to do to her. Jennifer and Kevin wake up with Jennifer now tied to the bed and Kevin tied to a chair. Bringing up both a microwave and Jennifer's dog, Bootsie, Sadie threatens to microwave the dog if Kevin doesn't perform oral sex on Jennifer. Sadie justifies this as being a cure for them and saying now they don't have to do it behind her back, Kevin eventually agrees. After feeding them and fending off a visiting neighbor, Sadie stops Kevin from getting his gun. In retaliation, Sadie electrocutes the pair and puts Jennifer's hand in a machine that breaks all her fingers. She also breaks Kevin's ankle with a sledge hammer.\n\nSadie tells Jennifer the story of her childhood dog. She loved the dog but the dog fell in love with her sister, so Sadie drowned her sister. She adds that she never blamed the dog. Upstairs, she tells Kevin that they need to get rid of his wandering eye and partially blinds him. Sadie takes Jennifer to a boat, planning to drown her, but Jennifer escapes and intercept a car, only to find Sadie driving. Once caught and driving with Sadie, Jennifer falsely professes her love for Sadie, saying that the affair was to end their relationship so she could be with Sadie. Jennifer kisses Sadie and then rolls out of the car in an attempt to get away but hurts herself. Sadie gets out of the car and chokes Jennifer seemingly to death.\n\nDriving away, Sadie is pulled over by the police who tell her that a criminal has broken out of jail and she should keep an eye out. Jennifer, however, is still alive and stumbles toward the police, only to be hit by an oncoming truck. Sadie drives away and, finding the criminal, lets him into the car. She proceeds to have sex with him and then kills him, thanking him for being her alibi. Driving back to the house, she finds Kevin has broken free and chases him. Kevin dodges the bullets she fires and manages to make it to the boat, but dies in the ensuing fight. Sadie sets up the scene as if the criminal raped her and killed her boyfriend and tells this to the police, using her mangled fingers, which she also put in the machine, as evidence. A few months later, Sadie has a new boyfriend, who is revealed to be cheating on her, too.",
  "synopsis": null
}