{
  "imdb_id": "tt2212008",
  "tmdb_id": "242076",
  "douban_id": null,
  "title": "The Bag Man (2014)",
  "genres": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "country": "Bahamas",
  "version": [
    {
      "runtime": "108 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.3,
  "director": [
    {
      "id": "nm4333222",
      "name": "David Grovic"
    }
  ],
  "writer": [
    {
      "id": "nm4333222",
      "name": "David Grovic",
      "description": "written by and"
    },
    {
      "id": "nm0176759",
      "name": "Paul Conway",
      "description": "written by"
    },
    {
      "id": "nm0751638",
      "name": "James Russo",
      "description": "original screenplay \"Motel\""
    }
  ],
  "cast": [
    {
      "id": "nm0000131",
      "name": "John Cusack",
      "character": "Jack"
    },
    {
      "id": "nm3762369",
      "name": "Rebecca Da Costa",
      "character": "Rivka"
    },
    {
      "id": "nm0000134",
      "name": "Robert De Niro",
      "character": "Dragna"
    },
    {
      "id": "nm0000417",
      "name": "Crispin Glover",
      "character": "Ned"
    },
    {
      "id": "nm0700712",
      "name": "Dominic Purcell",
      "character": "Larson"
    },
    {
      "id": "nm0458514",
      "name": "Martin Klebba",
      "character": "Guano"
    },
    {
      "id": "nm0277727",
      "name": "Sticky Fingaz",
      "character": "Lizard       (as Kirk 'Sticky Fingaz' Jones)"
    },
    {
      "id": "nm0795856",
      "name": "David Shumbris",
      "character": "Pike"
    },
    {
      "id": "nm0579457",
      "name": "Chazz Menendez",
      "character": "Man in Suit #1"
    },
    {
      "id": "nm2094636",
      "name": "Ian Mclaughlin",
      "character": "Man in Suit #2"
    },
    {
      "id": "nm4297645",
      "name": "Theodus Crane",
      "character": "Goose"
    },
    {
      "id": "nm1977125",
      "name": "Mike Mayhall",
      "character": "Deputy Jones"
    },
    {
      "id": "nm0383296",
      "name": "Danny Cosmo",
      "character": "Bishop"
    },
    {
      "id": "nm0932847",
      "name": "John Wilmot",
      "character": "Teller"
    },
    {
      "id": "nm0026824",
      "name": "J. Todd Anderson",
      "character": "Harvey"
    },
    {
      "id": "nm2059163",
      "name": "Celesta Hodge",
      "character": "Janet"
    },
    {
      "id": "nm4333222",
      "name": "David Grovic",
      "character": "Lawyer"
    },
    {
      "id": "nm6320108",
      "name": "Jackson",
      "character": "Dragna's Dog"
    },
    {
      "id": "nm2590280",
      "name": "Josh Robert Thompson",
      "character": "Voices       (voice)"
    }
  ],
  "overview": "A criminal waits in a seedy motel and waits for his boss after killing several men to steal a bag.",
  "storyline": "A professional shooter gets a new job from his boss. The job is simple to bring him a bag without opening it. But everyone on this town wants that bag. So Jack has to protect the bag and try to carry out his mission. In this city he will meet a lot of people and he will seduced by mysterious woman.",
  "plot": "Brutal gangster Dragna recruits professional killer Jack to pick up a bag and wait for his arrival at a motel. Dragna stresses that Jack is not to open the bag or allow anyone to view its contents under any circumstances. Confused as to why Dragna wants him to do such an apparently easy job, Jack presses for more details, but Dragna only reiterates the rules. While Jack acquires the bag, Dragna's henchman shoots him in the hand, and Jack stuffs the body in his car's trunk. Dragna is unsympathetic when Jack calls him and instructs Jack to stick to the plan.\n\nAt the motel, Jack meets several people: Ned, the wheelchair-bound desk clerk; Rivka, a tall hooker; and Lizard and Guano, a pair of pimps. Jack requests room number thirteen, and Ned cautions him that it is a deathtrap, as it is unconnected. When two suited men become curious about Jack, he abruptly breaks into their room and kills both. A subsequent search reveals FBI badges and a briefcase. Jack sets the briefcase aside and leaves to dump the corpse stored in his car. He returns once he is spotted, only to discover that Rivka has broken into his room; fearful that Lizard will kill her, she requests that he allow her to stay.\n\nJack initially demands that she leave, then detains her when he cannot be sure whether she opened the bag. Rivka points out that the briefcase contains a photo of the bag, and Jack becomes worried that others may attempt to acquire it. When Jack attempts to drive Rivka to a bus station, she spots the corpse in the back of his car. Lizard and Guano first question Jack about Rivka; later, on the road, they attack him. On their corpses he finds another photo of the bag; unsure what to do with Rivka, or of her involvement, he returns to the hotel with her to await Dragna's arrival.\n\nNed becomes suspicious that Jack has a guest in his room, and he calls the sheriff when Jack refuses to pay the double occupancy fee. Sheriff Larson briefly questions Jack, and, after Larson leaves, Jack threatens Ned. Increasingly worried about the safety of the bag, Jack buries it near the motel, only to be caught by Ned, who is now out of his wheelchair. Jack kills Ned and returns to the motel, where Larson arrests him under suspicion of Ned's disappearance.\n\nAs Larson prepares to torture Jack for information, Rivka shows up. Larson threatens to rape her, but she overpowers a deputy and frees Jack, who then kills Larson. When Rivka demonstrates detailed knowledge of the bag, Jack becomes suspicious of her again, but she points out that she has saved his life. Somewhat mollified, he retrieves the bag and waits in room fourteen. Dragna finally appears, disappointed in Jack's apparent lack of trust. Nonetheless satisfied that Jack has not looked in the bag, Dragna explains that the whole situation was a test of Jack's skills and character, as he doubted Jack's resolve in the wake of Jack's fiancee's unsolved murder some months earlier. The motel and the local cops are all on Dragna's payroll, and were all (unwittingly) part of the test.\n\nAs Dragna prepares to leave, Rivka spontaneously tells Jack that she looked in the bag. Frustrated, Jack points out that Dragna will now kill them both. Jack dutifully reports Rivka's action to Dragna, who orders her killed. Jack instead kills Dragna's bodyguard, who wounds Rivka. Jack hunts down Dragna, and both are wounded. Jack looks in the bag; it contains the head of his fiancee, whom Dragna had killed in order to prevent Jack from quitting the murder-for-hire business. Trying to persuade Jack to surrender, Dragna destroys the hotel (where Rivka supposedly is) with remote-detonated explosives. Moments later, Rivka appears and saves Jack by killing Dragna, but she is shot again. Later, in Dragna's lawyer's office, Rivka reveals herself as Dragna's mistress and personal assassin who was sent to the motel to ensure things went Dragna's way. She collects a five million dollar reward for Jack's assassination, and she and Jack drive off together.",
  "synopsis": "Jack (Cusack) is asked to pick up a bag and deliver it to Dragna (DeNiro). Jack is told not to look in the bag but to just deliver it for a handsome reward. The movie starts with Jack already having the bag and having to wait for Dragna to pick it up at a run-down motel. Characters already staying at the motel, the motel manager, and the police all play a part in Jack's time protecting the bag for Dragna.Throughout the movie, questions arise such as what is in the bag, who is out to kill Jack for the bag, and when will Dragna get there. This movie also has a ton of memorable characters such as Ned (Glover) the creepy motel manager, Rivka (DeCosta) the hooker, a pimp, a Russian mobster who is a \"little person\", Dragna (DeNiro), the Sheriff, and of course the bag protector, Jack (Cusack)."
}