{
  "imdb_id": "tt2273024",
  "tmdb_id": "230407",
  "douban_id": null,
  "title": "The Good Witch's Destiny (TV Movie 2013)",
  "genres": [
    "Drama",
    "Family",
    "Fantasy"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "82 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm0003588",
      "name": "Craig Pryce"
    }
  ],
  "writer": [
    {
      "id": "nm2778574",
      "name": "Rod Spence",
      "description": "based on characters created by"
    },
    {
      "id": "nm1022687",
      "name": "Annie Young Frisbie",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0004738",
      "name": "Catherine Bell",
      "character": "Cassandra Nightingale"
    },
    {
      "id": "nm0693243",
      "name": "Chris Potter",
      "character": "Jake Russell"
    },
    {
      "id": "nm0242903",
      "name": "Robin Dunne",
      "character": "Drew"
    },
    {
      "id": "nm1754070",
      "name": "Hannah Endicott-Douglas",
      "character": "Lori Russell"
    },
    {
      "id": "nm1342743",
      "name": "Matthew Knight",
      "character": "Brandon Russell"
    },
    {
      "id": "nm1595023",
      "name": "Dani Kind",
      "character": "Mia       (as Danielle Kind)"
    },
    {
      "id": "nm1430154",
      "name": "Ashley Leggat",
      "character": "Tara"
    },
    {
      "id": "nm1433900",
      "name": "Kate Todd",
      "character": "Helen"
    },
    {
      "id": "nm0534132",
      "name": "Peter MacNeill",
      "character": "George O'Hanrahan"
    },
    {
      "id": "nm0502010",
      "name": "Elizabeth Lennie",
      "character": "Gwen"
    },
    {
      "id": "nm0228324",
      "name": "Catherine Disher",
      "character": "Martha Tinsdale"
    },
    {
      "id": "nm0135471",
      "name": "Noah Cappe",
      "character": "Derek Sanders"
    },
    {
      "id": "nm0010932",
      "name": "Dwayne Adams",
      "character": "Painter"
    },
    {
      "id": "nm2728798",
      "name": "Megan Hutchings",
      "character": "Bride"
    },
    {
      "id": "nm0753121",
      "name": "Lisa Ryder",
      "character": "Alicia Quinn"
    }
  ],
  "overview": "All Cassie Nightingale (Catherine Bell) wants for her birthday is for her family and friends to be together. While her husband Jake (Chris Potter) suggests an intimate dinner at a fancy restaurant in their hometown of Middleton, Cassie would rather have a party at The Grey House, with all her loved ones in attendance. And since Jake's kids, Brandon (Matthew Knight) and Lori (Hannah Endicott-Douglas), are growing up with lives of their own, it might be their last chance to unite as a family for a long time.  As Cassie's special day is fast approaching, Lori discovers disturbing parallels between Cassie and Cassie's great aunt, nicknamed the Grey Lady, who disappeared at her own birthday party years before. With signs of a curse looming over her, it's clear that Cassie needs to conjure up more than a little magic to make things right again. Is there birthday magic in the air or is it a birthday curse?",
  "storyline": "Cassandra Nightingale prepares to celebrate her birthday, hoping to bring as many of her friends and family together as possible. While investigating her family history, she discovers a story of a curse connected to the mysterious disappearance of her great aunt.",
  "plot": "Cassie Russell's (Catherine Bell) birthday is drawing nearer. She tells her husband, Middleton Police Chief Jake Russell (Chris Potter), that she wants a party with all her friends and family attending. Jake's grown children, Brandon (Matthew Knight) and Lori (Hannah Endicott-Douglas), will both graduate soon, and Cassie believes this to be the last time everyone will be together.\n\nJake's father-in-law George (Peter MacNeill) and George's new wife Gwen (Elizabeth Lennie) wish to throw Cassie's birthday party at the bed and breakfast where they live called the Grey House, but the property has already been reserved that night. Later, Gwen is shocked to see her estranged son Drew (Robin Dunne), who is in town to conduct business and to plan his wedding. She loves him but is unhappy with his inability to take responsibility for his actions.\n\nCassie's friend Martha Tinsdale (Catherine Disher) complains to Cassie that a recent heat wave is causing a sewage spill to stink up her new candy store. Cassie tries to help, giving her special incense to clear the air, which makes the store smell even worse. Then, Drew cancels his wedding plans because he can't pay for it. A page of a contract that he was supposed to sign went missing in the satchel that Cassie gave him and he instead signed away his product. Both he and Martha blame Cassie for her \"help\".\n\nCassie asks journalism student Lori to return a library book for her. At the library, Lori sees a book with Elizabeth Merriwick, the \"Grey Lady\" and Cassie's great-aunt, on the cover. It's the same image as the portrait in Cassie and Jake's living room. Intrigued, Lori reads the book to discover the Grey Lady and Cassie share the same birthday, which is also the day the Grey Lady disappeared and believed to have been abducted. Lori then finds Merriwick's diary in a hidden room of the Grey House. Numerous parallels arise between the dated journal entries and current events, including the heat wave and now a mysterious fire that has broken out in Cassie's store, Bell, Book and Candle, damaging it and the surrounding buildings. Lori worries Cassie might be cursed.\n\nBack at the Russells', Mia then discovers the Grey Lady painting has ripped and takes it home to begin restoring it, using her art major skills. Brandon and new girlfriend Tara (Ashley Leggat) decide to elope, but Cassie suddenly fainting from dehydration causes that to be put on hold. Meanwhile, after making threatening remarks to Cassie, Drew is arrested on suspicion of her store's arson. Gwen doesn't believe her son set the fire and bails him out with the money they were planning to use for Cassie's now cancelled party.\n\nThe morning of Cassie's birthday arrives and Mia returns the restored painting to Cassie. Drew menacingly approaches Cassie during her walk, but she advises him on relationships and personal responsibility. Two hours later, however, she has still not returned home. A worried Jake also discovers the restored Grey Lady painting is missing.\n\nA search for Cassie begins. It appears someone has broken into the Grey House and might still be there. Jake, Brandon, Lori, George and Gwen carefully enter the dark house, where they see Cassie dressed up. She leads the group to the backyard, which she has decorated for her birthday in a Halloween/harvest theme, complete with costumes for everyone. She planned her own party but it was most important for her family and friends to arrive together.\n\nLori gives Cassie an old book written by Edward Whymark, a pseudonym for Elizabeth Merriwick, who wasn't abducted—she ran away to Texas with sweetheart Andrew Whymark and reinvented herself, living a long and fruitful life. Cassie congratulates Lori on her detective skills and knows she will do great on her journalism project. A masked Drew arrives with the stolen Grey Lady portrait, which he had appraised at the local museum. He tells Mia the museum liked her restoration work so much they want to hire her. Drew also makes peace with his mother, giving credit to Cassie for helping him realize his responsibilities. Meanwhile, it's revealed that a painter's rag, dropped in a cardboard box filled with paper, caused the fire at Cassie's store, not Drew. Brandon and Tara announce they still plan on getting married—but in two years time. Jake is thrilled and dances with Cassie, who is content among her party guests.",
  "synopsis": null
}