{
  "imdb_id": "tt2248566",
  "tmdb_id": "280691",
  "douban_id": null,
  "title": "Alone Up There (2012)",
  "genres": [
    "Documentary",
    "Comedy"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm3589414",
      "name": "Sean Patrick Shaul"
    }
  ],
  "writer": [
    {
      "id": "nm3589414",
      "name": "Sean Patrick Shaul",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm2857238",
      "name": "Peter Anthony",
      "character": "Himself"
    },
    {
      "id": "nm2340197",
      "name": "Matt Billon",
      "character": "Himself"
    },
    {
      "id": "nm0090785",
      "name": "Alonzo Bodden",
      "character": "Himself"
    },
    {
      "id": "nm0107742",
      "name": "Mark Breslin",
      "character": "Himself"
    },
    {
      "id": "nm0109327",
      "name": "Eddie Brill",
      "character": "Himself"
    },
    {
      "id": "nm1538433",
      "name": "Claire Brosseau",
      "character": "Herself"
    },
    {
      "id": "nm0137519",
      "name": "Kelly Carlin-McCall",
      "character": "Herself"
    },
    {
      "id": "nm0179971",
      "name": "Jerry Corley",
      "character": "Himself"
    },
    {
      "id": "nm0200715",
      "name": "Roman Danylo",
      "character": "Himself"
    },
    {
      "id": "nm5160927",
      "name": "Greg Dean",
      "character": "Himself"
    },
    {
      "id": "nm0237889",
      "name": "Marke Driesschen",
      "character": "Himself"
    },
    {
      "id": "nm0296483",
      "name": "Darren Frost",
      "character": "Himself"
    },
    {
      "id": "nm2790055",
      "name": "Erik Griffin",
      "character": "Himself"
    },
    {
      "id": "nm2834049",
      "name": "Toby Hargrave",
      "character": "Himself"
    },
    {
      "id": "nm0373611",
      "name": "John Heffron",
      "character": "Himself"
    },
    {
      "id": "nm0396275",
      "name": "Jeremy Hotz",
      "character": "Himself"
    },
    {
      "id": "nm0416893",
      "name": "Ron James",
      "character": "Himself"
    },
    {
      "id": "nm2826417",
      "name": "Moshe Kasher",
      "character": "Himself"
    },
    {
      "id": "nm5160343",
      "name": "Simon King",
      "character": "Himself"
    },
    {
      "id": "nm1716943",
      "name": "Darryl Lenox",
      "character": "Himself"
    },
    {
      "id": "nm1837570",
      "name": "Richard Lett",
      "character": "Himself"
    },
    {
      "id": "nm1371293",
      "name": "Jay London",
      "character": "Himself"
    },
    {
      "id": "nm0531856",
      "name": "Mike MacDonald",
      "character": "Himself"
    },
    {
      "id": "nm5160294",
      "name": "Donovan Patrick Mahoney",
      "character": "Himself"
    },
    {
      "id": "nm0549505",
      "name": "Marc Maron",
      "character": "Himself"
    },
    {
      "id": "nm0558130",
      "name": "Joe Matarese",
      "character": "Himself"
    },
    {
      "id": "nm0653959",
      "name": "Rick Overton",
      "character": "Himself"
    },
    {
      "id": "nm0672539",
      "name": "Eddie Pepitone",
      "character": "Himself"
    },
    {
      "id": "nm2130146",
      "name": "Chris Porter",
      "character": "Himself"
    },
    {
      "id": "nm1179677",
      "name": "Paul Scheer",
      "character": "Himself"
    },
    {
      "id": "nm2955597",
      "name": "Iliza Shlesinger",
      "character": "Herself"
    },
    {
      "id": "nm0804448",
      "name": "Jason Sklar",
      "character": "Himself"
    },
    {
      "id": "nm0804460",
      "name": "Randy Sklar",
      "character": "Himself"
    },
    {
      "id": "nm0805653",
      "name": "Bobby Slayton",
      "character": "Himself"
    },
    {
      "id": "nm0828290",
      "name": "Brody Stevens",
      "character": "Himself"
    },
    {
      "id": "nm2669075",
      "name": "Ryan Stout",
      "character": "Himself"
    },
    {
      "id": "nm3937665",
      "name": "Eddie Tafoya",
      "character": "Himself"
    },
    {
      "id": "nm4798146",
      "name": "Jeff Ullrich",
      "character": "Himself"
    }
  ],
  "overview": "The stand-up comedian is a special breed, both an artist and an artisan. They work by painstakingly developing a persona, scripting and editing an act, and revising it on the spot to suit the energy of a given audience. If the audience does not grasp the countless hours crafting the routine, and the empathic micro-calculations, then the act was a success... well, as long as it was funny.",
  "storyline": "The stand-up comedian is a special breed, both an artist and an artisan. They work by painstakingly developing a persona, scripting and editing an act, and revising it on the spot to suit the energy of a given audience. If the audience does not grasp the countless hours crafting the routine, and the empathic micro-calculations, then the act was a success... well, as long as it was funny. Alone Up There explores contemporary stand-up with a focus on the performer. Using interviews with several professional comedians and experts we will ask the questions: 'What kind of person can do stand-up?' and 'What kind of person would want to?' This film is a first-hand journey through one of the toughest jobs in the entertainment industry.",
  "plot": "Pim is born as a twin, conjoined at the stomach with her sister, Ploy. Pim is very sweet and protective of Ploy. However, Ploy's nature is harsh and jealous. Pim and Ploy promise each other to stay together till the end of their lives.\n\nWhile they are staying in a hospital, Pim and Ploy meet a boy named Wee. Although both loved him, Wee only returns Pim's affections, which makes Ploy angry and jealous of Pim. Finally Wee recovers from his illness and is able to leave. As he is getting into the car, Wee decides he wants to see Pim one last time. Since the twins' room is on the second floor, he decides to call to her. As much as Pim wants to see Wee, Ploy won't get out of bed. Pim begs and cries but Ploy stays in her jealous rage. Wee is upset and leaves. Angry and in tears, Pim demands that she and Ploy be separated. The twins have an operation to separate them, but Ploy doesn't survive and dies. Pim burdens herself with guilt thinking that if she had not wanted an operation, Ploy would still be alive.\n\nSeveral years later Pim, who is now living in South Korea and is dating Wee, receives a phone call from Thailand that her mother has had a stroke. When Pim and Wee return to Thailand, Ploy's ghost comes back to haunt her. At first Wee becomes very worried and starts seeking psychiatric help for Pim. But even after the psychiatrist came to visit Pim, she still sees Ploy's ghost everywhere. Pim hears soft breaths on the side of her as if Ploy is still with her while she sleeps. She sees Ploy on the mirror instead of herself. On the elevator, she sees Ploy resting her head in her shoulder. When she tries to relax in a bathtub, she is suddenly pulled down in the water by Ploy's ghost. When the lights go out, she sees a horrifying figure of Ploy. The hauntings keep stalking Pim and she feels even more guilty. But later, the spirit of Ploy also haunts Wee. One night, Wee goes to see Pim's mother. She tells Wee something;\n\nIt is revealed that Pim is actually Ploy. In a flashback, Ploy strangled Pim in a jealous rage after Pim demanded they be separated. But when Pim dies Ploy suddenly snaps out of her rage and feels shocked to what she did. She screams for her mother. Her mother becomes devastated and never speaks to Ploy again.\n\nIn order to save Ploy's life, doctors had to separate Pim's corpse from Ploy. Ploy assumed Pim's identity in order to be with Wee. It meant that all these years, Ploy was lying to Wee and it was actually Pim's ghost that was haunting her and Wee. Ploy's mother knew of her actions as well, but kept silent. Later it is shown that Ploy kills her mother by disconnecting her oxygen pipe so her mother couldn't tell Wee the truth. Ploy didn't know that her mother had already told Wee.\n\nWee confronts Ploy, and in a moment of guilt, she tells Wee the truth. Wee is disgusted and shocked at Ploy's actions and decides to leave her. But Ploy knocks him unconscious and takes Wee hostage. However, Wee escapes, and the ensuing fight with Ploy causes the house to catch fire. In order to escape, Wee throws a shelf on Ploy and escapes. Trapped underneath, Pim's ghost confronts and holds Ploy down, and as the burning debris rains down around them, Pim smiles and Ploy dies.\n\nIn the end, Wee visits the twins' grave, and takes out Pim's necklace that Wee had gifted her when they were in the hospital. He places the necklace on their tombstone.",
  "synopsis": null
}