{
  "imdb_id": "tt2268419",
  "tmdb_id": "151933",
  "douban_id": null,
  "title": "Dead in Tombstone (Video 2013)",
  "genres": [
    "Action",
    "Fantasy",
    "Horror",
    "Western"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "100 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.8,
  "director": [
    {
      "id": "nm0004152",
      "name": "Roel Reiné"
    }
  ],
  "writer": [
    {
      "id": "nm0184792",
      "name": "Brendan Cowles",
      "description": null
    },
    {
      "id": "nm0474153",
      "name": "Shane Kuhn",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0001803",
      "name": "Danny Trejo",
      "character": "Guerrero"
    },
    {
      "id": "nm0000620",
      "name": "Mickey Rourke",
      "character": "Blacksmith"
    },
    {
      "id": "nm0001309",
      "name": "Anthony Michael Hall",
      "character": "Red Cavanaugh"
    },
    {
      "id": "nm0000539",
      "name": "Dina Meyer",
      "character": "Calathea Massey"
    },
    {
      "id": "nm0226819",
      "name": "Richard Dillane",
      "character": "Jack Sutter"
    },
    {
      "id": "nm0532067",
      "name": "Colin Mace",
      "character": "Judah Clark"
    },
    {
      "id": "nm1118408",
      "name": "Emil Hostina",
      "character": "Baptiste"
    },
    {
      "id": "nm1172890",
      "name": "Ovidiu Niculescu",
      "character": "Darko"
    },
    {
      "id": "nm2788751",
      "name": "Ronan Summers",
      "character": "Ramos"
    },
    {
      "id": "nm3329371",
      "name": "Edward Akrout",
      "character": "Snake"
    },
    {
      "id": "nm1632106",
      "name": "Radu Andrei Micu",
      "character": "Washington       (as Radu Micu)"
    },
    {
      "id": "nm0429995",
      "name": "James Carroll Jordan",
      "character": "Father Paul       (as James Jordan)"
    },
    {
      "id": "nm0487406",
      "name": "Daniel Lapaine",
      "character": "Sheriff Bob Massey"
    },
    {
      "id": "nm1855281",
      "name": "George Remes",
      "character": "Deputy Tom Morris"
    },
    {
      "id": "nm4775490",
      "name": "Ioan Cortea",
      "character": "Deputy Cade Hudson       (as Ioan Mihai Cortea)"
    },
    {
      "id": "nm0188120",
      "name": "Tomi Cristin",
      "character": "Bartender"
    },
    {
      "id": "nm0045949",
      "name": "Dan Badarau",
      "character": "Cole Veteran Guard"
    },
    {
      "id": "nm4353483",
      "name": "Corneliu Ulici",
      "character": "Rip Young Guard"
    },
    {
      "id": "nm0870946",
      "name": "Claudiu Trandafir",
      "character": "Preacher"
    },
    {
      "id": "nm2228245",
      "name": "Radu Iacoban",
      "character": "Duke"
    },
    {
      "id": "nm1835042",
      "name": "Daniel Pisica",
      "character": "Rio"
    },
    {
      "id": "nm4097785",
      "name": "Catalina Grama",
      "character": "Liza"
    },
    {
      "id": "nm5282550",
      "name": "Miriam Rizea",
      "character": "Vera"
    },
    {
      "id": "nm0053881",
      "name": "Constantin Barbulescu",
      "character": "Mine Guard #1"
    },
    {
      "id": "nm0254291",
      "name": "Mike Elliott",
      "character": "Mine Guard #2"
    },
    {
      "id": "nm1533751",
      "name": "Ioan Ionescu",
      "character": "Judah's Marshal #1       (as Ioan Andrei Ionescu)"
    },
    {
      "id": "nm1855157",
      "name": "Razvan Oprea",
      "character": "Bank Deputy #1"
    },
    {
      "id": "nm0135395",
      "name": "Marius Capota",
      "character": "Bank Deputy #2"
    }
  ],
  "overview": "An outlaw named Guerrero Hernandez is shot in the back and killed whilst attempting to free his half-brother from a small-town prison. Making a deal with the devil, Hernandez returns from the dead to take his revenge.",
  "storyline": "A gang overruns a small mining town murdering their own leader Guerrero (Trejo) in a cold-blooded power grab. Sentenced to eternity in hell he finds himself confronted by Satan himself (Rourke), offering a daring proposition: deliver the six souls of his former gang and he will escape damnation. With time running out, he sets out on a brutal rampage to avenge his own death.",
  "plot": "In the Frontier of the Wild West, Red Cavanaugh is to be hanged for his crimes. Calm, he says that every man at the gallows will be dead before sunrise. Moments later, the Blackwater Gang – Darko, Washington, Snake, Baptiste, and Ramos – arrive led by his half-brother Guerrero De La Cruz. After slaughtering everyone and freeing Red, they retreat. The next morning, Red tells them about Edendale, Colorado, where gold ore is being stored in a bank until a mineral dispute can be settled. Guerrero agrees to steal it, so long as they avoid unnecessary deaths. After the seven rob the bank, Red betrays Guerrero, as he had acquired the deed to the mine and desires to take over the town. He shoots Guerrero, and despite Guerrero's orders, Red convinces the rest of the gang to turn on him; they all gun Guerrero to death.\n\nFinding himself in hell, Guerrero meets Lucifer, whom he had seen recently in his dreams. Guerrero bargains with him, to allow him to return to Earth and to kill his former gang, so that the fires of hell can grow hotter than he alone can stoke with his flesh. Intrigued by this, Lucifer grants Guerrero 24 hours to slay all six of his betrayers or his soul will remain damned to hell; Satan tells him that only Guerrero can kill the six, dissuading him from asking for help. Guerrero wakens one year to the day of his death and makes his way back to town now called \"Tombstone\" in his memory.\n\nRamos, shaken by an omen earlier, returns to his home and witnesses two of his farmhands killed before confronting Guerrero, whom he does not immediately recognize. After Guerrero puts together his guns, an ability only two people can do, Ramos recognizes him, and he is shot to death. Taking his clothes, Guerrero has the local pastor set up six pine boxes as coffins and stations Ramos in one of them. The following morning, Baptiste and Darko discover Ramos and invade a nearby slaughterhouse. After a standoff with Baptiste and his men, Guerrero kills Baptiste but realizes he still bleeds like a mortal. Darko tells Red about the stranger killing them off, and he sends Washington to the mine to insure the man protecting them from the law is paid off in full. The gang goes to the saloon where Guerrero is and a firefight ensues. After defeating them, Guerrero sees the former sheriff's widow, Calathea, about to kill Red and stops her, but he is trampled by Red's horse as he flees town. Waking sometime later, he explains to her and Father Paul about his situation. Showing him Darko's dead body, whom he'd killed during the saloon brawl, Calathea agrees to help him, and the two make their way to the mine.\n\nIn the mine, it is revealed that Judah Clark, a Marshall, is aiding Red and protecting Red for access to the gold. They leave Washington and Snake to finish off Guerrero, but he turns the tables and kills Washington as he and Calathea escape back to town with his body. After an intense chase, they return to town. In a standoff, Guerrero kills Snake with a gunshot to the eye, but he is quickly gunned down and Calathea is captured. Lucifer, still intrigued by Guerrero's tenacity returns him to life with one hour remaining on his deadline. After a mob tries to kill Red, he takes Calathea captive and confronts his brother, who convinces him to a fair duel. Lucifer cheats with seconds remaining on the clock, and Red and Guerrero instead battle by hand. Guerrero gains the upperhand and kills Red, but two minutes after his time is up.\n\nEntering the church, Lucifer informs Guerrero of his failure, but does not want to condemn him to hell. Instead, he forces Guerrero to kill outlaws to pay off his debt. Now with Edendale out of danger, Guerrero rides off into the countryside, looking for his next bounty to collect for hell.",
  "synopsis": null
}