{
  "imdb_id": "tt2248996",
  "tmdb_id": "167545",
  "douban_id": null,
  "title": "El Alcalde (2012)",
  "genres": [
    "Documentary",
    "Biography",
    "Crime",
    "Drama",
    "History",
    "News"
  ],
  "country": "Mexico",
  "version": [
    {
      "runtime": "81 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.4,
  "director": [
    {
      "id": "nm2010101",
      "name": "Emiliano Altuna"
    },
    {
      "id": "nm5142203",
      "name": "Diego Enrique Osorno"
    },
    {
      "id": "nm1920796",
      "name": "Carlos Rossini"
    }
  ],
  "writer": [
    {
      "id": "nm2010101",
      "name": "Emiliano Altuna",
      "description": "writer"
    },
    {
      "id": "nm5142203",
      "name": "Diego Enrique Osorno",
      "description": null
    },
    {
      "id": "nm1920796",
      "name": "Carlos Rossini",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm1218578",
      "name": "Mauricio Fernandez",
      "character": "Himself"
    }
  ],
  "overview": "The film tells the story of Mauricio Fernandez, mayor of the wealthiest municipality in Latin America, located in the North of Mexico. He presents himself as a polemical figure who takes justice into his own hands in order to \"clean\" his municipality of the drug cartels' presence. Mauricio is a key character to better understand the present situation in Mexico and through the unusual views of this politician, the audience will be a privileged witnesses of an scenario where political tasks and excessive violence mingle with one another.",
  "storyline": "The film tells the story of Mauricio Fernandez, mayor of the wealthiest municipality in Latin America located in the North of Mexico. He presents himself as a polemical figure who takes justice by his own hand in order to 'clean' his municipality of the drug cartels presence. A millionaire with a fortune valued at 800 million USD. He constructed his own palace with ceilings that he bought from William Randolph Hearst, the original Citizen Kane, and plagued the place with his own eccentric collections. Mauricio is a key character to better understand the present situation in Mexico and through the unusual views of this politician, the audience will be a privileged witnesses of an scenario where political tasks and excessive violence mingle with one another.",
  "plot": null,
  "synopsis": null
}