{
  "imdb_id": "tt2273657",
  "tmdb_id": "245706",
  "douban_id": "10546665",
  "title": "True Story (2015)",
  "genres": [
    "Crime",
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "99 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.3,
  "director": [
    {
      "id": "nm3734458",
      "name": "Rupert Goold"
    }
  ],
  "writer": [
    {
      "id": "nm3734458",
      "name": "Rupert Goold",
      "description": "screenplay and"
    },
    {
      "id": "nm1738734",
      "name": "David Kajganich",
      "description": "screenplay"
    },
    {
      "id": "nm4927379",
      "name": "Michael Finkel",
      "description": "based on the book by"
    }
  ],
  "cast": [
    {
      "id": "nm1706767",
      "name": "Jonah Hill",
      "character": "Michael Finkel"
    },
    {
      "id": "nm0290556",
      "name": "James Franco",
      "character": "Christian Longo"
    },
    {
      "id": "nm0428065",
      "name": "Felicity Jones",
      "character": "Jill Barker"
    },
    {
      "id": "nm1978694",
      "name": "Maria Dizzia",
      "character": "MaryJane Longo"
    },
    {
      "id": "nm0839486",
      "name": "Ethan Suplee",
      "character": "Pat Frato"
    },
    {
      "id": "nm4995441",
      "name": "Conor Kikot",
      "character": "Zach Longo"
    },
    {
      "id": "nm6300242",
      "name": "Charlotte Driscoll",
      "character": "Sadie Longo"
    },
    {
      "id": "nm6402061",
      "name": "Stella Rae Payne",
      "character": "Madison Longo"
    },
    {
      "id": "nm0121559",
      "name": "Robert John Burke",
      "character": "Greg Ganley"
    },
    {
      "id": "nm0421120",
      "name": "Byron Jennings",
      "character": "Judge Odenkirk"
    },
    {
      "id": "nm0001543",
      "name": "Gretchen Mol",
      "character": "Karen Hannen"
    },
    {
      "id": "nm2365811",
      "name": "Betty Gilpin",
      "character": "Cheryl Frank"
    },
    {
      "id": "nm0057592",
      "name": "Seth Barrish",
      "character": "Blaise"
    },
    {
      "id": "nm0822802",
      "name": "Robert Stanton",
      "character": "Jeffrey Gregg"
    },
    {
      "id": "nm0183613",
      "name": "Michael Countryman",
      "character": "Coroner"
    },
    {
      "id": "nm0746156",
      "name": "Steve Routman",
      "character": "Jack Pool"
    },
    {
      "id": "nm3017448",
      "name": "Genevieve Angelson",
      "character": "Tina Alvis"
    },
    {
      "id": "nm1364079",
      "name": "Adam Mucci",
      "character": "Courtroom Sheriff"
    },
    {
      "id": "nm1477818",
      "name": "David Wilson Barnes",
      "character": "Corey Douglas"
    },
    {
      "id": "nm2860379",
      "name": "William Jackson Harper",
      "character": "Zak Rausch"
    },
    {
      "id": "nm0742081",
      "name": "Sam Rosen",
      "character": "Steve Mensah"
    },
    {
      "id": "nm0387664",
      "name": "Mara Hobel",
      "character": "Jail Receptionist"
    },
    {
      "id": "nm0686042",
      "name": "David Pittu",
      "character": "Marcus Lickermann"
    },
    {
      "id": "nm0861487",
      "name": "Auden Thornton",
      "character": "Lena"
    },
    {
      "id": "nm2200575",
      "name": "Ngo Okafor",
      "character": "Ibrahim       (as Ngoli Okafor)"
    },
    {
      "id": "nm6845313",
      "name": "Uchenna Onuaguluchi",
      "character": "Madou"
    },
    {
      "id": "nm0687694",
      "name": "Maryann Plunkett",
      "character": "Maureen Duffy"
    },
    {
      "id": "nm3641237",
      "name": "Joseph Harrell",
      "character": "Visiting Room Guard       (as Joseph C. Harrell)"
    },
    {
      "id": "nm2005766",
      "name": "Mike Houston",
      "character": "Visiting Room Guard"
    },
    {
      "id": "nm0837173",
      "name": "Kohl Sudduth",
      "character": "Police Officer"
    },
    {
      "id": "nm2674188",
      "name": "Rosemary Howard",
      "character": "Jury Forewoman"
    },
    {
      "id": "nm0307534",
      "name": "Joel Marsh Garland",
      "character": "Dan Pegg"
    },
    {
      "id": "nm0784815",
      "name": "Daniel Sauli",
      "character": "Reporter"
    },
    {
      "id": "nm0206449",
      "name": "Johanna Day",
      "character": "Beth Tickler"
    },
    {
      "id": "nm0416838",
      "name": "Peter Francis James",
      "character": "Colin Parker"
    },
    {
      "id": "nm0405079",
      "name": "Edward James Hyland",
      "character": "Mr. Longo"
    },
    {
      "id": "nm0260632",
      "name": "Dana Eskelson",
      "character": "Mrs. Longo"
    },
    {
      "id": "nm6131222",
      "name": "Mike Cannon",
      "character": "Longo's Brother"
    },
    {
      "id": "nm5147711",
      "name": "Georgia Ford",
      "character": "Young Woman"
    },
    {
      "id": "nm2342888",
      "name": "Rob Yang",
      "character": "Young Man"
    },
    {
      "id": "nm0788767",
      "name": "John Sharian",
      "character": "Lincoln County Lobby Sheriff"
    },
    {
      "id": "nm2943328",
      "name": "Rightor Doyle",
      "character": "Greasy Young Man"
    },
    {
      "id": "nm0906525",
      "name": "Loudon Wainwright III",
      "character": "Older Man"
    },
    {
      "id": "nm3363362",
      "name": "Julie Sharbutt",
      "character": "Female MSU Worker"
    },
    {
      "id": "nm2768526",
      "name": "Matt Dellapina",
      "character": "Male MSU Worker"
    },
    {
      "id": "nm0129812",
      "name": "David Cale",
      "character": "Middle-Aged Man"
    },
    {
      "id": "nm0404269",
      "name": "Eleanor Hutchins",
      "character": "Middle-Aged Woman"
    },
    {
      "id": "nm3020280",
      "name": "Rebecca Henderson",
      "character": "Ellen Parks"
    },
    {
      "id": "nm2259600",
      "name": "Jay Ferraro",
      "character": "Geoffrey J. Ploobtark"
    },
    {
      "id": "nm0706353",
      "name": "Paula Raflo",
      "character": "Drunk Heckler"
    }
  ],
  "overview": "A drama centered around the relationship between journalist Michael Finkel and Christian Longo, an FBI Most Wanted List murderer who for years lived outside the U.S. under Finkel's name.",
  "storyline": "Jonah Hill plays Michael Finkel, a recently terminated New York Times journalist who's struggling for work after a story gone wrong. One day, he receives a phone call from a man regarding an FBI Most Wanted individual named Christian Longo, who's been captured and claimed to be living as Finkel. Longo and Finkel meet and form a potentially marriage shattering bond while Longo is in prison awaiting his trial. Finkel exchanges journalism tips for the real events behind Longo's alleged heinous acts of murdering his family. Through the twists and turns in the movie, only at the end will Finkel uncover the True Story.",
  "plot": "Christian Longo (James Franco), an Oregon man whose wife and three children have been discovered murdered, is arrested by police in Mexico, where he had been identifying himself as a reporter for the New York Times named Michael Finkel.\n\nIn New York City, Finkel (Jonah Hill) is an ambitious and successful reporter. He is confronted by his editors about a story he has written and has featured on the cover of the New York Times Magazine, who accuse him of using a composite character as the focus of his story, a violation of basic reporting principles. Finkel briefly attempts to defend his actions, but he is unsuccessful and is fired. He returns home to his wife (Felicity Jones), and struggles to find work as a journalist due to his public firing from the Times.\n\nFinkel is contacted by a reporter for The Oregonian, who is seeking his opinion on Christian Longo's theft of his identity. Finkel, who was not aware of Longo's case at all, is intrigued, and arranges to meet with Longo in prison. During their first conversation, Longo claims that he has followed Finkel for his entire career and always admired his writing. Longo agrees to tell Finkel his side of the crimes he is accused of, in exchange for writing lessons and Finkel's promise not to share their conversations until after the conclusion of the murder trial.\n\nFinkel becomes increasingly absorbed with Longo, who is evasive about his guilt. Convinced that the story will be redemptive, Finkel visits Longo in prison and corresponds with him for several months. Longo sends Finkel numerous letters as well as an eighty-page notebook entitled \"Wrong Turns\", which contains what Longo describes as a list of every mistake he has made in his life. Finkel begins to recognize similarities between Longo and himself, their handwriting and drawing, and Longo's letters and Finkel's personal journals. As the trial approaches, Finkel grows increasingly doubtful that Longo is guilty of the murders, and Longo informs Finkel he intends changing his plea to not guilty.\n\nIn court, Longo pleads not guilty to two of the murders, but pleads guilty to the murder of his wife and one of his daughters. Finkel confronts Longo, who claims that he can not share everything he knows because has to protect certain individuals, whom he refuses to name. Greg Ganley (Robert John Burke), the detective who tracked Longo down and arrested him, approaches Finkel, and he claims that Longo is an extremely dangerous and manipulative man. He tries to convince Finkel to turn over as evidence all of his correspondence with Longo. Finkel refuses and Ganley does not press him for an explanation.\n\nAt the trial, Longo takes the stand and describes his version of the events in detail. He claims that, after an argument with his wife about their financial situation, he had come home to discover two of his children missing, one of his daughters unconscious, and his wife sobbing, saying that she put the children \"in the water\". Longo says that he strangled his wife to death in a blind rage. He says he thought his other daughter was dead at first, but then realized that she was still breathing and strangled her as well because she was all but dead. Finkel's wife, Jill, watches Longo's testimony.\n\nAs the jury deliberates, Jill visits Longo in jail and tells him that he is a narcissistic murderer who will never escape who he is.\n\nLongo is found guilty of all four charges and sentenced to death. After he is sentenced, he winks at Finkel, who to his shock and rage, realizes that Longo has been lying throughout their conversations, using him in order to make his testimony more believable. A short time later, Finkel meets Longo on death row. Longo tries to convince Finkel that he discovered his wife strangling their daughter and then blacked out, so that he has no memory of the murders. Finkel angrily tells Longo that he will not believe any more of his lies and will warn the judge when Longo appeals his sentence of Longo's manipulative nature. Longo retorts by pointing out the success Finkel has had with his book about their encounters, leaving the reporter shaken.\n\nFinkel reads a section of his book, entitled True Story, at a promotional event in a bookstore. Taking questions from the audience, he imagines Longo standing in the back of the room. Longo says that, if he has lost his freedom, Finkel must have lost something as well. Finkel is unable to respond.\n\nTitle cards reveal that Longo admitted a year later, to killing his entire family. Although Finkel never wrote for the \"New York Times\" again, Longo has contributed articles to a number of publications from death row, including the \"New York Times.\" The final title card reads that Finkel and Longo still speak on the first Sunday of every month.",
  "synopsis": null
}