{
  "imdb_id": "tt2259858",
  "tmdb_id": "201022",
  "douban_id": null,
  "title": "Asylum (2014)",
  "genres": [
    "Comedy",
    "Horror"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "93 min",
      "description": ""
    }
  ],
  "imdb_rating": 2.6,
  "director": [
    {
      "id": "nm1359237",
      "name": "Todor Chapkanov"
    }
  ],
  "writer": [
    {
      "id": "nm0541449",
      "name": "Chris Mancini",
      "description": "Comedy Screenplay"
    },
    {
      "id": "nm0541449",
      "name": "Chris Mancini",
      "description": "Horror Screenplay"
    },
    {
      "id": "nm3525515",
      "name": "Tex Wall",
      "description": "horror screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0001653",
      "name": "Stephen Rea",
      "character": "McGahey"
    },
    {
      "id": "nm0668271",
      "name": "Bruce Payne",
      "character": "Sharp"
    },
    {
      "id": "nm2817670",
      "name": "Dimo Alexiev",
      "character": "Tall Intense Patient"
    },
    {
      "id": "nm0082870",
      "name": "Velizar Binev",
      "character": "Sergeant Quinn"
    },
    {
      "id": "nm3218115",
      "name": "Ulyana Chan",
      "character": "Attractive Nurse"
    },
    {
      "id": "nm1350205",
      "name": "Dimiter Doichinov",
      "character": "Tanner"
    },
    {
      "id": "nm4234598",
      "name": "Caroline Ford",
      "character": "Halloway"
    },
    {
      "id": "nm0304282",
      "name": "Valentin Ganev",
      "character": "Priest"
    },
    {
      "id": "nm1723702",
      "name": "Radoslav Ignatov",
      "character": "Wilder"
    },
    {
      "id": "nm5241120",
      "name": "Iana Kuzova",
      "character": "Dimarino"
    },
    {
      "id": "nm0598921",
      "name": "Joe Montana",
      "character": "Barnett"
    },
    {
      "id": "nm5240395",
      "name": "Curtis Nordstrom",
      "character": "Gilmartin"
    },
    {
      "id": "nm3460528",
      "name": "Daniel Rashev",
      "character": "Patient Victim"
    },
    {
      "id": "nm5153402",
      "name": "Edward Joe Scargill",
      "character": "Phillips"
    },
    {
      "id": "nm0794885",
      "name": "Hristo Shopov",
      "character": "Father Richard"
    },
    {
      "id": "nm5241803",
      "name": "Stefan Shyerev",
      "character": "Marduk"
    },
    {
      "id": "nm0869750",
      "name": "Steve Toussaint",
      "character": "Powell"
    },
    {
      "id": "nm1138412",
      "name": "Anton Trendafilov",
      "character": "Deep Voice Man"
    },
    {
      "id": "nm1156656",
      "name": "Velimir Velev",
      "character": "Bald Patient       (as Velimer Velev)"
    },
    {
      "id": "nm3438484",
      "name": "Jason Wong",
      "character": "Lim"
    }
  ],
  "overview": "A veteran hostage negotiator's next call leads him to an overrun insane asylum. He soon finds that dark forces are pushing the patients to commit atrocities, and he may be the only one that can stop them.",
  "storyline": "An eleven-person riot squad races to an insane asylum to quell a recent inmate outbreak and hostage situation. They arrive, only to be caught off guard by a sudden barrage of insane patients. When they've finally fought off a wave, two of their squad members are missing, their communications return only static, and the doors are locked. They're trapped. They break up into three teams to track down the lost members. Strange sounds and religious iconography suggest something beyond insanity has taken over the inmates. Sure enough, a simple rescue mission quickly morphs into relentless life or death battles with possessed. When McGahey, a trained, rational hostage negotiator, discovers the ringleader of this possessed insanity is none other than his brother, it falls on him to stop nothing less than the opening of a portal to Hell.",
  "plot": "In 1899, an Oxford University professor demonstrates a case of female hysteria, Lady (Eliza) Graves (Kate Beckinsale), before his class. The patient is drugged and protesting that she is sane, but the professor points out that all mental patients claim to be sane, much as all criminals claim to be innocent. He ignores her demands that he not touch her to induce a fit for the students to observe. The professor advises his students to believe nothing they hear and only half of what they see.\n\nLater, a young man, the newly-minted Dr. Edward Newgate, (Jim Sturgess), arrives at Stonehearst Asylum on Christmas Eve, where he desires to take up residency. A group of armed men led by Mickey Finn (David Thewlis) allow him entry. Finn escorts him to the office of the superintendent, Dr. Silas Lamb (Ben Kingsley). Although Lamb was not expecting him, despite Newgate having sent letters preceding his arrival, he welcomes the help of an Oxford-educated doctor and grants him the residency.\n\nNewgate is surprised by Lamb's unorthodox methods and uncustomarily humane asylum. Lamb explains that he does not believe in drugging or incarcerating his patients, and he encourages their delusions when he feels it will bring them greater happiness, thus creating a kind and dignified environment at the asylum.\n\nLady Graves, now a resident at Stonehearst, is introduced to Newgate, who appears immediately smitten. Lamb explains that the Lady Graves has an abusive and painful past. She developed hysteria from enduring her husband's \"unnatural appetites\" and can no longer bear emotional or physical contact without seizing in hysterical fits. She stabbed her husband in the right eye with a comb and bit off his left ear trying to protect herself, which led to her father committing her into the asylum to escape her marriage to her \"monster\" of a husband. Her husband has since been trying to free her back into his care. Dr. Lamb is currently prescribing musical therapy for her and refuses to declare her sane, for her own safety.\n\nThough she brushes aside Newgate's attempts at flirtation, she is struck by his empathy and respectful demeanor. An elaborate Christmas feast follows, during which the staff and patients mingle and a small fight between Newgate and Finn occurs, cementing their dislike for one another. After the dinner, Lady Graves delivers ominous warnings to Newgate, and quietly insists that he flee the asylum, but Newgate refuses to leave without her.\n\nThe reason for Lady Graves' warning soon reveals itself. Newgate discovers dozens of prisoners being kept in basement cells. The prisoners reveal that they are the true staff of Stonehearst, and the doctors and nurses Newgate has met upstairs are actually patients.\n\nThe real superintendent, Dr. Benjamin Salt (Michael Caine), explains that Lamb and Finn drugged their drinks and led a revolt. Dr. Salt and Mrs. Pike (Sinéad Cusack), the matron, warn Newgate that Lamb is a dangerous madman – a surgeon who murdered his patients during wartime. Isolated and with limited options of regaining control over the asylum even should they be freed, the staff must remain in their cells to await outside assistance. They request that Dr. Newgate locate the keys in Finn's possession to release them, or else escape to London and seek help.\n\nLamb begins his unorthodox training for Newgate's residency through an enlightening, if hands-on, lesson in patient dignity. Newgate attempts to recruit Lady Graves to his cause of freeing the true staff, but she declines to become involved and tells him of Salt's and his staff's inhuman abuses. Newgate reveals the scars of his own abusive past and tells her he understands.\n\nNewgate sneaks into Lamb's office and successfully retrieves Salt's notes, but not the keys. While hiding, he overhears Lamb and Finn discussing him. Finn is deeply suspicious of Newgate, but Lamb believes Newgate shows promise and could be a great asylum doctor one day. Both acknowledge the prisoners in the basement, and Lamb promises that the loose ends will be tied up by the New Year.\n\nSalt's notes detail his barbaric medical treatments used against Lamb, who had been under his care for 9 years without cracking before the uprising. Newgate is conflicted when, after two of the prisoners in the basement escape to seek help, both die under suspicious circumstances after being caught by Finn.\n\nWhile the patients are happy and thriving, there are some definite failings to Lamb's method of running the asylum. They are quickly running out of provisions and having difficulties keeping up with the every-day demands of the large institution, such as heating the building in winter. Some of the more violent patients, such as Finn, are also difficult to control, and he eventually murders a female patient.\n\nBy New Year's Eve, the patients are burning the furnishings for warmth and Lamb has destroyed Salt's mind via cranial electroshock, turning him into a patient in his own institution. Newgate is convinced the situation must come to an end and that he and Lady Graves should escape.\n\nNewgate's attempt to drug the patients and gain control of the asylum is thwarted and Lamb prepares Newgate for electric shock therapy to turn him into a mental patient to live among them. It is revealed that Newgate had come to the asylum specifically to rescue Lady Graves, whom he had seen at the Oxford medical demonstration and become fixated with. Before the treatment, Lamb grants Newgate a final request: to see a picture of Lady Graves that he keeps in his pocket. The true object in his pocket, a picture of one of the young soldiers Lamb shot (which Newgate discovered in the padded cell Salt kept Lamb in), causes Lamb to stagger out of the room in a fugue. Finn goes to pick up the electric prods to finish the job, but Newgate is rescued by Lady Graves who overcomes her hysterical fits to kill Finn via electrocution. A fire starts and spreads as Lady Graves rescues the staff from their cells and leads the patients out of the building.\n\nLamb has now become near-stuporous from the crushing flashbacks of his past actions when, under extreme pressure during his time as a field doctor, Lamb had snapped and executed his battlefield patients as a form of mercy killing before attempting to kill himself.\n\nAfter all are rescued, as daylight breaks, Newgate again asks Lady Graves to leave with him, but she says that she cannot be with him because he is sane and she is not. Newgate says that he is not sane, as he is madly in love with her, and he intimates that he has a secret to tell her.\n\nLater, Lady Graves' husband and the earlier Oxford professor arrive at the asylum. The asylum has been restored to a gentler order under the kind hand of Mrs. Pike, who is now in charge and has incorporated many of Lamb's methods of treatment. The professor demands Lady Graves' release, but Mrs. Pike says that Dr. Newgate already released her weeks ago. The professor reveals that he is the true Dr. Newgate and the one they knew is an imposter. The Dr. Newgate they met was never a medical student, nor a doctor at all, but an escaped mental patient who had also been part of the exhibition. Dr. Lamb, playing chess with the reduced Dr. Salt, hears this and shows a spark of his previous self as he gleefully remarks \"Checkmate.\"\n\nLady Graves and the impostor Newgate end the film at the Santa Cristina Asylum in Tuscany, Italy, where they are known as Dr. and Mrs. Lamb, treating mental patients with the original Lamb's methods. The two dance happily and embrace in a beautiful garden.",
  "synopsis": null
}