{
  "imdb_id": "tt2221032",
  "tmdb_id": "116330",
  "douban_id": null,
  "title": "Elephant Sighs (2012)",
  "genres": [
    "Comedy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm3763645",
      "name": "Ed Simpson"
    }
  ],
  "writer": [
    {
      "id": "nm3763645",
      "name": "Ed Simpson",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0000799",
      "name": "Edward Asner",
      "character": "Leo"
    },
    {
      "id": "nm0137121",
      "name": "John Cariani",
      "character": "Joel"
    },
    {
      "id": "nm0280051",
      "name": "Mark Fite",
      "character": "Nick"
    },
    {
      "id": "nm0444940",
      "name": "Jack Kehler",
      "character": "Dink"
    },
    {
      "id": "nm0920169",
      "name": "David Wells",
      "character": "Perry"
    }
  ],
  "overview": "A lonely man finds friendship in the last place he expected in this gentle comedy from writer/director Ed Simpson. A serious man with no friends to speak of, Joel Bixby (John Cariani) moves to a small town and strikes up a friendship with vociferous senior Leo Applegate (Edward Asner). When Leo invites Joel to join a small group of men who regularly gather in a small room to exchange stories, Joel sees it as a good opportunity to come out of his shell. But the more time that Joel spends with the group, the clearer it becomes that he was chosen to fill the space left by a dearly departed member who is deeply missed by his old friends.... Over the course of their regular meetings something incredible happens to reclusive Joel he finally realizes that even lifes biggest problems dont seem quite so bad when youve got friends to fall back on in your time of need (IMDb.com)",
  "storyline": "\"After moving to a small, rural town, uptight Joel Bixby (Tony Award-nominee John Cariani, Showtime, Kissing Jessica Stein), is invited by an agreeable new acquaintance to join a group of townsmen who meet in a ramshackle room at the edge of town. Normally a loner, Joel finds himself enamored by boisterous, fast food connoisseur Leo Applegate (Emmy- and Golden Globe-winner Edward Asner, Up, Elf, TV's Lou Grant and The Mary Tyler Moore Show) and reluctantly agrees to go. Unknowingly the \"replacement\" for a beloved member who recently passed away, Joel meets the group's other surviving members and is swept up in their strange lives, but struggles with their secretive purpose for gathering ... until he realizes each of them is as lost as himself. Gleeful Dink (Jack Kehler, Men in Black II, The Big Lebowski), who deeply loves his bald wife, is \"in touch\" with his feminine side; Perry (David Wells, Basic Instinct, Starman, Beverly Hills Cop), a former minister, is suffering a crisis of ...",
  "plot": null,
  "synopsis": "A lonely man finds friendship in the last place he expected in this gentle comedy from writer/director Ed Simpson. A serious man with no friends to speak of, Joel Bixby (John Cariani) moves to a small town and strikes up a friendship with vociferous senior Leo Applegate (Edward Asner). When Leo invites Joel to join a small group of men who regularly gather in a small room to exchange stories, Joel sees it as a good opportunity to come out of his shell. But the more time that Joel spends with the group, the clearer it becomes that he was chosen to fill the space left by a dearly departed member who is deeply missed by his old friends. Regardless, the anxious newcomer gradually gets more comfortable with his new circle of friends, which includes not only fast-food loving Leo but the comfortably feminine Dink (Jack Kehler), spiritually conflicted former cleric Perry (David Wells), and mercurial Nick (Mark Fite), an out-of-work local whos convinced his best days are behind him. Over the course of their regular meetings something incredible happens to reclusive Joel he finally realizes that even lifes biggest problems dont seem quite so bad when youve got friends to fall back on in your time of need."
}