{
  "imdb_id": "tt2276000",
  "tmdb_id": "205985",
  "douban_id": null,
  "title": "Miss You Can Do It (2013)",
  "genres": [
    "Documentary",
    "Drama",
    "Family"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "75 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.2,
  "director": [
    {
      "id": "nm2861672",
      "name": "Ron Davis"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm2980859",
      "name": "Abbey Curran",
      "character": "Herself - Pageant Chairman"
    },
    {
      "id": "nm3629240",
      "name": "May Diddy",
      "character": "Herself"
    },
    {
      "id": "nm2718041",
      "name": "Shawn Marie Diddy",
      "character": "Herself - Host, Judge"
    }
  ],
  "overview": "Miss You Can Do It chronicles Abbey Curran, Miss Iowa USA 2008 and the first woman with a disability to compete at the Miss USA Pageant, and eight girls with various physical and intellectual disabilities as the girls participate in the Miss You Can Do It Pageant. Abbey founded the annual Miss You Can Do It Pageant in 2004 and girls and their families travel from all around the country to participate in this one night where their inner beauty and abilities reign.",
  "storyline": "Miss You Can Do It chronicles Abbey Curran, Miss Iowa USA 2008 and the first woman with a disability to compete at the Miss USA Pageant, and eight girls with various physical and intellectual disabilities as the girls participate in the Miss You Can Do It Pageant. Abbey founded the annual Miss You Can Do It Pageant in 2004 and girls and their families travel from all around the country to participate in this one night where their inner beauty and abilities reign.",
  "plot": null,
  "synopsis": "Diagnosed with cerebral palsy at age two, Abbey Curran never accepted her physical limitations. She admits her disability comes with lifelong challenges, but none that hold her back, playing sports (she \"just falls more\") and driving a car with a special steering wheel and brake. Curran's resilience and determination to pursue her dreams led her to become the first woman with disabilities to compete in the Miss USA Pageant® in 2008.Miss You Can Do It highlights the extraordinary work Curran is doing with the pageant she founded. Curran and a team of enthusiastic volunteers give participants a chance to be celebrated for all they are inside, not just defined by what the world sees on the outside. For one special weekend the young girls, along with family and friends, some who have traveled far distances, spend time in an oasis of fun, femininity and celebration.No one leaves the pageant empty-handed, with each girl receiving a special award. The real winners of the pageant might be the families and friends, who proudly cheer them on from the audience.Among the girls and families profiled are:Five-year-old Tierney, who gleefully zips around in a powered wheelchair in excited anticipation of the pageant, while her mom explains that she's never walked and will progressively lose movement throughout her body. Tierney has spinal muscular atrophy type II, a slow deterioration of all muscles.Natasha, 14, who was born with cerebral palsy and suffers from seizures, and Kenna, her younger sister, who has intellectual disabilities. Despite these challenges, \"they are a happy-go-lucky family,\" according to their proud parents.Precocious six-year-old Ali, who has four best friends, one mischievous and imaginary, and three in their 60s: Judy, Judy and Rock, who enjoy watching Ali's physical therapy sessions on a horse, which helps with her balance. Ali was born with spina bifida, a hole in the spine that caused paralysis of her lower body.Teyanna, a smart and creative preteen, whose mother says that after she was born, a nurse suggested they put her in an institution, but they refused and raised her at home. Teyanna has speech difficulty due to cerebral palsy.Seven-year-old Daleney, whose parents say her biggest frustration is her lack of independence. Still, she never shows it, even if she takes 15 minutes to tie her shoelaces. Daleney is a quadriplegic with a spastic form of cerebral palsy, causing her to have too much muscle tone and making her limbs cross her midline when she walks.Tiny Meg, who is shy, except when she's with her brothers. Wanting Meg to have a sister to connect with, her parents adopted Alina, a girl from Ukraine. Both Meg and Alina have Down syndrome.Miss You Can Do It celebrates the heroism of their parents and families, who openly describe how the heartbreak of learning that their child was different quickly gave way to loving patience, dedication and a new appreciation for the joys and challenges of raising a child with special needs.Says Curran, \"I hope that my Miss You Can Do It girls leave this pageant knowing that, okay, we might fall down, or someone might stare at us, but I just did something amazing. Something that not very many people get to experience.\"Pageant volunteer Jan Selman adds, \"Miss You Can Do It is not about what's wrong with these girls. It's about celebrating what's right with them.\"Ron Davis began his filmmaking career at the New York Film Academy, where his first two short narrative student films, \"The Business Traveler\" and \"The Garden,\" earned him a top-ten finalist spot in the 2004 Esquire Magazine Celluloid Style film competition. His first documentary, \"Pageant,\" garnered ten film festival awards.Miss You Can Do It is directed and produced by Ron Davis; producers, Clay Westervelt and Julie Anderson; editor, Geof Bartz, A.C.E.; directors of photography, Clay Westervelt and Arlene Nelson; original music by Joel Goodman. For HBO: supervising producer, John Hoffman; executive producer, Sheila Nevins."
}