{
  "imdb_id": "tt2255735",
  "tmdb_id": "110878",
  "douban_id": null,
  "title": "Angus Buchan's Ordinary People (2012)",
  "genres": [
    "Drama"
  ],
  "country": "South Africa",
  "version": [
    {
      "runtime": "115 min",
      "description": "original"
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm4618770",
      "name": "F.C. Hamman"
    }
  ],
  "writer": [
    {
      "id": "nm6247371",
      "name": "Jacques Brand",
      "description": "uncredited"
    },
    {
      "id": "nm4618770",
      "name": "F.C. Hamman",
      "description": null
    },
    {
      "id": "nm4911992",
      "name": "Piet Smit",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4911982",
      "name": "Angus Buchan",
      "character": "Himself"
    },
    {
      "id": "nm0215261",
      "name": "Anton Dekker",
      "character": "John Peters"
    },
    {
      "id": "nm4912066",
      "name": "Lucky Koza",
      "character": "Lucky Nzimande"
    },
    {
      "id": "nm4630687",
      "name": "Jaco Muller",
      "character": "Andre Cloete"
    },
    {
      "id": "nm1938518",
      "name": "Anrich Herbst",
      "character": "Young Angus"
    },
    {
      "id": "nm0809770",
      "name": "Robin Smith",
      "character": "Herman Visser"
    },
    {
      "id": "nm0612147",
      "name": "Hannes Muller",
      "character": "Ben Wolhuter"
    },
    {
      "id": "nm3107870",
      "name": "David James",
      "character": "Danny Boy"
    },
    {
      "id": "nm0635713",
      "name": "Kate Normington",
      "character": "Ellen Cloete"
    },
    {
      "id": "nm0235184",
      "name": "Michelle Douglas",
      "character": "Marlene"
    },
    {
      "id": "nm0014718",
      "name": "Norman Anstey",
      "character": "James Cloete"
    },
    {
      "id": "nm4795495",
      "name": "Alex Radntiz",
      "character": "Jimmy"
    },
    {
      "id": "nm3325009",
      "name": "Kaz McFadden",
      "character": "Jake Cloete"
    },
    {
      "id": "nm4912432",
      "name": "Charlie Bouguenon",
      "character": "Xavier       (as Charles Bouguenon)"
    },
    {
      "id": "nm4912411",
      "name": "Simeon Hamman",
      "character": "Juan"
    },
    {
      "id": "nm5151825",
      "name": "Cher Harris",
      "character": "Jill Buchan"
    },
    {
      "id": "nm5151670",
      "name": "Paul Rotherham",
      "character": "Stephan"
    },
    {
      "id": "nm1051418",
      "name": "Ferdi Burger",
      "character": "Stephan's Friend"
    },
    {
      "id": "nm0886208",
      "name": "Robert van de Coolwijk",
      "character": "Stephan's Dad"
    },
    {
      "id": "nm4912428",
      "name": "Steve Larter",
      "character": "Terrance"
    },
    {
      "id": "nm5183802",
      "name": "Muchipisi Obey",
      "character": "Chris"
    },
    {
      "id": "nm1099054",
      "name": "Nomhle Nkonyeni",
      "character": "Maria       (as Nomhlé Nkyonyeni)"
    },
    {
      "id": "nm6247371",
      "name": "Jacques Brand",
      "character": "Melvin's Friend"
    },
    {
      "id": "nm4912471",
      "name": "Jarrod de Jong",
      "character": "Marshall Mighty Men"
    }
  ],
  "overview": "The plot follows the individual journeys of three ordinary South African men in the build up to their attendance of the 2010 Mighty Men Conference, where their lives are forever changed by God's message for them.",
  "storyline": "The backbone of the story is Angus Buchan - at the 2009 Mighty Men Conference - sharing his simple but rock solid faith with a few hundred thousand men. We experience his on-stage heart attack and the resulting personal insight he received from God regarding his own ministry. In the vast crowd we find three typical men - all in the process of being touched by the Holy Spirit through Angus's words. We find Andre Cloete - a twenty something man who became ensnared in alcohol abuse and a wasted life - due to his broken relationship with his 'strictly religious' and absent father. Then there is John Peters - a middle aged panel beater from Bethlehem who's business, family relationships and health have been spiraling down to the brink of collapse. Lastly we meet Lucky Nzimande - a young, black criminal who naively attempts to hi-jack the vehicle of two ex special-forces policemen en route to the Mighty Men Conference. The film tells the dramatic story of the three men's journeys and ...",
  "plot": "The film opens with Angus Buchan's story as he realizes from the time he is a teen that he wants to be a preacher, and is discouraged when his minister tells him about the years of schooling he must complete. He goes on to acquire a farm and eventually marry, and while he works hard to make a success of his land, he never abandons his dream. He begins by preaching to the maize in his field from the back of his truck, and this grows into his audience of thousands at his Mighty Men's Conferences.\n\nThe story then shifts to three interwoven stories, based on real characters and real events.\n\nLucky Nzimande (Lucky Koza) is a career criminal who unwittingly attempts to hijack what turns out to be two policemen on their way to the Mighty Men's Conference. After his gun fails to fire on Lucky, one of the policemen takes this as a sign from God that he is meant to take the man to the Conference with them. They handcuff Lucky in the back and ask him about his story; he talks about never knowing his father and his mother dying when he was 8. He started stealing early on to help provide for his siblings and grandmother, who died when he was 13. Lucky escapes from the policemen and is assaulted that night, suffering a gash on his head. The next day the men see him and kindly offer to tend to his wound and give him a ride home. Afterwards he agrees to go to the Conference with them.\n\nAndré Cloete (Jaco Muller) is an alcoholic young adult who is self-destructing quickly due in part to his emotionally absent but strictly religious father. His mother covers for him when he crashes his car into a neighbor's gate, begging her not to call the police. After another severe accident his father prays over him and realizes he is too harsh, but Andre continues to drink and party after getting out of the hospital. He then finally agrees to attend the Conference with his father and brother.\n\nJohn Peters (Anton Dekker) is a middle-aged panel beater and biker with two sons. He marries a woman named Marlene and she and her two girls move in with them. Marlene's brother-in-law Danny (David James) asks John for a business loan; John doesn't have the money but agrees to stand surety if Danny applies for a bank loan. John's youngest son then dies in a motorcycle accident, Danny defaults on the loan and John is diagnosed with a chronic lung condition. Sensing he is taking his anger out on his oldest son, Marlene encourages him to attend the Conference. John reconciles with Danny and apologizes to his son before he goes.\n\nThe men all make their way to a Mighty Men's Conference where they listen to Buchan's preaching, which includes his recounting of the two heart attacks he suffered the year before.\n\nAfter the Conference, Lucky returns to his impoverished hometown and begins passing out religious flyers. Andre calls a friend and tells him that he's given his life to the Lord. John suffers an accident on the way home and dies. After his funeral, Danny is seen off to himself, crying and praying.\n\nThe film ends with titles revealing that Lucky continues to preach, Andre does volunteer work, and John's oldest son Gavin took over his business and continues to care for Marlene and her girls.",
  "synopsis": null
}