{
  "imdb_id": "tt2209386",
  "tmdb_id": "135161",
  "douban_id": null,
  "title": "You Are God (2012)",
  "genres": [
    "Biography",
    "Drama",
    "Music"
  ],
  "country": "Poland",
  "version": [
    {
      "runtime": "110 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.7,
  "director": [
    {
      "id": "nm1291828",
      "name": "Leszek Dawid"
    }
  ],
  "writer": [
    {
      "id": "nm1699860",
      "name": "Maciej Pisuk",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm5105099",
      "name": "Marcin Kowalczyk",
      "character": "Magik"
    },
    {
      "id": "nm4221607",
      "name": "Dawid Ogrodnik",
      "character": "Rahim"
    },
    {
      "id": "nm3949598",
      "name": "Tomasz Schuchardt",
      "character": "Fokus"
    },
    {
      "id": "nm1458971",
      "name": "Arkadiusz Jakubik",
      "character": "Gustaw Zarzycki"
    },
    {
      "id": "nm0233949",
      "name": "Marcin Dorocinski",
      "character": "Manager"
    },
    {
      "id": "nm1669753",
      "name": "Przemyslaw Bluszcz",
      "character": "Magik's father"
    },
    {
      "id": "nm0066134",
      "name": "Halina Bednarz",
      "character": "Magik's mother"
    },
    {
      "id": "nm1699406",
      "name": "Magdalena Kacprzak",
      "character": "Magda"
    },
    {
      "id": "nm0435423",
      "name": "Elzbieta Karkoszka",
      "character": "Fokus's grandma"
    },
    {
      "id": "nm2025836",
      "name": "Miroslaw Neinert",
      "character": "Justyna's father"
    },
    {
      "id": "nm0637378",
      "name": "Piotr Nowak",
      "character": "Kozak"
    },
    {
      "id": "nm4007277",
      "name": "Katarzyna Wajda",
      "character": "Justyna Luszcz"
    },
    {
      "id": "nm0825555",
      "name": "Malgorzata Zajaczkowska",
      "character": "Grazyna"
    },
    {
      "id": "nm5105515",
      "name": "Bartlomiej Blaszczynski",
      "character": ""
    },
    {
      "id": "nm1438461",
      "name": "Jerzy Glybin",
      "character": ""
    },
    {
      "id": "nm1458969",
      "name": "Sylwester Jakimow",
      "character": ""
    },
    {
      "id": "nm1433715",
      "name": "Andrzej Kowalczyk",
      "character": ""
    },
    {
      "id": "nm3928461",
      "name": "Pawel Kowalczyk",
      "character": ""
    },
    {
      "id": "nm2676059",
      "name": "Joanna Krochmalska",
      "character": "(as J. Krochmalska)"
    },
    {
      "id": "nm1436171",
      "name": "Wieslaw Kupczak",
      "character": ""
    },
    {
      "id": "nm4832504",
      "name": "Aleksandra Kusio",
      "character": ""
    },
    {
      "id": "nm3315938",
      "name": "Milena Lisiecka",
      "character": ""
    },
    {
      "id": "nm5104913",
      "name": "Ernest Lorek",
      "character": "Marcin Zieba 'Sot'"
    },
    {
      "id": "nm1293962",
      "name": "Adam Nawojczyk",
      "character": ""
    },
    {
      "id": "nm4780202",
      "name": "Barbara Prokopowicz",
      "character": ""
    },
    {
      "id": "nm2191301",
      "name": "Grzegorz Przybyl",
      "character": ""
    },
    {
      "id": "nm4069194",
      "name": "Monika Radziwon",
      "character": ""
    },
    {
      "id": "nm1433788",
      "name": "Wojciech Skibinski",
      "character": "Club's owner"
    },
    {
      "id": "nm4629124",
      "name": "Roman Slefarski",
      "character": ""
    },
    {
      "id": "nm2910367",
      "name": "Dorota Wierzbicka-Matarelli",
      "character": ""
    },
    {
      "id": "nm0998409",
      "name": "Katarzyna Maria Zielinska",
      "character": "Journalist       (as Katarzyna Zielinska)"
    }
  ],
  "overview": "One of the biggest Polish film premieres of 2012 and eagerly anticipated for over a decade, it is the story of the late 90s generation and the three friends behind the music: Magik, Focus and Rahim.  The fact-based film directed by Leszek Dawid charts the relentless struggle for success of Paktofonika, against the backdrop of crumbling traditional values in dreary 90s Silesia. The contradictory ideals of hiphop - the rebellious, edgy lyrics against the ‘system’ juxtaposed with the money and  fame sought by the artists - are superbly captured in this dark, unforgettable drama.",
  "storyline": "The process of creating Polish hip-hop group Paktofonika, its highs and lows and very last days of life of its frontman and co-founder Piotr (Magik) Luszcz.",
  "plot": "On October 30, 1989, Maria Rossi (Suzan Crowley) committed a triple murder during an exorcism performed on her. The Catholic Church became involved, and she has since been in a Catholic psychiatric hospital in Rome. A news story and police investigation show the three members of the clergy whom she murdered. Her daughter, Isabella, learned of the murders from her father, who died three days after telling her.\n\nTwenty years later, Isabella (Fernanda Andrade) is in the process of filming a documentary about exorcisms and, to find out more about her mother, she visits a school in Rome. She meets two priests, Ben (Simon Quarterman) and David (Evan Helmuth), who take her with them on an exorcism performed on Rosalita (Bonnie Morgan). They bring along medical equipment to determine if it's possession or mental illness. Rosalita attacks the crew after spouting out obscene remarks in different languages and accents. She calls Isabella by her name, despite not knowing her. Eventually, they get her under control.\n\nWhen Isabella goes to visit her mother, Maria, in the asylum, she finds that her mother speaks in different accents and has paintings all over the walls. She has inverted crosses carved into her arms and her bottom lip. Maria tells Isabella that killing a child is against God's will. Isabella tells David and Ben that she had an abortion years ago and her mother had no way of knowing that—another sign that showed possible possession. As the crew prepares to perform an exorcism/analysis on Maria, David worries about losing his job, since the Church does not authorize exorcisms without undeniable proof that the patient is indeed possessed. During the procedure, Maria mentions knowing what Ben did in the past.\n\nAfter analyzing the data from the video and audio files, they present the evidence to the Church. David shows many signs of stress, as Ben plays the audio files over and over. Ben finds that there are four different demons speaking in unison. David is to perform a baptism at his church, in which Michael tags along to record. When he holds the baby to start the immersion baptism, he mutters some lines from the Bible and starts forcefully submerging the baby in the holy water. The crowd rush up to save the baby as he passes out.\n\nSoon after, Ben finds David at home with blood all over his forearms, much the way Maria was during the exorcism. The police arrive, and David acquires an officer's handgun and holds it in his mouth. Ben tells him to fight it, but he begins to weep, reciting the Lord's Prayer, and forgets the last few words. He laughs and shoots himself. Isabella begins having a seizure.\n\nBen hysterically comes to the realization that Isabella is possessed. Ben and Michael leave with Isabella in a car, heading to get help for a potential exorcism. While Michael drives, Isabella speaks of also knowing the horrible act Ben committed, scaring Ben. She then tries to strangle Michael and breathes into his mouth. He instantly shows signs of possession, and acceleration can be heard as Michael speeds into oncoming traffic. The camera goes black, and cuts in with short sequences of chaos, most likely of Michael, Isabella and Ben flying through their car windshield, their outcome unknown.\n\nBefore the credits start rolling, a title card is shown informing that the case of the Rossi family is still unresolved, followed by another title card directing viewers to a website (www.TheRossiFiles.com, currently defunct) \"for more information on the ongoing investigation\".",
  "synopsis": null
}