{
  "imdb_id": "tt2266781",
  "tmdb_id": "294862",
  "douban_id": null,
  "title": "Magical Universe (2013)",
  "genres": [
    "Documentary",
    "Biography"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "80 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm0941467",
      "name": "Jeremy Workman"
    }
  ],
  "writer": [
    {
      "id": "nm0941467",
      "name": "Jeremy Workman",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm4921928",
      "name": "Al Carbee",
      "character": "Himself"
    },
    {
      "id": "nm0941467",
      "name": "Jeremy Workman",
      "character": "Himself"
    },
    {
      "id": "nm5440153",
      "name": "Astrid von Ussar",
      "character": "Herself"
    }
  ],
  "overview": "Filmed for over a decade, MAGICAL UNIVERSE is a portrait of Al Carbee, an 88 year old strange and reclusive outsider artist who spends his days alone in a massive house in Maine creating art -- mostly featuring Barbie Dolls in elaborate dioramas. The documentary profiles Carbee's amazing body of work and his relentlessly creative lifestyle. Carbee's story is explored through the prism of his unlikely friendship with New York filmmaker Jeremy Workman, who unexpectedly becomes Carbee's closest friend and only link to the outside world. Far beyond just a portrait of an eccentric, MAGICAL UNIVERSE is about wonder, friendship, and the transcendent power of creativity. Its story culminates with Al Carbee's greatest triumph as an artist and a man.",
  "storyline": "Filmed over 10 years, Magical Universe is a strange and inspiring portrait of Al Carbee, an 88 year old eccentric artist who spends all his days making Barbie art. The documentary chronicles the decade-long relationship between artist and filmmaker Jeremy Workman, who became Carbee's closest friend and only link to the outside world. At its core, Magical Universe is about wonder, friendship, and the transcendent power of creativity, and it culminates with Al Carbee's greatest triumph as an artist and man.",
  "plot": null,
  "synopsis": null
}