{
  "imdb_id": "tt2265534",
  "tmdb_id": "157375",
  "douban_id": null,
  "title": "The Lifeguard (2013)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "98 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm1225921",
      "name": "Liz W. Garcia"
    }
  ],
  "writer": [
    {
      "id": "nm1225921",
      "name": "Liz W. Garcia",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0068338",
      "name": "Kristen Bell",
      "character": "Leigh"
    },
    {
      "id": "nm0336701",
      "name": "Mamie Gummer",
      "character": "Mel"
    },
    {
      "id": "nm0771414",
      "name": "Martin Starr",
      "character": "Todd"
    },
    {
      "id": "nm3868664",
      "name": "Alex Shaffer",
      "character": "Matt"
    },
    {
      "id": "nm0367176",
      "name": "Joshua Harto",
      "character": "John"
    },
    {
      "id": "nm3620810",
      "name": "David Lambert",
      "character": "Little Jason"
    },
    {
      "id": "nm0001496",
      "name": "Amy Madigan",
      "character": "Justine"
    },
    {
      "id": "nm0480775",
      "name": "Adam LeFevre",
      "character": "Hans       (as Adam Lefevre)"
    },
    {
      "id": "nm0278125",
      "name": "John Finn",
      "character": "Big Jason"
    },
    {
      "id": "nm1445789",
      "name": "Paulie Litt",
      "character": "Lumpy"
    },
    {
      "id": "nm0707983",
      "name": "Sendhil Ramamurthy",
      "character": "Raj"
    },
    {
      "id": "nm0485085",
      "name": "Mike Landry",
      "character": "Officer Miller"
    },
    {
      "id": "nm3343582",
      "name": "Tom Kondilas",
      "character": "Officer Federici"
    },
    {
      "id": "nm1511558",
      "name": "Carlos Velazquez",
      "character": "Marco"
    },
    {
      "id": "nm1063510",
      "name": "Lisa Ann Goldsmith",
      "character": "Matt's Mom"
    },
    {
      "id": "nm6045893",
      "name": "Anthony Marino",
      "character": "Scrappy Kid - Aaron"
    },
    {
      "id": "nm6045894",
      "name": "Debbie College",
      "character": "Tabitha"
    },
    {
      "id": "nm5485584",
      "name": "Marty Landry",
      "character": "Drowning Boy"
    },
    {
      "id": "nm6045895",
      "name": "Royce Hearn",
      "character": "Kid"
    },
    {
      "id": "nm4166964",
      "name": "Fabio Polanco",
      "character": "Landlord"
    },
    {
      "id": "nm2087548",
      "name": "Cody Hartman",
      "character": "Sullen Teenage Boy"
    },
    {
      "id": "nm5281525",
      "name": "Terri Middleton",
      "character": "Matt's Aunt"
    },
    {
      "id": "nm3990143",
      "name": "John Mancini",
      "character": "Bartender"
    }
  ],
  "overview": "A former valedictorian quits her reporter job in New York and returns to the place she last felt happy: her childhood home in Connecticut. She gets work as a lifeguard and starts a dangerous relationship with a troubled teenager.",
  "storyline": "29-year-old Leigh is on leave from her job in New York City after feeling a sense of emptiness and sadness in her life. Leigh has returned to her parents' home, to her high school job as a lifeguard and to her high school friends still in town. But Leigh continues to struggle in finding happiness since her parents don't approve and she's bullied by local kids at the pool. Leigh finds an almost like kindred spirit in high school student Little Jason; but when their friendship turns into an illicit relationship, her friends don't approve and even more tragedy awaits Leigh in her personal journey towards happiness.",
  "plot": "Reporter Leigh London is a talented writer living in New York City. She is in a relationship with an engaged man and finds it hard to accept his situation. After becoming disillusioned with her life in the city, she decides to leave (without notifying her job) and go back to her hometown. Her mother questions why she has returned so suddenly but her father is delighted, especially after Leigh announces her decision to stay indefinitely. She becomes reacquainted with two of her former friends, art appraiser Todd and vice principal Mel. While having some drinks with them, she announces that she's taken up her old high school job of the lifeguard's position of the community pool, where she meets the maintenance man's son Jason.\n\nOver the next few weeks, she becomes friends with Jason and his best friend Matt, and encourages wild behavior on her two high school friends, hanging out with the teens and smoking pot. Todd happily goes along with Leigh's behavior; while Mel does too, it takes its toll on her relationship with her husband as they are trying to conceive a baby. Leigh begins to spend a lot more time with Jason, and soon she realizes her attraction to him and vice versa. One night, after hanging out at the pool after hours with their friends, Leigh goes to the bathroom/changing room where Jason follows. They then kiss and immediately have sex on the sink basin. This starts a relationship between the two that continues over the summer, leading to frequent sexual encounters. One day while the two are having sex in bed, Leigh realizes she's falling in love with Jason and talks him into staying around longer instead of moving to Vermont with Matt as he had planned. Matt has been kicked out by his mother and has made it clear that he is desperate to leave town.\n\nAfter Jason postpones the Vermont plans, Matt becomes very disheartened. Meanwhile, Mel's husband becomes increasingly frustrated with her \"carefree\" behavior. While at the pool one morning, Todd discovers Leigh and Jason kissing but doesn't say anything. Leigh's mother asked her to move out as she isn't the only one trying to get their life in order; Leigh stays with Jason. Her cat goes missing in the process. Todd lets it slip to Mel that Leigh is staying at Jason's and Mel discovers the relationship between the two, to her horror. She approaches Leigh in anger and plans to inform Jason's father. Leigh and Jason then go searching for her cat, only to discover Matt has committed suicide by hanging himself from a tree in the woods. Matt repeatedly mentions throughout the film that he hates life in the town and is desperate to get to Vermont. It seems Jason's postponement was his last bit of hope broken.\n\nThis takes its toll on Jason very hard and he is deeply distraught. Leigh takes the responsibility to inform Matt's mother, who is also heartbroken at the news. Leigh consoles her until her relatives arrive and then later finds her missing cat hiding near her parents' house. At the funeral, she makes her peace with Mel and goes to meet Jason one last time before they both leave. They share an emotional hug, both showing a strong affection for one another. She gives him $1,000 she won from a journalist prize, and walks away with tears in her eyes knowing the feelings she has for Jason could never truly be acted upon. The final scene ends with a postcard from Jason stating he still thinks about her a lot and Matt also.",
  "synopsis": null
}