{
  "imdb_id": "tt2261799",
  "tmdb_id": "94443",
  "douban_id": null,
  "title": "Love You More (2012)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "105 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm2787634",
      "name": "James Mixon"
    }
  ],
  "writer": [
    {
      "id": "nm2787634",
      "name": "James Mixon",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm2787634",
      "name": "James Mixon",
      "character": "Orson"
    },
    {
      "id": "nm1593633",
      "name": "Kandis Fay",
      "character": "Clara       (as Kandis Erickson)"
    },
    {
      "id": "nm3900384",
      "name": "Jenni Halina",
      "character": "Goth Girl /              Nikki"
    },
    {
      "id": "nm3849008",
      "name": "Tyler Peck",
      "character": "Jon"
    },
    {
      "id": "nm2440579",
      "name": "Greg Nutcher",
      "character": "Tim"
    }
  ],
  "overview": "Orson struggles with the guilt and regret attached to his ex-girlfriend and a terrible tragedy.",
  "storyline": "Orson struggles with the guilt and regret attached to his ex-girlfriend and a terrible tragedy.",
  "plot": "In 1815, French prisoner Jean Valjean is released on parole from Toulon prison after serving 19 years for stealing a loaf of bread and trying to escape multiple times. On the outside, Valjean’s paroled status prevents him from getting work. He is offered shelter by the kindly Bishop of Digne, but Valjean steals his silverware. Captured by police and taken to the Bishop, Valjean is shocked when the Bishop, representing the grace of God, says he gave Valjean the silver, then giving him much more, telling him to use it to do something worthwhile with his life. Valjean breaks his parole to start a new life.\n\nEight years later, Valjean is factory owner and mayor of Montreuil, Pas-de-Calais. He is shocked when a Toulon prison guard Javert arrives as his new chief of police. Javert suspects Valjean’s identity when he rescues an injured worker trapped under a heavy cart. One of Valjean’s workers, Fantine, is dismissed by the factory foreman upon learning she is sending her earnings to her illegitimate daughter Cosette, who lives with the greedy innkeepers, the Thénardiers. To support her daughter, Fantine was overwhelmed and tortured by prostitutes and turns into one of them (her hair was cut short and her teeth were badly removed.) and is arrested by Javert when she attacks an abusive customer. Valjean, learning who she is, has her hospitalized.\n\nValjean learns a man has been wrongly identified as him, and reveals his true identity to a court before returning to the dying Fantine, promising to care for Cosette. Javert arrives but Valjean escapes, finding Cosette and pays Fantine’s debts to the Thénardiers, though they refuse to believe he payed enough. Valjean and Cosette flee Javert, hiding in a convent, aided by the worker Valjean rescued before. Nine years later, Valjean has become a philanthropist and helps the poor in Paris. General Lamarque, the only government official sympathetic to the poor, dies, and a group of revolutionists called the Friends of the ABC plot to rebel against the monarchy. Marius Pontmercy, a member of the Friends, encounters Cosette and they fall in love, asking Éponine, the Thénardiers’ daughter to help find her.\n\nAfter Marius and Cosette meet and profess their love for each other, Éponine (who is in love with Marius) prevents her father from robbing Valjean’s house. Valjean, believing Javert is near, makes plans to flee to England with Cosette. Cosette writes a letter for Marius, but Éponine hides it, intending on dying with Marius during the rebellion. During Lamarque’s funeral procession, the revolt begins and barricades are built across Paris. Javert pretends to be an ally to spy on the rebels but the street urchin Gavroche (the Thénadiers′ abandoned son) exposes him as a policeman, and they subdue him. During the first skirmish against the soldiers, Éponine takes a bullet for Marius and dies in his arms, giving him Cosette’s letter and confesses her deceit to him beforehand. Gavroche takes Marius’ reply to Valjean, who joins the revolution to guard Marius.\n\nValjean offers to execute Javert but actually releases him, faking his death. By dawn, the soldiers are close to ending the revolution, storming the students’ barricade and killing everyone but Valjean and Marius, who escape into the sewers. Thénardier comes across Valjean and the unconscious Marius, stealing the latter’s ring, before pointing a way out. Valjean finds Javert waiting for him, ignoring his nemesis’ threats. Javert, morally confused by the mercy of Valjean, commits suicide by throwing himself in the Seine. Marius recovers but is traumatized by the death of his friends.\n\nMarius and Cosette plan to marry but Valjean, concerned his presence would threaten their happiness, makes plans to leave and reveals his identity to Marius, who promises to remain silent for the benefit of Cosette. Cosette and Marius marry but the Thénardier's crash the wedding to try and blackmail Marius, Thénardier saying he witnessed Valjean carrying a murdered corpse and showing the stolen ring. Realizing it was Valjean who rescued him, he forces Thénardier to reveal Valjean's whereabouts, at the convent. The dying Valjean reunites with Cosette and Marius, giving them letters of confession, before peacefully dying, guided away by Fantine and the Bishop’s spirits.",
  "synopsis": null
}