{
  "imdb_id": "tt2288067",
  "tmdb_id": "224124",
  "douban_id": null,
  "title": "Thailand Torn Between Two Worlds (2009)",
  "genres": [
    "Documentary"
  ],
  "country": "Thailand",
  "version": [],
  "imdb_rating": 9.0,
  "director": [
    {
      "id": "nm4625764",
      "name": "Paul Everett"
    }
  ],
  "writer": [
    {
      "id": "nm4625764",
      "name": "Paul Everett",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4625764",
      "name": "Paul Everett",
      "character": "Himself"
    },
    {
      "id": "nm4938215",
      "name": "Adam King",
      "character": "Himself"
    }
  ],
  "overview": "This documentary film looks closely at the life changing experiences Thailand can provide. Temptation, lust and desire on every corner. For Adam it was just a holiday, a holiday that turns his life upside down, unaware of the physiological dangers that lay ahead of him as adapting back to your old life can be devastating. Watch as Adam's reality becomes entangled with fantasy in which life changing decisions have to be made in which Adam finds himself Torn Between Two Worlds.",
  "storyline": "A holiday of a life time to the ''Land of Smiles'' for Adam, an opportunity to re-examine his mundane existence away from the worst and most depressed place in the UK, Middlesbrough in the North East of England. But what exactly is it about this exotic corner of the world that causes normally sane, level-headed individuals to consider throwing away everything they have achieved after only one or two visits to Thailand? This documentary film looks closely at the life changing experiences Thailand can provide. Temptation, lust and desire on every corner. For Adam it was just a holiday, a holiday that turns his life upside down, unaware of the physiological and psychological dangers that lay ahead of him, as adapting back to your old life can be devastating. Watch as Adam's reality becomes entangled with fantasy in which life changing decisions have to be made in which Adam finds himself...",
  "plot": null,
  "synopsis": null
}