{
  "imdb_id": "tt2275946",
  "tmdb_id": "190469",
  "douban_id": "24522651",
  "title": "Redirected (2014)",
  "genres": [
    "Action",
    "Comedy",
    "Crime",
    "Thriller"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "99 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.7,
  "director": [
    {
      "id": "nm2543774",
      "name": "Emilis Velyvis"
    }
  ],
  "writer": [
    {
      "id": "nm3556602",
      "name": "Jonas Banys",
      "description": null
    },
    {
      "id": "nm5135092",
      "name": "Lewis Britnell",
      "description": "dialogue editor"
    },
    {
      "id": "nm2543774",
      "name": "Emilis Velyvis",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0005068",
      "name": "Vinnie Jones",
      "character": "Golden Pole"
    },
    {
      "id": "nm0931656",
      "name": "Scot Williams",
      "character": "Michael"
    },
    {
      "id": "nm1534895",
      "name": "Gil Darnell",
      "character": "Johnny"
    },
    {
      "id": "nm1173749",
      "name": "Oliver Jackson",
      "character": "Tim"
    },
    {
      "id": "nm0833030",
      "name": "Antony Strachan",
      "character": "Ben       (as Anthony Strachan)"
    },
    {
      "id": "nm3046770",
      "name": "Andrius Ziurauskas",
      "character": "Staska"
    },
    {
      "id": "nm0764662",
      "name": "Vytautas Sapranauskas",
      "character": "Algis       (as Vytas Sapranaukas)"
    },
    {
      "id": "nm0810638",
      "name": "Artur Smolyaninov",
      "character": "Doncius"
    },
    {
      "id": "nm5171466",
      "name": "Vita Siauciunaite",
      "character": "Saule"
    },
    {
      "id": "nm5171496",
      "name": "Monika Vaiciulyte",
      "character": "Simona"
    },
    {
      "id": "nm4703719",
      "name": "Daniel-John Williams",
      "character": "Golden Pole's Hitman 'Barman'"
    },
    {
      "id": "nm2929043",
      "name": "Daniel Nehme",
      "character": "Turk"
    },
    {
      "id": "nm4594565",
      "name": "Daniel Bowker",
      "character": "Meat"
    },
    {
      "id": "nm1312091",
      "name": "Andrew McHale",
      "character": "Karl"
    },
    {
      "id": "nm1090615",
      "name": "Aurimas Meliesius",
      "character": "Vycka"
    },
    {
      "id": "nm2262865",
      "name": "Arturas Aleksejevas",
      "character": "Russian Soldier"
    },
    {
      "id": "nm3953665",
      "name": "Darius Auzelis",
      "character": "Paramedic Driver"
    },
    {
      "id": "nm2794112",
      "name": "Arnis Berzins",
      "character": "Poker Player#2"
    },
    {
      "id": "nm3893884",
      "name": "Jonas Cepulis",
      "character": "Smuggler"
    },
    {
      "id": "nm5056579",
      "name": "Edgaras Cerniauskas",
      "character": "Club Barman"
    },
    {
      "id": "nm5171489",
      "name": "Vitalijus Cololo",
      "character": "Anzeika"
    },
    {
      "id": "nm3699600",
      "name": "Jack Cooper",
      "character": "Poker Player#1"
    },
    {
      "id": "nm5512470",
      "name": "Tomas Fiodorovas",
      "character": "Wedding guest"
    },
    {
      "id": "nm5506530",
      "name": "Arnoldas Gotto",
      "character": "Boy Translator"
    },
    {
      "id": "nm3613279",
      "name": "Lee Nicholas Harris",
      "character": "Singing Drunk Scottish Football Fan#1"
    },
    {
      "id": "nm0416019",
      "name": "Kestutis Stasys Jakstas",
      "character": "Police officer #2       (as Kestutis Jakstas)"
    },
    {
      "id": "nm5278945",
      "name": "Aleksej Janavicius",
      "character": "Anzeika's Brother"
    },
    {
      "id": "nm10382225",
      "name": "Sarunas Januskevicius",
      "character": "Wedding Guest #3, Bar Brawler #2"
    },
    {
      "id": "nm3042147",
      "name": "Valerijus Jevsejevas",
      "character": "Taxi driver"
    },
    {
      "id": "nm8375403",
      "name": "Daniel Jones",
      "character": "Steel"
    },
    {
      "id": "nm2282540",
      "name": "Daiva Jovaisiene",
      "character": "Sandra"
    },
    {
      "id": "nm5506537",
      "name": "Dovile Karaliute",
      "character": "Hotel Receptionist #2"
    },
    {
      "id": "nm5171513",
      "name": "Raifailas Karpis",
      "character": "Antanas"
    },
    {
      "id": "nm5278932",
      "name": "Brigita Kazlauskaite",
      "character": "Prostrate Patient"
    },
    {
      "id": "nm3047893",
      "name": "Bronius Kindurys",
      "character": "Bronius"
    },
    {
      "id": "nm10145056",
      "name": "Kamile Kolete",
      "character": "Dancer"
    },
    {
      "id": "nm3406814",
      "name": "Gabrielius Liaudanskas",
      "character": "Wedding Guest#2"
    },
    {
      "id": "nm5271626",
      "name": "Linas Lobeckis",
      "character": "Wedding Guest"
    },
    {
      "id": "nm5278493",
      "name": "Romaldas Stasys Mickevicius",
      "character": "Kazys"
    },
    {
      "id": "nm5278846",
      "name": "Milda Morkeviciute",
      "character": "Bridesmaid"
    },
    {
      "id": "nm2552266",
      "name": "Mindaugas Papinigis",
      "character": "Vova"
    },
    {
      "id": "nm1574624",
      "name": "Andrius Paulavicius",
      "character": "Yelling driver"
    },
    {
      "id": "nm4281935",
      "name": "Marius Repsys",
      "character": "Staska's guy#1"
    },
    {
      "id": "nm2217556",
      "name": "Donatas Simukauskas",
      "character": "Police officer #1"
    },
    {
      "id": "nm1673061",
      "name": "Gabija Siurbyte",
      "character": "Hotel Receptionist #1       (as Gabija Siurblyte)"
    },
    {
      "id": "nm5506531",
      "name": "Marius Slezas",
      "character": "Drunk Scottish Football Fan#3"
    },
    {
      "id": "nm5506688",
      "name": "Augustas Slikas",
      "character": "Drunk Scottish Football Fan#2"
    },
    {
      "id": "nm5506614",
      "name": "Irena Stanisevskaja",
      "character": "Staska's Mother"
    },
    {
      "id": "nm5278746",
      "name": "Mantas Stonkus",
      "character": "Staska's guy#2"
    },
    {
      "id": "nm5171445",
      "name": "Karina Stungyte",
      "character": "Ruta"
    },
    {
      "id": "nm6696523",
      "name": "Zilvinas Svitojus",
      "character": "Bar brawler"
    },
    {
      "id": "nm5185027",
      "name": "Rodrigo Torres",
      "character": "Indian Poker Player"
    },
    {
      "id": "nm4395395",
      "name": "Jonas Trukanas",
      "character": "Limousine Driver"
    },
    {
      "id": "nm4687827",
      "name": "Vilius Tumalavicius",
      "character": "Police officer #3"
    },
    {
      "id": "nm4643237",
      "name": "Gintaras Urbonas",
      "character": "Homeless Man"
    },
    {
      "id": "nm1533300",
      "name": "Sakalas Uzdavinys",
      "character": "Paramedic"
    },
    {
      "id": "nm3012404",
      "name": "Sonata Visockaite",
      "character": "Zita"
    },
    {
      "id": "nm5506658",
      "name": "Okeoghene Daniel Williams",
      "character": "Illegal immigrant"
    }
  ],
  "overview": "Four friends become stranded in Eastern Europe and have to become hit men, prostitutes, corrupt cops, smugglers and more to make it home.",
  "storyline": "Four friends - John, Ben, Tim and Michael - turned first-time robbers, get stranded in Eastern Europe through a series of misadventures and have to find their way back home. To do so, they'll have to overcome hit men, whores, corrupt cops, smugglers and more, all while rediscovering each other as friends",
  "plot": "Hercules is the leader of a band of mercenaries composed of the spear-wielding prophet Amphiaraus of Argos, the knife-throwing thief Autolycus of Sparta, the feral warrior Tydeus of Thebes, the Amazon archer Atalanta of Scythia and his nephew storyteller Iolaus of Athens. Hercules is said to be the demigod son of Zeus, who completed the legendary Twelve Labors, only to be betrayed by Hera who drove him insane and caused him to murder his wife Megara and their children during a visit to King Eurystheus. Throughout the film, it is not clearly established that Hercules is truly the son of Zeus, and many are skeptical of the claim as well as of the stories of Hercules' famous Twelve Labors. Despite this, Hercules displays unusual strength and nigh-unmatched skill in combat. Hercules is frequently haunted by the memory of the deaths of his wife and daughters by his hand, as well as visions of Cerberus.\n\nAfter finishing a recent mission and saving his nephew on the Macedonian Coast in Northern Greece in 358 BC, Hercules and his team are celebrating and drinking at a tavern when they are approached by Ergenia on behalf of her father Lord Cotys who wants Hercules to train the armies of Thrace to defend the kingdom from bloodthirsty warlord Rhesus. Hercules accepts after he and his men are offered his weight in gold, and the band is welcomed to Thrace by King Cotys and General Sitacles, leader of the Thracian army. However, Rhesus has reached the Bessi tribe in Central Thrace and Cotys insists that Hercules lead the army into battle to defend the Bessi, despite their lack of training. However, they are too late as Rhesus' sorcery has turned the Bessi against the Thracians.\n\nAfter the Bessi are defeated, Hercules properly trains the army, then Hercules and Sitacles confront Rhesus and his soldiers on the battlefield before Mount Asticus. The Thracians force Rhesus' army to retreat, but Rhesus himself rides out to confront Hercules and is defeated by him. Rhesus is taken back to Thrace as a prisoner, where he is tortured and humiliated. Hercules takes pity and stops the townfolk from throwing more objects at him, then Hercules mentions Rhesus' actions of burning down villages, Rhesus tells him it was not him or his army, and tells Hercules that he has been fighting on the wrong side. Later in the hall of the palace, Rhesus has been chained up and left on display. Noticing that Ergenia has taken pity to him, Hercules confronts her and finds out Rhesus was telling the truth in that he was merely retaliating against Lord Cotys's aggressive attempts to expand his kingdom. Although Ergenia doesn't agree with Lord Cotys's methods, she goes along with them for the sake of her son Arius, Lord Cotys's successor to the throne, who is being threatened by Cotys.\n\nAfter receiving their reward, the mercenaries are ready to leave, but Hercules decides to stay behind to stop Cotys, and all but Autolycus choose to follow him. However, they are overpowered and captured by Sitacles and his men. While chained, Hercules is confronted by King Eurystheus, who is in league with Lord Cotys. Eurystheus reveals that he drugged Hercules the night his family died, viewing him as a threat to his power. Hercules's family was in fact killed by three vicious wolves sent by Eurystheus, resulting in Hercules's constant hallucinations of Cerberus. When Lord Cotys orders Ergenia to be executed for her betrayal, Hercules is encouraged by Amphiaraus to believe in himself just as everyone believes in him. In a show of superhuman strength, Hercules breaks free of his chains, saving Ergenia and slaying the wolves with his bare hands. Hercules releases the prisoners, including Rhesus, and then confronts King Eurystheus, impaling him with his own dagger. He is attacked by Sitacles, who is then stabbed by Iolaus.\n\nOutside, Hercules and his forces battle Lord Cotys and his army. Arius is taken hostage, but then rescued by Autolycus, who has decided to return to help his friends. In the ensuing battle, Tydeus is mortally wounded while protecting Arius, but fights on slaughtering numerous Thracian soldiers. Hercules again uses inhuman strength and pushes a massive statue of Hera from its foundations and uses it to crush Lord Cotys and many of his soldiers. The remaining soldiers see Hercules as lightning flashes in the background. The surviving soldiers bow to Hercules, and Arius takes the throne, with Ergenia at his side, while Hercules and his men depart in search of other adventures.\n\nAs the credits roll, an animated retelling of the Twelve Labors shows how Hercules accomplished these feats with the help of his companions.",
  "synopsis": "REDIRECTED is an outrageous hangover-meets-guy-ritchie type criminal action-drama-thriller comedy with a distinctive flavor of Eastern European exotic. It tells a story of four friends turned first-time robbers John, Ben, Tim and Michael who accidentally get stranded in a middle-of-nowhere Eastern European country and have to fight their way back home through the land of whores, smugglers, dirty cops, cheap beer and sick fantasies. In order to save their asses, friends must not only overcome an ultimate culture shock experience, but also rediscover their friendship.The plan seemed 100% bulletproof - they take over an illegal casino in London, get the money, catch a plane to Malaysia and get lost in mind-blowing exotics of emerald jungle, golden beaches, cheap alcohol and teenage sex. The plan was a genius, and it worked. Almost.They took over a casino and they got the money - around one million pounds in cash - but the bad guys started shooting. Michael freaked out and tried to back away. Tim had no chance but to beat sense into him with a fire extinguisher, which resulted in Michael boarding a plane senseless. The plane took off and and then a volcano in Iceland started spewing ash like crazy and all the flights had to be grounded. This is how John, Ben, Tim and Michael got stranded in some post-soviet Eastern European country with an unpronounceable name and sick attitude towards everything.Thats where all the fun starts.Michael wakes up somewhere in a hotel, without a slightest idea where he is. He can't find his friends, but instead he finds the money that John hid inside a bath tub. He hits the road with a sack full of cash only to learn that he is in London no more. Malaysia neither. The learning comes costly when local bullies rip him clean, setting Michael on a crusade to get back a million pounds in a country he doesn't know full of people he doesn't understand.Meanwhile, after a night-time stroll through local bars and clubs, Ben and Tim wake up in some shabby countryside farmstead and accidentally start a personal war with local smugglers. They don't know where they are and can't find their way back instead they have to run for their lives, escaping from one crazy adventure right into another.At the same time John wakes up alone in an empty apartment naked and chained to a radiator. After a horny Catholic priest tries to murder him with a hammer, John escapes still naked and chained to the radiator only to start a romance with a local hooker.And above all this, a group of hit men from London come to get their money back and teach John, Ben, Tim and Michael their last lesson. It all ends in a surreal wedding party that turns into a grotesque shoot out with the local smugglers. John, Ben, Tim and Michael barely escape only to find themselves in a new situation that makes their all previous experiences look like a pleasant vacation.From the creators of the all time best grossing Lithuanian film Zero 2, REDIRECTED is an outrageous joy ride targeted at international mature audiences. Fast paced action, over the edge humor, politically incorrect jokes and a distinctive touch of Eastern European craziness will engage the viewers into an unforgettable on-screen adventure."
}