{
  "imdb_id": "tt2279306",
  "tmdb_id": "167466",
  "douban_id": null,
  "title": "Propaganda (2012)",
  "genres": [
    "Documentary",
    "News"
  ],
  "country": "New Zealand",
  "version": [
    {
      "runtime": "96 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.3,
  "director": [
    {
      "id": "nm5409199",
      "name": "Slavko Martinov"
    }
  ],
  "writer": [
    {
      "id": "nm5409199",
      "name": "Slavko Martinov",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm1002629",
      "name": "Eugene Chang",
      "character": "Narrator /              North Korean Professor"
    },
    {
      "id": "nm0448929",
      "name": "Susannah Kenton",
      "character": "English Voice-Over       (voice)"
    }
  ],
  "overview": "An anti-western propaganda film about the influences of American visual and consumption culture on the rest of the world, as told from a North Korean perspective.",
  "storyline": "During a trip to Seoul, translator Sabine Program was approached by a couple that claimed to be North Korean dissidents. They handed her a DVD with the request to translate and disseminate it. The film features a North Korean scientist whose identity has been concealed, who uses hundreds of TV excerpts and archive footage to show what's wrong with Western visual and consumption culture. In the tradition of Michael Moore, the film attacks the moral attenuation, political manipulation and hyper-consumerism that characterize the Western world. In chapters with titles like \"Rewriting History,\" \"Complicity\" and \"The Cult of Celebrity,\" we are treated to a lineup of the most embarrassing occidental excesses and globalization, a point of view that remarkably resembles the recent Occupy movement: the \"psychological warfare\" at the hands of multinationals, shopping-obsessed consumers and the failure of democracy. Toward the end of this propaganda piece, the role of North Korea in all of this ...",
  "plot": null,
  "synopsis": null
}