{
  "imdb_id": "tt2274042",
  "tmdb_id": "191077",
  "douban_id": null,
  "title": "Beat Girl (2013)",
  "genres": [
    "Drama",
    "Music",
    "Romance"
  ],
  "country": "Ireland",
  "version": [
    {
      "runtime": "93 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.5,
  "director": [
    {
      "id": "nm0207239",
      "name": "Mairtín de Barra"
    }
  ],
  "writer": [
    {
      "id": "nm2006142",
      "name": "Nuno Bernardo",
      "description": "story"
    },
    {
      "id": "nm2006142",
      "name": "Nuno Bernardo",
      "description": null
    },
    {
      "id": "nm1282260",
      "name": "Melanie Martinez",
      "description": "writer"
    },
    {
      "id": "nm1282260",
      "name": "Melanie Martinez",
      "description": null
    },
    {
      "id": "nm3553878",
      "name": "Susana Tavares",
      "description": "story"
    },
    {
      "id": "nm3553878",
      "name": "Susana Tavares",
      "description": "writer"
    },
    {
      "id": "nm3553878",
      "name": "Susana Tavares",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3009279",
      "name": "Louise Dylan",
      "character": "Heather"
    },
    {
      "id": "nm2947320",
      "name": "Craig Daniel Adams",
      "character": "Toby"
    },
    {
      "id": "nm4718156",
      "name": "Amy Brangwyn",
      "character": "Amy"
    },
    {
      "id": "nm3328107",
      "name": "Jonathan Holby",
      "character": "Steve"
    },
    {
      "id": "nm0383553",
      "name": "Michael Higgs",
      "character": "Tom"
    },
    {
      "id": "nm4081752",
      "name": "Percelle Ascott",
      "character": "Mike"
    },
    {
      "id": "nm0724701",
      "name": "Miles Richardson",
      "character": "Ed"
    },
    {
      "id": "nm3291215",
      "name": "Alfie Browne-Sykes",
      "character": "Freddy"
    },
    {
      "id": "nm2416731",
      "name": "Danny Lee Wynter",
      "character": "Derek       (as Danny Lee Winter)"
    },
    {
      "id": "nm6289412",
      "name": "Tania Hosseinian",
      "character": "India"
    },
    {
      "id": "nm9476864",
      "name": "Jenny Greene",
      "character": "Mia"
    },
    {
      "id": "nm2901230",
      "name": "Hilary Rose",
      "character": "Laila"
    },
    {
      "id": "nm10539085",
      "name": "Frenando Klein",
      "character": "Christian"
    },
    {
      "id": "nm4042311",
      "name": "Annabella Forbes",
      "character": "Shop Girl"
    },
    {
      "id": "nm10539086",
      "name": "Alan Sherlock",
      "character": "Cop 1"
    },
    {
      "id": "nm10539087",
      "name": "James Mcnulty",
      "character": "Cop 2"
    },
    {
      "id": "nm2267211",
      "name": "Jose Mantero",
      "character": "Spanish Businessman"
    },
    {
      "id": "nm10539088",
      "name": "Bonnie De Barra",
      "character": "Boy in Crowd"
    },
    {
      "id": "nm10539089",
      "name": "Niya Morrissey",
      "character": "Orchestra"
    },
    {
      "id": "nm10539090",
      "name": "Vincent Varley",
      "character": "Orchestra"
    },
    {
      "id": "nm10539091",
      "name": "Rachel Rynne-Lyons",
      "character": "Orchestra"
    },
    {
      "id": "nm7216878",
      "name": "Katie Hyland",
      "character": "Orchestra"
    },
    {
      "id": "nm10539092",
      "name": "Charlotte Duffy",
      "character": "Receptionest"
    },
    {
      "id": "nm10539093",
      "name": "Hired Hands",
      "character": "Improv Band"
    },
    {
      "id": "nm10539094",
      "name": "Michael Warburton",
      "character": "Guard"
    },
    {
      "id": "nm1544568",
      "name": "Darren Rapier",
      "character": "Policeman"
    },
    {
      "id": "nm10539095",
      "name": "Chariya Vichit",
      "character": "Car Driver"
    },
    {
      "id": "nm10539096",
      "name": "Gareth Fient",
      "character": "Road Worker"
    },
    {
      "id": "nm10539097",
      "name": "Catherine Shaw",
      "character": "Lady at the Window"
    },
    {
      "id": "nm10539098",
      "name": "Paige Barrington",
      "character": "Body Popper"
    },
    {
      "id": "nm4961497",
      "name": "Laura Hitchings",
      "character": "Fashion Show Model"
    }
  ],
  "overview": "For Heather music is everything. Following in her mother's footsteps, Heather has always dreamed about getting into Juilliard and becoming a classical pianist. But all her dreams get shattered the day her mum dies. Left with nothing but a piano and debts, Heather's only option is to move in with her estranged father and half-brother. When her application for a scholarship is rejected, Heather's last hope to see her Big Dream come true is swept away. Until one day she meets Toby, a hip and handsome music store owner who opens up a whole new world to her - the world of DJ-ing and dance music. Heather is carried away by this enticing underground world, and her heart starts to beat again to the rhythm of a new life - and a new love. Heather eventually finds herself torn between two worlds of music and as her audition approaches, time comes for her to choose. And for the first time in her life she starts questioning what it is that she really desires.",
  "storyline": "For Heather music is everything. Following in her mother's footsteps, Heather has always dreamed about getting into Juilliard and becoming a classical pianist. But all her dreams get shattered the day her mum dies, and her life suddenly falls into silence. Left with nothing but a piano and debts, Heather's only option is to move in with her estranged father and half-brother. When her application for a scholarship is rejected, Heather's last hope to see her Big Dream come true is swept away. Until one day she meets Toby, a hip and handsome music store owner who opens up a whole new world to her - the world of DJ-ing and dance music. Heather, who initially turns to DJing to raise some funds, is carried away by this enticing underground world, and her heart starts to beat again to the rhythm of a new life - and a new love. Heather eventually finds herself torn between two worlds of music and as her Juilliard audition approaches, time comes for her to choose. And for the first time in her...",
  "plot": "Dawson Cole works on an oil rig off the coast of Louisiana. One day, an explosion on the job nearly kills him, throwing him into the water, but miraculously, he survives. Months later after recovering, Dawson learns that his close friend and surrogate father, Tuck Hostetler, has died and returns home for the first time in almost twenty years to carry out Tuck's final wishes. When he arrives at his house, Dawson is surprised to find that Tuck also arranged for Dawson's high school girlfriend, Amanda Collier, to join him. It seems that Tuck's intention was that Dawson and Amanda would perhaps rekindle their former romance. However, Amanda is now married to Frank Reynolds.\n\nDawson was born into a notorious backwoods criminal family with an abusive father. In flashbacks, it is revealed that as a teenager, he left his father's home and stayed overnight in Tuck Hostetler's garage. Tuck, a local mechanic who had recently lost his wife, allows Dawson to live with him and eventually considers him a son of his own.\n\nDawson and Amanda attended the same high school and began dating, soon falling in love. Before the prom, Dawson's father and brothers beat Tuck. Dawson, angered, goes to his fathers house with the intent of killing him with Tuck's rifle. However, they scuffle, and Dawson's cousin, an expectant teen father, is accidentally killed. In exchange for a lighter sentence, Dawson testifies against his father and brothers. However, since Dawson will not be paroled for another four years, he cuts ties with Amanda, forcing her to choose college over staying with him.\n\nAfter Tuck's death, Amanda and Dawson meet with Tuck's lawyer and learn that they are to scatter Tuck's ashes at a cottage he owned with his wife. Later, Dawson and Amanda spend a passionate night together. They have lunch and discuss their plans, during which Amanda learns that Dawson knew she had continued to try to visit him in prison. The following day, Amanda decides to return to her family and her strained marriage, to meet her family commitments.\n\nWhen Amanda goes home, Dawson remains at Tuck's to restore the garden. However, she later plans to split up with her husband, and she leaves Dawson a voicemail expressing her love.\n\nAfter she left the voicemail, she receives a call from which she learns that her son needs a heart transplant. Having lost her daughter already, she feels miserable on hearing this news. Soon her son gets a heart transplant surgery donor. The next morning when she wakes up, she sees Dawson sitting by her side watching her sleep, though he was not actually there. She is informed that Dawson was shot and killed by his father, who is later arrested.\n\nOne year later, she receives a call from her son, who finds out that the name of the donor whose heart he received was Dawson Cole. She later visits Tuck's house and finds a letter for her written by Dawson in which he says that he understands that she has her commitments and she wants to keep them and he could only love her more for that. She walks in the garden, which has been restored by Dawson.\n\nIn an alternate ending on the DVD, Amanda leaves her husband and she and Dawson get together and enjoy walking through Tuck's garden and the end credits roll.",
  "synopsis": null
}