{
  "imdb_id": "tt2234370",
  "tmdb_id": "127648",
  "douban_id": null,
  "title": "The 6th Extinction (2012)",
  "genres": [
    "Horror"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": "original"
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm1546912",
      "name": "John Vincent"
    }
  ],
  "writer": [
    {
      "id": "nm1546912",
      "name": "John Vincent",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm5144895",
      "name": "Mahssa Rashidy",
      "character": "Shelly Short"
    },
    {
      "id": "nm1792352",
      "name": "Eric Maurer",
      "character": "Jack Juneau"
    },
    {
      "id": "nm4230360",
      "name": "Michael Bugard",
      "character": "Michael"
    },
    {
      "id": "nm0412933",
      "name": "Eric Jaan",
      "character": "Rick Daniels"
    },
    {
      "id": "nm3106099",
      "name": "Misty Mills",
      "character": "Pam Daniels"
    },
    {
      "id": "nm5410531",
      "name": "Kevin Gondek",
      "character": "The Four Horseman"
    },
    {
      "id": "nm4030500",
      "name": "Kef Lee",
      "character": "Death"
    },
    {
      "id": "nm4110275",
      "name": "Bill Lumbert",
      "character": "Roadblock Goon"
    }
  ],
  "overview": "A cataclysmic impact on the moon signals the beginning of the end for mankind as a vampire apocalypse sweeps across Earth. Four strangers are thrown together in a desperate attempt to stay alive as vampires and their human henchmen try to murder the world. The newly turned vampire Michael and the \"Renfields\" are but the tip of the spear as The Four Horsemen and Satan himself seek to rule the world. Directed by Indie horror mainstay John Vincent for Evil Genius Entertainment, VAMPIRELAND is a special effects thrill-ride filled with goons, guns, guts, and gore. Written by jdv  (IMDB.com)",
  "storyline": "A cataclysmic impact on the moon signals the beginning of the end for mankind as a vampire apocalypse sweeps across Earth. Four strangers are thrown together in a desperate attempt to stay alive as vampires and their human henchmen try to murder the world. The newly turned vampire Michael and the \"Renfields\" are but the tip of the spear as The Four Horsemen and Satan himself seek to rule the world. Directed by Indie horror mainstay John Vincent for Evil Genius Entertainment, VAMPIRELAND is a special effects thrill-ride filled with goons, guns, guts, and gore.",
  "plot": null,
  "synopsis": null
}