{
  "imdb_id": "tt2215285",
  "tmdb_id": "103370",
  "douban_id": null,
  "title": "Madea's Witness Protection (2012)",
  "genres": [
    "Comedy",
    "Crime",
    "Drama"
  ],
  "country": "USA",
  "version": [],
  "imdb_rating": 4.8,
  "director": [
    {
      "id": "nm1347153",
      "name": "Tyler Perry"
    }
  ],
  "writer": [
    {
      "id": "nm1347153",
      "name": "Tyler Perry",
      "description": "written by"
    },
    {
      "id": "nm1347153",
      "name": "Tyler Perry",
      "description": "based on characters created by"
    }
  ],
  "cast": [
    {
      "id": "nm1347153",
      "name": "Tyler Perry",
      "character": "Madea /              Joe /              Brian"
    },
    {
      "id": "nm0506405",
      "name": "Eugene Levy",
      "character": "George Needleman"
    },
    {
      "id": "nm0000612",
      "name": "Denise Richards",
      "character": "Kate Needleman"
    },
    {
      "id": "nm0005368",
      "name": "Doris Roberts",
      "character": "Barbara"
    },
    {
      "id": "nm0999075",
      "name": "Romeo Miller",
      "character": "Jake"
    },
    {
      "id": "nm0000792",
      "name": "Tom Arnold",
      "character": "Walter"
    },
    {
      "id": "nm0025309",
      "name": "John Amos",
      "character": "Pastor Nelson"
    },
    {
      "id": "nm0004958",
      "name": "Marla Gibbs",
      "character": "Hattie"
    },
    {
      "id": "nm2836740",
      "name": "Danielle Campbell",
      "character": "Cindy"
    },
    {
      "id": "nm3788829",
      "name": "Devan Leos",
      "character": "Howie"
    },
    {
      "id": "nm2792358",
      "name": "Shayne Anderson",
      "character": "TSA Agent"
    },
    {
      "id": "nm0050327",
      "name": "Dean Balkwill",
      "character": "Attendant"
    },
    {
      "id": "nm2028052",
      "name": "Nelson Bonilla",
      "character": "Agent Mulligan"
    },
    {
      "id": "nm0107285",
      "name": "Frank Brennan",
      "character": "Jack Goldberg"
    },
    {
      "id": "nm0111975",
      "name": "Eric Brooks",
      "character": "Bellman"
    },
    {
      "id": "nm4587936",
      "name": "Daniel Brule",
      "character": "Bike Messenger"
    },
    {
      "id": "nm4962823",
      "name": "Jonny Clemson",
      "character": "Bellman #2"
    },
    {
      "id": "nm5115471",
      "name": "John Paul George",
      "character": "John Paul"
    },
    {
      "id": "nm1220793",
      "name": "Meg Gillentine",
      "character": "Flight Attendant"
    },
    {
      "id": "nm2576827",
      "name": "Jeff Joslin",
      "character": "Lucas"
    },
    {
      "id": "nm4219569",
      "name": "Andy Koehler",
      "character": "Pilot"
    },
    {
      "id": "nm1955688",
      "name": "Arin Logan",
      "character": "Bank Receptionist"
    },
    {
      "id": "nm1712612",
      "name": "Eaddy Mays",
      "character": "Agent Thomas"
    },
    {
      "id": "nm1018678",
      "name": "Shane Partlow",
      "character": "FBI Agent"
    },
    {
      "id": "nm3182620",
      "name": "Wanda Smith",
      "character": "Security Guard"
    },
    {
      "id": "nm5115673",
      "name": "Kathleen J. Bertrand",
      "character": "Choir"
    },
    {
      "id": "nm5116090",
      "name": "Colette L. Coward",
      "character": "Choir"
    },
    {
      "id": "nm4525590",
      "name": "Tiffany Davis",
      "character": "Choir"
    },
    {
      "id": "nm0962178",
      "name": "Darren Ellis",
      "character": "Choir"
    },
    {
      "id": "nm0313892",
      "name": "Alfreda Gerald",
      "character": "Choir"
    },
    {
      "id": "nm5116220",
      "name": "Betsy Christian Gerald-Randolph",
      "character": "Choir"
    },
    {
      "id": "nm5116021",
      "name": "Patricia Elaine Grigsby",
      "character": "Choir"
    },
    {
      "id": "nm5115346",
      "name": "Eric Bernard Jackson",
      "character": "Choir"
    },
    {
      "id": "nm0383645",
      "name": "Theresa Hightower",
      "character": "Choir"
    },
    {
      "id": "nm5116133",
      "name": "Sheneca Holmes",
      "character": "Choir"
    },
    {
      "id": "nm5116501",
      "name": "Kipper Jones",
      "character": "Choir"
    },
    {
      "id": "nm5115973",
      "name": "John Madgett",
      "character": "Choir"
    },
    {
      "id": "nm3735071",
      "name": "Latrice Pace",
      "character": "Choir"
    },
    {
      "id": "nm5116077",
      "name": "Penny Yvette Ray",
      "character": "Choir"
    },
    {
      "id": "nm5115788",
      "name": "Frederick Sawyers",
      "character": "Choir"
    },
    {
      "id": "nm3257019",
      "name": "Myra Walker",
      "character": "Choir"
    },
    {
      "id": "nm5114638",
      "name": "Erika Ware",
      "character": "Choir"
    },
    {
      "id": "nm5115735",
      "name": "Delrick O. White",
      "character": "Choir"
    }
  ],
  "overview": "A Wall Street investment banker who has been set up as the linchpin of his company's mob-backed Ponzi scheme is relocated with his family to Aunt Madea's southern home.",
  "storyline": "A Wall Street investment banker who has been set up as the linchpin of his company's mob-backed Ponzi scheme is relocated with his family to Aunt Madea's southern home.",
  "plot": "George Needleman, a nerdy, high level CFO in New York City, promises his son that he will take him to his Saturday afternoon baseball game after he gets back from the office. He gets to his office and arrives to a harrowing scene; his co-workers are shredding documents and are in a state of chaos. He sees his boss, Walter, who informs him that his company is a Ponzi scheme run by the mob. He is being accused of spearheading the scheme and laundering funds and has to enter his family into a witness protection program. The program relocates them to a refuge where no one will think to look for them: Madea and Joe's house in Georgia.\n\nMeanwhile, Jake - whose elderly, ailing father is a church pastor who has put him in charge of the church's mortgage fund - stages a robbery (which is unsuccessful). Jake, who has a criminal past but whose father trusts that he has turned over a new leaf, is trying to recover church funds that he has invested in Needleman's company without his father's knowledge or consent, only to lose the entire investment in the Ponzi scheme.\n\nThe Needlemans' first meeting with Madea and Joe is awkward and bodes poorly for how everyone will get along. However, over time, Madea helps Kate and Cindy relate better to each other and to other family members, while Joe and Kate help George become more confident, more in touch with his surroundings and people around him, and more effective in channeling his emotions. Barbara displays dual sensibilities about \"colored people\". On one hand, she mistakes Madea for a domestic named Sadie, treats \"Sadie\" imperiously, and threatens to get her fired. On the other hand, she recognizes Joe as a man she slept with years ago (and George's biological father), and relates to him seductively; she also enjoys Negro spirituals and repeatedly asks to be taken to the African American church down the street from Madea's house.\n\nPastor Nelson's sermon inspires George to recognize a pattern in his company's records that explains where 10% of the stolen funds have been stashed. After church, watching Whoopi Goldberg's Oda Mae Brown character in Ghost inspires George to involve Madea in a plan to redivert funds from the \"stashed\" accounts back to the charities whose investments were stolen in the Ponzi scheme. The plan requires George (who disguises himself as a Frenchman to avoid detection by the Malone mob \"family\"), Jake, and Madea (who assumes the identity of an upscale woman named Precious Jackson) to travel to New York City, and for \"Precious\" to meet with a bank manager to transfer funds from the laundered accounts to the legitimate charities. Madea successfully accomplishes her mission, although she improvises both an expansion of her assumed identity (by pretending to be the oldest Jackson sister) and of the accounts to which \"Precious's\" funds are transferred by having some money sent to her real bank account, unbeknownst to George and Jake.\n\nWhen George and Jake begin to share their plan with Brian (Perry), he cuts them off and advises them it's illegal. However, after they pull off the caper, Brian informs George that his cooperation with the authorities and his successful efforts to return the charities' funds have given Brian leverage to dismiss the charges against George. Kate points out to George that the situation has strengthened their relationship and their family, and that it is a blessing in disguise. Upon leaving Madea's house, Cindy and Howie ask if they can come back to visit but both Madea and Joe immediately decline (though Madea does so in a sweet demeanor).\n\nBefore returning to New York, the Needlemans visit Pastor Nelson's church one last time. The Pastor and Jake burn the mortgage papers and the entire congregation celebrates the mortgage's being paid off, and the Needlemans enjoy the Negro spirituals. Madea also enjoys the spiritual music from her front porch, celebrating her new wealth.",
  "synopsis": null
}