{
  "imdb_id": "tt2245003",
  "tmdb_id": "290762",
  "douban_id": null,
  "title": "Miss You Already (2015)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "112 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.7,
  "director": [
    {
      "id": "nm0362566",
      "name": "Catherine Hardwicke"
    }
  ],
  "writer": [
    {
      "id": "nm0052218",
      "name": "Morwenna Banks",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0000106",
      "name": "Drew Barrymore",
      "character": "Jess"
    },
    {
      "id": "nm1568411",
      "name": "Shola Adewusi",
      "character": "Midwife"
    },
    {
      "id": "nm0001057",
      "name": "Toni Collette",
      "character": "Milly"
    },
    {
      "id": "nm6841174",
      "name": "Grace Schneider",
      "character": "Jess (10 yrs)"
    },
    {
      "id": "nm1176400",
      "name": "Lucinda Raikes",
      "character": "Teacher"
    },
    {
      "id": "nm5663632",
      "name": "Eleanor Stagg",
      "character": "Milly (10 yrs)"
    },
    {
      "id": "nm6834708",
      "name": "Emily Trappen",
      "character": "Jess (13 yrs)"
    },
    {
      "id": "nm6143310",
      "name": "Lucy Morton",
      "character": "Milly (13 yrs)"
    },
    {
      "id": "nm0000302",
      "name": "Jacqueline Bisset",
      "character": "Miranda"
    },
    {
      "id": "nm5994128",
      "name": "Lukas Rolfe",
      "character": "Little Lord"
    },
    {
      "id": "nm3745225",
      "name": "Charlotte Hope",
      "character": "Teenage Jess"
    },
    {
      "id": "nm6807048",
      "name": "Sophie Holland",
      "character": "Teenage Milly"
    },
    {
      "id": "nm7914693",
      "name": "Fjokra",
      "character": "Lead Singer"
    },
    {
      "id": "nm7305537",
      "name": "Max Rinehart",
      "character": "Teenage Kit"
    },
    {
      "id": "nm1002641",
      "name": "Dominic Cooper",
      "character": "Kit"
    },
    {
      "id": "nm5458264",
      "name": "Sophie Brown",
      "character": "Scarlett (3 yrs)"
    },
    {
      "id": "nm0175916",
      "name": "Paddy Considine",
      "character": "Jago"
    },
    {
      "id": "nm4835867",
      "name": "Honor Kneafsey",
      "character": "Scarlett"
    },
    {
      "id": "nm6715097",
      "name": "Ryan Baker",
      "character": "Ben"
    },
    {
      "id": "nm0141324",
      "name": "Silas Carson",
      "character": "Dr. Butala"
    },
    {
      "id": "nm0561816",
      "name": "Seth Maxwell",
      "character": "Seth Maxwell"
    },
    {
      "id": "nm2165929",
      "name": "Anjli Mohindra",
      "character": "Kira"
    },
    {
      "id": "nm0010268",
      "name": "Janice Acquah",
      "character": "Nisha"
    },
    {
      "id": "nm0600809",
      "name": "Ben Moor",
      "character": "Nurse Sam"
    },
    {
      "id": "nm0403168",
      "name": "Noah Huntley",
      "character": "Company Exec"
    },
    {
      "id": "nm0209428",
      "name": "Frances de la Tour",
      "character": "Jill the Wigmaker"
    },
    {
      "id": "nm1930711",
      "name": "Tyson Ritter",
      "character": "Ace"
    },
    {
      "id": "nm2524912",
      "name": "Jamie Holt",
      "character": "Milly's Cousin"
    },
    {
      "id": "nm10988761",
      "name": "Colin Ailes",
      "character": "Milly's Cousin"
    },
    {
      "id": "nm1570873",
      "name": "Mem Ferda",
      "character": "Achmed"
    },
    {
      "id": "nm0203688",
      "name": "Eileen Davies",
      "character": "Ace's Nan"
    },
    {
      "id": "nm3217952",
      "name": "Waleed Akhtar",
      "character": "Porter"
    },
    {
      "id": "nm0219070",
      "name": "Tony Denham",
      "character": "Taxi Driver       (as Anthony Denham)"
    },
    {
      "id": "nm1794576",
      "name": "Donovan Blackwood",
      "character": "Roughneck"
    },
    {
      "id": "nm6217024",
      "name": "Kevin Fyfe",
      "character": "Roughneck"
    },
    {
      "id": "nm7914694",
      "name": "Seb Piper",
      "character": "Jess & Jago's Baby"
    }
  ],
  "overview": "The friendship between two life-long girlfriends is put to the test when one starts a family and the other falls ill.",
  "storyline": "Milly and Jess have been best friends forever. They've shared everything since they were kids - secrets, clothes, laughs, substances, boyfriends... now they are trying to be grown-ups. Milly has a high-flying job and lives in a beautiful townhouse with husband Kit and their two kids. Jess is a town planner and she and her boyfriend Jago live on a bohemian houseboat on a London canal. Their friendship is as rock solid as ever. That is until Jess struggles to have a much longed-for baby and Milly finds out she has breast cancer. How do you share that?",
  "plot": "Milly and Jess are best friends who met in grade school and do everything together. As they grow older, Milly settles down and marries her rocker boyfriend Kit while Jess becomes an environmentalist and marries her long-term partner Jago.\n\nMilly, busy with her career and her young family, learns that she has breast cancer after a long-delayed checkup. She finds herself unable to tell Kit and, after a week, finally confides in Jess. Once she tells Kit and children, Scarlett and Ben, Milly tasks Jess with helping her get through chemotherapy and the two women joke around as Milly receives her treatments. During this time period, Jess, who has been unable to conceive naturally, puts off IVF treatments with Jago, feeling that she cannot keep trying to have children while Milly is sick. After Jago grows exasperated, Jess finally decides to give it a shot and the couple manage to conceive a baby shortly after.\n\nThe night Jess learns that she is pregnant, Milly learns that though she has responded to the chemotherapy, she still needs a double mastectomy. She goes to a bar and gets drunk and, when Jess retrieves her, confesses that she has a big ego and does not want to appear unattractive. Jess reassures her that she will always want her in her life. Milly goes through with the double mastectomy but Jess finds herself unable to tell Milly she is pregnant as she feels as though her good news would cause Milly grief. Meanwhile, Jess learns Jago must go away to work on an oil-rig to pay for their IVF treatments.\n\nMilly finds herself growing increasingly distant from Kit after the surgery. After he arranges a surprise birthday dinner, Milly walks out, taking Jess with her and the two go all the way to Yorkshire ostensibly to see the moors where the Brontë sisters grew up, though, in reality, Milly is chasing down a bartender, Ace, that she had sex with post-surgery. When Jess discovers the deception, she and Milly fight and she reveals her pregnancy to Milly.\n\nFor a while, Milly and Jess are estranged. During this period, Jess learns that she is having a high-risk pregnancy while Milly learns that while her breast cancer is in remission she also has fatal malignant tumours in her brain. Milly tracks down Jess and the women reconcile. She also confesses her affair to Kit and although he feels betrayed, he decides to make love to Milly knowing that her days are numbered. Milly eventually tells her children that she will die and must go into hospice care. While there, she tells Jess she is holding on for the birth of Jess' first child.\n\nJess goes into labour early while Jago is still on the oil rig. While Kit does not want Milly to attend the labour, her mother, Miranda, for once teams up with her and sneaks her out of the hospice so she is able to be there when Jess gives birth. Some days after, Milly dies at the hospice with Jess by her side.\n\nEpilogue: A few years later, Jess is very pregnant again, this time started naturally, and the two families are shown being close and having lunch together. Jess muses on how her friend was irreplaceable, but then recognizes a trait of hers in Scarlett, Milly’s daughter.",
  "synopsis": null
}