{
  "imdb_id": "tt2290065",
  "tmdb_id": "126757",
  "douban_id": null,
  "title": "100 Bloody Acres (2012)",
  "genres": [
    "Comedy",
    "Horror"
  ],
  "country": "Australia",
  "version": [
    {
      "runtime": "91 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm1637876",
      "name": "Cameron Cairnes"
    },
    {
      "id": "nm1454108",
      "name": "Colin Cairnes"
    }
  ],
  "writer": [
    {
      "id": "nm1637876",
      "name": "Cameron Cairnes",
      "description": "written by"
    },
    {
      "id": "nm1454108",
      "name": "Colin Cairnes",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0380632",
      "name": "Damon Herriman",
      "character": "Reg Morgan"
    },
    {
      "id": "nm0760151",
      "name": "Angus Sampson",
      "character": "Lindsay Morgan"
    },
    {
      "id": "nm3593738",
      "name": "Anna McGahan",
      "character": "Sophie"
    },
    {
      "id": "nm1027672",
      "name": "Oliver Ackland",
      "character": "James"
    },
    {
      "id": "nm0471597",
      "name": "Jamie Kristian",
      "character": "Wes"
    },
    {
      "id": "nm0418877",
      "name": "John Jarratt",
      "character": "Sgt Burke"
    },
    {
      "id": "nm1622736",
      "name": "Chrissie Page",
      "character": "Nancy"
    },
    {
      "id": "nm5245729",
      "name": "Paul Blackwell",
      "character": "Charlie Wick"
    },
    {
      "id": "nm4940576",
      "name": "Ward Everaardt",
      "character": "Bernard St John"
    },
    {
      "id": "nm0380625",
      "name": "Iain Herridge",
      "character": "Roadie"
    }
  ],
  "overview": "Reg and Lindsay run an organic fertiliser business. They need a fresh supply of their \"secret ingredient\" to process through the meat grinder. Reg comes across two guys and a girl with a broken-down vehicle on their way to a music festival.",
  "storyline": "The use of dead car crash victims in the Morgan Brothers' \"Blood and Bone\" fertiliser has been a huge boon to business. But it's been months since their last find and an important new customer is waiting on a delivery. When Reg Morgan, the junior partner in the business, comes across three young people stranded on a remote country road, he sees a radical solution to their supply problems, and a way of finally gaining the respect of his bossy big brother, Lindsay. But things don't quite go to plan when Reg starts forming an attachment with one of their captives, Sophie. Reg must now make a decision: go through with the plan and finally win Lindsay's approval, or save the kids and destroy everything the brothers have worked for. They're not psycho killers... they're just small business operators.",
  "plot": "Reg and Lindsay Morgan own and operate a small blood and bone fertiliser business in country South Australia. While making local deliveries and the occasional roadkill pick up, Reg encounters the crash site of a van, the driver dead inside. Reg recovers the body from the crash and puts it in the back of his own truck. Making his way back to the brothers' plant, Reg is delayed again, this time by three tourists stuck on the side of the road: Sophie, a young woman; James, Sophie's boyfriend; and Wes, James' friend, with whom Sophie is having an affair. Reg takes an instant attraction to Sophie, and, against his better judgement, allows the three to ride with him.\n\nWes and James ride in the back of the truck with the hidden corpse, and Sophie rides up front with Reg. Sophie gets to know Reg, while James tells Wes that he plans to marry Sophie. The pair soon discover the corpse and fear for their lives. Sophie starts to find things in common with Reg, but Reg's anxiety gets the better of him. This unnerves Sophie, and, as soon as the truck arrives at the plant, Reg detains her. Lindsay arrives and demands to know what is going on. Reg suggests that they can grind the people into fertiliser, and Lindsay berates him for his lack of planning for such a bold crime. Ultimately, Lindsay agrees to Reg's idea, and it is revealed that the pair have ground humans in the past: in order to create a new formula for their fertiliser, the pair ground a group of charity volunteers who crashed and died in a nearby road accident.\n\nWes and James are soon detained with Sophie, and the trio watch as Reg and Lindsay grind the driver. At the last minute, Reg becomes convinced that the man is still alive and tries to save him, to no avail. When Wes cuts himself loose and escapes, Lindsay pursues him. Sophie takes advantage of the situation and attempts to seduce Reg, much to James' chagrin. Reg catches on to the ruse and exposes Sophie's infidelity with Wes, further angering James. Lindsay soon returns with Wes, accumulating the body of a local police officer along the way. Reg now begins to have serious second thoughts about the pair's actions. When Nancy, their elderly neighbour, surprises the brothers with a visit, Lindsay stuffs Reg in a car boot with Wes, cutting off Wes' hand in the process. Reg and Wes work together to escape, and Reg enters the house alone to confront his brother.\n\nReg overhears Lindsay tell Nancy that Reg has moved away, perhaps permanently. As Reg gathers his courage, Lindsay and Nancy begin to have sex. Severely disturbed, Reg decides instead to stealthily steal Lindsay's keys. As he is about to take them, Wes stumbles into the house, looking for his missing hand. In a fit of rage, Lindsay kills Wes and Nancy, and Reg flees with the keys. James and Sophie panic when they hear the gunshots, but Sophie decides to return to the farm when she hears Reg call out to her; James angrily breaks up with Sophie as she leaves. After a brief struggle, Lindsay overpowers and ties up Reg. As Lindsay prepares Reg for grinding, Sophie returns and distracts Lindsay. Reg is able to pull him in to the grinder, killing him; afterward, Sophie and Reg share a momentary attraction. In a post credits scene, James hysterically runs onto the road and is killed by a reckless driver.",
  "synopsis": null
}