{
  "imdb_id": "tt2261331",
  "tmdb_id": "246080",
  "douban_id": null,
  "title": "Black Sea (2014)",
  "genres": [
    "Adventure",
    "Drama",
    "Thriller"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "114 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm0531817",
      "name": "Kevin Macdonald"
    }
  ],
  "writer": [
    {
      "id": "nm2393111",
      "name": "Dennis Kelly",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0000179",
      "name": "Jude Law",
      "character": "Robinson"
    },
    {
      "id": "nm0203801",
      "name": "Karl Davies",
      "character": "Liam"
    },
    {
      "id": "nm0317275",
      "name": "Llewella Gideon",
      "character": "Job Centre Worker"
    },
    {
      "id": "nm2092886",
      "name": "Jodie Whittaker",
      "character": "Chrissy"
    },
    {
      "id": "nm5591800",
      "name": "Gus Barry",
      "character": "Martin (aged 12)"
    },
    {
      "id": "nm0450975",
      "name": "Konstantin Khabenskiy",
      "character": "Blackie"
    },
    {
      "id": "nm0752490",
      "name": "Daniel Ryan",
      "character": "Kurston"
    },
    {
      "id": "nm1058940",
      "name": "Scoot McNairy",
      "character": "Daniels"
    },
    {
      "id": "nm0580014",
      "name": "Tobias Menzies",
      "character": "Lewis"
    },
    {
      "id": "nm0806968",
      "name": "Michael Smiley",
      "character": "Reynolds"
    },
    {
      "id": "nm0861915",
      "name": "David Threlfall",
      "character": "Peters"
    },
    {
      "id": "nm0464038",
      "name": "Sergey Kolesnikov",
      "character": "Levchenko"
    },
    {
      "id": "nm1655234",
      "name": "Sergey Puskepalis",
      "character": "Zaytsev"
    },
    {
      "id": "nm0892188",
      "name": "Sergey Veksler",
      "character": "Baba"
    },
    {
      "id": "nm3732046",
      "name": "Grigoriy Dobrygin",
      "character": "Morozov"
    },
    {
      "id": "nm0578853",
      "name": "Ben Mendelsohn",
      "character": "Fraser"
    },
    {
      "id": "nm1024229",
      "name": "Branwell Donaghey",
      "character": "Gittens"
    },
    {
      "id": "nm4435667",
      "name": "Bobby Schofield",
      "character": "Tobin"
    },
    {
      "id": "nm1585733",
      "name": "Yuri Klimov",
      "character": "Ukranian Admiral"
    },
    {
      "id": "nm4879326",
      "name": "Zaak Conway",
      "character": "Martin (aged 4)"
    },
    {
      "id": "nm2393111",
      "name": "Dennis Kelly",
      "character": "Himself"
    },
    {
      "id": "nm0531817",
      "name": "Kevin Macdonald",
      "character": "Himself"
    },
    {
      "id": "nm0658390",
      "name": "Nick Palmer",
      "character": "Himself"
    },
    {
      "id": "nm0824395",
      "name": "Charles Steel",
      "character": "Himself"
    }
  ],
  "overview": "A suspenseful adventure thriller directed by Academy Award winner Kevin Macdonald, centering on a rogue submarine captain who pulls together a misfit crew to go after a sunken treasure rumored to be lost in the depths of the Black Sea. As greed and desperation take control onboard their claustrophobic vessel, the increasing uncertainty of the mission causes the men to turn on each other to fight for their own survival.",
  "storyline": "After a decade of hard work at a marine salvage company, the recently redundant submarine captain, Robinson, decides to risk everything in search of a fabled underwater treasure: a sunken Nazi U-boat laden with gold ingots of inestimable value. Bent on unearthing the unclaimed prize under the nose of the Russians and their hostile naval fleet, Robinson assembles a hand-picked mixed crew of antagonistic experts to comb the vast seabed of the cold Black Sea in a rusty Soviet submarine. However, as greed gets the best of the already divided team, the promise of an equal share rapidly starts to fade away. Can Robinson's men resurface in one piece, and, above all, rich?",
  "plot": "Robinson (Jude Law), a veteran captain of under-sea salvage who is recently divorced and estranged from his young son, receives news that he is to be made redundant. He receives £8,640 for his services and is asked to clean his desk and leave the premises.\n\nLater, while having a drink with some former colleagues, Robinson meets up with his friend Kurston and a Russian called Blackie (Konstantin Khabensky). Kurston informs the duo of an idea to make money. He tells them about a German Type VIIC[note 1] U-boat from World War II that sank off the coast of Georgia with a cargo of gold worth millions and how their former employer found the U-boat's location but was unable to salvage it due to the Russo-Georgian War. He also informs them both of a plan he has been working on to secretly recover the gold. After meeting with Kurston, Robinson agrees to meet with an unknown backer called Lewis.\n\nLewis agrees to fund Robinson's expedition on the grounds he receives a 40% split of the proceeds up to $40 million, a 20% cut on any amount above that, and that his executive Daniels (Scoot McNairy) accompany the expedition. Robinson agrees to the deal. Upon returning home Robinson finds a youth, Tobin, who notifies him of Kurston's suicide and indicates they were friends. Robinson takes the young man in and decides to bring him along on the expedition, and acquires a Foxtrot-class submarine from the Port of Sevastopol. The crew is 50% Russian and 50% British and almost immediately there are issues between the two groups. Only Blackie speaks Russian and English and the Russians view the young Tobin as a bad omen, mistakenly assuming he is a virgin when he is in fact an expecting father.\n\nDue to the close confines, tension begins to mount between the two crews. Robinson makes the decision to split the take equally between each crewman. Due to the mounting pressures the crew fall out and there is a fight leading to Fraser (Ben Mendelsohn) losing his head and stabbing and killing Blackie. In the ensuing scuffle a fire breaks out and the sub is damaged leading to an explosion which knocks Robinson unconscious and kills at least 2 men.\n\nRobinson wakes up 18 hours later to find tensions at breaking point. The Russians have taken over half of the ship with the British in the other half. The ship is also badly damaged and they have no means to speak with the Russians as Blackie was killed. The sub's drive shaft is damaged but they discover they are close to the old U-boat and may be able to transfer its drive shaft and save the ship. Tensions continue to mount but Robinson discovers Morozov (Grigoriy Dobrygin) speaks English.\n\nRobinson sends Tobin with Fraser and another diver to recover the drive-shaft and the gold. While making their way back, third diver (David Threlfall) perishes when his air hose gets cut. Through Morozov they manage to get the Russians to install the drive-shaft and get the sub moving again. At this stage Daniels admits to Robinson that his prior employer set them up such that they are being used to do the dangerous work, while the employer waits to seize the gold as soon as the submarine surfaces. Robinson then decides to remain submerged and travel to Turkey, to try to keep the gold and avoid arrest. Furthermore, he decides they will attempt a risky navigation through a narrow channel, against the wishes of the crew. Meanwhile Daniels persuades Fraser to murder Zaytsev thus forcing Robinson's hand, since there are no longer enough men to safely operate the sub. At this point a second fire and explosion sends the sub back to the seafloor, and the sub begins to take on water.\n\nFraser and the rest of the remaining crew try to repair the leaks but their efforts are futile. Before they can escape, a panicked Daniels locks the bulkhead behind him leaving 3 men to drown but traps himself in the next compartment with his snagged clothing. Morozov closes the final bulkhead, leaving Daniels to drown and protecting Robinson, Tobin, and himself in the torpedo section where Robinson has hidden three escape suits. Robinson evacuates Tobin and Morozov and explains to Tobin that he will follow in the third suit using an emergency lever. Both men surface whereupon Morozov informs the young Tobin that there was no emergency lever and that Robinson had chosen to sacrifice himself. Minutes later the third suit appears containing some of the gold and a picture of Robinson's family.",
  "synopsis": "Salvage submarine captain Robinson got sacked by his company. His fellow Kurston talks of a wreck of a lifetime, a downed Nazi sub in the Black Sea which was carrying blackmailed Soviet gold. They get a private backer and Robinson asks for a crew of twelve men, half Brits and half Russians. Robinson and Kurston make their list, reluctantly accepting their colorful attitudes. They get their ride, a rust heap of a sub, in Sevastopol and then get going, diving soon enough so to avoid detection from the Russian Black Sea fleet. The backer insist that his banker Daniels tag along the ride. Soon the crews attitudes become a clear ticking time bomb as the British psychopathic diver Fraser picks a fight with the Russians and accidentally kills Kurston, the only one apparent interpreter between them.The ensuing engine malfunction rocks the sub, knocking Robinsons head rendering him unconscious for eighteen hours. The two sides have the sub under a stand off, until Robinson braves the gap and speaks with the Russian cartographer Morozov, who all this time concealed his ability to speak English. Robinson wins the crew with a fragile truce, only because they are now downed near the target sub. With sonar down, the crew rely only on the Russian radioman Babas ability to measure distance from hearing the crews manual pings. Robinson then sends Fraser, Peters, and the newbie Tobin to go out to the target sub to reconnoiter. But the three instead hauls the whole four tons of gold back to their ship, with the throw back of having Peters fall down to his death to a ravine.The crew figure out that it needs exactly their number to run the sub, which means that even Daniels has to a part. Terrified by the prospect of death, Daniels reveal a dark truth that almost reignites the crews volatility. Robinson gains his crew again by saying that Kurston and Peters lives must be honored by going on with the quest and going home rich. But soon Robinsons decision to put the coward Daniels in the same place as Fraser is wrong, since Daniels succeeds in influencing Fraser to kill the Russian engine man Zaitsev. The engine goes south, water leaks in and quickly drowns the men, and only Robinson, Tobin and Morozov survives in the torpedo room. Robinson insist on them to go to the surface through the tubes with surfacing suits, as he operates the tube mechanisms. He then surfaces the last suit with some of the gold."
}