{
  "imdb_id": "tt2246376",
  "tmdb_id": "128210",
  "douban_id": null,
  "title": "Sleeper's Wake (2012)",
  "genres": [
    "Thriller"
  ],
  "country": "South Africa",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm0075261",
      "name": "Barry Berk"
    }
  ],
  "writer": [
    {
      "id": "nm0075261",
      "name": "Barry Berk",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0628552",
      "name": "Lionel Newton",
      "character": "John Wraith"
    },
    {
      "id": "nm1824509",
      "name": "Deon Lotz",
      "character": "Roelf Venter"
    },
    {
      "id": "nm2415533",
      "name": "Jay Anstey",
      "character": "Jackie Venter"
    },
    {
      "id": "nm3995281",
      "name": "Luke Tyler",
      "character": "Simon Venter"
    }
  ],
  "overview": "In a secluded cove on the South African coast, a middle-aged writer grieving the deaths of his wife and daughter is drawn into an affair with an alluring teenage girl who is grappling with demons of her own, in this gripping psychological thriller adapted from the award-winning novel by Alistair Morgan. (TIFF)",
  "storyline": "John Wraith, mid-40s, regains consciousness in hospital. His wife and daughter dead in a car accident because he fell asleep at the wheel. To find solace he retreats to a tiny remote coastal hamlet where he comes across a troubled teenage girl, Jackie, struggling to come to terms with the murder of her mother during a vicious robbery at their home. A dangerous physical attraction develops between them. Despite the threat of discovery, they consummate their relationship, with devastating consequences.",
  "plot": "In 1979, a giggling man with milky white eyes (credited as \"The Sleeper\") breaks into a bedroom in the Alpha Gamma Theta sorority house in the middle of the night, killing a resident with a hammer. Two years later, the sorority is organizing a party to welcome new pledges, an event that prompts the return of the Sleeper, who has been living on the campus in secret, spying on the Alpha Gamma Thetas, and threatening them over the phone.\n\nOn the day of the party, the Sleeper sneaks into the sorority, kills Cindy by bashing her face in with a hammer, and hides her body. By the next day, the girls find Cindy missing and so does Bobby. Later that night the Sleeper strikes again, ripping Rebecca's face off using the claw of his hammer in a gym's locker room. He then moves on to killing Amy, her suitor Derek, and an employee at a pool hall. As these homicides occur, Cindy's boyfriend Bobby goes to the police to report Cindy's disappearance, and he and Detective Drake learn that Rebecca and Amy have gone missing after the detective calls the sorority. Drake sends Bobby home, and goes to the sorority while the Sleeper kills Matt, a boy who had walked Alpha Gamma Theta pledge Stacy to her dormitory.\n\nStacy discovers she has been left a message by the Sleeper just before Drake calls to ask her if she has seen any of the missing co-eds. Drake advises Stacy to come to the Alpha Gamma Theta house (where they are setting up a phone tap) when she tells him about the message she had received. The Sleeper's calls are traced to an old storm cellar in Jacob's Hall, so Drake heads there. Two officers are left to watch the house, but the Sleeper manages to get inside, and kills everyone in the building (including Bobby when he drops by) besides Stacy. The Sleeper wounds Drake when he returns, chases Stacy through the campus, and to his lair, where Stacy stabs him.\n\nStacy is found by a patrolling officer, and taken to a hospital, where she is informed by a doctor that Drake is in the ICU, and the Sleeper was caught. As she tries to rest, Stacy is bothered but then answers a nearby ringing phone and screams when she realizes that the killer is on the line.",
  "synopsis": null
}