{
  "imdb_id": "tt2254010",
  "tmdb_id": "201076",
  "douban_id": null,
  "title": "Mirage Men (2013)",
  "genres": [
    "Documentary"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm1753003",
      "name": "John Lundberg"
    },
    {
      "id": "nm0219398",
      "name": "Roland Denning"
    },
    {
      "id": "nm1754834",
      "name": "Kypros Kyprianou"
    }
  ],
  "writer": [
    {
      "id": "nm5148805",
      "name": "Mark Pilkington",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3067335",
      "name": "Robert J. Durant",
      "character": "Himself - Former Airline Pilot       (as Bob Durant)"
    },
    {
      "id": "nm3288913",
      "name": "Richard Doty",
      "character": "Himself - Former Special Agent, AFOSI       (as Richard C. Doty)"
    },
    {
      "id": "nm0868124",
      "name": "Tracy Tormé",
      "character": "Himself - TV Producer"
    },
    {
      "id": "nm5547569",
      "name": "Peter Gersten",
      "character": "Himself - Attorney & UFO Activist"
    },
    {
      "id": "nm3831909",
      "name": "Walter Bosley",
      "character": "Himself - Former Special Agent, AFOSI"
    },
    {
      "id": "nm5627647",
      "name": "Paul Bennewitz",
      "character": "Himself - UFO Researcher       (archive footage)"
    },
    {
      "id": "nm1161508",
      "name": "Greg Bishop",
      "character": "Himself - Author, Project Beta"
    },
    {
      "id": "nm5623172",
      "name": "Ron Regehr",
      "character": "Himself - Retired Aerospace Engineer, Voyager Program"
    },
    {
      "id": "nm0883652",
      "name": "Gabe Valdez",
      "character": "Himself - Highway Patrolman, Dulce, New Mexico"
    },
    {
      "id": "nm3311216",
      "name": "Linda Moulton Howe",
      "character": "Herself - Investigative Journalist & Film Maker"
    },
    {
      "id": "nm2836389",
      "name": "Christopher Green",
      "character": "Himself - Former CIA Science Analyst"
    },
    {
      "id": "nm5148805",
      "name": "Mark Pilkington",
      "character": "Himself - Author, Mirage Men"
    },
    {
      "id": "nm2276736",
      "name": "Richard M. Dolan",
      "character": "Himself - UFO Historian       (as Richard Dolan)"
    },
    {
      "id": "nm1121400",
      "name": "William L. Moore",
      "character": "Himself - UFO Researcher       (archive footage)"
    },
    {
      "id": "nm5623131",
      "name": "George Hansen",
      "character": "Himself - Parapsychologist & Author"
    },
    {
      "id": "nm0256149",
      "name": "Robert Emenegger",
      "character": "Himself - Filmmaker, UFOs Past, Present and Future"
    },
    {
      "id": "nm3440970",
      "name": "Curtis Peebles",
      "character": "Himself - Aviation Historian"
    },
    {
      "id": "nm5623185",
      "name": "Victor Martinez",
      "character": "Himself - UFO Researcher"
    },
    {
      "id": "nm5623170",
      "name": "Stephen Broadbent",
      "character": "Himself - Computer Network Specialist"
    },
    {
      "id": "nm5398857",
      "name": "Bill Ryan",
      "character": "Himself - Management Training Consultant"
    },
    {
      "id": "nm3249160",
      "name": "James Carrion",
      "character": "Himself"
    }
  ],
  "overview": "UFOs: weapons of mass deception... For over 60 years teams within the US Air Force and Intelligence services exploited and manipulated beliefs about UFOs and ET visitations as part of their counterintelligence programmes. In doing so they spawned a mythology so powerful that it captivated and warped many brilliant minds, including several of their own. Now, for the first time, some of those behind these operations, and their victims, speak out, revealing a true story that is part Manchurian Candidate and part Close Encounters of the Third Kind.",
  "storyline": "How the US government created a myth that took over the world. ET visitors... crashed UFOs... back-engineered alien technology... the government cover-up of a secret that would change the world as we know it... These are the core elements of the modern UFO mythology, a story that has captivated farmers, princes and generals for generations, and shows no sign of loosening its grip on the popular imagination. But what if, instead of covering up the UFO story, elements in the US military had actively encouraged it as part of their Cold War counterintelligence arsenal - manufacturing the myth of the UFO as a powerful weapon of mass deception and the perfect cover for all manner of clandestine technologies and operations. Now, for the first time, some of those whose actions have directly shaped the UFO mythology, and some of their victims, tell their stories, revealing a surreal disturbing and sometimes tragic sequence of events that is part Manchurian Candidate and part Close Encounters ...",
  "plot": null,
  "synopsis": "How the US government created a myth that took over the world.ET visitors... crashed UFOs... back-engineered alien technology... the government cover-up of a secret that would change the world as we know it...These are the core elements of the modern UFO mythology, a story that has captivated farmers, princes and generals for generations, and shows no sign of loosening its grip on the popular imagination.But what if, instead of covering up the UFO story, elements in the US military had actively encouraged it as part of their Cold War counterintelligence arsenal - manufacturing the myth of the UFO as a powerful weapon of mass deception and the perfect cover for all manner of clandestine technologies and operations.Now, for the first time, some of those whose actions have directly shaped the UFO mythology, and some of their victims, tell their stories, revealing a surreal disturbing and sometimes tragic sequence of events that is part Manchurian Candidate and part Close Encounters of the Third Kind.Mirage Men draws viewers into a saucer-shaped hall of mirrors, a shadow-world where every lie contains elements of the truth, and the truth is far stranger than the UFO believers, or their detractors, would have you believe."
}