{
  "imdb_id": "tt2229908",
  "tmdb_id": "115604",
  "douban_id": null,
  "title": "Homophobia (2012)",
  "genres": [
    "Short",
    "Drama"
  ],
  "country": "Austria",
  "version": [
    {
      "runtime": "23 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.9,
  "director": [
    {
      "id": "nm3270014",
      "name": "Gregor Schmidinger"
    }
  ],
  "writer": [
    {
      "id": "nm3270014",
      "name": "Gregor Schmidinger",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm5123552",
      "name": "Michael Glantschnig",
      "character": "Michael"
    },
    {
      "id": "nm5122726",
      "name": "Josef Mohamed",
      "character": "Raphael"
    },
    {
      "id": "nm5122968",
      "name": "Günther Sturmlechner",
      "character": "Jürgen"
    },
    {
      "id": "nm5164324",
      "name": "Harald Bodingbauer",
      "character": "Commanding Officer"
    },
    {
      "id": "nm6374933",
      "name": "Matthias Buchegger",
      "character": ""
    },
    {
      "id": "nm6374932",
      "name": "Marc Dejenyitchi",
      "character": ""
    },
    {
      "id": "nm6374929",
      "name": "Marco Lehner",
      "character": ""
    },
    {
      "id": "nm6374930",
      "name": "Velizar Lytvynets",
      "character": ""
    },
    {
      "id": "nm6374931",
      "name": "Lukas Neumüller",
      "character": ""
    },
    {
      "id": "nm5816914",
      "name": "Harald Zenz",
      "character": ""
    }
  ],
  "overview": "An adolescent boy, who serves the military forces, experiences homosexual feelings towards one of his comrades. The suppressed conflict bubbles up during their last night at the border, socially isolated and armed with loaded weapons.",
  "storyline": "Michael, a soldier in the Austrian military, has been on border duty at the Austrian-Hungarian border for seven weeks now. Isolated from his family and friends and stuck in an uber-masculine environment, Michael develops homosexual feelings for his comrade Raphael. Being bullied is part of his daily routine. Jürgen, the alpha male in the group, has found the perfect victim in Michael. During taking a shower Jürgen bullies Michael once more but this time something is different, Michael bring about Jürgen's downfall both literally and figuratively. The game is on and Jürgen uses his most powerful weapon - his knowledge about Michael's secret. Jürgen punches Michael on the back of his head causing him an injury. Korcak, their group commander, suspects that there is more behind Michael's injury than he Michael is willing to tell but can't help him if he does not tell the truth. A couple of hours later, Michael and Raphael smoke a joint together at the border to celebrate their last night....",
  "plot": null,
  "synopsis": null
}