{
  "imdb_id": "tt2250564",
  "tmdb_id": "179246",
  "douban_id": null,
  "title": "In Bloom (2013)",
  "genres": [
    "Drama",
    "Romance",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "87 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.9,
  "director": [
    {
      "id": "nm3655059",
      "name": "Chris Michael Birkmeier"
    }
  ],
  "writer": [
    {
      "id": "nm3655059",
      "name": "Chris Michael Birkmeier",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm2705152",
      "name": "Kyle Wigent",
      "character": "Kurt"
    },
    {
      "id": "nm3716171",
      "name": "Tanner Rittenhouse",
      "character": "Paul"
    },
    {
      "id": "nm5144588",
      "name": "Adam Fane",
      "character": "Kevin"
    },
    {
      "id": "nm3884772",
      "name": "Jacob Andrews",
      "character": "Eddie       (as Jake Andrews)"
    },
    {
      "id": "nm5143225",
      "name": "Steve Casillas",
      "character": "Brad"
    },
    {
      "id": "nm3238101",
      "name": "Emma Blyth",
      "character": "Alison"
    },
    {
      "id": "nm5144078",
      "name": "Cooper Johnson",
      "character": "Jack"
    },
    {
      "id": "nm5143280",
      "name": "Vincent Degaetano",
      "character": "Justin"
    },
    {
      "id": "nm0287364",
      "name": "Robert Fortney",
      "character": "Serial Killer"
    },
    {
      "id": "nm2886559",
      "name": "Brandon Emerson",
      "character": "Brandon"
    },
    {
      "id": "nm3895411",
      "name": "Cooper Johnson",
      "character": "Jack"
    }
  ],
  "overview": "A gritty and heartbreaking portrayal of love and loss, In Bloom shows a personal and realistic tale of losing first love. During a tumultuous summer in Chicago, a serial killer terrorizes boystown while two young men experience the pain of separation and broken hearts.",
  "storyline": "Summertime hits Chicago, igniting celebrations, events, and new friendships that make memories for every young adult. For a young Boystown couple, however, these memories seem best forgotten. Kurt and Paul, two young Boystown locals, have been together for two years. Life is vibrant, tranquil and simple as Kurt makes a living dealing pot and Paul is employed at the local grocery store. At a party one night, Kurt and Paul's relationship begins to unknowingly unravel when Kurt meets Kevin, a dashing and exciting young man. Kurt initially resists Kevin's advances, but soon gives in as he starts dealing Kevin weed. Kurt is overrun with temptation and eventually becomes self-destructive as his lustful urges get the better of him. In a fit of impulse, Kurt breaks up with Paul, sending Paul into a downward cycle of emptiness and pain. Kurt drowns himself in a lifestyle of partying, drugs and promiscuous sex, hoping to find the \"spark\" he first felt when he fell in love with Paul, but he ...",
  "plot": "Eka and Natia are two fourteen year old best friends living in Tbilisi in 1992 after Zviad Gamsakhurdia was deposed of and during the Georgian Civil War. Natia is the more vivacious of the two girls, though she has a rough home life due to her alcoholic abusive father. Eka lives with her older sister and mother while her father is in prison.\n\nNatia has two boys who are interested in her, Kote, and Lado. Lado tells her that he is going to Moscow to visit his uncle but before he leaves he gifts her a gun with a single bullet. Natia is impressed with the gift, believing it is Lado's way of taking care of her. After witnessing Eka being bullied on her way home by two boys, Natia forces the gun on her and tells her to use it to intimidate the boys as violence is the only language they understand. However walking home Eka sees two boys beating up Kopla, the main boy that bullies her. Initially intending to ignore the situation she ends up pulling out the gun and successfully using it to threaten the boys beating up Kopla.\n\nStanding in line waiting for bread some time later, Natia is grabbed by Kote and pulled into a car with his friends. Though Eka tries to help her she is ultimately unsuccessful. She then turns on the adults in the line who have done nothing to stop Natia's kidnapping and swears at them until one of the men strikes her down.\n\nEka attends Natia's wedding, though she is unhappy for her friend. She gives the gun back to Natia without telling her about her interaction with Kopla.\n\nNatia's initial hesitant happiness in her marriage quickly dissolves. Visited by Eka she confesses to missing school and being disappointed at living with her husband's family, who are restrictive and don't want her to see her old friends. After they quash plans for a birthday party, Natia ends up sneaking out and spending the day with Eka at her grandmother's house, where she also sees Lado. She is caught by her husband, Kote, who jealously takes her away. Later he fathers up a group of his friends and attacks Lado, culminating in Lado being stabbed and killed.\n\nHearing of the murder Natia becomes incensed and goes to get the gun but Eka beats her to her house and keeps it from her long enough to calm her down and prevent her from going to kill Kote. The two end up going to a pond, where Eka throws the gun in the water.\n\nLater Eka, who has always refused to go and see her father, who is residing in jail, goes to see him by herself.",
  "synopsis": null
}