{
  "imdb_id": "tt2273349",
  "tmdb_id": "250084",
  "douban_id": null,
  "title": "Lake Noir (2013)",
  "genres": [
    "Drama",
    "Horror"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.3,
  "director": [
    {
      "id": "nm3550868",
      "name": "Jeffrey Schneider"
    }
  ],
  "writer": [
    {
      "id": "nm3507715",
      "name": "Abel Martinez Jr.",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm1943914",
      "name": "Mike G.",
      "character": "Cesar       (as Michael J. Gonzalez)"
    },
    {
      "id": "nm2179940",
      "name": "Geno Romo",
      "character": "Sean"
    },
    {
      "id": "nm3613254",
      "name": "Michelle Damis",
      "character": "Diane Hennly"
    },
    {
      "id": "nm3501643",
      "name": "Marzell Sampson",
      "character": "Gabe"
    },
    {
      "id": "nm1700833",
      "name": "Bob Olin",
      "character": "Ol Mr. Mcavoy"
    },
    {
      "id": "nm4912342",
      "name": "Varrel Crumlich",
      "character": "Noah"
    },
    {
      "id": "nm4927023",
      "name": "Jessica Fulks",
      "character": "Naomi"
    },
    {
      "id": "nm7013938",
      "name": "Nina Tomisca",
      "character": "Eva"
    },
    {
      "id": "nm2218656",
      "name": "Heather Wakehouse",
      "character": "Ashlynn Hennly"
    },
    {
      "id": "nm4927033",
      "name": "Cindy Millan",
      "character": "Sofie"
    },
    {
      "id": "nm3512613",
      "name": "Calvin Morie McCarthy",
      "character": "Joe"
    },
    {
      "id": "nm4927608",
      "name": "Phil Dupont",
      "character": "Aiden"
    },
    {
      "id": "nm2728860",
      "name": "Benjamin Farmer",
      "character": "Mark"
    },
    {
      "id": "nm2641028",
      "name": "Hai Ninh",
      "character": "Willy"
    },
    {
      "id": "nm5073492",
      "name": "Angela Valdez",
      "character": "Young Diane Hennly"
    },
    {
      "id": "nm4156883",
      "name": "I.W. Lewis",
      "character": "Crazy Hillbilly"
    },
    {
      "id": "nm3507715",
      "name": "Abel Martinez Jr.",
      "character": "Cashier"
    },
    {
      "id": "nm4930753",
      "name": "Shannon Rempel",
      "character": "Carol"
    },
    {
      "id": "nm4931395",
      "name": "Linda Nisley",
      "character": "Joan"
    }
  ],
  "overview": "A group of friends head off for a secluded getaway and encounter more than they bargained for. \"Nothing good happens at this lake, \" warns Ol' Mr. McAvoy to a group of unsuspecting campers looking forward to a sex and alcohol fueled romp at a secluded lake. Little do they know the lake's sordid past, horrible atrocities, and the resident of the lake who does not take kindly to visitors.",
  "storyline": "A group of friends head off for a secluded getaway and encounter more than they bargained for. 'Nothing good happens at this lake' warns Ol' Mr. McAvoy to a group of unsuspecting campers looking forward to a sex and alcohol fueled romp at a secluded lake. Little do they know the lake's sordid past, the lake's horrible atrocities and the resident of the lake who does not take kindly to visitors. 'Michael J Gonzalez' stars in this old school horror film loaded with sex, alcohol, and the occasional unexpected life ending experience that traditional horror lovers have come to know and love.",
  "plot": "The unnamed Driver works as a mechanic, a movie double, and a stunt driver, as well as a criminal-for-hire getaway driver. He is managed in all jobs by auto shop owner Shannon, who persuades Jewish mobsters Bernie Rose and Nino to purchase a car for the Driver to race. The Driver meets his new neighbor, Irene, and becomes close to her and her young son, Benicio. Irene's husband, Standard Gabriel, is in prison. After Standard is released, Irene still asks the Driver to visit them.\n\nStandard owes protection money from his time in prison and is beaten up by Albanian gangster Cook, who demands that Standard rob a pawnshop for $40,000 to pay off the debt. Cook gives Benicio a bullet as a symbol that he and his mother are in danger. The Driver, concerned for the safety of Irene and Benicio, offers to act as the getaway driver for the pawnshop robbery. While waiting for Standard and Cook's accomplice, Blanche, to complete the pawnshop robbery, the job goes awry when Standard is shot and killed by the pawnshop owner. The Driver and Blanche escape after an intense car chase with a mysterious adversary. The Driver hides with Blanche in a motel, where he learns that the bag contains a million dollars and that Blanche and Cook planned to re-steal the money with the car that chased them. Two of Cook's men ambush them in the motel room, killing Blanche before the Driver manages to kill them both.\n\nAt the auto shop, Shannon offers to hide the money, but the Driver refuses. He hunts down Cook in a strip club, smashes his fingers with a hammer, threatens to kill him, and force-feeds him the bullet that was given to Benicio. Cook reveals that Nino was behind the robbery. The Driver decides to return the money, but Nino dismisses the offer and instead sends a hitman to the Driver's apartment building. Entering the elevator with Irene, the Driver encounters the hitman and kisses Irene before brutally beating the hitman to death.\n\nAt his pizzeria, Nino reveals to Bernie that the money was stashed at the pawnshop by a low-level Philadelphia wise guy from the \"East Coast mob\" and, since anyone tied to the robbery could lead the East Coast Mafia to them, they need to kill everyone involved. Bernie warns Nino that nobody steals from the Italian Mob. Nino is angry because the Italian Mob has marginalized and insulted him due to his Jewish heritage. He convinces Bernie to follow his plan. Bernie then murders Cook, as he is the sole witness to their agreement. After Shannon refuses to divulge the whereabouts of the driver, Bernie kills him at the auto shop with a straight razor.\n\nThe Driver, disguising himself with a rubber mask from his stuntman job, follows Nino from the pizzeria to the Pacific Coast Highway and T-bones Nino's car onto a beach, then chases him from the wreck to the ocean and drowns him. He makes a phone call to Irene to tell her he is leaving and that meeting her and Benicio was the best thing that ever happened to him. The Driver goes to meet Bernie, who promises that Irene will be safe in exchange for the money. The Driver gives Bernie the money, but Bernie attempts to kill him, stabbing him in the stomach. The Driver survives and fatally stabs Bernie, then drives away, abandoning the money. Irene knocks at the Driver's apartment, but gets no response. The Driver drives away into the night.",
  "synopsis": null
}