{
  "imdb_id": "tt2265194",
  "tmdb_id": "139658",
  "douban_id": null,
  "title": "Jawan of Vellimala (2012)",
  "genres": [
    "Action",
    "Comedy",
    "Mystery"
  ],
  "country": "India",
  "version": [],
  "imdb_rating": 4.6,
  "director": [
    {
      "id": "nm3389763",
      "name": "Anoop Kannan"
    }
  ],
  "writer": [
    {
      "id": "nm2394022",
      "name": "James Albert",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0007123",
      "name": "Mammootty",
      "character": "Gopikrishnan"
    },
    {
      "id": "nm0820208",
      "name": "Sreenivasan",
      "character": "Varghese"
    },
    {
      "id": "nm3981484",
      "name": "Asif Ali",
      "character": "Koshi"
    },
    {
      "id": "nm1952830",
      "name": "Mamta Mohandas",
      "character": "Anitha"
    },
    {
      "id": "nm2055008",
      "name": "Baburaj",
      "character": "Chakko"
    },
    {
      "id": "nm5159909",
      "name": "Leona Lishoy",
      "character": "Jeni"
    },
    {
      "id": "nm4584689",
      "name": "Sunil Sukhada",
      "character": "Ittichan       (as Sunil Sugadha)"
    },
    {
      "id": "nm2848028",
      "name": "Amit",
      "character": "Narendran"
    },
    {
      "id": "nm1504987",
      "name": "Kottayam Nazeer",
      "character": "Raafi"
    },
    {
      "id": "nm5159854",
      "name": "Kalabhavan Niyas",
      "character": "Shibu"
    },
    {
      "id": "nm5852449",
      "name": "Joju George",
      "character": ""
    }
  ],
  "overview": "The story of Jawan of Vellimala revolves around a high-range village called Vellimala , a dam in this village and the people living there. The villagers of Vellimala consider the dam as a sign of their pride. Gopi Krishan (Mammootty), the central character, who took voluntary retirement from military service, reaches Vellimala as a labourer. Varghese is a government employee at the Dam site and Koshi Oommen, another character reaches there for some personal need. These three play the main three male characters in the film. Mamta Mohandas plays the role of a project officer at the Dam site and she also works for the development of the society. The story reveals the incidents happening when these characters and the villagers meet together.",
  "storyline": "Jawan Of Vellimala is a story about a dam situated in a poor village called 'Vellimala'.When the dam was decided to build the government comes against it. So the people of Vellimala starts a march for the same. A person dies in the march therefore, makes the government forced to build it. Now it is not safe anymore for the people nearby the government decides to destroy it. But the villagers consider the dam as their pride. Poor and Uneducated people of Vellimala had nothing to do against it. Gopikrishnan(Mammootty), who reaches Vellimala as a laborer has taken voluntary retirement from Indian military service. Gopi strikes against the people who became the reason for this and in the end eventually, dies.",
  "plot": null,
  "synopsis": null
}