{
  "imdb_id": "tt2224073",
  "tmdb_id": "159625",
  "douban_id": null,
  "title": "Best Friends Forever (2013)",
  "genres": [
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "113 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.2,
  "director": [
    {
      "id": "nm2647420",
      "name": "Brea Grant"
    }
  ],
  "writer": [
    {
      "id": "nm2647420",
      "name": "Brea Grant",
      "description": null
    },
    {
      "id": "nm3399858",
      "name": "Vera Miao",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2355036",
      "name": "Alex Berg",
      "character": "Alex 1"
    },
    {
      "id": "nm3800566",
      "name": "Leslie Chappell",
      "character": "Woman       (as Leslie Santa Cruz)"
    },
    {
      "id": "nm2788999",
      "name": "Jon Michael Davis",
      "character": "Man       (scenes deleted)"
    },
    {
      "id": "nm3075802",
      "name": "Stevin Espinoza",
      "character": "Mattias"
    },
    {
      "id": "nm2352792",
      "name": "Alex Fernie",
      "character": "Alex 2"
    },
    {
      "id": "nm2272765",
      "name": "Tom Fox Davies",
      "character": "Sebastian"
    },
    {
      "id": "nm2647420",
      "name": "Brea Grant",
      "character": "Harriet"
    },
    {
      "id": "nm3338909",
      "name": "Ben Hethcoat",
      "character": "Kyle"
    },
    {
      "id": "nm4567014",
      "name": "Riccardo LeBron",
      "character": "Austinite"
    },
    {
      "id": "nm0536883",
      "name": "Sean Maher",
      "character": "Sean"
    },
    {
      "id": "nm0552089",
      "name": "Christopher Jon Martin",
      "character": "The Sheriff"
    },
    {
      "id": "nm3399858",
      "name": "Vera Miao",
      "character": "Reba"
    },
    {
      "id": "nm5007707",
      "name": "Nora Nagatani",
      "character": "Woman"
    },
    {
      "id": "nm1412974",
      "name": "Glen Powell",
      "character": "Nick"
    },
    {
      "id": "nm4152758",
      "name": "Tamara Rey",
      "character": "Olivia       (as Tamara Camille)"
    },
    {
      "id": "nm5164032",
      "name": "Sean Riggs",
      "character": "Chris"
    },
    {
      "id": "nm1475015",
      "name": "Mylinda Royer",
      "character": "Lesly"
    },
    {
      "id": "nm1477515",
      "name": "Stacey Storey",
      "character": "Amanda"
    },
    {
      "id": "nm2739681",
      "name": "Grace Yang Vitali",
      "character": "Reba's Mom       (as Grace Yang)"
    },
    {
      "id": "nm2639311",
      "name": "Kit Williamson",
      "character": "Kit"
    },
    {
      "id": "nm2090422",
      "name": "Constance Wu",
      "character": "Melanie"
    }
  ],
  "overview": "Harriet, a comic book artist with a secret, and her reckless BFF, Reba, take their '76 AMC Pacer on the open road and instead get a wild ride towards an impending nuclear apocalypse.",
  "storyline": "BEST FRIENDS FOREVER is a clever dark comedy and sci-fi horror movie, combining equal parts heartfelt road trip buddy film and apocalyptic disaster story, with two badass girls. Harriet, a perpetually optimistic comic-book artist, dreams of escaping her past in Los Angeles and hits the road for a new life in Austin, Texas. She drags Reba her seemingly devil-may-care BFF, along for the ride. After nuclear bombs explode in four cities, the girls are forced to ask: When faced with the end of the world - what is most important to you?",
  "plot": "This article may contain an excessive amount of intricate detail that may only interest a specific audience. Please help by spinning off or relocating any relevant information, and removing excessive detail that may be against Wikipedia's inclusion policy. (June 2013) (Learn how and when to remove this template message)\nThis section does not cite any sources. Please help improve this section by adding citations to reliable sources. Unsourced material may be challenged and removed. (June 2013) (Learn how and when to remove this template message)\nEla receives a delivery at Sanju's house. She is shocked to see the clutch she had lost on the night of Varun's disappearance in the delivery box. She finds a message in the clutch and shows it to Vinnie. They suspect Daljeet behind the blackmail. Ela screams on seeing Varun in the mock court again.Ela runs out of the mock trial room on seeing Varun there. She believes that he is alive. Vinnie tells her that it might be a ghost, and reminds her about Varun's death. The scene begins when Varun jumps off the mountain on Valentine's night. Vinnie and Ela go in search of him. Varun hangs onto Ela's clutch to climb up the mountain, but they fail to save him. Daljeet talks to someone about his ploy against the girls.\n\nIn class, Sanju, Ela and Vinnie panic when Professor Anu claims that someone provoked Varun to commit suicide. Ela suspects a connection between Professor Anu and Varun, but Sanju disregards her suspicion. Varun and his sister, Professor Anu, discuss their ploy against the best friends for not saving Varun from the cliff and planting false evidence to mislead the police. Sanju and Ela become scared when there is a power cut at home. Vinnie and the boys surprise them with a party at Sanju's house. Varun sneaks into the washroom and scares Ela. Varun approaches Ela in the dark and confronts her for pushing him off the cliff. Ela and Vinnie argue. Ela receives a taunting message from Varun when everyone plays truth or dare, threatening to reveal the truth to Sanju, if she does not confess how she had cheated in the exams. Sanju becomes upset on learning that Ela had topped the exams by switching the answer papers with hers. She tells Vinnie that she can never trust Ela again. She denies forgiving her. Professor Rigved expels Ela for cheating. Varun calls Ela. Vinnie attends the call. He uses voice changing software to speak to her. He tells Vinnie that he has kept evidence of their crime in Sanju's locker. Ela and Vinnie worry that Sanju will go to the police if he sees the proof. Vinnie goes to the locker room to get the evidence before Sanju sees it. Prithvi tells Sanju that she is the center that holds their group together. He persuades her to join the gang in the canteen. They, understanding Sanju's situation and cares for her. Sanju asks them not to affect their friendship with Ela because of what happened. On the other hand, Vinnie and Ela panic on seeing sketches of them, standing on the cliff on Valentine's night, in the envelope. Varun blackmails them and gives them 2 hours to get Rs 10 lakh. Ela and Vinnie meet mystery guy who is Varun at some isolated place. And he records their confession of his murder by tricking them when they came.\n\nAnd Varun asks for more money and asks them to meet him at the same cliff. Vinnie stole money from her mom's locker. He tried to kill them in the cliff when Sanjana came by searching for Ela and Vinnie. She has seen their video message in which they confessed everything to her. Sanju defended her best friends and said to Varun that he is still the bad guy. If he wants to kill them he should kill her first. Varun hesitated and said he never wanted to kill them just wanted Ela and Vinnie to know that how it feels to come near death. And he walks away from there. The BFF's are happy and headed back to Sanju's home. Now Varun is back in Westwood. Ela and Vinnie are planning Sanju's surprise birthday party. Sanju realises that she is in love with Prithvi. All of Sanju's friends as well as her small brother Sunny also ignore Sanju. They choose Prithvi for bringing Sanju to the party. Varun knows that the BFFs are planning something for Sanju's birthday. Varun calls Sanju and ask her to come with her for a dinner and celebrate her birthday. Sanju tells Varun that if he comes to her house she will call the police and as she cuts the call somebody rings the bell of her house. Sanju thinks it to be Varun and takes a jug full of water and opens the door. She, not seeing the person, pours out whole of the water on that person who is Prithvi. Prithvi comes inside the house and Sanju asked for her shirt to get it iron. Prithvi asked Sanju to come with him for a pizza. Sanju goes to her room and gets ready to go prithvi takes her to a place which is dark. Sanju being afraid was going to leave the place but was stopped by the surprising entry of her friends. Somebody is now stalking Sanju and trying to hurt Prithvi. In the meantime Vinnie's mother finds a boy to get Vinnie engaged. Vinnie's mother tells the name of the boy that is Purushashtra. As Vinnie does not want to get engaged, Ela has a plan to let that boy go. They invites that boy in a cafe where Ela pretends to be Vinnie and that Vinnie is an independent girl who had got many boyfriends. But Puru identifies the real Vineeta Maheshwari. He tells them that he is also too fast with internet. And tells the real name every of her friends. The trustees of the Westwood college arranged a party of holi for the students. The stalker comes in the party and applies colour to Sanju. Prithvi follows the stalker and cuts his hand but the stalker runs away. Prithvi leaves on the day of the holi party. Mac also finally breaks up with Ela on the same day and starts to avoid Ela. A series of events make Sanju believe that Varun is the stalker, but he denies so. In the meantime, Varun and Sanju stand in the election for the president of Westwood College of Law. At the evening of that day, Vinnie comes to drop Sanju at her house and finds that someone is hiding in the bushes. When they come near the bush, the man tries to run away but is finally caught by them. When the man shows his face, it is Rohan. Sanju thinks the real stalker to be Rohan. Sanju and Varun make their own teams with three or four persons who will help them in sticking poster in full college and help them to make their speech and definitely give vote to the leader whom they are helping. Sanju comes to know that Puru loves Vinnie and so Sanju makes a plan that she will tell Vinnie that Puru loves a girl named Chhaya and asks Vinnie to set their love story. After fitting all the posters in the college the leave for their hom. Next day when they come to the college they see that the stalker has written a love message on Sanju's posters. Sanju suspects that the thing was done by Rohan and tries to find him but he is nowhere. In the evening while Sanju was going to leave for her house after her work in college, Ela and Vinnie were waiting for Sanju in the canteen. As she is trying to leave she finds that someone is following her. Afraid, Sanju tries to run but falls in the corridor. Hearing her screams Vinnie and Ela come running and finds Sanju lying in the corridor. They tried to follow the stalker who falls and gets hurt on his back. In spite of getting hurt, he rides on the bike and ran away. Scared BFFs go to the police for help. The police on their said facts arrest Rohan and finds that he has got hurt on his back. On the next day the Inspector calls Sanju as Varun came for the bail of Rohan. Varun tells them the time that Sanju told the police about Rohan was following her on that particular time Rohan was with Varun. On the same day the BFFs follow Rohan and find him going to a place where illegal bike racing is being done. When Sanju asks him why he was following Sanju he tells that Prithvi has told him to watch her and that he loves Sanju very much. He tells them that Varun knew that Rohan was involved in illegal bike racing so he released Rohan from the jail. Sanju asked him if Prithvi suspected Varun. Rohan answers that Prithvi had, but afterward Prithvi changed his suspect from Varun to somebody else. When Sanju asked who that guy is, a car come in a great pace and hit Rohan. The BFFs take him to the hospital and call all of their friends and parents of Rohan. After Rohan's operation all his friends except sanju and varun went to their home. They waited till rohan's parents did not came. In the night the stalker did come and warned rohan about telling anything to sanju. In the morning sanju finds many lost things of her lying on the bench of the girl's locker room.When she was looking at the photos somebody clicked her photos and pinned that photos on the notice board.professor anu calls her a cheater. Ela get a sms revealing the truth that sanju has told mac to behave like that with ela and knowing this truth ela breaks her friendship with sanju.Ela and vinnie tries to find rgv and sanju found that rgv's laptop is lying on the table of a classroom. Sanju tries to make the laptop work but when she comes closer to the laptop the voting for the president of the college automatically starts and when she turns back she finds professor anu. Professor rickved called everyone to the assembly hall for voting. After voting sanju and sahil went to have coffee in the canteen. Meanwhile, rohan calls sanju and asks her to come to a place if she wants to know who is the stalker. Rohan waits for sanju in that place and at the same time a car arrived . Rohan thought that car to be sanjus and tries to reach her but he finds that it is the stalker. The stalker is revealed as sahil and sahil kills rohan. When sanju reaches the place she finds rohan hanged and a suicite note that wal left by sahil. Varun is helping police in investigation. Meanwhile, Anu comes to know that Sahil is the stalker and starts blackmailing him. While checking Rohan's diary someone hits Sanjana on head and drags her to the garden. Vinnie and Puru find her unconscious and take her home. Rohan's dead body goes on missing from the morgue. The next day police arrests Sanjana for stealing Rohan's body. Sanjana's father bail her out. Ela realises her mistake and befriends with Sanjana. The same night Vinnie's car has some problems, when she opens the dikki, finds Rohans body which was dumped by Sahil on instructions of Anu to prove that Vinnie was also involve in Rohan's murder along with Sanju. Police trace Vinnie's car, Ela and Mac find out that Puru too is missing. professor rigved shows sanju,ela and others a video where a girl dressed up like vinne drags rohan's body and places it in a car's dickey and vinnie becomes a crime suspect but varun and sanju prove vinne innocent showing the entire college puru and vinnie's marriage video .pammy admits that someone gave her the wig and the dress and said her to give the audition .later it is revealed that vinnie finding rohan's body in her dickey faints but puru finds her and they flee and according to varun's instruction they handover rohan's body to his parents.sanju recollects and realizes that rohan's autopsy report is with her within her books .they decide to inform the police and ela,pammy and vinnie r sent to the shooting area to inspect the place where they find a baseball bat with varun's name written on it .though vinnie and ela starts pondering over it but pammy says varun is being framed and they should stand by him .In the mean time they find someone eavesdropping and its none other than the stalker who once again escapes .varun gets a call from megha and to his utter dismay prithvi is in the last stage of his cancer.When varun breaks this news to pammy anu listens to it and anu hears it and texts sanju saying varun to playing a game with her concealing information from &lt;;prithvi dying out of cancer&gt; ..only to have sanju .sanju is extremely guilty for distrusting prithvi.She goes homes with ela and vinnie but then tell them to leave her alone and then mak and varun found the person who took pammi's auditions but when they interrogate them they realised that he is not the stalker .sanju's father comes across sahil in her bedroom.sanju's friends get a diary from the stalker which ela keeps.sanju gets a letter from prithvi confessing his love to sanju.prithvi has to say that sanju should forgive varun as he is trying to rectify his mistakes. Sanju and Varun patch up&#160;! seeing sanju hug varun anu orders her to get out of the class.she gets out of the class followed by varun. They plan that they will go for a dinner that night. but sanju goes for a drive with sahil when he ardently requests. Sahil insists Sanju on driving further and they reach a place beautifully decorated where sahil proposes to sanjana . Mak and Ela are tensed as they didn't find Sanju in her room who was supposed to come home. mak finds a chewngum from sanju's room and a very identical one from the stalkers diary and realises that Sahil is the stalker .In the second place Puru and vinne finds sahil's laptop in the car which had hit rohan and varun discoves the stalker's hood in sahil's locker. Sanju realizes that sahil is the stalker when she switch on's her phone as Ela messages her regarding her security. Sanju becomes confused and rushed out of that place, on the road she finds Varun and Pammi .Sanju goes with them. BFF's hatch a plan to trap Sahil. Sanjana calls Sahil and tells him that she also love him and tells him to meet her in college. Sanjana's backside is shown (who is actually Pammy). She asks him why did he kill Rohan, he tells her and she disagrees to go with him. Varun comes in the scene. A fight takes place between them Sahil shoots Varun twice, Varun falls down. Sanjana comes with a recorder as everything is recorded. Everyonme at thee co scene along with police, Sahil is arrested. While leaving he calls blackmailer as Anu's phone rings he blames her. But everyone ignores him considering him a psycho. Now next step of BFF's is to find female blackmailer. Sanajan meets Sahil in hospital, as he is about to reveal Anu's truth. Anu comes in the costume of a nurse and forces Sanjana to get out of that room . She injects sahil with poison and Sahil gets paralysed. Varun finds Rohan's bag and the poison in Anu's room. He comes to know that Anu is blackmailer. He sends message to all three girls through Pammy. Next day everyone dominates Anu that she has killed Rohan and poisoned Sahil. Frustrated Anu tells in front of everyone that she dumped Rohans body in Vinnie's car. Sanjana records her self-confession . She is arrested. The show takes leap of 2 weeks (exams are over). Varun, Mac, Puru cook food for the girls. Puru proposes Vinnie for the marriage. Mac and Ela promise to spend their life together. Sanju tells Varun that she is leaving for United States Of America and stay with Prithvi for his treatment and she also tells that Pammy loves him very much. Varun reconsidered his plan and said he might patch up with Pammy. Someone is still keeping watch on them.",
  "synopsis": null
}