{
  "imdb_id": "tt2297352",
  "tmdb_id": "63357",
  "douban_id": null,
  "title": "Eyes Wide Open (2009)",
  "genres": null,
  "country": "Norway",
  "version": [
    {
      "runtime": "46 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.5,
  "director": [
    {
      "id": "nm5859920",
      "name": "Filip Christensen"
    }
  ],
  "writer": null,
  "cast": null,
  "overview": "The modern movement in skiing is progressing more than ever, and it is hard to keep up with the stream. Field Productions has gathered skiers with all different backgrounds, but they all share the same vision about skiing. Yes, skiing is about taking risks to invent new tricks and styles, but most importantly to have fun. ”Eyes Wide Open dvd” gives you both. The movie includes top notch skiing in deep powder, big mountains, city streets and terrain parks featuring many of the most talented athletes out there. Look out for many unseen rail combos by Tom Wallisch and Even Sigstad, bottomless powder at Mica Heli with Åsmund Thorsen and Eric Hjorleifson, epic park heli shoots on the most beatiful places in Norway, JT Holmes and Eirk Finseth charging Lake Tahoe, Norwegian invasion in Montafon Austria, Jon Olsson shows why he is the best park kickers, and much more. Some parts of the movie is filmed with the RED One camera, which gives ski movies a whole new meaning.",
  "storyline": "\"Eyes Wide Open Documentary.\" The documentary gives you a deeper insight of the 2009 season, as well as the athletes' thoughts and explanations of each aspect in skiing.",
  "plot": "Aaron (Zohar Strauss), a married Orthodox Jewish father of four living in Jerusalem, takes over his family’s butcher shop after the recent death of his father. Ezri (Ran Danker), a nineteen-year-old homeless Yeshiva student, visits the shop to use the telephone. After turning down Ezri's offer to help around the shop, he later finds Ezri asleep in the local synagogue and offers him space to stay at the shop. Aaron takes Ezri on as an apprentice and encourages his religious studies and his talent for drawing.\n\nThe two men become close after Ezri invites Aaron to take a ritual bath in the outskirts of the city. Rivka, Aaron’s devoted wife, initially welcomes her husband’s apprentice into their family circle. One evening after Aaron asks Ezri to draw his portrait, Ezri makes a sexual advance, which Aaron rebuffs. Later, however they kiss and begin a sexual relationship. Rivka becomes suspicious when her husband begins to arrive late at home. Rabbi Vaisben, a family friend, warns Aaron against associating too closely with Ezri, reporting that he was expelled from his local yeshiva, but Aaron defends him. Rivka, increasingly concerned, sees them leaving the shop together late at night. Being a devout religious man, living in Mea Shearim, a Haredi community, Aaron is torn between his family and devotion to God, and the intense feelings he has for Ezri .\n\nAaron is repeatedly told that Ezri is a bad influence and perhaps even cursed; local people start warning Ezri to stay away from them. Flyers begin to circulate in the neighborhood, prompting many to boycott the butcher's shop. Under increasing social, commercial and family pressure, Aaron tries to break off ties with Ezri but is unable to bring himself to do so. Confronted by Rabbi Vaisben, Aaron is unabashed, feeling alive only now. Ezri encounters his former lover on the streets of their neighborhood, which escalates into Ezri being attacked by some locals. Aaron witnesses the attack but does not intervene. He consoles Ezri afterwards, but they both realize it is time for Ezri to leave the community. Aaron continues to be distressed by this, asking for Rivka's understanding and protection. He returns early one morning to the spot where he took a bath with Ezri. He submerges himself beneath the water for a prolonged period before the camera fades to black.",
  "synopsis": null
}