{
  "imdb_id": "tt2202086",
  "tmdb_id": "328402",
  "douban_id": null,
  "title": "Ab Tak Chhappan 2 (2015)",
  "genres": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "106 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm1209849",
      "name": "Ejaz Gulab"
    }
  ],
  "writer": [
    {
      "id": "nm3406353",
      "name": "Nilesh Girkar",
      "description": "story, screenplay and dialogue"
    }
  ],
  "cast": [
    {
      "id": "nm0007113",
      "name": "Nana Patekar",
      "character": "Inspector Sadhu Agashe"
    },
    {
      "id": "nm0012881",
      "name": "Mohan Agashe",
      "character": "Retired Police Commissioner Pradhan"
    },
    {
      "id": "nm1493836",
      "name": "Gul Panag",
      "character": "Shalu"
    },
    {
      "id": "nm0709359",
      "name": "Ashutosh Rana",
      "character": "Suryakant Thorat"
    },
    {
      "id": "nm0958861",
      "name": "Raj Zutshi",
      "character": "Rawle       (as Rajendranath Zutshi)"
    },
    {
      "id": "nm0620636",
      "name": "Govind Namdeo",
      "character": "Commissioner Bhandare"
    },
    {
      "id": "nm0324845",
      "name": "Vikram Gokhale",
      "character": "Janardan Jagirdar"
    },
    {
      "id": "nm0066063",
      "name": "Bobby Bedi",
      "character": "Mustaq"
    },
    {
      "id": "nm2818543",
      "name": "Jagat Rawat",
      "character": "Home Minister's P.A"
    },
    {
      "id": "nm3989074",
      "name": "Aniruddh Harip",
      "character": "Ghorpade"
    },
    {
      "id": "nm7186451",
      "name": "Tanmay Jahagirdar",
      "character": "Aman"
    },
    {
      "id": "nm2234698",
      "name": "Pradeep Kabra",
      "character": "Postman"
    },
    {
      "id": "nm6026594",
      "name": "Yatin Kadam",
      "character": "Jagdale"
    },
    {
      "id": "nm1375482",
      "name": "Jahangir Khan",
      "character": "Rauf"
    },
    {
      "id": "nm1242068",
      "name": "Dilip Prabhavalkar",
      "character": "Anna Saheb"
    },
    {
      "id": "nm7186453",
      "name": "Sarita Shirole",
      "character": "Shrin Begum"
    },
    {
      "id": "nm7186452",
      "name": "Mushtaq Ajay Singh",
      "character": "Krishna"
    }
  ],
  "overview": "Home Minister Janardhan Jagirdarand chief Minister Anna Saheb are much concerned over the criminal activities of underworld dons Rawal and Rauf Lala. Rawal is operating from Bangkok while Rauf supervises his gang from Mumbai. The famous Encounter Squad is activated to counter the gangsters and restore peace in the area. The formidable Sadhu Agashe (Nana Patekar) is requested to take charge of the peace-keeping mission. At first he is reluctant but after continuous insistence, he agrees to launch a counter attack against Rawal and Lala Rauf gangs and the action begins.",
  "storyline": "Home Minister Janardhan Jagirdarand chief Minister Anna Saheb are much concerned over the criminal activities of underworld dons Rawal and Rauf Lala. Rawal is operating from Bangkok while Rauf supervises his gang from Mumbai. The famous Encounter Squad is activated to counter the gangsters and restore peace in the area. The formidable Sadhu Agashe (Nana Patekar) is requested to take charge of the peace-keeping mission. At first he is reluctant but after continuous insistence, he agrees to launch a counter attack against Rawal and Lala Rauf gangs and the action begins.",
  "plot": "Ab Tak Chhappan 2 opens to encounter specialist Sadhu Agashe (Nana Patekar) proclaiming what he did was right. The film then goes into flashback, where we are shown what happened a few months back. Away from Mumbai, with a few cases pending against him, Sadhu now leads a peaceful life in his village (Goa) with his son Aman, mourning the loss of his wife. He cooks, lives in a house by the river and listens to his son playing the piano. However, his retired phase comes to a halt, when ex-police commissioner (Mohan Agashe) convinces Sadhu to get back on the job on the home minister's (Vikram Gokhale) request to tackle Mumbai's escalating crime scene.\n\nSadhu is hesitant but his son talks him into accepting the offer, which brings him back to Mumbai. While Sadhu's encounter squad is happy to see him, Thorat (Ashutosh Rana), Sadhu's junior is not too pleased with the decision as he hopes to become the chief. Sadhu senses the rivalry and makes it clear to Thorat that he will have to follow orders.\n\nThe squad begins their mission by reconnecting with their sources and targeting gangsters of two gangs (Rauf and Rawale). Meanwhile crime reporter Shalu Dixit (Gul Panag) becomes a regular visitor at Sadhu's residence, since she wants to finish the book on 'encounter cops', which her journalist father couldn't complete, since he was shot by a gangster.\n\nAs the encounter squad goes on a shooting spree, Sadhu starts getting threats from unknown parties. Soon, Sadhu's son is targeted by the gangsters and is killed. Rawale informs Sadhu that Rauf has done it. Sadhu nabs Rauf. He initially denies being the culprit but later accepts it. However, he also warns Sadhu that Rawale has been assigned the job of killing the righteous CM (Dilip Prabhawalkar) by someone, whom Sadhu trusts a lot. Before Rauf could give away the name, he gets shot by Thorat. The latter says he was ordered to do so. It is soon announced that Rawale would be returning to Mumbai and may join politics soon. Both Sadhu and Shalu suspects that the home minister is involved in the CM's assassination and was the one who took Rawale's help to plot the murder.\n\nSadhu confronts the home minister and the later admits it, saying his political career wouldn't have taken off in the presence of the CM, who didn't favour him and his devious activities. He also dares Sadhu to expose him, having a firm opinion that no one would believe Sadhu.\n\nSadhu decides to give up but Shalu tells him that she has found evidence against the home minister, a video proof of his meeting with Rawale but before she could pick up the CD, she gets shot by Thorat, who is now revealed to be Jagirdar's Henchman. Sadhu arrives at nick of time and shoots Thorat dead before he can kill Shalu.\n\nSadhu goes to an event, where the home minister is to pay tribute to the late CM. Sadhu steps on stage, requests he be given an opportunity to speak. After appreciating the Home Minister, he quickly moves towards him and stabs a sharp pen into his shoulder, thus killing him.\n\nThe film continues at present time, and it is revealed that Aman is alive. His death was merely faked to eliminate the underworld. Commissioner Pradhan leaves after interrogating Sadhu, and promises him that he will take care of Aman. An epilogue is shown where we are told that Sadhu was given life imprisonment for also killing Rawale in same jail where both were imprisoned together.",
  "synopsis": null
}