{
  "imdb_id": "tt2252304",
  "tmdb_id": "197010",
  "douban_id": null,
  "title": "Butter on the Latch (2013)",
  "genres": [
    "Drama",
    "Fantasy",
    "Horror"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "72 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm2528451",
      "name": "Josephine Decker"
    }
  ],
  "writer": [
    {
      "id": "nm2528451",
      "name": "Josephine Decker",
      "description": "story"
    }
  ],
  "cast": [
    {
      "id": "nm4019418",
      "name": "Isolde Chae-Lawrence",
      "character": "Isolde"
    },
    {
      "id": "nm3217913",
      "name": "Emily Decker",
      "character": "Sarah's Sister       (voice)"
    },
    {
      "id": "nm3861569",
      "name": "Stephan Goldbach",
      "character": "Guy"
    },
    {
      "id": "nm2166833",
      "name": "Charlie Hewson",
      "character": "Steph"
    },
    {
      "id": "nm3339906",
      "name": "Sarah Small",
      "character": "Sarah"
    },
    {
      "id": "nm3919455",
      "name": "Yury Yakor",
      "character": "Guy"
    }
  ],
  "overview": "Sarah and Isolde share an interest in the traditional music and dance of the Balkans, but it turns out that shared interests don’t always unite them. Their trip, initially a fun bonding experience, takes a southward turn when Sarah becomes interested in handsome fellow camper Steph. A seemingly innocent romantic overture touches off an abrupt shift in the dynamic between the two girlfriends, steering a previously ecstatic camp outing down a psychological rabbit hole.",
  "storyline": "At a Balkan folk song and dance camp in the woods of Mendocino, California, Sarah reunites with her old friend Isolde and with a song she learned years before about dragons who entwine themselves in women's hair and carry them off through the forest, burning it as they go. When Sarah pursues a romance with a new camper Steph, the nights of sensual secrets and singing with Isolde come to an abrupt end. Sarah and Steph explore a simple attraction, but in Sarah's dreams, women spin their wild hair and Isolde darkly approaches. When reality and fantasy collide, Sarah finds that the dragons she's visioning may be inside her.",
  "plot": null,
  "synopsis": null
}