{
  "imdb_id": "tt2232578",
  "tmdb_id": "215946",
  "douban_id": null,
  "title": "Canopy (2013)",
  "genres": [
    "Adventure",
    "Drama",
    "Thriller",
    "War"
  ],
  "country": "Australia",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.9,
  "director": [
    {
      "id": "nm1462005",
      "name": "Aaron Wilson"
    }
  ],
  "writer": [
    {
      "id": "nm1462005",
      "name": "Aaron Wilson",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm1899390",
      "name": "Khan Chittenden",
      "character": "Jim"
    },
    {
      "id": "nm0594910",
      "name": "Morning Tzu-Yi Mo",
      "character": "Seng"
    },
    {
      "id": "nm0580005",
      "name": "Robert Menzies",
      "character": "Older Jim"
    },
    {
      "id": "nm1929934",
      "name": "Edwina Wren",
      "character": "Wife"
    }
  ],
  "overview": "An unlikely friendship between 2 young men becomes everything, when an Australian soldier takes refuge under the canopied jungles of Singapore, during the violent Japanese invasion in World War II. Jim is lost, injured and defenseless in a hostile, tropical world, hunted by Japanese troops, Seng, a Singapore-Chinese resistance fighter emerges from the jungle and the two young men find themselves thrown together hoping to survive.",
  "storyline": "Wartime, 1942. Singapore. An Australian fighter pilot shot down in combat awakens suspended in the treetops. As night devours day, he must navigate through dangerous jungle in search of sanctuary. Transcending language and culture, CANOPY is a cinematic tour de force exploring the collision of war, nature and its impact on humanity.",
  "plot": null,
  "synopsis": "An unlikely friendship between 2 young men becomes everything, when Jim, an Australian soldier, is lost, injured and takes refuge under the canopied jungles of Singapore, during the violent Japanese invasion in World War II. Seng, a Singapore-Chinese resistance fighter emerges from the jungle and the two young men find themselves thrown together hoping to survive."
}