{
  "imdb_id": "tt2294589",
  "tmdb_id": "99262",
  "douban_id": null,
  "title": "The Fifth Commandment (2011)",
  "genres": [
    "Thriller"
  ],
  "country": "Mexico",
  "version": [
    {
      "runtime": "93 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.4,
  "director": [
    {
      "id": "nm1618155",
      "name": "Rafa Lara"
    }
  ],
  "writer": [
    {
      "id": "nm1618155",
      "name": "Rafa Lara",
      "description": "as Rafael Lara"
    }
  ],
  "cast": [
    {
      "id": "nm1178120",
      "name": "Ilean Almaguer",
      "character": ""
    },
    {
      "id": "nm0032793",
      "name": "Angélica Aragón",
      "character": ""
    },
    {
      "id": "nm0331243",
      "name": "Tomás Goros",
      "character": ""
    },
    {
      "id": "nm1226341",
      "name": "Alberto Guerra",
      "character": ""
    },
    {
      "id": "nm0346031",
      "name": "Jimena Guerra",
      "character": ""
    },
    {
      "id": "nm0350884",
      "name": "Ernesto Gómez Cruz",
      "character": ""
    },
    {
      "id": "nm0412495",
      "name": "Guillermo Iván",
      "character": ""
    },
    {
      "id": "nm4943948",
      "name": "Carlos Padilla",
      "character": ""
    },
    {
      "id": "nm0866895",
      "name": "Alejandro Tommasi",
      "character": ""
    },
    {
      "id": "nm0869827",
      "name": "Luis Felipe Tovar",
      "character": ""
    }
  ],
  "overview": "Víctor, a psychopath, loves carving crosses onto women post-mortem, blames paedophile priest and mother-in-denial for his behaviour, falls in love with one of his intended victims and decides to give up his adopted lifestyle. An alcoholic detective (he’s mourning his sister’s passing), eventually tracks down Víctor, and manages to break his habit with the bottle.",
  "storyline": "In Mexico City, the police department finds the eleventh victim of the serial-killer known as The Cross Killer. The efficient but alcoholic Detective Garcia is assigned by the Public Prosecutor to hunt down the serial-killer and the coroner disclose his profile, telling that he is a rapist, misogynist, sadistic and necrophilic killer that carves a cross on the back of teenagers. The disturbed street artist Victor that is The Cross Killer discloses to a victim that when he was twelve years old, in his hometown San Jose del Monte, his pious mother caught him masturbating and delivered him to the Priest Jose. The pedophile priest raped him, showing the darkness with the successive abuses and Victor has been listening to demons since then. When Victor meets the teenager Gabriela, he falls in love with her and believes that she is an angel. But he has never respected The Fifth Commandment and Gabriela is convinced by Victor to go with him to the place where he lives to see a painting.",
  "plot": null,
  "synopsis": null
}