{
  "imdb_id": "tt2295196",
  "tmdb_id": "204810",
  "douban_id": null,
  "title": "Hunting Elephants (2013)",
  "genres": [
    "Comedy",
    "Crime",
    "Drama"
  ],
  "country": "Israel",
  "version": [
    {
      "runtime": "107 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm1137030",
      "name": "Reshef Levi"
    }
  ],
  "writer": [
    {
      "id": "nm1137030",
      "name": "Reshef Levi",
      "description": "written by"
    },
    {
      "id": "nm1680383",
      "name": "Regev Levy",
      "description": "written by as Regev Levi"
    }
  ],
  "cast": [
    {
      "id": "nm0299924",
      "name": "Sasson Gabai",
      "character": "Eliyahu"
    },
    {
      "id": "nm0608701",
      "name": "Moni Moshonov",
      "character": "Nick"
    },
    {
      "id": "nm0001772",
      "name": "Patrick Stewart",
      "character": "Lord Michael Simpson"
    },
    {
      "id": "nm5217490",
      "name": "Gil Blank",
      "character": "Yonatan"
    },
    {
      "id": "nm0008404",
      "name": "Yaël Abecassis",
      "character": "Dorit"
    },
    {
      "id": "nm0412405",
      "name": "Moshe Ivgy",
      "character": "Deddy"
    },
    {
      "id": "nm0352620",
      "name": "Zvika Hadar",
      "character": "Daniel"
    },
    {
      "id": "nm1577510",
      "name": "Rotem Zissman-Cohen",
      "character": "Sigi       (as Rotem Zussman-Cohen)"
    },
    {
      "id": "nm5222380",
      "name": "Meirav Koperberg",
      "character": "Simona"
    },
    {
      "id": "nm0206667",
      "name": "Tikva Dayan",
      "character": "Parents' home manager       (as Tiki Dayan)"
    },
    {
      "id": "nm0670785",
      "name": "Alexander Peleg",
      "character": "Lesman       (as Alex Peleg)"
    },
    {
      "id": "nm5221692",
      "name": "Maria Belkin",
      "character": ""
    },
    {
      "id": "nm0196710",
      "name": "Ezra Dagan",
      "character": ""
    },
    {
      "id": "nm5223510",
      "name": "Rot Frhaci",
      "character": ""
    },
    {
      "id": "nm4682603",
      "name": "Adam Gabay",
      "character": "Yoval"
    },
    {
      "id": "nm5221697",
      "name": "Moshe Igvy",
      "character": "Deddy"
    },
    {
      "id": "nm0410853",
      "name": "Galia Ishai",
      "character": "(as Galia Isay)"
    },
    {
      "id": "nm5221764",
      "name": "Ann Malgin",
      "character": "Noa"
    },
    {
      "id": "nm5223539",
      "name": "Tamir Matok",
      "character": "Oneg"
    },
    {
      "id": "nm1343374",
      "name": "Eyal Rozales",
      "character": "Chief Danino"
    },
    {
      "id": "nm1137889",
      "name": "Simon Rozenfeld",
      "character": "(as Simon Rosenfeld)"
    },
    {
      "id": "nm0788120",
      "name": "Shoshana Shani-Lavie",
      "character": "(as Susana Levy)"
    },
    {
      "id": "nm0790951",
      "name": "Ofer Shelah",
      "character": "Himself"
    },
    {
      "id": "nm0794456",
      "name": "Tzvi Shissel",
      "character": "Ezra"
    },
    {
      "id": "nm5222851",
      "name": "Rena Sinfeld",
      "character": ""
    },
    {
      "id": "nm1753888",
      "name": "Herzl Tobey",
      "character": "Debt Collector"
    },
    {
      "id": "nm4920895",
      "name": "Neveh Tzur",
      "character": "Ely       (as Neve Zor)"
    },
    {
      "id": "nm6250496",
      "name": "Oran Zegman",
      "character": "Neighbor"
    }
  ],
  "overview": "In this hilarious crime comedy, a gifted 12-year-old boy and three elderly men plan a bank robbery in order to seek revenge on the institution for cheating the youngster after the death of his father.",
  "storyline": "Three elderly men and grandson Yonatan find themselves stuck together in a Jerusalem nursing home. The kid is a genius, but stammers and is bullied at school. Yonatan's grandfather, Eliahu, whom he had never met, is a former member of the Lehi (pre-State Jewish underground), and a cold person. Eliahu's best friend from Lehi, Nick, is full of ambition and passion that will never materialize; and Eliahu's English brother-in-law, a has-been, third-rate actor in debt for two hundred thirty-two thousand euros. There's one thing keeping them together, they all want to rob the bank that employed Yonatan's deceased father to avenge it for not paying the Yonatan's mother compensation for his dad's death, due to the \"small print\" in his employment contract, and they want the money to make their last wish come true.",
  "plot": "Jonathan's father, Daniel (Tzvika Hadar), dies of a heart attack in his workplace, with Jonathan present but unable to help him. The bank manager, Dedi (Moshe Ivgy), refuses to pay compensation because the contract with the insurance company doesn't cover such events. Jonathan's mother, Dorit (Yael Abecassis), starts going out with Dedi because she needs the money, leaving Jonathan in an elderly home with his grandfather Eliyahu (Sasson Gabai).\n\nEliyahu and his friend Nick (Moni Moshonov) are former Lehi fighters who used to rob British banks to fund the organization's activities. Eliyahu had been at odds with Daniel and Dorit for many years, and hated Dorit for not performing an abortion and, in his opinion, ruining Daniel's life and burying his career. Eliyahu's wife Roda (Rina Schenfeld) is in a coma in their elderly home, with no chance of recovery. She was the daughter of a British lord and inherited his estate in Israel, while her brother Michael Simpson (Patrick Stewart), broke because he chose to be a theater actor to the chagrin of their father, seeks to take Roda off life support and get the estate. The estate had in fact already been sold by Eliyahu to pay for Roda's lengthy hospitalization and a home for himself and Nick.\n\nTo solve their financial problems, Jonathan, Michael, Eliyahu and Nick plan to rob the bank where Daniel worked, being intimately familiar with the bank's defense systems. They stage a number of diversions which causes the bank to turn off one of the main alarm systems, allowing them to enter the safe. The first plan goes awry when Nick, who was supposed to be a hostage himself, takes a guard's gun and his own hostages, but he is not sent to prison because of his dementia. Eliyahu then robs the bank himself, and Jonathan, pretending to be a victim, burns some of the money in front of the police, allowing him to get away with most of the stolen cash.",
  "synopsis": "The film opens with several old geezers getting their mug shots taken. It turns out that three of them robbed a bank, along with the grandson (Gil Blank as Yonatan) of one of them. While gifted, Yonatan is bullied at school. After getting suspended when the bullies force him to cheat on a test, his distraught mother takes him to the bank where his father (Tzvika Hadar as Daniel) is starting his night shift as an (overworked) security guard.During the shift, father and son quarrel and Daniel exhibits heart attack symptoms. Already collapsed, he instructs Yonatan to bring him his medication from his car. On the way to where the car is parked, Yonatan loses the car keys and is delayed. He does retrieve the pills, but upon entering the bank, as the alarm system is live because Daniel had been demonstrating it to Yonatan, a cage closes, trapping Yonatan and separating him from his father. Untreated, Daniel dies.When Yonatan's mother (Yael Abecassis as Dorit) approaches slimeball bank manager Dedi (Moshe Ivgy) for compensation, Dedi explains to her that because Daniel was not alone at the time of his demise, he's not eligible for any compensation: It's in the fine print. As she's compelled to work afternoon and evening shifts and not wanting to leave Yonatan alone, she begs her estranged father-in-law (Sasson Gabai as Eliahu) to look after Yonatan in the nursing home where he lives with his wife, Rhoda, who's in a coma, and his buddy from the Jewish pre-state underground days, Nick (Moni Moshonov). Meanwhile, desperate Dorit has begun sleeping with Dedi in exchange for much-needed money.Gradually Yonatan becomes buddies with Eliahu and Nick, and they are joined by Rhoda's estranged English brother, Lord Michael Simpson (Patrick Stewart), a washed-up, debt-ridden, third-rate actor. Together, Eliahu, Nick, Yonatan, and Michael hatch a plot to rob the bank to avenge Daniel's death and Dedi's debasing Dorit. Eliahu and Nick have experience robbing banks, as they robbed British banks during the Mandate period, when Lord Michael was their arch enemy. The heist is finally executed, albeit with many twists and turns and a surprise happy ending."
}