{
  "imdb_id": "tt2258337",
  "tmdb_id": "148265",
  "douban_id": "11499033",
  "title": "Eega (2012)",
  "genres": [
    "Action",
    "Comedy",
    "Fantasy"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "145 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm1442514",
      "name": "S.S. Rajamouli"
    },
    {
      "id": "nm2375084",
      "name": "J.V.V. Sathyanarayana"
    }
  ],
  "writer": [
    {
      "id": "nm4034632",
      "name": "S.S. Kanchi",
      "description": "story treatment"
    },
    {
      "id": "nm2132230",
      "name": "Janardhan Maharshi",
      "description": "dialogue"
    },
    {
      "id": "nm1190372",
      "name": "Crazy Mohan",
      "description": "dialogue"
    },
    {
      "id": "nm2353436",
      "name": "Vijayendra Prasad",
      "description": "ideas of"
    },
    {
      "id": "nm1442514",
      "name": "S.S. Rajamouli",
      "description": "story & screenplay"
    },
    {
      "id": "nm1442514",
      "name": "S.S. Rajamouli",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm1679372",
      "name": "Sudeep",
      "character": "Sudeep"
    },
    {
      "id": "nm3761004",
      "name": "Nani",
      "character": "Nani"
    },
    {
      "id": "nm3606487",
      "name": "Samantha Ruth Prabhu",
      "character": "Bindhu"
    },
    {
      "id": "nm2334720",
      "name": "Hamsa Nandini",
      "character": "Kala"
    },
    {
      "id": "nm1190372",
      "name": "Crazy Mohan",
      "character": "Doctor"
    },
    {
      "id": "nm1962272",
      "name": "Santhanam",
      "character": "Govindhan - Drunk Robber"
    },
    {
      "id": "nm2178111",
      "name": "Adithya Menon",
      "character": "Sudeep's Assistant"
    },
    {
      "id": "nm6252873",
      "name": "Chandra Sekhar",
      "character": "Tantra"
    },
    {
      "id": "nm2210188",
      "name": "Srinivasa Reddy",
      "character": "Sudeep's Assistant (Telugu version)"
    },
    {
      "id": "nm6252874",
      "name": "Sivannarayana",
      "character": ""
    },
    {
      "id": "nm2011414",
      "name": "Devadarshini Chetan",
      "character": "Bindhu's sister-in-law       (as Devadarshini)"
    },
    {
      "id": "nm6252875",
      "name": "Noel",
      "character": "Nani's friend"
    },
    {
      "id": "nm3648279",
      "name": "Dhanraj",
      "character": ""
    },
    {
      "id": "nm5159260",
      "name": "Thagubothu Ramesh",
      "character": "Drunk Robber"
    },
    {
      "id": "nm6252872",
      "name": "Venkatesh Chakravarthy",
      "character": ""
    },
    {
      "id": "nm2541032",
      "name": "Micky Makhija",
      "character": "Businessman"
    },
    {
      "id": "nm7697392",
      "name": "Noel Sean",
      "character": ""
    }
  ],
  "overview": "Sudeep is a high profile industrialist who gets whatever he wants and he has a special eye for beautiful women. To get them, he will not hesitate to do anything. That desire gets triggered when Sudeep sees Bindu, a micro artist who runs a non-profit organization. However, Bindu is loved by Nani who keeps following her everywhere. Though Bindu loves him, she doesn't express it to him and enjoys the attention. The story takes a turn when Sudeep discovers the feelings of Bindu for Nani and is unable to digest his defeat. He kills Nani. But Nani is born again as 'Eega'(fly) and he wants to take vengeance on Sudeep.",
  "storyline": "Sudeep is a high profile industrialist who gets whatever he wants and he has a special eye for beautiful women. To get them, he will not hesitate to do anything. That desire gets triggered when Sudeep sees Bindu, a micro artist who runs a non-profit organization. However, Bindu is loved by Nani who keeps following her everywhere. Though Bindu loves him, she doesn't express it to him and enjoys the attention. The story takes a turn when Sudeep discovers the feelings of Bindu for Nani and is unable to digest his defeat. He kills Nani. But Nani is born again as 'Eega'(fly) and he wants to take vengeance on Sudeep.",
  "plot": "A young girl who is unable to sleep asks her father to tell her a bedtime story. Although reluctant at first, he tells her a story of a fly named Nani.\n\nNani is a young man who specialises in preparing fireworks. He is in love with his neighbour Bindu, a micro artist who runs Project 511, a non-governmental organisation (NGO). Bindu also develops feelings for Nani though she does not express them. Seeking to raise money for her NGO, Bindu visits the office of a rich, powerful industrialist named Sudeep, who also finds her attractive. He befriends her, donates ₹1.5 million, and gains her trust. Sudeep sees Nani as a rival and plans to kill him. One night, Nani helps Bindu to finish a piece of micro art—a locket made from a pencil. While returning home, he is kidnapped by Sudeep, who kills him, making his death look like an accident. Unaware of the incident, Bindu proposes to the dying Nani by telephone; it is the last thing Nani hears before he is reincarnated as a housefly that cannot remember its previous life.\n\nThe fly's memory is triggered when it encounters Sudeep and Bindu. Sudeep asks the heartbroken Bindu to accompany him to New Delhi to meet the education minister; if she can impress the minister with a presentation about the NGO, he might help it gain national recognition. The fly causes Sudeep to have an accident on his way to the airport and writes \"I will kill you\" on the windshield; this makes Sudeep paranoid. The fly, who sees Bindu mourning Nani's death in her bedroom, reveals itself to be Nani by writing on the desk with her tears. It conveys the circumstances of Nani's death to Bindu, and they join forces against Sudeep. The latter's obsession with the fly affects his professional and personal life. In a chain of events, his money is burnt to ashes, leaving him almost penniless.[c]\n\nSudeep learns from a sorcerer that Nani is reincarnated as a fly and seeks revenge. Sudeep arranges to kill Nani but the fly escapes and causes a short circuit, killing the sorcerer and leaving Sudeep unconscious. Nani and Bindu assume Sudeep is dead but he is saved by his business partner. Sudeep is enraged when he learns that Bindu is helping the fly. Sudeep kills his partner to collect a ₹7&#160;billion insurance policy.\n\nSudeep takes Bindu to his home and Nani follows them. Nani seriously injures Sudeep with a needle. The latter clips Nani's wing and fatally stabs him with the same needle. Nani jumps through the flame of a burning match then into a loaded cannon, which fires. The projectile passes through Sudeep and hits an oxygen cylinder, which explodes and kills him. Bindu takes the fly's wing and makes an amulet with it. One day when travelling to work, an eve teaser bothers her; Nani, again reborn as a fly, attacks him with a needle before announcing his return.\n\nThe young girl is impressed with the story of the fly her father narrates.",
  "synopsis": "A young girl who is unable to sleep asks her father to tell her a bedtime story. Although reluctant at first, he tells her a story of a fly named Nani.Nani is a young man who specializes in preparing fireworks. He is in love with his neighbor Bindu, a micro artist who runs Project 511, a non-governmental organization (NGO). Bindu also develops feelings for Nani though she does not express them. Seeking to raise money for her NGO, Bindu visits the office of a rich, powerful industrialist named Sudeep, who also finds her attractive. He befriends her, donates 1.5 million rupees (US$23.03 thousand), and gains her trust. Sudeep sees Nani as a rival and plans to kill him. One night, Nani helps Bindu to finish a piece of micro art-a locket made from a pencil. While returning home, he is kidnapped by Sudeep, who kills him, making his death look like an accident. Unaware of the incident, Bindu proposes to the dying Nani by telephone; it is the last thing Nani hears before he is reincarnated as a housefly that cannot remember its previous life.The fly's memory is triggered when it encounters Sudeep and Bindu. Sudeep asks the heartbroken Bindu to accompany him to New Delhi to meet the education minister; if she can impress the minister with a presentation about the NGO, he might help it gain national recognition. The fly causes Sudeep to have an accident on his way to the airport and writes \"I will kill you\" on the windshield; this makes Sudeep paranoid. The fly, who sees Bindu mourning Nani's death in her bedroom, reveals itself to be Nani by writing on the desk with her tears. It conveys the circumstances of Nani's death to Bindu, and they join forces against Sudeep. The latter's obsession with the fly affects his professional and personal life. In a chain of events, his money is burnt to ashes, leaving him almost penniless.Sudeep learns from a sorcerer that Nani is reincarnated as a fly and seeks revenge. Sudeep arranges to kill Nani but the fly escapes and causes a short circuit, killing the sorcerer and leaving Sudeep unconscious. Nani and Bindu assume Sudeep is dead but he is saved by his business partner. Sudeep is enraged when he learns that Bindu is helping the fly. Sudeep kills his partner to collect 7 billion rupees (US$107.49 million) insurance policy.Sudeep takes Bindu to his home and Nani follows them. Nani seriously injures Sudeep with a needle. The latter clips Nani's wing and fatally stabs him with the same needle. Nani jumps through the flame of a burning match then into a loaded cannon, which fires. The projectile passes through Sudeep and hits an oxygen cylinder, which explodes and kills him. Bindu takes the fly's wing and makes an amulet with it. One day when travelling to work, an eve teaser bothers her; Nani, again reborn as a fly, attacks him with a needle before announcing his return.The young girl is impressed with the story of the fly her father narrates."
}