{
  "imdb_id": "tt2224313",
  "tmdb_id": "224471",
  "douban_id": null,
  "title": "Listen... Amaya (2013)",
  "genres": [
    "Drama"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "108 min",
      "description": "director's cut"
    }
  ],
  "imdb_rating": 6.9,
  "director": [
    {
      "id": "nm4735289",
      "name": "Avinash Kumar Singh"
    }
  ],
  "writer": [
    {
      "id": "nm3420541",
      "name": "Vikas Chandra",
      "description": "additional dialogue"
    },
    {
      "id": "nm4735289",
      "name": "Avinash Kumar Singh",
      "description": "dialogue"
    },
    {
      "id": "nm4735289",
      "name": "Avinash Kumar Singh",
      "description": "writer"
    },
    {
      "id": "nm4886849",
      "name": "Geeta Singh",
      "description": "dialogue"
    },
    {
      "id": "nm4886849",
      "name": "Geeta Singh",
      "description": "story and screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0787582",
      "name": "Farooq Shaikh",
      "character": "Jayant"
    },
    {
      "id": "nm0622732",
      "name": "Deepti Naval",
      "character": "Leela"
    },
    {
      "id": "nm3283923",
      "name": "Swara Bhaskar",
      "character": "Amaya"
    },
    {
      "id": "nm0023839",
      "name": "Amala Akkineni",
      "character": "Sujata"
    },
    {
      "id": "nm3222367",
      "name": "Siddhant Karnick",
      "character": "Raghav"
    },
    {
      "id": "nm1923461",
      "name": "Oroon Das",
      "character": "Abhay"
    },
    {
      "id": "nm4268295",
      "name": "Kriti Panth",
      "character": "Devika"
    },
    {
      "id": "nm4405714",
      "name": "Vidya Bhushan",
      "character": "Rizwaan bhai"
    },
    {
      "id": "nm4894667",
      "name": "Viren Basoya",
      "character": "Rahmat"
    },
    {
      "id": "nm5385596",
      "name": "Asrita",
      "character": "Jayant's maid"
    },
    {
      "id": "nm4941604",
      "name": "Mehma Bawa",
      "character": "College student in cafe"
    },
    {
      "id": "nm4894683",
      "name": "Aaliya Chibba",
      "character": "Lost girl in the marketplace"
    },
    {
      "id": "nm5385271",
      "name": "Dipika",
      "character": "Shreya"
    },
    {
      "id": "nm4886487",
      "name": "Tarini Gupta",
      "character": "Aditi"
    },
    {
      "id": "nm5385288",
      "name": "Karan",
      "character": "College student in cafe"
    },
    {
      "id": "nm3349777",
      "name": "Shadab Khan",
      "character": "Tariq"
    },
    {
      "id": "nm5385425",
      "name": "Ashok Sawhny",
      "character": "Mr. Khanna"
    },
    {
      "id": "nm5385192",
      "name": "Rishi Sharma",
      "character": "College student in cafe"
    },
    {
      "id": "nm4942483",
      "name": "Vidushi Talwar",
      "character": "Latika"
    },
    {
      "id": "nm5060248",
      "name": "Mihir Tandon",
      "character": "Kartik"
    },
    {
      "id": "nm5385413",
      "name": "Siddeshwar Wahi",
      "character": "Amaya's boss"
    }
  ],
  "overview": "\"Book a coffee\", is an offbeat library cum coffee shop. It is owned and run by Leela Krishnamoorthy, a middle aged widow. She herself is as interesting and free spirited as the café she runs! Amaya, Leelas only child is a fire-brand 22 year-old writer; quick witted, confident and open-minded. They adore each other as only mother daughter can.",
  "storyline": "(Hindi with English subtitles) In this poignant Bollywood-styled indie interpretation about family ties and growing up, fiery 22-year old writer Amaya struggles to balance working life with family life after finding out that her mom is dating her current collaborator at work.",
  "plot": "The film is set in Delhi, where a widowed mother, Leela, runs library cafe \" Book a Coffee.\" Here she makes a new friend, a widowed photographer, Jayant 'Jazz', and soon finds their friendship growing. However, Leela's daughter Amaya, a budding writer, feels insecure about the relationship when she finds out about it. While she collaborates with Jazz on producing a coffee table book about the bazaars of Old Delhi, when her mother takes her relationship with Jazz further, she is unable to accept it. The journeys of all the principal characters and a subtle twist at the end make up the narrative of the film. ..",
  "synopsis": "\"Book a coffee\", is an offbeat library cum coffee shop. It is owned and run by Leela Krishnamoorthy, a middle aged widow. She herself is as interesting and free spirited as the café she runs! Amaya, Leelas only child is a fire-brand 22 year-old writer; quick witted, confident and open-minded. They adore each other as only mother daughter can.Into this mix, is thrown Jayant Sinha. A 60 year old retired photographer, who continues his chosen profession as a hobby today. He is passionate about people and the memories they create; he is also a great friend to Amaya Krishnamoorthy, with whom he decides to co-author a coffee table book, titled 'Memories of The Busy Bazaar.' The Busy Bazaar as a title has its own story and adds a subtle but intriguing undercurrent to the narrative woven around it.After having lost her husband 12 years ago, Leela refuses to become a stereotypical wallflower, who wallows in the unfairness of life. It translates into the sort of person she becomes, the way her daughter is brought up and the people who are attracted to her.And along the way, Leela falls in love again.Given that Amaya is open minded and modern in the way she reacts to various things around her, gives Leela reason to believe that this will in no way be a hindrance or a problem with her daughter. And this is also the crux of the whole story.At a dinner he is at with Leela, Jayant begins to narrate the incident in which he tragically lost his family. Talking late into the night, Jayant spends the night in Leela's home, which is also when Amaya walks in on them the next morning; just as Leela is consoling a broken Jayant who's just finished his heart rending story. As relationships that were once rock solid, fracture and crumble, the film explores multiple relationships in their own unique ways.It also traces Amaya's journey of anger, betrayal and disbelief to one where she understands the reasons behind everything that has happened between mother and daughter. Once her head clears, Amaya is the one that makes the effort to rebuild lives, piece together shattered relationships and bring the missing sunshine back into everybody's lives.Other characters beautifully woven into the film also add to the layering and texture, that character driven films demand. Finally, there is also a sub plot that runs alongside the main narrative, which becomes the sublime finale to a sensitive, subtly humorous and extremely touching story.Listen Amaya is a modern, young, contemporary and fun film about relationships, family dynamics, about pre-conceptions and about priorities."
}