{
  "imdb_id": "tt2222394",
  "tmdb_id": "180147",
  "douban_id": null,
  "title": "The Noble Family (2013)",
  "genres": [
    "Comedy"
  ],
  "country": "Mexico",
  "version": [
    {
      "runtime": "108 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.4,
  "director": [
    {
      "id": "nm1890752",
      "name": "Gary Alazraki"
    }
  ],
  "writer": [
    {
      "id": "nm1890752",
      "name": "Gary Alazraki",
      "description": "as Gaz Alazraki and"
    },
    {
      "id": "nm2277639",
      "name": "Adrian Zurita",
      "description": null
    },
    {
      "id": "nm2215506",
      "name": "Patricio Saiz",
      "description": null
    },
    {
      "id": "nm0868307",
      "name": "Adolfo Torrado",
      "description": "play"
    },
    {
      "id": "nm1890752",
      "name": "Gary Alazraki",
      "description": "story as Gaz Alazraki"
    },
    {
      "id": "nm4204713",
      "name": "Mark Alazraki",
      "description": "story"
    },
    {
      "id": "nm5988910",
      "name": "Vivian Sadovitch",
      "description": "story"
    }
  ],
  "cast": [
    {
      "id": "nm0891830",
      "name": "Gonzalo Vega",
      "character": "Germán Noble"
    },
    {
      "id": "nm1645334",
      "name": "Luis Gerardo Méndez",
      "character": "Javi Noble"
    },
    {
      "id": "nm0646568",
      "name": "Karla Souza",
      "character": "Bárbara Noble"
    },
    {
      "id": "nm4261659",
      "name": "Juan Pablo Gil",
      "character": "Charlie Noble"
    },
    {
      "id": "nm2638243",
      "name": "Ianis Guerrero",
      "character": "Lucho"
    },
    {
      "id": "nm1035423",
      "name": "Karla Sofía Gascón",
      "character": "Peter Pintado       (as Juan Carlos Gascón)"
    },
    {
      "id": "nm5562357",
      "name": "Mario Haddad",
      "character": "Anwar Kaim"
    },
    {
      "id": "nm0558014",
      "name": "Mary Paz Mata",
      "character": "Margarita"
    },
    {
      "id": "nm2274756",
      "name": "Alberto Zeni",
      "character": "Juan Pablo"
    },
    {
      "id": "nm2016633",
      "name": "Marcela Guirado",
      "character": "Mara"
    },
    {
      "id": "nm0647044",
      "name": "Adriana Olivera",
      "character": "Irma"
    },
    {
      "id": "nm3683445",
      "name": "David Gaitán",
      "character": "Bernardo       (as David Gaytán)"
    },
    {
      "id": "nm5988836",
      "name": "Tavo Garay",
      "character": "Tavo"
    },
    {
      "id": "nm0346463",
      "name": "Ana Karina Guevara",
      "character": "Carmen"
    },
    {
      "id": "nm3125870",
      "name": "Luis Calvillo",
      "character": "Sebas       (as Luis Calvillo Anza)"
    },
    {
      "id": "nm1799196",
      "name": "Mariana Braun",
      "character": "Profesora Lucia"
    },
    {
      "id": "nm4204713",
      "name": "Mark Alazraki",
      "character": "Pollo"
    },
    {
      "id": "nm5177938",
      "name": "Mossy Santini",
      "character": "Ana Paula"
    },
    {
      "id": "nm5988909",
      "name": "Jose Ramon Granado",
      "character": "Mesero Ivoire"
    },
    {
      "id": "nm1414863",
      "name": "Hugo Albores",
      "character": "El Diputeibol"
    },
    {
      "id": "nm1890752",
      "name": "Gary Alazraki",
      "character": "Santiago       (as Gaz Alazraki)"
    },
    {
      "id": "nm5988910",
      "name": "Vivian Sadovitch",
      "character": "Maria Jose"
    },
    {
      "id": "nm2044457",
      "name": "Cynthia Alazraki",
      "character": "Vendedora Tienda de ropa"
    },
    {
      "id": "nm4193231",
      "name": "Quetzalli Cortés",
      "character": "Gilberto Marín"
    },
    {
      "id": "nm0651242",
      "name": "Raúl Ortiz",
      "character": "Doctor"
    },
    {
      "id": "nm1980162",
      "name": "Carlos Alazraki Grossman",
      "character": "Director Carrera de Arquitectura       (as Carlos Alazraki)"
    },
    {
      "id": "nm5988911",
      "name": "Francisco Aguirre",
      "character": "Judge Molinar"
    },
    {
      "id": "nm2539163",
      "name": "Alfredo Barrera",
      "character": "Don Rodrigo"
    },
    {
      "id": "nm5988913",
      "name": "Raul Penayos",
      "character": "Chaman"
    },
    {
      "id": "nm5988914",
      "name": "Erik Rish",
      "character": "Maestro Reiki"
    },
    {
      "id": "nm1026185",
      "name": "Alejandro Reza",
      "character": "Ejecutivo Restaurante"
    },
    {
      "id": "nm5988915",
      "name": "Cheli Godines",
      "character": "Secretaria Restaurante"
    },
    {
      "id": "nm3576592",
      "name": "Cristian López",
      "character": "Gerente Coffee hop"
    },
    {
      "id": "nm0346261",
      "name": "Sonia Guerrero",
      "character": "Receptionista Gerbea"
    },
    {
      "id": "nm0631277",
      "name": "Adriana Nieto",
      "character": "Receptionista Registro Civil"
    },
    {
      "id": "nm3381556",
      "name": "Ricardo Mestre",
      "character": "Amigo Javi       (as Richie Mestre)"
    },
    {
      "id": "nm0520301",
      "name": "Gonzalo Lora",
      "character": "Notario"
    },
    {
      "id": "nm1462777",
      "name": "Octavio Castro",
      "character": "El Duende"
    },
    {
      "id": "nm2353391",
      "name": "José Ramón Coronado",
      "character": "Mesero"
    },
    {
      "id": "nm2968512",
      "name": "Mariana Villalvazo Martin",
      "character": "Iliana       (as Mariana Villalvazo)"
    },
    {
      "id": "nm9533867",
      "name": "Fuentealba Rodrigo",
      "character": "Amigo Javi"
    }
  ],
  "overview": "Tells the \"riches to rags\" story of the Nobles, three upper-class twenty-somethings that appear to have no limits to their checkbooks, and no direction in their lives. Until one day, their father tries to teach them a lesson by staging a financial scandal that forces the whole family to escape to an old house in the poor side of town, and leads the \"kids\" to do what they haven't done before: get jobs.",
  "storyline": "Three spoiled children who are cut off from their family fortune and forced to do the unthinkable - get a job.",
  "plot": "Located in modern Mexico city, \"The Noble family\" tells the story of wealthy mexican businessman Germán Noble, and his three grown children, Javier, Bárbara, and Carlos.\n\nBeing always busy at his job, Germán doesn't realize that his kids are doing nothing with their lives, while carelessly spending his money. He never touches the subject, for he attributes their attitude to the depression the kids feel in the wake of their mother’s death.\n\nThough Javier works in his father's construction company (in theory), he spends most of his time partying with friends. When not socializing, he dreams up unrealistic, and often, impossible, projects that are often mocked by his father's business partner, Anwar Karim. Hoping to motivate Javier, Germán tells him he plans to leave the company to him in the future, and so he charges Javier with bigger responsibilities. Javier, instead, flies to Miami with his friends, leaving a subordinate to take his place at a very important business reunion.\n\nBárbara is a socialite about to get engaged to Peter, a man 20 years older than her, who’s left several failed businesses in bankruptcy. He’s hoping that Bárbara’s trust fund will help him pay off his enormous tax debt. Germán is against said engagement, but Bárbara pays no attention to him and starts planning the wedding\n\nCarlos, Germán’s youngest child, is a hipster that has been expelled from college for being caught by the dean having sex with Lucía, one of his teachers.\n\nGermán’s frustration finally leads him to a heart attack. While in the hospital, he decides to give his children a lesson and a taste of the real world. He tells them that union troubles and an embezzling partner have led the government to freeze his assets and that, as shareholders of the company, the whole family could end up in prison. Germán convinces them to hide and cut off all contact with friends and relatives (to protect his charade), and move into a dilapidated house his father owned in a modest area of Mexico City. The children will also have to support themselves, which means getting jobs for the first time in their lives.\n\nA friend’s father helps Carlos get a job as a bank teller, while Lucho, nephew of the family's old Maid, helps Bárbara find work as a waitress and Javier as a bus driver.\n\nWith a house falling down around them and bills to pay, the three immediately find themselves struggling to make ends meet. Their new situation causes them to see things in a new light. Bárbara discovers that Lucho, who she used to think of as poor and unworthy of her time, is actually a nice guy. Javier sees his old party friends as shallow hangers-on. Carlos starts to create some discipline in his life. Germán also learns a lot from his children during this time, and is dismayed to learn that Bárbara has bulimia, Javier is dyslexic and that he himself often spent too much time at work while they were growing up.\n\nMeanwhile, Peter, Bárbara's boyfriend, finds out the family's hideout and the truth about Germán’s scheme. Once he finds out it’s all just a plot to teach the kids a lesson, he tries to blackmail Germán into giving him power over Bárbara’s trust fund. Germán refuses, but in the process he’s forced to admit the truth to his children. The revelation generates a feeling of anger and distrust in them. However Bárbara realises that Peter's only intention was to obtain her money, and breaks with him. Disappointed, the three siblings decide to distance themselves from their father, keep their jobs and fully repair the old house.\n\nGérman's wish to see his children mature and live independently is finally accomplished, even though they break all contact with him. Carlos leaves the bank and gets a real job, Javier opens a business of his own, and Bárbara and Lucho get engaged.\n\nBy the end of the film we see Gérman knocking on the, now restored, front door of the old house, the children open, and he asks for forgiveness. They reconcile acknowledging that everything was for a greater good.\n\nAfter the credits Peter is inside a prison cell, for his tax debts, as two fellow inmates approach to molest him.",
  "synopsis": "Germán Noble (Gonzalo Vega), a recently widowed millionaire, after having a pre-heart attack, realizes his two sons, Javi and Cha (Luis Gerardo Méndez & Juan Pablo Gil) and daughter Bárbara (Karla Souza) don't know how to make their own way in the real world. He decides to pull off a charade where he says he's broken and his former partners are after him, so they go hiding into Germán's father's old house, a little place in a poor neighboorhood. While living here, German tells his kids they will have to be more independent, get jobs, and earn their own money. With the help of their maid's nephew, Lucho, they get jobs as a bus driver, a bank employee, and a waitress. As days go bye, Javi, Cha and Barbara, learn to appreciate what they have earned and even grow fond of their job mates. So, the Noble family starts being a more united one, where all four of them will know each other better than any other time. Germán's plan is working until it's compromised by Peter (Juan Carlos Gascón), Bárbara's boyfriend, who attempts to bribe Germán by putting an end to his whole charade, unless he allows Barbara to marry him, and give him a part of the family's inheritance. Unable to say yes to this terms, Germán tells the truth to his kids, who get mad at him, and yet, go back to their working, independent lives. After Germán asks them to forgive him, they all four have learned a lesson."
}