{
  "imdb_id": "tt2202750",
  "tmdb_id": "134671",
  "douban_id": null,
  "title": "Golden Winter (2012)",
  "genres": [
    "Comedy",
    "Family"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "89 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.0,
  "director": [
    {
      "id": "nm5146344",
      "name": "Sam Mendoti"
    }
  ],
  "writer": [
    {
      "id": "nm0782457",
      "name": "Tom Seidman",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm2609288",
      "name": "Andrew Beckham",
      "character": "Oliver Richmond"
    },
    {
      "id": "nm0002436",
      "name": "Shannon Elizabeth",
      "character": "Jessica Richmond"
    },
    {
      "id": "nm0112043",
      "name": "Jason Brooks",
      "character": "Jeff Richmond"
    },
    {
      "id": "nm3441130",
      "name": "Charles Irving Beale",
      "character": "Ben"
    },
    {
      "id": "nm0266286",
      "name": "Madeleine Falk",
      "character": "Mrs. Geitzen"
    },
    {
      "id": "nm3179443",
      "name": "Sam Elliot Hafermalz",
      "character": "Scooter       (as Samuel E. Hafermalz)"
    },
    {
      "id": "nm1120316",
      "name": "Joe Hursley",
      "character": "Frankie"
    },
    {
      "id": "nm4795991",
      "name": "Ava Kolker",
      "character": "Marybeth Geitzen"
    },
    {
      "id": "nm3304337",
      "name": "Jon Kondelik",
      "character": "Tommy"
    },
    {
      "id": "nm2606631",
      "name": "Rae Latt",
      "character": "Mrs. Mildred Bell"
    },
    {
      "id": "nm0526235",
      "name": "Richard Lund",
      "character": "Mr. Williams"
    },
    {
      "id": "nm4182696",
      "name": "Christian Mooney",
      "character": "Timmy Geitzen"
    },
    {
      "id": "nm1056309",
      "name": "Clyde Tull",
      "character": "Mr. Garvey"
    },
    {
      "id": "nm0877642",
      "name": "Jim Turner",
      "character": "Mr. Geitzen"
    },
    {
      "id": "nm4115971",
      "name": "Zach Louis",
      "character": "Charley"
    },
    {
      "id": "nm5261523",
      "name": "Heath L Williams ll",
      "character": "Biff"
    },
    {
      "id": "nm3417491",
      "name": "Austin James Wolff",
      "character": "Jimmy       (as Austin J. Wolff)"
    },
    {
      "id": "nm0240380",
      "name": "Haylie Duff",
      "character": "Rory       (voice)"
    },
    {
      "id": "nm0514605",
      "name": "Kim Little",
      "character": "Jumper       (voice)"
    },
    {
      "id": "nm2696897",
      "name": "G.K. Bowes",
      "character": "Tinkle /              Mother Dog       (voice)"
    },
    {
      "id": "nm0346886",
      "name": "Darrel Guilbeau",
      "character": "Snoozer /              Mean Dog #2       (voice)"
    },
    {
      "id": "nm2401659",
      "name": "Steve Sirkis",
      "character": "Scarf       (voice)"
    },
    {
      "id": "nm1035500",
      "name": "Kyle Hebert",
      "character": "Mean Dog #1       (voice)"
    },
    {
      "id": "nm2648065",
      "name": "Roel Navarro",
      "character": "Chihuahua       (voice)"
    },
    {
      "id": "nm3388414",
      "name": "Megan Miller",
      "character": "Fluffy       (voice)"
    },
    {
      "id": "nm5299660",
      "name": "Akia Benbo",
      "character": "Background person       (as A'Kia Benbo)"
    },
    {
      "id": "nm5289879",
      "name": "Darren Boone",
      "character": "Background person"
    },
    {
      "id": "nm5298092",
      "name": "Xander Bowman",
      "character": "Background person"
    },
    {
      "id": "nm4723146",
      "name": "Sandra Caldera",
      "character": "Background person"
    },
    {
      "id": "nm1555813",
      "name": "Tiffany Carr",
      "character": "Background person"
    },
    {
      "id": "nm4265668",
      "name": "Claire Cordingley",
      "character": "Background person"
    },
    {
      "id": "nm5299061",
      "name": "Alanya Echols",
      "character": "Background person"
    },
    {
      "id": "nm5299494",
      "name": "Mia Egure",
      "character": "Background person"
    },
    {
      "id": "nm5299442",
      "name": "Makenna Egure",
      "character": "Background person"
    },
    {
      "id": "nm5567311",
      "name": "Gabriel Flores",
      "character": "Background person"
    },
    {
      "id": "nm2051053",
      "name": "Tyler Griffin",
      "character": "Background person"
    },
    {
      "id": "nm5001629",
      "name": "Alizabeth Hamer",
      "character": "Background person"
    },
    {
      "id": "nm4204244",
      "name": "Alexis Hamer",
      "character": "Background person"
    },
    {
      "id": "nm5289388",
      "name": "Nikolas Hill",
      "character": "Background person"
    },
    {
      "id": "nm2633043",
      "name": "Dennis Honda",
      "character": "Background person"
    },
    {
      "id": "nm5298618",
      "name": "Jack Hyde-White",
      "character": "Background person"
    },
    {
      "id": "nm1478412",
      "name": "Marissa Lynne Johnson",
      "character": "Background person       (as Marissa Johnson)"
    },
    {
      "id": "nm4259566",
      "name": "Ian Kanzler",
      "character": "Background person"
    },
    {
      "id": "nm5299330",
      "name": "Cheryle Kay",
      "character": "Background person"
    },
    {
      "id": "nm5300025",
      "name": "James Kulick",
      "character": "Background person"
    },
    {
      "id": "nm4347589",
      "name": "Jennifer Lynne",
      "character": "Background person       (as Jennifer Kursinski)"
    },
    {
      "id": "nm0282822",
      "name": "Gabriel Flores",
      "character": "Background person"
    },
    {
      "id": "nm3103292",
      "name": "Jon Miguel",
      "character": "Background person"
    },
    {
      "id": "nm3178946",
      "name": "Bailey Steven Nunez",
      "character": "Background person       (as Bailey Nunez)"
    },
    {
      "id": "nm5027455",
      "name": "Michael Ojugo",
      "character": "Background person"
    },
    {
      "id": "nm2161103",
      "name": "Collin Olympius",
      "character": "Background person"
    },
    {
      "id": "nm3428975",
      "name": "Dale Pulliam",
      "character": "Background person"
    },
    {
      "id": "nm0762114",
      "name": "J. Eric Sandoval",
      "character": "Background person       (as Eric Sandoval)"
    },
    {
      "id": "nm4140640",
      "name": "Caitlin Tyler",
      "character": "Background person"
    },
    {
      "id": "nm1640044",
      "name": "Alejandro Vargas",
      "character": "Background person"
    }
  ],
  "overview": "A runaway boy befriends a pack of homeless puppies. Together, they stop a bank robbery and find a family to adopt them all.",
  "storyline": "A boy befriends a litter of homeless Golden Retrievers. Together, they help stop a bank robbery just in time for Christmas.",
  "plot": "While admiring a rose blooming in the winter, Queen Eleanor of the kingdom of Tabor pricks her finger on one of its thorns. Three drops of blood fall onto the snow-covered ground, and she wishes for a daughter as white as the snow, with lips as red as the blood, hair as black as a raven's wings and a heart as strong and defiant as the rose. Queen Eleanor gives birth to her daughter Snow White, but soon after falls ill and dies. After her death, Snow White's father, King Magnus, and his army battle an invading Dark Army of demonic glass soldiers. Upon rescuing their prisoner Ravenna, he becomes enchanted with her beauty and marries her.\n\nRavenna, is in fact a powerful sorceress and the Dark Army's master. On their wedding night, Magnus, enchanted, throws Ravenna into the bed and proceeds to make love. Ravenna confesses there was a king much like Magnus that spoiled her. During foreplay, she declares she cannot be a weak queen and kills Magnus. Snow White's childhood friend William and his father Duke Hammond escape the castle but are unable to rescue her, and she is captured by Ravenna's brother Finn, and locked away in the north tower of the castle for many years.\n\nTabor is ruined under Queen Ravenna's rule as she periodically drains the youth from the kingdom's young women in order to maintain a spell cast over her as a child by her mother which allows her to keep her youthful beauty. When Snow White comes of age, Queen Ravenna learns from her Magic Mirror, in the form of a golden, reflective liquid shaped like a man, that her stepdaughter Snow White is destined to destroy her unless Queen Ravenna consumes the young girl's heart, which will make her truly immortal. Queen Ravenna orders Finn to bring her Snow White's heart, but she escapes into the Dark Forest, where Ravenna has no power. Queen Ravenna makes a bargain with Eric the Huntsman, a widower and drunkard, to capture Snow White, promising to bring his wife back to life in exchange. The Huntsman tracks down Snow White, but when Finn reveals that Queen Ravenna does not actually have the power to do what she promised, the Huntsman fights him and his men while Snow White runs away. When the Huntsman catches up with her, she promises him gold if he will escort her to Duke Hammond's castle. Meanwhile, Finn gathers another band of men to find her, and Duke Hammond and his son William learn that she is alive. William leaves the castle on his own to find her, joining Finn's band as a bowman.\n\nThe Huntsman and Snow White leave the Dark Forest, where she saves his life by charming a huge troll that attacks them. They make their way to a fishing village populated by women who have disfigured themselves to save their own lives, becoming useless to Queen Ravenna, who wants to use their beauty and youth to extend and prolong hers, as she does with Gretta whilst Snow White is still imprisoned. While there, the Huntsman learns Snow White's true identity, and initially leaves her in the care of the women. He soon returns when he sees the village being burned down by Finn's men. Snow White and the Huntsman evade them and eventually meet a band of eight dwarves named Beith, Muir, Quert, Coll, Duir, Gort, Nion, and Gus. The blind Muir perceives that Snow White is the daughter of the former king, and the only person who can defeat Ravenna and end her reign.\n\nAs they travel through a fairy sanctuary, Snow White encounters a magical reindeer that was only in tales of legend, but as the reindeer and Snow White are about to embrace, the group is attacked by Finn and his men. The Huntsman battles Finn and eventually kills him, and William reveals himself and helps defeat Finn's men. However, Gus is killed when he sacrifices himself to take an arrow meant for Snow White. William joins the group which continues the journey to Hammond's castle.\n\nHalfway to Duke Hammond's castle, Queen Ravenna disguises herself as William and tempts Snow White into eating a poisoned apple, but is forced to flee when the Huntsman and William discover her. William kisses Snow White, whom he believes to be dead. She is taken to Hammond's castle. As she lies in repose, the Huntsman professes his regret for not saving Snow White, who reminds him of his late wife, Sara, and he kisses her, breaking the spell. She awakens and walks into the courtyard, and rallies the Duke's army to mount a siege against Queen Ravenna.\n\nThe dwarves infiltrate the castle through the sewers and open the gates, allowing the Duke's army inside. Snow White confronts Queen Ravenna, but is overpowered. Queen Ravenna is about to kill Snow White and consume her heart. Eventually, Snow White uses a move the Huntsman taught her and seemingly kills Queen Ravenna, and Duke Hammond's army is victorious. With Queen Ravenna defeated, the kingdom once again enjoys peace and harmony as Snow White is crowned queen and she and the Huntsman exchange looks before it cuts to chants of \"Hail to the queen!\".",
  "synopsis": null
}