{
  "imdb_id": "tt2204080",
  "tmdb_id": "300654",
  "douban_id": null,
  "title": "Wildlike (2014)",
  "genres": [
    "Adventure",
    "Drama",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "104 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm1883918",
      "name": "Frank Hall Green"
    }
  ],
  "writer": [
    {
      "id": "nm1883918",
      "name": "Frank Hall Green",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm3480246",
      "name": "Ella Purnell",
      "character": "Mackenzie"
    },
    {
      "id": "nm1310016",
      "name": "Brian Geraghty",
      "character": "Uncle"
    },
    {
      "id": "nm0268007",
      "name": "Diane Farr",
      "character": "Mom"
    },
    {
      "id": "nm1289173",
      "name": "Nolan Gerard Funk",
      "character": "Tommy"
    },
    {
      "id": "nm0502671",
      "name": "Joshua Leonard",
      "character": "Dad"
    },
    {
      "id": "nm8265765",
      "name": "Julia Forster",
      "character": "Lizzie"
    },
    {
      "id": "nm8265766",
      "name": "Christopher Constant",
      "character": "Office Employee"
    },
    {
      "id": "nm8265767",
      "name": "Paul Wilcox",
      "character": "Office Employee"
    },
    {
      "id": "nm8265768",
      "name": "Thomas Daly",
      "character": "Office Employee"
    },
    {
      "id": "nm4381082",
      "name": "Teddy Kyle Smith",
      "character": "Blain"
    },
    {
      "id": "nm8265769",
      "name": "Ossie Kairaiuak",
      "character": "Outdoor Store Employee"
    },
    {
      "id": "nm5272802",
      "name": "Russell Josh Peterson",
      "character": "Mendenhall Guy with Dog       (as Russell Peterson)"
    },
    {
      "id": "nm0339304",
      "name": "Bruce Greenwood",
      "character": "Bartlett"
    },
    {
      "id": "nm5540742",
      "name": "Jamie Nelson",
      "character": "Anchorage Kite Person"
    },
    {
      "id": "nm4045722",
      "name": "Rich Capitan",
      "character": "Anchorage Kite Person"
    },
    {
      "id": "nm2075174",
      "name": "Pamela R. Klein",
      "character": "Stella       (as Pamela Klein)"
    },
    {
      "id": "nm2533524",
      "name": "Elias Christeas",
      "character": "Hank"
    },
    {
      "id": "nm4295492",
      "name": "Mark Robokoff",
      "character": "Whittier Traveller"
    },
    {
      "id": "nm3638025",
      "name": "Bradford James Jackson",
      "character": "Tommy's Friend 1       (as Bradford Jackson)"
    },
    {
      "id": "nm1452198",
      "name": "Erick Robertson",
      "character": "Tommy's Friend 2"
    },
    {
      "id": "nm2176596",
      "name": "Mark Cirnigliaro",
      "character": "Lodge Waiter"
    },
    {
      "id": "nm8265770",
      "name": "Jeffery Ferragi",
      "character": "Denali Bus Driver"
    },
    {
      "id": "nm3308149",
      "name": "Joe Tapangco",
      "character": "Denali Bus Rider"
    },
    {
      "id": "nm4072227",
      "name": "Erin Lindsay King",
      "character": "Diner Waitress       (as Erin King)"
    },
    {
      "id": "nm8265771",
      "name": "Ankor Ryan Rockum",
      "character": "Policeman"
    },
    {
      "id": "nm0235652",
      "name": "Ann Dowd",
      "character": "Jeanie"
    },
    {
      "id": "nm5380838",
      "name": "Tom Okamoto",
      "character": "Masafumi"
    },
    {
      "id": "nm5380730",
      "name": "Yasushi Kakizaki",
      "character": "Ide"
    },
    {
      "id": "nm5380951",
      "name": "Leo Grinberg",
      "character": "Josh"
    },
    {
      "id": "nm8265772",
      "name": "Jerri Young",
      "character": "Ferry Ticket Clerk"
    },
    {
      "id": "nm8265773",
      "name": "John J. Cox",
      "character": "Old Man Playing Cards"
    },
    {
      "id": "nm8265774",
      "name": "Ginger Cox",
      "character": "Old Woman Playing Cards"
    },
    {
      "id": "nm8265775",
      "name": "Jeremy Woodrow",
      "character": "Ferry Passenger"
    },
    {
      "id": "nm4417698",
      "name": "Ching Tseng",
      "character": "News Reporter       (as Ching Tsing)"
    },
    {
      "id": "nm4287320",
      "name": "Isidoro Martinez",
      "character": "Traveller at the Airport"
    },
    {
      "id": "nm5575944",
      "name": "Joe Boxer The Bear",
      "character": "Grizzly Bear"
    },
    {
      "id": "nm6867498",
      "name": "David Parks",
      "character": "Plane Passenger"
    },
    {
      "id": "nm5272931",
      "name": "Skadi",
      "character": "Alaskan Malamute"
    }
  ],
  "overview": "Fourteen-year-old Mackenzie is sent to live with her uncle in Juneau when her mother can’t care for her anymore. The living situation quickly takes a turn for the worse, and she runs away to rejoin her mother in Seattle. While on her dangerous journey of sleeping in cars and breaking into hotel rooms, she’s drawn to Rene, a lonesome backpacker looking for tranquility in the wilderness.",
  "storyline": "Mackenzie, a troubled but daring teenage girl, is sent by her struggling mother to live with her uncle in Juneau, Alaska. Although Uncle seems like a supportive caretaker and friend, the relationship turns and Mackenzie is forced to run. Trying to make her way back to Seattle alone to find her absent mother, Mackenzie only winds up deeper in the Alaskan interior. Lost and with no one else to turn to, she shadows a loner backpacker, Bartlett, an unlikely father figure with scars of his own. Together, they cross the wilderness and discover sanctuary in the last frontier.",
  "plot": "The film opens with two married couples - Carl and Vicky, and Douglas and Barbara - being chased through the woods by a mysterious beast. Barbara trips and is killed, despite Douglas's attempts to save her.\n\nSometime later, five college students - Alissa, her stepbrother Jeff, Jeff's girlfriend Mandy, Alissa's boyfriend Matt, and their mutual friend Sean, arrive in the forest to take a day long hike. Jeff forces the others to try to find a waterfall he and Alissa used to go to as kids, but they end up taking so long that it is nighttime by the time they start walking back to the car. Along the way, they discover the remains of Barbara's body, and then encounter the same monster that killed her. It chases them near a cabin, and manages to kill Jeff.\n\nThe others make it to the cabin, where they find Carl, Vicky, and Douglas, who have sealed the windows and walls with boards to protect themselves against the creature lurking outside. While Carl and Vicky are hopeful that they will all be rescued soon, Douglas is bitterly cynical of their chances. The creature almost breaks into the house, but they manage to hold it off, although Carl is scratched in the process.\n\nMatt volunteers to take a walkie-talkie and make a run for the car while Carl and Sean keep watch for the creatures. However, his screams are heard on the walkie-talkie, and then it starts heading for the cabin. Douglas attempts to board up the entrance to keep the creature from coming in, leaving Sean and Carl to die, but the girls help them get in through the back before the creature gets them. The group tie Douglas to the stairs, no longer trusting him.\n\nMandy confides in Alissa that she is pregnant while Sean confesses to Mandy that he and Jeff were having an affair. The group hear a walkie-talkie going off, and discover a barely alive Matt in the cellar, along with the animal. The group manage to get Matt upstairs, but Carl is killed keeping the animal from getting into the house. Douglas proposes that the group let the animal eat the dying Matt so that they can escape. The group refuses, and decide to trap the animal inside the house and burn it down. However, when they untie Douglas to help, he beats Matt to death anyway, calling the others weak. The animal suddenly breaks in and kills Douglas. As the animal eats his body, the others get kerosene out of the cellar and spread it throughout the house. Mandy, Sean, and Vicky hide in the cellar while Alissa lures the animal into the trap. She sets the fire, and successfully burns the monster to death.\n\nHowever, a second animal suddenly appears in the cellar and kills Sean and Vicky. Mandy and Alissa flee into the woods, and the second animal chases after them. Alissa is killed, but Mandy is able to reach the car. The second animal attacks her while she is trying to start it, but Mandy manages to kill the second animal by running its head over with the car. Mandy escapes, and begins crying over the loss of her friends as she drives away.\n\nThe final scene of the film shows a third animal finding and sniffing at the second animal's corpse, where it grunts aggressively, suggesting a call to the pack.",
  "synopsis": "An unlikely friendship forms in the spectacular Alaskan wilderness, giving a runaway girl hope and sanctuary in America's last frontier."
}