{
  "imdb_id": "tt2244376",
  "tmdb_id": "121173",
  "douban_id": null,
  "title": "Bwakaw (2012)",
  "genres": [
    "Drama"
  ],
  "country": "Philippines",
  "version": [
    {
      "runtime": "110 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm0484073",
      "name": "Jun Lana"
    }
  ],
  "writer": [
    {
      "id": "nm0484073",
      "name": "Jun Lana",
      "description": "written by as Jun Robles Lana"
    }
  ],
  "cast": [
    {
      "id": "nm0305182",
      "name": "Eddie Garcia",
      "character": "Rene"
    },
    {
      "id": "nm5139516",
      "name": "Princess",
      "character": "Bwakaw"
    },
    {
      "id": "nm0181397",
      "name": "Rez Cortez",
      "character": "Sol"
    },
    {
      "id": "nm0650988",
      "name": "Bibeth Orteza",
      "character": "Rose"
    },
    {
      "id": "nm2841309",
      "name": "Joey Paras",
      "character": "Tracy"
    },
    {
      "id": "nm0667074",
      "name": "Allan Paule",
      "character": "Berting"
    },
    {
      "id": "nm1446226",
      "name": "Beverly Salviejo",
      "character": "Nitang"
    },
    {
      "id": "nm1699163",
      "name": "Soxy Topacio",
      "character": "Zaldy       (as Soxie Topacio)"
    },
    {
      "id": "nm0883675",
      "name": "Luz Valdez",
      "character": "Minda"
    },
    {
      "id": "nm0894969",
      "name": "Gardo Versoza",
      "character": "Father Eddie"
    },
    {
      "id": "nm0190467",
      "name": "Soliman Cruz",
      "character": "Funeral Homes Manager"
    },
    {
      "id": "nm2595709",
      "name": "Ronaldo Bertubin",
      "character": "Minda's Nephew"
    },
    {
      "id": "nm2884940",
      "name": "May-i Fabros",
      "character": "Aleli"
    },
    {
      "id": "nm2728029",
      "name": "Jonathan Neri",
      "character": "Veterinarian"
    },
    {
      "id": "nm0797569",
      "name": "Armida Siguion-Reyna",
      "character": "Alicia"
    },
    {
      "id": "nm5432828",
      "name": "Jerry Apolonio",
      "character": "Veterinarian 2"
    },
    {
      "id": "nm8011793",
      "name": "Vincent Calayag",
      "character": "Boylet 1"
    },
    {
      "id": "nm8011797",
      "name": "Rommel Villareal",
      "character": "Boylet 2"
    },
    {
      "id": "nm5405024",
      "name": "Hazel Briones",
      "character": "Jeepney Passenger"
    }
  ],
  "overview": "Bwakaw is a drama-comedy about growing old, and everyone's fear of growing old alone. Rene is a gay man who came out of the closet at age 70. Ailing in his twilight years, he thinks it is now too late for love, even companionship, and that all there is to look forward to is Death. He has made a will, bequeathing his few possessions to his even fewer friends. Everything is packed and labeled, ready for distribution. He has even paid for a coffin, taking advantage of a funeral home's Summer Sale. Nowadays the only companion Rene has is Bwakaw, a stray dog that hangs around his house and follows him wherever he goes. As Rene waits for the day of his death, he gets the surprise of his life when it is Bwakaw who suddenly falls ill and is diagnosed with cancer.",
  "storyline": "Comedy about growing old, fear of loneliness and coming out of the closet. Starring one of the Philippines' institution of cinema, Eddie Garcia.",
  "plot": "Rene is a gay man who came out of the closet at age 60. Ailing in his twilight years, he thinks it is now too late for love, even companionship, and that all there is to look forward to is Death. He has made a will, bequeathing his few possessions to his even fewer friends. Everything is packed and labeled, ready for distribution. He has even paid for a coffin, taking advantage of a funeral home's Summer Sale. Nowadays the only companion Rene has is Bwakaw, a stray dog that hangs around his house and follows him wherever he goes. As Rene waits for the day of his death, he gets the surprise of his life when it is Bwakaw who suddenly falls ill and is diagnosed with cancer. Rene is surprisingly affected, and he realizes that he values Bwakaw more than he thinks. In his struggle to get Bwakaw cured, Rene finds comfort in the most unlikely person: Sol, a tricycle driver who helps him bring Bwakaw to the vet and befriends him. Buoyed by Sol's friendship, Rene starts living. Little by little he discovers simple joys. To the surprise of his friends, he even has his hair dyed to look younger. One day, he finally decides to make a move on Sol. The revelation that Rene is gay and has feelings for him surprises and disgusts Sol. He rejects Rene and leaves in anger. In the meantime, Bwakaw's condition gets worse. Not even Rene's ancient Santo Entierro (a supposedly miraculous statue of Jesus Christ) can save Bwakaw. Bwakaw dies, and Rene's neighbors help him bury the faithful dog. But Bwakaw's death, even while it was still only imminent, has made a difference. Rene has found a new appreciation for life and what is most important. He decides to unpack the things that he has already willed to other people and make his house more habitable. He is, after all, still alive.",
  "synopsis": "Plot: Bwakaw is a drama-comedy about growing old, and everyones fear of growing old alone. Rene is a gay man who came out of the closet at age 70. Ailing in his twilight years, he thinks it is now too late for love, even companionship, and that all there is to look forward to is Death. He has made a will, bequeathing his few possessions to his even fewer friends. Everything is packed and labeled, ready for distribution. He has even paid for a coffin, taking advantage of a funeral homes Summer Sale. Nowadays the only companion Rene has is Bwakaw, a stray dog that hangs around his house and follows him wherever he goes. As Rene waits for the day of his death, he gets the surprise of his life when it is Bwakaw who suddenly falls ill and is diagnosed with cancer. Rene is surprisingly affected, and he realizes that he values Bwakaw more than he thinks. In his struggle to get Bwakaw cured, Rene finds comfort in the most unlikely person: Sol, a tricycle driver who helps him bring Bwakaw to the vet and befriends him. Buoyed by Sols friendship, Rene starts living. Little by little he discovers simple joys. To the surprise of his friends, he even has his hair dyed to look younger. One day, he finally decides to make a move on Sol. The revelation that Rene is gay and has feelings for him surprises and disgusts Sol. He rejects Rene and leaves in anger. In the meantime, Bwakaws condition gets worse. Not even Renes ancient Santo Entierro (a supposedly miraculous statue of Jesus Christ) can save Bwakaw. Bwakaw dies, and Renes neighbors help him bury the faithful dog. But Bwakaws death, even while it was still only imminent, has made a difference. Rene has found a new appreciation for life and what is most important. He decides to unpack the things that he has already willed to other people and make his house more inhabitable. He is, after all, still alive."
}