{
  "imdb_id": "tt2377322",
  "tmdb_id": "184346",
  "douban_id": null,
  "title": "Deliver Us from Evil (2014)",
  "genres": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "118 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm0220600",
      "name": "Scott Derrickson"
    }
  ],
  "writer": [
    {
      "id": "nm0220600",
      "name": "Scott Derrickson",
      "description": "screenplay &"
    },
    {
      "id": "nm0090199",
      "name": "Paul Harris Boardman",
      "description": "screenplay"
    },
    {
      "id": "nm1767483",
      "name": "Ralph Sarchie",
      "description": "book and"
    },
    {
      "id": "nm6525945",
      "name": "Lisa Collier Cool",
      "description": "book"
    }
  ],
  "cast": [
    {
      "id": "nm0051509",
      "name": "Eric Bana",
      "character": "Sarchie"
    },
    {
      "id": "nm1183149",
      "name": "Edgar Ramírez",
      "character": "Mendoza"
    },
    {
      "id": "nm1601397",
      "name": "Olivia Munn",
      "character": "Jen"
    },
    {
      "id": "nm2421211",
      "name": "Chris Coy",
      "character": "Jimmy"
    },
    {
      "id": "nm0592923",
      "name": "Dorian Missick",
      "character": "Gordon"
    },
    {
      "id": "nm0365317",
      "name": "Sean Harris",
      "character": "Santino"
    },
    {
      "id": "nm0570364",
      "name": "Joel McHale",
      "character": "Butler"
    },
    {
      "id": "nm2005766",
      "name": "Mike Houston",
      "character": "Nadler"
    },
    {
      "id": "nm5157662",
      "name": "Lulu Wilson",
      "character": "Christina"
    },
    {
      "id": "nm0395659",
      "name": "Olivia Horton",
      "character": "Jane"
    },
    {
      "id": "nm1478409",
      "name": "Scott Johnsen",
      "character": "Lt. Griggs"
    },
    {
      "id": "nm0784815",
      "name": "Daniel Sauli",
      "character": "Salvatore"
    },
    {
      "id": "nm0491815",
      "name": "Antoinette LaVecchia",
      "character": "Serafina"
    },
    {
      "id": "nm4861965",
      "name": "Aidan Gemme",
      "character": "Mario"
    },
    {
      "id": "nm1539179",
      "name": "Jenna Gavigan",
      "character": "Lucinda"
    },
    {
      "id": "nm6581335",
      "name": "Skylar Toddings",
      "character": "Little Girl"
    },
    {
      "id": "nm0478439",
      "name": "Sebastian La Cause",
      "character": "EMT"
    },
    {
      "id": "nm1571632",
      "name": "Steve Hamm",
      "character": "Cop"
    },
    {
      "id": "nm0625735",
      "name": "Sean Nelson",
      "character": "Cop"
    },
    {
      "id": "nm4479160",
      "name": "Mari-Ange Ramirez",
      "character": "Woman in Bar"
    },
    {
      "id": "nm3315692",
      "name": "Ben Horner",
      "character": "Officer"
    },
    {
      "id": "nm1787532",
      "name": "Tijuana Ricks",
      "character": "Officer"
    },
    {
      "id": "nm0137121",
      "name": "John Cariani",
      "character": "Zookeeper"
    },
    {
      "id": "nm3190233",
      "name": "Robert Keiley",
      "character": "Desk Sergeant"
    },
    {
      "id": "nm1922522",
      "name": "Blair Sams",
      "character": "Mental Health Officer"
    },
    {
      "id": "nm3591091",
      "name": "Mark David Watson",
      "character": "Treasury Service Officer"
    },
    {
      "id": "nm0515226",
      "name": "Ben Livingston",
      "character": "Physician"
    },
    {
      "id": "nm0619356",
      "name": "Kevin Nagle",
      "character": "Sergeant"
    },
    {
      "id": "nm0905625",
      "name": "Oliver Wadsworth",
      "character": "Marvin"
    },
    {
      "id": "nm2204806",
      "name": "Lolita Foster",
      "character": "Patrol Cop"
    },
    {
      "id": "nm6581336",
      "name": "Carmen Ortiz-Girdauskas",
      "character": "Dispatcher"
    },
    {
      "id": "nm1043006",
      "name": "Victor Pagan",
      "character": "Mental Patient"
    },
    {
      "id": "nm0662630",
      "name": "Carol Stanzione",
      "character": "Mental Patient"
    },
    {
      "id": "nm5795122",
      "name": "Adam Kobylarz",
      "character": "Mental Patient"
    },
    {
      "id": "nm0153610",
      "name": "Lauro David Chartrand-DelValle",
      "character": "Marine Corporal       (as Lauro Chartrand)"
    }
  ],
  "overview": "New York police officer Ralph Sarchie investigates a series of crimes. He joins forces with an unconventional priest, schooled in the rites of exorcism, to combat the possessions that are terrorizing their city.",
  "storyline": "In DELIVER US FROM EVIL, New York police officer Ralph Sarchie (Eric Bana), struggling with his own personal issues, begins investigating a series of disturbing and inexplicable crimes. He joins forces with an unconventional priest (Edgar Ramirez), schooled in the rituals of exorcism, to combat the frightening and demonic possessions that are terrorizing their city. Based upon the book, which details Sarchie's bone-chilling real-life cases.",
  "plot": "The film opens in a 2010 firefight in a palm grove in the Diyala Province of Iraq. Three Marines discover an underground cavern and start to scream as their helmet video feed goes black. In The Bronx in 2013, veteran NYPD officer Ralph Sarchie (Eric Bana) stands over the corpse of an infant in a darkened alley. He and his partner Butler (Joel McHale) resume their nocturnal patrol for the 46th Precinct. A domestic disturbance call comes in over the radio. Sarchie probes the dispatcher for more information and finds out that the male at the address is a former Marine. He tells Butler that his \"radar\" is going off because maybe the former Marine still thinks he is fighting in the war.\n\nAt the site of the complaint, Sarchie and Butler encounter the shirtless and heavily tattooed former Marine Jimmy Tratner (Chris Coy), who insists his wife is okay. When his wife lifts her head, the officers see that she has been badly beaten. They notice deep scratch marks on the floor and are wary of a dog as they make the arrest. Jimmy resists them ferociously, eventually drawing a knife on Butler and fleeing the house on foot. Sarchie catches up to Jimmy and makes the arrest; although, not without suffering a sizable wound to his forearm that will require stitches. The officers notice that Jimmy's fingernails are cracked and bleeding, and they assume that he is mentally ill or high on drugs.\n\nSarchie and Butler are called to the Bronx Zoo after a woman has thrown her toddler into the moat surrounding the lion enclosure. They find the woman in a lemur pen. She is furiously scraping at the ground, and after they apprehend her, she rapidly recites the lyrics to \"Break On Through (To the Other Side)\". Sarchie notices a painter inside the lion enclosure. He enters the pen to interrogate the mysterious man, but he is attacked by the lions and barely escapes.\n\nWhen the deranged woman, Jane Crenna, is transferred from the precinct to a mental health facility, a Jesuit priest named Mendoza (Édgar Ramírez) arrives at the family's request. He asks the officers several pointed questions about Jane's behavior at the zoo. When another domestic disturbance call comes in, Sarchie notices the complaint makes reference to doors and decides that he and Butler will respond. At the house, the family of three have been staying in the living room after a series of strange disturbances. There is one area of the house where light bulbs instantly burn out and candles will not remain lit.\n\nThe family explain that there were two painters working the basement, where most of the disturbances occurred. In the basement, Sarchie discovers the badly decomposing body of one of the painters, David Griggs. At Griggs' apartment, which is overrun by cockroaches and refuse, they find business cards for Alphonsus Painting company as well as a picture of Griggs with Jane Crenna and the child that she threw at the zoo. In another picture, Griggs is pictured in his Marine uniform with Jimmy Tratner and a third Marine named Santino (Sean Harris). They realize Santino must have been the painter at the zoo.\n\nMendoza visits Sarchie at the precinct and asks to view the surveillance tapes of Jane at the zoo. He believes that Jane is possessed by demons, and he explains that there is secondary evil created by humans and primary evil which comes from demons. Sarchie is skeptical, but when he reviews the surveillance footage with Butler, he hears strange noises and sees things that Butler does not. Sarchie returns to Jimmy Tratner's house and finds a wall that was being painted in Jimmy's home office. He scrapes away the paint to find a pictograph of an owl. At Sarchie's home, his daughter lies in bed as a stuffed owl stares ominously at her from a shelf in her bedroom. She is awakened by strange noises and frightened.\n\nBack at Tratner's home, Sarchie has scraped off the paint from the rest of the wall to find a bizarre mix of Latin and ancient pictographs. Sarchie finds some hard drives with footage from Tratner's deployments and watches the full footage from the palm grove in Diyala. In the cave, the soldiers found a carving of the same message that is on the wall in Tratner's home. Sarchie revisits the basement where he found Griggs' body, scrapes off the paint from a wall, and finds the message again. He reviews the zoo surveillance footage and sees the same message was being painted over by Santino in the lion enclosure. With Mendoza, he visits Jane Crenna in the mental hospital and shows her the message from the cave. She savagely bites Sarchie's already wounded forearm.\n\nMendoza decodes the message as a kind of bridge between Christian and pagan theology which would theoretically allow demons a door to the human world. He explains that certain people are more susceptible to such messages than others. He suggests that the voices and images Sarchie is seeing could be a result of his intuitive \"radar\", which means that he is also susceptible to the archaic message. Mendoza and Sarchie gradually share more of their personal histories with each other. Mendoza goes with Sarchie and Butler to an apartment building where they are attacked by Santino and Jimmy Tratner. Tratner is subdued by Mendoza's cross. Santino overwhelms and eventually kills Butler.\n\nAt Sarchie's home, his daughter is once again awoken during the night. Her stuffed owl rolls off the shelf and advances towards her bed. As she runs screaming from the room, she sees Santino in the hallway. Sarchie arrives home to find Santino in his living room. Santino warns that he has abducted Sarchie's wife and daughter. Santino is brought to the precinct where Mendoza and Sarchie perform an exorcism on him. Sarchie's wife and daughter are located in an Alphonsus Painting van at a storage facility. The film ends with the baptism of the Sarchies' second child.",
  "synopsis": "The movie opens in Iraq in 2010. A small group of soldiers are running through a war zone in the desert when they encounter a man-made underground cave. The group leader, Lt. Griggs, sends two soldiers (Jimmy Tratner and Mike Santino) to investigate. Jimmy is recording. Underground, the camera light starts to flicker and then eventually dies out completely. Jimmy and Santino are heard screaming, and then the night vision comes on to reveal hundreds of bats exiting the cave around the two men. Santino produces a light and walks over a river of human skulls to the back of the cave, despite Jimmy's pleas to leave. He illuminates the back wall of the cave, which has a Latin inscription on it.The movie then flashes forward to present day 2013, in New York. Detective Ralph Sarchie is seen trying to give mouth to mouth to a very small bundle, which is revealed to be a dead baby. The coroner asks him repeatedly to let go, but he has trouble doing so and is clearly affected by the experience. The next scene shows Sarchie and his partner, Butler, patrolling the streets of New York. They hear a call coming in about a domestic dispute case and Sarchie says they'll take it. Butler, an adrenaline junkie, is excited because apparently Sarchie has a \"radar\" that causes him to take cases that take unusual, often violent turns. The call is about Jimmy Tratner. They pull up to his house and Jimmy answers the door. Sarchie needs to see his wife so Jimmy lets them inside. The wife, sitting on the sofa, lifts her head to show she has been badly beaten. Sarchie and Butler immediately try to arrest Jimmy, who fights back with a knife, slashing Sarchie's arm, and then sprints away. They eventually catch him, with Sarchie beating him so badly that Butler has to pull him away, and arrest him. Sarchie notices Jimmy's fingernails are bleeding.After Sarchie gets stitches in his arm, the two get a call for the local zoo. Upon arriving, the police at the scene tell them a woman has thrown her 2-year-old boy into the lion's pit. Luckily, the pit is being repainted, so the lions are not there, but the boy was badly injured. In the ensuing chaos, the woman escaped and the power went out. Sarchie and Butler split up and look for the woman. Sarchie notices the animals are going crazy and eventually finds the woman trying to dig into the ground with her bare fingernails. She is also constantly repeating the lyrics to a song by The Doors. While arresting her, they notice a man in a hood, presumably the painter, in the lion enclosure. Sarchie wants to talk to him but he just slowly walks away, farther into the lion's pit. Sarchie follows him when suddenly the two lions are out in the enclosure. He barely escapes.Upon taking the woman, named Jane, to the station, they are met by a priest named Mendoza. He wants to know more about Jane's behaviour, saying he's been close with her for years and that she isn't insane. He says there are two types of evil: secondary evil, which man does, and primary evil, which is something else entirely. He believes Jane is possessed. Sarchie doesn't believe the priest but takes his card anyway.The two are filling out the paperwork for the night when Sarchie gets a video message from his wife, Jen, and his young daughter, Christina, saying goodnight. Butler tells him the zoo will get them the video for the night's incidents in a few days. Sarchie overhears two other detectives talking about a case where a woman got a call from her father, who's been dead for seven years, to \"shut the door, the damn door\". Seeing a connection between the woman in the zoo and this case (the Doors), Sarchie offers to take the case off their hands. He and Butler go to a house where the family says they think the house is possessed and that strange sounds have been coming from the basement, which was recently being painted. None of the lights in their house work, none of the candles will burn, and every time they replace a light bulb it burns out within a few hours. Sarchie and Butler go down the stairs to investigate. The place reeks and hasn't been touched for some time. Butler goes upstairs for air, and Sarchie's radio starts making static for no reason. He eventually finds a body in the basement rolled up in a tarpaulin, later to be revealed to be Lt. Griggs. Sarchie questions the family and they identify his picture as a painter. They say there was another painter too, but they didn't see his face as he always had a hood on.Sarchie goes home to see his wife and daughter. The next morning Jen and Christina go to church, but Sarchie doesn't go. Jen tells Christina he used to go to church but doesn't any more. He doesn't believe any more.Sarchie and Butler go to Griggs's apartment and discover he was Jane's husband. His apartment is a wreck. They find another picture with Lt. Griggs, Jimmy, and a man named Santino in it. Upon looking him up, they discover all three were dishonourably discharged for attacking an army chaplain. They served time and got out a couple of years ago. Sarchie recognizes Santino as the painter from the lion enclosure and they further infer he is the painter from the house. Lt. Griggs was found to have killed himself by drinking paint thinner, but Santino had to have been the one to wrap him in the tarpaulin.The zoo has finally sent over the footage from the night the detectives were there. First, they watch the video of Jane. She is seen walking past the lion pit with a stroller when she spots Santino there, painting over something that looks like an inscription. He turns to face her and she starts to shake violently and then throws her child into the pit. He turns back and continues painting as if nothing happened. Next, they watch the video of Sarchie in the lion pit. Santino is shown walking away from Sarchie and turning a corner to let the lions out of where they're being kept, seemingly talking to them. Sarchie hears static again even though his radio is off and children's laughter. Then, a bloodied man pops up on the screen for a split second, startling him. Butler doesn't hear or see anything.Meanwhile, there is a scene where Christina is home going to sleep. She hears scratching under her bed and runs to her mum's room screaming. Sarchie goes home for the night and is met by Jen, who is angry at him because he yelled at his daughter and because \"even when he's home he's not really there.\" He gets mad and tells her he's had a terrible week. She says he doesn't talk to her any more and he says he'll try to be better. He goes to check on his daughter and finds nothing in her room until he sees the bloodied man over her bed in the mirror. He whips back around and the man is gone.Sarchie continues to hear static and children's voices, so he goes to meet the priest Mendoza at a pub. Mendoza is drinking but explains he used to be hooked on heroin, and that it eventually led him to God when he hit rock bottom. He lets Sarchie listen to an audio clip of an exorcism of a woman Claudia and her 5 year old daughter. The clip deeply affects Sarchie. Sarchie lets Mendoza take a look at the clips, and Mendoza doesn't hear the voices or see the man. However, Mendoza claims Sarchie's \"radar\" might actually be a heightened awareness to all things occult and evil, which is both a gift and a curse.Throughout the movie, Sarchie's family situation is becoming worse. He is distant from his wife and Christina's room is seemingly becoming increasingly haunted. One night, she hears the scratching again and her door won't open. Another night, her toys come alive on their own and move toward her. Jen is mad at Sarchie, saying Christina doesn't feel safe in her own home because she needs her father.Jane, in a mental ward, incapacitates the physician and escapes.Sarchie goes back to Jimmy's wife's house and sees the recordings from the war, including the one from the beginning of the film. Mrs. Tratner says she hasn't seen Jimmy since he got arrested, though he is out of jail. Sarchie views the recording and sees the inscription. He discovers the inscription is everywhere Santino is seen painting - the zoo, the house with the haunted basement, the cave in Iraq, even Jimmy's apartment. Mendoza explains the inscription is a portal to Hell. This explains why all the references are to the Doors, a type of portal.Butler and Sarchie find Santino's address. They, along with Mendoza, go to his apartment to wait for him. Butler is covering the front and Sarchie is in the car with Mendoza in the back. Mendoza says Sarchie needs to confess to God for him to help any further. Before Sarchie can do so, he spots Santino coming back into the apartment complex. He and Butler enter his apartment but he isn't there. They try to chase him down but they get split up, resulting in Sarchie getting attacked by a possessed Jimmy, who appears in the basement, and Butler getting trapped on the stairs. Mendoza is able to subdue Jimmy with his cross. Butler is stabbed to death in the stairwell by Santino.Back at Mendoza's apartment, Sarchie is upset about not being able to save Butler. Mendoza tells him to confess to him. He does, and explains he has killed a man out of revenge before. Mendoza absolves him of his sins.When Sarchie is driving home, Jane jumps to her death onto his car. When he is calling it in, he gets a call from Jen's phone, only to realize it's Santino on the phone, who has kidnapped his wife and daughter. He races home to find Santino and calls backup. They arrest Santino and bring him in. Mendoza and Sarchie are forced to do an exorcism. It is long and taxing for both, with Sarchie at one point only being able to hear a song by the Doors. Eventually, they expel the demon, and Sarchie finds his wife and daughter unharmed.It is revealed that after the birth of his second daughter, Sarchie retired from the police force and works with Mendoza to this day."
}