{
  "imdb_id": "tt2395421",
  "tmdb_id": "165463",
  "douban_id": null,
  "title": "The Priest's Children (2013)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "Croatia",
  "version": [
    {
      "runtime": "96 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm0107655",
      "name": "Vinko Bresan"
    }
  ],
  "writer": [
    {
      "id": "nm0107655",
      "name": "Vinko Bresan",
      "description": "co-writer"
    },
    {
      "id": "nm0559105",
      "name": "Mate Matisic",
      "description": "writer"
    },
    {
      "id": "nm5886381",
      "name": "Mate Matisic",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm1081893",
      "name": "Kresimir Mikic",
      "character": "Don Fabijan"
    },
    {
      "id": "nm2418386",
      "name": "Niksa Butijer",
      "character": "Petar"
    },
    {
      "id": "nm1146292",
      "name": "Marija Skaricic",
      "character": "Marija"
    },
    {
      "id": "nm0474092",
      "name": "Drazen Kuhn",
      "character": "Marin"
    },
    {
      "id": "nm1366806",
      "name": "Jadranka Djokic",
      "character": "Luda Ana"
    },
    {
      "id": "nm0728476",
      "name": "Lazar Ristovski",
      "character": "Biskup"
    },
    {
      "id": "nm2041861",
      "name": "Goran Bogdan",
      "character": "Jure"
    },
    {
      "id": "nm0098547",
      "name": "Zdenko Botic",
      "character": "Don Jakov"
    },
    {
      "id": "nm2821205",
      "name": "Filip Krizan",
      "character": "Don Simun"
    },
    {
      "id": "nm0110313",
      "name": "Ivan Brkic",
      "character": "Luka"
    },
    {
      "id": "nm0696732",
      "name": "Marinko Prga",
      "character": "Ucitelj Vinko (The Teacher)"
    },
    {
      "id": "nm0558165",
      "name": "Stojan Matavulj",
      "character": "Gradonacelnik"
    },
    {
      "id": "nm5249923",
      "name": "Tihana Lazovic",
      "character": "Trubacica (The Trumpet-playing Girl)"
    },
    {
      "id": "nm0119918",
      "name": "Senka Bulic",
      "character": "Perka"
    },
    {
      "id": "nm1904727",
      "name": "Ana Maras",
      "character": "Vesna"
    },
    {
      "id": "nm0904415",
      "name": "Mladen Vulic",
      "character": "Postar"
    },
    {
      "id": "nm2312774",
      "name": "Stjepan Peric",
      "character": "Policajac Vlado"
    },
    {
      "id": "nm0954102",
      "name": "Ljubo Zecevic",
      "character": "Policajac Vice"
    },
    {
      "id": "nm2265855",
      "name": "Petar Atanasoski",
      "character": "Mali od Pave"
    },
    {
      "id": "nm1085832",
      "name": "Jagoda Kralj",
      "character": "Udovica       (as Jagoda Kralj-Novak)"
    },
    {
      "id": "nm1084922",
      "name": "Ana Begic",
      "character": "Verica"
    },
    {
      "id": "nm0904340",
      "name": "Dara Vukic",
      "character": "Lucija       (as Darinka Vukic-Vrca)"
    },
    {
      "id": "nm1147050",
      "name": "Andrijana Vickovic",
      "character": "Kristina's Mother"
    },
    {
      "id": "nm1086144",
      "name": "Vedran Mlikota",
      "character": "Kristina's Father"
    },
    {
      "id": "nm1007922",
      "name": "Janko Rakos",
      "character": "Lijecnik"
    },
    {
      "id": "nm5486447",
      "name": "Matej Dubravcic",
      "character": "Baby Florijan (Jose)"
    },
    {
      "id": "nm0540365",
      "name": "Ivan Maloca",
      "character": "Zupnik u ispovjedaonic"
    },
    {
      "id": "nm3829232",
      "name": "Filip Detelic",
      "character": "Pirotehnicar Stjepan"
    },
    {
      "id": "nm1095544",
      "name": "Dusan Bucan",
      "character": "Invalid Mikula"
    },
    {
      "id": "nm1144228",
      "name": "Mile Blazevic",
      "character": "Gashi Bedri"
    },
    {
      "id": "nm4703160",
      "name": "Nika Burdjelez",
      "character": "Gashijeva kcer"
    },
    {
      "id": "nm5486199",
      "name": "Toncica Celjuska",
      "character": "Voditeljica Dnevnika"
    },
    {
      "id": "nm5485482",
      "name": "Nada Surjak",
      "character": "Nada Surjak"
    },
    {
      "id": "nm0321542",
      "name": "Renne Gjoni",
      "character": "Muskarac iz Njemacke"
    },
    {
      "id": "nm3802232",
      "name": "Una Siranovic",
      "character": "German Wife       (as Una Siranovic Schwanek)"
    },
    {
      "id": "nm1022214",
      "name": "Snjezana Sinovcic",
      "character": "Luka's Wife"
    },
    {
      "id": "nm1839888",
      "name": "Ljubomir Jurkovic",
      "character": "Biskupov tajnik"
    },
    {
      "id": "nm5485674",
      "name": "Silvije Tomasevic",
      "character": "Dopisnik iz Rima"
    },
    {
      "id": "nm0031997",
      "name": "Inge Appelt",
      "character": "Strina"
    },
    {
      "id": "nm2017567",
      "name": "Orijana Kuncic",
      "character": "Vicina zena"
    },
    {
      "id": "nm5485359",
      "name": "Petar Marsh",
      "character": "Djecak s gitarom"
    },
    {
      "id": "nm0579614",
      "name": "Branko Menicanin",
      "character": "Anin brat"
    },
    {
      "id": "nm5486261",
      "name": "Lana Huzjak",
      "character": "Kristina"
    },
    {
      "id": "nm5485224",
      "name": "Katarina Plazibat",
      "character": "Djevojcica s flautom"
    },
    {
      "id": "nm5138066",
      "name": "Toma Matisic",
      "character": "Djecak s violinom"
    },
    {
      "id": "nm5485612",
      "name": "Niko Bresan",
      "character": "Djecak na klavijaturama"
    },
    {
      "id": "nm5485221",
      "name": "Marija Stimac",
      "character": "Djevojcica na mandolini"
    },
    {
      "id": "nm0107655",
      "name": "Vinko Bresan",
      "character": "Bolnicar #1"
    },
    {
      "id": "nm0840867",
      "name": "Marko Svagusa",
      "character": "Bolnicar #2"
    }
  ],
  "overview": "Don Fabijan is a young priest who comes to serve on an unnamed small island in the Adriatic. In order to help increase birth rate on the island, he decides to pierce condoms before they are sold. He therefore teams up with the newsagent Petar and the pharmacist Marin. After they abolish all forms of birth control on the entire island, the consequences become more and more complicated.",
  "storyline": "Don Fabijan is a young priest who comes to serve on an unnamed small island in the Adriatic. In order to help increase birth rate on the island, he decides to pierce condoms before they are sold. He therefore teams up with the newsagent Petar and the pharmacist Marin. After they abolish all forms of birth control on the entire island, the consequences become more and more complicated.",
  "plot": "In rural Pennsylvania, Keller Dover, his wife Grace, their teenage son Ralph and young daughter Anna attend a Thanksgiving dinner at the home of their friends, Franklin and Nancy Birch, their teenage daughter Eliza and young daughter Joy. The four children go for a walk in the neighborhood and approach an RV that is parked outside a house nearby. There is music playing, which suggests there is somebody inside. After dinner, Anna and Joy go missing.\n\nDetective Loki is informed and starts a search. He arrests the driver of the RV, which is now parked at a gas station. The young man, Alex Jones, has the IQ of a 10 year old, and appears confused when being questioned at the police station. His vehicle is searched by forensics but nothing is found relating to the girls. Pursuing other leads, Loki discovers a corpse in the basement of Patrick Dunn, a priest. Dunn admits that he killed the man because the man confessed he was \"waging a war against God\" and had killed 16 children and said that he would kill more.\n\nAs the search continues, Dover is informed that Jones has been released and attacks him outside of the police station. Jones whispers to him, \"They didn't cry until I left them.\" Since Loki won't re-arrest Jones, Dover abducts him, locks him up in his late father's abandoned home and tortures him—with the help of a reluctant Franklin—to force him to talk. First he beats him, but Jones says nothing. Dover ties him up in the shower and uses plywood to enclose him in the dark. He adjusts the water so the shower is either scorching hot or freezing to further torture him.\n\nAt a candlelight vigil for the girls, Loki sees a suspicious hooded man, who flees when Loki approaches him. Later on, the man breaks into both families' houses but leaves without doing anything. Loki follows Dover to where Jones is being held prisoner but doesn't find him, as Dover fabricates a story about stopping over in the building so he's able to drink to ease his suffering without his wife knowing. A store clerk recognizes the man from a composite drawing and reports him to Loki after seeing him buying children's clothing. The suspect, Bob Taylor, is later arrested at his home, where the walls are covered in drawings of mazes. Loki then finds crates filled with maze books, live snakes, and bloodied children's clothing, including items belonging to the missing girls. They discover Taylor had himself been abducted as a child. At the police station, Taylor confesses to the abduction but during a physical altercation with Loki and two other officers, he snatches a gun and kills himself without revealing any more information. The police conclude that Taylor was a fantasist and had no involvement with the disappearances; he stole the clothes from the girls' homes and bloodied them with pig's blood to recreate abductions.\n\nDover continues to torture Jones, who incoherently talks about escaping from a maze. Dover visits Jones' aunt, Holly, who tells him that Alex is the way he is because he had an accident with snakes her husband kept as pets when he was younger. She also says that she and her husband were religious until their young son died of cancer. Back at the police station, Loki becomes frustrated with getting nowhere with the case until he matches a maze Taylor drew while in custody to the maze necklace worn by the man Patrick Dunn killed in his basement.\n\nSuddenly, Joy Birch is found drugged but alive. Dover visits her in the hospital to ask for information. Her memories are confused but she mumbles, \"You were there\" to Dover. He then realizes that Joy may have heard his voice at the Jones' house when he visited Holly, and runs from the police. Loki searches for Dover at the apartment building and discovers Alex. Dover then goes back to the Jones' house to get information from Holly, but she pulls a gun on him. She explains that, before her husband left her, they abducted many children as part of their \"war on God\" to avenge their son's death. Alex was the first child they abducted, followed by Taylor. Holly shoots Dover in the leg and imprisons him in a concealed pit in her yard, where he finds a police whistle belonging to his daughter.\n\nLoki goes to Holly's house to tell her that her nephew has been found. He finds a photograph of Holly's husband wearing the same maze necklace found on the body in the priest's basement, making him her missing husband. Loki finds Holly drugging Anna and they exchange gunfire: he is wounded, and Holly is killed. Loki then rushes Anna to the hospital where she reunites with her mother. Alex, revealed to be Barry Milland in the newspaper, is reunited with his parents after surviving the torture. A day later, Loki returns to the Jones' house where the authorities have begun excavating the property. As the forensic investigators depart for the night, Loki hears Dover's labored blowing on the whistle (a plea for help) from the pit.",
  "synopsis": null
}