{
  "imdb_id": "tt2301592",
  "tmdb_id": "137698",
  "douban_id": null,
  "title": "The Dance of Reality (2013)",
  "genres": [
    "Biography",
    "Drama",
    "Fantasy"
  ],
  "country": "Chile",
  "version": [
    {
      "runtime": "133 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm0423524",
      "name": "Alejandro Jodorowsky"
    }
  ],
  "writer": [
    {
      "id": "nm0423524",
      "name": "Alejandro Jodorowsky",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0423526",
      "name": "Brontis Jodorowsky",
      "character": "Jaime /              Father"
    },
    {
      "id": "nm4286535",
      "name": "Pamela Flores",
      "character": "Sara /              Mother"
    },
    {
      "id": "nm5665222",
      "name": "Jeremias Herskovits",
      "character": "Alejandro /              child"
    },
    {
      "id": "nm0423524",
      "name": "Alejandro Jodorowsky",
      "character": "Himself"
    },
    {
      "id": "nm0090894",
      "name": "Bastián Bodenhöfer",
      "character": "General Carlos Ibáñez del Campo"
    },
    {
      "id": "nm6305284",
      "name": "Andres Cox",
      "character": "Don Aquiles"
    },
    {
      "id": "nm0423523",
      "name": "Adan Jodorowsky",
      "character": "Anarchist"
    },
    {
      "id": "nm0423525",
      "name": "Axel Jodorowsky",
      "character": "Theosophist       (as Cristobal Jodorowsky)"
    },
    {
      "id": "nm0239955",
      "name": "Alisarine Ducolomb",
      "character": "Jorobada       (as Alizarine Ducolomb)"
    },
    {
      "id": "nm7351805",
      "name": "Sergio Vargas",
      "character": "Carpintero"
    },
    {
      "id": "nm2048603",
      "name": "Patricio Bambrilla",
      "character": "Propagandista"
    },
    {
      "id": "nm0703408",
      "name": "Juan Quezada",
      "character": "Pastor Evangélico"
    },
    {
      "id": "nm3321414",
      "name": "Adrián Salgado",
      "character": "Payaso Lechuga /              Guatón González"
    },
    {
      "id": "nm0602602",
      "name": "Eugenio Morales",
      "character": "Payaso Zanahoria"
    },
    {
      "id": "nm7351806",
      "name": "Italo Tai",
      "character": "Payaso Piripipi /              Dueño del Bar"
    },
    {
      "id": "nm7351807",
      "name": "Carlos Cantero",
      "character": "Alcalde"
    },
    {
      "id": "nm0422783",
      "name": "Luz Jiménez",
      "character": "Reina de Copas"
    },
    {
      "id": "nm7351808",
      "name": "Charles Bustos",
      "character": "El Moscardón"
    },
    {
      "id": "nm4666999",
      "name": "Hugo Marín",
      "character": "Heladero"
    },
    {
      "id": "nm7351809",
      "name": "Nelson González",
      "character": "Dentista"
    },
    {
      "id": "nm7351810",
      "name": "Rodrigo Orellana",
      "character": "Teniente Cuevas"
    },
    {
      "id": "nm7351811",
      "name": "Hellen Tabilo",
      "character": "Rosita"
    },
    {
      "id": "nm7351812",
      "name": "Demetrio Spataris",
      "character": "Profesor Toro"
    },
    {
      "id": "nm7351813",
      "name": "Verónica Power",
      "character": "La Toña"
    },
    {
      "id": "nm6008033",
      "name": "Nicolás de Terán",
      "character": "Flaco Jara"
    },
    {
      "id": "nm4779473",
      "name": "Sergio Monge",
      "character": "Tuerto Valdivia"
    },
    {
      "id": "nm10196081",
      "name": "Victor Toledo",
      "character": "Compañero Fierro"
    },
    {
      "id": "nm4983454",
      "name": "Brittany Star",
      "character": "Conspiradora transformista"
    },
    {
      "id": "nm10196082",
      "name": "Veronica Bracho",
      "character": "Conspiradora transformista"
    },
    {
      "id": "nm10196083",
      "name": "Casandra Wailler",
      "character": "Conspiradora transformista"
    },
    {
      "id": "nm10196084",
      "name": "Kiara Miller",
      "character": "Conspiradora transformista"
    },
    {
      "id": "nm10196085",
      "name": "Sasha Stewart",
      "character": "Conspiradora transformista"
    },
    {
      "id": "nm10196086",
      "name": "Yamilette Duval",
      "character": "Conspiradora transformista"
    },
    {
      "id": "nm10196087",
      "name": "Ricardo Zepeda",
      "character": "Capitán Pedraza"
    },
    {
      "id": "nm10196088",
      "name": "Tomas Alvarez",
      "character": "Carlitos y Luchito"
    },
    {
      "id": "nm10196089",
      "name": "Dilan Avendaño",
      "character": "Niño Jefe"
    },
    {
      "id": "nm10196090",
      "name": "Luis Izquierdo",
      "character": "Bomberos burlones"
    },
    {
      "id": "nm10196091",
      "name": "Patricio Jara",
      "character": "Bomberos burlones"
    },
    {
      "id": "nm10196092",
      "name": "Dagoberto Nuco",
      "character": "Bomberos burlones"
    },
    {
      "id": "nm10196093",
      "name": "Eduardo Perez",
      "character": "Empleado Municipal"
    },
    {
      "id": "nm10196094",
      "name": "Nelson Rojas",
      "character": "Minero Jefe"
    },
    {
      "id": "nm0797322",
      "name": "Alejandro Sieveking",
      "character": "Cura"
    },
    {
      "id": "nm2262197",
      "name": "Cristobal Valderrama",
      "character": "Cura Tarantula"
    },
    {
      "id": "nm1448486",
      "name": "Marcelo Alonso",
      "character": "Jefe Nazi"
    },
    {
      "id": "nm1152753",
      "name": "Sebastián Layseca",
      "character": "Vocero Nazi"
    },
    {
      "id": "nm1432468",
      "name": "Andrés Skoknic",
      "character": "Jefe Torturador"
    },
    {
      "id": "nm0667282",
      "name": "Gastón Pauls",
      "character": "Libertador 1"
    },
    {
      "id": "nm2372199",
      "name": "Francisco Pizarro Saenz de Urtury",
      "character": "Libertador 2       (as Cosmo Gonik)"
    },
    {
      "id": "nm2216749",
      "name": "Nicole Schonffeldt",
      "character": "Cabaret dancer"
    }
  ],
  "overview": "“Having broken away from my illusory self, I was desperately seeking a path and a meaning to life.” This phrase perfectly sums up Alejandro Jodorowsky’s biographical project: reconstituting the incredible adventure of his life. Alejandro Jodorowsky was born in 1929 in Tocopilla, a coastal town on edge of the Chilean desert, where this film was shot. It was there where he discovered the fundamentals of reality, as he underwent an unhappy and alienated childhood as part of an uprooted family.",
  "storyline": "Young Alejandro lives with his Jewish-Ukrainian parents Jaime and Sara in Tocopilla, Chile. Jaime is a communist who worships Stalin and raises his son with great severity. Sara sings rather than talks throughout the film, and believes Alejandro to be the reincarnation of her father because of his long blonde hair. Irritated by his wife's delusional views of their son and angered by Alejandro's behavior, which he views as cowardly and effeminate, Jaime cuts off Alejandro's hair, demands he repudiate the existence of God, and puts him through tests of self-control and bravery which include withstanding being tickled, slapped, and finally undergoing a dental operation without anesthetic. Satisfied with his son's bravery, Jaime acknowledges that he respects Alejandro and arranges for him to be made the mascot of the Tocopilla fire brigade. Alejandro accompanies the fire brigade to the scene of a fire where one of the firemen becomes trapped in the house and burns to death. During the ...",
  "plot": "Young Alejandro (Jeremías Herskovits) lives with his Jewish-Ukrainian parents Jaime (Brontis Jodorowsky) and Sara (Pamela Flores) in Tocopilla, Chile. Jaime is a communist who worships Stalin and raises his son with great severity. Sara sings rather than talks throughout the film, and believes Alejandro to be the reincarnation of her father because of his long blonde hair. Irritated by his wife's delusional views of their son and angered by Alejandro's behavior, which he views as cowardly and effeminate, Jaime cuts off Alejandro's hair (which is depicted as wig in what appears to be magic realism), demands he repudiate the existence of God, and puts him through tests of self-control and bravery which include withstanding being tickled, slapped, and finally undergoing a dental operation without anesthetic. Satisfied with his son's bravery, Jaime acknowledges that he respects Alejandro and arranges for him to be made the mascot of the Tocopilla fire brigade.\n\nAlejandro accompanies the fire brigade to the scene of a fire where one of the firemen becomes trapped in the house and burns to death. During the subsequent funeral procession, Alejandro imagines himself lying in the casket with the firemen's corpse, and collapses from fright. Jaime takes him home, but burns the mascot's uniform in front of Alejandro when he wakes up, again calling his son a coward and claiming he is ashamed of him. In an attempt to prove his own bravery to the other firefighters, who he fears look down on him because of his son's cowardice and his Jewish heritage, Jaime attempts to distribute water to plague victims quarantined outside the town, but they kill and eat his donkeys and he himself is infected. He walks back to his shop, visibly infected, and a stand-off with the army ensues. As Jaime goes into convulsions and the army threaten to burn the shop to contain the infection, Sara prays for Jaime's recovery and urinates on him, curing him.\n\nEnergized by his miraculous recovery, Jaime plans to assassinate the right-wing president Carlos Ibáñez del Campo (Bastian Bodenhofer). He agrees to work with another communist to assassinate Ibáñez at a dog show, but the gun fails and Jaime passes himself off as a hero when he jumps between Ibáñez and the gunman. To get close to Ibáñez, Jaime asks for a job as groom to the president's beloved horse Bucephalus as payment for his heroism. Jaime then poisons Bucephalus as part of his plot to kill Ibáñez, but when Jaime has Ibáñez at gunpoint, his hands become paralysed.\n\nThe story returns to Alejandro and Sara, and Sara begins teaching Alejandro how not to be afraid of darkness and how to make sure people don't notice him. She tells him that she knows in her heart that Jaime is alive and loves both of them. They tie a stone to a balloon and release it in the belief it will find its way to him. The rock is then shown falling on the roof of a shack which Jaime is living in. Jaime awakes to discover that he has lost his memory, that he is living with a diminutive peasant woman, and that his arms have been painted the colors of the Chilean flag.\n\nJaime begins a long journey home, but is captured by Nazis and tortured. Rebels free Jaime and return him to his family in Tocopilla. Jaime's hands are healed when Sara tells him \"You found in Ibáñez all you admired in Stalin. You are the same as they are! You have lived in the guise of a tyrant.\" Alejandro, Jaime, and Sara board a ship and leave Tocopilla.",
  "synopsis": "Produced and directed by Alejandro Jodorowsky, THE DANCE OF REALITY is his first film in 23 years.The legendary filmmaker was born in 1929 in Tocopilla, a coastal town on the edge of the Chilean desert where the film was shot. It was there that Jodorowsky underwent an unhappy and alienated childhood as part of an uprooted family.Blending his personal history with metaphor, mythology and poetry, The Dance of Reality reflects Alejandro Jodorowskys philosophy that reality is not objective but rather a dance created by our own imaginations."
}