{
  "imdb_id": "tt2375021",
  "tmdb_id": "395940",
  "douban_id": null,
  "title": "For My Brother (2014)",
  "genres": [
    "Drama"
  ],
  "country": "Denmark",
  "version": [
    {
      "runtime": "117 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm5020586",
      "name": "Brian Bang"
    }
  ],
  "writer": [
    {
      "id": "nm5020586",
      "name": "Brian Bang",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm5020706",
      "name": "Elias Munk",
      "character": "Aske /              Lasse's elder son"
    },
    {
      "id": "nm5020764",
      "name": "Christopher Friis Jensen",
      "character": "Bastian /              Lasse's younger son"
    },
    {
      "id": "nm5020759",
      "name": "Allan Karlsen",
      "character": "Lasse /              Aske and Bastian's father"
    },
    {
      "id": "nm3761002",
      "name": "Frank Schiellerup",
      "character": "Hans /              Lasse's friend"
    },
    {
      "id": "nm5020445",
      "name": "Oliver Bjørnholdt Spottag",
      "character": "Silas /              Aske's friend"
    },
    {
      "id": "nm1242969",
      "name": "Tina Nørby",
      "character": "Mor /              Aske and Bastian's mother"
    },
    {
      "id": "nm6115406",
      "name": "Frederik Ingemann Brandt",
      "character": "Aske /              10 år-yo"
    },
    {
      "id": "nm5018129",
      "name": "Lara León",
      "character": "Sasja /              Aske's schoolmate"
    },
    {
      "id": "nm5018907",
      "name": "Marie Louise Lund Jensen",
      "character": "Malene"
    },
    {
      "id": "nm5019156",
      "name": "Kit Langberg Rasmussen",
      "character": "Frederikke"
    },
    {
      "id": "nm5019851",
      "name": "William Gaarde",
      "character": "Andreas"
    },
    {
      "id": "nm4936674",
      "name": "Robin Koch",
      "character": "Philip"
    },
    {
      "id": "nm5019737",
      "name": "Oliver Skou",
      "character": "Magnus       (as Oliver Skou Due)"
    },
    {
      "id": "nm5028437",
      "name": "Dorte Evalyn Evon",
      "character": "Karen /              Blond woman at bar"
    },
    {
      "id": "nm3517630",
      "name": "Tobias Hyttel",
      "character": "William"
    },
    {
      "id": "nm5109424",
      "name": "Caroline Birch",
      "character": "Pige"
    },
    {
      "id": "nm6406673",
      "name": "Jonathan Tage Pedersen",
      "character": "Bastian /              5 år-yo"
    },
    {
      "id": "nm4456316",
      "name": "Lado Hadzic",
      "character": "Kraftig Mand /              Powerful Man"
    },
    {
      "id": "nm4115120",
      "name": "Ole Dupont",
      "character": "Militær Mand /              Military Man"
    },
    {
      "id": "nm4114399",
      "name": "Svetlana Fedorova",
      "character": "Betalende Kunde /              Paying Customer"
    },
    {
      "id": "nm5029248",
      "name": "Lone Lis Andersen",
      "character": "Farmor /              Grandmother"
    },
    {
      "id": "nm5029860",
      "name": "Jørgen Bregenborg",
      "character": "Mand På Havnen /              Man at the Harbor"
    },
    {
      "id": "nm5029100",
      "name": "Henrik B. Lützen",
      "character": "Williams far /              William's father"
    },
    {
      "id": "nm6509249",
      "name": "Dorte Luna Dalgård",
      "character": "Socialrådgiver /              Social worker"
    },
    {
      "id": "nm1736496",
      "name": "Jan Sommer Hansen",
      "character": "Socialrådgiver /              Social worker"
    },
    {
      "id": "nm6509248",
      "name": "Berit Petersen",
      "character": "Efterforsker /              investigator"
    },
    {
      "id": "nm6509250",
      "name": "Christian Kejser Birkedal",
      "character": "Efterforsker /              investigator"
    },
    {
      "id": "nm5109428",
      "name": "Susann Cornelius",
      "character": "Bodega Mutter"
    },
    {
      "id": "nm2058319",
      "name": "Anders Due-Boje",
      "character": "Radio Speaker"
    },
    {
      "id": "nm5076229",
      "name": "Palle Nielsen",
      "character": "Politibetjent /              police officer       (as Palle Verner Nielsen)"
    },
    {
      "id": "nm5076806",
      "name": "Son Sebastian Gamdrup",
      "character": "Politibetjent /              police officer"
    },
    {
      "id": "nm5076462",
      "name": "Malena Rostkjær",
      "character": "Politibetjent /              police officer       (as Malena Rostkær)"
    },
    {
      "id": "nm5400054",
      "name": "Johnny Melin",
      "character": "Billist"
    },
    {
      "id": "nm5076266",
      "name": "Michael Hansen",
      "character": "Dreamboy DVD cover"
    },
    {
      "id": "nm1589265",
      "name": "Gitte Pedersen",
      "character": "Dreamboy DVD cover"
    },
    {
      "id": "nm5076378",
      "name": "Torben Andreas Molbech Jessen",
      "character": "Dreamboy DVD cover"
    },
    {
      "id": "nm5075995",
      "name": "Mats Ödman",
      "character": "Dreamboy DVD cover"
    }
  ],
  "overview": "The two brothers Aske (17 years old) and Bastian (12 years old) live with their father, Lasse. Their mother died seven years earlier. Every day they live in a world where fear, violence and alcohol are huge factors, but where the brothers' strong and close relationship means everything. Aske's fight for survival means that he has to serve his father's sexual needs, which include abuse from the father, but also from paying customers and the father's friend Hans (who has a lot of contacts in the pedophile environment). Aske tries everything to keep his little brother out of it all so that he won't experience the same as himself. But one day Bastian is abused by their father and Aske's entire world is about to fall apart. The brothers choose to move to Norway, far away in the beautiful mountains. Their friendship outshines everything! They are together and far away from their evil father...",
  "storyline": "Aske (17) and Bastian's (12) mother died in a traffic accident seven years earlier while trying to save Aske from a rape by a friend of her husband's. The two brothers live with their father, Lasse. Every day they live in a world where fear, violence and alcohol are huge factors, but where the brothers' strong and close relationship means everything. Aske's fight for survival means that he has to serve his father's sexual needs, which include abuse from the father, but also from paying customers and the father's friend Hans (who has a lot of contacts in the pedophile environment). Aske tries everything to keep his little brother out of it all so that he won't experience the same as himself. But one day Bastian is abused by their father and Aske's entire world is about to fall apart. The brothers choose to move to Norway, far away in the beautiful mountains to his best friend Silas' family's hut. Their friendship outshines everything. They are together and far away from their evil ...",
  "plot": "In 1954, Godzilla, an ancient alpha predator, is lured to an island in an attempt to kill it with a nuclear bomb. In 1999, Project Monarch scientists Ishiro Serizawa and Vivienne Graham investigate a colossal skeleton unearthed in a collapsed mine in the Philippines. They find two giant spores; one dormant and one hatched with a trail that leads to the sea. In Japan, the Janjira Nuclear Power Plant experiences unusual seismic activity; Supervisor Joe Brody sends his wife Sandra with a team of other technicians into the reactor. A tremor breaches the reactor, leaving Sandra and her team unable to escape while the plant collapses.\n\nFifteen years later in 2014, Joe's son Ford, a U.S. Navy explosive ordnance disposal officer, returns from a tour of duty to his family in San Francisco but has to immediately depart for Japan after Joe is detained for trespassing in the Janjira quarantine zone. Joe is determined to find out the cause of the Janjira meltdown and persuades Ford to accompany him to their old home in the quarantine zone to retrieve vital data. They successfully retrieve the data but are discovered by soldiers and taken to a secret facility in the power plant's ruins. After several power failures, a giant winged creature emerges and escapes, destroying the facility. Joe is severely wounded and dies as he and Ford are taken by helicopter to the U.S.S. Saratoga. The incident is reported around the world as an earthquake.\n\nSerizawa, Graham, and Ford join a U.S. Navy task force led by Admiral William Stenz to search for the creature, called a \"MUTO\" (Massive Unidentified Terrestrial Organism). Serizawa and Graham reveal to Ford that a 1954 deep sea expedition triggered the appearance of Godzilla and nuclear tests in the 1950s were really attempts to kill him. Project Monarch was established to secretly study Godzilla and other similar creatures such as the MUTO, traveled from the Philippine mine to Janjira and caused the meltdown, and how they are connected with each other. Ford reveals that Joe had monitored echolocation signals that indicated the MUTO was communicating with something.\n\nThe MUTO attacks a Russian submarine and drops it on land in Hawaii to eat the sub's nuclear material. Godzilla arrives, causing a tsunami in Honolulu and briefly engages the MUTO in battle, until it flees. Meanwhile, a second, larger, wingless MUTO emerges from the other spore in Nevada and devastates Las Vegas. The scientists deduce the second MUTO is female, the female was the one the male was communicating with, and that the two MUTOs will meet to breed in San Francisco. Over the scientists' objections, Stenz approves a plan to use nuclear warheads to lure and destroy the monsters. Ford returns to the U.S. and ends up joining the team delivering the warheads by train, but the female MUTO intercepts the train and devours most of the warheads. The single remaining warhead is airlifted with Ford to San Francisco and is activated after a confrontation between the military and Godzilla at the Golden Gate Bridge. The male MUTO steals the warhead and takes it to the female, who forms a nest around it in the Chinatown area.\n\nWhile Godzilla and the MUTOs battle, a strike team, including Ford, enters the city via HALO jump to find and disarm the warhead. Unable to access the timer, the rest of the team sets the warhead on a boat for disposal at sea. The MUTOs are eventually able to get the upper hand, but Ford blows up the MUTO nest, ultimately distracting the MUTOs enough to allow Godzilla to emerge victorious in the end, killing the male MUTO by slamming him with his tail into the side of an office building and the female by firing his atomic breath down her throat, beheading her. Godzilla then collapses on the city shore. With the rest of the team wiped out, Ford uses the last of his energy to get the boat with the warhead out to sea. He is rescued before the warhead explodes and reunites with his family at the Oakland Coliseum emergency shelter the following morning. Godzilla awakens, rising from the destroyed San Francisco, and returns to sea while the media hails Godzilla as \"King of the Monsters - savior of our city?\".",
  "synopsis": null
}