{
  "imdb_id": "tt2393845",
  "tmdb_id": "237756",
  "douban_id": null,
  "title": "Kill Me Three Times (2014)",
  "genres": [
    "Action",
    "Comedy",
    "Crime",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.9,
  "director": [
    {
      "id": "nm0826541",
      "name": "Kriv Stenders"
    }
  ],
  "writer": [
    {
      "id": "nm5062671",
      "name": "James McFarland",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0670408",
      "name": "Simon Pegg",
      "character": "Charlie Wolfe"
    },
    {
      "id": "nm0494424",
      "name": "Steve Le Marquand",
      "character": "Sam"
    },
    {
      "id": "nm0103797",
      "name": "Alice Braga",
      "character": "Alice Taylor"
    },
    {
      "id": "nm1954240",
      "name": "Teresa Palmer",
      "character": "Lucy Webb"
    },
    {
      "id": "nm0822982",
      "name": "Sullivan Stapleton",
      "character": "Nathan Webb"
    },
    {
      "id": "nm1292661",
      "name": "Luke Hemsworth",
      "character": "Dylan Smith"
    },
    {
      "id": "nm0612534",
      "name": "Callan Mulvey",
      "character": "Jack Taylor"
    },
    {
      "id": "nm0000986",
      "name": "Bryan Brown",
      "character": "Bruce Jones"
    }
  ],
  "overview": "While on a seemingly routine job, a jaded hit man discovers that he's not the only one with his target in the crosshairs.",
  "storyline": "Professional hit-man Charlie Wolfe finds himself in three tales of murder, blackmail and revenge after a botched contract assignment.",
  "plot": "In Eagles Nest, Western Australia, a wealthy motel proprietor Jack Taylor believes his wife Alice to be having an affair. After a violent argument, Jack hires Charlie Wolfe, a private investigator and contract killer. When Charlie returns with video proof Alice is having sex with Dylan Smith, Jack orders Charlie to kill her. Alice makes an appointment with dentist Nathan Webb to work on her tooth, which Jack chipped when he hit her. Jack tells Charlie about Alice's dentist appointment. Before she leaves, Alice sneaks into Jack's office and robs his safe.\n\nCharlie is amused to see Nathan and his receptionist wife Lucy drug Alice, kidnap her, and eventually, after several mishaps, send her over a cliff in a flaming car. Charlie takes incriminating pictures of the acts. Lucy finds Jack's stolen money in Alice's bag and takes it before trying to kill her. Unknown to all involved, Alice wakes up in time to escape the car before it crashes and explodes. Satisfied that Alice is dead, Charlie returns to Jack for payment, not telling him that the hit was carried out by other people. When Jack finds his safe empty, he immediately suspects Alice and Dylan. He reassures Charlie he has more money in the bank, and Charlie says he will return the next day.\n\nMeanwhile, Nathan and Lucy initiate their insurance fraud scheme by exchanging Lucy's dental records with Alice's, hoping to fool people into believing that Lucy died in the fiery car crash. Bruce Jones, a corrupt cop, immediately recognizes the fraud, and while impressed that Nathan is able to murder to his own wife, demands half the payout to stay quiet. At the same time, Charlie anonymously blackmails Nathan with pictures of Alice's kidnapping and assumed death. Lucy pushes Nathan to pay the blackmailer and be done with it, and he reluctantly sets up a meeting.\n\nDylan confronts and kills Jack. Charlie returns to collect his money from Jack, only to find Jack dead. At the same time, Bruce stumbles upon Charlie at the crime scene. Charlie kills Bruce and leaves to meet with Nathan. Because he is the only one who can collect the insurance money, Nathan believes himself safe from harm. When Nathan is uncooperative, Charlie surprises Nathan by shooting him. As he dies, Nathan reveals the location of the money Alice stole from Jack, which he recovered during Alice's kidnapping. Charlie sneaks into Lucy's house, but, instead of killing her, reveals they are working together.\n\nLucy is upset that Charlie has killed Nathan, as she can no longer collect the insurance money on her own faked death. Charlie says he will not split the remaining money with her and leaves, though he tells her that she will now inherit Jack's hotel business, as he was her brother. When Dylan arrives, both Lucy and Charlie claim the other murdered Alice. Dylan shoots at Charlie, but Charlie deflects his aim so that the bullet strikes and kills Lucy. As Charlie prepares to kill Dylan, Alice sneaks up behind him and knocks him off the deck. Alice and Dylan leave with the money as Charlie weakly answers his phone to assure a client that he will make an appointment.",
  "synopsis": "Charlie Wolfe is a fixer who, in the middle of a murder, gets a call, to which he answers that he'll be there in an hour. Alice wakes up and arranges an appointment with her dentist Nathan through his wife/assistant Lucy. But instead, Nathan and Lucy drug Alice, kidnap her, and prepare to murder her, all the while Wolfe watches from afar. On the way to a quarry, Nathan stops for gas at Dylan's shop. He fills a liter water bottle with gas. As they prepare to burn Alice's VW bug, Nathan accidentally rolls it into the quarry. They prepare to switch Lucy into Lucy's car, but she wakes and gets away. Lucy pursues her and subdues her. Nathan and Lucy then put Alice in Lucy's car, put Lucy's jewelry on Lucy, set the car on fire, and let it roll into a ravine where it explodes. Driving Alice's car, Lucy spots money in Alice's bag under the seat and keeps it.In a flashback, Alice's husband Jack is jealous of Alice and suspicious that she's having an affair. Jack hires Wolfe to tail Alice, who had previously gone from Jack's place with Jack's money. Wolfe tails Alice and records Alice and Dylan having sex. The next day Wolfe shows the video to Jack, who is angry and tells Wolfe to kill Alice.Meanwhile a policeman, Bruce, who has been extorting money from Nathan and Lucy, comes and muscles out Nathans payment commitment. Wolfe follows Alice for the kill and he spots Nathan and Lucy on their scheme. Its shown that Alice actually wakes up and avoids the explosion. Nathan and Alice quarrel about Alice's money but they keep it. Wolfe meets Jack confirming Alice's death. Bruce finds Lucy's burning car and comes extorting extra money from Nathan. Nathan receives an anonymous message of someone seeing them carrying Alice's body. He then sets up a meeting with the sender, who is Wolfe. At the meeting Wolfe ends up killing Nathan, saying to him that hell complete the work by killing Lucy. Wolfe comes to collect his payment from Jack, Jack finds that his money is gone and assumes Alice has taken it.The next day, Dylan comes barging in asking about Alice disappearing. Dylan ends up killing Jack and leaves. Wolfe comes to Jack's after killing Nathan, only to find Jack dead. Bruce comes and finds Wolfe with Jacks corpse and Wolfe kills him. Dylan didn't really leave, and he follows Wolfe as soon as Wolfe come out of Jack's. Wolfe arrives at Nathan and Lucy's, where its revealed that Wolfe and Lucy had been conspiring together to get all the money, even though Lucy curses him for killing Nathan, which prevents them from claiming the insurance money from killing Alice. They quarrel, and Wolfe says hes leaving her. At the door Dylan comes pointing a gun at Wolfe, but Wolfe slaps Dylan's hand, making him shoot Lucy dead. Wolfe shoots Dylan, but only hits his shoulder. Alice comes out of nowhere and clobbers Wolfe with an ax. Alice and Dylan leave with Jacks money.Wolfe is badly wounded, but he is still miraculously able to talk on phone and get another job."
}