{
  "imdb_id": "tt2305090",
  "tmdb_id": "146353",
  "douban_id": null,
  "title": "Black Really Suits You (2012)",
  "genres": [
    "Drama"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "88 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm0104146",
      "name": "Jacques Bral"
    }
  ],
  "writer": [
    {
      "id": "nm0104146",
      "name": "Jacques Bral",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3809653",
      "name": "Sofiia Manousha",
      "character": "Cobra       (as Sofia Manousha)"
    },
    {
      "id": "nm0853390",
      "name": "Lounès Tazairt",
      "character": "Moncef       (as Lounès Tazaïrt)"
    },
    {
      "id": "nm0062359",
      "name": "Julien Baumgartner",
      "character": "Serge"
    },
    {
      "id": "nm1228072",
      "name": "Grégoire Leprince-Ringuet",
      "character": "Richard"
    },
    {
      "id": "nm3921940",
      "name": "Elise Lhomeau",
      "character": "Anaïs"
    },
    {
      "id": "nm0024850",
      "name": "Souad Amidou",
      "character": "Maléké"
    },
    {
      "id": "nm0444248",
      "name": "Salim Kechiouche",
      "character": "Rachid"
    },
    {
      "id": "nm0508293",
      "name": "Thierry Lhermitte",
      "character": "François"
    },
    {
      "id": "nm0013247",
      "name": "Sid Ahmed Agoumi",
      "character": "Rachid"
    },
    {
      "id": "nm0723632",
      "name": "Delphine Rich",
      "character": "Hélène-Laure"
    },
    {
      "id": "nm0098799",
      "name": "Magid Bouali",
      "character": "Majid"
    },
    {
      "id": "nm4775209",
      "name": "Lisa Makhedjouf",
      "character": "Salima"
    }
  ],
  "overview": "The life of a Middle-East family of immigrants in Europe.  The father carries the heavy burden of banishment. To rescue his culture, his traditions, is  mandatory, so he remains faithful to his past, his origins, to himself.  His daughter is now a grown-up. He worries and wishes she would get married soon.  The young woman leaves the family home every morning, but changes her clothes in a bar  before she goes to work, her hair down.  She puzzles the young boss of the company that employs her. He fell in love and is ready to  do anything to marry her. But the young woman keeps her freedom of choice, just like her  mother had done with her father.  She won’t have time to introduce the only man for her to her parents. A friend of her  father’s catches them. In a cafe.",
  "storyline": "The life of a Middle-East family of immigrants in Europe. The father carries the heavy burden of banishment. To rescue his culture, his traditions, is mandatory, so he remains faithful to his past, his origins, to himself. His daughter is now a grown-up. He worries and wishes she would get married soon. The young woman leaves the family home every morning, but changes her clothes in a bar before she goes to work, her hair down. She puzzles the young boss of the company that employs her. He fell in love and is ready to do anything to marry her. But the young woman keeps her freedom of choice, just like her mother had done with her father. She won't have time to introduce the only man for her to her parents. A friend of her father's catches them. In a café.",
  "plot": "Cobra is the daughter of a Muslim immigrant family in France. Her father Moncef wants to marry her to a Muslim. Her boss is in love with her. She wants to choose herself. One day a friend of her father surprises her in the café where she uses to change her clothes and take off her veil after she leaves home.",
  "synopsis": null
}