{
  "imdb_id": "tt2367954",
  "tmdb_id": "147957",
  "douban_id": null,
  "title": "Strip Mahjong: Battle Royale (2011)",
  "genres": [
    "Horror",
    "Thriller"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "77 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.0,
  "director": [
    {
      "id": "nm6128139",
      "name": "Mac P. Forever"
    }
  ],
  "writer": [
    {
      "id": "nm5247347",
      "name": "Ryosuke Oomine",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2937406",
      "name": "Hiroaki Kawatsure",
      "character": ""
    },
    {
      "id": "nm5247132",
      "name": "Nina",
      "character": ""
    },
    {
      "id": "nm6207011",
      "name": "Anzu Sasaki",
      "character": ""
    },
    {
      "id": "nm5247847",
      "name": "Kaori Sasaki",
      "character": ""
    },
    {
      "id": "nm5248457",
      "name": "Runa Shimotsuki",
      "character": ""
    },
    {
      "id": "nm4273062",
      "name": "Hitomi Usano",
      "character": ""
    },
    {
      "id": "nm4098440",
      "name": "Yuzu Yamanashi",
      "character": "(as Mako Higashio)"
    }
  ],
  "overview": "A handful of mysterious Japanese women take part in a deranged web show that makes them strip off their clothes when they lose a round of Mahjong. When there is nothing left to hide, secrets are revealed and they must take their punishment.",
  "storyline": "A handful of mysterious Japanese women take part in a deranged web show that makes them strip off their clothes when they lose a round of Mahjong. When there is nothing left to hide, secrets are revealed and they must take their punishment.",
  "plot": "Japanese middle school student Shuya Nanahara copes with life after his father's suicide. Meanwhile, schoolmate Noriko Nakagawa is the only student attending class 3-B. Their teacher, Kitano, resigns after being impulsively attacked by a student.\n\nOne year later, class 3-B takes a field trip, but they are gassed, fitted with electronic collars, and sent to a \"briefing room\" on a remote island. Kitano explains that the class has been chosen to participate in the annual Battle Royale as a result of the BR Act, which was passed after 800,000 students walked out of school. A cheerful orientation video instructs the class they have three days to kill each other until only one remains. The explosive collars will kill any uncooperative students or those within daily \"danger zones\". Kitano kills two students, Fumiyo Fujiyoshi and Yoshitoki Kuninobu (Shuya's best friend), for misbehavior during the video. Each student is provided a bag of food and water, map of the island, compass, and a weapon ranging in efficiency from firearms to a paper fan.\n\nThe first six hours see twelve deaths, four by suicide. Mitsuko Souma and mute transfer student Kazuo Kiriyama soon become the most dangerous players. Another transfer student, Shogo Kawada, seems somewhat more merciful, and Shinji Mimura plots to hack into the military's computer system. Amid shifting loyalties and violent confrontations, Shuya promises to keep Noriko safe, because his friend secretly loved her. Shuya carries Noriko to a clinic after she collapses, where they encounter Kawada, who reveals that he won a previous Battle Royale at the cost of his girlfriend, whose death he seeks to avenge. When Kiriyama attacks, Shuya entrusts Kawada to protect Noriko and runs off as a distraction. Although saved by Hiroki Sugimura, he is wounded.\n\nShuya awakens in the island's lighthouse, bandaged by female class representative Yukie Utsumi, who has a crush on him. Five other girls from her clique have also been hiding out in the building, including Yuko Sakaki, who attempts to poison Shuya only for another girl to accidentally eat the food. Yuko is the only survivor of the ensuing shootout; despondent, she apologises to Shuya and commits suicide. Shuya returns to Noriko and Kawada, and they set out to find Mimura. Of the seven students remaining, all except Kiriyama are attempting or willing to subvert the game. Mimura and two others, Yutaka Seto and Keita Iijima, infiltrate the military's computer system, but Kiriyama finds and kills them. When Kawada, Noriko and Shuya arrive at the hackers' burning base, Kawada confronts and kills Kiriyama, who had been blinded by an explosion rigged by Mimura as he was killed.\n\nOn the morning of the final day, Kawada, aware of the collars' internal microphones, takes Shuya and Noriko aside and fakes their deaths. Suspicious, Kitano ends the game and dismisses the troops, intent on personally killing the supposed victor. Kitano realizes that Kawada had hacked into the game's system months beforehand, and has now disabled Shuya and Noriko's tracking devices. The three survivors confront Kitano in the headquarters, and he unveils a disturbing homemade painting of the massacred class that depicts Noriko as sole survivor. He reveals that he was unable to bear the hatred between him and his students, having been rejected by his daughter. He confesses that he always thought of Noriko as a daughter and asks her to kill him, but Shuya shoots Kitano after he threatens Noriko with a gun. As he falls, Kitano shoots, revealing the gun to be a water gun. As he dies, Kitano angrily takes a call from his daughter and rebukes her.\n\nShuya, Noriko and Kawada leave the island on a boat, but Kawada dies from injuries sustained in his gunfight with Kiriyama, happy that in the end, he \"found true friends.\" Shuya and Noriko are declared fugitive murderers, and are last seen on the run in the direction of Tokyo's Shibuya train station. Noriko gives Shuya a Seto Dragon Claw balisong butterfly knife before they run off together.",
  "synopsis": null
}