{
  "imdb_id": "tt2308711",
  "tmdb_id": "205047",
  "douban_id": null,
  "title": "Healed by Grace (2012)",
  "genres": [
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "111 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm4451899",
      "name": "David Matthew Weese"
    }
  ],
  "writer": [
    {
      "id": "nm4451899",
      "name": "David Matthew Weese",
      "description": "as David Weese"
    },
    {
      "id": "nm4452652",
      "name": "Natalie Weese",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3859237",
      "name": "Tommy Beardmore",
      "character": "Casey"
    },
    {
      "id": "nm3639855",
      "name": "Larry Bower",
      "character": "Gauff"
    },
    {
      "id": "nm3482371",
      "name": "Mark S. Esch",
      "character": "Ed"
    },
    {
      "id": "nm5667572",
      "name": "Dija Henry",
      "character": "Lily"
    },
    {
      "id": "nm2782263",
      "name": "Sharon Nelson",
      "character": "Melinda Baldwin"
    },
    {
      "id": "nm4451837",
      "name": "April Oberlin",
      "character": "Aleah Adams"
    },
    {
      "id": "nm3017322",
      "name": "LaDonna Pettijohn",
      "character": "Lexis"
    },
    {
      "id": "nm4452652",
      "name": "Natalie Weese",
      "character": "Riley"
    },
    {
      "id": "nm0928933",
      "name": "Michael Wilhelm",
      "character": "Michael Adams"
    },
    {
      "id": "nm7841108",
      "name": "Sam Williams",
      "character": "Sleeping Guy"
    }
  ],
  "overview": "For all her life, Riley Adams has dreamed of being a world class dancer. Victory in regional competition has gained her a coveted shot at the nationals, but a horrific accident brings her dreams to a standstill.  She is faced with the greatest setback of her life, yet Riley clings to her faith, determined to recover in time for the national competition.  Turning to equine therapy to regain mobility, she discovers a special bond with a beautiful mare named Grace, and a most unexpected burgeoning romance as well! Just when it seems the old Riley is back, disaster strikes and it seems all her efforts will come to nothing. That is, until God's grace appears from a most unexpected place.  Healed By Grace is a charming, romantic, and heart wrenching journey of faith that will take you from the excitement of elite dance competition to the heartwarming horse ranch where Riley rediscovers her will to succeed.",
  "storyline": "College sophomore Riley Adams dreams of being a world class elite dancer, believing her success can be a platform to share her Christian faith. Being raised in a single parent home, she's replaced the absence of her mother with the illusion of control, by learning to drive toward success by giving 150% all the time.. Victory in regional competition has gained her a coveted shot at the nationals, but a horrific accident brings her dreams to a halt and her illusion of control to a standstill. For the first time in her life, no amount of effort can affect change - at least not fast enough for Riley, who still believes she can recover in time for nationals. Equine therapy may help Riley gain full mobility, and true to character, Riley throws herself headlong into the process (spurred along a bit by an attractive and charming therapist). Through the process Riley develops a bond with a beautiful horse named Grace, and rediscovers her drive to succeed. Just when it seems the old Riley is ...",
  "plot": null,
  "synopsis": null
}