{
  "imdb_id": "tt2361602",
  "tmdb_id": "261815",
  "douban_id": null,
  "title": "Five Star (2014)",
  "genres": [
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "83 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.4,
  "director": [
    {
      "id": "nm2142624",
      "name": "Keith Miller"
    }
  ],
  "writer": [
    {
      "id": "nm2142624",
      "name": "Keith Miller",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm5242079",
      "name": "James 'Primo' Grant",
      "character": "Primo"
    },
    {
      "id": "nm3723632",
      "name": "John Diaz",
      "character": "John"
    },
    {
      "id": "nm4677804",
      "name": "Wanda Nobles Colon",
      "character": "John's Mom"
    },
    {
      "id": "nm6095428",
      "name": "Jasmine Burgos",
      "character": "Jasmin"
    },
    {
      "id": "nm5172724",
      "name": "Richard Bird",
      "character": "Gun Dealer"
    },
    {
      "id": "nm0091497",
      "name": "Larry Bogad",
      "character": "Bar Owner"
    },
    {
      "id": "nm6338483",
      "name": "Lisette Finevelvet",
      "character": "Titi Dee Dee"
    },
    {
      "id": "nm4005031",
      "name": "Jaiden Kaine",
      "character": "Jay"
    },
    {
      "id": "nm5601213",
      "name": "John Reese",
      "character": "Bodega Dealer #2"
    },
    {
      "id": "nm5950620",
      "name": "Tamara Robinson",
      "character": "Tamara"
    },
    {
      "id": "nm5906078",
      "name": "C.T. Taylor",
      "character": "Cholo"
    }
  ],
  "overview": "After John’s absent father is struck by a stray bullet, Primo takes it upon himself to verse the young boy in the code of the streets—one founded on respect and upheld by fear. A member of the Bloods since the age of twelve—both in the film and in reality—the streets of Brooklyn are all Primo has ever known. While John questions whether or not to enter into this life, Primo must decide whether to leave it all behind as he vows to become a better husband and father. Set during those New York summer weeks where the stifling heat seems to encase everything, Five Star plunges into gang culture with searing intensity. Director Keith Miller observes the lives of these two men with a quiet yet pointed distance, carefully eschewing worn clichés through its unflinching focus. Distinctions between fiction and real life remain intentionally ambiguous, allowing the story of these two men to resonate beyond the streets, as they face the question of what it means to be a man.",
  "storyline": "A member of the notorious Bloods since he was 12 years old - both in the film and in real life - Primo takes John, the son of his slain mentor, under his wing, versing him in the code of the streets. Set in East New York, FIVE STAR blends documentary and fictional storytelling as director Keith Miller carefully avoids worn clichés of gang culture to offer a compelling portrait of two men forced to confront the question of what it really means to be a man.",
  "plot": null,
  "synopsis": null
}