{
  "imdb_id": "tt2304933",
  "tmdb_id": "299687",
  "douban_id": "25866686",
  "title": "The 5th Wave (2016)",
  "genres": [
    "Action",
    "Adventure",
    "Drama",
    "Fantasy",
    "Sci-Fi",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "112 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.2,
  "director": [
    {
      "id": "nm2128335",
      "name": "J Blakeson"
    }
  ],
  "writer": [
    {
      "id": "nm0335666",
      "name": "Susannah Grant",
      "description": "screenplay and"
    },
    {
      "id": "nm0326040",
      "name": "Akiva Goldsman",
      "description": "screenplay &"
    },
    {
      "id": "nm0684374",
      "name": "Jeff Pinkner",
      "description": "screenplay"
    },
    {
      "id": "nm2130099",
      "name": "Rick Yancey",
      "description": "novel"
    }
  ],
  "cast": [
    {
      "id": "nm1631269",
      "name": "Chloë Grace Moretz",
      "character": "Cassie Sullivan"
    },
    {
      "id": "nm2832703",
      "name": "Matthew Zuk",
      "character": "Wounded Man with Crucifix"
    },
    {
      "id": "nm4388400",
      "name": "Gabriela Lopez",
      "character": "Lizbeth"
    },
    {
      "id": "nm3173395",
      "name": "Bailey Anne Borders",
      "character": "Julia       (as Bailey Borders)"
    },
    {
      "id": "nm3538718",
      "name": "Nick Robinson",
      "character": "Ben Parish"
    },
    {
      "id": "nm0515296",
      "name": "Ron Livingston",
      "character": "Oliver Sullivan"
    },
    {
      "id": "nm1745019",
      "name": "Maggie Siff",
      "character": "Lisa Sullivan"
    },
    {
      "id": "nm6236879",
      "name": "Zackary Arthur",
      "character": "Sam Sullivan"
    },
    {
      "id": "nm1296223",
      "name": "David Maldonado",
      "character": "Soccer Coach       (as Dave Maldonado)"
    },
    {
      "id": "nm0753077",
      "name": "Paul Ryden",
      "character": "TV News Anchor"
    },
    {
      "id": "nm0593301",
      "name": "E. Roger Mitchell",
      "character": "White House Spokesman"
    },
    {
      "id": "nm0496980",
      "name": "Charmin Lee",
      "character": "Ms. Paulson"
    },
    {
      "id": "nm4745775",
      "name": "Parker Wierling",
      "character": "Jeremy"
    },
    {
      "id": "nm7117356",
      "name": "Madison Staines",
      "character": "Teary School Kid"
    },
    {
      "id": "nm1727825",
      "name": "Tony Revolori",
      "character": "Dumbo"
    },
    {
      "id": "nm0785352",
      "name": "Terry Serpico",
      "character": "Hutchfield"
    },
    {
      "id": "nm0000630",
      "name": "Liev Schreiber",
      "character": "Colonel Vosch"
    },
    {
      "id": "nm4920608",
      "name": "Derek Roberts",
      "character": "Private Parker"
    },
    {
      "id": "nm3241113",
      "name": "Geoffrey Kennedy",
      "character": "Bullhorn Soldier"
    },
    {
      "id": "nm2406530",
      "name": "Devin McGee",
      "character": "Confused Man"
    },
    {
      "id": "nm7846349",
      "name": "Justin Smith",
      "character": "Armed Man"
    },
    {
      "id": "nm1792087",
      "name": "James Sutton",
      "character": "Soldier Calling Numbers"
    },
    {
      "id": "nm0004742",
      "name": "Maria Bello",
      "character": "Sergeant Reznik"
    },
    {
      "id": "nm3876459",
      "name": "Adora Dei",
      "character": "Exam Room Tech"
    },
    {
      "id": "nm4114414",
      "name": "Kevin L. Johnson",
      "character": "Sniper in Woods       (as Kevin Johnson)"
    },
    {
      "id": "nm5145057",
      "name": "Talitha Eliana Bateman",
      "character": "Teacup"
    },
    {
      "id": "nm3322658",
      "name": "Cade Canon Ball",
      "character": "Oompa"
    },
    {
      "id": "nm5879880",
      "name": "Alex MacNicoll",
      "character": "Flintstone"
    },
    {
      "id": "nm2684036",
      "name": "Nadji Jeter",
      "character": "Poundcake"
    },
    {
      "id": "nm2140860",
      "name": "Maika Monroe",
      "character": "Ringer"
    },
    {
      "id": "nm6758532",
      "name": "Flynn McHugh",
      "character": "Tank"
    },
    {
      "id": "nm1025139",
      "name": "Alex Roe",
      "character": "Evan Walker"
    },
    {
      "id": "nm2298278",
      "name": "Courtney Munch",
      "character": "Helicopter Soldier"
    },
    {
      "id": "nm1366703",
      "name": "Kendrick Cross",
      "character": "Situation Room Soldier"
    },
    {
      "id": "nm4123582",
      "name": "Chelsea Hayes",
      "character": "Tech Soldier"
    },
    {
      "id": "nm2689261",
      "name": "Michael Beasley",
      "character": "Major Bob"
    }
  ],
  "overview": "16-year-old Cassie Sullivan tries to survive in a world devastated by the waves of an alien invasion that has already decimated the population and knocked mankind back to the Stone Age.",
  "storyline": "Four waves of increasingly deadly attacks have left most of Earth in ruin. Against a backdrop of fear and distrust, Cassie is on the run, desperately trying to save her younger brother. As she prepares for the inevitable and lethal fifth wave, Cassie teams up with a young man who may become her final hope - if she can only trust him.",
  "plot": "Ohio high-schooler Cassie Sullivan, armed with an M4 carbine, emerges from the woods to raid an abandoned gas station. Upon entering, she hears a male voice calling for help. She finds a wounded man, who points a gun at her, but they each put their weapons down. His hand is under his jacket and as he takes it out, she sees a glint of metal and kills him. He was holding a crucifix and the screen cuts to black to show her backstory.\n\nA city-sized alien spaceship is circling Earth containing extraterrestrials referred to as \"The Others.\" Ten days later, The Others unleash their 1st Wave, an electromagnetic pulse that permanently destroys all electrical power, including vehicles and causing flying aircraft to fall. The 2nd Wave has The Others manipulate the Earth's fault lines, causing earthquakes and tsunamis that kill those living in coastal cities. For the 3rd Wave, The Others weaponize a strain of avian flu, using birds as carriers of the virus killing Cassie's mother.\n\nCassie, her father and her younger brother, Sam, find a refugee camp in the woods with roughly 300 survivors. A few days later, an army unit with working vehicles rolls into the camp. The unit's commander, Colonel Vosch, claims there is an imminent threat of a 4th Wave and they will take the children to safety at Wright-Patterson Air Force Base, intending to bring the buses back to retrieve the adults. Cassie is separated from Sam, and witnesses the adults being massacred by the army.\n\nCassie scavenges her way toward the base, but is shot in the leg by an unseen enemy and passes out. About a week later, she wakes up in the farmhouse of Evan Walker, who saved her. Cassie leaves towards the base with Evan, but learns that he is an Other, sent years ago as a sleeper agent and merged his consciousness into a human host. The sleepers roam their designated zones, killing human survivors. Evan admits his humanity was reactivated when he saw her, disagrees with the invasion and lets her leave. He warns that Colonel Vosch and the military are possessed by the consciousness of individual Others.\n\nAt the base, the military have used deception and technology to convince the rescued children that the humans outside the base have been possessed. They provide military training to the children, forming them into squads to go on kill missions outside the base. Sam has been placed into a squad led by Ben, a boy Cassie had a crush on, along with Ringer, a tough teenager, Dumbo and Teacup. While out on a kill mission, Ringer removes her military implant, causing her to register as an Other-possessed human on the squad's scopes. The squad deduces the plan to have them kill real humans, making them the 5th Wave. Ben sends his squad into the woods and returns to base, claiming his squad was killed, for the purpose of retrieving Sam, who was left behind.\n\nBen confronts Colonel Vosch about child warriors being the 5th Wave and Cassie kills Sergeant Reznik during her one-on-one indoctrination spiel. Ben and Cassie find each other and leave to find Sam. Evan sets off numerous bombs and advises them to quickly find Sam before the destruction of the entire facility. Colonel Vosch and the surviving military evacuate with the human children by military aircraft. Cassie, Ben, and Sam escape, with help from Ringer, just as Evan completes the destruction of the base. Ben's squad is reunited and Cassie ponders the strength of hope as humanity's driving force for survival.",
  "synopsis": "In the opening scene, Cassie Sullivan (Chloe Grace Moretz) is walking through the woods with a gun in her hands. She comes across an empty store and takes what little supplies she can get her hands on. A voice is heard calling for help. Cassie finds a man hidden in the back. They both have their guns aimed at each other. The man lowers his gun but Cassie won't lower hers because the man is holding something in his hand. She orders him to show what's in his hand, but when he does, a light flashes from it and startles Cassie, prompting her to shoot the man. She sees that he was holding a crucifix, and she is horrified at what she's done.Several months earlier....Cassie was a regular 15-year-old teenager in high school girl. She lived with her parents Oliver (Ron Livingston) and Lisa (Maggie Siff), and her little brother Sam (Zackary Arthur) in a suburb of Cleveland, Ohio. Her best friend was Lizbeth (Gabriela Lopez) and she had a crush on football player Ben Parish (Nick Robinson). Soon, however, everything changed as a mysterious alien spaceships descended and remained hovering above everyone for a number of days without movement. The humans would come to refer to these visitors as \"The Others\".The Others unleash the first wave, which is an electromagnetic pulse that wipes out all the power on Earth. Planes fall from the sky and kill countless people. Without a fresh water supply, Cassie and Sam have to gather water from a nearby lake.The second wave brings powerful earthquakes and devastating tsunamis to coastal cities, killing even more people.The third wave has the Others modifying the avian flu, which infects people like Lizbeth and even Lisa. Cassie, Sam, and Oliver bury Lisa in the front yard of their house and say goodbye to her.The three head to a survivors camp. After a few days of residing in the camp, a large cloud of dust forms, and from it emerge military men in vans, led by Colonel Vosch (Liev Schrieber). He says he's there to help them. They gather all the children and send them on a bus to a safe location. Oliver reluctantly lets Cassie and Sam go. Sam forgets his teddy bear, so Cassie runs off the bus to grab it. The buses start driving away before Cassie can make it back.Vosch tells the adults that the fourth wave has begun. The Others have begun to use humans as physical hosts, inciting anger and panic among the adults that demand to know how they can tell who is really an Other. A gunfight breaks out, and nearly every adult is killed, including Oliver. Cassie mourns her father and proceeds to move forward on her own.The kids arrive at Camp Haven, a military training facility. Ben and Sam are among those that are recruited. They are given new nicknames as well - Ben is \"Zombie\" and Sam is \"Nugget\". Ben meets Sergeant Reznik (Maria Bello). She injects a tracker in the back of his neck and sits him down in front of a two-way mirror where a boy is hooked up to a chair. Reznik says the boy is really an Other. She shows Ben through a lens that the boy has a green skull, then gives Ben a button to kill the boy. Reznik sees that Ben is wearing his dead sister's necklace, using it as motivation to push Ben to press the button, which he does.Cassie carries a gun that her father gave her before he died. She arrives at the abandoned convenience store in the opening scene and is forced to shoot and kill the wounded man as seen before. Next, Cassie walks through an abandoned freeway littered with many abandoned cars and sees many dead bodies. A shot is fired, hitting Cassie in the leg. More gunfire is heard, and Cassie crawls to safety under one of the cars before she passes out from blood loss.Meanwhile, Ben and the other kids start their training. He befriends another kid named Dumbo (Tony Revolori), and they are presented with a girl called Ringer (Maika Monroe), who is tough and takes crap from no one. She is an excellent shot, and she teaches the kids how to shoot after Ben takes her down during training.Cassie wakes up to find herself in the care of a young man named Evan Walker (Alex Roe). He tends to her gunshot wound. Cassie wants to leave and find Sam, but Evan warns her that it would be dangerous for her to go out there on her own without protection. Cassie discovers that Evan took her gun and hid it. She runs away but sets off one of his traps in the woods. Evan runs back to her and protects her as someone else with a gun is walking through the woods.At Camp Haven, Colonel Vosch brings Ben into the control center and tells him that the fifth wave is already happening. He gives him a helmet that will allow him to detect an Other so that he can easily kill them.Evan teaches Cassie how to defend herself by showing her how to take someone's gun and incapacitate them. She shows him pictures of the people she used to know and love before the invasion. Quickly, Cassie and Evan develop an attraction for each other.The kids are brought to a location where Others have been detected. They spot a number of people with green skulls and fire at them. However, they then see Ringer through their lens and see a green skull. Before anyone can shoot her, Ben stops them. He is spotted with a green skull too. He quickly realizes that Vosch and Reznik lied to them, and that THEY are really Others. The fifth wave is the kids themselves. Since they are easily manipulated, they are being used as pawns to slowly wipe out the rest of the humans.Cassie learns that Evan is not quite human after witnessing him kill someone in the woods. He claims that when the alien ship arrived, a switch went off in him. He says he saved her when she got shot from someone else in the distance. Evan claims that his love for Cassie is making him more human. She runs from him and is rescued by the military.Cassie is taken to Camp Haven and goes through the same process as the other kids, only this time she can immediately spot something suspicious with Reznik. The two of them fight until Cassie knocks Reznik out.Ben confronts Vosch about the truth, to which he confirms that he and the rest of the military personnel are Others, and that they need the Earth for themselves. The base is then infiltrated. Cassie runs into Ben, and is then reunited with Sam. Evan shows up and kisses Cassie one last time before he goes to blow up the facility. The heroes run outside as the place is blown up. Ringer rescues them in a van, and they drive away, while Cassie watches as the place is destroyed, sad for Evan's sacrifice. But Colonel Vosch and the rest of the infected military and child cadets escape in a fleet of helicopters and fix-wing aircraft.The kids then set up their own camp, with some of the other kids like Dumbo joining them. Cassie closes the film by narrating that they haven't lost hope, and that hope is keeping them alive."
}