{
  "imdb_id": "tt2378281",
  "tmdb_id": "211954",
  "douban_id": null,
  "title": "Instructions Not Included (2013)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "Mexico",
  "version": [
    {
      "runtime": "115 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm0220240",
      "name": "Eugenio Derbez"
    }
  ],
  "writer": [
    {
      "id": "nm0753820",
      "name": "Guillermo Ríos",
      "description": "written by &"
    },
    {
      "id": "nm3898016",
      "name": "Leticia López Margalli",
      "description": "written by &"
    },
    {
      "id": "nm0220240",
      "name": "Eugenio Derbez",
      "description": "written by"
    },
    {
      "id": "nm0753820",
      "name": "Guillermo Ríos",
      "description": "story &"
    },
    {
      "id": "nm3898016",
      "name": "Leticia López Margalli",
      "description": "story"
    },
    {
      "id": "nm1405206",
      "name": "Oscar Orlando Torres",
      "description": "story advisor as Óscar Torres &"
    },
    {
      "id": "nm0735869",
      "name": "Gustavo Rodríguez",
      "description": "story advisor &"
    },
    {
      "id": "nm4252090",
      "name": "David Hernández Miranda",
      "description": "story advisor as David Hernández"
    },
    {
      "id": "nm2077283",
      "name": "Eduardo Cisneros",
      "description": "written by uncredited"
    }
  ],
  "cast": [
    {
      "id": "nm6156807",
      "name": "Andrés Vázquez",
      "character": "Valentín niño"
    },
    {
      "id": "nm0830153",
      "name": "Hugo Stiglitz",
      "character": "Johnny Bravo"
    },
    {
      "id": "nm0220240",
      "name": "Eugenio Derbez",
      "character": "Valentín"
    },
    {
      "id": "nm6156808",
      "name": "Leia Freitas",
      "character": "Amante Brasileña"
    },
    {
      "id": "nm6156809",
      "name": "Ángela Moreno",
      "character": "Amante Dominicana"
    },
    {
      "id": "nm1148835",
      "name": "Gilda Gentile",
      "character": "Amante Argentina"
    },
    {
      "id": "nm1580182",
      "name": "Nancy Taira",
      "character": "Amante Oriental"
    },
    {
      "id": "nm2264706",
      "name": "Jessica Lindsey",
      "character": "Julie"
    },
    {
      "id": "nm1675390",
      "name": "Sammy Pérez",
      "character": "Sammy"
    },
    {
      "id": "nm0709204",
      "name": "Arcelia Ramírez",
      "character": "Judeisy"
    },
    {
      "id": "nm0073221",
      "name": "Agustín Bernal",
      "character": "Lupe"
    },
    {
      "id": "nm0524144",
      "name": "Gregg Lucas",
      "character": "Agente migración"
    },
    {
      "id": "nm0191053",
      "name": "Roger Cudney",
      "character": "Abogado Julie"
    },
    {
      "id": "nm5879621",
      "name": "Migael Penix",
      "character": "Portero hotel L.A."
    },
    {
      "id": "nm0713393",
      "name": "Daniel Raymont",
      "character": "Frank Ryan"
    },
    {
      "id": "nm2602539",
      "name": "Alenka Rios",
      "character": "Camarera"
    },
    {
      "id": "nm6156811",
      "name": "Camila Gallegos",
      "character": "Maggie bebé"
    },
    {
      "id": "nm6156812",
      "name": "Matilda Gallegos",
      "character": "Maggie bebé"
    },
    {
      "id": "nm5160381",
      "name": "Loreto Peralta",
      "character": "Maggie"
    },
    {
      "id": "nm1309761",
      "name": "Jeannine Derbez",
      "character": "Directora 'Aztecman'"
    },
    {
      "id": "nm5229749",
      "name": "Danny Lopez",
      "character": "Aztecman"
    },
    {
      "id": "nm0078493",
      "name": "Eduardo Gleason",
      "character": "Hernán Cortés"
    },
    {
      "id": "nm2354312",
      "name": "Javier De la Vega",
      "character": "Staff 'Aztecman'       (as Javier de la Vega)"
    },
    {
      "id": "nm1452056",
      "name": "Jake Koenig",
      "character": "Mr. Anders"
    },
    {
      "id": "nm0646568",
      "name": "Karla Souza",
      "character": "Jackie"
    },
    {
      "id": "nm0944042",
      "name": "Margarita Wynne",
      "character": "Directora escuela"
    },
    {
      "id": "nm3955570",
      "name": "Melissa Temme",
      "character": "Maestra Maggie"
    },
    {
      "id": "nm5039421",
      "name": "Laura Krystine",
      "character": "Niña bullying"
    },
    {
      "id": "nm0042920",
      "name": "Francisco Avendaño",
      "character": "Doctor"
    },
    {
      "id": "nm2728030",
      "name": "Pamela Reiter",
      "character": "Mamá parque de diversiones"
    },
    {
      "id": "nm6156814",
      "name": "Nicolás del Campo",
      "character": "Espantado en montaña rusa"
    },
    {
      "id": "nm2571266",
      "name": "Michelle Marie Benoit",
      "character": "Modelo casting #12       (as Michelle Benoit)"
    },
    {
      "id": "nm1265291",
      "name": "Alejandra Bogue",
      "character": "Modelo casting #13 Trasvesti"
    },
    {
      "id": "nm3388681",
      "name": "Katia Kossiak",
      "character": "Melissa"
    },
    {
      "id": "nm1432981",
      "name": "Franklin Ruehl",
      "character": "Mesero"
    },
    {
      "id": "nm0740946",
      "name": "Alessandra Rosaldo",
      "character": "Renée"
    },
    {
      "id": "nm1138862",
      "name": "Ari Brickman",
      "character": "Director pelicula"
    },
    {
      "id": "nm6156816",
      "name": "Roland Farmer",
      "character": "Actor en edificio"
    },
    {
      "id": "nm6156817",
      "name": "J.B. Turner",
      "character": "Staff edificio 1"
    },
    {
      "id": "nm4386657",
      "name": "Jan Esparza",
      "character": "Staff edificio 2"
    },
    {
      "id": "nm4975605",
      "name": "Sebastian Mitre",
      "character": "Mensajero"
    },
    {
      "id": "nm0781299",
      "name": "Julian Sedgwick",
      "character": "Juez"
    },
    {
      "id": "nm1376964",
      "name": "Arap Bethke",
      "character": "Abogado Valentín"
    },
    {
      "id": "nm0643740",
      "name": "Jesús Ochoa",
      "character": "Jesús Ochoa"
    },
    {
      "id": "nm6156806",
      "name": "Magda B. de Kneip",
      "character": "Abuelita"
    },
    {
      "id": "nm3806951",
      "name": "Ivan Salazar",
      "character": "Asistente de Juez"
    },
    {
      "id": "nm0149611",
      "name": "Rosa Gloria Chagoyán",
      "character": "Lola la Trailera"
    },
    {
      "id": "nm3381556",
      "name": "Ricardo Mestre",
      "character": "Agente FBI 1       (as Richie Mestre)"
    },
    {
      "id": "nm4423209",
      "name": "Rodrigo Massa",
      "character": "Agente FBI 2"
    }
  ],
  "overview": "Valentin is Acapulco's resident playboy, until a former fling leaves a baby on his doorstep and him heading with her out of Mexico.",
  "storyline": "Valentin is Acapulco's resident playboy womanizer, until a former fling, a young American named Julie, leaves a baby on his doorstep and takes off without a trace. Leaving Mexico for Los Angeles to find the baby's mother, Valentin ends up finding a new home for himself and his newfound daughter, Maggie. An unlikely father figure, Valentin raises Maggie for six years, while also establishing himself as one of Hollywood's top stuntmen to pay the bills, with Maggie acting as his on-set coach. As Valentin raises Maggie, she forces him to grow up too. But their unique and offbeat family is threatened when Maggie's birth mom, Julie, shows up out of the blue after six years after turning her own life around and wants full custody of Maggie, and Valentin realizes he's in danger of losing his daughter - and his best friend.",
  "plot": "Valentín Bravo had always been a rather fearful child, afraid of everything from heights to spiders. His father, Juan \"Johnny\" Bravo, raised him trying to make him fearless by making a tarantula walk on Valentin and throwing him off a high oceanside cliff known as La Quebrada. When his father locked Valentín in a crypt at a cemetery, Valentín began to resent his father and ran away after stating that he no longer loves him.\n\nValentín grows up to be Acapulco's local playboy and sleeps with every tourist that crosses his path. One day a former fling named Julie shows up at his doorstep with a baby girl, claiming that she is his daughter. Julie leaves the baby with Valentín after asking him for cab fare, but she doesn't come back. After receiving a phone call from Julie in which she says she is not prepared to raise a child, Valentín races to the airport to try to return the baby to Julie but fails to catch up to her before she boards her flight to Los Angeles.\n\nValentín leaves Acapulco with the baby, Maggie, and hitchhikes across Mexico toward Tijuana. After being turned back at the US border, he crosses by being smuggled in a hidden compartment in a transport truck along with numerous other Mexicans. Going only by a single photo of Julie in which a Los Angeles hotel is visible in the background, Valentín visits the hotel to track down Julie. However, when Maggie wanders to a nearby pool, Valentín ends up jumping out of a hotel presidential suite into the pool 10 stories below, rescuing his daughter. A movie director witnesses this event and hires Valentín as a stuntman — a job which Valentín accepts since he believes it is the only way he can support Maggie.\n\nAn unlikely father figure, Valentín raises Maggie for six years, giving her a happy, fun, and carefree home. Meanwhile, he also establishes himself as one of Hollywood's top stuntmen to pay the bills, with Maggie acting as his on-set coach and translator as Valentín still doesn't know any English. As Valentín raises Maggie, she forces him to grow up too in his large fears, though he does it only for her own fun. Meanwhile, during a visit to the doctor in which he receives an injection, the doctor confides in Valentín — with Maggie out of earshot — that the treatments aren't working. To hide from Maggie the fact that her mother abandoned her, Valentín writes weekly letters to Maggie from her, detailing various adventures and feats around the world to explain her absence. But Maggie wishes to meet her mother, so Valentín goes to his director, and looks for an actress to play \"Julie\". Before the casting is complete, Valentín gets a call from Julie saying that she is in Los Angeles and wants to meet.\n\nJulie tries to be a part of Maggie's life again, along with her girlfriend Renee who she lives with in New York, but after a tearful departure at the airport Julie realizes she doesn't want to just see Maggie during visits and holidays. She files for custody and cites Valentín's dangerous job and lack of English skills as reasons that he is unfit to raise Maggie. Valentín's sincerity and the story of his daring ten-story jump convince the judge that he has Maggie's best interest at heart, and he awards custody to Valentin as he is the only parent she has really known. Not backing down, Julie asks for a DNA test which proves Valentín isn't the father after all. Valentín ends up losing legal custody of Maggie, but they sneak away and decide to go back to Acapulco where he reunites with his friends, although he discovers that his father died a few years ago.\n\nJulie and Renee threaten Valentín's director to bully him into revealing Valentín's location, who repeatedly claims he doesn't know where the father and daughter are. Eventually he relents and states that Valentín has woken up every day not knowing if it would be the last day he would see his daughter, but the details are not revealed on-screen. Julie finds Valentín and Maggie on the beach and has surprisingly dropped her attempts to gain custody. Instead, the three enjoy time together as a family in Acapulco while in a voice-over Valentín narrates how doctors can sometimes discover a heart defect for which there is no cure and which could kill the patient any time. As Valentín and Julie sit on the beach with Maggie falling asleep in Valentín's lap, Maggie peacefully passes away, which reveals that she, not Valentín, was the one with the heart defect.\n\nOne year later, we see Valentín walking down the beach, with a dog but without Julie, narrating that he now understands his father's motives in wanting to prepare him for the future and give him the courage to face his fears. The film concludes with a vision of Maggie playing in heaven with her grandfather.",
  "synopsis": "As a child, Valentín Bravo (Andrés Vázquez) was afraid of everything from heights to spiders. His father, Juan \"Johnny\" Bravo (Hugo Stiglitz), tried to make him fearless by making a tarantula walk on him and throwing him off a high ocean side cliff known as La Quebrada. When his father locked Valentín in a crypt at a cemetery, Valentín began to resent his father and ran away after stating that he no longer loves him.In the present day, Valentín (Eugenio Derbez as an adult) lives in Acapulco and is the local playboy who sleeps with every female tourist (both Mexican and foreigners) that crosses his path. One day a former fling named Julie (Jessica Lindsey), a young hippie American tourist, shows up at his doorstep with a baby girl, claiming that the baby is his daughter. Julie leaves the baby with Valentín after asking him for taxi fare, but she doesn't return. After receiving a phone call from Julie in which she says she is not prepared to raise a child, Valentín races to the airport to try to return the baby to Julie but fails to catch up to her before she boards her flight to Los Angeles.Valentín leaves Acapulco with the baby, Maggie, and hitchhikes across Mexico toward Tijuana. After being turned back at the US border when he realizes that he needs a travel visa to enter the USA (plus he has no money), he crosses by being smuggled in a hidden compartment in a transport truck driven by Lupe (Agustín Bernal) along with numerous other Mexicans. Going only by a single photo of Julie in which a Los Angeles hotel is visible in the background, Valentín visits the hotel to track down Julie. However, when Maggie wanders to a nearby pool and falls in, Valentín ends up jumping out of a hotel presidential suite into the pool 10 stories below, rescuing his daughter. A Hollywood movie director named Frank Ryan (Daniel Raymont) witnesses this event and hires Valentín as a stuntman, a job which Valentín accepts since he believes it is the only way he can support Maggie.An unlikely father figure, Valentín raises Maggie (7-year-old Loreto Peralta) for the next six years, giving her a happy, fun, carefree home in downtown Los Angeles. Meanwhile, he establishes himself as one of Hollywood's top stuntmen to pay the bills. The bilingual Maggie is his on-set coach and translator, as he still doesn't know (or hasn't bothered to learn) much English. As Valentín raises Maggie and sends her to attend public school, she forces him to grow up too in his larger fears, though he does it only for her own fun.One day, during a visit to the doctor in which he receives an injection (for untreated STD's), the doctor confides in Valentín, with Maggie out of earshot, that the \"treatments aren't working\". To hide from Maggie the fact that her mother abandoned her, Valentín writes weekly letters to Maggie from her, detailing various adventures and feats around the world to explain her absence. But Maggie wishes to meet her mother, so Valentín goes to his director, Frank, who looks for an actress to play \"Julie\". Before the casting is complete, Valentín gets a phone call from Julie saying that she is in Los Angeles and wants to get together.While out at dinner, Julie reveals that she is now a lawyer living in New York City and involved in a lesbian relationship with girlfriend Renee (Alessandra Rosaldo). After a tearful airport departure, Julie realizes that she doesn't want to just see Maggie during holidays. She files for full custody, citing Valentín's dangerous job, immaturity, and lack of English skills as reasons that he is unfit to raise Maggie. Valentín's sincerity and the story of his daring ten-story jump convince the judge that he has Maggie's best interest at heart, and he awards custody to Valentin as he is the only parent she has really known. Frank tries to persuade Valentín to tell the truth about something, but Valentín refuses.Not backing down, Julie asks for a DNA test which proves Valentín isn't Maggie's biological father. Valentín ends up losing legal custody of Maggie, but they sneak away and return to Acapulco, where he reunites with his friends... and discovers that his father has died a few years previously.Back in Los Angeles, Julie and Renee bully Frank into revealing Valentín's location. Frank repeatedly claims he doesn't know where they are, but eventually he relents and states that Valentín has woken up every day not knowing if it would be the last day he would see his daughter, but the details are not revealed on-screen.A few days later, Julie finds Valentín and Maggie on the beach and has surprisingly dropped her attempts to gain custody. Instead, the three enjoy time together as a family in Acapulco for the next two weeks while in a voice-over Valentín narrates how doctors can sometimes discover a heart defect for which there is no cure and which could kill the patient any time. As Valentín and Julie sit on the beach, Maggie falls asleep in Valentín's lap, then peacefully passes away: she, not Valentín, was the one with the heart defect.One year later, Valentín is seen walking down the beach, with a dog but without Julie, narrating that he now understands his father's motives in wanting to prepare him for the future and give him the courage to face his fears. The film concludes with a vision of Maggie playing in heaven with her grandfather."
}