{
  "imdb_id": "tt2317127",
  "tmdb_id": "171645",
  "douban_id": null,
  "title": "Sync (2012)",
  "genres": [
    "Action",
    "Sci-Fi"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "103 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm3113392",
      "name": "Sam Gorski"
    },
    {
      "id": "nm3021105",
      "name": "Niko Pueringer"
    }
  ],
  "writer": [
    {
      "id": "nm2854808",
      "name": "Ira Parker",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3106079",
      "name": "Tanner Thomason",
      "character": "Charlie Cooper"
    },
    {
      "id": "nm1195175",
      "name": "Jai Koutrae",
      "character": "Dr. John Wyatt"
    },
    {
      "id": "nm1616869",
      "name": "Jude B. Lanston",
      "character": "Agent Barney Griggs       (as Jude Lanston)"
    },
    {
      "id": "nm3934247",
      "name": "Krista Marie Yu",
      "character": "Yoshi"
    },
    {
      "id": "nm2413600",
      "name": "Carlos Ciurlizza",
      "character": "Carlos Ruiz"
    },
    {
      "id": "nm0200085",
      "name": "Shane Daniels",
      "character": "Guard"
    },
    {
      "id": "nm2976758",
      "name": "Robert Dill",
      "character": "Security enforcer"
    },
    {
      "id": "nm3952983",
      "name": "Joe Fidler",
      "character": "Thug"
    },
    {
      "id": "nm2371549",
      "name": "Tim Garris",
      "character": "Motorcycle Thug"
    },
    {
      "id": "nm2599630",
      "name": "Cooper Harris",
      "character": "Agent Eleanor Delaney"
    },
    {
      "id": "nm1748530",
      "name": "Olga Kay",
      "character": "Receptionist"
    },
    {
      "id": "nm4058995",
      "name": "Monique Kim",
      "character": "Liu Fang"
    },
    {
      "id": "nm3807033",
      "name": "Jesse La Flair",
      "character": "Sync Guard"
    },
    {
      "id": "nm4983660",
      "name": "Dead Lee",
      "character": "Juan"
    },
    {
      "id": "nm5025479",
      "name": "Janice Sonia Lee",
      "character": "Skinny Face       (as Janice Lee)"
    },
    {
      "id": "nm4375857",
      "name": "Harley Morenstein",
      "character": "Ghost"
    },
    {
      "id": "nm3375370",
      "name": "Ethan Newberry",
      "character": "Dave Dixon"
    },
    {
      "id": "nm1589270",
      "name": "Lauren Plaxco",
      "character": "Reese Wilson"
    },
    {
      "id": "nm4086094",
      "name": "DeVille Vannik",
      "character": "Sync Guard"
    },
    {
      "id": "nm1843953",
      "name": "Kelly Walker",
      "character": "Zoe LaPerrier"
    },
    {
      "id": "nm3087799",
      "name": "Freddie Wong",
      "character": "Sync Employee"
    },
    {
      "id": "nm4136296",
      "name": "Jimmy Wong",
      "character": "Sync Employee"
    },
    {
      "id": "nm4157718",
      "name": "Charlene Yang",
      "character": "Mai Zhen"
    }
  ],
  "overview": "Charlie Cooper is a special agent of the future - the mind of a man running entirely on a computer, able to transfer his consciousness to bio-mechanical bodies at will. But when a computer virus corrupts his system, he must face one of his greatest challenges yet: mortality.",
  "storyline": "Charlie Cooper is a special agent of the future able to transfer his consciousness to bio-mechanical bodies at will. But when a computer virus corrupts his system, he must face one of his greatest challenges yet: mortality.",
  "plot": "Ten years after the Trade Federation's invasion of Naboo, the Galactic Republic is threatened by a Separatist movement organized by former Jedi Master Count Dooku. Senator Padmé Amidala comes to Coruscant to vote on a motion to create an army to assist the Jedi against this threat. Narrowly avoiding an assassination attempt upon arrival, she is placed under the protection of Jedi Knight Obi-Wan Kenobi and his apprentice, Anakin Skywalker. The two Jedi thwart a second attempt on her life and subdue the assassin, Zam Wesell, a shape-shifter who is soon killed by her bounty hunter client before she can reveal his identity. The Jedi Council assigns Obi-Wan to identify and capture the bounty hunter, while Anakin is assigned to escort Padmé back to Naboo, where the pair develop a romantic attraction towards each other.\n\nObi-Wan's investigation leads him to the remote ocean planet Kamino, where he discovers an army of clones is being produced for the Republic, with bounty hunter Jango Fett serving as their genetic template. Obi-Wan deduces Jango to be the bounty hunter he is seeking, and follows him and his clone son, Boba, to the desert planet Geonosis via a homing beacon placed on their ship, the Slave I. Meanwhile, Anakin becomes troubled by premonitions of his mother, Shmi, in pain, and travels to Tatooine with Padmé to save her. They meet Owen Lars, Anakin's stepbrother and the son of Shmi's new husband, Cliegg Lars. Cliegg tells Anakin that Shmi was abducted by Tusken Raiders weeks earlier and is likely dead. Determined to find her, Anakin ventures out and, finding the Tusken campsite, locates Shmi, dying from torture at the hands of the Tuskens. She dies in Anakin's arms. Anakin, enraged, massacres the Tuskens and returns to the Lars homestead with Shmi's body. After revealing his deed to Padmé, Anakin says that he wants to prevent death.\n\nOn Geonosis, Obi-Wan discovers a Separatist gathering led by Count Dooku, whom Obi-Wan learns had authorized Padmé's assassination and is developing a battle droid army with Trade Federation Viceroy Nute Gunray. Obi-Wan transmits his findings to Anakin to relay to the Jedi Council, but is captured mid-transmission. With knowledge of the droid army, Supreme Chancellor Palpatine is voted emergency powers to send the clones into battle. Anakin and Padmé journey to Geonosis to rescue Obi-Wan, but are also captured. The three are sentenced to death, but are eventually saved by a battalion of Jedi and clone troopers led by Mace Windu and Yoda; Jango Fett is killed by Mace during the rescue. As the clone and droid armies battle, Obi-Wan and Anakin intercept Dooku, and the three engage in a lightsaber battle. Dooku overpowers Obi-Wan and Anakin, but then Yoda arrives and engages the Count in a duel. Finding he is unable to defeat Yoda, Dooku flees. Arriving at Coruscant, he delivers blueprints for a superweapon, the Death Star, to his Sith master, Darth Sidious, who confirms that \"everything is going as planned\". As the Jedi gravely acknowledge the beginning of the Clone Wars, Anakin is fitted with a robotic arm and secretly marries Padmé on Naboo, with C-3PO and R2-D2 as their witnesses.",
  "synopsis": "It's 2025, and the US Government has created the \"first computerized human\". He's an immortal killing machine bad-ass. But, because of one hacker girl in Hong Kong, he suddenly catches a new kind of virus..."
}