{
  "imdb_id": "tt2369047",
  "tmdb_id": "134908",
  "douban_id": null,
  "title": "Horses of God (2012)",
  "genres": [
    "Drama"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "115 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm0043953",
      "name": "Nabil Ayouch"
    }
  ],
  "writer": [
    {
      "id": "nm4977230",
      "name": "Jamal Belmahi",
      "description": "written by"
    },
    {
      "id": "nm5551210",
      "name": "Mahi Binebine",
      "description": "novel"
    }
  ],
  "cast": [
    {
      "id": "nm5551244",
      "name": "Abdelhakim Rachi",
      "character": "Yacine"
    },
    {
      "id": "nm5551256",
      "name": "Abdelilah Rachid",
      "character": "Hamid"
    },
    {
      "id": "nm5551259",
      "name": "Hamza Souidek",
      "character": "Nabil"
    },
    {
      "id": "nm5551257",
      "name": "Ahmed El Idrissi Amrani",
      "character": "Fouad"
    },
    {
      "id": "nm7160340",
      "name": "Badr Chakir",
      "character": "Khalil"
    },
    {
      "id": "nm7160341",
      "name": "Achraf Afir",
      "character": "Yacine (as a child)"
    },
    {
      "id": "nm7160342",
      "name": "Said El-Alami",
      "character": "Hamid (as a child)"
    },
    {
      "id": "nm7160343",
      "name": "Zouhair Sabri",
      "character": "Nabil (as a child)"
    },
    {
      "id": "nm7160344",
      "name": "Bouchaib Saakine",
      "character": "Fouad (as a child)"
    },
    {
      "id": "nm5634173",
      "name": "Othman Younouss",
      "character": "Khalil (as a child)"
    },
    {
      "id": "nm5634497",
      "name": "Rabii Benjhail Tadlaoui",
      "character": "Zaid       (as Rabii Tadlaoui)"
    },
    {
      "id": "nm0848015",
      "name": "Mohammed Taleb",
      "character": "Abdu Zoubeir"
    },
    {
      "id": "nm5382970",
      "name": "Mohamed Mabrouk",
      "character": "Nouceir"
    },
    {
      "id": "nm7160345",
      "name": "Fatima El-Kraimy",
      "character": "Yemma (Yacine's Mother)"
    },
    {
      "id": "nm6039118",
      "name": "Youness Chara",
      "character": "Said"
    },
    {
      "id": "nm7160346",
      "name": "Imane Benennia",
      "character": "Ghislaine"
    },
    {
      "id": "nm5685223",
      "name": "Nouhaila ben Moumou",
      "character": "Ghislaine (as a child)"
    },
    {
      "id": "nm7160347",
      "name": "Abdallah Ouzzad",
      "character": "Ba'Moussa"
    },
    {
      "id": "nm7160348",
      "name": "Hanane Douch",
      "character": "Tamou (Nabil's Mother)"
    },
    {
      "id": "nm4719206",
      "name": "Hassan Madiaf",
      "character": "Madani"
    },
    {
      "id": "nm7160349",
      "name": "Youssef ez-Zhar El-Idrissi",
      "character": "Pitbull"
    },
    {
      "id": "nm7160350",
      "name": "Ahmed Ayach",
      "character": "Yacine's Father"
    },
    {
      "id": "nm7160351",
      "name": "Abdenbi El-Benthi",
      "character": "Aziz"
    },
    {
      "id": "nm7160352",
      "name": "Azzedine Toulali",
      "character": "Real"
    },
    {
      "id": "nm7160353",
      "name": "Malika Chafii",
      "character": "Mi Lalla"
    },
    {
      "id": "nm5350081",
      "name": "Amal Chakir",
      "character": "Halima"
    },
    {
      "id": "nm7160354",
      "name": "Ismail Laduei",
      "character": "M'barek"
    },
    {
      "id": "nm7160355",
      "name": "Abdellah Tbib",
      "character": "Noureddine"
    },
    {
      "id": "nm7160356",
      "name": "Mostafa Messouar",
      "character": "Young Vendor"
    },
    {
      "id": "nm1136915",
      "name": "Osama bin Laden",
      "character": "Himself       (archive footage)"
    }
  ],
  "overview": "Director Nabil Ayouch Producer Nabil Ayouch, Pierre-Ange Le Pogam, Eric Van Beuren, Patrick Quinet Screenwriter Jamal Belmahi With Abdelhakim Rachid, Abdelilah Rachid, Hamza Souidek Morocco-France-Belgium 2012  Ayouch’s film follows two brothers over the course of a decade. While they begin as kids in search of thrills in the sprawling slums of Morocco’s Sidi Moumen, we witness their gradual, and ultimately shocking, radicalisation. Rather than opt for dry didacticism, however, Ayouch fashions a visually sumptuous and often breathless coming-of-age story that is reminiscent, at times, of Fernando Meirelles’ City of God, albeit with a tragic twist in the tale. A major achievement by one of North Africa’s most important filmmakers.",
  "storyline": "A fictional account of the lives of the men responsible for the suicide bombings in Casablanca in 2003.",
  "plot": "The film opens in 1994. Yachine (his real name is Tarek),[a] his violent older brother Hamid,[b] and Yachine's friends Nabil (son of Tamou, a local prostitute and singer),[c] pot-smoking Fouad, and Khalil live in extreme poverty in Sidi Moumen, a shanty town on the edge of Casablanca in Morocco. Hamid earns money by acting as a drug mule. The boys steal liquor from Khalil's father's wedding, and Hamid rapes a drunk Nabil in front of the others.\n\nIn 1999, the shanty town is significantly larger, and Hassan II of Morocco has just died. Yachine, Nabil, Fouad, and Khalil spend their time smoking pot, and Yachine is in love with Ghislaine, Fouad's sister. Hamid is now a major drug dealer, paying off the policeman known as \"Pitbull\" and forcing Yachine to stay out of the drug business. Religious zealots force Tamou to leave town. Hamid is given a two-year prison sentence after throwing a rock at Pitbull's car. Yachine is forced out of the marketplace in the medina, and Nabil gets him a job repairing engines for repairman Ba'Moussa.\n\nThe day after the September 11 attacks, Hamid is released from prison, having given up drugs and embraced radical Islam. Yachine kills Ba'Moussa after the drunk man attempts to rape Nabil. Nabil gets Hamid, and he and his radical friends hide the body. Hamid gives the two refuge in an Islamic compound hidden within the shanty town, and Yachine and Nabil meet with Abou Zoubeir—who begins to recruit them into radical Islam. Nouceir, a former neighborhood enemy and now one of Hamid's close friends, intimidates Khalil and Fouad into joining the cell also. All four begin learning jujutsu. Yachine, feeling immense guilt over murdering Ba'Moussa, spends the night with Nabil.[d] But he is also drawn to Zebeir's message of forgiveness through adherence to radical Islam.\n\nA year later, in November 2002, Tarek (having given up his nickname), Nabil, and Faoud have fully embraced radical Islam.[e] Zebeir tells Tarek, Nabil, and Fouad they are being admitted to the innermost councils of the cell, which leaves Hamid jealous and angry. An extensive montage depicts the radicalization of the friends. Tarek learns that Ghislaine is going to marry a cousin.\n\nIn February 2003, the police raid a public meeting of radical Muslims, beating Tarek. Abou Zoubeir begins to preach martyrdom to the cell. Tamou attempts to see Nabil, but he refuses to see her or accept her gifts. An unidentified emir arrives and reinforces the message of martyrdom, telling Hamid, Tarek, Faoud, Nabil, and Nouceir, \"Take care, children of Islam, never to become like those who cling to life down here and fear to become martyrs. Fly, horses of God, and the gates of paradise will open for you.\" He selects the four for a suicide mission, and Hamid's jealousy toward Tarek worsens.\n\nMay 9, the day of the attack, approaches. Abou Zoubeir flees as the police close in on the cell, and the attack is moved to May 16. The five men drive into the foothills near Casablanca, which Tarek, Nabil, and Faoud have never seen before. They are amazed at the city's wealth, and surprised to see vast forests and rivers (unlike the desert they have lived in). They camp in the forest, waiting for the day of attack to arrive. Tarek hopes Ghislaine will think fondly of him, once he becomes a martyr. Hamid unsuccessfully attempts to convince Tarek not to go through with the attack.[f] The men return to the shanty town on May 15, where they meet with Abou Zoubeir and the 14 others in their cell. They prepare extensively for their mission by shaving, washing, setting watches, and receiving their bombs.\n\nHamid, Fouad, Tarek, and Nabil enter Casablanca on May 16, spending the day wandering the city. That night, they approach the Casa de España restaurant. Hamid refuses to let Tarek go through with the attack, but Tarek pushes him away. Faoud flees, not wanting to die. Tarek and Nabil stab and kill the doorman, and enter the club. Two minutes later, they see Hamid in the club as well. The three set off their bombs.\n\nThe film ends with children in Sidi Moumen playing football in the dark, and pausing to listen to the explosions in the city. End titles describe the 2003 Casablanca bombings, where they occurred, and how many people died.",
  "synopsis": null
}