{
  "imdb_id": "tt2321449",
  "tmdb_id": "108942",
  "douban_id": null,
  "title": "Nyanki (2012)",
  "genres": [
    "Comedy"
  ],
  "country": "Russia",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.6,
  "director": [
    {
      "id": "nm4914548",
      "name": "Ashot Keshchyan"
    }
  ],
  "writer": [
    {
      "id": "nm5279531",
      "name": "Olga Antonova",
      "description": null
    },
    {
      "id": "nm4938109",
      "name": "Pavel Karnaukhov",
      "description": null
    },
    {
      "id": "nm5159385",
      "name": "Sergey Mokhnachev",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3538929",
      "name": "Nikolay Naumov",
      "character": ""
    },
    {
      "id": "nm4414480",
      "name": "Ararat Keshchyan",
      "character": ""
    },
    {
      "id": "nm0052912",
      "name": "Michael Baral",
      "character": "Michael"
    },
    {
      "id": "nm0037679",
      "name": "Lyudmila Artemeva",
      "character": ""
    },
    {
      "id": "nm0104563",
      "name": "Dieter Brandecker",
      "character": ""
    },
    {
      "id": "nm4967241",
      "name": "Angelina Dobrorodnova",
      "character": ""
    },
    {
      "id": "nm2804487",
      "name": "Mikhail Galustyan",
      "character": "Arab"
    },
    {
      "id": "nm4915732",
      "name": "Ilya Kostyukov",
      "character": "Sasha"
    },
    {
      "id": "nm4968027",
      "name": "Gleb Serdyukov",
      "character": ""
    },
    {
      "id": "nm4063661",
      "name": "Aglaya Shilovskaya",
      "character": ""
    },
    {
      "id": "nm1127988",
      "name": "Olesya Zheleznyak",
      "character": ""
    }
  ],
  "overview": "Valentine - a tough, cold-blooded owner of a large travel company, got a complex task in a country where a woman, regardless of her professionalism, can not success in business - Turkey. So she calls two workers of the Urals branch - Dima and Misha for help.",
  "storyline": "Valentina (Olesya Zheleznyak) is a tough and composed owner of a big travel agency who has to make a complicated decision in a country where a woman, whether she is a high professional or not, cannot succeed in business in Turkey. She calls for help and invites the employees of her Urals affiliate which are Dima (Nikolay Naumov) and Misha (Ararat Keschyan) inert idlers to happen, unfortunately, the only two men among the employees. The expected vacation abroad turns not only into the last chance for careless cheery fellows to prove their professionalism and to avoid the shameful dismissal but becomes a threat for their sanity and lives: by a fatal coincidence Misha and Dima have to watch three naughty kids of Valentina. As we all know misfortunes never come singly thats why when Valentinas mother (Lyudmila Artemyeva) comes supposedly to look after her grandchildren, it challenges the guys twice as they have to manage actually with one more kid that needs to be looked after as much as ...",
  "plot": null,
  "synopsis": "Valentina (Olesya Zheleznyak) is a tough and composed owner of a big travel agency who has to make a complicated decision in a country where a woman, whether she is a high professional or not, cannot succeed in business in Turkey. She calls for help and invites the employees of her Urals affiliate which are Dima (Nikolay Naumov) and Misha (Ararat Keschyan) inert idlers to happen, unfortunately, the only two men among the employees. The expected vacation abroad turns not only into the last chance for careless cheery fellows to prove their professionalism and to avoid the shameful dismissal but becomes a threat for their sanity and lives: by a fatal coincidence Misha and Dima have to watch three naughty kids of Valentina. As we all know misfortunes never come singly thats why when Valentinas mother (Lyudmila Artemyeva) comes supposedly to look after her grandchildren, it challenges the guys twice as they have to manage actually with one more kid that needs to be looked after as much as true kids. Now the friends have to cope with the children, their grandmother, and with their German rivals, all of that aggravates by their attempts not to kill the important transaction. Will our characters win the battle and Valentina and her kids favour?"
}