{
  "imdb_id": "tt2349144",
  "tmdb_id": "309242",
  "douban_id": null,
  "title": "Mississippi Grind (2015)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "108 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.3,
  "director": [
    {
      "id": "nm1349818",
      "name": "Anna Boden"
    },
    {
      "id": "nm0281396",
      "name": "Ryan Fleck"
    }
  ],
  "writer": [
    {
      "id": "nm1349818",
      "name": "Anna Boden",
      "description": "written by &"
    },
    {
      "id": "nm0281396",
      "name": "Ryan Fleck",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0578853",
      "name": "Ben Mendelsohn",
      "character": "Gerry"
    },
    {
      "id": "nm1914282",
      "name": "Yvonne Landry",
      "character": "Louise"
    },
    {
      "id": "nm1902452",
      "name": "Anthony Howard",
      "character": "Larry"
    },
    {
      "id": "nm0005351",
      "name": "Ryan Reynolds",
      "character": "Curtis"
    },
    {
      "id": "nm1842948",
      "name": "Jayson Warner Smith",
      "character": "Clifford"
    },
    {
      "id": "nm2684369",
      "name": "Kerry Cahill",
      "character": "Riverboat Waitress"
    },
    {
      "id": "nm4435266",
      "name": "Jane McNeill",
      "character": "'Bloody Mary' Kate"
    },
    {
      "id": "nm6313265",
      "name": "Jason Shaffette",
      "character": "Chuck Poker Dealer"
    },
    {
      "id": "nm1205024",
      "name": "P.J. Marshall",
      "character": "Dale"
    },
    {
      "id": "nm2576863",
      "name": "Stephanie Honoré",
      "character": "Denise"
    },
    {
      "id": "nm3582715",
      "name": "Teri Wyble",
      "character": "Home Buying Wife"
    },
    {
      "id": "nm3363398",
      "name": "Hunter Burke",
      "character": "Home Buying Husband"
    },
    {
      "id": "nm0990415",
      "name": "Randy Austin",
      "character": "Big Winner"
    },
    {
      "id": "nm4983834",
      "name": "Jared Bankens",
      "character": "Skinny Thug"
    },
    {
      "id": "nm0005569",
      "name": "Alfre Woodard",
      "character": "Sam"
    },
    {
      "id": "nm5242720",
      "name": "Joshua Powell",
      "character": "Waiter"
    },
    {
      "id": "nm1092227",
      "name": "Sienna Miller",
      "character": "Simone"
    },
    {
      "id": "nm3006818",
      "name": "Analeigh Tipton",
      "character": "Vanessa"
    },
    {
      "id": "nm7162113",
      "name": "Timothy Louie",
      "character": "Dealer       (as Tim Louie)"
    },
    {
      "id": "nm0674032",
      "name": "Poland Perkins",
      "character": "Older Gentleman"
    },
    {
      "id": "nm0103612",
      "name": "Don Brady",
      "character": "Loser       (as Donald Brady)"
    },
    {
      "id": "nm7512411",
      "name": "Jay Cooper",
      "character": "Dennis' Dealer"
    },
    {
      "id": "nm6325711",
      "name": "Joshua Wilcox",
      "character": "Player One"
    },
    {
      "id": "nm3986223",
      "name": "Susan McPhail",
      "character": "Donna"
    },
    {
      "id": "nm6611003",
      "name": "Leo Bud Welch",
      "character": "Leo Welch       (as Leo Welch)"
    },
    {
      "id": "nm1881080",
      "name": "Samantha Beaulieu",
      "character": "Curvy Woman"
    },
    {
      "id": "nm1151921",
      "name": "Jason Davis",
      "character": "Dennis"
    },
    {
      "id": "nm3657833",
      "name": "Lucky Johnson",
      "character": "Man in Bar       (as Kevin 'Lucky' Johnson)"
    },
    {
      "id": "nm1979373",
      "name": "Shamarr Allen",
      "character": "Local Bar Patron"
    },
    {
      "id": "nm0917848",
      "name": "Robin Weigert",
      "character": "Dorothy"
    },
    {
      "id": "nm0629525",
      "name": "Indigo",
      "character": "Dora"
    },
    {
      "id": "nm4561847",
      "name": "Wes Lagarde",
      "character": "Frat Boy"
    },
    {
      "id": "nm6650549",
      "name": "Cheri Jones",
      "character": "Teller"
    },
    {
      "id": "nm2156703",
      "name": "Jamal Dennis",
      "character": "Baller"
    },
    {
      "id": "nm0864812",
      "name": "James Toback",
      "character": "Tony Roundtree"
    },
    {
      "id": "nm2958419",
      "name": "Thomas Francis Murphy",
      "character": "Pete"
    },
    {
      "id": "nm3774836",
      "name": "Marshall Chapman",
      "character": "Cherry"
    },
    {
      "id": "nm7512412",
      "name": "Cheri Williams",
      "character": "Roulette Croupier"
    },
    {
      "id": "nm7512413",
      "name": "Joshua Varmall",
      "character": "Blackjack Dealer"
    },
    {
      "id": "nm7512414",
      "name": "Joseph Blake Hollier",
      "character": "Craps Croupier"
    },
    {
      "id": "nm3902434",
      "name": "Mary Patricia Seidel",
      "character": "Steakhouse Waitress       (as Mary Seidel)"
    },
    {
      "id": "nm4754232",
      "name": "Lauren Gros",
      "character": "Alice"
    }
  ],
  "overview": "Gerry is a talented but down-on-his-luck gambler whose fortunes begin to change when he meets Curtis, a younger, highly charismatic poker player.  The two strike up an immediate friendship and Gerry quickly persuades his new friend to accompany him on a road trip to a legendary high stakes poker game in New Orleans. As they make their way down the Mississippi River, Gerry and Curtis manage to find themselves in just about every bar, racetrack, casino, and pool hall they can find, experiencing both incredible highs and dispiriting lows, but ultimately forging a deep and genuine bond that will stay with them long after their adventure is over.",
  "storyline": "Down on his luck and facing financial hardship, Gerry teams up with a younger, charismatic poker player named Curtis in an attempt to change his luck. The two set off on a road trip through the South with visions of winning back what has been lost.",
  "plot": "Gerry (Ben Mendelsohn), a perpetual gambler facing financial hardship, enters a casino in Dubuque, Iowa, where he meets Curtis (Ryan Reynolds), a younger traveling gambler, while playing Texas hold 'em. Curtis wins a hand against Gerry and buys Gerry a premium glass of Bulleit Bourbon, and a friendship begins. Hours later, Gerry sees Curtis playing darts at a bar and returns the favor buying Curtis a drink. Curtis explains that he is successful playing cards because he doesn't care about winning and just likes to play with no emotional investment in the outcome of the game. The two drink heavily with Gerry passing out and waking up on a couch at Curtis' place.\n\nAfter an unsuccessful real estate showing the next morning, Gerry goes to a dog track with Curtis. They initially win a large amount of money, but Gerry is unwilling to walk away, and he ultimately gambles away their winnings. Afterwards, they drink at a bar where they attempt to bet $1,000 on a game of pool. The men at the pool table are not interested and they intimidate Curtis and Gerry into leaving the bar. In the parking lot, Curtis explains to Gerry that “Machu Picchu Time” is approaching, which is the phrase he uses whenever he leaves town, implying that he is heading to Machu Picchu in Peru, which he has yet to actually visit. Gerry is then threatened by a man who had overheard the attempted $1,000 bet in the bar, not knowing that Gerry was bluffing. The man stabs Gerry, inflicting a mild wound on his abdomen.\n\nThe next morning, Gerry meets Sam (Alfre Woodard) in a restaurant, where she presses Gerry to repay her the money he owes but does not have. She tells Gerry to pay up by the following day or else she will call upon her friend Tim to “pay [Gerry] a visit.” Gerry then runs into Curtis at a bar, where he proposes a trip down the Mississippi River, where they will gamble at several major cities, and ultimately play at a poker game in New Orleans with a $25,000 buy-in. Curtis agrees to stake Gerry with $2,000, provided that Gerry takes them with his car.\n\nThe two arrive in St. Louis, where they meet prostitutes Simone (Sienna Miller) and Vanessa (Analeigh Tipton). After Gerry has a very successful poker session on a riverboat casino, Gerry and Curtis spend time in St. Louis with Simone and Vanessa. Simone warns Curtis of previous times he has trusted a fellow gambler and ended up being deceived. In Memphis, Gerry is playing very well at the poker table until he loses his entire stack when his full house is bested by his opponent's better full house on the final “river” card of a Texas hold ‘em game. Gerry then lies to Curtis, saying that he won $20,000 and is inspired to go to Little Rock to make amends with his ex-wife. Curtis agrees to come along for the ride. Gerry is initially welcomed into his ex-wife’s house, but is soon told to leave, with a push on the way out, after she catches him red-handed trying to lift a wad of cash from her sock drawer after lying to her about needing to use the bathroom.\n\nCurtis and Gerry then go to Tunica, Mississippi, where Curtis’ Player's Club Card is rejected when he attempts to use it for a complimentary night's stay. After asking Gerry for some money for the hotel room, Curtis discovers that Gerry has lied to him, and that Gerry in fact lost all of his money in Memphis. Curtis tells Gerry that if he continues on this path, it will not end well for him. In the restroom, Curtis agitates some fraternity boys, and when they see that Curtis has left the bathroom, they redirect their anger towards Gerry and beat him up instead.\n\nThe two go to a horse race in New Orleans. After selling Gerry’s car, they agree to bet on the horse \"Toto's Revenge\", but Curtis secretly bets on a different horse, \"Mississippi Grind\". When Curtis’ horse wins, he does not tell Gerry, and Gerry assumes they are out of money. Having heard of Tony Roundtree (James Toback) from Curtis, Gerry goes to Tony’s house for a poker game, but admits he does not have enough money to play and asks Tony to help him out with the buy-in. Tony slaps him and shuts the door in his face. Curtis loses a $100 prop bet in a 1-on-1 pick-up basketball game and is knocked to the ground by the man after reneging on the money as promised. The player takes $200 from Curtis' stash but leaves the rest as Curtis lays dazed on the ground. Curtis then goes to a cabaret club where he buys a drink and leaves the rest of his winnings with a singer who turns out to be his mother (Marshall Chapman). Gerry goes to a casino, where he tries his luck on a \"Rainbow Riches\" slot machine and fails. He then moves on to the roulette table where he places the last of his money on “00” and ends up winning. He then begins playing blackjack, where Curtis shows up at the table, out of money. Gerry is playing well, and shares his money with Curtis. After several hours of playing craps, the two have amassed a huge fortune, totaling $285,000. Curtis calls Simone and proclaims his love for her. Convinced that they cannot lose, Curtis and Gerry wager all their money on the field line. Gerry throws the dice, and the outcome is unclear.\n\nCurtis and Gerry are shown eating steak and lobster, discussing their winnings of nearly half a million dollars. They are comped a suite where they keep their cash in a large safe. The next morning, Curtis awakes to Simone calling him. He turns his phone off, and it's revealed that he has already hooked up with another stranger. Curtis looks through the apartment, only to find that Gerry has already left. In the safe, he finds his half of the money along with a note from Gerry, saying “Machu Picchu time, you beautiful loser.” Curtis checks out of the hotel, but before doing so he flirts with the checkout clerk, implying that he will never settle down with Simone, nor pursue Machu Picchu as anything but a dream. Meanwhile, Gerry re-purchases the car he sold in order to stake his final run at the casino. When he starts the car, he hears the CD previously left in the stereo that played during his earlier road trip with Curtis. The CD, which describes ways to identify the strength or weakness of your opponents' hands, begins with describing what true confidence in a person looks like. Gerry listens, his posture rising, as a reflection of the American flag can be seen on the windshield.",
  "synopsis": null
}