{
  "imdb_id": "tt2372217",
  "tmdb_id": "129953",
  "douban_id": null,
  "title": "Welcome Aboard (2012)",
  "genres": [
    "Drama"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "92 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.9,
  "director": [
    {
      "id": "nm0065449",
      "name": "Jean Becker"
    }
  ],
  "writer": [
    {
      "id": "nm3110976",
      "name": "Eric Holder",
      "description": "novel"
    },
    {
      "id": "nm2606261",
      "name": "François d'Épenoux",
      "description": "adaptation &"
    },
    {
      "id": "nm0065449",
      "name": "Jean Becker",
      "description": "adaptation"
    },
    {
      "id": "nm3527765",
      "name": "Marie-Sabine Roger",
      "description": "in collaboration with"
    }
  ],
  "cast": [
    {
      "id": "nm0156228",
      "name": "Patrick Chesnais",
      "character": "Taillandier"
    },
    {
      "id": "nm5015383",
      "name": "Jeanne Lambert",
      "character": "Marylou"
    },
    {
      "id": "nm0591877",
      "name": "Miou-Miou",
      "character": "Alice"
    },
    {
      "id": "nm0916616",
      "name": "Jacques Weber",
      "character": "Max"
    },
    {
      "id": "nm1268508",
      "name": "Xavier Gallais",
      "character": "Le maître d'hôtel"
    },
    {
      "id": "nm0332650",
      "name": "Raphaëline Goupilleau",
      "character": "La femme de l'agence"
    },
    {
      "id": "nm0126875",
      "name": "Didier Bénureau",
      "character": "Le vendeur"
    },
    {
      "id": "nm1554417",
      "name": "Julien Barbier",
      "character": "Le garçon 1"
    },
    {
      "id": "nm0133636",
      "name": "Urbain Cancelier",
      "character": "Le boucher"
    },
    {
      "id": "nm3786426",
      "name": "Amaury Baudoin",
      "character": "Mathias"
    },
    {
      "id": "nm0077987",
      "name": "Ludovic Berthillot",
      "character": "Le videur"
    },
    {
      "id": "nm0096441",
      "name": "Martine Borg",
      "character": "La bouchère"
    },
    {
      "id": "nm0154363",
      "name": "Amandine Chauveau",
      "character": "La pompiste"
    },
    {
      "id": "nm1559268",
      "name": "Jacques Develay",
      "character": "Le réceptionniste"
    },
    {
      "id": "nm5332184",
      "name": "Christophe Dias-Valerio",
      "character": "L'interne"
    },
    {
      "id": "nm5331611",
      "name": "Léana Doucet",
      "character": "La petite fille dessin       (as Léona Doucet)"
    },
    {
      "id": "nm5333802",
      "name": "Joana Eglenne",
      "character": "La présentatrice"
    },
    {
      "id": "nm0269702",
      "name": "Marc Fayet",
      "character": "Marc"
    },
    {
      "id": "nm1024314",
      "name": "Marie-Sophie Ferdane",
      "character": "Jeanne       (as Marie-Sophie Ferdane de la Comédie Française)"
    },
    {
      "id": "nm5333149",
      "name": "Christine Géricot",
      "character": "La grand-mère de Taillandier"
    },
    {
      "id": "nm5332501",
      "name": "Coralie Girard",
      "character": "La vendeuse papèterie presse"
    },
    {
      "id": "nm2912388",
      "name": "Véronique Hervouet",
      "character": "L'infirmière       (as Véronique Hervouët)"
    },
    {
      "id": "nm5333087",
      "name": "Pierrick Heurtebise",
      "character": "Le garçon 2"
    },
    {
      "id": "nm3973727",
      "name": "Maelle Le Rhun",
      "character": "Petite fille 1       (as Maëlle Le Rhun)"
    },
    {
      "id": "nm5333017",
      "name": "Maureen Le Rhun",
      "character": "Petite fille 2"
    },
    {
      "id": "nm5333343",
      "name": "Jonathan Loistron",
      "character": "Le commis boucher"
    },
    {
      "id": "nm1166361",
      "name": "Sally Micaleff",
      "character": "La mère de Marylou"
    },
    {
      "id": "nm1238556",
      "name": "Guillaume Parent",
      "character": "L'homme série TV"
    },
    {
      "id": "nm1150648",
      "name": "Boris Rehlinger",
      "character": "Le beau-père"
    },
    {
      "id": "nm5662000",
      "name": "Cécile Roger",
      "character": "La vendeuse"
    },
    {
      "id": "nm1142840",
      "name": "Thomas Séraphine",
      "character": "Hugo"
    },
    {
      "id": "nm4756195",
      "name": "Jessy Ugolin",
      "character": "Jessy"
    },
    {
      "id": "nm5333649",
      "name": "Thomas Vrignaud",
      "character": "Le passant boîte"
    },
    {
      "id": "nm5332943",
      "name": "Hippolyte Zaengel-Rose",
      "character": "Taillandier enfant"
    }
  ],
  "overview": "Despite his fame, Taillandier has suddenly stopped painting. Deeply depressed, the sixty-year-old decides to go away. He has no clear goal and explains nothing to his close friends. During his travels, he has a strange encounter with Marylou, a wild teenager who was rejected by her mother. The lost girl and the man at the end of his tether will travel together awhile. Finally living like a father and daughter, at peace.",
  "storyline": "Despite his fame, Taillandier has suddenly stopped painting. Deeply depressed, the sixty-year-old decides to go away. He has no clear goal and explains nothing to his close friends. During his travels, he has a strange encounter with Marylou, a wild teenager who was rejected by her mother. The lost girl and the man at the end of his tether will travel together awhile. Finally living like a father and daughter, at peace.",
  "plot": "This article's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (March 2015) (Learn how and when to remove this template message)\nIn 2005, scientists discover an extrasolar planet, which is named Planet G, believed to have conditions nearly identical to Earth. In 2006, NASA builds a transmission device in Hawaii that is five times more powerful than any before it, and a program to contact the planet, known as The Beacon Project, begins.\n\nMeanwhile, slacker Alex Hopper (Taylor Kitsch) gets arrested while attempting to impress Sam Shane (Brooklyn Decker), daughter of U.S. Pacific Fleet commander Admiral Terrance Shane (Liam Neeson). Infuriated at Alex's lack of motivation, Stone Hopper (Alexander Skarsgård), Alex's elder brother and a naval officer, forces him to also sign up for the U.S. Navy.\n\nIn 2012, Alex is a hothead and disrespectful lieutenant and Tactical Action Officer aboard the Arleigh Burke-class destroyer USS&#160;John Paul Jones, while Stone is a commander and the Commanding Officer of USS&#160;Sampson. Alex is in a relationship with Sam and is in danger of being discharged from the Navy. Their ships join the 2012 Rim of the Pacific Exercise (RIMPAC) in Hawaii.\n\nDuring the exercises, five alien spacecraft arrive in response to the NASA signal. Their communications ship collides with a satellite and crashes in Hong Kong, causing heavy casualties and damage while the other four (a mothership and three alien battleships) land in the water near the coast of Hawaii. Sampson, John Paul Jones, and the JMSDF Kongō-class destroyer Myōkō are ordered to investigate. Upon arrival at the indicated location, they discover a massive floating structure. Alex and two crew members, Raikes (Rihanna) and Beast (John Tui), are sent to approach the structure in an armed Zodiac.\n\nWhen Alex touches the structure, it knocks him away, and generates a massive force field that encloses the Hawaiian islands, separating the Navy ships from the RIMPAC fleet. Then, three alien battleships appear from underwater and face the three Navy ships in a defensive posture. Under Stone's orders, Sampson issues a blast from its foghorn, but one of the alien warships answers it with a damaging sonic blast, forcing Stone to order the John Paul Jones to fire a warning shot. This causes the alien warship monitors to reevaluate the Earth ships' friend or foe status, changing the color for the Navy ships from green to red and the alien ships respond with shots of their own. In the ensuing engagement, both the Sampson and the Myōkō are destroyed and sunk, and the John Paul Jones is badly damaged. In the ensuing crossfire, the Captain, the Commanding and the Executive Officers of the John Paul Jones are all killed.\n\nFrom the Zodiac, Alex sees his brother die in the explosion aboard the Sampson and returns to his ship. Being the most senior officer left on the ship, he is forced to take command, to his own disbelief and the disbelief of the crew. Now seeking revenge for his brother's death, Alex angrily orders an attack, but Beast manages to dissuade him. They recover the survivors from Myōkō, including Captain Nagata (Tadanobu Asano) with whom Alex is in a rivalry. The mothership launches shredder-drones towards Hawaii, which attack and destroy military and civilian infrastructure installations on the island of Oahu.\n\nIn Oahu, Sam, a physical therapist, is accompanying retired U.S. Army Colonel and double amputee Mick Canales (Gregory D. Gadson), on a mountain hike to help him adapt to his prosthetic legs. Sam and Mick run into some police officers who order them to get off the mountain. The officers head up the mountain but they are ambushed and killed by the aliens. Later, Sam and Mick run into scientist Cal Zapata (Hamish Linklater), who works at the communications array and informs them that the aliens have killed his grad student and taken over the communications array. They then realize that the aliens are modifying it to reestablish communications with their home planet; their shredder drones' attacks on the island's infrastructure was intended to prevent the military stationed on the island from responding.\n\nOn the John Paul Jones, naval personnel capture a semi-unconscious alien from the communications ship. The alien attacks Alex when startled by a bright light in its eye and forms a brief telepathic link with him, showing him that they have successfully attacked and conquered other planets. The other crew members are able to pry the alien off Alex. Other aliens arrive to rescue their captured comrade. One alien stays onboard, intending to sabotage the John Paul Jones' engines, and Alex kills it by tricking it into the firing line of a 5\"/54 caliber Mark 45 gun. Investigating the captured alien's helmet, Ordy (Jesse Plemons) is able to determine that the aliens are sensitive to sunlight.\n\nAshore, Zapata recovers his spectrum analyzer from the aliens. He is confronted by one in the process, but his lack of action from fear causes it to not consider him to be a threat and lets him go. Using it, Sam and Mick contact the John Paul Jones crew and inform them that in four hours, the aliens will be able to contact their planet.\n\nNow under Lieutenant Hopper's command, the John Paul Jones prepares to retaliate. As the force field has disabled their radar functions, Captain Nagata suggests using NOAA's tsunami warning buoys around Hawaii to track the alien warships. Using this strategy, the John Paul Jones destroys and sinks two of the alien battleships but are unable to hit the evasively maneuvering third warship. At dawn, they manage to make the third warship face East, where Alex and Nagata shoot out its bridge windows. Blinded by sunlight, the warship's crew is disorganized. Seizing the chance, the John Paul Jones successfully destroys it, but the Mothership retaliates with shredder-drones. The crew abandons the John Paul Jones, which is rapidly destroyed by the shredder-drones and is sunk.\n\nAlex, along with the survivors of the John Paul Jones and Myōkō return to Pearl Harbor and commandeer the USS&#160;Missouri, a decommissioned battleship turned into a museum ship. They reactivate the battleship with the aid of the retired veterans preserving her, and confront the massive floating structure, which is revealed to be a part of the submerged Mothership. In the ensuing battle, the Missouri's 16-inch main guns severely damage the mothership, disabling the force field in the process. Meanwhile, Sam, Mick and Zapata attempt to stall the aliens at the communications array. The Mothership reactivates, and prepares to fire shredder-drones. Instead of shooting the Mothership, Alex uses the last shell to destroy the communications array, cutting the aliens' contact with their home planet. Before the Missouri is destroyed, Australian F/A-18 fighters from the RIMPAC fleet arrive and destroy the shredder-drones and the mothership, eliminating the alien threat.\n\nA ceremony is held by Admiral Shane to honour the Navy personnel, where Alex is promoted to lieutenant commander. He is presented with a Silver Star and his brother's posthumous Navy Cross. After the ceremony, Alex is given an offer to become a Navy SEAL, and then asks Admiral Shane for his daughter's hand in marriage. The admiral initially refuses, but then invites Alex to lunch to discuss the matter, referencing how Alex and Sam met.\n\nIn a post-credits scene, three teenagers and a handyman in Scotland discover a crashed alien pod. When they open it, an alien hand reaches out, and they run off in terror.",
  "synopsis": null
}