{
  "imdb_id": "tt2363349",
  "tmdb_id": "228201",
  "douban_id": null,
  "title": "Trust Me (2014)",
  "genres": [
    "Drama"
  ],
  "country": "Brazil",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm2633637",
      "name": "Michel Tikhomiroff"
    }
  ],
  "writer": [
    {
      "id": "nm1992562",
      "name": "Fabio Danesi",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm1813667",
      "name": "Mateus Solano",
      "character": "Caio"
    },
    {
      "id": "nm1701859",
      "name": "Fernanda Machado",
      "character": "Mari"
    },
    {
      "id": "nm2636345",
      "name": "Fernanda D'Umbra",
      "character": "Teresa"
    },
    {
      "id": "nm0320315",
      "name": "Bruno Giordano",
      "character": "Vicente"
    },
    {
      "id": "nm0009496",
      "name": "Clarisse Abujamra",
      "character": ""
    },
    {
      "id": "nm9753190",
      "name": "Janaína Afonso",
      "character": ""
    },
    {
      "id": "nm1062371",
      "name": "Fábio Herford",
      "character": ""
    },
    {
      "id": "nm3543882",
      "name": "Patricia Pichamone",
      "character": "Paula       (as Patrícia Pichamone)"
    },
    {
      "id": "nm2864554",
      "name": "Geraldo Rodrigues",
      "character": "Dario"
    },
    {
      "id": "nm3580842",
      "name": "Antonio Saboia",
      "character": "Policial federal"
    }
  ],
  "overview": "Mari is a talented but insecure chef who dreams of running her own restaurant. She goes through a challenging professional time, taking orders from an authoritarian boss who inhibits her talent. One day she meets Caio, a charming young man who provides the conditions for her to realize her dream. Caio shows Mari that she should trust herself and open her own restaurant. However, things are not always what they seem to be.",
  "storyline": "Mari is a talented but insecure chef. She thinks she has found the man of her life once she meets Caio. However, things are not always what they seem to be.",
  "plot": "Howard Holloway (Clark Gregg) is a former child star who is now a down and struggling agent who specializes in representing child actors. Howard has an ongoing feud with more successful agent Aldo Stankas (Sam Rockwell), who has poached several of Howard's clients who were on the verge of success.\n\nAfter losing a client, Howard encounters Lydia (Saxon Sharbino), a highly talented thirteen-year-old actress, who takes a liking to him. Her crude father, Ray, has the opposite reaction and orders Howard to keep away from his daughter.\n\nHoward arranges a date with his neighbor Marcy (Amanda Peet). Soon after, Lydia receives an offer to audition for the lead role in a forthcoming big budget series of films based on a popular series of young adult vampire novels. Lydia tells the producers that Howard is her agent and he negotiates a lucrative deal for her. Later, Lydia stands by Howard when her father and the producers attempt to dump him in favor of Aldo.\n\nWhile rehearsing lines with Lydia before the audition, Howard is shocked by her angry reaction when he attempts to touch her arm. Later he goes to the hotel room she shares with her father to deliver some contracts and sees Lydia sitting on the bed sobbing, while Ray takes a shower. Howard comes to the horrifying conclusion that Ray is sexually abusing Lydia. Howard talks the situation over with Marcy who knows a lawyer specializing in family law. Howard worries that an attempt to remove Lydia from her father will be unsuccessful and will result in the scuttling of the film deal, thus losing her the money she would need to gain her independence. Howard ultimately decides to try and save Lydia and hires a lawyer to petition for her emancipation. Ray objects, but Howard accuses him of molesting Lydia. Ray denies the accusation, saying that Lydia was abused by a former agent while she was in her mother's custody. However, Ray agrees to allow the emancipation in order to avoid charges of molestation.\n\nThe day of the press conference to announce the movie's cast, Howard discovers that Lydia has gone from his apartment, where she had been staying. Heading to the conference at Grauman's Chinese Theatre, Howard discovers Lydia, now dressed in a highly sexualized fashion and with Aldo as her new manager. She explains that she needed to be rid of her father, whose drunken behavior had cost her a previous role. She implies that she lied about her father and confirms Ray's story about her being abused by a former agent. Howard tells her that he doesn't know what to believe anymore. As they enter the theater, Ray tries to break through the security cordon. While struggling with the guards he grabs one of their guns, inadvertently shooting Howard. Lydia and Marcy cradle him as he lays dying and Howard imagines himself sprouting wings and taking flight like one of the characters in the movie.",
  "synopsis": "Mari (Fernanda Machado) is a talented but insecure chef at a restaurant in São Paulo, Brazil. She thinks she has found the man of her life once she meets Caio (Mateus Solano), an amazingly charming young businessman. However, things are not always what they seem to be. And now, Mari is forced to face her self-doubt to recover what she has lost. And perhaps, achieve what she never had."
}