{
  "imdb_id": "tt2382422",
  "tmdb_id": "223954",
  "douban_id": "20490940",
  "title": "Jacky in the Kingdom of Women (2014)",
  "genres": [
    "Comedy"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "87 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm3176551",
      "name": "Riad Sattouf"
    }
  ],
  "writer": [
    {
      "id": "nm3176551",
      "name": "Riad Sattouf",
      "description": "original idea comic book screenplay adaptation dialogue"
    }
  ],
  "cast": [
    {
      "id": "nm3228320",
      "name": "Vincent Lacoste",
      "character": "Jacky"
    },
    {
      "id": "nm0001250",
      "name": "Charlotte Gainsbourg",
      "character": "La colonelle"
    },
    {
      "id": "nm0099828",
      "name": "Didier Bourdon",
      "character": "Brunu"
    },
    {
      "id": "nm0031785",
      "name": "Anémone",
      "character": "La générale"
    },
    {
      "id": "nm0094993",
      "name": "Valérie Bonneton",
      "character": "La chérife"
    },
    {
      "id": "nm0371890",
      "name": "Michel Hazanavicius",
      "character": "Julin"
    },
    {
      "id": "nm0527852",
      "name": "Noémie Lvovsky",
      "character": "Tata"
    },
    {
      "id": "nm0550341",
      "name": "Laure Marsac",
      "character": "Zani, la mère"
    },
    {
      "id": "nm4473893",
      "name": "William Lebghil",
      "character": "Vergio"
    },
    {
      "id": "nm3226187",
      "name": "Anthony Sonigo",
      "character": "Juto"
    },
    {
      "id": "nm4280460",
      "name": "India Hair",
      "character": "Corune"
    },
    {
      "id": "nm3554909",
      "name": "Béatrice de Staël",
      "character": "L'épicière"
    },
    {
      "id": "nm3529042",
      "name": "Frédéric Neidhardt",
      "character": "Le deuxième marion de Tata       (as Fred Neidhardt)"
    },
    {
      "id": "nm4422007",
      "name": "Anamaria Vartolomei",
      "character": "Zonia"
    },
    {
      "id": "nm0000420",
      "name": "Valeria Golino",
      "character": "Bradi Vune       (as Valéria Golino)"
    },
    {
      "id": "nm0222922",
      "name": "Emmanuelle Devos",
      "character": "La présentatrice télé"
    },
    {
      "id": "nm3176551",
      "name": "Riad Sattouf",
      "character": "Mit Kronk"
    },
    {
      "id": "nm5367780",
      "name": "Ida Février",
      "character": "Fillette Museau 1"
    },
    {
      "id": "nm4943565",
      "name": "Olga Milshtein",
      "character": "Fillette Museau 2"
    },
    {
      "id": "nm6270175",
      "name": "Nia Bezarashvili",
      "character": "Fillette Museau 3"
    },
    {
      "id": "nm6024425",
      "name": "Emile Bravo",
      "character": "Speaker 1"
    },
    {
      "id": "nm2072440",
      "name": "Nicolas Maury",
      "character": "Speaker 2"
    },
    {
      "id": "nm0590594",
      "name": "Oury Milshtein",
      "character": "Présentateur bus"
    },
    {
      "id": "nm5115659",
      "name": "Solveig Maupu",
      "character": "Militaire Museau 1"
    },
    {
      "id": "nm5261341",
      "name": "Julie Moulier",
      "character": "Militaire Museau 2"
    },
    {
      "id": "nm6270176",
      "name": "Valérie Trajanowski",
      "character": "Cousine Julin 1"
    },
    {
      "id": "nm0078156",
      "name": "Marie Berto",
      "character": "Cousine Julin 2"
    },
    {
      "id": "nm1203225",
      "name": "Marine Kulumbegashvili",
      "character": "Etranger 1       (as Marina Kulumbegashvili)"
    },
    {
      "id": "nm6270177",
      "name": "Mamuka Kudaya",
      "character": "Etranger 2"
    },
    {
      "id": "nm6270178",
      "name": "David Davitaia",
      "character": "Etranger 3"
    },
    {
      "id": "nm3923599",
      "name": "Avi Liani",
      "character": "Etranger 4       (as Nikoloz Avaliani)"
    },
    {
      "id": "nm5714833",
      "name": "Giorgi Ramishvili",
      "character": "Etranger 5"
    },
    {
      "id": "nm2198215",
      "name": "Blutch",
      "character": "Le fiancé"
    },
    {
      "id": "nm6280226",
      "name": "Gaspard Darley",
      "character": "Ami Museau"
    },
    {
      "id": "nm6270179",
      "name": "Nino Loseliani",
      "character": "La mère scandalisée"
    }
  ],
  "overview": "The film is set in a world, the Popular Democratic Republic of Bubunne, in which women hold the power and men are forced to wear veils and stay at home.",
  "storyline": "In the Kingdom of Bubunne, women are in power while men wear veils and do domestic tasks. Jacky, a lovely young man who dreams of marrying the 'Colonelle' has to struggle like a Cinderella to realize his dreams.",
  "plot": "The film takes place in the fictional state of Bubunne (or Bubunia), a matriarchal totalitarian country led by the ruthless La Générale (Generaless). In Bubun, the roles of men and women are reversed, up to the point where the male population is deprived of any civil rights, including work, education, military service, freedom of marriage etc. People worship The White Horses (making horses sacred animals) and the only source of nourishment is \"paste\" (tasteless viscous liquid delivered from waterpipe-like sinks). The country is isolated from the rest of the world, borders are guarded by armed squads, and public executions are in order (the condemned being mostly men).\n\nJacky is an over-popular handsome young man, lives in poverty with his widow mother, crushs on La Colonelle (Coloness), the Generaless's daughter and the future leader of the state. Jacky is also one of the few boys with at least some education: his paternal uncle Julin (Michel Hazanavicius), gigolo and contrabandist, also a masculism revolutionist, teaches the nephew literacy. Jacky's maternal aunt, with two husbands, is quite rich and her two sons constantly bully Jacky for being so poor.\n\nGeneraless proclaims a grand ball, at which the Lead Rider (the current leader's husband) will be chosen for her daughter as she succeeds to become ruler of Bubun. Jacky's mother cannot afford a ticket to the ball, and Jacky desperately tries to make Julin give up the \"treasure\" left by Jacky's father. Jacky reports Julin to the police, yet unexpectedly authorities find Julin guilty of treason (printing illegal pamphlets) and incarcerate him for subsequent hanging. Sheriffess, grateful to Jacky for informing her, leaves him a free ticket to the ball.\n\nAfter Jacky's mother dies (ironically, due to Jacky's own actions; sleepless because of the ball preparations, he cleaned her boots so well that she slipped), his aunt takes him in, but refuses to let him come to the ball. At this point, Jacky flees the village, only to be caught by Sherifess and immediately rescued by Julin (who escaped imprisonment by \"riding wardens until they were knocked out\"). Together, they manage to get to the palace. While Julin intends to sell his stash of vegetables and get money for crossing the border, Jacky wants to get to the ceremony and confess his love to Coloness.\n\nDuring the ball, Coloness invites Jacky (disguised as a female officer) to her quarters and tells him that she does not want to be the new Generaless, and tries to seduce him (believing Jacky to be a woman). The Generaless, however, interrupts them, as she has already chosen the Lead Rider for her daughter. Jacky's cover is blown when his relatives recognize him, and he finally tells the Coloness he loves her, revealing himself to be a man. When Generaless orders Jacky to be caught and killed, he ventures deeper into the palace, discovering that \"paste\" is actually processed and enriched feces (as the Generaless's adjutant puts it, \"the poor eat their own shit and are happy\"). To reveal the truth, Jacky overloads the main cauldron, making the country realize what their food is made of.\n\nHiding under the Coloness's bed, Jacky convinces her of his love and spends a night with her, stating that he will love her regardless of who she is. In the morning, she shows him a crowd of men outside the palace: the entire country believes Jacky to be a hero (not without Julin's provocation). Jacky is then captured and sentenced to death, yet Generaless offers him a deal: life and marriage to her daughter in exchange for his cooperation in preventing rebellion. When he agrees, she tries to cut off his tongue (stating that Jacky \"has seen too much\"), but is immediately strangled to death by Coloness.\n\nTogether, the two open the borders of Bubun, establish democracy and introduce total equality, as well as restore the country's agriculture. In the last scene, when Coloness and Jacky are about to officially marry, they announce that Bubunia wants \"no more secrets from its people\" and strip naked in front of the crowd, revealing that Coloness is actually a man, and that they, in fact, just entered gay marriage (since Generaless had no daughters despite years of trying, she wanted her last child to become the state leader despite being male). The film ends with a woman from the crowd yelling \"Blasphemy!\".",
  "synopsis": null
}