{
  "imdb_id": "tt2367988",
  "tmdb_id": "291165",
  "douban_id": null,
  "title": "Hell's Caretaker (2013)",
  "genres": [
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "75 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.3,
  "director": [
    {
      "id": "nm5239516",
      "name": "Philip Cappello"
    }
  ],
  "writer": [
    {
      "id": "nm5239516",
      "name": "Philip Cappello",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm5243237",
      "name": "Aya Beldi",
      "character": "Isabella       (as Aya Shapovalov)"
    },
    {
      "id": "nm7698802",
      "name": "Lauren Cano Zambrano",
      "character": "Hostage"
    },
    {
      "id": "nm4464923",
      "name": "Sean Deblat",
      "character": "Rich"
    },
    {
      "id": "nm8024847",
      "name": "Danielle Kaye",
      "character": "Mechanic"
    },
    {
      "id": "nm5242962",
      "name": "Leon Kirkland",
      "character": "Leon"
    },
    {
      "id": "nm1367411",
      "name": "Jodi Lin",
      "character": "Fernanda"
    },
    {
      "id": "nm1432931",
      "name": "Patrick T. McGowan",
      "character": "The Caretaker"
    },
    {
      "id": "nm4567084",
      "name": "Alexandra Mingione",
      "character": "Mindy"
    },
    {
      "id": "nm3285318",
      "name": "Joey Mintz",
      "character": "Sam"
    },
    {
      "id": "nm4931271",
      "name": "Ian Schulz",
      "character": "D.J."
    }
  ],
  "overview": "Sam's faithful dog is sick and must be put down, so he and his friends decide to take the dog to his remote home in Vermont for one last party weekend. This is the story of six friends, an old dog, and a very bad man.",
  "storyline": "First he took care of the house; then he took care of the people.",
  "plot": "Clara Oswald is struggling to maintain two separate lives: one as the Doctor's companion and the other as a school teacher at Coal Hill School, while also having a relationship with fellow teacher Danny Pink. Preparing for his next outing, the Doctor informs Clara that she cannot join him as he is going under \"deep cover\". The next morning in the school staffroom, the head teacher presents a temporary caretaker: the Doctor, under the alias John Smith. Clara eventually learns the Doctor's actual purpose is the presence of a murderous robot called the Skovox Blitzer located near the school, which contains enough firepower to destroy the planet. Clara tells the Doctor to leave it alone, but the Doctor explains that if he does not act, someone will attack it and it will begin to destroy Earth. He intends to draw it to the school at night when it is empty and use a time displacement vortex to displace it a billion years into the future where it can't harm anyone. He is in the process of planting devices around the school to generate the vortex. He also demonstrates an invisibility watch, which he will use to avoid detection by the Skovox.\n\nWhile at the school, the Doctor encounters Danny. Learning he is a former soldier, the Doctor assumes he is a PE teacher, claiming he cannot believe Danny is actually a Maths teacher. Soon afterwards, the Doctor assumes that Clara has an interest in another teacher, Adrian, due to his appearance being similar to that of his previous incarnation, the Eleventh Doctor. The Doctor tacitly approves of Clara's relationship. Danny, however, becomes suspicious of the Doctor. One of Clara and Danny's students, Courtney Woods, also becomes skeptical of him when she sees the TARDIS hidden inside his cupboard.\n\nWorking late, Danny discovers one of the Doctor's time vortex devices. He inadvertently changes the settings by removing one of them. The Doctor lures the Skovox Blitzer to the school in the evening when it is deserted, but due to the settings change, is only able to displace the creature 73 hours forward. Danny is alarmed and dazed after learning of Clara's double life; he initially assumes that she is an alien and the Doctor is her father. Explaining the truth to him, Clara allows Danny to observe her interactions with the Doctor, using the Doctor's invisibility watch. The Doctor sees through this, and an argument arises between him and Danny out of mutual contempt before Clara blurts out that she loves Danny.\n\nDuring Parents' Evening at the school, the Skovox re-materialises earlier than the Doctor estimated. With Clara acting as a decoy, the Skovox is drawn to the Doctor. The Doctor stalls the Skovox by using a device to imitate its commander, but accidentally triggers a self-destruct protocol. Luckily, with Danny's last minute intervention, they are able to order the Skovox Blitzer to stand down. Soon after, the Doctor sends the Skovox drifting into space, with Courtney as a passenger in the TARDIS; she gets sick, overwhelmed by what she sees. Later, during a heart-to-heart, Danny explains to Clara that he is impressed that the Doctor can push her to act without fear. But, he also tells Clara to let him know if the Doctor pushes her too far, so that he can help her. If she does not, then their relationship is through.\n\nMeanwhile, a community support officer, vaporised by the Skovox a few days prior, awakens in the Promised Land. The interviewer (named \"Seb\" in the credits) informs the officer of his death and their whereabouts, and states that Missy is too busy to deal with him.\nContinuity\n\nCoal Hill School, at which Clara and Danny are both employed, was originally featured in An Unearthly Child, the first episode of Doctor Who. It later reappeared in the Seventh Doctor story Remembrance of the Daleks, and was recently seen in \"The Day of the Doctor\", \"Into the Dalek\" and \"Listen\".\n\nThe Doctor's opening the TARDIS doors by snapping his fingers was first demonstrated by the Tenth Doctor in \"Forest of the Dead\" and was done on occasion during the Eleventh Doctor's tenure, starting with \"The Eleventh Hour\". Clara's ability to do this was shown in the fiftieth anniversary special \"The Day of the Doctor\".\n\nThe pseudonym \"John Smith\" has been used by the Doctor multiple times throughout the show, starting in The Wheel in Space. The name was most prominent as the Third Doctor's alias during his time with UNIT and the Tenth Doctor's usage in \"School Reunion\", \"Human Nature\" and \"The Family of Blood\".\n\nThe Doctor mentions River Song, who last appeared in \"The Name of the Doctor\".\n\nThe Doctor believes that \"artron emissions\" may be the cause of the Skovox's appearance. Artron energy was first mentioned in The Deadly Assassin.",
  "synopsis": null
}