{
  "imdb_id": "tt2312602",
  "tmdb_id": "123431",
  "douban_id": null,
  "title": "Reincarnated (2012)",
  "genres": [
    "Documentary",
    "Music"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "96 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm5287471",
      "name": "Andy Capper"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm5287147",
      "name": "Theocracy Reign Ivine Order of the Nyahbinghi",
      "character": ""
    },
    {
      "id": "nm0236564",
      "name": "Dr. Dre",
      "character": "Himself"
    },
    {
      "id": "nm0226920",
      "name": "Daz Dillinger",
      "character": "Himself"
    },
    {
      "id": "nm5228032",
      "name": "Angela Hunte",
      "character": "Herself"
    },
    {
      "id": "nm4219498",
      "name": "Ariel Rechtshaid",
      "character": "Himself"
    },
    {
      "id": "nm5287592",
      "name": "Dre Skull",
      "character": "Himself"
    },
    {
      "id": "nm5285765",
      "name": "Jahdan Blakkamoore",
      "character": "Himself"
    },
    {
      "id": "nm5287685",
      "name": "Andrew aka Moon Bain",
      "character": "Himself"
    },
    {
      "id": "nm0906467",
      "name": "Bunny Wailer",
      "character": "Himself"
    },
    {
      "id": "nm1233372",
      "name": "Damian Marley",
      "character": "Himself"
    },
    {
      "id": "nm5287711",
      "name": "Dave Dale and The Blue Mountain Coffee House Boys",
      "character": ""
    },
    {
      "id": "nm5287391",
      "name": "Sister Shirley Chung and Winston Martin",
      "character": ""
    },
    {
      "id": "nm5286927",
      "name": "The Alpha Boys",
      "character": ""
    },
    {
      "id": "nm5286867",
      "name": "Scaby Dread and the Dudus Family",
      "character": ""
    },
    {
      "id": "nm5286735",
      "name": "Cutty Corn",
      "character": "Himself"
    },
    {
      "id": "nm0268093",
      "name": "Louis Farrakhan",
      "character": "Himself"
    },
    {
      "id": "nm3074905",
      "name": "Shante Broadus",
      "character": "Herself"
    },
    {
      "id": "nm5287700",
      "name": "Cori Broadus",
      "character": "Herself       (as Cori B.)"
    },
    {
      "id": "nm5286218",
      "name": "Maxine Stowe",
      "character": "Herself"
    },
    {
      "id": "nm0004841",
      "name": "Stewart Copeland",
      "character": "Himself"
    },
    {
      "id": "nm3276191",
      "name": "Diplo",
      "character": "Himself"
    },
    {
      "id": "nm0004879",
      "name": "Snoop Dogg",
      "character": "Himself       (as Snoop Lion)"
    }
  ],
  "overview": "Evolution as an artist is often times what separates legends from the more mundane. After being heavily influenced by his experience in Jamaica – and his subsequent name change from Snoop Dogg to Snoop Lion – the LBC showman prepares his latest reggae-infused album Reincarnated. As part of the process, VICE followed Snoop to the island nation as he recorded various songs with backing from Diplo, Ariel Reichtshaid and Dre Skull of Major Lazer. Having grown tired of what rap provided him, the documentary reveals the rebirth and inspiration for his latest project.",
  "storyline": "Hip Hop legend Snoop Dogg teamed up with VICE on a spiritual journey to Jamaica to reflect on his past career, including his failures, loves, regrets and losses. With this journey, Snoop intends to reincarnate himself as a Pop Reggae artist by immersing himself in Rastafari, exploring musical and religious histories deeply rooted in Jamaica. His pilgrimage begins with a jaunt to a mountain-side ganja farm run by Rastas, revealing the underbelly of the Jamaican drug market. Snoop then heads down to the troubled areas of Trenchtown and Tivoli Gardens; revealing a neglected ghetto population and rampant police brutality following the exile of drug lord Chris \"Coke\" Dudus. Snoop also stops by the famous Alpha Boys School for an impromptu jam session. A school which has seen countless Reggae musicians pass through its youth orchestra. Snoop allows unprecedented access to his inner-workings as he makes his new album with Diplo and Angela Hunte, author of the smash hit song Empire State Of ...",
  "plot": "As most of those who follow the Rastafarian faith do, Snoop decided to go through a transformation into his new self; his new, Rastafarian self. Reincarnated documents Snoop Dogg’s transition into Snoop Lion, which involved him taking a trip to Jamaica to make a reggae album and discover more about the Rastafarian faith. The documentary starts out by exploring Snoop’s past; his time on Death Row Records, the loss of his friends Tupac and Nate Dogg, and the murder accusation. The focus then shifts to his spiritual journey and new style of music. While in Jamaica, Snoop collaborated with a few famous reggae artists, including Bunny Wailer and Diplo, to create the Reincarnated (album), which focuses on love and nonviolence. Wailer was Snoop’s guide throughout the trip, leading him through his journey into Rastafarianism. The film includes many intimate moments with Snoop, where he discusses his personal thoughts and reasons for becoming Rasta. The documentary also includes the heavy marijuana smoking in which Snoop participated, which is a common practice among Rastafarians, and a common stereotype of how they practice their faith as well.",
  "synopsis": "The documentary follows Snoop Dogg as he journeys to Jamaica to record an album with Diplo. While there, Snoop finds himself embraced by the Jamaican people, is positively impacted by Rastafarian culture, and becomes reincarnated as Snoop Lion."
}