{
  "imdb_id": "tt2345539",
  "tmdb_id": "154083",
  "douban_id": null,
  "title": "Extraños en la noche (2012)",
  "genres": [
    "Comedy",
    "Crime",
    "Mystery",
    "Romance"
  ],
  "country": "Argentina",
  "version": [
    {
      "runtime": "93 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.5,
  "director": [
    {
      "id": "nm1210360",
      "name": "Alejandro Montiel"
    }
  ],
  "writer": [
    {
      "id": "nm1885928",
      "name": "Daniel Cúparo",
      "description": null
    },
    {
      "id": "nm1210360",
      "name": "Alejandro Montiel",
      "description": null
    },
    {
      "id": "nm1210677",
      "name": "Mili Roque Pitt",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0868610",
      "name": "Diego Torres",
      "character": "Martín"
    },
    {
      "id": "nm1600802",
      "name": "Julieta Zylberberg",
      "character": "Sol"
    },
    {
      "id": "nm0892861",
      "name": "Fabián Vena",
      "character": "Freddy"
    },
    {
      "id": "nm1741921",
      "name": "Ludovico Di Santo",
      "character": "Emilio"
    },
    {
      "id": "nm4991086",
      "name": "Laura Conforte",
      "character": "Claudia"
    },
    {
      "id": "nm1252927",
      "name": "Daniel Rabinovich",
      "character": "Héctor"
    },
    {
      "id": "nm0089621",
      "name": "Betiana Blum",
      "character": "Susana"
    },
    {
      "id": "nm0034330",
      "name": "Fabián Arenillas",
      "character": "Taxista"
    },
    {
      "id": "nm3383763",
      "name": "Bendita Berlín",
      "character": "Sra. Jasinsky"
    },
    {
      "id": "nm0133167",
      "name": "Daniel Campomenosi",
      "character": "Josami"
    },
    {
      "id": "nm4985201",
      "name": "Guillermo Giusto",
      "character": "Borracho"
    },
    {
      "id": "nm4990375",
      "name": "Jorge Gregorio",
      "character": "Senador Fernández Claro"
    },
    {
      "id": "nm1425441",
      "name": "Analía Malvido",
      "character": "Oficial Constantini"
    },
    {
      "id": "nm4990343",
      "name": "Johana Miedvietzki",
      "character": "Conserje"
    },
    {
      "id": "nm1526093",
      "name": "Montenegro",
      "character": "Guardaespaldas"
    },
    {
      "id": "nm0608326",
      "name": "Iván Moschner",
      "character": "Aurelio"
    },
    {
      "id": "nm2017133",
      "name": "Alexia Moyano",
      "character": "Mechi"
    },
    {
      "id": "nm4939233",
      "name": "Haien Qiu",
      "character": "Yoko"
    },
    {
      "id": "nm3419916",
      "name": "Carolina Solari",
      "character": "Novia senador"
    },
    {
      "id": "nm4990786",
      "name": "Ángela Torres",
      "character": "Azul       (as Ángela Caccia Torres)"
    },
    {
      "id": "nm4990833",
      "name": "Ricardo Truppel",
      "character": "Kaminsky"
    }
  ],
  "overview": null,
  "storyline": "When Martín and Sol try to solve the enigma of a missing neighbor, they will discover that nothing is what it seems, that your hearing can trick you just like your imagination and that your heart is a double-edged weapon.",
  "plot": "Steve Butler (Damon) has caught the eyes of top management at his employer, Global Crosspower Solutions, an energy company that specializes in obtaining natural gas trapped underground through a process known as fracking. Butler has an excellent track record for quickly and cheaply persuading land owners to sign mineral rights leases that grant drilling rights over to his employer. Butler and his partner Sue Thomason (McDormand) arrive in an economically struggling Pennsylvania farming town whose citizens are proud of having family farms passed from one generation to the next. Coming from a town and a life very similar to that of the people he is now determined to win over on behalf of Global, Butler tells the story of how his own town died after the local Caterpillar assembly plant closed. The idea of a town surviving solely on family farms being passed down through generations as a viable economy is one that he can no longer accept. He claims to be offering the town its last chance. Butler spends some pleasant after-hours time with Alice, a teacher he meets in a bar.\n\nThe community seems willing to accept Global's offer, until an elderly, local high school science teacher, Frank Yates (Holbrook), who happened to be a successful engineer in his working life, raises the question of the safety of fracking during a town meeting. It's decided that the people will vote in a few weeks whether or not to take the offer. After hearing about the vote, Dustin Noble (John Krasinski), an unknown environmental advocate, starts a grassroots campaign against Global, motivated by a tale of his family losing its Nebraska dairy farm after the herd died as a result of Global's industry-standard fracking process.\n\nButler begins to meet a great deal of resistance in town. Noble seems to be winning over nearly everyone, including Alice. One night Butler receives a package from Global that includes an enlarged copy of a photograph of dead cattle on a field that Noble said came from his family's Nebraska farm. The enlargement shows that an object thought to be a silo is in fact a lighthouse, which are nonexistent in Nebraska, revealing that Noble fabricated his story and deceived the people. The picture was in fact from Lafayette, Louisiana, where Global is in the midst of a lawsuit over environmental complications that were probably caused by their fracking practices.\n\nButler informs the town's mayor of the deception, who in turn informs the rest of the town. He returns to the hotel to find Noble loading his truck, preparing to leave town. Noble accidentally reveals that he knows the picture with the lighthouse was taken in Lafayette. Butler realizes that the only way Noble could have known this is if he were also employed by Global, and that Noble's job had been to discredit the environmental movement and, at the last minute, convince the town to vote in favor of Global's offer. He arranged for Butler to receive the \"confidential\" photos and engineered the entire public relations effort.\n\nAt a town meeting the next day, the citizens are prepared to vote on Global's efforts to buy drilling rights to their property. Butler talks to them about how the barn in the picture reminds him of his grandfather's barn. He reveals that Noble had manipulated them and is employed by Global. Butler leaves the meeting to find Thomason on the phone with Global. She tells him that he's fired and that she is leaving for New York. Butler walks to Alice's home and she welcomes him in.",
  "synopsis": null
}