{
  "imdb_id": "tt2376440",
  "tmdb_id": "299359",
  "douban_id": null,
  "title": "The Cabining (2014)",
  "genres": [
    "Comedy",
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "83 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.2,
  "director": [
    {
      "id": "nm1621625",
      "name": "Steve Kopera"
    }
  ],
  "writer": [
    {
      "id": "nm1621625",
      "name": "Steve Kopera",
      "description": "writer"
    },
    {
      "id": "nm2603498",
      "name": "David Silverman",
      "description": "storyline consultant"
    }
  ],
  "cast": [
    {
      "id": "nm1619193",
      "name": "Mike Kopera",
      "character": "Todd"
    },
    {
      "id": "nm0445180",
      "name": "Bo Keister",
      "character": "Bruce"
    },
    {
      "id": "nm3016406",
      "name": "Angela Relucio",
      "character": "Mindy"
    },
    {
      "id": "nm0781728",
      "name": "Melissa Mars",
      "character": "Celeste"
    },
    {
      "id": "nm0366890",
      "name": "Luce Rains",
      "character": "Jasper"
    },
    {
      "id": "nm0726223",
      "name": "Richard Riehle",
      "character": "Sarge"
    },
    {
      "id": "nm4432494",
      "name": "Mark Rademacher",
      "character": "Monroe"
    },
    {
      "id": "nm1679296",
      "name": "Chuck Saale",
      "character": "Detective Berwyn"
    },
    {
      "id": "nm3475407",
      "name": "Joseph Barone",
      "character": "Detective Conner"
    },
    {
      "id": "nm4442876",
      "name": "Jackson Thompson",
      "character": "Larson"
    },
    {
      "id": "nm3407240",
      "name": "Alice Sherman",
      "character": "Lacey"
    },
    {
      "id": "nm5017342",
      "name": "Peter M. Howard",
      "character": "Lacey's Boyfriend"
    },
    {
      "id": "nm1372971",
      "name": "Blake Silver",
      "character": "Sha-Rin"
    },
    {
      "id": "nm2394385",
      "name": "Robin Dionne",
      "character": "Sonya"
    },
    {
      "id": "nm1101485",
      "name": "Ian Michaels",
      "character": "Anton"
    },
    {
      "id": "nm4528026",
      "name": "Rachel Chapman Kopera",
      "character": "Blair"
    },
    {
      "id": "nm3033420",
      "name": "Sarah Smick",
      "character": "Cary"
    },
    {
      "id": "nm2096260",
      "name": "Scott Connors",
      "character": "Dale"
    },
    {
      "id": "nm2421181",
      "name": "Danny Mooney",
      "character": "Jake"
    },
    {
      "id": "nm4776572",
      "name": "Libby Conner",
      "character": "Bethany       (as Elle Sunkara)"
    },
    {
      "id": "nm5326615",
      "name": "Trenton L. Culkin",
      "character": "Bethany's Boytoy       (as Trenton L. Dirkse)"
    },
    {
      "id": "nm1621855",
      "name": "Michael Wilk",
      "character": "Robber /              Mother Acid Roadie"
    },
    {
      "id": "nm2796339",
      "name": "Casey Webb",
      "character": "Robber /              Strip Poker Aficionado /              T's Girlfriend on Wednesday and Saturday"
    },
    {
      "id": "nm8077486",
      "name": "Benjamin Bergmann",
      "character": "Policeman"
    },
    {
      "id": "nm8077487",
      "name": "George Lasater Sr.",
      "character": "Policeman"
    },
    {
      "id": "nm8077488",
      "name": "George Lasater Jr.",
      "character": "Policeman       (as Sgt. George Lasater Jr.)"
    },
    {
      "id": "nm8077489",
      "name": "Danielle Henderson",
      "character": "Forensic Team"
    },
    {
      "id": "nm8077490",
      "name": "Alicia Swartzendruber",
      "character": "Forensic Team"
    },
    {
      "id": "nm8077491",
      "name": "Alison Wright",
      "character": "Forensic Team"
    },
    {
      "id": "nm3029344",
      "name": "Lauren Mae Shafer",
      "character": "Yoga Girl"
    },
    {
      "id": "nm3629479",
      "name": "Brittany Freeth",
      "character": "Yoga Girl"
    },
    {
      "id": "nm1407695",
      "name": "Melanie Rashbaum",
      "character": "Yoga Girl"
    },
    {
      "id": "nm4726023",
      "name": "Kaitlyn Benetz",
      "character": "Yoga Girl"
    },
    {
      "id": "nm2684368",
      "name": "Jane Flowers",
      "character": "Bar Patron       (as Jane Bacon)"
    },
    {
      "id": "nm5337895",
      "name": "Amy Biven",
      "character": "Bar Patron"
    },
    {
      "id": "nm5337892",
      "name": "Vanessa Sterling",
      "character": "Bar Patron"
    },
    {
      "id": "nm5541978",
      "name": "Tyrone Evenson",
      "character": "Studio Engineer"
    },
    {
      "id": "nm5541935",
      "name": "Alexander H. Trice",
      "character": "Engineer's Assistant"
    },
    {
      "id": "nm5541979",
      "name": "Beth Stalker",
      "character": "T's Girlfriend on Monday and Thursday"
    },
    {
      "id": "nm5541926",
      "name": "Ally Evenson",
      "character": "T's Girlfriend on Tuesday and Friday"
    },
    {
      "id": "nm5541916",
      "name": "Jacob Drotar",
      "character": "Hungover Intern"
    },
    {
      "id": "nm4059080",
      "name": "Brian Hobbs",
      "character": "Sarge's (Other) Nephew"
    },
    {
      "id": "nm5541955",
      "name": "Peter A. Larson",
      "character": "Felcher       (as Peter Larson)"
    },
    {
      "id": "nm3118241",
      "name": "Steve Sholtes",
      "character": "Unquestioned Lord and Master of the Eternal Dance"
    },
    {
      "id": "nm5541948",
      "name": "Pauly Zimmer",
      "character": "'T'"
    }
  ],
  "overview": "Todd and Bruce, a hapless screenwriting team, get one last shot at success thanks to Todd's wealthy uncle, Sarge. If they pen a worthy horror script, Sarge will fund the entire project. But there is one condition - the script must be complete in two weeks. With the deadline looming and no fresh ideas, Todd and Bruce head to Shangri-La, a serene artist's retreat, with the hope that the peace and company of fellow artists will inspire greatness... or, failing greatness, at least enough for straight-to-DVD. Shangri-La proves to be anything but serene, as the artists die off one by one, seemingly by accident. Bruce convinces Todd to soak in this morbid atmosphere to help with the writing, but soon those two are fighting for their lives as well.",
  "storyline": "Todd and Bruce, a hapless screenwriting team, get one last shot at success thanks to Todd's wealthy uncle, Sarge. If they pen a worthy horror script, Sarge will fund the entire project. But there is one condition - the script must be complete in two weeks. With the deadline looming and no fresh ideas, Todd and Bruce head to Shangri-La, a serene artist's retreat, with the hope that the peace and company of fellow artists will inspire greatness... or, failing greatness, at least enough for straight-to-DVD. Shangri-La proves to be anything but serene, as the artists die off one by one, seemingly by accident. Bruce convinces Todd to soak in this morbid atmosphere to help with the writing, but soon those two are fighting for their lives as well.",
  "plot": "A hermit walking in the woods comes across his dog. He tries to get the dog's attention, but the dog is dead due to a bloody infection, and the hermit comes into contact with the infected blood.\n\nA group of college students, Jeff, Marcy, Paul, Karen, and Burt, take a vacation to a remote cabin in the woods to celebrate the start of spring break. Jeff and Marcy are in a physical relationship, while Paul has had a crush on childhood friend Karen since seventh grade. Burt is the proverbial \"fifth wheel\" of the group. Upon their visit to a local convenience store, they meet an unusual boy named Dennis, who has a tendency to bite people. When the five get to the cabin, Jeff and Marcy have sex while Paul and Karen go for a swim. Meanwhile, Burt goes out to shoot squirrels with his rifle, but ends up shooting the hermit, now disfigured and bloody. The hermit flees, but Burt does not tell anyone about the incident.\n\nThat night, the friends gather around a campfire, where they are joined by a friendly drifter named Justin, who prefers to be called Grimm, and his angry dog, Dr. Mambo. After they share some marijuana, it starts to rain, so Grimm leaves with his dog to pack up his stuff. While the friends wait for Grimm indoors, the hermit returns, in a much worse state than before and begging for help. Burt shuts the door on the sick hermit, who then tries to steal the group's car, while vomiting blood all over it. When the hermit threatens Marcy and Karen, Paul accidentally sets the hermit on fire while trying to ward him off. The group looks for help the next day. Jeff and Burt find a helpful neighbor, but leave when they find out she's the dead hermit's cousin. To make matters worse, Dr. Mambo begins harassing the group. Paul later gets assistance from police Deputy Winston, who promises to send up a tow truck, but in the meantime encourages Paul to have a good time and party. Paul goes on to comfort Karen, who is upset over the killing of the hermit. After he calms her down, it appears Paul is finally going to have sex with her, but when he goes to touch her, he discovers a massive bloody infection on her thigh. The group isolates her in a shed outside of the cabin.\n\nAfter fixing the truck, Burt begins coughing up blood, revealing he is infected, but does not tell the others. After Karen vomits blood on the truck, Jeff takes the group's remaining beer and leaves. Burt goes back to the convenience store to get help, but incurs the wrath of Dennis's father after inadvertently infecting Dennis with the disease when Dennis bites him. Showing more signs of infection, Burt flees, chased by Dennis's father and two friends. Back at the cabin, Marcy laments the likelihood that they will all eventually get the disease. When Paul tries to comfort her, she seduces him and they impulsively have sex. Shortly afterward, she discovers sickly welts on her back, revealing that she has the disease and that she has consequently infected Paul too, as they didn't use a condom. Immediately regretting the affair, Paul leaves while Marcy takes a bath, crying. When she shaves her legs the flesh begins to peel off and she runs outside in a panic, where she is chased and killed by Dr. Mambo who tears her apart.\n\nMeanwhile, Paul discovers the dead body of the hermit floating in a reservoir and realizes the infection has been spreading through the drinking water. After racing back to the cabin, Paul finds Marcy's gory remains and Dr. Mambo feeding on Karen in the shed. After killing Dr. Mambo with Burt's gun, Paul puts Karen out of her misery by beating her to death with a shovel. A dying Burt later returns to the cabin, still pursued by Dennis's father and his two companions. Burt is brutally killed by the posse who shoot him, before Paul kills all three of them. After killing Dennis' father and his friends, Paul sets out to find Jeff. Finding the dismembered body of Grimm and discovering early signs that he is infected, Paul takes the group from the convenience store's truck and hits a deer, covering him in blood. He later reunites with Deputy Winston, who is partying with underage drinkers. After Winston is radioed about several infected people in a cabin going on a killing spree, Paul attacks and infects several of Winston's friends before knocking Winston out. Paul is later picked up by a passing truck and dropped off at a hospital. There, he is interrogated about the virus, but he cannot provide any response. The sheriff tells Winston to \"take care\" of Paul. Paul tries to warn Winston about the drinking water by saying \"water...\" but Winston only responds by dumping him at the edge of a creek.\n\nThe next day, Jeff, who has been hiding out and drinking in the woods, returns to the cabin. Initially crying after seeing the remains of his friends, he later becomes ecstatic upon realizing he is the only one who made it without being infected. As he raises his arms in victory, he is gunned down and killed by several police officers, who burn his body along with the others. Back at the convenience store, a couple of children sell lemonade, that they have made with water from the creek Paul was dumped in, to the same police officers. In addition, a large truck, filled with bottles of water taken from the creek, can be seen leaving the store.",
  "synopsis": null
}