{
  "imdb_id": "tt2339741",
  "tmdb_id": "288158",
  "douban_id": null,
  "title": "The Woman in Black 2: Angel of Death (2014)",
  "genres": [
    "Drama",
    "Horror",
    "Thriller"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "98 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.9,
  "director": [
    {
      "id": "nm2197777",
      "name": "Tom Harper"
    }
  ],
  "writer": [
    {
      "id": "nm1638619",
      "name": "Jon Croker",
      "description": "screenplay"
    },
    {
      "id": "nm1638619",
      "name": "Jon Croker",
      "description": "writer"
    },
    {
      "id": "nm0384702",
      "name": "Susan Hill",
      "description": "writer story"
    }
  ],
  "cast": [
    {
      "id": "nm4555381",
      "name": "Phoebe Fox",
      "character": "Eve Parkins"
    },
    {
      "id": "nm6080535",
      "name": "Merryn Pearse",
      "character": "Girl in Tube"
    },
    {
      "id": "nm0741192",
      "name": "Mary Roscoe",
      "character": "Woman in Tube"
    },
    {
      "id": "nm0567031",
      "name": "Helen McCrory",
      "character": "Jean Hogg"
    },
    {
      "id": "nm6076321",
      "name": "Amelia Crouch",
      "character": "Flora"
    },
    {
      "id": "nm5011427",
      "name": "Amelia Pidgeon",
      "character": "Joyce"
    },
    {
      "id": "nm4688151",
      "name": "Casper Allpress",
      "character": "Fraser"
    },
    {
      "id": "nm5991237",
      "name": "Pip Pearce",
      "character": "James"
    },
    {
      "id": "nm4356583",
      "name": "Leilah de Meza",
      "character": "Ruby"
    },
    {
      "id": "nm4643221",
      "name": "Jude Wright",
      "character": "Tom"
    },
    {
      "id": "nm6054323",
      "name": "Alfie Simmons",
      "character": "Alfie"
    },
    {
      "id": "nm3009594",
      "name": "Oaklee Pendergast",
      "character": "Edward"
    },
    {
      "id": "nm1112861",
      "name": "Thomas Arnold",
      "character": "Man at Train Station"
    },
    {
      "id": "nm3528539",
      "name": "Jeremy Irvine",
      "character": "Harry Burnstow"
    },
    {
      "id": "nm0712628",
      "name": "Adrian Rawlins",
      "character": "Dr. Rhodes"
    },
    {
      "id": "nm0219329",
      "name": "Ned Dennehy",
      "character": "Hermit Jacob"
    },
    {
      "id": "nm1569065",
      "name": "Leanne Best",
      "character": "The Woman in Black"
    },
    {
      "id": "nm0668920",
      "name": "Eve Pearce",
      "character": "Alice Drablow"
    },
    {
      "id": "nm7032233",
      "name": "Ben Huish",
      "character": "'Edward' Double"
    },
    {
      "id": "nm7032234",
      "name": "Keanen Diaper",
      "character": "Ghost Child"
    },
    {
      "id": "nm7032235",
      "name": "Oscar Cameron",
      "character": "Ghost Child"
    },
    {
      "id": "nm7032236",
      "name": "Olivia Sear",
      "character": "Ghost Child"
    },
    {
      "id": "nm7032237",
      "name": "Lucy Dawson",
      "character": "Ghost Child"
    },
    {
      "id": "nm7032238",
      "name": "Natasha Wigman",
      "character": "Ghost Child"
    },
    {
      "id": "nm6620781",
      "name": "Lexie Marie Cook",
      "character": "Ghost Child       (as Lexie Marie Freeman Cook)"
    },
    {
      "id": "nm7032239",
      "name": "Andreas Bazigos",
      "character": "Ghost Child"
    },
    {
      "id": "nm1667467",
      "name": "Chloe Mitchell",
      "character": "Ghost Child"
    },
    {
      "id": "nm7032240",
      "name": "Annabel Hindley",
      "character": "Ghost Child"
    },
    {
      "id": "nm7032241",
      "name": "Katherine Brown",
      "character": "Ghost Child"
    },
    {
      "id": "nm7032242",
      "name": "Georgina Vane",
      "character": "Ghost Child"
    }
  ],
  "overview": "40 years after the first haunting at Eel Marsh House, a group of children evacuated from WWII London arrive, awakening the house's darkest inhabitant.",
  "storyline": "40 years after Arthur Kipps' experience at Eel Marsh house, a group of children under the care of two women, escaping from war-torn London, arrive to the house and become the next target for the ghost of Jennette Humfrye, otherwise known as The Woman in Black. With the help of a fellow soldier, the women and children must fend off the spirit of Jennette Humfrye, and end her presence once and for all.",
  "plot": "40 years after the events of the first film, bombs drop down on London during the Blitz of World War II. Eve Parkins joins her schoolchildren and the school's headmistress, Jean Hogg, to evacuate them to the countryside town of Crythin Gifford. On the journey there, Eve meets dashing pilot Harry Burnstow, who is stationed at an airfield near Crythin Gifford. Upon arrival, Eve is confronted by a raving madman, Jacob, and flees.\n\nThough Eve and Jean do not approve of the place, there is no other alternative. That night, Eve has a nightmare of how she was forced to give up her baby when she was younger; when she awakens, she hears the noise of a rocking chair coming from the house cellar. There, she finds a message, scolding her for letting her child go, and sees a woman dressed in black. The next morning, one of the children, Edward, who has been mute since the death of his parents in a bombing, is bullied by two other children and sees the Woman in Black in the nursery. Eve feels that something is wrong when Edward starts constantly carrying around a rotten doll. That night, one of the boys that was bullying him is drawn out of the house by the Woman in Black; Eve finds his body on the beach.\n\nEve later sees the Woman in the graveyard, where she finds the grave of Nathaniel Drablow. She chases the ghost to the beach and is overcome by visions of Nathaniel's death. At the house, she and Harry establish the story of the ghost through an old record made by Alice Drablow before her death at the hands of the Woman in Black: it is her sister, Jennet Humpfrye, the mother of the child she adopted, Nathaniel. Jennet is haunting them because of Nathaniel's premature death, and is punishing Eve in particular for giving up her baby. Eve journeys into the abandoned town to confront Jacob, who is blind and therefore unable to be killed by the ghost, as he cannot see her. However, he has been driven insane by the deaths of all the other children and tries to kill Eve before she escapes.\n\nBack at the house, Jean finds one of the girls trying to strangle herself under the Woman's spell. During an air raid, the girl suffocates herself using a gas mask. After this death, Harry takes them to his airfield, which is revealed to be fake. Eve realizes the Woman has followed them. Edward flees, where he apparently dies by walking into a fire basket. Eve finds out that Edward is still alive and at Eel Marsh House. Realizing the Woman in Black wants her alone, she drives to the island, where she finds Edward walking out into the marsh to drown himself where Nathaniel died. She crawls after him, but they are dragged down into the mud by the ghost. At the last minute, Harry arrives and saves them, though he is dragged down to his death instead.\n\nMonths later, Eve has adopted Edward, and they are living in London. Although they believe they are free from the ghost, once they leave their house, she appears again and smashes a picture of Harry.",
  "synopsis": "When a group of orphaned children are forced to move from their home in London, caretakers Eve (Phoebe Fox) and Jean (Helen McCrory) bring everyone to the desolate and eerie British countryside. 40 years after Arthur Kipps (played by Daniel Radcliffe in the first film, The Woman in Black) left, this supernatural horror film introduces this new group to the now abandoned Eel Marsh House; an odd but seemingly safe location. It isnt long before Eve starts to sense that this house is not what it appears to be as the children in her care begin to disappear. As their house of safety becomes a house of horrors, Eve enlists the help of a handsome pilot (Jeremy Irvine) to help investigate what is happening. Eve soon discovers that it may not be a coincidence that she has come to reside in the house inhabited by the Woman in Black."
}