{
  "imdb_id": "tt2327453",
  "tmdb_id": "138502",
  "douban_id": null,
  "title": "Offline (2012)",
  "genres": [
    "Drama"
  ],
  "country": "Belgium",
  "version": [
    {
      "runtime": "115 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm1190385",
      "name": "Peter Monsaert"
    }
  ],
  "writer": [
    {
      "id": "nm7624544",
      "name": "Tom Dupont",
      "description": "co-writer"
    },
    {
      "id": "nm1190385",
      "name": "Peter Monsaert",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0929582",
      "name": "Wim Willaert",
      "character": "Rudy"
    },
    {
      "id": "nm2727318",
      "name": "Anemone Valcke",
      "character": "Vicky"
    },
    {
      "id": "nm0954238",
      "name": "Mourade Zeguendi",
      "character": "Rachid"
    },
    {
      "id": "nm0324400",
      "name": "Patricia Goemaere",
      "character": "Carine"
    },
    {
      "id": "nm5439804",
      "name": "Margriet Bruggeman",
      "character": "Denise"
    },
    {
      "id": "nm1613524",
      "name": "Robrecht Vanden Thoren",
      "character": "David"
    },
    {
      "id": "nm5439788",
      "name": "Souad Boukhatem",
      "character": "Naima"
    },
    {
      "id": "nm0198705",
      "name": "Katelijne Damen",
      "character": "Chantal"
    },
    {
      "id": "nm0330982",
      "name": "Peter Gorissen",
      "character": "Eigenaar wassalon"
    },
    {
      "id": "nm2844473",
      "name": "Liesa Naert",
      "character": "Sofie"
    },
    {
      "id": "nm0810563",
      "name": "Lukas Smolders",
      "character": "Bange chauffeur"
    },
    {
      "id": "nm1502517",
      "name": "Dominique Van Malder",
      "character": "Dikke Patrick"
    }
  ],
  "overview": "A man attempts to reclaim the life that prison took from him but his dark past threatens to ruin everything.",
  "storyline": "After seven years in prison, Rudy Vandekerckhove has set himself two clear objectives: get back to work as a washing machine repairman, and - more importantly - become reconciled with the family he had left behind. But despite the help and support of Denise, a retired hairdresser, and his friend Rachid, his plans fail. Just when a reunion eventually comes within sight, the past gets the upper hand again, and Rudy has to take the toughest decision of his life.",
  "plot": "Aiden Ashley's family life was torn apart thirteen years earlier when her online stalker tracked her down to her home and in an avalanche of terror, murdered both her parents. Her stalker fled the crime scene without ever revealing his face to Aiden.\n\nAs a precaution, Aiden shuns the Internet for the next thirteen years, opting to stay off-line, attending therapy sessions and living in seclusion. She breaks this seclusion after her friend and art dealer, Winton Cornelis, convinces her to hold a public art gala showcasing her work. The gala marks a turn in her personal life, after she becomes romantically involved with a guest, Paul Rogers.\n\nMeanwhile, Detective James Page continues to work on the unsolved case of Aiden's parents' murder. Page hires Jack Dayton, a cyber-security whiz, to research Aiden’s life. Dayton makes the shocking discovery that Aiden’s stalker continues to lurk. Aiden's stalker follows her undetected and installs secret cameras in her home.\n\nSuspicion turns to Aiden's art dealer, with the discovery of suspicious financial transactions between his and Aiden's bank accounts. Things do not also appear as they seem as Aiden's love interest Paul's violent past is revealed. Furthermore, Detective Page's involvement is curious; he is the only one meticulously following a cold case after thirteen years. Gradually Aiden's stalker becomes ever more desperate to be a part of her life. But Aiden is determined not to let this man blow her life apart once more. Jack Dayton is the killer and is shot by Detective Page.",
  "synopsis": "After seven years in prison, Rudy Vandekerckhove has set himself two clear objectives: get back to work as a washing machine repairman, and more importantly become reconciled with the family he had left behind. But despite the help and support of Denise, a retired hairdresser, and his friend Rachid, his plans fail.\nJust when a reunion eventually comes within sight, the past gets the upper hand again, and Rudy has to take the toughest decision of his life."
}