{
  "imdb_id": "tt2379386",
  "tmdb_id": "252360",
  "douban_id": null,
  "title": "In the Name of the King: The Last Job (2014)",
  "genres": [
    "Action",
    "Adventure",
    "Fantasy",
    "Thriller"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "86 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.2,
  "director": [
    {
      "id": "nm0093051",
      "name": "Uwe Boll"
    }
  ],
  "writer": [
    {
      "id": "nm1843790",
      "name": "Joel Ross",
      "description": "story and screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0700712",
      "name": "Dominic Purcell",
      "character": "Hazen Kaine"
    },
    {
      "id": "nm5254676",
      "name": "Ralitsa Paskaleva",
      "character": "Arabella"
    },
    {
      "id": "nm4259483",
      "name": "Daria Simeonova",
      "character": "Emeline"
    },
    {
      "id": "nm5254895",
      "name": "Petra Gocheva",
      "character": "Sophie"
    },
    {
      "id": "nm5259427",
      "name": "Marina Dakova",
      "character": "Alys"
    },
    {
      "id": "nm0706666",
      "name": "Bashar Rahal",
      "character": "Ulrich"
    },
    {
      "id": "nm0815464",
      "name": "Nikolai Sotirov",
      "character": "Tybalt"
    },
    {
      "id": "nm0901403",
      "name": "Marian Valev",
      "character": "Tervin /              Ayavlo"
    },
    {
      "id": "nm6418716",
      "name": "Tsvotoluyb Itlev",
      "character": "Alekandar"
    },
    {
      "id": "nm4148116",
      "name": "Fahradin Fahradinov",
      "character": "Soldier 1"
    },
    {
      "id": "nm0890145",
      "name": "Shelly Varod",
      "character": "Ana"
    },
    {
      "id": "nm6418717",
      "name": "Yavor Vasellnov",
      "character": "Security Guard"
    },
    {
      "id": "nm5255345",
      "name": "Joan Mihailov",
      "character": "Boy       (as Yoan Mihaylov)"
    },
    {
      "id": "nm4703661",
      "name": "Tatyana Pedersen",
      "character": "Woman"
    },
    {
      "id": "nm1331411",
      "name": "Ivo Tonchev",
      "character": "Wounded Soldier"
    },
    {
      "id": "nm5471218",
      "name": "Valentin Balabanov",
      "character": "Kardam"
    },
    {
      "id": "nm2151862",
      "name": "Stefan Spassov",
      "character": "Andon Rakovski"
    },
    {
      "id": "nm1412605",
      "name": "Anatoli Netchev",
      "character": "Rakovski Guard"
    },
    {
      "id": "nm7091847",
      "name": "Tsvetolyub Iliev",
      "character": "Security guard"
    }
  ],
  "overview": "Hazen Kaine, an American contract killer living in Sofia, Bulgaria, gets more than he bargains for when he enters into a contract with the mob. One last job before he gets out and starts a new life for himself. The targets: the three children of royal billionaire Andon Dupont. Seems simple enough, or so he thought. Hazen apprehends the children, and before he can blink an eye, a simple necklace worn by one of the children sends his life spiraling back to medieval times. Now completely out of his element, Hazen fights for his life as he tries to escape a medieval army and a fierce fire-breathing dragon.",
  "storyline": "Dominic Purcell transforms from modern-day hitman to medieval warrior in this action-packed adventure inspired by the video game series Dungeon Siege. Experience all the mind-blowing special effects that bring the nonstop action to life. A contract killer is transported back to the middle ages where he must fight a massive army - and a fire-breathing dragon - in an all-out battle for survival!",
  "plot": null,
  "synopsis": "Hazen Kaine (Dominic Purcell) is a ruthless modern-day assassin, wanting out, and is hired for one final job, determined to quit the business after carrying out that one last job involving a European royal family, kidnapping the two daughters. Hazen easily completes this task, and locks the two girls in a connex box and discovers that one of the girls is wearing a necklace with a charm that looks similar to a tattoo he has and takes the charm from the young girl, which opens a portal to the Middle Ages, to the forested Kingdom of EhbOnce there Hazen soon gains his bearing and realizes quickly that a village before him is being attacked by a flying fire-breathing dragon. Hazen runs to the village when he see that the dragon has noticed him and now attacks him too. He uses his pistol to fire at the dragon, when two sisters Arabella (Ralitsa Paskaleva), and Emeline (Daria Simeonova) notice this, they call to him and bring him into their home for safety. The sisters soon take him to their shaman where he finds out he was chosen to return to the Middle Ages and bring back order to the kingdom in chaos.Hazen comes to realize that he must stand against the evil King Tervon (Marian Valev), who has seized Kingdom of Ehb for himself. He and the two sisters form an army and head for Tervon's castle, but are ambushed by the king's armies. After a serious battle Hazen faces and easily defeats Tervon in a duel. It is also revealed the dragon which attacked the village earlier is actually controlled by Tervon, who calls upon it to make his escape when he is defeated in the duel against Hazen. Now Hazen finds himself up against an evil king, his armies, and the dragon he controls as Hazen know now he must fight on the side of good. He and Arabella finally reach Tervon's castle and Hazen defeats and kills him with ease.Arabella tells him he must save the girls he locked in the connex box. Hazen returns to the 21st Century, but the dragon, now under nobody's control, follows him through the porthole and tries kill him. The men who hired him are trying to kill him as well. He finds the man who hired him holding the girls at gunpoint. He fights the remaining henchmen and one of them is carried off by the dragon, which heads off some place unknown. Hazen returns the girls home, and their father allows him to leave unharmed; to which Hazen thanks him in return and walks off.In the final shot, the dragon is seen flying overhead in the background."
}