{
  "imdb_id": "tt2392634",
  "tmdb_id": "207413",
  "douban_id": null,
  "title": "I Am Breathing (2013)",
  "genres": [
    "Documentary",
    "Biography"
  ],
  "country": "Denmark",
  "version": [
    {
      "runtime": "72 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm5269570",
      "name": "Emma Davie"
    },
    {
      "id": "nm0571959",
      "name": "Morag McKinnon"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm5738642",
      "name": "Neil Platt",
      "character": "Himself"
    }
  ],
  "overview": "Breathing is about the thin space between life and death. 34-year-old Neil Platt plans his own funeral, muses about the meaning of life and the impossibility of terminating a mobile phone contract. With 5 months left to live, and paralyzed from the neck down by Motor Neurone Disease, he ponders how to communicate about his life in a letter for his baby son. How can he anticipate what he might want to know about his father in a future he can only imagine?",
  "storyline": "I AM BREATHING reminds us what it is to be alive - a tale of fun and laughs with a smattering of upset and devastation. Within a year, Neil Platt goes from being a healthy 30-something British bloke with a great sense of humor to becoming completely paralyzed from the neck down, thanks to the devastating illness he has inherited - known as ALS, MND, or Lou Gehrig's Disease. As his body gets weaker, his perspective on life changes. His humor remains, but new wisdom emerges: \"It's amazing how adaptable we are when we have to be. It's what separates us and defines us as human beings.\" Knowing he only has a few months left to live, and while he still has the ability to speak, Neil puts together a letter and memory box for his baby son Oscar and communicates his experience and thoughts about life in a blog - and in this film which he was determined to make. The directness of his communication mingles with images of the sensory details of a life well lived, and makes us revalue the ordinary...",
  "plot": "Keith Reynolds is a high school music teacher married to Megan and living in a small town an hour and half from New York City. He has given up a career as a musician following the arrival of their daughter. Lauren is very nearly 18 and is a champion swimmer. In his spare time, he substitutes for a cello player in an orchestra and is applying for a permanent role. Keith finds his life frustrating, resents his job as a teacher, and his wife's dismissal of his music playing. He wants to move back to the city and work as a musician but his wife Megan refuses to consider this as she disliked the uncertainty of the income and the lifestyle.\n\nThe family is to host a foreign exchange student, Sophie, for one semester. When Sophie arrives she is disappointed by the distance from Manhattan which she wanted to visit. Sophie's mother died when she was very young and she was raised by her Uncle and Aunt. Her Uncle introduced her to the piano but has recently died, affecting Sophie badly. Sophie tells her aunt that she is not practising her music because she doesn't know who she is playing for any more.\n\nSophie reveals to Keith that she is an accomplished musician and they bond over their mutual interest. While they are alone at the house, she tells Keith about the death of her Uncle and that she wants to choose to play music. Sophie is unsure and has lost her purpose following her Uncle's death, so she doesn't play. Keith has chosen not to play for the sake of his family.\n\nKeith and Sophie embark on a love affair, spending time together talking about running away together. Lauren discovers this and reveals her knowledge to Sophie who panics and tells Keith she must leave. Keith tells her he will run away with her. They plan to meet in New York City after a performance, packing their things.\n\nLauren, angry at her Father and having been spurned by Aaron, gets drunk and crashes her car. At the same time, Megan discovers Keith and Sophie's affair and their plan to run away. While she is smashing things around the house in anger, she gets a call telling her Lauren is hurt and in hospital.\n\nFollowing his performance, Keith meets up with Sophie. They load their things in the car and are smiling at each other in happiness. Suddenly Keith receives a text message from Megan telling him that something has happened to Lauren. He appears at the hospital where Megan tells him she doesn't know how Lauren is.\n\nThe film ends with the family having a photo shoot. Lauren is fine but has a scar near her eye. Keith has decided to return to his wife and Sophie has gone.",
  "synopsis": null
}