{
  "imdb_id": "tt2325977",
  "tmdb_id": "245846",
  "douban_id": null,
  "title": "Strangerland (2015)",
  "genres": [
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "country": "Ireland",
  "version": [
    {
      "runtime": "112 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.2,
  "director": [
    {
      "id": "nm2040537",
      "name": "Kim Farrant"
    }
  ],
  "writer": [
    {
      "id": "nm2446119",
      "name": "Michael Kinirons",
      "description": "written by"
    },
    {
      "id": "nm1511459",
      "name": "Fiona Seres",
      "description": "story"
    },
    {
      "id": "nm1511459",
      "name": "Fiona Seres",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0000173",
      "name": "Nicole Kidman",
      "character": "Catherine"
    },
    {
      "id": "nm0001212",
      "name": "Joseph Fiennes",
      "character": "Matthew"
    },
    {
      "id": "nm0915989",
      "name": "Hugo Weaving",
      "character": "Rae"
    },
    {
      "id": "nm1013376",
      "name": "Lisa Flanagan",
      "character": "Coreen"
    },
    {
      "id": "nm4784035",
      "name": "Meyne Wyatt",
      "character": "Burtie"
    },
    {
      "id": "nm2054816",
      "name": "Maddison Brown",
      "character": "Lily"
    },
    {
      "id": "nm5640595",
      "name": "Nicholas Hamilton",
      "character": "Tom"
    },
    {
      "id": "nm0751231",
      "name": "Jim Russell",
      "character": "Alan Robertson"
    },
    {
      "id": "nm2407067",
      "name": "Sean Keenan",
      "character": "Steve Robertson"
    },
    {
      "id": "nm2717252",
      "name": "Bronwyn Penrith",
      "character": "Rose"
    },
    {
      "id": "nm7806676",
      "name": "Trangi J. Speedy-Coe",
      "character": "Jarrah"
    },
    {
      "id": "nm5492631",
      "name": "Morgan Junor-Larwood",
      "character": "Slug       (as Morgan Junor Larwood)"
    },
    {
      "id": "nm0778966",
      "name": "Chris Pattinson",
      "character": "Deputy Pete"
    },
    {
      "id": "nm3581307",
      "name": "Reef Ireland",
      "character": "Guy in State Park"
    },
    {
      "id": "nm0227657",
      "name": "Martin Dingle Wall",
      "character": "Neil McPherson"
    },
    {
      "id": "nm3229135",
      "name": "Megan Alston",
      "character": "Sally McPherson"
    },
    {
      "id": "nm7806677",
      "name": "Carys Fulchs",
      "character": "Neil's Daughter       (as Carys Fuchs)"
    },
    {
      "id": "nm4177551",
      "name": "Taylor Ferguson",
      "character": "Checkout Chick"
    },
    {
      "id": "nm0140909",
      "name": "Luke Carroll",
      "character": "Darrell"
    },
    {
      "id": "nm3715624",
      "name": "Benedict Hardie",
      "character": "Pub Goer"
    },
    {
      "id": "nm1991937",
      "name": "Alexander Mitchinson",
      "character": "Kid in Supermarket       (as Alex Mitchinson)"
    },
    {
      "id": "nm7806678",
      "name": "Peter Howland",
      "character": "Tattooed Man"
    },
    {
      "id": "nm7677811",
      "name": "Jarrad Burcher",
      "character": "Skater Boy"
    },
    {
      "id": "nm7677812",
      "name": "Ashley Young",
      "character": "Skater Boy"
    },
    {
      "id": "nm7677813",
      "name": "Rob Farrant",
      "character": "Bartender       (as Robb Ferrant)"
    }
  ],
  "overview": "Newly arrived to a remote desert town, Catherine and Matthew are tormented by a suspicion when their two teenage children mysteriously vanish.",
  "storyline": "Newcomers to the remote Australian desert town of Nathgari, Catherine and Matthew Parker's lives are flung into crisis when they discover their two teenage kids, Tommy and Lily, have mysteriously disappeared just before a massive dust storm hits. With Nathgari eerily smothered in red dust and darkness, the townsfolk join the search led by local cop, David Rae. It soon becomes apparent that something terrible may have happened to Tommy and Lily. Suspicions run riot, rumours spread and public opinion turns savagely against the Parkers. With temperatures rising and the chances of survival plummeting with each passing day, Catherine and Matthew find themselves pushed to the brink as they struggle to survive the mystery of their children's fate.",
  "plot": "Catherine and Matthew Parker move with their children Lily and Tom to the remote Australian desert town of Nathgari. Although the family is unhappy with the move, Matthew and Tom blame Lily for forcing them to leave the larger town of Coonaburra. When he can't sleep, Tom sometimes walks around the neighborhood at night, an activity his parents discourage. One night, Matthew sees Tom leave the house, followed by Lily. He says nothing and goes back to sleep. Catherine oversleeps, and when she cannot find the kids, calls Matthew at work. He reassures her that they must have gone to school before she woke up. When the school calls to report that Tom and Lily have not been attending, she once again becomes worried, as a sandstorm is scheduled to hit the town. Matthew discourages her from contacting anyone, as he does not wish the family's business to once again become public knowledge. Against his wishes, Catherine contacts several people and finally the police.\n\nWhile taking their report, Detective David Rae finds that Lily has once before been reported missing, Catherine and Matthew reluctantly reveal that she had disappeared for a few days and turned up at a friend's house. After further investigation, Rae learns that one of Lily's Coonaburra teachers, Neil McPherson, had sex with her. When Matthew found out, he beat up McPherson. The Parkers admit to Rae that they left Coonaburra to escape the attention. Catherine becomes frustrated with Matthew's focus on his job, though he insists that he has no choice. Rae's queries in town reveal that Lily had multiple sexual relationships despite being underage. When Catherine finds Lily's diary, it includes pictures and poetry about several people: McPherson, the Parker's mentally handicapped handyman Burtie, and a local youth nicknamed Slug. It also describes her parents' marriage as a sham, which causes Catherine to cry. Catherine hands the diary to Rae with the proviso that he not reveal it to Matthew.\n\nMatthew drives to Coonaburra and threatens McPherson. Coreen, Rae's girlfriend and Burtie's sister, becomes annoyed when Rae won't share details of the case with her. Rae secretly shreds the evidence that connects Burtie to Lily and discourages Burtie from telling him anything incriminating. Rae arrests Slug, but without any evidence must release him. When the kids remain missing, the town organizes a search party. Matthew refuses to participate, further angering Catherine. Rae suggests to Catherine that her children could have run away for a reason. Catherine confronts Matthew with Lily's sexual history and asks if he molested her. Incredulous, he denies it and asks why she would even ask; she cites his apparent reluctance to help find the kids. Knowing now that Burtie had a sexual relationship with Lily, Matthew beats up Burtie and searches his house. Coreen demands Rae arrest Matthew, and when she accuses him of taking the Parkers' side, Rae reveals Burtie's connection.\n\nBurtie visits the Parkers and asks to speak with Matthew. Catherine invites him in, but he leaves when she attempts to seduce him in Lily's clothes. When Matthew drives into the desert alone, he finds Tom dehydrated and delirious. Tom initially refuses to speak, and Catherine yells at him; Tom eventually tells Matthew that he saw Lily get into a car. Catherine listens as locals discuss Lily's disappearance and likely death, and becomes distraught when she receives prank calls that call Lily promiscuous. She visits Rae, and when she fails to seduce him, wanders into the desert alone. She later reappears in town, naked. In bed together, as they hold each other, Catherine admits that she hid the diary from Matthew, and Matthew admits he saw the kids leave at night. He says he did not stop them because he wanted to punish Lily. Catherine hugs Tom and walks onto the porch, where she and Matthew console each other. While holding Lily's diary, Matthew cries and says that he wishes he could take back one moment.",
  "synopsis": "When Catherine and Matthew Parker's two teenage children disappear into the remote Australian desert, their relationship is pushed to the brink as they confront the mystery of their children's fate."
}