{
  "imdb_id": "tt2397515",
  "tmdb_id": "371575",
  "douban_id": null,
  "title": "Mask (2015)",
  "genres": [
    "Documentary"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "79 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm2449599",
      "name": "Bobby Razak"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm3794447",
      "name": "Dan Caldwell",
      "character": "Himself"
    },
    {
      "id": "nm3084937",
      "name": "Charles 'Mask' Lewis Jr.",
      "character": "Himself       (as Charles Lewis)"
    },
    {
      "id": "nm0565174",
      "name": "John McCarthy",
      "character": "Himself       (as 'Big' John McCarthy)"
    },
    {
      "id": "nm1616984",
      "name": "Eddy Millis",
      "character": "Himself"
    }
  ],
  "overview": "Charles Lewis founded TapouT in 1997, prompting a whirlwind life that intersected the birth of a sport. Selling TapouT apparel out of the trunk of his car during road trips throughout California.",
  "storyline": "Charles Lewis founded TapouT in 1997, prompting a whirlwind life that intersected the birth of a sport. Selling TapouT apparel out of the trunk of his car during road trips throughout California, a hot bed of mixed martial arts in the late 1990s, Lewis took on the superhero persona of \"Mask\" as he donned war paint on his face and wore outlandish comic book outfits. By 2007, TapouT was a national brand with revenue under the unconventional Lewis's leadership reaching $22.5 million. Mask's vision quickly came to represent hardcore aspects of MMA fandom at a time when the sport floundered under political pressure. By 2007, with the political fights waged and won, Lewis's ambition to create the Nike of mixed fighting appealed to the mainstream as well. The history of MMA cannot be told without mentioning Charles \"Mask\" Lewis, or the era in which he emerged. On March 11, 2009, Lewis was killed by a drunk driver in Newport Beach, Calif. To honor his contributions, the sport's dominant ...",
  "plot": null,
  "synopsis": null
}