{
  "imdb_id": "tt2331143",
  "tmdb_id": "177945",
  "douban_id": null,
  "title": "Like Father, Like Son (2013)",
  "genres": [
    "Drama"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "121 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.8,
  "director": [
    {
      "id": "nm0466153",
      "name": "Hirokazu Koreeda"
    }
  ],
  "writer": [
    {
      "id": "nm0466153",
      "name": "Hirokazu Koreeda",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0298048",
      "name": "Masaharu Fukuyama",
      "character": "Ryota Nonomiya"
    },
    {
      "id": "nm0648762",
      "name": "Machiko Ono",
      "character": "Midori Nonomiya"
    },
    {
      "id": "nm1536988",
      "name": "Yôko Maki",
      "character": "Yukari Saiki"
    },
    {
      "id": "nm1410940",
      "name": "Lily Franky",
      "character": "Yudai Saiki       (as Lily Frankie)"
    },
    {
      "id": "nm5245242",
      "name": "Keita Ninomiya",
      "character": "Keita Nonomiya"
    },
    {
      "id": "nm5677368",
      "name": "Shôgen Hwang",
      "character": "Ryusei Saiki"
    },
    {
      "id": "nm1157364",
      "name": "Yuri Nakamura",
      "character": ""
    },
    {
      "id": "nm0847146",
      "name": "Kazuya Takahashi",
      "character": ""
    },
    {
      "id": "nm9017411",
      "name": "Yoshida Yoh",
      "character": ""
    },
    {
      "id": "nm0847651",
      "name": "Pierre Taki",
      "character": "(as Piêru Taki)"
    },
    {
      "id": "nm0644837",
      "name": "Ichirô Ogura",
      "character": ""
    },
    {
      "id": "nm0455816",
      "name": "Hana Kino",
      "character": ""
    },
    {
      "id": "nm0645696",
      "name": "Hiroshi Ohkôchi",
      "character": ""
    },
    {
      "id": "nm5193193",
      "name": "Kazuaki Shimizu",
      "character": ""
    },
    {
      "id": "nm1745224",
      "name": "Tsuyoshi Hayashi",
      "character": ""
    },
    {
      "id": "nm1903507",
      "name": "Tomoya Nakamura",
      "character": ""
    },
    {
      "id": "nm2686546",
      "name": "Megumi Morisaki",
      "character": ""
    },
    {
      "id": "nm5354478",
      "name": "Tomomitsu Adachi",
      "character": ""
    },
    {
      "id": "nm3712591",
      "name": "Shirô Katô",
      "character": ""
    },
    {
      "id": "nm6137156",
      "name": "Miyu Takizawa",
      "character": ""
    },
    {
      "id": "nm9017412",
      "name": "Oshiba Yamato",
      "character": ""
    },
    {
      "id": "nm2749052",
      "name": "Oziel Nozaki",
      "character": ""
    },
    {
      "id": "nm1102301",
      "name": "Tetsushi Tanaka",
      "character": ""
    },
    {
      "id": "nm0033152",
      "name": "Arata Iura",
      "character": ""
    },
    {
      "id": "nm0297149",
      "name": "Jun Fubuki",
      "character": "Nobuko Nonomiya"
    },
    {
      "id": "nm0452817",
      "name": "Kirin Kiki",
      "character": "Riko Ishizeki       (as Kilin Kiki)"
    },
    {
      "id": "nm0475165",
      "name": "Jun Kunimura",
      "character": "Kazushi Kamiyama"
    },
    {
      "id": "nm0622409",
      "name": "Isao Natsuyagi",
      "character": "Ryosuke Nonomiya"
    }
  ],
  "overview": "Ryota Nonomiya is a successful businessman driven by money. He learns that his biological son was switched with another child after birth. He must make a life-changing decision and choose his true son or the boy he raised as his own.",
  "storyline": "Would you choose your natural son, or the son you believed was yours after spending 6 years together? Kore-eda Hirokazu, the globally acclaimed director of \"Nobody Knows\", \"Still Walking\" and \"I Wish\", returns to the big screen with another family - a family thrown into torment after a phone call from the hospital where the son was born... Ryota has earned everything he has by his hard work, and believes nothing can stop him from pursuing his perfect life as a winner. Then one day, he and his wife, Midori, get an unexpected phone call from the hospital. Their 6-year-old son, Keita, is not 'their' son - the hospital gave them the wrong baby. Ryota is forced to make a life-changing decision, to choose between 'nature' and 'nurture.' Seeing Midori's devotion to Keita even after learning his origin, and communicating with the rough yet caring family that has raised his natural son for the last six years, Ryota also starts to question himself: has he really been a 'father' all these years....",
  "plot": "Ryota Nonomiya is a successful businessman who is focused so much on work that he neglects his wife, Midori, and son, Keita. Upon his return home one day, Midori tells him that the hospital where Keita was born needs to speak to them urgently, and Ryota senses trouble. After arriving at the hospital, the couple learns that their biological son Ryusei was switched with Keita after birth, and after DNA tests prove the error, they must now make a life-changing decision to either keep Keita, the boy they raised as their own son, or switch him for their biological son.\n\nRyota and Midori soon meet with the other couple, Yukari and Yudai Saiki, small town folks who lack the money and drive that Ryota possess, but have a better understanding of the importance of child and parent bonds. They share photos, and for the first time, Ryota and Midori see their biological son, Ryusei. After several meetings, they decide to switch children for one Saturday, which goes relatively well for both considering the tense situation. After several more meetings, they finally decide to exchange children. All four parents have difficulty accepting the loss of their previous sons, and the absence of the parents they used to know causes both boys to shut down emotionally, culminating in Ryusei running away from the Nonomiya's home and returning to the Saiki's. Ryota picks up Ryusei and brings him back home.\n\nRyota and Midori begin to bond with Ryusei, who is also warming up to them. However, while going through the photos on his camera, Ryota discovers a cache of photos of him, mostly sleeping, that Keita took, and he breaks down crying. The three return to the Saiki family so Ryota, who has now understood the errors of his ways, can see Keita, but Keita runs away from him. While following him, he apologizes to Keita, and the two make amends. The film ends with the two returning to the Saiki's, and both families entering the home.",
  "synopsis": "A young couple with a six year old son are advised that there was a mix-up at the hospital and their son Keita is not their biological child. the father, Ryota, is a hard working executive who spends very little time with his family and the job of raising their son is left to his stay-at-home wife Midori. Ryota is very competitive and struggles that his son is not and he creates hard feelings with his wife when he learns Keita is not his son and blurts out that that explains ii to his wife. MIdori had chosen to go to a country hospital near where she grew up so she would be close to her family when giving birth as she knew her workaholic husband would not be much use. MIdori is also held responsible for her choice of the hospital where the mix-up occurred. Ryota also implies that as the child's mother she should have recognized that the baby wasn't hers.\nThe hospital and their lawyers arrange for genetic testing of the children to establish parentage. The mix-up was discovered when one of the other boys was tested prior to entering school and it was revealed he was not related to his parents. The two families are brought together and the other couple are small business people, Yudai and Yukara, with a repair shop they live at and two other younger children. MIdori had problems during birth and can have no more children. YUkara also has a job in a food shop. The two families are in very different economic situations and the father Yudai seems very interested in the potential financial settlement from the hospital. When the families meet the two boys are very dissimilar, Keita is smaller and more reserved and Ryosei is larger and outgoing. The lawyers and advisors all agree that the families should exchange the boys back to their real families. The two mothers are not certain and form a bond and alliance knowing that Ryota is the most forceful of the group. MIdori's mother is also troubled by the thought of exchanging the boys knowing how attached her daughter is to the boy.\nRyota has a difficult relationship with his own father and his dad advises him that blood is important in families and horse breeding and is adamant that Ryota get his true son back. RYota's parents had separated and he had attempted to run away from his father who has custody and go back to his mother but his father brought him back. It turns out that he and his brother were raised lovingly by his step-mom.\nAt the court proceedings the hospital nurse confesses to swapping the babies in some confused reaction to her raising her husbands children from a previous marriage. The other 3 parents are angry with the nurse but Ryota is more interested in getting his real son back.\nRYota, realizing that MIdori doesn't want to give up Keita, comes up with a scheme to offer the poorer family money and allow him and MIdori to raise both boys. Yudai and Yukara are offended and the plans proceed for the ultimate exchange. As a start, the families swap the boys on weekends over a series of months. Ryota describes this switching off of the boys as a mission that they have to undertake. It is obvious that the two families and their style of living and child rearing are quite different.\nAfter the exchange, Ryosei is not very happy without his siblings and his new father is much more remote and always working. Ryosei eventually runs away and goes back to his previous home and Ryota goes and retrieves him. Yukara facetiously suggests that maybe her and Yudai should keep both the boys.\nRyota begins to reevaluate his behavior and his boss at work asks him to take a job that will free up his time for his family. Ryota and MIdori try to entertain Ryosei but he still expresses the desire to be with his other family. The three drive out to the repair shop and Ryosei announces that he is back home. Keita runs out the back and Ryota follows him. Ryota confesses he has not been a very good father and that he had failures and was too hard with his expectations. He announces the mission is over and hugs his son."
}