{
  "imdb_id": "tt2341969",
  "tmdb_id": "134312",
  "douban_id": null,
  "title": "29 Februari (2012)",
  "genres": [
    "Drama"
  ],
  "country": "Malaysia",
  "version": [
    {
      "runtime": "104 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.9,
  "director": [
    {
      "id": "nm2913746",
      "name": "Edry Abdul Halim"
    }
  ],
  "writer": [
    {
      "id": "nm4198784",
      "name": "Amir Hafizi",
      "description": null
    },
    {
      "id": "nm2913746",
      "name": "Edry Abdul Halim",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4816642",
      "name": "Jojo Goh",
      "character": "Lily"
    },
    {
      "id": "nm2879092",
      "name": "Remy Ishak",
      "character": "Budi"
    },
    {
      "id": "nm4702293",
      "name": "Izzue Islam",
      "character": "Razak"
    },
    {
      "id": "nm4504250",
      "name": "Mahathir Mohamad",
      "character": "Himself       (archive footage) (as Tun Dr. Mahathir Mohamad)"
    },
    {
      "id": "nm5836525",
      "name": "Tunku Abdul Rahman",
      "character": "Himself       (archive footage)"
    }
  ],
  "overview": "The first Malaysian 3D film, \"29 Februari\" focuses on a man born on the leap day of 29 February, and ages only one year in every four years. Because of this unique trait, he has lived through many historical periods of Malaysia; from the colonial years to the Japanese invasion and Independence. Though some may consider it a gift, the man's long life can also be a curse as he has to face the reality of seeing the ones he loves die. A highlight of the film will be the changing landscape of Malaysia from the early days up to 2012.",
  "storyline": "A man who ages once in four years and spends his whole life waiting for his true love, Lily. Budi was born on Feb 29 in 1896 to proud parents who wished only for their son to be healthy and blessed with a long life. He loses his parents during the war when the Japanese invade Tanah Melayu in 1941, following which he finds refuge at an orphanage, \"Rumah Bakti\", and meets Razak, who becomes his best of friend. In 1957, Budi meets Lily for the first time and falls in love with her. They become friends for a couple of years before Lily decides to run away when she is about to be married to Alex, the son of a close family friend. Budi spends the next 40 years looking for Lily. Catch the development of Malaysia on film - from the days of the British colonisation, Japanese invasion, Independence and other events that have contributed to Malaysia being the thriving nation it is today.",
  "plot": null,
  "synopsis": null
}