{
  "imdb_id": "tt2395303",
  "tmdb_id": "396879",
  "douban_id": null,
  "title": "Kunthapura (2013)",
  "genres": [
    "History"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm4879209",
      "name": "Joe Eshwar"
    }
  ],
  "writer": [
    {
      "id": "nm4879209",
      "name": "Joe Eshwar",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4879212",
      "name": "Lawrence Larkin",
      "character": "Dr. Harding"
    },
    {
      "id": "nm5663276",
      "name": "Lee Burnitt",
      "character": "Albert Thornton"
    },
    {
      "id": "nm3318415",
      "name": "Byon",
      "character": "Moorthy"
    },
    {
      "id": "nm0352031",
      "name": "Charu Haasan",
      "character": "Krishnappa Shastri"
    },
    {
      "id": "nm4823105",
      "name": "Jacqueline Kirkham",
      "character": "Claire"
    },
    {
      "id": "nm2207905",
      "name": "Priya Lal",
      "character": "Vasundhara Devi"
    },
    {
      "id": "nm4562958",
      "name": "Victor Ptak",
      "character": "Collin Hall"
    },
    {
      "id": "nm4854891",
      "name": "Suzanne Roche",
      "character": "Emma Hall"
    }
  ],
  "overview": "Structured on the point of view of three individuals, Krishnappa Narasimha Shashtri, an old Indian freedom fighter, Gowri Iyer an Indian journalist and Emma Hall, a British banker. The film is set in the 1920s of colonial India and revolves around the lives of three groups of people, the peasants from a village called Kunthapura, the freedom fighters of the princely state of Mysore and a group of archeologists commissioned to do an excavation in the village of Kunthapura",
  "storyline": "In 1928, Kunthapura, a remote village in central Karnataka was excavated by the Archeological survey. The Excavation brings a lot of troubles to the village which forces them to take arms against the British. The memories of an Eighty nine year old man, Krishnappa Narasimha Shashtri brings it to the notice of public in 2011.",
  "plot": "Structured on the point of view of three individuals, Krishnappa Narasimha Shashtri, an old Indian freedom fighter, Gowri Iyer, an Indian journalist and Emma Hall, a British banker. The film is set in the 1920s of colonial India and revolves around the lives of three groups of people, the peasants from a village called 'Kunthapura', the freedom fighters of the princely state of Mysore and a group of archeologists commissioned to do an excavation in the village of Kunthapura. The film shot in India and England is due for release in 2013.",
  "synopsis": null
}