{
  "imdb_id": "tt2364841",
  "tmdb_id": "146238",
  "douban_id": null,
  "title": "Runner Runner (2013)",
  "genres": [
    "Crime",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "88 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm1026778",
      "name": "Brad Furman"
    }
  ],
  "writer": [
    {
      "id": "nm0002718",
      "name": "Brian Koppelman",
      "description": "written by &"
    },
    {
      "id": "nm0505522",
      "name": "David Levien",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0005493",
      "name": "Justin Timberlake",
      "character": "Richie Furst"
    },
    {
      "id": "nm0000255",
      "name": "Ben Affleck",
      "character": "Ivan Block"
    },
    {
      "id": "nm2605345",
      "name": "Gemma Arterton",
      "character": "Rebecca Shafran"
    },
    {
      "id": "nm1107001",
      "name": "Anthony Mackie",
      "character": "Agent Shavers"
    },
    {
      "id": "nm1092022",
      "name": "Michael Esper",
      "character": "Billy 'Pet' Petricoff"
    },
    {
      "id": "nm3967796",
      "name": "Oliver Cooper",
      "character": "Andrew Cronin"
    },
    {
      "id": "nm1382202",
      "name": "Christian George",
      "character": "Wilson"
    },
    {
      "id": "nm0891485",
      "name": "Yul Vazquez",
      "character": "Delegate Herrera"
    },
    {
      "id": "nm0001334",
      "name": "John Heard",
      "character": "Harry Furst"
    },
    {
      "id": "nm1638200",
      "name": "James Molina",
      "character": "Esteban"
    },
    {
      "id": "nm0518385",
      "name": "Louis Lombardi",
      "character": "Archie"
    },
    {
      "id": "nm0488095",
      "name": "Vincent Laresca",
      "character": "Sergeant Barrancas"
    },
    {
      "id": "nm5971303",
      "name": "Bernie O. Ramos Robledo",
      "character": "Handlebar Mustache"
    },
    {
      "id": "nm4112253",
      "name": "Sam Palladio",
      "character": "Shecky"
    },
    {
      "id": "nm0182345",
      "name": "David Costabile",
      "character": "Professor Horstein"
    },
    {
      "id": "nm5237457",
      "name": "Jordan Beder",
      "character": "Paul Arnaud"
    },
    {
      "id": "nm0348409",
      "name": "Bob Gunton",
      "character": "Dean Alex Monroe"
    },
    {
      "id": "nm2355635",
      "name": "Ben Schwartz",
      "character": "Craig"
    },
    {
      "id": "nm3912883",
      "name": "Dayo Okeniyi",
      "character": "Lionel"
    },
    {
      "id": "nm5971304",
      "name": "Mike Sampedro",
      "character": "Lou Roach"
    },
    {
      "id": "nm5560979",
      "name": "Randall M. Corsi",
      "character": "Robe"
    },
    {
      "id": "nm3423768",
      "name": "Clifford Myatt",
      "character": "Towel       (as Clifford E. Myatt Jr.)"
    },
    {
      "id": "nm3546902",
      "name": "Laura Aleman",
      "character": "Masseuse       (as Laura Alemán)"
    },
    {
      "id": "nm5971305",
      "name": "Doug Weinberg",
      "character": "Angle Shooter"
    },
    {
      "id": "nm5737833",
      "name": "Margarita Álvarez",
      "character": "Junior Executive       (as Margarita I. Álvarez-Belleau)"
    },
    {
      "id": "nm5971306",
      "name": "Carlos M. Gonzalez",
      "character": "Stickman       (as Carlos M. González)"
    },
    {
      "id": "nm1807687",
      "name": "Hugh Scott",
      "character": "Shooter"
    },
    {
      "id": "nm5971307",
      "name": "Nayka M. Vallejo",
      "character": "SUV Girl"
    },
    {
      "id": "nm0764430",
      "name": "Carlos Sanz",
      "character": "Police Captain"
    },
    {
      "id": "nm1403732",
      "name": "Sam Upton",
      "character": "Agent Poole"
    },
    {
      "id": "nm5971308",
      "name": "Dalissa Nevarez",
      "character": "Girl"
    },
    {
      "id": "nm4306632",
      "name": "Yessenia Monge",
      "character": "Esteban's Wife       (as Yessenia Monge Murphy)"
    },
    {
      "id": "nm0451644",
      "name": "Sandha Khin",
      "character": "Shooter's Girlfriend"
    },
    {
      "id": "nm1884316",
      "name": "Phil Laak",
      "character": "Poker Players"
    },
    {
      "id": "nm1882810",
      "name": "Antonio Esfandiari",
      "character": "Poker Players"
    },
    {
      "id": "nm2091468",
      "name": "Deadmau5",
      "character": "DJ"
    },
    {
      "id": "nm0145518",
      "name": "David Castro",
      "character": "Airport Security"
    },
    {
      "id": "nm5971309",
      "name": "Efrain Canino Santos",
      "character": "Passport Official"
    },
    {
      "id": "nm0579371",
      "name": "Sam Mendoza",
      "character": "Ground Crew Member"
    },
    {
      "id": "nm5971310",
      "name": "Natasha Lopez Cruz",
      "character": "Flight Attendant"
    },
    {
      "id": "nm3547103",
      "name": "Jim Cruz",
      "character": "Helicopter Pilot"
    },
    {
      "id": "nm5971311",
      "name": "Wifredo Alejandro",
      "character": "Costa Rican Policeman"
    },
    {
      "id": "nm5971312",
      "name": "Adriana Fontanals Cuebas",
      "character": "Student"
    },
    {
      "id": "nm5225734",
      "name": "Jeremy E. Gonzalez",
      "character": "Esteban's Sons       (as Jeremy Gonzalez Santiago)"
    },
    {
      "id": "nm5225400",
      "name": "Juan Padilla-Lallave",
      "character": "Esteban's Sons       (as Juan A. Padilla La Llave)"
    },
    {
      "id": "nm1422439",
      "name": "David Davila",
      "character": "Pilot at Bar       (as David Dávila)"
    },
    {
      "id": "nm5971313",
      "name": "Samuel Verdejo",
      "character": "Handlebar Mustache Bodyguards"
    },
    {
      "id": "nm7732730",
      "name": "Nilo Verdejo",
      "character": "Handlebar Mustache Bodyguards"
    },
    {
      "id": "nm4562163",
      "name": "Omar Cruz Soto",
      "character": "Baggage Supv"
    }
  ],
  "overview": "When a poor college student who cracks an online poker game goes bust, he arranges a face-to-face with the man he thinks cheated him, a sly offshore entrepreneur.",
  "storyline": "Princeton grad student Richie, believing he's been swindled, travels to Costa Rica to confront online gambling tycoon Ivan Block. Richie is seduced by Block's promise of immense wealth, until he learns the disturbing truth about his benefactor. When the FBI tries to coerce Richie to help bring down Block, Richie faces his biggest gamble ever: attempting to outmaneuver the two forces closing in on him.",
  "plot": "Richie Furst used to have a lucrative career on Wall Street; this history prevents him from receiving tuition assistance at Princeton, so he funds his master's degree by referring students to online gambling, for which he receives a cut. After the dean threatens to expel him for these activities, Richie tries to win his tuition using his excellent poker skills in online gambling, but he loses all his money to a cheater, something he is able to prove by statistics.\n\nRichie travels to Costa Rica to confront Ivan Block, who runs the biggest empire of online gambling websites in the world, including the one Richie lost his money on. After Ivan sees the statistics, he finds coders have coded the software to allow them to cheat. After firing those involved, Ivan tells Richie he'll pay him millions per year to stay in Costa Rica and assist with the site.\n\nRichie slowly begins a romantic relationship with Rebecca Shafran, ex-lover of Ivan, who appears to have no objections. Ivan has Richie blackmail a gaming affiliate with videos of his infidelity to force him to sign with Ivan. FBI agent Shavers kidnaps Richie and threatens to ruin his life in various ways if he does not assist in a conviction of Ivan Block. Shavers cannot do anything legally as he has no authority in Costa Rica, but he takes advantage of this to use tactics that would be illegal and unethical for law enforcement inside the United States. Ivan tells Richie that everyone in the organization ends up confronted by Shavers at some point.\n\nOver time, Ivan's organization is revealed to be less than ethical. He sends Richie to bribe Costa Rica gaming director Herrera with too small a payment, which leads to Richie being beaten. Ivan tells him it comes with the territory of such a lucrative career. When Richie tries to leave the country, Shavers has drugs planted in his bag and offers to overlook it if Richie agrees to cooperate. A local police officer reveals that the police dislike Ivan but that he would buy his way out of any trouble and destroy whoever tried to take him down.\n\nRichie's friend Andrew Cronin, who works on the software design for Ivan, suggests that Ivan is running a Ponzi scheme; the players' accounts have no actual money, and Ivan uses the money as his own bank account, keeping just enough to allow players to cash out when they need to. Aware that Richie might be wanting out, Ivan buys the massive poker debts of Richie's father and brings him to Costa Rica, using him as a hostage.\n\nIvan throws Herrera and his bodyguard into the river to get eaten by the crocodiles, but pulls them out before they are eaten. Cronin disappears and is later found nearly beaten to death. Thanks to Rebecca betraying Ivan, Richie finds out that Ivan has been setting him up all along; Ivan is about to move his operations out of Costa Rica, planning to leave Richie behind as the fall guy. Richie gives out massive bribes to local officials, including low-level police officers. When the movement day hits, Ivan calls to sarcastically apologize to Richie, telling him he will be busted, as Ivan flies away on a private jet.\n\nWhen Ivan lands, he finds he has been betrayed: the bribed pilot has instead flown him to Puerto Rico, an American territory. Shavers and other FBI agents move in to arrest him as Richie and Rebecca fly away on the private jet. Shavers says they're free to go because Richie left a flash drive for him containing sufficient evidence to convict Ivan.",
  "synopsis": "Richie Furst used to have a lucrative career on Wall Street; this history prevents him from receiving tuition assistance at Princeton, so he funds his master's degree by referring students to online gambling, for which he receives a cut. After the dean threatens to expel him for these activities, Richie tries to win his tuition using his excellent poker skills in online gambling, but he loses all his money to a cheater, something he is able to prove by statistics.Richie goes to Costa Rica to confront Ivan Block, who runs the biggest empire of online gambling websites in the world, including the one Richie lost his money on. After Ivan sees the statistics, he finds coders have coded the software to allow them to cheat. After firing those involved, Ivan tells Richie he'll pay him millions per year for him to assist with the site work. Richie slowly begins a romantic relationship with Rebecca Shafran, Ivan's ex-lover, and Ivan displays no objections to this. FBI agent Shavers kidnaps Richie and threatens to ruin his life in various ways if he does not assist in a conviction of Ivan Block. Shavers cannot do anything legally as he has no authority in Costa Rica, but he takes advantage of this to use tactics that would be illegal/unethical for law enforcement inside the United States. Ivan tells Richie that everyone in the organization ends up confronted by Shavers at some point. Ivan has Richie blackmail Shecky, a gaming affiliate with videos of his infidelity to force him to sign with Ivan.Over time, Ivan's organization is revealed to be less than ethical. He sends Richie to bribe Costa Rica gaming director Herrera with too small a payment, which leads to Richie being beaten. Ivan tells him it comes with the territory of such a wealthy career. Ivan throws Herrera and his bodyguard into a lake of crocodiles, but pulls them out before they are eaten. Richie's friend Andrew Cronin, who works on the software design for Ivan, finds that Ivan is running a Ponzi scheme; the players' accounts have no actual money, and Ivan uses the money as his own bank account, keeping just enough to allow players to cash out when they need to. Cronin disappears and is later found nearly beaten to death. Fearing Richie might be having a change of heart, Ivan buys the massive poker debts of Richie's father and brings him to Costa Rica, using him as a hostage against Richie.When Richie tries to leave the country, Shavers has drugs planted in his bag and offers to overlook it if Richie agrees to cooperate. A local police officer reveals that the police dislike Ivan but that he would buy his way out of any trouble and destroy whoever tried to take him down. Thanks to Rebecca betraying Ivan, Richie finds out that Ivan has been swindling him all along; Ivan is about to move his operations out of Costa Rica, and from the start he wanted to leave Richie behind as the fall guy. Richie gives out massive bribes to all local officials, including low-level police officers. When the movement day hits, Ivan calls to satirically apologize to Richie, telling him he'll be arrested, as Ivan flies away on a private jet.When Ivan lands, he finds he has been betrayed: the bribed pilot has instead flown him to Puerto Rico, American territory. Shavers arrests him as Richie and Rebecca fly away on the private jet. Shavers says they're free to go because Richie left a flash drive with him containing sufficient evidence to convict Ivan."
}