{
  "imdb_id": "tt2367066",
  "tmdb_id": "228915",
  "douban_id": null,
  "title": "Lord of Tears (2013)",
  "genres": [
    "Drama",
    "Horror"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "100 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm3879509",
      "name": "Lawrie Brewster"
    }
  ],
  "writer": [
    {
      "id": "nm3600165",
      "name": "Sarah Daly",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0774516",
      "name": "David Schofield",
      "character": "Owl Man"
    },
    {
      "id": "nm2387853",
      "name": "Alexandra Hulme",
      "character": "Eve Turner       (as Lexy Hulme)"
    },
    {
      "id": "nm3850775",
      "name": "Euan Douglas",
      "character": "James Findlay"
    },
    {
      "id": "nm4105541",
      "name": "Jamie Scott Gordon",
      "character": "Allen Milton       (as Jamie Gordon)"
    },
    {
      "id": "nm3260530",
      "name": "Alan Ireby",
      "character": "Solicitor"
    },
    {
      "id": "nm4275133",
      "name": "Neil Cooper",
      "character": "Michael Milton"
    },
    {
      "id": "nm4282073",
      "name": "Nancy Joy Page",
      "character": "Flora May Findlay"
    },
    {
      "id": "nm5653117",
      "name": "Graham Robertson",
      "character": "Henry Findlay"
    },
    {
      "id": "nm0272461",
      "name": "Jock Ferguson",
      "character": "Taxi Driver"
    }
  ],
  "overview": "Lord of Tears tells the story of James Findlay, a school teacher plagued by recurring nightmares of a mysterious and unsettling entity. Suspecting that his visions are linked to a dark incident in his past, James returns to his childhood home, a notorious mansion in the Scottish Highlands, where he uncovers the disturbing truth behind his dreams, and must fight to survive the brutal consequences of his curiosity.",
  "storyline": "Lord of Tears tells the story of James Findlay, a school teacher plagued by recurring nightmares of a mysterious and unsettling entity. Suspecting that his visions are linked to a dark incident in his past, James returns to his childhood home, a notorious mansion in the Scottish Highlands, where he uncovers the disturbing truth behind his dreams, and must fight to survive the brutal consequences of his curiosity.",
  "plot": "James (Euan Douglas) is an average school teacher that has been estranged from his mother for years and has only returned to her home to settle her estate after her death. This somewhat baffles his friend Allen (Jamie Scott Gordon), as his own father is undergoing a serious illness and is unlikely to recover. James discovers via letters that he stands to inherit two houses from her: one small and average, the other a large mansion that he is urged to never again visit. Confused, James ignores her request and moves into the house in hopes of making sense of everything as he cannot remember his early childhood but does vaguely remember living at the house during this time. Soon after he arrives he meets the beautiful American Eve (Lexy Hulme), who lives nearby in a set of renovated stables. He also finds evidence that he had a mental breakdown as a child, brought about by visions of a creature known as the \"Owl Man\" (David Schofield).\n\nAs James stays at the mansion he begins to fall in love with Eve while also discovering that the house sits atop a series of catacombs and that his parents dabbled in pagan magic in order to achieve fortune. He eventually begins to recall more from his past even as the Owl Man's presence begins to grow increasingly ominous, culminating in James discovering that his parents had been worshipping Moloch, who would grant wishes in exchange for a sacrifice. This causes James to regain his lost memories, discovering that Moloch had been manifesting himself as the Owl Man and that he was supposed to be the sacrifice that Moloch demanded. His parents were unwilling to offer James, so they took in an orphaned American girl as a nanny and murdered her in James's stead, claiming that as they had been her guardians, she was a reasonable substitute. James then realizes that this girl was Eve, which has the unfortunate effect of making Eve remember the events as well and turn into a menacing figure intent on driving James insane via a series of attacks. He tries to flee from the house but finds that Moloch will not allow him to leave.\n\nWhen Allen arrives on the estate James believes that he is saved, only for Allen to instead attack and murder him. Clearly upset, Allen begs for James to forgive him even as he is killing him, explaining that Moloch came to him and offered to save his father (Neil Cooper) if he completed the sacrifice. The film then cuts to Allen driving his father home from the hospital and then flashes back to the mansion, where a light suddenly turns on in the catacombs, hinting that James's ghost has taken the place of Eve's and will remain there until another sacrifice is performed.",
  "synopsis": null
}