{
  "imdb_id": "tt2352802",
  "tmdb_id": "201066",
  "douban_id": null,
  "title": "Goodbye World (2013)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "99 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.5,
  "director": [
    {
      "id": "nm0377203",
      "name": "Denis Henry Hennelly"
    }
  ],
  "writer": [
    {
      "id": "nm0377203",
      "name": "Denis Henry Hennelly",
      "description": null
    },
    {
      "id": "nm2262138",
      "name": "Sarah Adina Smith",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0004978",
      "name": "Adrian Grenier",
      "character": "James Palmer"
    },
    {
      "id": "nm3264596",
      "name": "Kid Cudi",
      "character": "Lev Berkowitz"
    },
    {
      "id": "nm5085683",
      "name": "Mckenna Grace",
      "character": "Hannah Palmer"
    },
    {
      "id": "nm2628935",
      "name": "Kerry Bishé",
      "character": "Lily Palmer"
    },
    {
      "id": "nm0223518",
      "name": "Caroline Dhavernas",
      "character": "Becky Snider"
    },
    {
      "id": "nm1360270",
      "name": "Ben McKenzie",
      "character": "Nick Randworth"
    },
    {
      "id": "nm0916406",
      "name": "Mark Webber",
      "character": "Benji Henry"
    },
    {
      "id": "nm3567948",
      "name": "Remy Nozik",
      "character": "Ariel"
    },
    {
      "id": "nm0000451",
      "name": "Gaby Hoffmann",
      "character": "Laura Shepherd"
    },
    {
      "id": "nm0003740",
      "name": "Julie Dretzin",
      "character": "Claire"
    },
    {
      "id": "nm1853240",
      "name": "Rick Chambers",
      "character": "Newscaster"
    },
    {
      "id": "nm1719288",
      "name": "Marcella Lentz-Pope",
      "character": "Beth"
    },
    {
      "id": "nm0051257",
      "name": "Kirk Baltz",
      "character": "Radio Show Host"
    },
    {
      "id": "nm2632918",
      "name": "Frank Drank",
      "character": "Chops"
    },
    {
      "id": "nm1118528",
      "name": "Laura Kachergus",
      "character": "Trisha"
    },
    {
      "id": "nm3667699",
      "name": "Reggie Brown",
      "character": "The President"
    },
    {
      "id": "nm1915289",
      "name": "Linc Hand",
      "character": "Damon Mosley"
    },
    {
      "id": "nm2557308",
      "name": "Patrick Mapel",
      "character": "Kyle Oswald"
    }
  ],
  "overview": "When a mysterious cyber-attack cripples civilization, a group of old college friends and lovers retreat to a remote country cabin, where they must cope with an uncertain future while navigating the minefield of their shared past.",
  "storyline": "James and Lily, estranged from society, live off the grid, raising their young daughter in a cocoon of comfort and sustainability. When a mysterious mass text ripples its way across the country, triggering a crippling, apocalyptic cyber attack, their home transitions from sheltered modern oasis to a fortress for the estranged old friends that show up at their door for protection and community. The unexpected reunion--abundant with revelry and remembrances, generously enhanced by organic wine and weed--is quickly undermined by the slights of the past, the spark of lingering flirtations and the threat of a locally grown new world order. Balancing tense confrontations with slivers of levity, director Denis Henry Hennelly pinpoints a future where ideology explodes into action in every area.",
  "plot": "The film begins with James' recitation of a Henry David Thoreau quote, after which he states that he saw the oncoming societal collapse and moved his free-spirited wife Lily and young daughter Hannah off the grid. A montage shows his college friends just before the collapse: Benji, a radical activist, lectures at a college and has sex with Ariel, one of the students; Nick, James' former business partner, and his wife Becky are en route to James' house for a meeting; Laura, formerly a Senator's aide, is rejected from a job at a non-profit due to a past public scandal; and Lev, a computer hacker, prepares to commit suicide until he hears that a computer virus may be responsible for the collapse. All converge at James' remote Mendocino house, where Benji explains that violent riots have broken out across the nation.\n\nWhen Laura and James ride into town, he asks if she was forewarned of the attacks. Although she initially denies it, she admits that Homeland Security contacted her about Lev, whom they suspected to be involved with the virus. In town, bikers have taken over the local store and gouge the locals. Laura flashes her breasts for supplies, and they quickly leave when they see a local man bullied mercilessly by thugs. At the house, Laura decodes a repeated message and explains that the United States is now under martial law. At the same time, old rivalries flare up, and the friends begin infighting over unresolved issues from the past. Becky, who never felt accepted by the others, argues with the others over her Libertarian political beliefs, and James and Nick argue over a business-related lawsuit.\n\nNational Guardsmen visit the house and request its use as a base of operations. Becky objects on Constitutional grounds, and James asks them to leave. The infighting intensifies, and, after Ariel and Benji break up, Lily kicks out Ariel, who has become disruptive. At the same time, Nick and Lily explore their feelings for each other, and Lily demands a divorce from James, who responds that he has more important things to worry about than his marriage. Ariel goes to live with James' neighbors, who have taken in the Guardsmen. Concerned that James is hoarding medicine, the Guardsmen return and demand James give them his supplies. When he resists, they violently grope Laura and threaten to kill Lev. James backs down, and they leave after he promises to deliver them tomorrow.\n\nLev reveals that he was partially responsible for the computer virus; in Libya, he constructed a cell phone virus that could overload an entire nation's grid. When he became suspicious of the motivations of his employers, he left before it was completed. As a part of his suicide attempt, he used his virus to say goodbye to the entire country; when Lily hacked into his computer, it released the virus' source code into the wild, and terrorists were able to mount an attack on the country's technological infrastructure. Later, Becky finds Benji in the woods, stuck in a bear trap. Becky, an animal lover, tells Benji how she was forced to hunt and brutally kill rabbits for food in her childhood, and he tells her about Nick and Lily. Lev and Laura talk about his involvement, and she shows indecision over whether to turn him in to the authorities.\n\nNick and Lily briefly leave together, but they return when Lily convinces Nick that they should be friends and not lovers. James visits his neighbors and refuses to hand over his supplies, though he offers to consider any requests. The Guardsmen cite James' failure to help the bullied local and his refusal to share his supplies as they prepare to execute him. Laura saves him by killing one of the Guardsmen, donates half of their supplies to the other camp, and promises that they will work together from now on. Nick rejoins the camp, James and Lily reconcile, Laura and Lev become a couple, and Becky leaves with Benji to help others in need.",
  "synopsis": null
}