{
  "imdb_id": "tt2329188",
  "tmdb_id": "267802",
  "douban_id": null,
  "title": "Cambio de ruta (2014)",
  "genres": [
    "Comedy",
    "Romance"
  ],
  "country": "Mexico",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm0393674",
      "name": "Christopher Hool"
    }
  ],
  "writer": [
    {
      "id": "nm5212430",
      "name": "Lili Torres",
      "description": "written by"
    },
    {
      "id": "nm1722716",
      "name": "Ricardo de los Rios",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0306622",
      "name": "Marcela Mar",
      "character": ""
    },
    {
      "id": "nm1214700",
      "name": "Sandra Echeverría",
      "character": "Nicté Domínguez"
    },
    {
      "id": "nm0422948",
      "name": "Héctor Jiménez",
      "character": "Dimento"
    },
    {
      "id": "nm0378855",
      "name": "Dolores Heredia",
      "character": "Madre de Nicté"
    },
    {
      "id": "nm3016653",
      "name": "Carolina Bang",
      "character": "Julia"
    },
    {
      "id": "nm0145061",
      "name": "Eric del Castillo",
      "character": "Eric del Castillo"
    },
    {
      "id": "nm1913217",
      "name": "Osvaldo de León",
      "character": "Cristóbal"
    }
  ],
  "overview": "Nicté is the best Tourist Guide in the Riviera Maya, her tours are full of unique adventures! She takes tourists to spectacular places where nobody dares to go: swimming in cenotes, tossing for zip lines, snorkeling with turtles and trying local delicacies are some of the experiences her customers will never forget. Suddenly, the local company she works for is bought by a multinational and Nicté will be forced to start from scratch to form her own company.",
  "storyline": "Nicte is the best guide for tourists of the Riviera Maya. Her tours are filled with unparalleled adventures! She leads tourists to spectacular places where nobody dares to go; swim in the cenotes, throw themselves into by Tyrolean, snorkeling with the turtles, try local delicacies are inter alia experiences that they will never forget. Suddenly the local company for which she works is bought by a transnational and Nicte is forced to start from zero and formed her own company. Magazine is the most important prize of tourism in the world and just opened a competition to find the best guide for tourists to Mexico. Nicte will give a great battle to win the prize. This film highlights the value of the conservation of our environment and the struggle to attain our dreams in a framework of a Mexico beautiful and lovely.",
  "plot": null,
  "synopsis": null
}