{
  "imdb_id": "tt2343134",
  "tmdb_id": "300835",
  "douban_id": null,
  "title": "Paper Boat (2012)",
  "genres": [
    "Drama"
  ],
  "country": "Indonesia",
  "version": [
    {
      "runtime": "111 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm2538739",
      "name": "Hanung Bramantyo"
    }
  ],
  "writer": [
    {
      "id": "nm5225445",
      "name": "Dewi Lestari",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3745028",
      "name": "Maudy Ayunda",
      "character": "Kugy"
    },
    {
      "id": "nm3668024",
      "name": "Adipati Dolken",
      "character": "Keenan"
    },
    {
      "id": "nm3024307",
      "name": "Reza Rahadian",
      "character": "Remi"
    },
    {
      "id": "nm5224357",
      "name": "Afiqah",
      "character": ""
    },
    {
      "id": "nm5224420",
      "name": "Amanina Datau",
      "character": ""
    },
    {
      "id": "nm3025363",
      "name": "Titi Dwijayati",
      "character": ""
    },
    {
      "id": "nm5225116",
      "name": "Sylvia Fully",
      "character": "Noni"
    },
    {
      "id": "nm2679703",
      "name": "Pierre Gruno",
      "character": ""
    },
    {
      "id": "nm3120095",
      "name": "Sharena Gunawan",
      "character": ""
    },
    {
      "id": "nm3117394",
      "name": "Kevin Julio",
      "character": ""
    },
    {
      "id": "nm3166114",
      "name": "Ben Kasyafani",
      "character": "Karel"
    },
    {
      "id": "nm5225445",
      "name": "Dewi Lestari",
      "character": ""
    },
    {
      "id": "nm3184882",
      "name": "Hayria Lonton",
      "character": "(as Hayria Lontoh)"
    },
    {
      "id": "nm0577418",
      "name": "August Melasz",
      "character": ""
    },
    {
      "id": "nm5225044",
      "name": "Elyzia Mulachela",
      "character": "Luhde       (as sylvia wardhina mulachela)"
    },
    {
      "id": "nm1233777",
      "name": "Tio Pakusadewo",
      "character": "Pak Wayan       (as Tio Pakusodewo)"
    },
    {
      "id": "nm5203535",
      "name": "Rizky",
      "character": ""
    },
    {
      "id": "nm5224117",
      "name": "Alfonso O. Rorimpandey",
      "character": ""
    },
    {
      "id": "nm3150965",
      "name": "Kimberly Ryder",
      "character": "Wanda"
    },
    {
      "id": "nm5224772",
      "name": "Fauzan Smith",
      "character": "Eko"
    },
    {
      "id": "nm5225057",
      "name": "Avesina Soebli",
      "character": ""
    },
    {
      "id": "nm1288928",
      "name": "Ira Wibowo",
      "character": ""
    },
    {
      "id": "nm3311394",
      "name": "Dion Wiyoko",
      "character": ""
    }
  ],
  "overview": "Paper Boat tells the tidal relationship between two human beings , namely Kugy and Keenan. Kugy is a tomboy, cheerful, and who believes that he is the agent of the god Neptune. Kugy always have a \"ritual\" unique, ie writing each pouring her heart into a piece of paper, which is then made ​​into a boat and then washed away into the water. Although at first glance that he slenge'an jovial girl, but she has a philosophical outlook on life.",
  "storyline": "Tidal relationship between two human beings, Kugy and Keenan. Kugy is a tomboyish girl, cheerful, and who believes that she is the agent of Neptune.",
  "plot": "An idealistic reporter, Ward Jansen (McConaughey), and his younger brother, Jack Jansen (Efron), investigate the events surrounding a murder in an effort to exonerate a man on death row, Hillary Van Wetter (Cusack). Van Wetter has been jailed for the murder of an unscrupulous local sheriff, Thurmond Call. Call had previously stomped Van Wetter's handcuffed cousin to death. Van Wetter is now awaiting execution. The Jansens are helped by Ward's colleague, Englishman Yardley Acheman (Oyelowo), and Charlotte Bless (Kidman), a woman whom Van Wetter has never met but who has fallen in love with him and is determined that he should be released and that they should marry. In prison Van Wetter regularly receives correspondence from her.\n\nCharlotte tries to prove Van Wetter's innocence by requesting the help of Ward and Yardley, who are both investigative reporters from a fictional newspaper that happens to share a name with the real, historic black newspaper, The Miami Times, and are hungry for a salacious story. Ward returns to his hometown to investigate the case but has mixed feelings about returning home to his estranged father, and his father's new girlfriend, Ellen, who distribute The Miami Times in their town. The Jansen brothers dislike their father's new girlfriend. Jack is the paperboy after having been expelled from college for vandalism. His only real friend is the family maid, Anita (Macy Gray), who brought him and Ward up after their mother left them. The movie's plot unfolds as Anita, for a fee, smokes and describes the events to an unseen reporter.\n\nThe evidence against Van Wetter is inconsistent and the writers are confident that if they can expose Van Wetter as a victim of redneck justice then their story will benefit them greatly. Meanwhile, Jack has fallen in love with Charlotte, who only desires Van Wetter. Anita realizes that Jack can never stop thinking of Charlotte as she is his first love. One day, with some information from Van Wetter, the Jansens travel to the swamp to meet Van Wetter's uncle Tyree, who has evidence that Van Wetter did not commit the crime.\n\nWard has been revealed to be a homosexual; on a fact finding trip, he gets drunk, cruises and approaches some Black men in a bar, who rape and torture him, which he wanted, but then plan to murder him. Charlotte alerts Jack, who saves his brother. During Ward's time in the hospital, Yardley prints the news article despite not getting all the facts right. Jack tries to convince Yardley to stop, but instead discovers that Yardley is actually American, having pretended to be English because Black men from the South could not be successful unless they lied about their backgrounds. Yardley also reveals he had some time before gotten drunk and given Ward sexual favors, which was the beginning of Ward's infatuation with Black men.\n\nVan Wetter is eventually released from prison and takes Charlotte away to the swamp to live with him. She is of course unhappy and sends a letter to Jack she made a mistake, and is going to try to attend his dad's wedding. During the wedding, Jack reads the letter, and realizing Charlotte is not there that something is wrong. A barely recovered Ward and Jack go to save Charlotte. Van Wetter and Charlotte argue about her going to the wedding (revealed in flashback). He actually kills her as Jack and Ward are en route to save her. When Jack and Ward confront Van Wetter, Ward's throat is cut, and after being pursued through the swamp by a machete wielding Van Wetter, Jack dives into the swamp water. He evades Van Wetter during the night, who returns to his shack and finds Charlotte's body gone, as he hears the boat motor start. Jack is seen leaving in his boat with the bodies of Charlotte and Ward. Van Wetter (Anita narrates) is then arrested for these murders, convicted, and sent to the electric chair. As the credits roll, Anita reveals that Jack meets his mother for the first time as a young adult when she attends Ward's funeral, and that he never got over his first love.",
  "synopsis": null
}