{
  "imdb_id": "tt2387499",
  "tmdb_id": "331313",
  "douban_id": null,
  "title": "Keeping Up with the Joneses (2016)",
  "genres": [
    "Action",
    "Comedy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "105 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm0609549",
      "name": "Greg Mottola"
    }
  ],
  "writer": [
    {
      "id": "nm1942829",
      "name": "Michael LeSieur",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0302108",
      "name": "Zach Galifianakis",
      "character": "Jeff Gaffney"
    },
    {
      "id": "nm0279545",
      "name": "Isla Fisher",
      "character": "Karen Gaffney"
    },
    {
      "id": "nm0358316",
      "name": "Jon Hamm",
      "character": "Tim Jones"
    },
    {
      "id": "nm2933757",
      "name": "Gal Gadot",
      "character": "Natalie Jones"
    },
    {
      "id": "nm0652663",
      "name": "Patton Oswalt",
      "character": "Scorpion"
    },
    {
      "id": "nm4388384",
      "name": "Ming Zhao",
      "character": "Scorpion's Girlfriend"
    },
    {
      "id": "nm0909768",
      "name": "Matt Walsh",
      "character": "Dan Craverston"
    },
    {
      "id": "nm1185753",
      "name": "Maribeth Monroe",
      "character": "Meg Craverston"
    },
    {
      "id": "nm2134407",
      "name": "Michael Liu",
      "character": "Yang"
    },
    {
      "id": "nm0242656",
      "name": "Kevin Dunn",
      "character": "Carl Pronger"
    },
    {
      "id": "nm4551557",
      "name": "Dayo Abanikanda",
      "character": "Cool Man"
    },
    {
      "id": "nm8108897",
      "name": "Henry Boston",
      "character": "Patrick"
    },
    {
      "id": "nm7572401",
      "name": "Jack McQuaid",
      "character": "Mikey"
    },
    {
      "id": "nm0496899",
      "name": "Bobby Lee",
      "character": "Ricky Lu"
    },
    {
      "id": "nm8525698",
      "name": "Ying He",
      "character": "Mrs. Lu"
    },
    {
      "id": "nm8525699",
      "name": "Yi Dong Qian",
      "character": "Mr. Lu"
    },
    {
      "id": "nm1753817",
      "name": "Ari Shaffir",
      "character": "Oren"
    },
    {
      "id": "nm0335789",
      "name": "Marc Grapey",
      "character": "Bernie"
    },
    {
      "id": "nm1655587",
      "name": "Karina Bonnefil",
      "character": "Waitress"
    },
    {
      "id": "nm0177970",
      "name": "Darin Cooper",
      "character": "Detective"
    },
    {
      "id": "nm0712740",
      "name": "Angela Ray",
      "character": "Police Officer"
    },
    {
      "id": "nm1017653",
      "name": "Amy Block",
      "character": "Neighborhood Mom"
    },
    {
      "id": "nm5317517",
      "name": "Richard Regan Paul",
      "character": "Sanjay"
    },
    {
      "id": "nm5152580",
      "name": "Andrew Farmer",
      "character": "HR Staffer #1"
    },
    {
      "id": "nm1150144",
      "name": "Cullen Moss",
      "character": "Guard #1"
    },
    {
      "id": "nm3949582",
      "name": "Matt McHugh",
      "character": "Guard #2"
    },
    {
      "id": "nm2033115",
      "name": "Jona Xiao",
      "character": "Stacey Chung"
    },
    {
      "id": "nm2587609",
      "name": "Sharon Gee",
      "character": "Stacey's Mom"
    },
    {
      "id": "nm4182692",
      "name": "Lauren Revard",
      "character": "Margaret"
    },
    {
      "id": "nm5752783",
      "name": "Rishik Patel",
      "character": "Dhameer"
    },
    {
      "id": "nm0675287",
      "name": "Scott Allen Perry",
      "character": "Henchman"
    },
    {
      "id": "nm2939724",
      "name": "Massi Furlan",
      "character": "Henchman"
    },
    {
      "id": "nm3803693",
      "name": "Andre Pushkin",
      "character": "Henchman"
    },
    {
      "id": "nm7168983",
      "name": "Pamela Conover",
      "character": "HR Staffer #2       (as Pamela Dumit Conover)"
    },
    {
      "id": "nm7515944",
      "name": "Kristina Case",
      "character": "Wife"
    },
    {
      "id": "nm4545739",
      "name": "Adrienne Ballenger",
      "character": "Hostess"
    },
    {
      "id": "nm8525700",
      "name": "Harry Galifianakis",
      "character": "Diner Customer"
    }
  ],
  "overview": "An ordinary suburban couple finds it’s not easy keeping up with the Joneses – their impossibly gorgeous and ultra-sophisticated new neighbors – especially when they discover that Mr. and Mrs. “Jones” are covert operatives.",
  "storyline": "A suburban couple becomes embroiled in an international espionage plot when they discover that their seemingly perfect new neighbors are government spies.",
  "plot": "Jeff Gaffney (Galifianakis) works at the McDowell-Burton International (MBI) as Human Resources and lives with his wife, Karen (Fisher) and two children, who are away at sleepaway camp. After the couple buys a new house, located at the cul-de-sac under the proprietors of Dan &amp; Meg Craverston (Walsh and Monroe), Karen alerts Jeff of the new neighbors, the Joneses couple, Tim and Natalie (Hamm and Gadot), and invites them over to her house to introduce themselves, surprising Jeff upon arriving home from the office.\n\nKaren learns that Tim is an accomplished travel writer whose hobbies include blowing glass and Natalie is a social media consultant, cooking blogger and heroine to Sri Lankan orphans. Feeling unconvinced about Natalie, Karen follows her to the mall hoping to discover what she's doing, but Natalie catches Karen in the dressing room. Here, Natalie confronts her, realizing that Karen must be following her. Meanwhile, Tim invites Jeff to the Chinese restaurant to eat, but Jeff feels that getting drunk with a snake wine and being bitten by a severed snake head is not the way to make a friend and that true friendship is having an indoor skydiving experience together. Back at their house, Jeff accidentally breaks the glass sculpture made by Tim that was given to them, revealing a bug among the shards. The couple now realize that they have been spied upon the whole time and they decide to sneak to the Joneses' house to find the spying device. Inside the room, they discover that Jeff and the MBI employees are being targeted by the Joneses. However, Jeff, mistaking an item for a pen, accidentally stuns Karen with the pen gun and they narrowly escape just as the Joneses arrive at the house. Natalie notices the pen gun on the floor and that it has been used, suspecting that Gaffneys might have broken into their house.\n\nThe Gaffneys arrange a meeting with MBI advisor Carl Pronger (Dunn) to explain the details about the Joneses. But before Carl can disclose further details, he is killed by a sniper who also attacks the Gaffneys. They are rescued by the Joneses and a chase and shootout ensues, killing the masked motorcycle riders. The Gaffneys now learn that the Joneses are the secret agents. Upon entering the house, the Joneses narrowly escape just as a bomb blows up the house. It is revealed that the international arms dealer calling himself \"the Scorpion\" (Oswalt) is trying to take down the Joneses and then kidnap the Craverstons, who are planning to sell the microchips — which could be used to weaken the U.S. missile defense system. Dan reveals that he is the one who used Jeff's computer to email the arms dealer. Jeff then accepts the offer through the Scorpion's phone call, arranging the meeting with his wife at the hotel and takes Dan's cover name, \"Rascal Flatts\", to deliver the microchips.\n\nWith the Joneses at their back, the Scorpion, whom Jeff helped to relieve the stress by letting him hold the small red ball at the MBI years ago, blows Jeff's cover. With their cover blown, Tim radios for back-up but they pull out due to collateral damage that will be done to the public. Jeff also blows the Scorpion's cover, whose real name is Bruce Springstine. When the Gaffneys and the Joneses are held captive, Karen is able to pass a knife to Natalie by making out with her as a distraction, giving the Joneses an opportunity to kill Bruce's men. They all escape by jumping off the window just as Bruce opens the briefcase containing the chips that blows the bomb, killing him.\n\nOne summer later, Jeff and Karen visit the Hazim's Cafe in Marrakesh, where the Joneses used to date. They meet the Joneses, who reveal that they have left the agency. However, when four men, who might be working for another agency to track them down wearing fezzes, are seen looking at them, the Joneses engage in a gunfight with the four men, not showing the actual occurrence.",
  "synopsis": "Jeff Gaffney (Zach Galifianakis) works in the human resources department at MBI, a technological development firm, while his wife Karen (Isla Fisher) works as an interior decorator. They love each other and their two kids but they find themselves tired of the mundanity of their lives.After sending their kids off to a sleepaway camp, the Gaffneys meet their friends Meg and Dan Craverston (Maribeth Monroe and Matt Walsh). Meg has just sold the house across the street to a couple that hasn't even seen the place.Jeff goes to work where he must mediate disputes between other employees. He doesn't have many friends besides Dan, and the others hardly respect him. At home, Karen is doing designs when she spots the neighbors moving in across the street. She becomes interested as she sees a handsome man and beautiful woman entering their new home romantically. Karen takes pictures and sends them to Jeff.When Jeff gets home, he finds that Karen is talking to the neighbors, Tim and Natalie Jones (Jon Hamm and Gal Gadot). Tim gives Jeff a glass sculpture as a housewarming gift, and Jeff gives him an MBI stress ball in return.The Gaffneys invites the Joneses over for a neighborhood party they call \"Junetoberfest\". Natalie surprises the guests with her dart-throwing skills. Tim goes into the Gaffney house, and Karen follows. She finds him in Jeff's den, though he claims he got lost looking for the bathroom.At night, Natalie distracts the guards at MBI while Tim sneaks in there and goes onto Jeff's computer. He gets into the deleted emails and finds that somebody has a package and is ready to do something with it.The next day, Jeff and Tim run into each other at an ale shop, and Tim invites Jeff to join him in getting Chinese food. He brings Jeff to a secret bar in a restaurant where they serve snake wine (as in, a wine bottle with an actual living snake in it). Tim's friend who works there pulls out a large black viper and cuts it up to serve the men. Jeff ends up getting bitten by the severed snake head and must have anti-venom administered. Meanwhile, Karen follows Natalie as she goes out. Natalie catches Karen at a clothing store as she is trying on lingerie. Although she knows she's been followed, she helps Karen find the right lingerie to impress Jeff.Later at night, Jeff and Karen start to get intimate when she shows off her new lingerie. They accidentally knock over the glass sculpture and break it, revealing a device inside that Karen realizes was put to bug the Gaffneys for information. The two sneak into the Joneses house while they're out, and they see that the Joneses have files on Jeff and other MBI employees. Jeff accidentally hits Karen in the neck with a tranquilizer dart. They get out quickly, but Tim and Natalie later find that someone used the dart.Jeff talks to his boss Carl Pronger (Kevin Dunn) about a potential problem within the company. They make arrangements to meet up. Jeff and Karen meet with Carl, but not long into their meeting, and Carl is shot in the head by a sniper. Tim and Natalie arrive on the scene and shoot at the assassins hiding in a warehouse. They order Jeff and Karen to join them. More assassins on motorcycles chase after the couples, with Natalie shooting at them. The assassins throw a bomb onto the Joneses' car, which Jeff pulls off and tosses, letting Natalie shoot it and blow the villains up.The Joneses explain in less-than-certain terms that they are indeed government spies, and that someone in MBI is trying to commit treason. Jeff feels betrayed because he felt a bond with Tim, but Tim insists that he felt that bond as well.When the couples return to their neighborhood, Jeff and Karen assume everything will be fine...and then the Jones house explodes.Later, the lights go out in the Gaffney house, and when they go back on, they see that Tim and Natalie are still alive, and they have both Dan and Meg tied up with duct tape on their mouths. It is revealed that Dan was using Jeff's work computer to send emails to someone named Scorpion, and that he was smuggling microchips up his ass to sell to international arms dealers.Tim and Natalie have Jeff and Karen go in as decoys to meet with Scorpion in his building to make a fake drop. First, Jeff and Karen have sex in the heat of the moment. They then go to meet with Scorpion (Patton Oswalt), who turns out to be a disgruntled employee from MBI. After Jeff blows their cover, Tim and Natalie must intervene. Karen grabs a knife and passes it to Natalie as they make out for a bit, leading to a showdown. The Joneses kill the assassins and head out a window with Karen to land in a pool. Jeff tries to talk to Scorpion, but he shoots at him, forcing Jeff to jump. Scorpion picks up a briefcase that he thinks has what he wants, but it's really a bomb that Natalie detonates, killing Scorpion and his goons.The couples return home. Jeff and Karen offer to let Tim and Natalie stay with them, but they feel they must head elsewhere. They part ways.Sometime later, Jeff and Karen are in Marrakech after hearing about it from Tim. Sure enough, they run into Tim and Natalie. They are staking out some men wearing fezes. Once again, Jeff draws attention to them so Tim and Natalie have no choice but to spring into action and start shooting. Jeff and Karen couldn't be more excited."
}