{
  "imdb_id": "tt2369396",
  "tmdb_id": "209504",
  "douban_id": null,
  "title": "Bounty Killer (2013)",
  "genres": [
    "Action",
    "Sci-Fi",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "92 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.5,
  "director": [
    {
      "id": "nm3026907",
      "name": "Henry Saine"
    }
  ],
  "writer": [
    {
      "id": "nm2611629",
      "name": "Jason Dodson",
      "description": "story"
    },
    {
      "id": "nm2611629",
      "name": "Jason Dodson",
      "description": "written by"
    },
    {
      "id": "nm1538954",
      "name": "Colin Ebeling",
      "description": "written by"
    },
    {
      "id": "nm3026907",
      "name": "Henry Saine",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0550452",
      "name": "Matthew Marsden",
      "character": "Drifter"
    },
    {
      "id": "nm0518085",
      "name": "Kristanna Loken",
      "character": "Catherine"
    },
    {
      "id": "nm1732579",
      "name": "Christian Pitre",
      "character": "Mary Death"
    },
    {
      "id": "nm3462502",
      "name": "Barak Hardley",
      "character": "Jack LeMans"
    },
    {
      "id": "nm0072344",
      "name": "Abraham Benrubi",
      "character": "Jimbo"
    },
    {
      "id": "nm0000997",
      "name": "Gary Busey",
      "character": "Van Sterling"
    },
    {
      "id": "nm0000350",
      "name": "Beverly D'Angelo",
      "character": "Lucille"
    },
    {
      "id": "nm1073992",
      "name": "Eve",
      "character": "Mocha Sujata"
    },
    {
      "id": "nm0573618",
      "name": "Kevin McNally",
      "character": "Daft Willy"
    },
    {
      "id": "nm0891786",
      "name": "Alexa PenaVega",
      "character": "Stewardess       (as Alexa Vega)"
    },
    {
      "id": "nm1579662",
      "name": "Jolene Andersen",
      "character": "Scarlet"
    },
    {
      "id": "nm3276414",
      "name": "Chasty Ballesteros",
      "character": "Korah"
    },
    {
      "id": "nm0111179",
      "name": "Ivar Brogger",
      "character": "Trevor"
    },
    {
      "id": "nm5043527",
      "name": "Cham",
      "character": "Gypsy"
    },
    {
      "id": "nm2586114",
      "name": "Tyra Colar",
      "character": "Daisy"
    },
    {
      "id": "nm1181407",
      "name": "Will Collyer",
      "character": "Billy Boom"
    },
    {
      "id": "nm2893890",
      "name": "Robbie Davis",
      "character": "Zydeco"
    },
    {
      "id": "nm5292126",
      "name": "Vince Dyer",
      "character": "Slain Exec"
    },
    {
      "id": "nm3567884",
      "name": "Chris Graue",
      "character": "Gypsy"
    },
    {
      "id": "nm2153954",
      "name": "Alex Huynh",
      "character": "Office Gunman"
    },
    {
      "id": "nm1787698",
      "name": "Ryan Hanna King",
      "character": "Mr. Elliott       (as Ryan King)"
    },
    {
      "id": "nm0492756",
      "name": "Everton Lawrence",
      "character": "Gypsy Scout"
    },
    {
      "id": "nm2628563",
      "name": "Jeff Meacham",
      "character": "Greg Gunney"
    },
    {
      "id": "nm2583369",
      "name": "Jessica Meraz",
      "character": "Female Fan"
    },
    {
      "id": "nm1061563",
      "name": "Soon Hee Newbold",
      "character": "Vio Lin"
    },
    {
      "id": "nm4535518",
      "name": "Mindy Robinson",
      "character": "Estelle"
    },
    {
      "id": "nm3662552",
      "name": "Alex Scolari",
      "character": "Meredith"
    },
    {
      "id": "nm5199429",
      "name": "Andre Drekno Simmons",
      "character": "Gunman #6"
    },
    {
      "id": "nm4730243",
      "name": "Robert Tarpinian",
      "character": "Gypsy"
    },
    {
      "id": "nm3573958",
      "name": "Calvin Tenner",
      "character": "Pork Chop"
    },
    {
      "id": "nm4148829",
      "name": "Melvin Tenner",
      "character": "T-Bone"
    },
    {
      "id": "nm2200632",
      "name": "Matthew Willig",
      "character": "Big Bob"
    },
    {
      "id": "nm3345343",
      "name": "Cathy Zukimoto",
      "character": "Beaver Girl"
    }
  ],
  "overview": "It’s been 20 years since the corporations took over the world’s governments. Their thirst for power and profits led to the Corporate Wars, a fierce global battle that laid waste to society as we know it. Born from the ash, the Council of Nine rose as a new law and order for this dark age. To avenge the corporations’ reckless destruction, the Council issues death warrants for all white collar criminals. Their hunters—the bounty killer. From amateur savage to graceful assassin, the bounty killers now compete for body count, fame and a fat stack of cash. They’re ending the plague of corporate greed and providing the survivors of the apocalypse with retribution. These are the new heroes. This is the age of the BOUNTY KILLER.",
  "storyline": "It's been 20 years since the corporations took over the world's governments. Their thirst for power and profits led to the corporate wars, a fierce global battle that laid waste to society as we know it. Born from the ash, the Council of Nine rose as a new law and order for this dark age. To avenge the corporations' reckless destruction, the Council issues death warrants for all white collar criminals. Their hunter's - the BOUNTY KILLER. From amateur savage to graceful assassin, the BOUNTY KILLER'S now compete for body count, fame and a fat stack of cash. They're ending the plague of corporate greed by exterminating the self serving CEO and providing the survivors of the apocalypse with retribution. These are the new heroes. This is the age of the BOUNTY KILLER.",
  "plot": "This article's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (April 2015) (Learn how and when to remove this template message)\nTwo of the highest ranked bounty killers in the Thrice Burned Lands, Drifter (Matthew Marsden) and Mary Death (Christian Pitre) team up to exterminate a party full of yellow-tied corporate criminals. Drifter’s explosive killing style is in stark contrast to Mary’s graceful way of delivering death to white collar scum. Despite their difference in style, they exhibit level of comfort with one another that seems to indicate a long and dynamic history between these celebrity assassins. After the fight moves to a skyscraper’s rooftop, Drifter disposes of his intended target and saves Mary from falling to her death.\n\nThe bounty killers ride into the bustling town of San Dalloosa, Drifter on his chopper, Mary in her signature cherry-topped death machine. They arrive at Daft Willy’s Chop Shop and Bounty Supply, a converted jet fuselage from the Corporate Wars where bounty killers exchange the bodies of slain targets for cash. A crowd has gathered at the entrance to welcome the heroes. Drifter doesn’t attract the same amount of attention from the paparazzi as Mary Death—how could he? She’s stunningly beautiful—a chiseled, unrepentant killer in thigh high boots. She greets her fans and the press, telling them “I never pull out before the big kill.” While Mary basks in her fans’ adoration, Drifter meets an exuberant gun caddy for hire named Jack LeMans (Barak Hardley). Drifter is not in the mood to hear Jack’s very enthusiastic offer of service, so he leaves him at the gate and heads on into Willy’s.\n\nInside we meet the proprietor, Daft Willy (Kevin McNally). He’s a cantankerous English thug in a blood-soaked apron who will log your kills for the Council of Nine while delivering you a healthy, filth-laden dose of sass. Willy tells Drifter a new death warrant has been issued for their friend Snaggletooth Harry. Drifter’s distress over this revelation attracts the attention of Mary, who enters with a cart full of dead executives. She’s curious to know why he’d make such a big deal out of a small-time collar, telling him “He must be your snitch.” Just then, Jack springs out of Mary’s cart. Willy, Drifter and Mary all pull their guns. Jack pleads for one chance to prove he’s the world’s greatest gun caddy. Drifter decides to give him a shot, knowing he’ll probably be dead within a week anyway. After the bounty killers leave, Daft Willy receives a new death warrant on his Council-Comm printer. The look on his face tells us this isn’t your everyday warrant.\n\nJack and Drifter practice tossing guns back and forth from Drifter’s chopper to Jack’s scooter. They’re on their way to Harry’s Whisky Saloon in Drip Rock to find out why he’s a wanted man. Meanwhile, Mary works on her Mustang’s rear differential which was overstressed by the massive pile of bodies she towed on her trailer. She fixes the car, kicks the trailer away and vows to her car, “No more attachments, just like mama.” At that moment, a tiny car approaches. Out pops Greg Gunney (Jeff Meacham), a sleazy salesman in a sport coat/turtleneck combo. He offers Mary a chance to “join the team” and use her celebrity to endorse his company, Wasteland Resorts—a subsidiary of Second Sun Enterprises, the mysterious company of yellow-ties Mary encountered at the loft party. Mary sees through Greg’s scheme and executes him and his bodyguard with her signature go-go boot spur-kick-to-the-throat move. Upon searching his car she finds a disturbing death warrant—it’s for Francis Gorman, aka “Drifter.”\n\nBack in Drip Rock, Drifter finds that Harry is dead, his body surrounded by copies of the Francis Gorman death warrant. It’s a trap. Mary arrives in Drip Rock and confronts Drifter about the poster. She’s furious that he lied to her. Drifter assures her there is some sort of mistake and he’s going to the Council building to work it all out. She won’t let him off that easy. “I’m going with you, and that’s not a request.” She fires her gun at Drifter which sends him flying out the second story window. Upon landing he’s attacked by several yellow-tied goons. He calls to Jack to grab the bikes. Though grossly outnumbered, the bounty killers eliminate their attackers while arguing about whether or not Mary gets to tag along to see the Council. Just as the last goon drops dead from his sniper post, Jack and Drifter haul ass out of town. Mary puts her hair up and struts to her Mustang.\n\nOutside the town, Mary fires at Drifter and Jack. Jack tells Drifter she won’t be a problem because he modified the car’s boosters while they were in Harry’s Saloon. Mary kicks on her boosters, sending the vehicle into a violent donut spin before bursting into flames. Jack: “That’s not supposed to happen.” Drifter looks back to a soot-covered Mary to make sure she’s alive. She looks back to Drifter with deep anger in her eyes.\n\nBack in Drip Rock, a slick Corvette stingray enters the town square, now littered with the bodies of several yellow ties. Behind the wheel is Van Sterling (Gary Busey), a high ranking executive at Second Sun. He questions one of the struggling henchmen and learns the bounty killers got away and are on their way to the Council. Van then answers a call on his briefcase video phone. He relays the information about the bounty killers to his boss, a severe business woman in yellow stilettos by the name of Catherine (Kristanna Loken). She encourages him to “finish the job” or she will have no choice but to terminate him. Van promises to track down the bounty killers and “keep the killing alive.”\n\nLater that night, Drifter explains to Jack that he’s a wanted criminal and that he should take off. Jack vows to stay. Suddenly, out of the darkness, Drifter is approached by a skull-faced assassin who holds a knife to his throat. This is a Gypsy.\n\nDrifter and Jack are tied to a pole in the middle of a rambunctious celebration at a Gypsy camp. Heavy drinking, fire dancing and other revelry surround the two prisoners. From the largest tent enters the Gypsy Queen, Mocha Sujata (Eve Jeffers). Mocha interrogates Drifter, wanting to know the location of Nuri, a Gypsy girl who escaped their camp many years ago. “She mentioned the name Drifter.” Mocha, not happy with Drifter’s refusal to give up any information, orders another Gypsy to burn him with her fire wands. Despite the extreme torture, Drifter keeps his mouth shut. Mocha calls off the interrogation for the night, leaving the prisoners alone. Drifter confesses to Jack that the Gypsies are looking for Mary. Jack doesn’t understand why Drifter would risk their lives for a woman who tried to kill them, but then realizes that Drifter must be in love with Mary. Drifter explains how he first met Mary many years ago when she lived her life as a Gypsy named Nuri. Nuri approached him while he was in the company of a prostitute Estelle (Mindy Robinson) and demanded he teach her how to be a bounty killer. While training her, they fell in love. But the relationship ended when Drifter suggested they get a place together and settle down.\n\nAt daybreak, the Gypsies are all passed out from a hard night of knocking back pots of roach liquor. Drifter and Jack have cut themselves free from the pole. They climb atop a Gypsy coach (an Airstream trailer pulled by three motorcycles) and make their escape from the camp. Upon hearing the engines’ roar, the Gypsies awake and chase after their prisoners. A Western-style stagecoach scene unfolds when Jack and Drifter try to eliminate their pursuers. A bazooka finishes them off and allows the guys to ride off into the desert.\n\nMary arrives at the Thirsty Beaver, the bounty killer training facility and tavern where she lived during her training with Drifter. Inside she finds the Beaver’s owner, Lucille (Beverly D’Angelo). Lucille helps Mary get cleaned up and back on the road with her old Gypsy bike. She makes sure Mary leaves with her chest-plate armor, telling her “Sometimes it pays for a girl to be practical.”\n\nJack and Drifter pull the Gypsy coach up to a small shack in the middle of what appears to be a junkyard. Outside the shack is a Chevy Nova painted up in Pabst Blue Ribbon race car livery. Drifter tells Jack they need the help of the car’s driver, a coyote named Jimbo (Abraham Benrubi), who will help them get across the Badlands and over to the Council building. Jimbo tells the guys there’s too much risk and that he’s not willing to do the job no matter what price they’re willing to pay. Drifter convinces Jimbo by offering him a six-pack of Pabst Blue Ribbon, Jimbo’s favorite drink and a rarity in the post-apocalyptic world.\n\nMary is lost in the Badlands, a war-torn city engulfed by a violent nuclear storm. She sees a beacon that leads her to Azimuth’s map shop. Inside she meets the mapmaker and pleads with him to help her find her way out of the Badlands and over to the Council building. He refuses to help her until he looks up and realizes she’s the famous Mary Death. He then offers to help in exchange for an autograph.\n\nJimbo successfully makes his way through the Badlands in record time. To celebrate, he cracks open a can of Pabst. “Now I can die a happy man.” Just then Jimbo is shot in the arm by an unseen assailant. The car takes several more hits from a sniper in the hills while Drifter, Jack and Jimbo take cover. Drifter soon realizes the shooter is Mary. He convinces her to come down from the hill and talk it out. Mary points a gun at Drifter and tells him he’s a dead man. Jack has had enough. He loses it, exclaiming that he’s sick of all the guns and the Badlands and Gypsies trying to eat them. He tells Mary that Drifter was beaten to hell by the Gypsies but never gave her up because he loves her. He also points out that Mary could have easily shot Drifter, but she didn’t because she loves him. Mary drops her gun and agrees to let them use her map to get to the Council.\n\nThe group arrives at the Council building and finds the village destroyed by an army of yellow-ties. Inside the Council chamber are the slain bodies of the Council judges. Drifter explains how he knew there must be something wrong. He knew the Council personally. In fact, he was offered a position to be the tenth judge but refused in order to become the first bounty killer. Mary is distraught by the Council’s death, but agrees they must go after those responsible—Second Sun. Just then our heroes are captured and surrounded by another group of yellow-ties including Van and Catherine, who we learn was once married to Drifter. Catherine explains her plan to pin the death of the Council on Mary Death so Second Sun can step in and promise a better life to the survivors of the Thrice Burned Lands. Just when we think all is lost both groups are attacked by Gypsies! During the fight, Jimbo is shot again but saved by Jack who hides him in the trunk of the Nova. Mary leaves Drifter to fight with Mocha. Then Jack leaves Drifter to fight with Van. Drifter is then knocked unconscious and taken aboard the Second Sun helicopter with Catherine. They fly away as the battle rages on. Mary kills Mocha, but is severely injured in the process.\n\nMary awakes in a Gypsy tent to find Jack at her bedside. He tells her the Gypsies are now under her control because she killed their queen. They make a plan to free Drifter from Second Sun with the help of Mary’s new Gypsy army. Inside Second Sun we find Drifter shaven and wearing a suit. He’s tied to a chair in a glass office. Catherine enters and tells him she’d like to reinstate his position as CEO of Gorman Enterprises, now owned by Second Sun. She thinks his “Drifter” celebrity will inspire market confidence. “Run this company with me, Francis. It’s the only thing you’ve ever been good at.” Just then Mary and Jack burst into the office bullpen with their Gypsy army. They knock Catherine unconscious and rescue Drifter. Jack, now a quick and precise gun caddy, assists Drifter and Mary as they unleash their fury upon the employees of Second Sun. Just as they’re about to make their escape, Mary is shot down by Catherine. Drifter kills Catherine and runs to Mary’s lifeless body. He then realizes Mary is wearing a chest-plate. Jack and Drifter carry Mary to safety.\n\nMary and Drifter spend two weeks naked in each other’s arms back at the Thirsty Beaver. Jimbo gives Jack his last can of Pabst to thank him for saving him from the Gypsies. Mary, now in a new black leather get-up, comes down the stairs and hops into her new cherry-topped death machine, a gift from Jack to make up for blowing up her old one. She tells Jack she’s off to do battle with another branch of Second Sun then hits the gas and takes off. Drifter runs out, stabbed again in the spleen by Mary. She looks to him in the rearview: “Come and get me, old man.”",
  "synopsis": null
}