{
  "imdb_id": "tt2332672",
  "tmdb_id": "197759",
  "douban_id": null,
  "title": "Bonitinha, Mas Ordinária (2013)",
  "genres": [
    "Drama"
  ],
  "country": "Brazil",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.2,
  "director": [
    {
      "id": "nm0350845",
      "name": "Moacyr Góes"
    }
  ],
  "writer": [
    {
      "id": "nm0350845",
      "name": "Moacyr Góes",
      "description": "screenplay"
    },
    {
      "id": "nm0735172",
      "name": "Nelson Rodrigues",
      "description": "work by"
    }
  ],
  "cast": [
    {
      "id": "nm1896873",
      "name": "João Miguel",
      "character": "Edgard /              Dr. Werneck's clerk"
    },
    {
      "id": "nm1169691",
      "name": "Letícia Colin",
      "character": "Maria /              Dr. Werneck's daughter"
    },
    {
      "id": "nm0495075",
      "name": "Leandra Leal",
      "character": "Ritinha /              Edgard's girlfriend"
    },
    {
      "id": "nm0433786",
      "name": "Gracindo Júnior",
      "character": "Dr. Werneck /              Businessman"
    },
    {
      "id": "nm0324451",
      "name": "Leon Goes",
      "character": "Peixoto /              Werneck's son-in-law"
    },
    {
      "id": "nm0999163",
      "name": "Beatriz Bertu",
      "character": "Dinorá"
    },
    {
      "id": "nm0181383",
      "name": "Lígia Cortez",
      "character": "Dona Lígia"
    },
    {
      "id": "nm2044252",
      "name": "Gillray Coutinho",
      "character": "Presidente da Comissão /              President of the Commission"
    },
    {
      "id": "nm0229450",
      "name": "Maria Do Carmo Soares",
      "character": "Dona Ivete"
    },
    {
      "id": "nm3630611",
      "name": "Lisa Fávero",
      "character": "Aurora"
    },
    {
      "id": "nm2533285",
      "name": "Daniela Galli",
      "character": "Ana Isabel"
    },
    {
      "id": "nm4191468",
      "name": "Augusto Garcia",
      "character": "Coveiro"
    },
    {
      "id": "nm0321664",
      "name": "Maria Gladys",
      "character": "Irmãs de Ritinha /              Ritinha's sister"
    },
    {
      "id": "nm0495108",
      "name": "Ângela Leal",
      "character": "Dona Berta"
    },
    {
      "id": "nm2840732",
      "name": "Giselle Lima",
      "character": "Tereza"
    },
    {
      "id": "nm0512831",
      "name": "Guilherme Linhares",
      "character": "Personal Trainer"
    },
    {
      "id": "nm1946596",
      "name": "Val Perré",
      "character": ""
    },
    {
      "id": "nm0885101",
      "name": "André Valli",
      "character": "Osiris"
    },
    {
      "id": "nm0896616",
      "name": "Alcemar Vieira",
      "character": "Alfredinho"
    }
  ],
  "overview": "The youngest daughter of a rich man has been raped by five black men in the slums of Rio, and her father arranges her marriage to one of his employees in order to save the family's honor.",
  "storyline": "Edgard (João Miguel) works as a subordinate in the company of millionaire Werneck (Gracindo Junior) and is in love with Ritinha (Leandra Leal), a simple woman who works as a teacher to support her mother and her three sisters. One day, Peixoto (Leon Góes), Werneck's son-in-law, makes him a proposal to marry Maria (Leticia Colin), the boss's daughter. The reason is that Maria was abused and now is being forced to marry by her family. Edgard hesitates first but accepts the offer. From then on he enters into a great doubt: should he deposit the check and marry Maria or stay with Ritinha, his great love?",
  "plot": null,
  "synopsis": "In his anthological play, Pretty, But Sluty, the renowned Brazilian writer, Nelson Rodrigues, works with the idea of temptation that has chased man since the beginning of time. Part of the human contition, as it is. Pretty is the story of a young man named Edgard. His girlfriend, Ritinha, is a simple and attractive woman, who works as a teacher to support her three sisters and deranged mother. He also suffers financial hardships, and also supports his mother, widower to a man that never had any money, not even for his own funeral. Edgard tries to make due in a low rank job at the millionaire Mr. Wernecks company. The story begins when Peixoto, son-in-law and employee to Werneck, makes Edgard the indecent proposition to marry his bosss daughter, Maria Cecilia. At a bar, fueled by alcohol and the trauma of his dads poverty, Edgard accepts. He claims he is allowed not to have character. At Mr. Wernecks house, he learns she has been badly raped and is in urgent need of a fiancée, even if he has to be bought. Edgard is shocked by the proposal and walks out his bosss house. The following day he receives a visit from Peixoto, accompanied by Maria Cecilia, who asks him to reconsider his decision. He then goes back to Mr. Werneck, who hands him a carriers check worth millions. At first Edgard doesnt accept it. He says hes not a Peixoto. But the old man insists. He wants to prove Edgard I just like Peixoto; he says that, In Brazil, everyone is a Peixoto, a very current theme. From that moment on, the story revolves around the temptation that will imprison the young man."
}