{
  "imdb_id": "tt2386175",
  "tmdb_id": "274283",
  "douban_id": null,
  "title": "A Dark Matter (2013)",
  "genres": [
    "Crime",
    "Sci-Fi",
    "Thriller"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "100 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.6,
  "director": [
    {
      "id": "nm1423542",
      "name": "James Naylor"
    }
  ],
  "writer": [
    {
      "id": "nm1423542",
      "name": "James Naylor",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm5031226",
      "name": "Daniel Briere",
      "character": "Angus"
    },
    {
      "id": "nm2857835",
      "name": "Shauna Bradley",
      "character": "Laura"
    },
    {
      "id": "nm2715863",
      "name": "Ashiko Westguard",
      "character": "Eve"
    },
    {
      "id": "nm1538339",
      "name": "Troy Blundell",
      "character": "Dick"
    },
    {
      "id": "nm0866971",
      "name": "David Tompa",
      "character": "The Albino"
    },
    {
      "id": "nm1479104",
      "name": "Danny Waugh",
      "character": "Wade"
    },
    {
      "id": "nm0603417",
      "name": "Marty Moreau",
      "character": "Stan"
    },
    {
      "id": "nm0096168",
      "name": "Walter Borden",
      "character": "The Demon"
    },
    {
      "id": "nm1477891",
      "name": "Stephen G. Brown",
      "character": "Goon"
    },
    {
      "id": "nm2818124",
      "name": "Angela Froese",
      "character": "Waitress"
    },
    {
      "id": "nm4487517",
      "name": "Roscoe van Dyke",
      "character": "Tattoo Parlour Guy"
    }
  ],
  "overview": "Unhinged by his girlfriend's sudden departure, artist Angus begins slipping into a dark layer of reality ruled by a powerful demon. Believing that the key to finding her lies within, Angus plunges deeper into the infernal netherworld.",
  "storyline": "Angus and Laura love each other deeply...but Laura is holding a deep dark secret. When she leaves him inexplicably, Angus slips into a foreboding realm, where the Demon of Nothingness reigns supreme. After Laura's exit, Angus questions his role in her disappearance and sets out to uncover the truth. Working his way through a cunning gallery of underworld figures, Angus slowly unlocks Laura's secret while discovering sinister truths about himself. With nothing but his own Demon to guide him, Angus ventures across dimensions and states of reality to find Laura and win her back.",
  "plot": "The film is inspired by the true story of Gang Lu, a former graduate student who killed four faculty members and one student at the University of Iowa. However, the story has substantial differences in plot and character motivation.\n\nLiu Xing (Liu Ye) is a humble but brilliant Chinese student who arrives at Valley State University and makes a bumpy transition into American life with the help of Joanna Silver (Meryl Streep). Silver is a wealthy university patron who has a fascination with Chinese culture and takes a liking to Liu Xing. Xing joins a select cosmology group under the direction of his hero, the famous cosmologist Professor Jacob Reiser (Aidan Quinn). The group is working to create a model of the origins of the universe, based on Reiser's theory. Xing's enormous talent leads him quickly to become Reiser's protégé, and it seems that only hard work stands between him and a bright future in science.\n\nXing is obsessed with the study of dark matter, an unseen substance that he believes shapes the universe, and a theory that conflicts with the Reiser model. Xing makes scientific breakthroughs of his own which improve the Reiser model. Without Professor Reiser's approval, Liu Xing proposes to research dark matter for his doctoral dissertation. Reiser explains to Xing that this type of research is too complicated and suggests that he should pick a simpler dissertation topic.\n\nRefusing to work with Xing, Reiser finds a new protégé in Feng Gang (Lloyd Suh), another Chinese student who was Xing's rival in undergraduate school in Beijing. Professor Reiser approves of Feng's dissertation proposal as it sticks to the Reiser model. Feng's English skills are far superior to his fellow Chinese students', and he refuses to speak in Mandarin with them. Feng changes his name to Laurence so that Americans would be more comfortable pronouncing his name.\n\nWithout the permission of Professor Reiser, Xing publishes an article in an astronomy journal. Reiser is enraged by this and refuses to accept Xing's doctoral dissertation.\n\nAt a graduation party for the Chinese students it is announced that Laurence Feng has won the university's science dissertation prize for that year. Joanna Silver urges Professor Reiser to do something to help Liu Xing. Reiser informs her that he has written a \"very fine\" recommendation for him.\n\nXing does not graduate and finds his dream of winning the Nobel Prize shattered. He goes on to sell beauty products to try to make money. His roommate offers to find him a job in China, but Xing refuses to leave. A few months pass and Xing mails all of his money to his parents in China.\n\nOne day, Xing returns to campus. He heads into an auditorium where Laurence Feng is giving a presentation to the cosmology department. Unable to cope with his emotions, Xing pulls a revolver out of his coat and begins firing, shooting Laurence and Reiser before making his way to Reiser's office and shooting himself in the head.",
  "synopsis": null
}