{
  "imdb_id": "tt2369317",
  "tmdb_id": "253312",
  "douban_id": null,
  "title": "Space Station 76 (2014)",
  "genres": [
    "Comedy",
    "Drama",
    "Sci-Fi"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "93 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.9,
  "director": [
    {
      "id": "nm0687443",
      "name": "Jack Plotnick"
    }
  ],
  "writer": [
    {
      "id": "nm0185078",
      "name": "Jennifer Elise Cox",
      "description": "screenplay &"
    },
    {
      "id": "nm0659143",
      "name": "Sam Pancake",
      "description": "screenplay &"
    },
    {
      "id": "nm0687443",
      "name": "Jack Plotnick",
      "description": "screenplay &"
    },
    {
      "id": "nm0733812",
      "name": "Kali Rocha",
      "description": "screenplay &"
    },
    {
      "id": "nm0832989",
      "name": "Michael Stoyanov",
      "description": "screenplay as Mike Stoyanov"
    }
  ],
  "cast": [
    {
      "id": "nm0933940",
      "name": "Patrick Wilson",
      "character": "Captain Glenn"
    },
    {
      "id": "nm0000239",
      "name": "Liv Tyler",
      "character": "Jessica"
    },
    {
      "id": "nm0004846",
      "name": "Marisa Coughlan",
      "character": "Misty"
    },
    {
      "id": "nm0093589",
      "name": "Matt Bomer",
      "character": "Ted"
    },
    {
      "id": "nm0005278",
      "name": "Jerry O'Connell",
      "character": "Steve"
    },
    {
      "id": "nm4814017",
      "name": "Kylie Rogers",
      "character": "Sunshine"
    },
    {
      "id": "nm0733812",
      "name": "Kali Rocha",
      "character": "Donna"
    },
    {
      "id": "nm1285162",
      "name": "Matthew Morrison",
      "character": "Daniel"
    },
    {
      "id": "nm0001158",
      "name": "Keir Dullea",
      "character": "Mr. Marlowe"
    },
    {
      "id": "nm1554661",
      "name": "Ryan Gaul",
      "character": "Chuck"
    },
    {
      "id": "nm0865610",
      "name": "Victor Togunde",
      "character": "James"
    },
    {
      "id": "nm3831019",
      "name": "Jonny Jay",
      "character": "Trucker"
    },
    {
      "id": "nm0832989",
      "name": "Michael Stoyanov",
      "character": "Dr. Bot       (voice)"
    },
    {
      "id": "nm6400715",
      "name": "Susan Currie",
      "character": "Steve's Mother"
    },
    {
      "id": "nm5457611",
      "name": "Hart Keathley",
      "character": "Donna's Baby"
    },
    {
      "id": "nm3358060",
      "name": "Anna Sophia Berglund",
      "character": "Star Angel"
    },
    {
      "id": "nm0659143",
      "name": "Sam Pancake",
      "character": "Saul"
    },
    {
      "id": "nm1056786",
      "name": "Katherine Ann McGregor",
      "character": "Janice"
    },
    {
      "id": "nm2576427",
      "name": "Julia Wood",
      "character": "Susan"
    },
    {
      "id": "nm5074367",
      "name": "Melodi Hallenbeck",
      "character": "Herself"
    }
  ],
  "overview": "A comedic drama about a group of people (and several robots) living on a space station in a 1970’s-version of the future. When a new Assistant Captain arrives, she inadvertently ignites tensions among the crew, prompting them to confront their darkest secrets. Barely contained lust, jealousy, and anger all bubble to the surface, becoming just as dangerous as the asteroid that’s heading right for them.",
  "storyline": "Space Station 76 is a refueling satellite near an alternate-reality Earth, circa 1976. Jessica arrives to serve as the station's new first mate. While she narrates a piece about how she likes the predictability of asteroids, some placidly drifting asteroids are shown colliding in chain-reaction fashion. While at first the station appears normal and the people friendly, Jessica soon discovers that the people on board have issues due to the isolation and stress of being cooped up with one another in a relatively small space far from Earth. This is in addition the usual problems people struggle with, such as infidelity, loneliness, depression, and drug abuse. She tries to make friends and fit in, but, unable to connect meaningfully with anyone, she becomes lonely. She's baffled and disillusioned by the stiff and irritable Captain Glenn, who harbors secrets of his own. She finds herself drawn to Ted, a lonely, married crewman, and his 7 year-old daughter, Sunshine. Ted yearns to reconnect...",
  "plot": "Space Station 76 is a dark comedy film that deconstructs seemingly idyllic relationships, set against the backdrop of Omega 76; a 1970s' retro future styled space station.\n\nJessica (Tyler) arrives to serve as the station's new co-pilot. While at first all seems normal and the crew friendly, she soon discovers that the people on board are struggling with issues such as infidelity, loneliness, depression, and drug abuse.\n\nShe becomes increasingly frustrated by Captain Glenn (Wilson), who harbors a secret of his own, namely his failed relationship with the previous co-pilot, Daniel. She is eventually drawn to Ted (Bomer), a lonely, married crewman, and his 7-year-old daughter, Sunshine (Rogers). Ted yearns to reconnect with his wife, Misty (Coughlan), but she's happier talking over her problems with Doctor Bot and having an affair with Steve (O'Connell). His daughter Sunshine contends with her unhappy, mentally ill mother and her pet gerbil eating its babies, one by one.\n\nEvents finally come to a head at a Christmas party, when Misty suggests they play the \"Truth Game\". Jessica then exposes Glenn's homosexuality, just before Misty almost exposes Jessica's inability to have children. Just when it seems like everything's falling apart, an asteroid collides with the station, destroying the shuttle and leaving them all stranded.\n\nAs the crew slowly return to their lives, Sunshine turns off the gravity, and floats whilst viewing a meteor shower through the window.",
  "synopsis": null
}