{
  "imdb_id": "tt2369543",
  "tmdb_id": "128250",
  "douban_id": null,
  "title": "When I Saw You (2012)",
  "genres": [
    "Drama"
  ],
  "country": "Palestine",
  "version": [
    {
      "runtime": "98 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm1486975",
      "name": "Annemarie Jacir"
    }
  ],
  "writer": [
    {
      "id": "nm1486975",
      "name": "Annemarie Jacir",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm5120012",
      "name": "Mahmoud Asfa",
      "character": "Tarek"
    },
    {
      "id": "nm1569162",
      "name": "Ruba Blal",
      "character": "Ghaydaa"
    },
    {
      "id": "nm2759746",
      "name": "Saleh Bakri",
      "character": "Layth"
    },
    {
      "id": "nm4667777",
      "name": "Anas Algaralleh",
      "character": "Mr. Nasser"
    },
    {
      "id": "nm4629973",
      "name": "Ali Elayan",
      "character": "Abu Akram"
    },
    {
      "id": "nm5120086",
      "name": "Ruba Shamshoum",
      "character": "Zain"
    },
    {
      "id": "nm4192827",
      "name": "Ahmad Srour",
      "character": "Touissant"
    },
    {
      "id": "nm3837605",
      "name": "Firas Taybeh",
      "character": "Majed       (as Firas W. Taybeh)"
    },
    {
      "id": "nm5120064",
      "name": "Husam Abed",
      "character": "Al Arabi"
    },
    {
      "id": "nm5120481",
      "name": "Fadia Abu Ayash",
      "character": "Jihan"
    },
    {
      "id": "nm5119842",
      "name": "Rafa' Abu Ayash",
      "character": "Lena"
    },
    {
      "id": "nm5120461",
      "name": "Ammar Abu Shawish",
      "character": "Antar"
    },
    {
      "id": "nm5120802",
      "name": "Mahmoud Al Hayek",
      "character": "City Boy 1"
    },
    {
      "id": "nm5120350",
      "name": "Bashar Al Khallaylleh",
      "character": "Al Qanas"
    },
    {
      "id": "nm5120213",
      "name": "Ahmad Al Muhaisan",
      "character": "City Boy 2"
    },
    {
      "id": "nm5119851",
      "name": "Ayoub Al Nahhas",
      "character": "Young Man"
    },
    {
      "id": "nm5120476",
      "name": "Yazan Al Rousan",
      "character": "Abu Hadeed"
    },
    {
      "id": "nm3359274",
      "name": "Bashar Al-Kasawneh",
      "character": "Blue Eyed Fighter /              Poser"
    },
    {
      "id": "nm4883718",
      "name": "Yahya Alabdallah",
      "character": "George Al Nabulsi"
    },
    {
      "id": "nm5120464",
      "name": "Rawd Amr",
      "character": "Givara"
    },
    {
      "id": "nm1178152",
      "name": "Hamada Atallah",
      "character": "Imwas Refugee"
    },
    {
      "id": "nm4553166",
      "name": "Kamal Awad",
      "character": "Mustafa"
    },
    {
      "id": "nm3050599",
      "name": "Ossama Bawardi",
      "character": "Jawad"
    },
    {
      "id": "nm5120052",
      "name": "Emna Ben Rejeb",
      "character": "City Girl 2       (as Peeka)"
    },
    {
      "id": "nm5120558",
      "name": "Mais Darwazah",
      "character": "Soup Line Woman"
    },
    {
      "id": "nm5120451",
      "name": "Dehnert Elspeth",
      "character": "Foreign Journalist"
    },
    {
      "id": "nm5120092",
      "name": "Sushi Firas",
      "character": "Abu Shibriyeh"
    },
    {
      "id": "nm5119936",
      "name": "George Irshaid",
      "character": "Darbuka Cheeks Boy"
    },
    {
      "id": "nm5120072",
      "name": "Beesan Khalifeh",
      "character": "Dabkeh Leader"
    },
    {
      "id": "nm3035428",
      "name": "Taher Kosa",
      "character": "Man in Line"
    },
    {
      "id": "nm5016705",
      "name": "Waleed Laham",
      "character": "Ibn Khaldoun"
    },
    {
      "id": "nm5120245",
      "name": "Baider Manasrah",
      "character": "Nader"
    },
    {
      "id": "nm4655454",
      "name": "Ahmad Massad",
      "character": "As'ad"
    },
    {
      "id": "nm4607176",
      "name": "Majdi Mohammad",
      "character": "Hamza"
    },
    {
      "id": "nm5016544",
      "name": "Suha Najjar",
      "character": "Madame Nura"
    },
    {
      "id": "nm4667892",
      "name": "Sultan Petro",
      "character": "Kifah"
    },
    {
      "id": "nm5120526",
      "name": "Hala Qattan",
      "character": "Haneen"
    },
    {
      "id": "nm5120226",
      "name": "Ali Ramahi",
      "character": "Ahmad"
    },
    {
      "id": "nm5120745",
      "name": "Waleed Ramahi",
      "character": "Waleed"
    },
    {
      "id": "nm4759659",
      "name": "Amin Safi",
      "character": "Welcoming Charity Worker"
    },
    {
      "id": "nm5120393",
      "name": "Jawhar Salim",
      "character": "Organization Recruiter"
    },
    {
      "id": "nm2700338",
      "name": "Lara Sawalha",
      "character": "Ayisha"
    },
    {
      "id": "nm5119869",
      "name": "Hamdi Shawqi",
      "character": "Taimur al Safadi"
    },
    {
      "id": "nm5120336",
      "name": "Hala Shishany",
      "character": "Peasant Woman"
    },
    {
      "id": "nm5120097",
      "name": "Amer Zacarneh",
      "character": "The Algerian"
    },
    {
      "id": "nm4552546",
      "name": "Shereen Zoumot",
      "character": "Amal"
    },
    {
      "id": "nm5120281",
      "name": "Nadine Zureikat",
      "character": "City Girl 1"
    }
  ],
  "overview": "Jordan, 1967: displaced to a refugee camp after the occupation of their West Bank village, an eleven-year old boy and his mother enact the emancipating dream that every refugee has imagined countless times, in Annemarie Jacir's passionate and moving follow-up to her prize-winning debut Salt of This Sea. (TIFF)",
  "storyline": "1967. The world is alive with change: brimming with reawakened energy, new styles, music and an infectious sense of hope. In Jordan, a different kind of change is underway as tens of thousands of refugees pour across the border from Palestine. Having been separated from his father in the chaos of war, Tarek, 11, and his mother Ghaydaa, are amongst this latest wave of refugees. Placed in \"temporary\" refugee camps made up of tents and prefab houses until they would be able to return, they wait, like the generation before them who arrived in 1948. With difficulties adjusting to life in Harir camp and a longing to be reunited with his father, Tarek searches a way out, and discovers a new hope emerging with the times. Eventually his free spirit and curious nature lead him to a group of people on a journey that will change their lives. When I Saw You is the story of people affected by the times around them, in search of something more in their lives. A journey full of adventure, love, humor...",
  "plot": "In 19th-century Baltimore, Maryland, several policemen discover a murdered woman sprawled on the floor of her apartment, which was locked from the inside. While police search for the killer's means of escape, they discover a second corpse in the chimney, later identified as the 12-year-old daughter of the first victim. A celebrated detective, Emmett Fields (Luke Evans), is called to assist in the investigation and discovers that the crime resembles a fictional murder in a short story, \"The Murders in the Rue Morgue\", that he once read.\n\nThe writer Edgar Allan Poe (John Cusack) is brought to Fields for questioning. After finding the body of Griswold (John Warnaby), a rival of Poe, cut in half by a pendulum (as in Poe's story \"The Pit and the Pendulum\"), the pair deduce that someone is staging murders based on Poe's stories. Edgar's love, Emily Hamilton (Alice Eve), is kidnapped at her father's (Brendan Gleeson) masquerade ball, like the one described in Poe's \"The Masque of the Red Death\". The killer taunts Poe in a note, demanding that Edgar write and publish a new story. Poe's lodgings are burned down by people who believe he is exploiting the murders for his own journalistic ends, and he is forced to move in with Fields.\n\nA clue from the killer referring to \"The Cask of Amontillado\" leads Poe and Fields to search the tunnels under the city with several policemen, discovering the walled-up corpse of a man dressed as Emily. The man is determined to be a sailor, and the clues on his body bring the pursuers to Holy Cross Church, where an empty grave with Emily's name on it has been prepared. As the police attempt to break down the church doors, the killer attacks and kills one of the policemen, then shoots and wounds Fields. Poe gives chase on horseback, but the killer escapes.\n\nPoe writes one last newspaper column, offering his life for Emily's, suggesting that he could take poison. In the morning, the maid gives Poe a letter from the killer, accepting his terms, but the note was delivered long before the paper was distributed. Realizing that the killer must work at the paper, Poe races to confront his editor, Henry (Kevin McNally), but Henry is already dead, another note lying next to him.\n\nThe real killer is the paper's typesetter, Ivan Reynolds (Sam Hazeldine), who congratulates Poe and offers him a drink. Ivan attempts to converse with Edgar, but Poe demands Emily's location. Ivan pours a vial of poison, promising to end the story as Poe had written it. Poe agrees and drinks the liquid. Ivan quotes the \"The Tell-Tale Heart\", cluing Edgar that Emily is concealed beneath the printing floor. As the killer leaves, Poe uses the last of his strength to tear up a false section of floor and open a trapdoor leading to Emily's prison.\n\nPoe rescues Emily, and they share a poignant moment before she is taken away by ambulance. Delirious from the poison, Edgar wanders off to a park bench to die. A man walking in the park recognizes him as the famous writer, and asks if he is all right. Poe can summon only enough strength to say, \"Tell Fields his last name is Reynolds.\" Later, when Fields comes to view Poe's corpse at the hospital, the attending physician is unable to tell him the exact cause of death, but mentions that the writer was incoherent, insisting that \"his last name is Reynolds.\" Fields ponders the meaning of the phrase, slowly connecting the dots.\n\nIvan disembarks from a train in Paris. As a porter carries his luggage, Ivan climbs into a carriage and is confronted by Fields. He lunges for the detective, and Fields shoots him at point blank range.",
  "synopsis": null
}