{
  "imdb_id": "tt2386502",
  "tmdb_id": "291319",
  "douban_id": null,
  "title": "A Long Way Off (2014)",
  "genres": [
    "Drama",
    "Family",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "105 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.6,
  "director": [
    {
      "id": "nm2473620",
      "name": "Michael Davis"
    },
    {
      "id": "nm2988017",
      "name": "John Errington"
    }
  ],
  "writer": [
    {
      "id": "nm1139946",
      "name": "Jon Macy",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0001108",
      "name": "Robert Davi",
      "character": "Frank"
    },
    {
      "id": "nm0566052",
      "name": "Edie McClurg",
      "character": "Mrs. Grey"
    },
    {
      "id": "nm0225963",
      "name": "John Diehl",
      "character": "Mr. Abraham"
    },
    {
      "id": "nm3600327",
      "name": "Jason Burkey",
      "character": "Jake"
    },
    {
      "id": "nm2005998",
      "name": "Zoe Myers",
      "character": "Summer"
    },
    {
      "id": "nm3892002",
      "name": "Robert Amaya",
      "character": "Jose"
    },
    {
      "id": "nm3673618",
      "name": "Robert Crayton",
      "character": "Thug"
    },
    {
      "id": "nm0360458",
      "name": "Sean Hannity",
      "character": "Himself"
    },
    {
      "id": "nm3512325",
      "name": "Rusty Martin Sr.",
      "character": "Al"
    },
    {
      "id": "nm0722468",
      "name": "Jordan Rhodes",
      "character": "Mr. Foster"
    },
    {
      "id": "nm1658403",
      "name": "Johanna Jowett",
      "character": "Laura"
    },
    {
      "id": "nm5459077",
      "name": "Alec VanOwen",
      "character": "Coffee Shop Barista       (as Alec VanOwen Nance)"
    },
    {
      "id": "nm5476962",
      "name": "Melissa Eastwood",
      "character": "Club Goer"
    },
    {
      "id": "nm2817581",
      "name": "Dave Blamy",
      "character": "Seth"
    },
    {
      "id": "nm1513843",
      "name": "Jeremy DeCarlos",
      "character": "Evan"
    },
    {
      "id": "nm1842950",
      "name": "Thomas W. Stewart",
      "character": "Distinguished Gentleman"
    },
    {
      "id": "nm5477297",
      "name": "Rusty Cage",
      "character": "Homeless Man"
    },
    {
      "id": "nm5325972",
      "name": "Schelle Purcell",
      "character": "Party Goer       (as Schelle Holloway-Purcell)"
    },
    {
      "id": "nm6195052",
      "name": "Lynne Smith",
      "character": "Mall Shopper"
    },
    {
      "id": "nm5477036",
      "name": "Sherry Sparks-Jenkins",
      "character": "Mom in bookstore and coffee shop"
    },
    {
      "id": "nm6175930",
      "name": "Jeff Hill",
      "character": "Bar Patron"
    },
    {
      "id": "nm2582379",
      "name": "Jerry Keys",
      "character": "Street person"
    },
    {
      "id": "nm5439235",
      "name": "Gerald Jackson",
      "character": "Older Type Men"
    },
    {
      "id": "nm5240059",
      "name": "Brian Patrick Moize",
      "character": "Buisnessman /              party goer"
    },
    {
      "id": "nm5334637",
      "name": "Matt Perkinson",
      "character": ""
    },
    {
      "id": "nm5630105",
      "name": "Kristopher Dennis",
      "character": "Hotel Concierge"
    },
    {
      "id": "nm5202759",
      "name": "Bohdana Madlova",
      "character": "Homeless person"
    },
    {
      "id": "nm4172170",
      "name": "Andy Greenberg",
      "character": "Radio Show 'Your Daily HIgh with Andy Greenberg'"
    },
    {
      "id": "nm5589136",
      "name": "Dillon Rust",
      "character": "Himself"
    },
    {
      "id": "nm6152956",
      "name": "Andrew Lepper",
      "character": "Ranch Hand"
    },
    {
      "id": "nm5353262",
      "name": "Benjamin J. Alexander",
      "character": "Hotel Concierge       (as Ben Joyce)"
    },
    {
      "id": "nm2436226",
      "name": "Preston Campbell",
      "character": "Sam"
    },
    {
      "id": "nm3204663",
      "name": "Charlene J Jones",
      "character": "Jewelry Store Patron /              Hotel Guest"
    },
    {
      "id": "nm6213255",
      "name": "Ed Racketa Jr.",
      "character": "Ranch Hand"
    },
    {
      "id": "nm4851189",
      "name": "Mark Adkins",
      "character": "Man on Street"
    },
    {
      "id": "nm5442251",
      "name": "Mark D. Otto",
      "character": "Bartender /              Man on Street"
    },
    {
      "id": "nm5353046",
      "name": "Tony Stiles",
      "character": "Himself"
    },
    {
      "id": "nm6152955",
      "name": "David Bissette",
      "character": "Ranch Hand"
    },
    {
      "id": "nm7793132",
      "name": "Izzy Milone",
      "character": "Kid at Party"
    },
    {
      "id": "nm6583253",
      "name": "Mary Goggins Selke",
      "character": "Woman at Chick Fil A Window"
    },
    {
      "id": "nm6502220",
      "name": "Michael Ogus",
      "character": "Man in Homeless Shelter"
    },
    {
      "id": "nm0711413",
      "name": "Scott Rasmussen",
      "character": "Himself"
    },
    {
      "id": "nm5626728",
      "name": "Michael S. Moncrief",
      "character": "Partygoer"
    },
    {
      "id": "nm5380903",
      "name": "Beverly Smallwood",
      "character": "Herself       (as Dr. Beverly Smallwood)"
    },
    {
      "id": "nm6086227",
      "name": "Raelynn Miller",
      "character": "Bookstore shopper"
    },
    {
      "id": "nm5498225",
      "name": "Sabrina Battiston",
      "character": "Teen Shopper"
    },
    {
      "id": "nm5466314",
      "name": "Jennifer M. Evans",
      "character": "Partygoer"
    },
    {
      "id": "nm6401782",
      "name": "Asia Christmas",
      "character": "Pedestrian"
    },
    {
      "id": "nm5368716",
      "name": "Cassidy Morales",
      "character": "Teen"
    },
    {
      "id": "nm5923490",
      "name": "Lee Anne Battiston",
      "character": "Bookstore Shopper"
    },
    {
      "id": "nm5464527",
      "name": "Kevin M. Conte",
      "character": "Older Producer"
    },
    {
      "id": "nm6497117",
      "name": "Brittany Hensley",
      "character": "Jake's Party Friend"
    },
    {
      "id": "nm5466246",
      "name": "Rod Hoell",
      "character": "Ranch Hand"
    },
    {
      "id": "nm5142667",
      "name": "Douglas Morales",
      "character": "Harley Rider /              Business Man"
    },
    {
      "id": "nm5442217",
      "name": "Haddon Otto",
      "character": "Boy in Coffee Shop"
    },
    {
      "id": "nm5575917",
      "name": "Nina Guest",
      "character": "Herself - Author"
    },
    {
      "id": "nm3705351",
      "name": "Simone White",
      "character": "Girl Companion"
    },
    {
      "id": "nm5368734",
      "name": "Albrianna Morales",
      "character": "Teen"
    },
    {
      "id": "nm6086228",
      "name": "Debee Anderson",
      "character": "Bookstore shopper"
    }
  ],
  "overview": "Jacob is tired of living on the family farm, submitting to the rules of his father. One day he demands an early inheritance from his father, who shocks his young son by agreeing to give it to him. So, he heads to the big city doing things his way without restraint, and for a while he does well-surprisingly well. He takes huge business risks and converts his small fortune into a big fortune, despite his extremely flamboyant lifestyle that attracts the wrong women, including seductive Laura, whose rich boyfriend Frank is often dangerously nearby. Jake had it all: money, ladies, prestige-but then-he loses it all and just when he things he's hit bottom the bottom drops some more- until he is eating out of dumpsters and eventually ends up living in a literal pig pen. Coming to his senses he heads home, determined to work in an entry level position for his dad, who surprises him once again by running to him-but is it to kiss him or kill him?",
  "storyline": "In this modern day retelling of the timeless Prodigal Son Parable, young Jacob is tired of living on the family farm, submitting to the rules of his Father, Mr. Abraham. One day he demands an early inheritance from his father, who shocks his young son by agreeing to give it to him. So, he heads to the big city doing things his way without restraint, and for a while he does well-surprisingly well. He takes huge business risks and converts his small fortune into a big fortune, despite his extremely flamboyant lifestyle that attracts the wrong women, including seductive Laura, whose rich boyfriend Frank is often dangerously nearby. Jake had it all: money, ladies, prestige-but then-he loses it all and just when he things he's hit bottom the bottom drops some more- until he is eating out of dumpsters and eventually ends up living in a literal pig pen. Coming to his senses he heads home, determined to work in an entry level position for his dad, who surprises him once again by running to ...",
  "plot": "Martin Sharp (Pierce Brosnan) is contemplating suicide on New Year's Eve on the roof of the Toppers Building, high above London's streets. He is interrupted by a woman, Maureen (Toni Collette), who has the same fate in mind. She shyly offers to wait her turn, until two other strangers, a young woman named Jess (Imogen Poots) and a pizza deliverer called J.J. (Aaron Paul), also turn up.\n\nMartin is recognized by the others, having been a popular television personality before going to prison for a relationship with a girl who turned out to be 15. After talking things over, the four strangers form a pact, vowing to wait at least until Valentine's Day before taking their lives.\n\nMaureen has a disabled son she adores, but little life beyond that. Jess is the daughter of a politician (Sam Neill) and their relationship is strained. J.J. is an American who once played in a band, but while his three new acquaintances are suicidally depressed, he is terminally ill with cancer (or so he says).\n\nTo profit from misfortune, Martin hatches a scheme that makes them the talk of London, claiming their mass suicide was interrupted by a vision. They end up on his old TV chat show, where Martin's former co-host Penny (Rosamund Pike) makes her guests feel humiliated and even more depressed.\n\nThe four go off to a vacation resort to get away from London's attention. They enjoy each other's company, at least until a confession by one of them and the intervention of a reporter named Kathy drives them apart. Matty, Maureen's son, has a heart attack but recovers. Jess and Martin visit Maureen in the hospital but J.J. can't be contacted. They realise it's Valentine's Day and that their pact has ended. All four end up back in London on the very same rooftop with the other three coaxing J.J. off the edge successfully.\n\nOn New Year's Eve that year, they video call each other. Martin is looking after his daughter, Maureen is enjoying herself at a New Year's party, and J.J. and Jess are in a happy relationship.",
  "synopsis": "A LONG WAY OFF\nSynopsisHandsome Jake Abraham (JASON BURKEY) works for his father (JOHN DIEHL), a successful produce farmer in North Carolina. A recent college graduate with a strong interest in technology, Jake doesn't like agri-business very much and is desperate to leave for greener pastures in the big city. To his shock and delight, his father, sensing his sons frustration, suddenly offers Jake his inheritance. Bidding farewell to his dad, his brother, Seth (DAVE BLAMY), their loyal secretary, Mrs. Grey (EDIE MCCLURG) and their ranch hand, Jose (ROBERT AMAYA), Jake heads to the city, ready to make his bones in a series of sharp stock market moves.Rather than start slowly with a modest apartment and basic transportation, Jake checks into a swanky hotel and buys a pricey Italian sports car. He later purchases a condominium and spends his nights wining and dining a series of women he meets in bars and nightclubs. One of his new girlfriends is sexy Laura (JOHANNA JOWETT) who encourages Jake to invest in a speculative movie project. She also introduces him to her shady boyfriend, Frank (ROBERT DAVI) who is interested in Jake's stock market acumen.Jake's morning ritual is to stop off at the local coffee house, where he has a friendly relationship with a beautiful barista named Summer (ZOE MYERS) who is very much attracted to Jake. However, any potential for a relationship is scuttled by Jake's irresponsible life style and his dalliance with Laura. Meanwhile, Jake doesn't bother to keep in touch with his family and isn't aware that Abraham Farms is having financial trouble until Summer leaves him a newspaper clipping.Determined to make a killing in the stock market, Jake places the bulk of his remaining inheritance, and a chunk of Franks money in a video game company. Disaster strikes when the video game company's stock trading is halted by the SEC, an event that essentially dissolves Jake's inheritance. Since Frank jumped into the stock too, he's outraged and ready to kill Jake unless the money is repaid.Broke, desperate and eating out of a dumpster, Jake is befriended by Al, a homeless man (RUSTY MARTIN, SR.) who helps him secure a job at a local pig farm. There, in the mud, Jake is taught to realize that he can still go home and that family love and forgiveness are not as ephemeral as the stock market. It is a humbled Jake who returns home and reunites with his family, determined to make a new start at Abraham Farms. He then returns to rekindle a relationship with Summer, who is delighted to see the new Jake. --Written by Steve Rubin"
}