{
  "imdb_id": "tt2386327",
  "tmdb_id": "159988",
  "douban_id": null,
  "title": "The Institute (2013)",
  "genres": [
    "Documentary",
    "Crime",
    "Mystery",
    "Sci-Fi"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "92 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm3577075",
      "name": "Spencer McCall"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm4927429",
      "name": "Arye Bender",
      "character": "Octavio Coleman Esq"
    },
    {
      "id": "nm1985657",
      "name": "Boston Blake",
      "character": "Dr. Eldridge Spearmint"
    },
    {
      "id": "nm2124102",
      "name": "Jeff Hull",
      "character": "Creator"
    },
    {
      "id": "nm5061035",
      "name": "Chelsea London Lloyd",
      "character": "Beth Foley"
    },
    {
      "id": "nm6546394",
      "name": "Gordon Mclachlan",
      "character": "Drybones"
    },
    {
      "id": "nm0679336",
      "name": "Tracy Pfau",
      "character": "Jejune Operator"
    },
    {
      "id": "nm5031225",
      "name": "Daniel Shoup",
      "character": "Kelvin Williams"
    },
    {
      "id": "nm9052379",
      "name": "Carolee Gilligan Wheeler",
      "character": "Ex-Inductee"
    }
  ],
  "overview": "Thousands of participants in a San Francisco-based alternate reality game end up getting more than they bargained for. Told from the players’ perspectives, the film looks over the precipice at an emergent new art form where the real world and fictional narratives merge to create unforeseen and often unsettling consequences. Examining counter-culture, new religious movements and street art, this film takes the viewer on a journey into a secret underground world teeming just beneath the surface of everyday life.",
  "storyline": "Feature-length documentary that examines a San Francisco-based Alternate Reality Game, where thousands of participants got more than they bargained for. Told from the players' perspectives, the film looks over the precipice at an emergent new art form where the real world and fiction narratives merge to create unforeseen and often unsettling consequences.",
  "plot": null,
  "synopsis": "To those dark horses with the spirit to look up and see... a recondite family awaits.\" Welcome to the Jejune Institute, a mind-bending San Francisco phenomenon where 10,000 people became \"inducted\" without ever quite realizing what they'd signed up for. Was it a cult? Was it an elaborate game? Told from the participants perspectives, the film looks over the precipice at an emergent new art form where real world and fictional narratives collide, creating unforeseen and often unsettling consequences. Fusing elements of counter-culture, new religious movements and street art, THE INSTITUTE invites viewers down the rabbit hole into a secret underground world teeming just beneath the surface of everyday life."
}