{
  "imdb_id": "tt2301900",
  "tmdb_id": "139659",
  "douban_id": null,
  "title": "Puppet Master X: Axis Rising (2012)",
  "genres": [
    "Action",
    "Comedy",
    "Fantasy",
    "Horror",
    "Sci-Fi",
    "War"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "86 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.2,
  "director": [
    {
      "id": "nm0023929",
      "name": "Charles Band"
    }
  ],
  "writer": [
    {
      "id": "nm0023929",
      "name": "Charles Band",
      "description": "story"
    },
    {
      "id": "nm0084535",
      "name": "Shane Bitterling",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm4814079",
      "name": "Kip Canyon",
      "character": "Danny"
    },
    {
      "id": "nm3062739",
      "name": "Jean Louise O'Sullivan",
      "character": "Beth"
    },
    {
      "id": "nm0108355",
      "name": "Oto Brezina",
      "character": "Freuhoffer"
    },
    {
      "id": "nm2389444",
      "name": "Scott King",
      "character": "Moebius       (as Scott Anthony King)"
    },
    {
      "id": "nm1736569",
      "name": "Brad Potts",
      "character": "Sgt. Stone"
    },
    {
      "id": "nm0777993",
      "name": "Kurt Sinclair",
      "character": "Major Collins"
    },
    {
      "id": "nm1102885",
      "name": "Stephanie Sanditz",
      "character": "Uschi /              Bombshell"
    },
    {
      "id": "nm3143506",
      "name": "Paul Thomas Arnold",
      "character": "General Porter"
    },
    {
      "id": "nm3279344",
      "name": "Terumi Shimazu",
      "character": "Ozu"
    },
    {
      "id": "nm1345123",
      "name": "Ian Roberts",
      "character": "SS Soldier #1"
    },
    {
      "id": "nm1114223",
      "name": "Jesse Hlubik",
      "character": "SS Soldier #2"
    },
    {
      "id": "nm5439282",
      "name": "Michael Ulmer",
      "character": "SS Soldier #3"
    },
    {
      "id": "nm4255002",
      "name": "Glenn Zhang",
      "character": "Chinese Man"
    },
    {
      "id": "nm1454299",
      "name": "Ryan Dillon",
      "character": "Man #1       (as Ryan Dillan)"
    },
    {
      "id": "nm2122990",
      "name": "Steven Haworth",
      "character": "Nazi Soldier #1       (as Nigel McGuinness)"
    },
    {
      "id": "nm4570273",
      "name": "Cory Kipp",
      "character": "Nazi Soldier #2"
    },
    {
      "id": "nm2360727",
      "name": "John Anthony Hackert",
      "character": "Photographer       (as John Hackert)"
    },
    {
      "id": "nm3059262",
      "name": "Martin Harris",
      "character": "Nazi Soldier       (voice) (as Martin William Harris)"
    },
    {
      "id": "nm1755733",
      "name": "Max Hermans",
      "character": "Nazi"
    },
    {
      "id": "nm5016880",
      "name": "Samantha Holman",
      "character": "Trenchcoat Bystander"
    },
    {
      "id": "nm3693404",
      "name": "Kenichi Iwabuchi",
      "character": "Kamikaze       (voice)"
    },
    {
      "id": "nm1201647",
      "name": "Danielle Stewart",
      "character": "Leech Woman       (voice)"
    },
    {
      "id": "nm1222899",
      "name": "Mike V. Szuc",
      "character": "Mr. gifford"
    }
  ],
  "overview": "Puppet Master X follows the characters of Danny as he attempts to rescue his girlfriend Beth with the help of Toulon's puppets. However their help is short lived as they end up getting stolen by Ozu (Terumi Shimazu). Danny and Beth must try to rescue the puppets while trying to defend themselves against a new batch of puppets. Meanwhile the occultist Commandant Moebius is attempting to use the serum that animates the puppets to create a master race and take over the world",
  "storyline": "After foiling a plot to blow up an American arms plant, Danny Coogan and his girlfriend, Beth, quickly find that their troubles have just begun. One of Toulon's mysterious Puppets has been kidnapped by the Nazis, and under the wicked, watchful eye of the occultist Commandant Moebius, the Puppets' life-giving serum is synthesized to create a master race of unstoppable soldiers. Moebius plots to assassinate the highly-decorated General Porter to deliver a crippling blow to the American war effort, but his experiments are not ready. A Nazi Scientist uses the serum to create their own superior race of Nazi Puppets in the form of Blitzkrieg, Wehrmacht, Bombshell and Kamikaze! Danny and Beth, teamed with craggy Sergeant Stone and Toulon's Puppets, are no match for Moebius and his war machine. It is up to Blade, Pinhead, Leech Woman and Jester to revive their own secret weapon to stop the Axis Rising!",
  "plot": "Ozu, the villain from the previous film, walks down a dark alley only to be stopped by Kommandant Moebius, the Nazi general. Ozu offers him the puppet Tunneler, in exchange for her freedom. Moebius gladly takes the prize, which immediately kills SS Soldier #1. Moebius \"sets her free\" by shooting her in the head. While this takes place, the puppet Blade watches from the shadows. The next morning, Danny and Beth are recovering at Danny's house. Danny tells the rest of the puppets that he couldn't revive Ninja, but they will get back Tunneler. Blade appears and informs them of Ozu's death and Tunneler's capture by the Nazis. Danny and Beth respond to a knock at the door only to be grabbed by mysterious men in suits. Meanwhile, in a secret lab in Chinatown, Docter Freuhoffer, a German doctor with a fixation on dolls, is working for Moebius to develop a machine that can reanimate the dead. The seductive Uschi, a Nazi, tries to motivate the doctor only to be interrupted by Moebius. He demands a demonstration of the machine. He brings in a Japanese man and slits his throat. The machine makes him walk for a moment only for him to decay and fall down. Freuhoffer promises to fix the machine. Moebius reminds him that if he doesn't, his daughter will be killed. He then presents him with Tunneler to study.\n\nDanny and Beth are revealed to have been taken to a military base. Major Collins commends them for thwarting the bombing of the weapons factory. He also informs Danny that General Porter will be in town and that he will present him with a medal. To protect them, he has Sergeant Stone assigned as their bodyguard. Back at the lab, Moebius and Uschi are discussing the machine and what it will mean for him. A soldier enters and informs him of General Porter's arrival. Back at Beth's house, Stone is settling in and getting on Beth's nerves with his sexist attitude. Back at the lab, Freuhoffer is examining Tunneler when Uschi enters and tries to again seduce him. Moebius enters and in a rage shoots Uschi through the head. Danny, Beth, and Stone eat and discuss how they can help their cause when Danny thinks Stone should be introduced to the puppets. Freuhoffer tries using the fluid he extracted from Tunneler in his machine to revive Uschi but it fails. Danny introduces a dumbfounded Stone to the puppets and tells him that the Nazi's have one of them that needs to be recovered. Freuhoffer shows Moebius his newest creation, Bombshell, a puppet made in Uschi's image with machineguns in her chest. Moebius, while amused, still wants his machine completed.\n\nDanny and the others take Blade and Pinhead to Chinatown to locate the Nazi base. They are ambushed by Bombshell and must retreat. Bombshell returns to the lab and Freuhoffer presents three other puppets Weremacht, a werewolf, Blitzkrieg, a tank, and Kamikaze, a walking bomb. Danny and the others are preparing for the award ceremony when Leech Woman tries to tell them something. During the awards, Freuhoffer's puppets attack, and kill Major Collins. Danny's puppets take them on but are beaten back. Porter, grateful to Danny, allows him to enter the army. Danny and the others ponder how to stop the Nazi puppets when Leech Woman pulls out Six-shooter's head. They locate the lab and take out the Nazi guards. Once inside, they locate and recover Tunneler, but are stopped by Moebius and Freuhoffer's puppets. The puppets fight and this time the Nazi puppets are beaten. Beth holds Freuhoffer at gunpoint, but lets him explain himself. Moebius and Stone fight and just as Stone gets the upperhand, Moebius stabs and kills him. Moebius comes at Danny, but is shot down by Six-shooter. Moebius, still alive, pulls out a gun and plans to shoot Danny, who states \"Never screw with America\". Blade then comes from behind and stabs Moebius. Beth and Freuhoffer come out and tells Kamikaze to detonate, destroying the lab and Moebius. Danny and Beth let Freuhoffer go but as he leaves the others didn't notice he has a bottle of the puppets' fluid.",
  "synopsis": null
}