{
  "imdb_id": "tt2342301",
  "tmdb_id": "114760",
  "douban_id": null,
  "title": "Over My Dead Body (2012)",
  "genres": [
    "Comedy",
    "Crime"
  ],
  "country": "South Korea",
  "version": [
    {
      "runtime": "110 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.1,
  "director": [
    {
      "id": "nm4986697",
      "name": "Seon-ho Wu"
    }
  ],
  "writer": [
    {
      "id": "nm4986697",
      "name": "Seon-ho Wu",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1045934",
      "name": "Beom-su Lee",
      "character": "Baek Hyeon-cheol"
    },
    {
      "id": "nm0753486",
      "name": "Seung-bum Ryoo",
      "character": "Ahn Jin-oh       (as Seung-beom Ryu)"
    },
    {
      "id": "nm1982607",
      "name": "Ok-bin Kim",
      "character": "Han Dong-hwa"
    },
    {
      "id": "nm2944077",
      "name": "Chang-Seok Ko",
      "character": "Seong-goo"
    },
    {
      "id": "nm2359794",
      "name": "Da-in Yoo",
      "character": "Jang Ha-yeon"
    },
    {
      "id": "nm2442113",
      "name": "Jeong-se Oh",
      "character": "Wise governor"
    },
    {
      "id": "nm3362169",
      "name": "Man-sik Jeong",
      "character": "Steve Jeong"
    },
    {
      "id": "nm3083982",
      "name": "Jeong-geun Sin",
      "character": "Team leader Jo"
    },
    {
      "id": "nm1559446",
      "name": "In-gi Jeong",
      "character": "Han Jin-soo"
    },
    {
      "id": "nm4986946",
      "name": "Bae Jeong-nam",
      "character": "Jong-moo"
    },
    {
      "id": "nm3837249",
      "name": "Frank M. Ahearn",
      "character": "Detective Larry David"
    }
  ],
  "overview": "Science researcher Hyun-Chul (Lee Beom-Soo) demonstrates with co-workers against the company president, who stole an important semiconductor chip and is attempting to flee to the United States. Meanwhile, the company president makes his escape from the protesters in an ambulance. During his escape, the executive cuts a wound in his arm and implants the chip there.  While, Hyun-Chul and co-worker Han Jin-Soo (Jeong In-Gi) head for home, Han Jin-Soo is hit by a speeding car. Hyun-Chul thinks it isn't an accident. He contacts Han Jin-Soo's daughter Dong-Hwa (Kim Ok-Vin) and they meet at the police station. After visting her father at the hospital, Dong-Hwa becomes worried about how to pay for her father's hospital bills. On a TV at the hospital, they learn that the company president died from a heart attack. Hyun-Chul and Dong-Hwa then come up with the idea to steal the body of the company president for ransom.",
  "storyline": "Science researcher Hyeon-cheol demonstrates with co-workers against the company president, who stole an important semiconductor chip and is attempting to flee to the United States. Meanwhile, the company president makes his escape from the protesters in an ambulance. During his escape, the executive cuts a wound in his arm and implants the chip there. While, Hyeon-cheol and co-worker Han Jin-soo head for home, Han Jin-Soo is hit by a speeding car. Hyeon-cheol thinks it isn't an accident. He contacts Han Jin-Soo's daughter Dong-Hwa and they meet at the police station. After visiting her father at the hospital, Dong-Hwa becomes worried about how to pay for her father's hospital bills. On a TV at the hospital, they learn that the company president died from a heart attack. Hyeon-cheol and Dong-Hwa then come up with the idea to steal the body of the company president for ransom. Their plan goes somewhat according to plan, but Hyeon-cheol and Dong-Hwa soon realize that they didn't steal a ...",
  "plot": "Baek Hyun-chul (Lee Beom-soo) is a biotech scientist researching the cure for skin cancer. Deciding to shut the lab and sell Hyun-chul's work overseas, the head of the pharmaceutical conglomerate, Kim Taek-soo, sends Steve Jung and his gang to force the lab to shut down and take the research. Hyun-chul's colleague Han Jin-soo protests the decision, and is later involved in a hit-and-run accident and falls into a vegetative state.\n\nTaek-soo is also betrayed and murdered by Steve, little knowing the research is on a microchip planted inside his body. Driven by vengeance, Hyun-chul and Jin-soo's pink-haired daughter Dong-hwa (Kim Ok-bin) plot to steal Taek-soo's body to pay for Jin-soo's hospital bills. However the body they escape from the morgue with isn’t Taek-soo's but that of Ahn Jin-oh (Ryoo Seung-bum), a man who faked his death in order to hide from loan sharks. Believing Taek-soo's body has been stolen, Steve and his gang begin a hunt for Hyun-chul and Dong-hwa to recover the precious microchip.",
  "synopsis": null
}