{
  "imdb_id": "tt2395385",
  "tmdb_id": "176068",
  "douban_id": null,
  "title": "+1 (2013)",
  "genres": [
    "Horror",
    "Sci-Fi",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "96 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.5,
  "director": [
    {
      "id": "nm1531934",
      "name": "Dennis Iliadis"
    }
  ],
  "writer": [
    {
      "id": "nm1531934",
      "name": "Dennis Iliadis",
      "description": "story by"
    },
    {
      "id": "nm1976650",
      "name": "Bill Gullo",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm1973422",
      "name": "Rhys Wakefield",
      "character": "David"
    },
    {
      "id": "nm2383250",
      "name": "Logan Miller",
      "character": "Teddy"
    },
    {
      "id": "nm3358233",
      "name": "Ashley Hinshaw",
      "character": "Jill"
    },
    {
      "id": "nm2834250",
      "name": "Natalie Hall",
      "character": "Melanie"
    },
    {
      "id": "nm5165712",
      "name": "Rohan Kymal",
      "character": "Angad"
    },
    {
      "id": "nm4311436",
      "name": "Adam David Thompson",
      "character": "Kyle"
    },
    {
      "id": "nm4165891",
      "name": "Ronald Ogden",
      "character": "Mike       (as Ron Ogden)"
    },
    {
      "id": "nm3771161",
      "name": "Bernard David Jones",
      "character": "Greg       (as Bernard Jones)"
    },
    {
      "id": "nm1920817",
      "name": "Brad Mills",
      "character": "Ryan"
    },
    {
      "id": "nm1548188",
      "name": "April Billingsley",
      "character": "Brenda"
    },
    {
      "id": "nm3622307",
      "name": "Peter Luis Zimmerman",
      "character": "Steve       (as Peter Zimmerman)"
    },
    {
      "id": "nm3570642",
      "name": "Josh Warren",
      "character": "Stan"
    },
    {
      "id": "nm4123582",
      "name": "Chelsea Hayes",
      "character": "Tracey"
    },
    {
      "id": "nm1797086",
      "name": "Joey Nappo",
      "character": "Keith"
    },
    {
      "id": "nm0539149",
      "name": "Marla Malcolm",
      "character": "Heather"
    },
    {
      "id": "nm0371154",
      "name": "Megan Hayes",
      "character": "Bonnie"
    },
    {
      "id": "nm3168841",
      "name": "Chrissy Chambers",
      "character": "Kitty"
    },
    {
      "id": "nm3849101",
      "name": "Ronke",
      "character": "Katty       (as Ronke Shonibare)"
    },
    {
      "id": "nm5136618",
      "name": "Crystal Lo",
      "character": "Min"
    },
    {
      "id": "nm2874472",
      "name": "Joy Brunson",
      "character": "Lisa"
    },
    {
      "id": "nm3470144",
      "name": "Jonathan Kleitman",
      "character": "Elliot"
    },
    {
      "id": "nm2453033",
      "name": "Hannah Kasulka",
      "character": "Opponent"
    },
    {
      "id": "nm3512708",
      "name": "Max Calder",
      "character": "Jason"
    },
    {
      "id": "nm4587936",
      "name": "Daniel Brule",
      "character": "Andre"
    },
    {
      "id": "nm2468436",
      "name": "Bobby Jordan",
      "character": "Pete"
    },
    {
      "id": "nm2156742",
      "name": "Colleen Dengel",
      "character": "Alison"
    }
  ],
  "overview": "Three college friends go to the biggest party of the year, each looking for something different: love, sex and a simple human connection. When a supernatural phenomenon disrupts the party, it lights a fuse on what will become the strangest night anyone has ever seen. As the three friends struggle to find what they’re looking for, the party quickly descends into a chaos that challenges if they can stay friends or if they can even stay alive.",
  "storyline": "Three college friends hit the biggest party of the year, where a mysterious phenomenon disrupts the night, quickly descending into a chaos that challenges their friendships - and whether they can stay alive.",
  "plot": "In the future, humanity is preparing to launch an attack on the homeworld of an alien race called the Formics who had attacked Earth and killed millions; however, their invasion was stopped by Mazer Rackham, who crashed his F-35 Lightning II into a Formic queen ship, stopping the invasion at the apparent cost of his life. Over the course of fifty years, gifted children are trained by the International Fleet to become commanders of a new fleet for this counter-attack.\n\nCadet Andrew \"Ender\" Wiggin (Asa Butterfield) draws the attention of Colonel Hyrum Graff (Harrison Ford) and Major Gwen Anderson (Viola Davis) by his aptitude in simulated space combat. They order the removal of his monitor, signifying the end of the cadet program. Ender is attacked by Stilson, a student he defeated in the combat sim, but Ender fights back and severely injures him. Ender confesses his grief to his older sister Valentine, but is harassed further by their older brother Peter. Graff arrives to reveal he was being tested and is still part of the program. Graff brings Ender to Battle School, placing Ender with other cadets his age, but treats him as extraordinary, ostracizing him from the others.\n\nAmong other studies, the cadets are placed in squads and perform training games in a zero gravity \"Battle Room\". Ender quickly adapts to the games, devising new strategies older students have not yet seen. Graff reassigns Ender to Salamander Army, led by Commander Bonzo Madrid. Bonzo, believing that Ender is inept due to his size, prevents him from training with the rest of the squad. Another cadet, Petra Arkanian, takes Ender and trains him privately. While Bonzo is aware of this, he does not take any action against Petra. In one match, Bonzo orders Ender to stay behind while the rest of the Salamander Army fights another team; however, seeing Petra in trouble, Ender comes to her aid and helps the Salamander Army win. After the match, Bonzo is humiliated by the other students and threatens Ender if he embarrasses him again.\n\nMeanwhile, Ender plays a computerized \"mind game\" set in a fantasy world aimed to present difficult choices to the player. In one situation, Ender creates an outside the box solution to overcome a seemingly unsolvable problem. Later, he encounters a Formic in the game, and then a simulated image of Valentine entering the ruins of a castle. Inside, he finds another image of Valentine but as he nears, it turns into an image of Peter before the game ends.\n\nGraff promotes Ender to his own squad, made from other students that have gained Ender's trust. They are put in increasingly difficult battles. In one match against two other teams including Bonzo's squad, Ender devises a novel strategy of sacrificing part of his team to achieve a goal, impressing Graff. Bonzo accosts Ender in the bathroom after the match, but Ender fights back and Bonzo falls during the struggle, seriously injured. Distraught over this, Ender prepares to quit Battle School, but Graff has Valentine speak to him and convince him to continue.\n\nGraff takes Ender to humanity's forward base on a former Formic planet near their homeworld. There, Ender meets Mazer Rackham, who explains how he spotted the shared-mind nature of the Formics to stop the attack fifty years prior. Ender finds that his former squad members are also here to help him train in computerized simulations of large fleet combat; Rackham puts special emphasis on the fleet's Molecular Detachment (MD) Device that is capable of disintegrating matter.[note 1] Ender's training is rigorous and Anderson expresses concern they are pushing Ender too fast, but Graff notes they have run out of time to replace Ender.\n\nEnder's final test is monitored by several of the fleet commanders. As the simulation starts, Ender finds his fleet over the Formic homeworld and vastly outnumbered. He orders most of his fleet to sacrifice themselves to protect the MD long enough to fire on the homeworld. The simulation ends, and Ender believes the test is over, but the commanders restart the video screens, showing that the destruction of the Formic homeworld was real and Ender had been controlling the real fleet this time. Despite Graff's assurance he will be known as a hero, Ender is furious as he feels responsible for the annihilation and everyone will remember him as a killer.\n\nAs Ender struggles with his emotions, he recognizes one of the Formic structures nearby similar to the ruined castle from the game, and believing they were trying to communicate with him, races out towards it. He follows the path set by the game, and encounters a dying Formic queen. The Queen acknowledges Ender's role in the genocide of their race, but that he simply wanted peace in the long term and forgives him. The Queen later gives Ender a queen egg that it had been protecting.\n\nAfter the war, Ender is promoted to Admiral, given a small ship, and left to his own devices. In a letter to Valentine, he tells her that he is going into deep space, determined to form a new Formic colony with the queen egg.",
  "synopsis": "While on the phone with his girlfriend Jill (Ashley Hinshaw), who has moved away to attend college, David (Rhys Wakefield) prompts her to explicitly wish that he were there to see her compete in a fencing tournament, only to surprise her with an unplanned visit. After the competition, David approaches Jill's similarly attired opponent (Hannah Kasulka) from behind and flirts with her, thinking she is his girlfriend. Intrigued, she kisses David, and Jill storms off angrily after walking in on them. Later, David meets with his friend and roommate Teddy (Logan Miller), a sex-obsessed student who tells him that Jill will attend a house party later. Hoping that she will speak with him in person, David decides to attend the party, too.At nightfall, David and Teddy drive over to the large house where Angad (Rohan Kymal) is hosting the party in his parents house. Dozens of people are already there, drinking, partying, smoking dope, and other wild things.Meanwhile, a strange meteor lands near the site of the party, and electrical arcs cause a momentary blackout. The wild revelers do not notice brief, anomalous phenomena that occur during the blackout, such as a mirror image out of sync, but a drug dealer's girlfriend outside the party becomes spooked.As the raucous party proceeds, David searches the house for Jill, and Teddy attempts to charm Melanie (Natalie Hall) a very attractive blond student. To Teddy's surprise, Melanie invites him to join her upstairs in ten minutes. Meanwhile, David spies on Jill as she flirts with a friend. Elsewhere, Allison (Colleen Dengel), an outsider, unsuccessfully attempts to fit in. David attempts to apologize to Jill, but she becomes more angry with his fumbled apology and says that he makes her feel replaceable. When a small fire starts caused by a flying tennis ball, the sprinklers put out the fire. So, Angrad moves the party outside, and the house empties except for David, Teddy, Allison, and Melanie.When Teddy joins Melanie upstairs, he finds her naked on a bed. They proceed to have sex, and she steps into the shower afterward. During a second blackout, a duplicate of Melanie appears on the bed, surprised to find Teddy in the room. When the original Melanie exits the shower, the two Melanies come face-to-face, and Teddy flees the room in a panic.David confirms that the house has filled with duplicates of the party-goers, who repeat the actions their originals took ten minutes ago. Outside, the drug dealer Kyle (Adam David Thompson) and his duplicate get into a violent confrontation, and David watches as one of them murders the other. Worried that the duplicates may be hostile, the originals attempt to hide. Eventually, the duplicates disappear when another blackout happens due to the strange supernatural event.With each blackout, the duplicates momentarily reappear and reenact increasingly more recent actions. David becomes convinced that he can save his relationship if he crafts a better apology to Jill's duplicate. At the same time, Allison befriends her duplicate (Suzanne Dengel). Also, Teddy accidentally ruins the rendez-vous between his and Melanie's duplicates.Teddy runs outside and warns the other partygoers that his duplicate will now become belligerent, and he convinces the party-goers, most of whom are still skeptical, to hide from their duplicates in a pool house. When the duplicates reappear, David knocks his own duplicate unconscious and charms Jill's duplicate, and Teddy's duplicate attempts to convince the skeptical crowd of duplicates to attack the originals.Worried about their safety, several of the originals sneak out and murder their duplicates, which turns the enraged duplicates hostile. The originals retreat back to the pool house, and the duplicates lay siege. The next blackout causes the duplicates to appear inside the pool house. The crowded room erupts in violence, and several people die, including Teddy.David tracks down the original Jill, who had wandered back to the house, and he murders her so that he can be with her duplicate. In the meantime, the narcissist Allison seduces her duplicate, and they share a kiss.The final blackout causes the duplicates and originals to merge. David and Jill leave together and make their way to the pool house and have a make-out session. The confused party-goers stagger out of the pool house, and they begin to disperse. In the final shot, two meteors, like the original, are shown passing through the sky and appear to be leaving Earth."
}