{
  "imdb_id": "tt2302583",
  "tmdb_id": "203310",
  "douban_id": null,
  "title": "Dream On (2013)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.1,
  "director": [
    {
      "id": "nm4921517",
      "name": "Lloyd Eyre-Morgan"
    }
  ],
  "writer": [
    {
      "id": "nm4921517",
      "name": "Lloyd Eyre-Morgan",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4921543",
      "name": "Bradley Cross",
      "character": "Paul"
    },
    {
      "id": "nm4920306",
      "name": "Joe Gosling",
      "character": "George"
    },
    {
      "id": "nm1998360",
      "name": "Janet Bamford",
      "character": "Denise"
    },
    {
      "id": "nm4948401",
      "name": "Emily Spowage",
      "character": "Angharad"
    },
    {
      "id": "nm4948460",
      "name": "Matthew Seber",
      "character": "Norman"
    },
    {
      "id": "nm8247275",
      "name": "Marc Cowpland",
      "character": "AA Meeting member"
    },
    {
      "id": "nm4948415",
      "name": "Mark Hill",
      "character": "Larry"
    },
    {
      "id": "nm2886698",
      "name": "Sian Hill",
      "character": "Jean"
    },
    {
      "id": "nm4352693",
      "name": "Haydn Holden",
      "character": "Gethin"
    },
    {
      "id": "nm1445612",
      "name": "Zoe Iqbal",
      "character": "Trish"
    },
    {
      "id": "nm4879160",
      "name": "Nicola Jeanne",
      "character": "April"
    },
    {
      "id": "nm2706332",
      "name": "Derek Lawson",
      "character": "Rehab leader"
    },
    {
      "id": "nm4215495",
      "name": "Michael Ross",
      "character": "Mark"
    },
    {
      "id": "nm4184131",
      "name": "Annie Wallace",
      "character": "Barmaid"
    },
    {
      "id": "nm0916833",
      "name": "Betty Webster",
      "character": "Betty"
    }
  ],
  "overview": "The course of true love does not run smoothly for two young lads in Norman's Cozy Welsh campsite in the mid 80s. Paul, an innocent northerner from Rochdale, meets George, a jack the lad, nervy young man from London. Paul has come on holiday with his domineering mum Denise and her attempts to control him, though comic, throw him further into thrall with George. Both teenagers dream of escape but their dreams go through many ups and downs in the course of Dream On. Based on the play by Lloyd Eyre-Morgan Written by Lloyd",
  "storyline": "The course of true love does not run smoothly for two young lads in Norman's Cozy Welsh campsite in the mid 80s. Paul, an innocent northerner from Rochdale, meets George, a jack the lad, nervy young man from London. Paul has come on holiday with his domineering mum Denise and her attempts to control him, though comic, throw him further into thrall with George. Both teenagers dream of escape but their dreams go through many ups and downs in the course of Dream On. Based on the play by Lloyd Eyre-Morgan",
  "plot": "In a suburban San Fernando Valley garden in Los Angeles, Theo, a.k.a. Turbo, is a garden snail who dreams of being the greatest racer in the world, just like his hero, 5-time Indianapolis 500 champ, Guy Gagné. His obsession with speed and all things fast has made him an outcast in the slow and cautious snail community, and a constant embarrassment to his older brother, Chet. Turbo desperately wishes he could escape the slow-paced life he's living, but his one chance to live proves a near fatal disaster when he tries to recover a prize tomato and needs to be rescued by Chet.\n\nDemoralized, Theo wanders onto a freeway to admire the traffic and wishes he was fast on the first star (which is actually an airplane light). Suddenly, he gets into a freak accident when he gets sucked into the supercharger of a drag racer, fusing his DNA with nitrous oxide. The next day, when Theo wakes up, he now possesses incredible speed and accuracy, as well as some characteristics of an actual car. Unfortunately, Theo's first attempt to show this power off ends with him crashing a Big Wheel tricycle into the garden, getting himself and Chet fired from the garden crew by their foreman.\n\nAs the siblings quarrel over Theo's problems, Chet is snatched by a crow, but is pursued and rescued by Theo at a run down strip mall called Starlight Plaza. There, they are captured by Tito, a \"Dos Bros\" taco truck driver, and are brought to a snail race held by him and his co-workers. Theo astounds both humans and snails alike and earns the respect of the snails, led by Whiplash, with his crew members Smoove Move, Burn, Skidmark, and White Shadow, who have skills of their own. Inspired by this extraordinary snail, Tito dreams to revive the strip mall with Theo as an attraction, and eventually with the help of the snails who manage to divert and strand a tour bus and drum up impressive business. At this success, Theo convinces Tito to enter him in the Indianapolis 500 as a competitor. While Tito's brother, Angelo, still declines to support him, the neighbors agree to put up the entrance fee and accompany them to Indianapolis.\n\nOnce there, Tito is refused entry into the race, but a chance meeting with Guy Gagné gives Turbo a chance to show off his speed, astounding the audience and the racers and qualifies for the race. This impossible feat soon becomes a sensation on social media and the CEO gives in to the pressure, egged on by Gagné himself, to let the snail compete. However, the night before the race, Turbo is demoralized by Gagné, while Chet confesses that he cannot bear to see his brother endanger himself. Undeterred, Turbo enters the race the next day, but the dangerous racetrack and the more experienced competitors leave him trailing in last place. At a pitstop, Whiplash and his crew give Turbo a vital pep talk, advising him to stop racing like a car. Back in the race, Turbo realizes what they mean and uses his small size to his advantage. With the snail rapidly gaining in the standings, Gagné starts racing dirty and manages to knock Turbo against the circuit wall, damaging his shell and weakening his speed powers.\n\nEventually, in the final stretch with Turbo in the lead, Gagné tries a desperate maneuver to beat the snail and gets into a major crash that snares most of the competitors in a major pileup. Similarly, Turbo is thrown, waking up from unconsciousness with his shell punctured and his speed gone. Alarmed at seeing Turbo giving up, Chet puts himself into incredible dangers to meet up with Whiplash's crew to get to the racer. Seeing his brother and the crew arrive on crows to encourage him to continue, Turbo resumes the race. Unfortunately, Gagné, refusing to lose, single-mindedly pursues him by dragging his wrecked car attempt to win. At the last second, Chet tells Turbo to tuck and roll into his shell at Gagné's last blow and the force allows him to tumble past the finish line to win. Gagné is then attacked by Kim-Ly before being disqualified for cheating.\n\nAt this victory, Starlight Plaza becomes a major attraction with all the businesses becoming spectacular successes including extremely elaborate snail races with Whiplash's crew getting special propulsion aids for their shells, while Chet is content with his new job as the track referee and paramedic. As for Turbo, he becomes happier discovering that his shell has healed, and with that, his superspeed has returned.",
  "synopsis": null
}