{
  "imdb_id": "tt2397688",
  "tmdb_id": "346939",
  "douban_id": null,
  "title": "Demon Messenger (2012)",
  "genres": [
    "Horror"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "87 min",
      "description": "DVD"
    }
  ],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm0621173",
      "name": "Ted Nappi"
    }
  ],
  "writer": [
    {
      "id": "nm5275625",
      "name": "D.A. Bush",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm5273612",
      "name": "Mike Arcesi",
      "character": "James Cronus"
    },
    {
      "id": "nm1799037",
      "name": "Kendra Baker",
      "character": "Ruby"
    },
    {
      "id": "nm5274412",
      "name": "Bobby Daglio",
      "character": "Jack"
    },
    {
      "id": "nm5275377",
      "name": "Joe DeMuro",
      "character": "Demon"
    },
    {
      "id": "nm5275133",
      "name": "Serena Deschain",
      "character": "Jade"
    },
    {
      "id": "nm6263551",
      "name": "Andy Horowitz",
      "character": "Owen"
    },
    {
      "id": "nm4830536",
      "name": "Paul Juser",
      "character": "Lucas"
    },
    {
      "id": "nm5273289",
      "name": "Anthony Messersmith",
      "character": "Caleb Cronus"
    },
    {
      "id": "nm5274976",
      "name": "Brian Nayor",
      "character": "Zack"
    },
    {
      "id": "nm1331013",
      "name": "Chris Nickerson",
      "character": "Tom"
    },
    {
      "id": "nm5273386",
      "name": "Heather Tinker",
      "character": "Kira Cronus"
    }
  ],
  "overview": "As the battle for natural gas rights in the Marcellus shale formation rages, a farming family in the Adirondack foothills is torn apart by the battle between a cash windfall and the threat of ecological disaster from hydrofracking. In an act of desperation the American Indian legend of The Demon Messenger is called out to protect the forest. The Demon Messenger is the monster in the woods known by many names: the Rugaru, Chiye-tanka, Wendigo, but it is best known throughout the world as Bigfoot. Will the Messenger be the avenging angel they hoped for or an unimaginable evil unleashed?",
  "storyline": "Demon Messenger is the tale of a farm family that has been torn apart by the lure of big money from the natural gas that lies in the Marcellus shale formation beneath their property. Most of the family members want to sell the land and cash out, but one is a member of an anti-fracking organization and is trying to preserve their land from the dangers of hydrofracking. In an act of desperation the American Indian Legend of the Demon Messenger is called out to protect the land.",
  "plot": "Chizuru Yukimura heads to Kyoto to search for her father, finding herself attacked by mad men before they are cut down by members of the Shinsengumi who take her into custody for interrogation. Upon learning that she is a girl and the daughter of a doctor who developed the Water of Life elixir that turns those that drink it into invincible blood lusting berserkers called Rasetsu (羅刹?, \"Furies\" in English dub), the Shinsengumi decide to keep her as an aide in their search. In time, as the Shinsengumi aid the shogunate in the Bakufu, Chizuru begins to develop a bond with the Shinsengumi and its aloof member Toshizo Hijikata. However, as time passes, Chizuru and Shinsengumi confront a mysterious faction who call themselves Oni (Devils) and that Chizuru is also an Oni with father revealed to be experimenting on the Water of Life to create the Rasetsu to wipe out the human race.",
  "synopsis": null
}