{
  "imdb_id": "tt2370140",
  "tmdb_id": "137285",
  "douban_id": null,
  "title": "Crossfire Hurricane (2012)",
  "genres": [
    "Documentary",
    "Biography",
    "Music"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "111 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.4,
  "director": [
    {
      "id": "nm0605137",
      "name": "Brett Morgen"
    }
  ],
  "writer": [
    {
      "id": "nm0605137",
      "name": "Brett Morgen",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0001396",
      "name": "Mick Jagger",
      "character": "Himself       (voice)"
    },
    {
      "id": "nm0915115",
      "name": "Charlie Watts",
      "character": "Himself       (voice)"
    },
    {
      "id": "nm0943827",
      "name": "Bill Wyman",
      "character": "Himself       (voice)"
    },
    {
      "id": "nm0939976",
      "name": "Ronnie Wood",
      "character": "Himself       (voice)"
    },
    {
      "id": "nm0852909",
      "name": "Mick Taylor",
      "character": "Himself       (voice)"
    },
    {
      "id": "nm0724189",
      "name": "Keith Richards",
      "character": "Himself       (voice)"
    },
    {
      "id": "nm0427627",
      "name": "Brian Jones",
      "character": "Himself       (archive footage)"
    },
    {
      "id": "nm0646141",
      "name": "Andrew Loog Oldham",
      "character": "Himself       (archive footage)"
    },
    {
      "id": "nm0147118",
      "name": "Dick Cavett",
      "character": "Himself       (archive footage)"
    }
  ],
  "overview": "This film is released as part of the ongoing 50th anniversary celebration of the Rolling Stones. It tells the story of the Stones' unparalleled journey from blues obsessed teens in the early 60s to their undisputed status as rock royalty. All of the Stones have been newly interviewed and their words form the narrative arc that links together archive footage of performances, news coverage, and interviews, much of it previously unseen. Taking its title from a lyric in \"Jumpin' Jack Flash,\" this film gives the viewer an intimate insight into exactly what it's like to be part of the Rolling Stones as they overcome denunciation, drugs, dissensions, and death to become the definitive survivors. Over a year in the making and produced with the full cooperation and involvement of the Stones, this film is and will remain the definitive story of the world's greatest rock 'n' roll band",
  "storyline": "A mostly chronological look at the Rolling Stones with archive footage and recent off-camera commentary by Jagger, Richards, Watts, Wyman, Taylor, and Wood. Topics include virtually instant success (and fans' dangerous antics), becoming songwriters, press coverage as the anti-Beatles, Richards and Jagger's drug arrest and trial, Brian Jones' decline and death, fleeing the tax man to the south of France, a U.S. tour and the Altamont disaster, trading the bad boys image for being fun onstage when Wood replaces Taylor,and Richards kicking smack: \"The band comes first.\" The six also talk about what makes them a great rock and roll band.",
  "plot": "On their 50th anniversary, the Rolling Stones, with the support of archive footage and interviewed by director Brett Morgen, retrace the first 20 years of their career. The film discusses their early success in the sixties; the way the media characterised the difference between them and the Beatles; the exceptional musical talent of Brian Jones; their first song-writing; the difference between the boy fans' aggressiveness that resulted in fights with the police and the girl fans' screaming hysteria; Mick Jagger and Keith Richards drug use and their arrest; the musical contribution of Brian Jones that was waning due to excessive use of drugs, and his death a few weeks after the separation from the band; Mick Taylor's debut concert in Hyde Park in memory of Jones and the return to world tours; the awful organization of the Altamont Free Concert; their flight to tax exile in 1971; the recording of Exile on Main St. in a villa on the south of France; Mick Taylor's departure and the arrival of Ronnie Wood; and the arrest of Keith Richards in Canada for possession of heroin and his decision to detox, to safeguard the future of the band.",
  "synopsis": null
}