{
  "imdb_id": "tt2301059",
  "tmdb_id": "179089",
  "douban_id": null,
  "title": "Petaru dansu (2013)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "Japan",
  "version": [],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm1491595",
      "name": "Hiroshi Ishikawa"
    }
  ],
  "writer": [
    {
      "id": "nm1491595",
      "name": "Hiroshi Ishikawa",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0594497",
      "name": "Aoi Miyazaki",
      "character": "Jinko"
    },
    {
      "id": "nm3101617",
      "name": "Shioli Kutsuna",
      "character": "Haraki       (as Shiori Kutsuna)"
    },
    {
      "id": "nm2747232",
      "name": "Sakura Andô",
      "character": "Motoko"
    },
    {
      "id": "nm0297954",
      "name": "Kazue Fukiishi",
      "character": "Miki"
    },
    {
      "id": "nm0027942",
      "name": "Masanobu Andô",
      "character": "Naoto"
    },
    {
      "id": "nm2833503",
      "name": "Mariko Gotô",
      "character": ""
    },
    {
      "id": "nm1165029",
      "name": "Hanae Kan",
      "character": ""
    },
    {
      "id": "nm0443562",
      "name": "Shunsuke Kazama",
      "character": ""
    },
    {
      "id": "nm4733492",
      "name": "Masumi Nomura",
      "character": ""
    },
    {
      "id": "nm3050429",
      "name": "Tsutomu Takahashi",
      "character": ""
    }
  ],
  "overview": "Four women, who have their own different sorrows, embark on a road trip. They look back at their past and restart their lives... Jinko (Aoi Miyazaki) and Motoko (Sakura Ando) have been friends since their university days. One day, they hear a rumor about their former classmate and friend Miki (Kazue Fukiishi). The rumor is that Miki ran into the sea, but got out safely. Jinko and Motoko decide to visit Miki to see if she is OK. In addition, Haraki (Shiori Kutsuna), who Jinko met at the library where she works, joins their trip as a driver. Their one night and two days road trip begins.",
  "storyline": "Three women, who are new and old friends, borrow a car in order to drive to meet and pick up another friend. They share a car, a road trip, feelings and experiences as they come to grips with their lives, relationships, illnesses and nature. Standing on the beach and facing the cold wind they ask implicit questions.",
  "plot": null,
  "synopsis": "Four women, who have their own different sorrows, embark on a road trip. They look back at their past and restart their lives ...\nJinko (Aoi Miyazaki) and Motoko (Sakura Ando) have been friends since their university days. One day, they hear a rumor about their former classmate and friend Miki (Kazue Fukiishi). The rumor is that Miki ran into the sea, but got out safely. Jinko and Motoko decide to visit Miki to see if she is OK.\nIn addition, Haraki (Shiori Kutsuna), who Jinko met at the library where she works, joins their trip as a driver.\nTheir one night and two days road trip begins."
}