{
  "imdb_id": "tt2355775",
  "tmdb_id": "106166",
  "douban_id": null,
  "title": "Paradise or Oblivion (2012)",
  "genres": [
    "Documentary",
    "Short"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "45 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.3,
  "director": [
    {
      "id": "nm2399888",
      "name": "Roxanne Meadows"
    }
  ],
  "writer": [
    {
      "id": "nm0294347",
      "name": "Jacque Fresco",
      "description": null
    },
    {
      "id": "nm2399888",
      "name": "Roxanne Meadows",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0294347",
      "name": "Jacque Fresco",
      "character": "Himself"
    },
    {
      "id": "nm2399888",
      "name": "Roxanne Meadows",
      "character": "Herself"
    }
  ],
  "overview": "Paradise or Oblivion is a free online documentary produced by the Venus Project.  This documentary details the root causes of the systemic value disorders and detrimental symptoms caused by our current established system.  The film advocates a new socio-economic system, which is updated to present-day knowledge, featuring the life-long work of Social Engineer, Futurist, Inventor and Industrial Designer Jacques Fresco, which he calls a Resource-Based Economy.  Paradise or Oblivion by the Venus Project introduces the viewer to a more appropriate value system that would be required to enable this caring and holistic approach to hhuman civilisation.  This alternative surpasses the need for a monetary-based, controlled scarcity environment we find ourselves in today.",
  "storyline": "Featuring the life-long work of Social Engineer, Futurist, Inventor and Industrial Designer Jacque Fresco, this presentation advocates a new socio-economic system that is updated to present-day knowledge, which he calls a Resource-Based Economy. This documentary details the root causes of the systemic value disorders and detrimental symptoms caused by our current established system. It also details the need to outgrow today's dated and inefficient methods of politics, law, business, or any other \"establishment\" notions of human affairs, and to instead use the methods of science, combined with high technology, to provide for the needs of all the world's people. It is not based on the opinions of the political and financial elite or on illusionary so-called democracies, but on maintaining a dynamic equilibrium with the planet that could ultimately provide abundance for all people. Paradise or Oblivion, by The Venus Project, introduces the viewer to a more appropriate value system ...",
  "plot": null,
  "synopsis": "Paradise or Oblivion is a documentary that details the root causes of the systemic value disorders and detrimental symptoms caused by our current established system. This video presentation advocates a new socio-economic system, which is updated to present-day knowledge, featuring the life-long work of Social Engineer, Futurist, Inventor and Industrial Designer Jacque Fresco, which he calls a Resource-Based Economy.The film details the need to outgrow the dated and inefficient methods of politics, law, business, or any other \"establishment\" notions of human affairs, and use the methods of science, combined with high technology, to provide for the needs of all the world's people. It is not based on the opinions of the political and financial elite or on illusionary so-called democracies, but on maintaining a dynamic equilibrium with the planet that could ultimately provide abundance for all people.Paradise or Oblivion, by The Venus Project, introduces the viewer to a more appropriate value system that would be required to enable this caring and holistic approach to benefit human civilization. This alternative surpasses the need for a monetary-based, controlled, and scarcity-oriented environment, which we find ourselves in today.*This is NOT the \"major motion picture\" that The Venus Project is working towards but rather is a 48 minute documentary to introduce the aims and proposals to new people."
}