{
  "imdb_id": "tt2309961",
  "tmdb_id": "210947",
  "douban_id": "24877502",
  "title": "Afflicted (2013)",
  "genres": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.3,
  "director": [
    {
      "id": "nm1854114",
      "name": "Derek Lee"
    },
    {
      "id": "nm1429317",
      "name": "Clif Prowse"
    }
  ],
  "writer": [
    {
      "id": "nm1854114",
      "name": "Derek Lee",
      "description": "screenplay"
    },
    {
      "id": "nm1429317",
      "name": "Clif Prowse",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm1854114",
      "name": "Derek Lee",
      "character": "Derek"
    },
    {
      "id": "nm1429317",
      "name": "Clif Prowse",
      "character": "Clif"
    },
    {
      "id": "nm6411675",
      "name": "Michael Gill",
      "character": "Michael Gill"
    },
    {
      "id": "nm4151199",
      "name": "Baya Rehaz",
      "character": "Audrey"
    },
    {
      "id": "nm1156789",
      "name": "Benjamin Zeitoun",
      "character": "Maurice"
    },
    {
      "id": "nm6411676",
      "name": "Zach Gray",
      "character": "Zachary Gray"
    },
    {
      "id": "nm6386901",
      "name": "Jason Lee",
      "character": "Jason"
    },
    {
      "id": "nm4304883",
      "name": "Edo Van Breemen",
      "character": "Edo Van Breeman"
    },
    {
      "id": "nm6386902",
      "name": "Gary Redekop",
      "character": "Dr. Redekop"
    },
    {
      "id": "nm6386903",
      "name": "Lily Py Lee",
      "character": "Derek's Mom"
    },
    {
      "id": "nm3494133",
      "name": "Ellen Ferguson",
      "character": "Club Girl"
    },
    {
      "id": "nm6386905",
      "name": "Chiara Caggiati",
      "character": "Waitress"
    },
    {
      "id": "nm6386906",
      "name": "Domenico Di Michele",
      "character": "Restaurant Guest"
    },
    {
      "id": "nm6386907",
      "name": "Susie Barrow",
      "character": "Restaurant Guest"
    },
    {
      "id": "nm6386908",
      "name": "Lise Bertram",
      "character": "Restaurant Guest"
    },
    {
      "id": "nm6386909",
      "name": "Agostino Roncallo",
      "character": "Restaurant Guest"
    },
    {
      "id": "nm6386911",
      "name": "Bartolo Lecari",
      "character": "Vintner"
    },
    {
      "id": "nm6386912",
      "name": "Lucia De Pace",
      "character": "Paramedic"
    },
    {
      "id": "nm1980712",
      "name": "Andrew Ferguson",
      "character": "Ambulance Victim"
    },
    {
      "id": "nm6386913",
      "name": "Paolo Basso",
      "character": "Inspector Barbiero"
    },
    {
      "id": "nm1989546",
      "name": "Greg Ng",
      "character": "Disgruntled Tourist"
    },
    {
      "id": "nm6414714",
      "name": "Julie Basso",
      "character": "Restaurant Guest"
    },
    {
      "id": "nm6386915",
      "name": "Patrick Effiboley",
      "character": "Hotel Clerk"
    },
    {
      "id": "nm3239018",
      "name": "Graham Fortin",
      "character": "French Police Officer"
    },
    {
      "id": "nm2271939",
      "name": "Brian Kavanaugh-Jones",
      "character": "French Police Officer"
    },
    {
      "id": "nm2400280",
      "name": "Jesse Savath",
      "character": "French Police Officer"
    },
    {
      "id": "nm3170650",
      "name": "Ernek Reder",
      "character": "French Police Officer"
    },
    {
      "id": "nm1122584",
      "name": "Stéphane Julien",
      "character": "Cop on Roof"
    },
    {
      "id": "nm6386916",
      "name": "Hjortur Helgason",
      "character": "French Tactical Officer"
    },
    {
      "id": "nm5527386",
      "name": "Zack Mosley",
      "character": "French Tactical Officer"
    },
    {
      "id": "nm3619184",
      "name": "Asterios Moutsokapas",
      "character": "French Tactical Officer"
    },
    {
      "id": "nm2366871",
      "name": "Adrian Buitenhuis",
      "character": "French Tactical Officer"
    },
    {
      "id": "nm5758063",
      "name": "Jeremy Muir",
      "character": "French Tactical Officer"
    },
    {
      "id": "nm6386917",
      "name": "Alexander Ferguson",
      "character": "Pedophile"
    },
    {
      "id": "nm6386918",
      "name": "Ian Hanlin",
      "character": "Jeff"
    },
    {
      "id": "nm4576712",
      "name": "Doreen Gordon",
      "character": "Chiara"
    },
    {
      "id": "nm6386920",
      "name": "Camilla De Cesare",
      "character": "Dina"
    },
    {
      "id": "nm6386922",
      "name": "Jen Guiterrez",
      "character": "Jen"
    },
    {
      "id": "nm3730968",
      "name": "Ulysse de Gregorio",
      "character": "Junkie       (as Ulyssie Di Gregorio)"
    },
    {
      "id": "nm5294636",
      "name": "Tasya Teles",
      "character": "Maria"
    },
    {
      "id": "nm0747385",
      "name": "Sharlene Royer",
      "character": "Receptionist"
    },
    {
      "id": "nm5077067",
      "name": "Mike Chochand",
      "character": "Beast Double"
    }
  ],
  "overview": "Two friends' tour of Europe takes a dark turn when one of them contracts a mysterious illness. They race to find out what it is and how to cure it before the sickness consumes him completely.",
  "storyline": "Best friends Derek and Clif set out on a trip of lifetime. Their plan: travel to the ends of the earth, see the world, and live life to the fullest. But the trip soon takes a dark and bloody turn. Just days in, one of the men shows signs of a mysterious affliction which gradually takes over his entire body and being. Now, thousands of miles from home, in a foreign land, they must race to uncover the source before it consumes him completely. Footage meant to be travel memories may now become evidence of one of the most shocking discoveries ever captured on film...and perhaps will be their only postcard home.",
  "plot": "Childhood friends Clif Prowse and Derek Lee have decided to venture all over the world to film their travel web series “Ends of the Earth”. Derek is making the trip in spite of his doctor's advice, as he has an AVM, which could cause his death at any moment.\n\nClif and Derek stop at Paris to meet with old friends currently on tour for their band. After their initially uneventful stay, Derek picks up a girl by the name of Audrey after telling her about his AVM. Later that night, Clif bursts into Derek's hotel room as a prank only to discover a bleeding and scratched Derek and no sign of Audrey. Derek insists he doesn't remember anything and they should continue on to their trip.\n\nUpon getting to Italy, Derek passes out and sleeps for an entire day. Clif awakens him the next afternoon for lunch, in which Derek shows an aversion to sunlight. Upon getting to the restaurant, Derek hungrily devours his pasta dish before projectile vomiting it out and stumbling back home. Later, at a vineyard, Derek has an extreme reaction to sunlight and is forced to flee inside covered in burns. Back at the hotel room, Clif attempts to calm Derek down, only for Derek to explosively punch clean through the corner of a stone wall with his bare hands.\n\nOver the next few days, Derek displays heightened strength, speed and agility. Clif attempts to persuade Derek to stop their trip and come home, but Derek continues to insist that there is nothing wrong with him. As Derek grows sicker due to not eating, he agrees to go to a hospital. On the way, they were almost hit by a car, and after a brief fight in which Derek completely overpowers the driver and passenger, he licks their blood off his hand.\n\nClif successfully deduces that Derek contracted vampirism, but researching online proves futile to fix Derek's constantly deteriorating state. Derek first tries drinking blood obtained from a butcher, and then kills and drains a man's pet piglet, only to vomit out the blood on both occasions. Derek and Clif attempt to rob an ambulance, which proves unsuccessful, and have to retreat back to the hotel. Derek enters a catatonic state, and Clif decides to slit his own wrist to give Derek some of his blood. After successfully draining some of his blood, Clif discovers Derek is gone. He attempts to find him, only to be ambushed and killed by the completely inhuman Derek. Upon regaining his senses thanks to human blood, Derek shoots himself in the head with a shotgun. Shortly after, however, Derek's head heals with only slight scarring, and he is faced with the fact that he is unable to be killed.\n\nSoon after, Interpol agents attempt to take Derek into custody, forcing him to escape in broad daylight, carrying only Clif's camera bag. He manages to get back to France and hides in an abandoned warehouse in Paris. Reviewing the footage of his meeting with Audrey, he realizes that her cell phone might be at the hotel where she bit him. After retrieving the cell phone, Derek texts every one of the numbers on the contact list to come find him. Eventually a man shows up, and Derek tails and kidnaps him. He then sets up a live-stream event to draw Audrey in, but his hideout is stormed by the French Riot Police (CRS) and Derek is shot to near-death before entering a frenzy state. After slaughtering the police, Derek escapes once again.\n\nAudrey finally meets Derek in an abandoned building, where she apologizes for accidentally making him a vampire, and tells him that there is no cure for his condition. Derek lashes out at her and the two briefly fight, but Derek is easily overpowered. Audrey urges him to feed every five days, lest he become inhuman again and begin killing indiscriminately. Audrey instructs him to choose whom he kills, and explains that she chose him because he was dying.\n\nLater, Derek posts his final entry online, in which he explains that he can never contact his family again, before killing and feeding from a child molester.\n\nIn a mid-credits scene, a teenage boy and two teenage girls are seen sneaking into a swimming pool, only to be attacked. The boy gets away, and with his camera running, finds the bloodied corpse of one of the girls before Clif, now fully changed into vampiric form, appears and attacks him.",
  "synopsis": null
}