{
  "imdb_id": "tt2344678",
  "tmdb_id": "180680",
  "douban_id": null,
  "title": "Himmatwala (2013)",
  "genres": [
    "Action",
    "Comedy"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "150 min",
      "description": ""
    }
  ],
  "imdb_rating": 1.7,
  "director": [
    {
      "id": "nm1349318",
      "name": "Sajid Khan"
    }
  ],
  "writer": [
    {
      "id": "nm0706484",
      "name": "K. Raghavendra Rao",
      "description": "original story"
    },
    {
      "id": "nm1349318",
      "name": "Sajid Khan",
      "description": "story"
    },
    {
      "id": "nm1349318",
      "name": "Sajid Khan",
      "description": "screenplay &"
    },
    {
      "id": "nm2260872",
      "name": "Farhad Samji",
      "description": "screenplay as Farhad &"
    },
    {
      "id": "nm2678319",
      "name": "Sajid",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0222426",
      "name": "Ajay Devgn",
      "character": "Ravi"
    },
    {
      "id": "nm1961459",
      "name": "Tamannaah Bhatia",
      "character": "Rekha"
    },
    {
      "id": "nm0712546",
      "name": "Paresh Rawal",
      "character": "Narayan Das"
    },
    {
      "id": "nm0542498",
      "name": "Mahesh Manjrekar",
      "character": "Sher Singh"
    },
    {
      "id": "nm0906226",
      "name": "Zarina Wahab",
      "character": "Savitri"
    },
    {
      "id": "nm3057159",
      "name": "Adhyayan Suman",
      "character": "Shakti"
    },
    {
      "id": "nm4857275",
      "name": "Leena Jumani",
      "character": "Padma"
    },
    {
      "id": "nm2147526",
      "name": "Asrani",
      "character": "Banwari T.C."
    },
    {
      "id": "nm0223521",
      "name": "Anil Dhawan",
      "character": "Dharamurthy"
    },
    {
      "id": "nm0348490",
      "name": "Rajendra Gupta",
      "character": "Iqbal Chacha"
    },
    {
      "id": "nm2738083",
      "name": "Vindu Dara Singh",
      "character": "Gopi"
    },
    {
      "id": "nm0659233",
      "name": "Chunky Pandey",
      "character": "Michael Jai Kishen"
    },
    {
      "id": "nm3809107",
      "name": "Roy Bronsgeest",
      "character": "City Fighters in Village"
    },
    {
      "id": "nm4015689",
      "name": "Surveen Chawla",
      "character": "Punjabi Girl (Dhoka Song)"
    },
    {
      "id": "nm1299011",
      "name": "Riteish Deshmukh",
      "character": "Ravi"
    },
    {
      "id": "nm1514301",
      "name": "Rinku Ghosh",
      "character": "Bhojpuri Girl (Dhoka Song)"
    },
    {
      "id": "nm3035081",
      "name": "Amruta Khanvilkar",
      "character": "Maharashtrian Girl (Dhoka Song)"
    },
    {
      "id": "nm3848064",
      "name": "Sonakshi Sinha",
      "character": "Dancer"
    },
    {
      "id": "nm5433303",
      "name": "Dheer Charan Srivastav",
      "character": "Villager"
    },
    {
      "id": "nm2018566",
      "name": "Mona Thiba",
      "character": "Gujrati Girl (Dhoka Song)"
    }
  ],
  "overview": "An honest temple priest takes on more than he can handle when he bears witness to a murder and gives evidence in a court of law against a powerful landlord in his village. The landlord bribes his way to freedom and engineers a ploy to ruin the priests reputation and his status among his peers in the village. Ashamed of his tarnished reputation the priest commits suicide,and leaves his wife and young children to face the atrocities of the evil landlord. The son flees the village and travels to Mumbai to make a life, but returns years later to avenge the shame caused to his family.",
  "storyline": "An honest temple priest takes on more than he can handle when he bears witness to a murder and gives evidence in a court of law against a powerful landlord in his village. The landlord bribes his way to freedom and engineers a ploy to ruin the priests reputation and his status among his peers in the village. Ashamed of his tarnished reputation the priest commits suicide,and leaves his wife and young children to face the atrocities of the evil landlord. The son flees the village and travels to Mumbai to make a life, but returns years later to avenge the shame caused to his family. Thi",
  "plot": "Set in 1983, the story begins with Ravi (Ajay Devgan) winning a fighting competition at a club. He is known as 'Himmatwala' (courageous man). He then goes to Ramnagar village, where he meets his mother, Savitri, and his younger sister, Padma, who are living a miserable life.\n\nRavi's mother tells him that his father was an honest and respected man, and he was the priest of the temple. His father was framed by Sher Singh, the tyrant zamindar (landlord), for robbing the temple since the latter saw him commit a murder. Disgusted, Ravi's father committed suicide. In revenge, young Ravi tried to kill Sher Singh, but failed. When Ravi's house is burnt, Savitri tells him to run away as Sher Singh will kill him.\n\nWith revenge in his mind, Ravi beats up Narayan Das, Singh's manager and brother-in-law, as well as threatening Sher Singh. The next day, he publicly humiliates Sher Singh's daughter, Rekha because she was beating up her innocent driver. In response, Rekha (Tamannaah Bhatia) unleashes a tiger on the village in front of Ravi. Her plan was unsuccessful, however, as it backfired. Rekha falls down from the terrace and is about to be attacked by the animal, when Ravi jumps and saves her life. Rekha falls in love with Ravi, and afterwards, saves Ravi's life against her father's plans.\n\nOn the other hand, Ravi comes to know that Padma is in love with Shakti, Narayan Das's son. He has his objections and so has Narayan. However, Sher Singh tells Narayan Das that marrying Shakti with Padma would give them an upper hand over Ravi as they can ill-treat Padma and keep Ravi in control. Meanwhile, Padma now knows that Ravi is not her real brother, and the real Ravi died in a road accident. Before dying, the real Ravi asked him to take care of his family. Padma is initially upset, but then reconciles after Ravi saves her life.\n\nShortly after Padma and Shakti get married, both the father and son start ill-treating Padma. In revenge, Ravi uses Rekha against her own father, just like what she advises him. After Rekha tells her father that she is pregnant with Ravi, Sher Singh begs Ravi to marry his daughter. Eventually, Ravi punished Narayan Das and Shakti by doing all the household chores. He also wins the Sarpanch election, and Sher Singh finally gives all the property documents back to the villagers, which Sher Singh had illegally taken from them before.\n\nHowever, Shakti overhears Rekha and Ravi's conversation about the fake pregnancy and that he is not the real Ravi. Angered, Sher Singh tries to kill him by bringing 20 fighters from the city, but failed. While they are beating Ravi, the tiger (which Ravi had fought with) comes and saves his life. Ravi then brutally beats Shakti, and is about to kill Sher Singh when his mother stops him.\n\nIn the end, Sher Singh, Narayan Das and Shakti ask for the forgiveness from Ravi, Savitri and the rest of the villagers.",
  "synopsis": null
}