{
  "imdb_id": "tt2316763",
  "tmdb_id": "293458",
  "douban_id": null,
  "title": "Song (2014)",
  "genres": [
    "Documentary",
    "Biography",
    "Drama",
    "History",
    "Music"
  ],
  "country": "Finland",
  "version": [
    {
      "runtime": "82 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.9,
  "director": [
    {
      "id": "nm1437990",
      "name": "Selma Vilhunen"
    }
  ],
  "writer": [
    {
      "id": "nm1437990",
      "name": "Selma Vilhunen",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm2746395",
      "name": "Jussi Huovinen",
      "character": "Himself"
    },
    {
      "id": "nm3907321",
      "name": "Hanneriina Moisseinen",
      "character": "Herself"
    },
    {
      "id": "nm6221458",
      "name": "Sólveig Thoroddsen",
      "character": "Herself"
    },
    {
      "id": "nm7050602",
      "name": "Reetta-Kaisa Iles",
      "character": "Herself"
    },
    {
      "id": "nm7050603",
      "name": "Anne-Mari Kivimäki",
      "character": "Herself"
    },
    {
      "id": "nm7050604",
      "name": "Tommi Musturi",
      "character": "Himself"
    },
    {
      "id": "nm7050605",
      "name": "Eija Margareta Pääkkö",
      "character": "Herself"
    },
    {
      "id": "nm0631173",
      "name": "Markku Nieminen",
      "character": "Himself"
    },
    {
      "id": "nm3901068",
      "name": "Pekko Käppi",
      "character": "Himself"
    },
    {
      "id": "nm7050606",
      "name": "Rauno Nieminen",
      "character": "Himself"
    },
    {
      "id": "nm7050607",
      "name": "Salla Seppä",
      "character": "Herself"
    },
    {
      "id": "nm2745456",
      "name": "Ilkka Heinonen",
      "character": "Himself"
    },
    {
      "id": "nm1032965",
      "name": "Paula Susitaival",
      "character": "Herself"
    },
    {
      "id": "nm7050608",
      "name": "Sanne Tschirpke",
      "character": "Herself"
    },
    {
      "id": "nm7050609",
      "name": "Aura Dufva",
      "character": "Herself"
    },
    {
      "id": "nm3494075",
      "name": "Sirkku Peltola",
      "character": "Herself"
    },
    {
      "id": "nm1725362",
      "name": "Marjo Kuusela",
      "character": "Herself"
    },
    {
      "id": "nm2917299",
      "name": "Ville Rauhala",
      "character": "Himself"
    },
    {
      "id": "nm0359867",
      "name": "Pauli Hanhiniemi",
      "character": "Himself"
    },
    {
      "id": "nm7050610",
      "name": "Samuli Volanto",
      "character": "Himself"
    },
    {
      "id": "nm6108865",
      "name": "Timo Saari",
      "character": "Himself"
    },
    {
      "id": "nm7050611",
      "name": "Hanna Koikkalainen",
      "character": "Herself"
    },
    {
      "id": "nm7050612",
      "name": "Miihkali Stepanov",
      "character": "Himself"
    }
  ],
  "overview": "Song is a story of the last Finnish rune singer and his pupil, and the comforting power of singing.",
  "storyline": "'Song' is a story of the last Finnish rune singer and his pupil, and the comforting power of singing. Jussi Huovinen, 89, is the only inhabitant of his remote home village in northern Finland, right next to the Russian border. He is the last living person in Finland who has learned the ancient Kalevala style rune songs from his mother and father. Hanneriina Moisseinen, 35, is a visual artist who wants to learn his songs and to understand their hidden wisdom. 'Song' follows Hanneriina and Jussi for three years, during which both of them are confronted with their deepest sorrows.",
  "plot": "Conor, a lighthouse keeper, lives on an island with son Ben, his pregnant wife Bronagh, and sheepdog Cú. Bronagh disappears late one night, presumably dying after childbirth, leaving behind daughter Saoirse.\n\nSix years later, Conor is broken, Saoirse is mute, and Ben is antagonistic towards Saoirse, blaming her for Bronagh's disappearance. On her birthday, she is visited by Granny, the grandmother. That night, Ben scares Saoirse with a story of Mac Lir and his mother Macha, the Owl Witch, who stole his feelings and turned him to stone. Later, Saoirse plays a seashell horn given to Ben by their mother, leading her to a white sealskin coat in Conor's closet. She wears the coat and walks to a group of seals in the sea, revealing her as a selkie. After swimming, she is found by Granny, who insists upon taking the children to the city. Conor reluctantly agrees despite Ben's protests, and locks the coat in a chest, throwing it into the sea.\n\nOn Halloween, Saoirse plays the shell, alerting Færie to her. Ben and her attempt to go home, but encounter the Færie, hopeful that Saoirse will allow them to go to Tír na nÓg. However, they are attacked by Macha's owls, turning the Færie to stone. They take a country bus, where they run into Cú, who had followed them. However, Saoirse is growing ill. They come across a sacred well that Saoirse falls into. Ben follows and meets the Great Seanachaí: They learn that she was kidnapped by Macha, and that she is mute because she needs the coat otherwise she will die. He gives Ben one of his hairs that will lead him to Macha, showing that Bronagh - a selkie herself - returned to the ocean, remorsefully watching.\n\nBen then meets Macha, who claims that when Mac Lir suffered from a broken heart, she turned him into an island near their home. Ben manages to rescue Saoirse, giving Macha her feelings, recognizing that taking away feelings doesn't help. She helps them fly them back home, and Conor attempts to take Saoirse to a hospital; simultaneously, Granny is near the island to find them. Ben dives into the sea in search of Saoirse's coat, and recovers it with the seals and Conor. The group is then washed up on Mac Lir's island, where Saoirse is fully healthy and sings the song of the sea. Færie rise and travel to Mac Lir and he emerges with Macha and his dogs as they head to Tír na nÓg.\n\nBronagh appears preparing to depart with Saoirse, but Ben pleads to let her stay with them. Since she is half-human, the choice rests with Saoirse, who elects to remain behind with her father and brother. Bronagh takes her coat and departs. After a tearful goodbye, the Faeries depart across the sea, and Ben and his family happily return home to their island, where Granny finally arrives, and decides the children can stay with their father. Ben and Saoirse reconcile and become friends.",
  "synopsis": null
}