{
  "imdb_id": "tt2388637",
  "tmdb_id": "152748",
  "douban_id": null,
  "title": "Ain't Them Bodies Saints (2013)",
  "genres": [
    "Crime",
    "Drama",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "96 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm1108007",
      "name": "David Lowery"
    }
  ],
  "writer": [
    {
      "id": "nm1108007",
      "name": "David Lowery",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm1913734",
      "name": "Rooney Mara",
      "character": "Ruth Guthrie"
    },
    {
      "id": "nm0000729",
      "name": "Casey Affleck",
      "character": "Bob Muldoon"
    },
    {
      "id": "nm0004936",
      "name": "Ben Foster",
      "character": "Patrick Wheeler"
    },
    {
      "id": "nm0001018",
      "name": "Keith Carradine",
      "character": "Skerritt"
    },
    {
      "id": "nm5476099",
      "name": "Kennadie Smith",
      "character": "Sylvie Guthrie"
    },
    {
      "id": "nm5476247",
      "name": "Jacklynn Smith",
      "character": "Sylvie Guthrie"
    },
    {
      "id": "nm1676649",
      "name": "Nate Parker",
      "character": "Sweetie"
    },
    {
      "id": "nm0519486",
      "name": "Robert Longstreet",
      "character": "Cowboy Hat"
    },
    {
      "id": "nm1889973",
      "name": "Charles Baker",
      "character": "Bear"
    },
    {
      "id": "nm1435438",
      "name": "Augustine Frizzell",
      "character": "Sissy"
    },
    {
      "id": "nm2310589",
      "name": "Kentucker Audley",
      "character": "Freddy"
    },
    {
      "id": "nm0954655",
      "name": "David Zellner",
      "character": "Zellner"
    },
    {
      "id": "nm3225731",
      "name": "Turner Ross",
      "character": "T.C."
    },
    {
      "id": "nm1785339",
      "name": "Rami Malek",
      "character": "Will"
    },
    {
      "id": "nm1080718",
      "name": "Will Beinbrink",
      "character": "Lt. Townes"
    },
    {
      "id": "nm1797014",
      "name": "Frank Mosley",
      "character": "Lt. Carson"
    },
    {
      "id": "nm3241779",
      "name": "Steve Corner",
      "character": "Lt. Brule"
    },
    {
      "id": "nm0420121",
      "name": "Annalee Jefferies",
      "character": "Mary"
    },
    {
      "id": "nm0915501",
      "name": "Gwen Waymon",
      "character": "Margaret"
    },
    {
      "id": "nm3882378",
      "name": "Artist Thornton",
      "character": "Altman"
    },
    {
      "id": "nm1005233",
      "name": "Richard Jackson",
      "character": "Skerritt's Friend"
    },
    {
      "id": "nm2592658",
      "name": "Johnny Horn",
      "character": "Stranger"
    },
    {
      "id": "nm0434526",
      "name": "Heather Kafka",
      "character": "Midwife #1"
    },
    {
      "id": "nm5847286",
      "name": "Susy Duggins",
      "character": "Midwife #2"
    },
    {
      "id": "nm5847287",
      "name": "Wyatt James Stafford",
      "character": "Baby in Daycare"
    }
  ],
  "overview": "The tale of an outlaw who escapes from prison and sets out across the Texas hills to reunite with his wife and the daughter he has never met.",
  "storyline": "The tale of an outlaw who escapes from prison and sets out across the Texas hills to reunite with his wife and the daughter he has never met.",
  "plot": "Ruth Guthrie is walking across a field and is followed by Bob Muldoon, who tries to dissuade Ruth from leaving him to return to her mother's. Ruth is adamant and reveals that she is angry at Bob because he supposedly told Freddy that he was going to 'strike out on his own'. Bob reassures her that this isn't the case, that he meant the both of them. They reconcile and Ruth reveals she is pregnant.\n\nLater that night Bob and Freddy commit a crime while Ruth waits in the getaway car. The police, including Patrick Wheeler, goes in pursuit of the culprits and a gunfight ensues, leaving their accomplice Freddy fatally shot and Ruth shooting Patrick. Bob concocts a plan to take the fall for shooting Patrick and the crime committed earlier so that Ruth can raise their child in freedom. Bob and Ruth surrender their weapons. They are apprehended and Bob jailed. Ruth tells Skerrit, Freddy's father, that she is going to wait for Bob. Bob writes several letters to Ruth while he is in jail, promising to be back with her and their child soon, and admonishes her to write to him. Their letters are always read by officials before they are passed on to either Ruth or Bob. Meanwhile, Ruth gives birth to their daughter, Sylvie.\n\nYears pass as Ruth and Sylvie live a normal life in the small town of Meridian, Texas. Patrick, who does not know it was Ruth that actually shot him, notices Ruth and Sylvie around town, but Ruth avoids any contact with him. One day, Patrick makes a visit to Ruth's residence and tells her that Bob has escaped from prison. The local detective questions Ruth as to Bob's whereabouts, and Ruth tells him that Bob has not come to visit her and that he will not come back for her and their daughter. Meanwhile, Bob is traversing the state of Missouri in order to escape the authorities. He coerces a woman to drive him to a location and then gets a train back to Texas. In Texas he procures the help of his friend Sweetie. When Sweetie asks Bob how he got out, and Bob tells Sweetie that he walked out and purports to have a higher calling to life and prison is not a part of that calling. Meanwhile, three bounty hunters, led by an individual called Bear visit Skerrit's hardware store and make general inquiries about the town.\n\nPatrick visits Ruth to return her letters. He tells her that she should move to a safer place until the situation passes, which Ruth takes to mean as until Bob is caught. Bob visits Skerrit at his hardware store. Skerritt informs Bob that there are many people who want him dead and that Bob needs to stay away from Ruth and Sylvie. Patrick visits Sweetie's establishment, asking if he has seen Bob. As they go upstairs, Sweetie tries to warn Bob of the approaching policeman by talking loudly and making a show of trying to open the door to the room Bob is staying in. Bob escapes but leaves behind a photo of Ruth and Sylvie. Sweetie accounts for it by saying it was something Ruth had sent him to pass on to Bob.\n\nOn the day of Sylvie's birthday party, Patrick gives Sylvie a guitar. While talking with Sylvie at the party, Patrick learns that Ruth has been planning a trip with Sylvie. Bob arrives at the house but notices Patrick and subsequently leaves. Bob returns to the original shootout location and encounters the bounty hunters. They immediately fire their weapons at him and he manages to kill one of them during a struggle. He shoots another when he attempts to drive away, but he is also seriously wounded. He does get away but is chased by the third. Bob coerces a driver, Will to drive him back to Ruth's house. Will tries to tell Bob that he should be taken to a hospital but Bob refuses, insisting to be taken to Ruth's house.\n\nSylvie wakes up to find her mother sleeping on the sofa in the arms of Patrick. Patrick smiles at her and she smiles back. They are startled by gunshots outside. Patrick runs out to investigate and finds the third bounty hunter, engaged in a shootout with Skerrit. Patrick shoots the bounty hunter dead and goes to see if Skerrit is okay. He finds that Skerrit is fatally wounded. Ruth and Sylvie are taken to the police station for questioning and safekeeping. When Patrick returns them to their home, they find the front door open and Patrick goes in to investigate, finding a grievously wounded Bob. Ruth follows Patrick into the house and stops Patrick from approaching Bob. Ruth tends to Bob, and Sylvie enters to see her father dying in the arms of her mother. Patrick takes Sylvie back outside and comforts her, while her parents exchange a few last words.",
  "synopsis": null
}