{
  "imdb_id": "tt2359024",
  "tmdb_id": "188166",
  "douban_id": null,
  "title": "Blue Ruin (2013)",
  "genres": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm1099918",
      "name": "Jeremy Saulnier"
    }
  ],
  "writer": [
    {
      "id": "nm1099918",
      "name": "Jeremy Saulnier",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0086301",
      "name": "Macon Blair",
      "character": "Dwight"
    },
    {
      "id": "nm2418861",
      "name": "Ydaiber Orozco",
      "character": "Amanda (Rental Houser Mother)"
    },
    {
      "id": "nm7455374",
      "name": "Ronald Sarcos",
      "character": "Eric (Rental House Father)"
    },
    {
      "id": "nm5165184",
      "name": "Dani Santiago",
      "character": "Daughter #1"
    },
    {
      "id": "nm7455375",
      "name": "Adrian Santiago",
      "character": "Daughter #2"
    },
    {
      "id": "nm7455376",
      "name": "George Fredericks",
      "character": "Metal Detector Couple"
    },
    {
      "id": "nm7455377",
      "name": "Elizabeth Fredericks",
      "character": "Metal Detector Couple"
    },
    {
      "id": "nm1047715",
      "name": "Sidné Anderson",
      "character": "Officer Eddy"
    },
    {
      "id": "nm4795866",
      "name": "Brooke Bennett",
      "character": "Smoking Girl"
    },
    {
      "id": "nm7455379",
      "name": "Ellen Danaher",
      "character": "Pawn Shop Clerk"
    },
    {
      "id": "nm2566606",
      "name": "Katie Kramer",
      "character": "Supermarket Cashier"
    },
    {
      "id": "nm4046697",
      "name": "Shelley Illmensee",
      "character": "SUV Driver"
    },
    {
      "id": "nm0463828",
      "name": "Kevin Kolack",
      "character": "Teddy Cleland"
    },
    {
      "id": "nm1834025",
      "name": "Stacy Rock",
      "character": "Hope Cleland (Cousin)"
    },
    {
      "id": "nm0000589",
      "name": "Eve Plumb",
      "character": "Kris Cleland (Sister)"
    },
    {
      "id": "nm1708556",
      "name": "Brent Werzner",
      "character": "Carl Cleland"
    },
    {
      "id": "nm3664430",
      "name": "David Thompson",
      "character": "William       (as David W. Thompson)"
    },
    {
      "id": "nm7455380",
      "name": "Sandy Barnett",
      "character": "Wade Cleland, Jr."
    },
    {
      "id": "nm1575921",
      "name": "Obie Sims",
      "character": "Corrections Officer"
    },
    {
      "id": "nm7455381",
      "name": "John D. McKemy",
      "character": "Tractor Trailer Driver"
    },
    {
      "id": "nm0362955",
      "name": "Amy Hargreaves",
      "character": "Sam"
    },
    {
      "id": "nm7455382",
      "name": "Ella Saulnier",
      "character": "Sam's Daughter"
    },
    {
      "id": "nm7455383",
      "name": "Noëlle Saulnier",
      "character": "Sam's Daughter"
    },
    {
      "id": "nm4533384",
      "name": "Abigail Horton",
      "character": "Babysitter       (as Abby Horton)"
    },
    {
      "id": "nm3439927",
      "name": "Daniel L. Kelly",
      "character": "Ketchup Man       (as Daniel Kelly)"
    },
    {
      "id": "nm7455385",
      "name": "John Plantz",
      "character": "Pharmacy Clerk"
    },
    {
      "id": "nm7455386",
      "name": "Gina Byrne",
      "character": "Triage Nurse"
    },
    {
      "id": "nm0176922",
      "name": "Bonnie Johnson",
      "character": "Margaret Gaffney"
    },
    {
      "id": "nm3583100",
      "name": "Erica Genereux Smith",
      "character": "Rock Girl"
    },
    {
      "id": "nm0711864",
      "name": "Devin Ratray",
      "character": "Ben Gaffney"
    }
  ],
  "overview": "The quiet life of a beach bum is upended by dreadful news. He sets off for his childhood home to carry out an act of vengeance but proves an inept assassin and finds himself in a brutal fight to protect his estranged family.",
  "storyline": "A mysterious outsider's quiet life is turned upside down when he returns to his childhood home to carry out an act of vengeance. Proving himself an amateur assassin, he winds up in a brutal fight to protect his estranged family.",
  "plot": "Dwight Evans, a beach vagrant, lives out of his car and scavenges for food and money. A policewoman tells him that Wade Cleland, the man who murdered Dwight's parents, is to be released from prison. Dwight returns to his hometown in Virginia and watches the Clelands collect Wade from prison. Despite failing to steal a gun, Dwight follows Wade to a club restroom and, after a fight, fatally stabs him. Realizing he dropped his car keys in the club, Dwight steals the Clelands' limousine; as he drives away, he discovers a teenage boy, William Cleland, in the back and lets him go.\n\nAfter cleaning himself up, Dwight visits his sister, Sam, for the first time in years and tells her he has killed Wade. Sam is shocked but glad. As the killing has gone unreported on the news, Dwight surmises that the Clelands have decided to seek revenge without police involvement. Sam flees her home with her daughters and Dwight waits in the house for the Clelands' attack. The Clelands arrive in the car Dwight left outside the club. Dwight escapes the attackers and runs over one of the Clelands, Teddy, in his car; he places the unconscious Teddy in the trunk. Before Dwight drives away, one of the attackers shoots him in the thigh with a crossbow.\n\nAfter attempting surgery on himself, Dwight has the wound treated at a hospital and returns to Sam's house to clean up the mess. He tracks down an old high school friend, Ben, who lends him a rifle. On Ben's land, Dwight interrogates Teddy at gunpoint. Teddy tells him that Wade was not his father's killer; it was Wade's now-deceased father, in revenge for Dwight's father having an affair with Wade Sr.'s wife. Teddy wrestles Dwight's rifle from him, but Ben shoots him dead from a concealed position. To keep Ben from further involvement, Dwight removes the battery from Ben's car.\n\nDwight goes to the Cleland house and finds it empty. He searches it for guns, dumps them in a lake, and waits to ambush the Clelands. He leaves a message on the house answering machine asking them to leave Sam out of the dispute. The Clelands return and listen to Dwight's message; when it is clear that the Clelands intend to kill Sam, Dwight shoots Carl and holds up the women. William enters through another door and shoots Dwight with a shotgun. Dwight, severely wounded, asks William to leave with his car and tells him they are half-brothers. Kris Cleland reaches for a TEC-9 hidden under a recliner and attempts to shoot Dwight; she misses and instead kills the other Cleland woman. Dwight kills Kris but is shot. A postcard Dwight sent days earlier arrives at Sam's house.",
  "synopsis": "Dwight (Macon Blair) is a beach vagrant, with dirty, stringy hair, living out of his car and scavenging through trash cans and dumpsters for food and money. A policewoman finds Dwight asleep in his junker car and gives him the news that Wade Cleland, the man who murdered his parents, is soon to be released from prison. Dwight watches as Wade is released from prison. Dwight steals a gun, but wrecks it trying to get the gun lock out of it; he throws it in the garbage. He then procures a knife. Dwight confronts Wade in a club's rest room and, after a brief fight, fatally stabs him in the temple.While trying to escape after the killing, Dwight realizes he left his car keys in the rest room with Wade's body. Dwight's hand is bloody from stabbing the Cleland Gang limousine tire, and steals the Cleland Gang's limousine. Dwight finds a teenage boy (David W. Thompson) in the rear of the limousine, and he stops and lets the boy out, admitting the crime. Dwight cleans up all the blood, cuts off his stringy hair, and now looks a pudgy \"regular person,\" nothing like the beach vagrant who committed the murder. After cleaning up his looks, he visits his sister, Sam (Amy Hargreaves), for the first time in several years. Over an emotional conversation in a cafe, Dwight reveals that he killed Wade. His sister is shocked, but appears happy with the news. Dwight also says he assumed she would have heard about the murder on the news, then realizing that the story hasn't been on the news. This means that the Cleland Gang never contacted the police, and they are likely seeking their own revenge on Dwight. Because of this, Sam takes her two daughters and flees.While his sister is gone, Dwight waits in her house for the inevitable attack from the Clelands. Two attackers break into the house, one with a cross-bow weapon. Dwight gets to his car, and he manages to run over one of the attackers, Teddy (Kevin Kolack). He is shot in the leg with an arrow by the other attacker, but he chases the attacker off. Dwight then drags Teddy's unconscious body into the trunk of his car. He attempts home surgery on his arrow wound, but he is unable to extract it. Ultimately, he collapses in the waiting room of a local hospital. After waking up in the hospital, with the wound repaired, he leaves the building in his hospital johnny, and finds his hidden car. He bangs on the trunk, and Teddy bangs back. Dwight leaves Teddy in the trunk, and he drives to meet Ben Gaffney (Devin Ratray), an old high school friend. Dwight persuades Ben to lend him a rifle. Dwight then goes out to his car in a field. There, he unlocks the trunk and negotiates with Teddy, who is sitting in the trunk, with Dwight pointing the rifle at Teddy from a few yards away. Dwight tries to get Teddy to guarantee that the Clelands will leave his sister alone.During the conversation between Dwight and Teddy, it is revealed that Wade was not his parent's killer. It was, in fact, Wade's father, who has now died of cancer. Wade's father's motive was that Dwight's father was having an affair with his wife. Dwight's mother was killed accidentally. Teddy lures Dwight closer to the trunk, and then Teddy leaps from the truck and manages to wrestle Dwight's rifle from him. As Teddy is aiming the rifle at Dwight lying on the ground, Ben appears off in the distance. With a single shot from far away, Ben kills Teddy. Ben and Dwight return to Ben's house, where Dwight borrows a smaller weapon. He then drives off, heading for the Cleland's house. We see that Dwight has disabled Ben's car by taking the battery with him. At the Clelands, Dwight searches for all the guns in the house, and he throws them in the nearby water. He urinates on the grave of Wade's father, but he also digs a grave for Teddy, and buries him. He leaves a message on the answering machine and hides, waiting for the Clelands to return.The Cleland family returns, a man and two women. They listen to the message from Dwight. In the message, Dwight asks them to leave his sister alone, as the score is now equal in terms of family members murdered. When it's clear that the Clelands won't agree to this, Dwight emerges, and he shoots the man. Unbeknownst to Dwight, the teenage boy from the limousine is also there, and he makes his way around towards Dwight, ultimately shooting Dwight in the belly with a shotgun. Dwight hits the boy's shotgun away and states that he has \"done his job\", as Dwight thinks that he (Dwight) will die from the shotgun wound. Dwight tells the boy to leave and take Dwight's car in the woods. Dwight tells the boy that he (Dwight) is actually the boy's half brother (from the affair between the parents). In a rage, the older of the two women reaches under a recliner, and grabs a machine gun hidden there that Dwight had missed. There's very rapid gunfire. Dwight kills the remaining two women and, while lying on the floor spitting blood from his mouth, repeatedly whispers \"the keys are in the car\"."
}