{
  "imdb_id": "tt2451110",
  "tmdb_id": "225145",
  "douban_id": null,
  "title": "Gatchaman (2013)",
  "genres": [
    "Action",
    "Sci-Fi"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "113 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.1,
  "director": [
    {
      "id": "nm2213511",
      "name": "Tôya Satô"
    }
  ],
  "writer": [
    {
      "id": "nm1033745",
      "name": "Tatsuo Yoshida",
      "description": "characters"
    },
    {
      "id": "nm2448218",
      "name": "Yûsuke Watanabe",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm3271373",
      "name": "Tôri Matsuzaka",
      "character": "Ken"
    },
    {
      "id": "nm0840660",
      "name": "Ryôhei Suzuki",
      "character": "Ryu"
    },
    {
      "id": "nm1687017",
      "name": "Gô Ayano",
      "character": "Joe"
    },
    {
      "id": "nm3897573",
      "name": "Ayame Gôriki",
      "character": "Jun"
    },
    {
      "id": "nm3835968",
      "name": "Tatsuomi Hamada",
      "character": "Jinpei"
    },
    {
      "id": "nm6968515",
      "name": "Alexander Clemmens",
      "character": "Embassy Employee"
    },
    {
      "id": "nm0368971",
      "name": "Eriko Hatsune",
      "character": "Naomi"
    },
    {
      "id": "nm0457240",
      "name": "Gorô Kishitani",
      "character": "Dr. Nambu"
    },
    {
      "id": "nm0594073",
      "name": "Ken Mitsuishi",
      "character": "Dr. Kirkland"
    },
    {
      "id": "nm1217394",
      "name": "Shidô Nakamura",
      "character": "Iriya"
    },
    {
      "id": "nm1404231",
      "name": "Gregory Pekar",
      "character": "Director General Anderson"
    }
  ],
  "overview": "By the year 2050 AD, a mysterious organization called Galactor has occupied half of the Earth and threatens to exterminate the human race. Around the same time, the International Science Organization had uncovered mysterious stones that bear unusual powers.  It is said that one person out of approximately eight million is able to harness the power of the stones; they are known as a \"Receptor\". Dr. Kozaburo Nambu gathers a team of these five lucky Receptors together. Known as the \"Gatchaman\" team, it is their mission to defeat Galactor.",
  "storyline": "Set in the near future in Tokyo, Japan. The evil terrorist organization Galactor has declared war on the world. The group possesses more advanced technology than governments and occupies over half of the planet. Dr. Kozaburo Nambu of the International Science Organization gathers together 5 superhero ninja agents, known collectively as Gatchaman, to stop Galactor.",
  "plot": "Wayne in early stages of development.\nCapcom first introduced Lost Planet on December 10, 2005 at an invite only press conference announcing Jun Takeuchi as both the producer and executive producer, Kenji Ohguro as the designer and Shin Kurosawa who wrote the original story . At the conference, Capcom announced that they would follow the tradition of basing the main character of their game after a real person. Capcom decided to base the main character Wayne after the famous South Korean star, Lee Byung-hun. To capture the full essence of Lee, Capcom used a program called Face Robot. This allowed Capcom to use Lee's basic expressions and translate them to Wayne in the game. Capcom had Lee dress up in a recreation of Waynes attire and then did full body 3D scan to translate Lee into Wayne using a function called GATOR. But instead of using Lee for character animations, the developers did so manually. As for environments, Capcom used up to 300,000 to 600,000 polygons in the screen at once for a single battle. They then used an XSI program and then manually added in elaborate details. One of the main focuses of Lost Planet was to make a game that could be a commercial success in both North America and Japan.\n\nLost Planet also made an appearance at E3 2006. There, a new trailer debuted and a Xbox Live demo was announced for released by May 11, 2006, both multiplayer and single player. At the Expo, Keiji Inafune explained Capcom's reason for choosing the Xbox 360 as the prime console saying \"What the Xbox 360 represents is a great balance. When you think about when it was released, what it can do, how much it costs, the type of games it will have, it's just in a very nice position. The PlayStation 3 being that expensive is going to put it out of the price range of a lot of people, but yet the 360 will still be there. It will still be something that's affordable for enough people. The one disadvantage, unfortunately, is that it did not succeed in Japan.\". Lost Planet also made an appearance at Leipzig 2006, where it showcased a brand new trailer showing glimpses on online multiplayer. Following its appearance in Leipzig, Lost Planet also appeared at the 2006 Tokyo Game Show and DICE 2009.\n\nThe Windows version of the game had two demos with the latter supporting DirectX 10, this was followed by the final release supporting DirectX 9.0c and DirectX 10.",
  "synopsis": null
}