{
  "imdb_id": "tt2498340",
  "tmdb_id": "263897",
  "douban_id": null,
  "title": "Algonquin (2013)",
  "genres": [
    "Drama"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "101 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.0,
  "director": [
    {
      "id": "nm1419056",
      "name": "Jonathan Hayes"
    }
  ],
  "writer": [
    {
      "id": "nm1419056",
      "name": "Jonathan Hayes",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0719321",
      "name": "Mark Rendall",
      "character": "Jake Roulette"
    },
    {
      "id": "nm0132757",
      "name": "Nicholas Campbell",
      "character": "Leif Roulette"
    },
    {
      "id": "nm0565319",
      "name": "Sheila McCarthy",
      "character": "Rita"
    },
    {
      "id": "nm5099900",
      "name": "Michael Levinson",
      "character": "Iggy"
    },
    {
      "id": "nm0761073",
      "name": "Victoria Sanchez",
      "character": "Carmen"
    },
    {
      "id": "nm0052103",
      "name": "Boyd Banks",
      "character": "Geordie"
    },
    {
      "id": "nm5422067",
      "name": "Hailey Garrod",
      "character": "Kid 2"
    },
    {
      "id": "nm4849457",
      "name": "Brett Houghton",
      "character": "Kid 1"
    },
    {
      "id": "nm5422044",
      "name": "Kelsey Ruhl",
      "character": "Ashley"
    },
    {
      "id": "nm3422616",
      "name": "Brian Nettlefold",
      "character": "Mourner"
    },
    {
      "id": "nm2141442",
      "name": "Rod Carley",
      "character": "Bill Lish"
    },
    {
      "id": "nm7753128",
      "name": "Blake Cerisano",
      "character": "Teacher Celebrating Birthday"
    }
  ],
  "overview": "A father-son camping expedition runs aground on misfortune and family secrets.",
  "storyline": "JAKE is an unhappy school teacher whose childhood scars are not merely skin deep. Jake's life is upended when his shifty, rogue of a father, LEIF - an absentee parent and a man who best days as a travel writer are well past him-- insists that Jake help him with his next project, a book about Algonquin Park. Agreeing to a temporary arrangement, father and son arrive at the long-neglected family cabin in the woods, a tranquil backdrop to their fractious relationship. But bickering and bad feelings are soon cut short by an unexpected tragedy Laying his father to rest along with the man's many secrets, Jake decides to finish the book as a gesture to the father he barely knew. Back at the cabin, Jake's work is interrupted by unexpected visitors: a mother and child. CARMEN and IGGY are revealed to be grieving members of Leif's secret family. For Jake, this deception seems to be the final straw. All he wants to do is pack up and leave. However something stops him. Iggy, just an ...",
  "plot": "Leif (Nicholas Campbell), a travel writer whose career has declined, visits his son Jake (Mark Rendall). The father plans to produce a book about Algonquin Park and invites his son to join him in its writing. Leif also meets up with Rita (Sheila McCarthy), his former wife and Jake's mother. Matters are complicated when they are joined by Carmen (Victoria Sanchez), Leif's young romantic partner, and her son Iggy (Michael Levinson). Leif and Jake then proceed with a canoe trip through Algonquin Park to find a particular horseshoe.",
  "synopsis": "When Jake goes to his late father's cabin in Algonquin Park to finish his father's adventure travel book, he discovers more material than he expected."
}