{
  "imdb_id": "tt2445148",
  "tmdb_id": "220912",
  "douban_id": null,
  "title": "Kill the Dictator (2013)",
  "genres": [
    "Drama"
  ],
  "country": "Dominican Republic",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.0,
  "director": [
    {
      "id": "nm0510738",
      "name": "Felix Limardo"
    }
  ],
  "writer": [
    {
      "id": "nm5315438",
      "name": "Huchi Lora",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm1004774",
      "name": "Amaury Nolasco",
      "character": "Amado Garcia Guerrero"
    },
    {
      "id": "nm0276691",
      "name": "Efrain Figueroa",
      "character": "General Rafael Leonidas Trujillo"
    },
    {
      "id": "nm1723094",
      "name": "Mercedes Renard",
      "character": "Carmen Soto"
    },
    {
      "id": "nm0418544",
      "name": "Antonio Jaramillo",
      "character": "Lt. Andujar"
    },
    {
      "id": "nm0145049",
      "name": "Enrique Castillo",
      "character": "Johnny Abbes"
    },
    {
      "id": "nm1989616",
      "name": "Liche Ariza",
      "character": "Salvador Estrella Sadhalá"
    },
    {
      "id": "nm0830373",
      "name": "Brett Stimely",
      "character": "President John F Kennedy"
    },
    {
      "id": "nm2487301",
      "name": "Ben Cornish",
      "character": "Attorney General Robert F. Kennedy"
    },
    {
      "id": "nm1907114",
      "name": "Orestes Amador",
      "character": "Pedro Livio Cedeño"
    },
    {
      "id": "nm1747359",
      "name": "Ivonne Beras Goico",
      "character": "(as Ivonne Beras)"
    },
    {
      "id": "nm4703659",
      "name": "Elias Caamaño Perez",
      "character": "Major Pozo"
    },
    {
      "id": "nm1595757",
      "name": "Giovanny Cruz",
      "character": "Modesto Díaz"
    },
    {
      "id": "nm8614622",
      "name": "Vanessa Cucurullo",
      "character": ""
    },
    {
      "id": "nm0272663",
      "name": "Augusto Feria",
      "character": ""
    },
    {
      "id": "nm8086872",
      "name": "Benjamín García",
      "character": "Antonio De La Maza"
    },
    {
      "id": "nm2459609",
      "name": "Josue Guerrero",
      "character": "Felix Soto"
    },
    {
      "id": "nm1865274",
      "name": "Mario Lebrón",
      "character": "Antonio Imbert Barrera"
    },
    {
      "id": "nm6632193",
      "name": "Hans Martínez",
      "character": "Professor       (as Hans Martinez)"
    },
    {
      "id": "nm1900951",
      "name": "Miguel Ángel Martínez",
      "character": "Calie"
    },
    {
      "id": "nm1984405",
      "name": "Johnnie Mercedes",
      "character": "Zacarías"
    },
    {
      "id": "nm3705837",
      "name": "Socrates Montas",
      "character": "Dr. Durán Bracho"
    },
    {
      "id": "nm1901343",
      "name": "Micky Montilla",
      "character": "Roberto Pastoriza"
    },
    {
      "id": "nm0633611",
      "name": "Karina Noble",
      "character": ""
    },
    {
      "id": "nm0647446",
      "name": "César Olmos",
      "character": ""
    },
    {
      "id": "nm2591687",
      "name": "Isabel Cristina Polanco",
      "character": "Doña Urania"
    },
    {
      "id": "nm1992420",
      "name": "Amauris Pérez",
      "character": "Lt. Rivera"
    },
    {
      "id": "nm2730132",
      "name": "Omar Ramirez",
      "character": "Juan Tomás Díaz"
    },
    {
      "id": "nm2687892",
      "name": "Yamile Scheker",
      "character": ""
    },
    {
      "id": "nm5736554",
      "name": "William Simon",
      "character": "De La Rosa"
    },
    {
      "id": "nm1217962",
      "name": "Rafael Solano",
      "character": ""
    },
    {
      "id": "nm1556688",
      "name": "Hector Then",
      "character": "Lucas Cedeno"
    },
    {
      "id": "nm8086873",
      "name": "Wilson Ureña",
      "character": "Huáscar Tejeda"
    },
    {
      "id": "nm0896184",
      "name": "Cuquín Victoria",
      "character": ""
    },
    {
      "id": "nm2203021",
      "name": "Victor Vidal",
      "character": "President Balaguer"
    }
  ],
  "overview": "The United States was very concerned about the instability of the region, with Cuba on one end and the Dominican Republic on the other. Something had to be done. At first, Lt. Garcia Guerrero was proud to have been assigned as an aid to General Trujillo only to witness, first hand, the atrocities and demented actions of the dictator. Everything Lt. Garcia Guerrero loved was being stripped from him... the love of his life, members of his family and the love for his country. Thousands of innocent people were being killed, the country was in turmoil and gripped with fear. Someone had to step up to the plate and take immediate action and Lt. Garcia Guerrero became the inside man in the plot to Kill the Dictator.",
  "storyline": "The United States was very concerned about the instability of the region, with Cuba on one end and the Dominican Republic on the other. Something had to be done. At first, Lt. Garcia Guerrero was proud to have been assigned as an aid to General Trujillo only to witness, first hand, the atrocities and demented actions of the dictator. Everything Lt. Garcia Guerrero loved was being stripped from him... the love of his life, members of his family and the love for his country. Thousands of innocent people were being killed, the country was in turmoil and gripped with fear. Someone had to step up to the plate and take immediate action and Lt. Garcia Guerrero became the inside man in the plot to kill the dictator.",
  "plot": "Dave Skylark is the host of the talk show Skylark Tonight, where he interviews celebrities about personal topics and gossip. After Skylark and his crew celebrate their 1,000th episode, the show's producer Aaron Rapaport is upset by a producer peer who criticized the show as not being a real news program. A while later Rapaport reveals his concern and urge for change, to which Skylark agrees. Skylark discovers that North Korean leader Kim Jong-un is a fan of Skylark Tonight, prompting Rapaport to arrange an interview. Rapaport travels to a place outside Dandong, China to receive instructions from Sook-yin Park, the North Korean chief propagandist, and Rapaport accepts the task of interviewing Kim, on behalf of Skylark.\n\nThe next day, CIA Agent Lacey shows up at Skylark and Rapaport's place, proposing that the duo assassinate Kim using a transdermal strip that will expose Kim to ricin via handshake; they reluctantly agree. Skylark carries the ricin strip hidden inside a pack of gum. Upon their arrival in the presidential palace in Pyongyang, they are introduced to security officers Koh and Yu; Koh discovers the ricin strip and chews it, believing it to be gum. That night, Lacey airdrops them two more strips from a UAV, but in order to smuggle it back to their room, Rapaport has to evade a Siberian tiger and then hide the container in his rectum.\n\nSkylark spends the day with Kim, playing basketball and partying. Kim persuades Skylark that he is misunderstood as a cruel dictator and as a failed administrator, and they become friends. At dinner, Koh has a seizure and inadvertently kills Yu before dying. The next morning, Skylark feels guilty and discards one of the ricin strips, then thwarts Rapaport's attempt to poison Kim with the second strip. After a dinner mourning the death of Kim's bodyguards, Skylark witnesses Kim's malicious side; and after taking a walk and discovering that a nearby grocery store is merely a façade, Skylark realizes that Kim has been lying to him.\n\nAt the same time, during attempted sexual intercourse with Rapaport, who still has the ricin band in his hand, Sook-yin reveals that she despises Kim and apologizes for defending the regime. Skylark, Rapaport, and Sook-yin form a plan to break Kim's cult of personality by causing him to cry on air. As they arm themselves for the event, Rapaport and Sook-yin have sex. Before the broadcast starts, Kim presents Skylark with a puppy to keep.\n\nDuring the internationally televised interview with Kim, Skylark addresses increasingly sensitive topics and challenges Kim's need for his father's approval. Meanwhile, Sook-yin and Rapaport seize control of the broadcasting center and fend off guards trying to halt the broadcast. Despite his initial resistance, Kim eventually cries uncontrollably and soils himself after Skylark sings \"Firework\" by Katy Perry (having learned of Kim's fondness of Perry earlier), ruining his reputation. Kim shoots Skylark and leaves, but Skylark reveals he has survived due to wearing a bulletproof vest. Skylark, Rapaport, and Sook-yin regroup with the puppy in tow and escape the presidential palace with the unexpected help of a Korean guard. The trio hijack Kim's Soviet tank (which had been given to Kim Il-sung by Joseph Stalin and then passed down to Kim) to get to their pickup point. Kim boards a helicopter, and his army pursues the group. He prepares nuclear missiles, but before he can issue the command to launch, Skylark fires a shell from the tank and destroys Kim's helicopter, killing everyone on board. With the immediate threat over, Sook guides Skylark and Rapaport to an escape route, and they are rescued by three SEAL Team Six members disguised as Korean People's Army troops and are loaded onto a rescue craft. Back in the U.S., Skylark writes a book about his experience, and North Korea moves toward becoming a denuclearized democracy with Sook-yin as interim leader.",
  "synopsis": null
}