{
  "imdb_id": "tt2481198",
  "tmdb_id": "214100",
  "douban_id": null,
  "title": "Sunshine on Leith (2013)",
  "genres": [
    "Comedy",
    "Drama",
    "Musical",
    "Romance"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "100 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm0002077",
      "name": "Dexter Fletcher"
    }
  ],
  "writer": [
    {
      "id": "nm1114104",
      "name": "Stephen Greenhorn",
      "description": "stage play"
    },
    {
      "id": "nm1114104",
      "name": "Stephen Greenhorn",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm4834796",
      "name": "Paul Brannigan",
      "character": "Ronnie"
    },
    {
      "id": "nm1126657",
      "name": "George MacKay",
      "character": "Davy"
    },
    {
      "id": "nm2295590",
      "name": "Kevin Guthrie",
      "character": "Ally"
    },
    {
      "id": "nm0001363",
      "name": "Jane Horrocks",
      "character": "Jean"
    },
    {
      "id": "nm0611932",
      "name": "Peter Mullan",
      "character": "Rab"
    },
    {
      "id": "nm4087606",
      "name": "Freya Mavor",
      "character": "Liz"
    },
    {
      "id": "nm5705519",
      "name": "John Spence",
      "character": "Brendan"
    },
    {
      "id": "nm1214556",
      "name": "Paul McCole",
      "character": "Ewan"
    },
    {
      "id": "nm3841447",
      "name": "Emily-Jane Boyle",
      "character": "Christine"
    },
    {
      "id": "nm3687902",
      "name": "Antonia Thomas",
      "character": "Yvonne"
    },
    {
      "id": "nm0002076",
      "name": "Jason Flemyng",
      "character": "Harry"
    },
    {
      "id": "nm2653740",
      "name": "Emma Hartley-Miller",
      "character": "Janice"
    },
    {
      "id": "nm0254825",
      "name": "Elaine M. Ellis",
      "character": "Morag       (as Elaine Mackenzie Ellis)"
    },
    {
      "id": "nm1817883",
      "name": "Gayle Telfer Stevens",
      "character": "Francine"
    },
    {
      "id": "nm2335154",
      "name": "Sara Vickers",
      "character": "Eilidh"
    },
    {
      "id": "nm6622988",
      "name": "Julia Taudevin",
      "character": "Barmaid"
    },
    {
      "id": "nm4239843",
      "name": "Michael Keat",
      "character": "Barman"
    },
    {
      "id": "nm0621356",
      "name": "Daniela Nardini",
      "character": "Chef"
    },
    {
      "id": "nm1384954",
      "name": "Nick Farr",
      "character": "Doctor"
    },
    {
      "id": "nm6300850",
      "name": "Roddy Hart",
      "character": "Anniversary Band"
    },
    {
      "id": "nm7240461",
      "name": "Geoff Martyn",
      "character": "Anniversary Band"
    },
    {
      "id": "nm7240462",
      "name": "John Martin",
      "character": "Anniversary Band"
    },
    {
      "id": "nm7240463",
      "name": "Gordon Turner",
      "character": "Anniversary Band"
    },
    {
      "id": "nm7240464",
      "name": "Scott Clark",
      "character": "Anniversary Band"
    }
  ],
  "overview": "Davy and Ally have to re-learn how to live life in Edinburgh after coming home from serving in Afghanistan. Both struggle to learn to live a life outside the army and to deal with the everyday struggles of family, jobs and relationships. Sunshine on Leith is based on the sensational stage hit of the same name, featuring music by pop-folk band The Proclaimers.",
  "storyline": "Sunshine on Leith is based on the sensational stage hit of the same name, featuring music by pop-folk band The Proclaimers. The film follows the stories of Davy and Ally, who have to re-learn how to live life in Edinburgh after coming home from serving in Afghanistan. Both struggle to learn to live a life outside the army and to deal with the everyday struggles of family, jobs and relationships.",
  "plot": "The film starts in Afghanistan where an APC is on patrol while the passengers are nervous as to whether they will still be alive (\"Sky Takes the Soul\"), before an ambush happens. Some time later Davy Henshaw (George MacKay) and Ally (Kevin Guthrie), two recently discharged British Army servicemen, return to their homes and families in Edinburgh after a tour in Afghanistan (\"I'm on my Way\"). Ally returns to his girlfriend Liz (Freya Mavor), a nurse who is Davy's sister. On Davy and Ally's first night home Liz introduces Davy to her English friend and colleague Yvonne (Antonia Thomas) at a pub. Liz and Yvonne take part in some drunken story telling, a Scottish tradition (\"Over and Done With\"). Following from their blind date Davy and Yvonne strike up a romantic relationship (\"Misty Blue\") as Ally and Liz consider their future as a potential married couple (\"Make my Heart Fly\").\n\nDavy's Dad Robert \"Rab\" Henshaw (Peter Mullan) receives a letter from, and later meets, a daughter he didn't know he had; the product of an affair early in his marriage (the mother of this affair had died and Rab secretly attends the funeral).\n\nAlly explains to Davy that he intends to propose to Liz during the 25th wedding anniversary party for Davy's parents Rab and Jean (\"Let's Get Married\"). At the anniversary party Rab serenades Jean (Jane Horrocks) (\"Oh Jean\"). During the party, Jean discovers the letter still in Rab's jacket and is outraged at Rab's infidelity. Ally then proposes to Liz, who turns him down. A mass brawl develops and Yvonne is horrified at Davy's aggression.\n\nJean is horrified to hear from Rab that he intends to keep seeing his newly found daughter. Jean sends him to Coventry and he is seen sleeping on the sofa. Eventually, Jean feels guilty and blames herself for the deconstruction of her family but her colleagues at the Scottish National Gallery reassure her that none of these events were her fault (\"Should have been Loved\").\n\nMeanwhile, Rab is out buying the ingredients for a special meal he intends to cook in the hopes of reconciliation with Jean. As he returns home, he suffers a heart attack on the doorstep and is admitted to hospital. Rab recovers, and Rab and Jean reconcile (\"Sunshine on Leith\"). Jean agrees to let Rab see his daughter and has brought her to the hospital to see him.\n\nYvonne and Davy have reconciled (\"Then I Met You\"). However, Liz and Ally's relationship has dissolved. Ally re-enlists, while Liz accepts an offer of a job nursing in Florida (\"Letter from America\").\n\nAfter an argument with Davy, Yvonne prepares to leave Edinburgh. However, before she can reach Waverley railway station, Davy catches her and declares his commitment to her in Princes Street Gardens where they reconcile for a second time (\"I'm Gonna Be (500 Miles)\"). The scene cuts to Jean &amp; Rab singing verses of the song to each other; Ally on patrol with the army, presumably sings to Liz whom is shown at work in America opening a letter from Ally.",
  "synopsis": null
}