{
  "imdb_id": "tt2480794",
  "tmdb_id": "322464",
  "douban_id": null,
  "title": "Bad Luck (2015)",
  "genres": [
    "Action",
    "Comedy",
    "Crime",
    "Drama",
    "Thriller"
  ],
  "country": "Austria",
  "version": [
    {
      "runtime": "78 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm0941825",
      "name": "Thomas Woschitz"
    }
  ],
  "writer": [
    {
      "id": "nm0941825",
      "name": "Thomas Woschitz",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm5638960",
      "name": "Valerie Pachner",
      "character": "Dagmar"
    },
    {
      "id": "nm0473420",
      "name": "Gerhard Kubelka",
      "character": "Gerhard (Policeman)"
    },
    {
      "id": "nm7061830",
      "name": "Ernestine Schmerlaib",
      "character": "Susi"
    },
    {
      "id": "nm6823079",
      "name": "Christian Zankl",
      "character": "Rizzo"
    },
    {
      "id": "nm7061829",
      "name": "Markus Schwärzer",
      "character": "Robert"
    },
    {
      "id": "nm7061827",
      "name": "Josef Smretschnig",
      "character": "Karl"
    },
    {
      "id": "nm7061828",
      "name": "Thomas Oraze",
      "character": "Lippo"
    }
  ],
  "overview": "Dagmar works at a gas station struggling to pay her debts. Lippo is fired by his chef swearing revenge. Karl and his weird friend Rizzo find a bag filled with money which lead them to rash actions. Three car crashes. Three days. Three stories.",
  "storyline": "Dagmar works at a petrol station, owes money, and to make matters worse, is turned out of her flat. Lippo is at a complete loss. After 15 years building up a betting shop with his boss, he suddenly gets fired. Karl is a car mechanic and sells water filters to make ends meet. Rizzo, Karl's strange friend, is unhappy about being different to the others. A desolate petrol station in the middle of nowhere serves as a focal point in the characters' lives. Three car crashes, one stolen gun and a surprise discovery of money appear by irony of fate as means for escaping the tedious daily routine. But nothing is as simple as it first appears. Chance, irresponsible acts, and entanglements: in the end it seems that happiness is far from attainable. BAD LUCK is a lovingly made, tragic-comic film about wrong decisions, chance and the search for happiness.",
  "plot": null,
  "synopsis": null
}