{
  "imdb_id": "tt2413516",
  "tmdb_id": "268940",
  "douban_id": null,
  "title": "The Forbidden Dimensions (2013)",
  "genres": [
    "Horror",
    "Sci-Fi",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "86 min",
      "description": ""
    }
  ],
  "imdb_rating": 1.7,
  "director": [
    {
      "id": "nm0588110",
      "name": "Christopher James Miller"
    }
  ],
  "writer": [
    {
      "id": "nm0588110",
      "name": "Christopher James Miller",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0641972",
      "name": "Brittany O'Neil",
      "character": "Kronos Scientist"
    },
    {
      "id": "nm0187680",
      "name": "Carl Crew",
      "character": "Pastor John"
    },
    {
      "id": "nm3831735",
      "name": "Amy Daly",
      "character": "Alien"
    },
    {
      "id": "nm0588110",
      "name": "Christopher James Miller",
      "character": "Gristle /              Tracker"
    },
    {
      "id": "nm0857212",
      "name": "Lisa Thayer",
      "character": "Jack's Mother"
    },
    {
      "id": "nm2391444",
      "name": "Al Ridenour",
      "character": "Doctor"
    },
    {
      "id": "nm2753184",
      "name": "Steven Briggs",
      "character": "Duct Factory Creature"
    },
    {
      "id": "nm3104621",
      "name": "Kyle Morris",
      "character": "Jack Slade"
    },
    {
      "id": "nm1591795",
      "name": "Hart D. Fisher",
      "character": "Bounty Hunter"
    },
    {
      "id": "nm3090490",
      "name": "Steve Dorfman",
      "character": "Dr. Klaus von Watson"
    },
    {
      "id": "nm0326969",
      "name": "Al Gomez",
      "character": "Kronos Executive"
    },
    {
      "id": "nm1849172",
      "name": "Justin Apone",
      "character": "Vagrant"
    },
    {
      "id": "nm0503791",
      "name": "Robert Diaz Leroy",
      "character": "Shaman"
    },
    {
      "id": "nm3387254",
      "name": "Auriana-Lynn",
      "character": "Nurse"
    },
    {
      "id": "nm2669338",
      "name": "Clifford Lee",
      "character": "Bounty Hunter"
    },
    {
      "id": "nm5288413",
      "name": "Jamie Katonic",
      "character": "Khadijah"
    },
    {
      "id": "nm5269063",
      "name": "Logan Horberg",
      "character": "Bruno"
    },
    {
      "id": "nm5769410",
      "name": "Patricia Robinson",
      "character": "Victim"
    },
    {
      "id": "nm1434500",
      "name": "Kit Bateman",
      "character": "Junior"
    },
    {
      "id": "nm3392342",
      "name": "Jamie Lawrence",
      "character": "Jack's Ex-Girlfriend"
    },
    {
      "id": "nm1475442",
      "name": "Sean Stearley",
      "character": "Bill"
    },
    {
      "id": "nm5769409",
      "name": "Sofie Thornton",
      "character": "Mutant"
    },
    {
      "id": "nm5083542",
      "name": "Veronica Tarlitz",
      "character": "Filth"
    },
    {
      "id": "nm2059648",
      "name": "Brian Hendrick",
      "character": "Dill"
    },
    {
      "id": "nm5769411",
      "name": "James Roberts",
      "character": "Mutant"
    },
    {
      "id": "nm3090072",
      "name": "Karey Miller",
      "character": "Mutant"
    },
    {
      "id": "nm2974681",
      "name": "Erin Blaisdell",
      "character": "Pez"
    },
    {
      "id": "nm5685808",
      "name": "Alexander I. Abbott",
      "character": "Mutant"
    },
    {
      "id": "nm5084734",
      "name": "Kalise Wallace",
      "character": "Noose"
    },
    {
      "id": "nm8419366",
      "name": "Todd Brown",
      "character": "Detective Giger"
    },
    {
      "id": "nm5460502",
      "name": "James M. Ryan",
      "character": "Mutant"
    },
    {
      "id": "nm5685993",
      "name": "Olivia Sky Abbott",
      "character": "Orion"
    },
    {
      "id": "nm3882453",
      "name": "Curtis Gropp",
      "character": "Wasteland Tower Guard"
    },
    {
      "id": "nm4568056",
      "name": "Mark McGarrey",
      "character": "Dr. Shector"
    },
    {
      "id": "nm5323355",
      "name": "Kaneda Kent",
      "character": "Eddie"
    }
  ],
  "overview": "Jack Slade was born during a solar eclipse in the year 1980. 18 years later, he finds out he has the ability to travel into the future. He projects himself into the year 2035, where society has been destroyed by a fascist regiment of psychopathic doctors that rule the wastelands, creating deformed mutants with a serum synthesized from the flesh of dead aliens. Now Slade must travel back to the year 1998 to destroy a device known as the wavelength generator, which opened the dimensional gateways to these alien beings. With the help of an army of female outlaws and a sleazy detective, Slade re-connects with the star child Khadijah, who holds the key to stopping these tragic events from ever taking place.",
  "storyline": "Jack Slade was born during a solar eclipse in the year 1980. 18 years later, he finds out he has the ability to travel into the future. He projects himself into the year 2035, where society has been destroyed by a fascist regiment of psychopathic doctors that rule the wastelands, creating deformed mutants with a serum synthesized from the flesh of dead aliens. Now Slade must travel back to the year 1998 to destroy a device known as the wavelength generator, which opened the dimensional gateways to these alien beings. With the help of an army of female outlaws and a sleazy detective, Slade re-connects with the star child Khadijah, who holds the key to stopping these tragic events from ever taking place.",
  "plot": "In the 23rd century, starship C-57D reaches the distant world Altair IV to determine the fate of an Earth expedition sent there 20 years earlier. Dr. Edward Morbius, one of the expedition's scientists, unsuccessfully tries to persuade the relief ship not to land, saying he cannot guarantee their safety.\n\nCommander John J. Adams, Lieutenant Jerry Farman, and Lieutenant \"Doc\" Ostrow are met by Robby the Robot, who transports them to Morbius' residence. Morbius describes how one by one the rest of the expedition was killed by an unknown planetary force that vaporized their starship, the Bellerophon, as the last survivors tried to lift off. Only Morbius, his wife (who later died of natural causes), and their daughter Altaira were somehow immune. Morbius offers to help them prepare for the return journey, but Adams says he must await further instructions from Earth.\n\nThe next day, Adams finds Farman teaching Altaira how to kiss; furious, he dismisses Farman and berates Altaira for her naivety and revealing clothing. She reports the incident to Morbius, who says that she never needs to see Adams again. But Altaira designs a new, more conservative gown to please Adams. That night, an invisible intruder sabotages equipment aboard the starship. Adams and Ostrow confront Morbius the following morning. While waiting for him to exit his study, Adams steps outside to talk to Altaira. Adams apologizes for his behavior and they kiss. They are attacked by a tiger, and Adams disintegrates the animal, which had previously been tame in Altara's presence.\n\nUpon Morbius' appearance, Adams and Ostrow learn he has been studying the Krell, a highly advanced native race that perished overnight 200,000 years before. In a Krell laboratory Morbius shows them a \"plastic educator\", a device capable of measuring and enhancing intellectual capacity. When Morbius first used it, he barely survived, but his intellect was permanently doubled. Morbius then takes them on a tour of a vast, 20 miles square, Krell underground machine complex, still functioning and powered by 9,200 thermonuclear reactors. Afterwards, Adams demands that Morbius turn over his scientific discoveries to Earth. Morbius refuses, claiming that \"humanity is not yet ready to receive such limitless power\".\n\nIn response to the sabotage, Adams orders a force field fence deployed around the starship. It proves ineffective when the intruder returns and murders Chief Engineer Quinn. Morbius warns Adams that he has a premonition of further deadly attacks, similar to what happened with the Bellerophon. That night, the invisible creature returns and is outlined in the fence's force field. The ships weapons have no effect, and it kills Farman and two others. Morbius, asleep in the Krell lab, is startled awake by screams from Altaira; at the same instant, the roaring creature vanishes.\n\nLater, while Adams tries to persuade Altaira to leave, Ostrow sneaks away to use the Krell educator. With his dying breath, Ostrow explains to Adams that the underground machine was built to materialize anything the Krell could imagine. He says that the Krell forgot one thing: \"Monsters from the Id\". Adams asserts that Morbius' subconscious mind created the creature that killed the members of the original expedition and attacked his crew; Morbius refuses to accept this accusation.\n\nAfter Altaira tells Morbius that she intends to leave with Adams, Robby detects the creature approaching. Morbius commands the robot to kill it, but Robby knows it is a manifestation of Morbius and shuts down. The monster melts through the almost indestructible Krell metal doors of the laboratory where Adams, Altaira, and Morbius have taken refuge. Morbius finally accepts the truth. He confronts and disowns the creature but is fatally injured. Before Morbius dies, he has Adams unknowingly initiate a chain reaction within the Krell reactors, saying they must be in deep space within 24 hours. At a safe distance, Adams, Altaira, Robby and the surviving crew witness the destruction of Altair IV.\nLeslie Nielsen and Anne Francis in Forbidden Planet.",
  "synopsis": null
}