{
  "imdb_id": "tt2458314",
  "tmdb_id": "156643",
  "douban_id": null,
  "title": "The Last Tycoon (2012)",
  "genres": [
    "Action",
    "Adventure",
    "Crime",
    "Drama"
  ],
  "country": "Hong Kong",
  "version": [
    {
      "runtime": "107 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm0939147",
      "name": "Jing Wong"
    }
  ],
  "writer": [
    {
      "id": "nm2597943",
      "name": "Koon-nam Lui",
      "description": "screenplay"
    },
    {
      "id": "nm0939147",
      "name": "Jing Wong",
      "description": "screenplay"
    },
    {
      "id": "nm0939236",
      "name": "Manfred Wong",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0000334",
      "name": "Yun-Fat Chow",
      "character": "Cheng Daiqi"
    },
    {
      "id": "nm2119781",
      "name": "Xiaoming Huang",
      "character": "Cheng Da Qi (young)"
    },
    {
      "id": "nm0005033",
      "name": "Sammo Kam-Bo Hung",
      "character": "Hong Shou Ting"
    },
    {
      "id": "nm0628757",
      "name": "Francis Ng",
      "character": "Máo Zài"
    },
    {
      "id": "nm1356997",
      "name": "Quan Yuan",
      "character": "Ye Zhiqiu"
    },
    {
      "id": "nm1337123",
      "name": "Li Yuan",
      "character": "Ling Husheng"
    },
    {
      "id": "nm3075421",
      "name": "Monica Siu-Kei Mok",
      "character": "Bao"
    },
    {
      "id": "nm8673032",
      "name": "Zhihua Doha",
      "character": "Master Ye"
    },
    {
      "id": "nm8673033",
      "name": "Mark Du",
      "character": "Mao's subordinate"
    },
    {
      "id": "nm5446923",
      "name": "Wenjuan Feng",
      "character": "Young Ye Zhiqiu       (as Joyce Feng)"
    },
    {
      "id": "nm1705334",
      "name": "Hu Gao",
      "character": "Lin Huai"
    },
    {
      "id": "nm4526249",
      "name": "Tian Gao",
      "character": "Officer Pei"
    },
    {
      "id": "nm5610407",
      "name": "Zhi Han",
      "character": "Lu Yongxiang, military gov."
    },
    {
      "id": "nm3360636",
      "name": "Luxia Jiang",
      "character": ""
    },
    {
      "id": "nm0475602",
      "name": "Yasuaki Kurata",
      "character": "Nishino"
    },
    {
      "id": "nm5149588",
      "name": "Xi Lai",
      "character": "Fruit Stall Owner       (as Lai Xi)"
    },
    {
      "id": "nm5325480",
      "name": "Kunjue Li",
      "character": "Qi Pao"
    },
    {
      "id": "nm6835563",
      "name": "Xintong Li",
      "character": "Fruit Stall Owner's Wife"
    },
    {
      "id": "nm3716079",
      "name": "Miracle Ji Qi",
      "character": "Lu Xiaojia       (as Miracle Qi)"
    },
    {
      "id": "nm5328537",
      "name": "Kimmy Fei Tong",
      "character": "Bao (young)       (as Kimmy Tong)"
    },
    {
      "id": "nm5056903",
      "name": "Baiqing Xin",
      "character": "Cheng Zhaimei"
    },
    {
      "id": "nm8673031",
      "name": "Eagle Yang",
      "character": "Fatty /              Fatso"
    },
    {
      "id": "nm4210896",
      "name": "Songwen Zhang",
      "character": "Mr. Pao"
    },
    {
      "id": "nm5327757",
      "name": "Yitong Zheng",
      "character": "Xiaolanchun"
    },
    {
      "id": "nm8673034",
      "name": "Shi Zhenglong",
      "character": "young Fatty /              Fatso"
    }
  ],
  "overview": "Set in Shanghais Gangster era of the early 1900s, THE LAST TYCOON tells the tale of CHENG (Chow Yun-Fat), a young man who is set up by the chief of police (Sammo Hung) and must leave the life he knows and QIU (Monica Mok), the woman he loves, to start again. After escaping prison CHENG quickly and violently moves his way up the ladder of Shanghais criminal underworld to become on the most powerful mob bosses in Shanghais history. But fame and notoriety take their toll when CHENG finds himself stuck between the looming Japanese army and the scheming local secret service. Matters are only made worse when he bumps into the love of his life QIU, along with her writer husband. Will love re-kindle in the dusk of an era?",
  "storyline": "Action superstar Chow Yun-Fat portrays real-life gangster Chen Daqi as he rises to the upper echelons of power, finding himself torn between the love of two women, the murderous plots of the secret service, and the looming threat of war.",
  "plot": "The story begins in the 1910s in early Republican China. Cheng Daqi, a young fruit vendor from Chuansha, is arrested and imprisoned after being framed for murder. He is saved by Mao Zai, an agent working for the secret police. He travels to Shanghai in search of a new life. In Shanghai, he meets Hong Shouting, a mob boss, and becomes one of Hong's apprentices. He also falls in love with Bao, a singer whom he eventually marries. His true love, however, is actually Ye Zhiqiu, an opera actress from his hometown. At one point, Hong unknowingly offends the son of a general and is captured by the general's men. Cheng negotiates with the general and succeeds in making a deal with him to release Hong and invest in their bank. Hong feels so grateful to Cheng that he becomes sworn brothers with him.\n\nSome 20 years later, a middle-aged Cheng has become an influential tycoon and mob boss in Shanghai. He maintains close ties with Hong and Hong's wife, Ling Husheng. At the same time, he has a shaky relationship with Mao Zai, who is now a high-ranking officer in the National Revolutionary Army. He meets his old flame, Ye Zhiqiu, when she visits Shanghai, but she is already married to Cheng Zhaimei, a member of an underground resistance movement. They are caught up in the events of the Second Sino-Japanese War, which breaks out in 1937. Mao arranges for Cheng, Ye and her husband to escape to Hong Kong in the midst of the Battle of Shanghai, but keeps Bao as a hostage with him. After the fall of Shanghai, Mao defects to the Japanese and becomes a provincial governor. The Japanese general Nishino intends to make Cheng the puppet mayor of Shanghai, so Mao suggests to him to keep Cheng's loved ones alive and use them to lure Cheng back to Shanghai.\n\nCheng returns to Shanghai and reluctantly cooperates with the Japanese. He makes secret plans with Ye Zhiqiu to save their loved ones and allies, and assassinate Nishino. One evening, while Nishino and Mao Zai are distracted by an opera performance in a theatre, Cheng and his men break into the prison to rescue Hong Shouting, Ling Husheng and the others. After returning to the theatre, Cheng and his comrades attack the Japanese and kill Nishino. Mao manages to flee to the backstage, where he holds Ye hostage at gunpoint and threatens to kill her if Cheng does not put down his pistol. Just then, Bao shows up and saves Ye from Mao, but dies in the process. The furious Cheng vents his anger on Mao by shooting him repeatedly. Cheng carries Bao's body and walks out of the theatre with Ye, only to find themselves surrounded by Japanese soldiers. They take shelter inside a car and die together when the soldiers unleash a volley of gunfire on them.",
  "synopsis": "Set in Shanghais Gangster era of the early 1900s, THE LAST TYCOON tells the tale of CHENG (Chow Yun-Fat), a young man who is set up by the chief of police (Sammo Hung) and must leave the life he knows and QIU (Monica Mok), the woman he loves, to start again. After escaping prison CHENG quickly and violently moves his way up the ladder of Shanghais criminal underworld to become on the most powerful mob bosses in Shanghais history. But fame and notoriety take their toll when CHENG finds himself stuck between the looming Japanese army and the scheming local secret service. Matters are only made worse when he bumps into the love of his life QIU, along with her writer husband. Will love re-kindle in the dusk of an era?"
}