{
  "imdb_id": "tt2401711",
  "tmdb_id": "223381",
  "douban_id": null,
  "title": "Time and the Wind (2013)",
  "genres": [
    "Drama",
    "Romance",
    "War"
  ],
  "country": "Brazil",
  "version": [
    {
      "runtime": "115 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm0598173",
      "name": "Jayme Monjardim"
    }
  ],
  "writer": [
    {
      "id": "nm0747752",
      "name": "Tabajara Ruas",
      "description": "screenplay"
    },
    {
      "id": "nm0895160",
      "name": "Erico Verissimo",
      "description": "book"
    },
    {
      "id": "nm1311694",
      "name": "Letícia Wierzchowski",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0005244",
      "name": "Fernanda Montenegro",
      "character": "Bibiana Terra Cambará (idosa)"
    },
    {
      "id": "nm0479895",
      "name": "Thiago Lacerda",
      "character": "Capitão Rodrigo Cambará"
    },
    {
      "id": "nm1597010",
      "name": "Marjorie Estiano",
      "character": "Bibiana Terra-Cambará (jovem)"
    },
    {
      "id": "nm1132887",
      "name": "Janaína Kremer Motta",
      "character": "Bibiana Terra-Cambará (adulta)"
    },
    {
      "id": "nm0969931",
      "name": "Cleo",
      "character": "Ana Terra       (as Cléo Pires)"
    },
    {
      "id": "nm2454894",
      "name": "Mayana Moura",
      "character": "Luzia Silva Cambará"
    },
    {
      "id": "nm3893291",
      "name": "Igor Rickli",
      "character": "Bolívar Terra-Cambará"
    },
    {
      "id": "nm0532464",
      "name": "Leonardo Machado",
      "character": "Marciano Bezerra"
    },
    {
      "id": "nm6169022",
      "name": "Liselene Severo Bidone",
      "character": "Ana Terra (old)"
    },
    {
      "id": "nm0136691",
      "name": "Rafael Cardoso",
      "character": "Florêncio Terra"
    },
    {
      "id": "nm0168774",
      "name": "Cyria Coentro",
      "character": "Henriqueta Terra"
    },
    {
      "id": "nm1891815",
      "name": "Matheus Costa",
      "character": "Pedro Missioneiro (jovem)"
    },
    {
      "id": "nm5021958",
      "name": "Apolônio Cypriano",
      "character": ""
    },
    {
      "id": "nm0206831",
      "name": "José de Abreu",
      "character": "Ricardo Amaral"
    },
    {
      "id": "nm2671364",
      "name": "Marat Descartes",
      "character": "Licurgo Terra-Cambará"
    },
    {
      "id": "nm0244514",
      "name": "Gonzalo Durán",
      "character": "Capitão"
    },
    {
      "id": "nm4216457",
      "name": "Luis Franke",
      "character": "Nicolau"
    },
    {
      "id": "nm0332281",
      "name": "Paulo Goulart",
      "character": "Coronel Amaral Neto"
    },
    {
      "id": "nm0529764",
      "name": "Vanessa Lóes",
      "character": "Maria Valéria Terra"
    },
    {
      "id": "nm0575478",
      "name": "Leonardo Medeiros",
      "character": "Bento Neto"
    },
    {
      "id": "nm2744986",
      "name": "Fernanda Moro",
      "character": "Josefa Bezerra"
    },
    {
      "id": "nm5062990",
      "name": "Cris Pereira",
      "character": "Juvenal Terra"
    },
    {
      "id": "nm0685146",
      "name": "Suzana Pires",
      "character": "Ana Terra (adulta)"
    },
    {
      "id": "nm0708728",
      "name": "Miguel Ramos",
      "character": ""
    },
    {
      "id": "nm1448617",
      "name": "Martín Rodríguez",
      "character": "Pedro Missioneiro (adulto)"
    },
    {
      "id": "nm1204465",
      "name": "César Troncoso",
      "character": "Padre"
    },
    {
      "id": "nm0890388",
      "name": "Luiz Carlos Vasconcelos",
      "character": "Maneco"
    },
    {
      "id": "nm1711858",
      "name": "Marcos Verza",
      "character": "Padre Otero (young)"
    },
    {
      "id": "nm2755731",
      "name": "Elisa Volpatto",
      "character": "Alice Terra"
    }
  ],
  "overview": "Based on the novel's trilogy of the same name, by Erico Verissimo, Time and the Wind follows 150 years of family Terra Cambará and their opponent Amaral family. The history of struggles between the two families begins in the missions and runs until the end of the 19th century. The film also features the period of formation of the State of Rio Grande do Sul and the dispute of territory between the Portuguese and Spanish crowns",
  "storyline": "The history of Brazil's southern occupation and the Anna Terra descendants.",
  "plot": "Mafia boss Giovanni Manzoni, who offended Don Luchese, a rival mafia boss, survives an attempted hit on him and his family at a barbecue. He snitches on Luchese, which sends Luchese to prison; Manzoni and his family enter an FBI witness protection program under the supervision of Agent Robert Stansfield, and are relocated to a small town in Normandy.\n\nIn adjusting to life in the village, each family member runs into trouble. Giovanni is being observed by two FBI agents to ensure he doesn't leave his house. Giovanni claims to be an author writing a historical novel on the Normandy landings, which is problematic as many citizens in the area are much more familiar with the event than he is. Giovanni finds ways to slip away and begins a quest to discover why the water in his house is brown. He beats a plumber who tries to shake him down for money to unnecessarily change all the pipes in his house and a local fertilizer factory owner who interrupts him while he is talking.\n\nDaughter Belle falls in love with Henri, a college student working as a substitute maths teacher. She pretends to need private maths lessons so she can get time alone with him and she eventually seduces him. Wife Maggie blows up a small grocery store when its owner spews anti-American comments in French to the other customers and often visits the undercover FBI agents. She spends a lot of time at the church, where she and the local priest have an amicable relationship. Their friendship ends when she confesses the numerous crimes her family has committed and he tells her never to come back.\n\nOn the first day of class at the local school, son Warren is beaten up by a small gang, but he digs up information and uses it to curry favor with the most influential students, creating a mini-mafia within the school. This sway allows him to beat up the gang. He inadvertently alerts Don Luchese to their location when he quotes one of the kingpin's sayings in a school paper, which makes its way back to Luchese through a series of chance events.\n\nGiovanni is asked to attend an American film event due to his supposed historical expertise and he brings Agent Stansfield along, claiming to want to bond with him, but it's an alibi for a timed explosive he has rigged to destroy the structure causing his brown water. The film screening takes an unexpected turn when instead of Some Came Running, the scheduled film, they watch Goodfellas. Throughout the film, Giovanni expresses a desire to talk about his life as a mobster, seemingly expressing some guilt. The debate after the film prompts him to tell his story to the audience. Feeling his cover has been compromised, Agent Stansfield gives an order to relocate the family again.\n\nMeanwhile, the school detects Warren's activities so he decides to leave town with a fake passport, afraid that the FBI will drop the family's protection. At the train station, he sees seven hitmen arrive and head for the town. He returns home to warn the family. Henri breaks up with Belle, which causes her to contemplate suicide, but she stops when she sees the hitmen enter the police station and kill several officers. As Giovanni returns home, Maggie arrives outside and notices the team of hitmen, who have already killed firemen and who have proceeded to kill their neighbours. She takes cover in the FBI safe-house across the street.\n\nThe hitmen blow up the family's house and soon an intense gunfight ensues which involves all family members. Giovanni and Maggie strangle and stab a hitman after he raids the safe-house and tries to sexually assault Maggie. Belle kills a hitman who went to look for weapons in his car's trunk. Using weapons she found in the trunk, she shoots one of the five hitmen near the burning house. Warren also takes guns from the trunk of the car and shoots two of the hitmen while being given cover fire by Belle. One hitman is killed by the family dog. While chasing Belle, the lead hitman is killed by Stansfield's car.\n\nThe family relocates again. Despite numerous innocent townspeople being slaughtered, Giovanni expresses his happiness at having had the chance to tell his story, saying that it brought the family closer.",
  "synopsis": null
}