{
  "imdb_id": "tt2476090",
  "tmdb_id": "214250",
  "douban_id": null,
  "title": "Cosmic Psychos: Blokes You Can Trust (2013)",
  "genres": [
    "Music"
  ],
  "country": "Australia",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.4,
  "director": [
    {
      "id": "nm2854456",
      "name": "Matt Weston"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm0035232",
      "name": "Mark Arm",
      "character": "Himself       (rumored)"
    },
    {
      "id": "nm4054150",
      "name": "Ross Knight",
      "character": "Himself       (rumored)"
    },
    {
      "id": "nm4757582",
      "name": "Bruce Milne",
      "character": "Himself"
    },
    {
      "id": "nm0651628",
      "name": "Buzz Osborne",
      "character": "Himself       (rumored)"
    },
    {
      "id": "nm5399373",
      "name": "Kevin Rutmanis",
      "character": "Himself       (rumored)"
    },
    {
      "id": "nm0816978",
      "name": "Donita Sparks",
      "character": "Herself       (rumored)"
    },
    {
      "id": "nm5398101",
      "name": "Steve Turner",
      "character": "Himself       (rumored)"
    },
    {
      "id": "nm0891641",
      "name": "Eddie Vedder",
      "character": "Himself       (rumored)"
    },
    {
      "id": "nm0896901",
      "name": "Butch Vig",
      "character": "Himself       (rumored)"
    },
    {
      "id": "nm5399749",
      "name": "Bill Walsh",
      "character": "Himself       (rumored)"
    }
  ],
  "overview": "Form small beginnings on a Victorian farm to globetrotting punk rock icons, the Cosmic Psychos became one of Australia's most influential bands. Now after thirty years of music making, 'Cosmic Psychos: Blokes You Can Trust' documents the highs and lows of the group's musical career as told by members from the Melvins, L7, Mud Honey, Pearl Jam, and The Hard-Ons with other international music producers and from the Cosmic Psycho band members themselves.",
  "storyline": "For 30 years, the Cosmic Psychos have blazed a trail of empty beer cans and busted ear drums around the globe with their quintessential Australian drawl and pounding punk rock songs. With the founding member Ross Knight finding inspiration from the Bulldozer he drove on the family farm in country Victoria, the band forged a unique sound and image that resonated with punk rock fans everywhere. Iconic label Sup Pop! released their second album when the band fell into the 'Seattle' scene of the late 80's amidst the likes of Pearl Jam, Mudhoney and The Melvins. Never quite finding the mainstream success of their grunge counterparts, the band managed to tour heavily in the USA and Europe thanks to a large and devoted fan base. The Cosmic Psychos were notorious for their ability to drink pubs dry, earning them a reputation that resonated around as a warning - \"Never drink with the 'Psychos\". But it wasn't all shits and giggles. A heavy falling out with drummer and founding member Bill Walsh...",
  "plot": null,
  "synopsis": null
}