{
  "imdb_id": "tt2406422",
  "tmdb_id": "217576",
  "douban_id": null,
  "title": "Walking the Camino: Six Ways to Santiago (2013)",
  "genres": [
    "Documentary",
    "Adventure"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    },
    {
      "runtime": "53 min",
      "description": "TV"
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm0809166",
      "name": "Lydia Smith"
    }
  ],
  "writer": null,
  "cast": null,
  "overview": "'A Walk to Within: The Camino de Santiago' tells the story of walking the ancient 500-mile pilgrimage across norther Spain known as 'The Camino de Santiago'. The documentary follows six strangers from incredibly diverse walks of life as they attempt to cross an entire country on foot with only a backpack, a pair of boots, and an open mind. Each pilgrim throws themselves heart-and-soul into their physical trek to Santiago de Compostela, and their personal journey to themselves. As you watch, you will learn the rich history of this honored tradition, as well as witness the Camino's remarkable ability to change lives and provide those who choose to walk its paths with a greater sense of self and spiritual knowledge.",
  "storyline": "Walking the Camino: Six Ways to Santiago follows various pilgrims, from ages three to 73, as they attempt to cross an entire country on foot - with only a backpack, a pair of boots and an open mind. Driven by an inexplicable calling and a grand sense of adventure, each pilgrim throws themselves heart and soul into their physical trek to Santiago de Compostela, and most importantly, their personal journey to themselves. Whatever their motivation, no one can predict just how their paths will unfold, what personal demons or angels they will face, or what transformations they will undergo by trail's end. Called \"A brilliant documentary\" by Martin Sheen, this multiple award-winning film has been selling out screenings worldwide.",
  "plot": null,
  "synopsis": null
}