{
  "imdb_id": "tt2475846",
  "tmdb_id": "246449",
  "douban_id": null,
  "title": "Against the Wild (TV Movie 2013)",
  "genres": [
    "Adventure",
    "Family"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.7,
  "director": [
    {
      "id": "nm1856678",
      "name": "Richard Boddington"
    }
  ],
  "writer": [
    {
      "id": "nm1856678",
      "name": "Richard Boddington",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2640264",
      "name": "CJ Adams",
      "character": "Zach Wade"
    },
    {
      "id": "nm3879377",
      "name": "Erin Pitt",
      "character": "Hannah Wade"
    },
    {
      "id": "nm0000449",
      "name": "Natasha Henstridge",
      "character": "Susan Wade"
    },
    {
      "id": "nm0926471",
      "name": "Ted Whittall",
      "character": "Robert Wade"
    },
    {
      "id": "nm0854900",
      "name": "John Tench",
      "character": "Captain Walker"
    },
    {
      "id": "nm0290478",
      "name": "Rainbow Francks",
      "character": "Charlie Foster       (as Rainbow Sun Francks)"
    },
    {
      "id": "nm0317023",
      "name": "Jennifer Gibson",
      "character": "Sheila"
    },
    {
      "id": "nm0212639",
      "name": "Sarah Deakins",
      "character": "Sergeant McCoy"
    },
    {
      "id": "nm2460933",
      "name": "Shawn Storer",
      "character": "Eric"
    },
    {
      "id": "nm0132495",
      "name": "Greg Campbell",
      "character": "Bill Peters"
    },
    {
      "id": "nm2797528",
      "name": "Chuck Willcocks",
      "character": "Jimmy"
    },
    {
      "id": "nm6515281",
      "name": "Barney",
      "character": "The Bear"
    },
    {
      "id": "nm6515282",
      "name": "Houston",
      "character": "Chinook"
    }
  ],
  "overview": "The action-packed feature film tells the dramatic tale of two siblings and their Alaskan Malamute, who must make an emergency landing when their small plane has engine problems. They find themselves in a beautiful but potentially dangerous natural environment that they must overcome together.",
  "storyline": "Zach Wade, a mischievous kid who - along with his younger sister Hannah and their devoted dog Chinook - becomes lost in the wilderness when their small plane has engine problems and must make an emergency landing. Their mom and dad are frantic, and rescue teams are searching. But for the next few days, Zach, Hannah and Chinook must learn how to combine their skills, trust their instincts and navigate a terrain as beautiful as it is untamed.",
  "plot": null,
  "synopsis": "TOGETHER THEY WILL FIND A WAY. CJ Adams of THE ODD LIFE OF TIMOTHY GREEN stars as Zach Wade, a mischievous kid who along with his younger sister Hannah (Erin Pitt of AMERICAN GIRL: ISABELLE DANCES INTO THE SPOTLIGHT and CAMP ROCK 2) and their devoted dog Chinook become lost in the wilderness when their small plane has engine problems and must make an emergency landing. Their mom (Natasha Henstridge of She Spies and THE WHOLE NINE YARDS) and dad (Ted Whittall of Beauty & The Beast) are frantic, and rescue teams are searching. But for the next few days, Zach, Hannah and Chinook must learn how to combine their skills, trust their instincts and navigate a terrain as beautiful as it is untamed. John Tench (TOOTH FAIRY) co-stars in this exciting family adventure about loyalty, bravery and surviving AGAINST THE WILD."
}