{
  "imdb_id": "tt2461104",
  "tmdb_id": "173159",
  "douban_id": null,
  "title": "Us and the Game Industry (2014)",
  "genres": [
    "Documentary"
  ],
  "country": null,
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.4,
  "director": [
    {
      "id": "nm3882825",
      "name": "Stephanie Beth"
    }
  ],
  "writer": null,
  "cast": null,
  "overview": "This film follows several independent game developers (Jason Rohrer, thatgamecompany, Douglas Wilson, Zach Gage, Aledander Bruce) examining why they make digital games. The film delves into their creativity and explores some of their thinking and design strategies.  Game developers operate in terrain that demands both programming logic and aesthetic quality. The work is hard, however that's what they want to do. The film explores how the developers go deeper into the notion of entertainment and discovery.",
  "storyline": "Experience recent designs for video games in the 21st Century. The developers, their peers and the world of support structures for these expose the magic explored in a number of games. Thatgamecompany is watched during it's build of JOURNEY(2012); also, Jason Rohrer, Alexander Bruce, Douglas Wilson, and Zach Gage. Shot in San Francisco, New York, Davis, Austin and Copenhagen.",
  "plot": null,
  "synopsis": "This feature documentary investigates design principles with contemporary computer game developers. Featured are: Jenova Chen with lead programmer, John Edwards and Producer, Robin Hunicke and team members at work at thatgamecompany that was responsible for the game, JOURNEY for networked play on the PS3.\nOther developers are: Jason Rohrer, Douglas Wilson (Die Gute Fabrik), Alexander Bruce, and Zach Gage. Other games discussed are: Antichamber, MUTAZIONE, SPELLTOWER, J.S.JOUST and THE CASTLE DOCTRINEBorn to computer games in 2D these developers are sometimes referred to as the second generation. This cluster is engaged as individuals or small teams not working on triple AAA games, rather on ideas and in a set of ways that may be signposting autonomy for more games developing teams and to creative risks with concepts. The time heralds a flowering of interest and impetus with the medium.Filmed during builds from 2009 to 2012, shooting occurred in San Francisco, Los Angeles, New York, Austin, Davis and Copenhagen that culminates as an edit final after the release of some of these\nmentioned games"
}