{
  "imdb_id": "tt2460626",
  "tmdb_id": "166327",
  "douban_id": null,
  "title": "Whoisjw? (2012)",
  "genres": [
    "Documentary",
    "Biography"
  ],
  "country": "Netherlands",
  "version": [
    {
      "runtime": "38 min",
      "description": ""
    }
  ],
  "imdb_rating": 9.2,
  "director": [
    {
      "id": "nm5327640",
      "name": "Eelco Romeijn"
    }
  ],
  "writer": [
    {
      "id": "nm5327640",
      "name": "Eelco Romeijn",
      "description": "writer"
    }
  ],
  "cast": null,
  "overview": "WHOISJW? is a documentary about a very talented and successful young entrepreneur from Holland: Jeroen Wijering. He is the creator of the JW Player´, an open source videoplayer which is used on millions (!) of websites throughout the world. Many prestigious websites like Disney, Harvard, IMDB, Intel, NASA en The White House use his JW Player. Even YouTube ran on the JW Player in the first 18 months of their existence.  This documentary is all about entrepreneurship. Jeroen started programming as a student in 2005 and is now co-owner of a company in New York which is worth millions of dollars. He is a role model for students worldwide! In this documentary we are trying to uncover the secrets behind the success of one of Hollands most viewed and yet least-known export products.  Jeroen Wijerings parents, colleagues, university teachers and business contacts answer the question Who is Jeroen Wijering? and give their personal views on the unprecedented success of the JW Player.",
  "storyline": "The JW Player is used by hundreds of millions of people to watch videos on the Internet without them even realizing it. Prestigious sites like www.whitehouse.gov. barackobama.com, NASA, Disney, Al Jazeera, CNBC, Epic Games, IMDB, NOS.nl, Uitzendinggemist, use it. Even YouTube ran on the JW Player for the first 18 months of its existence! An inspirational story on converting a good idea to a world brand.",
  "plot": null,
  "synopsis": "WHOISJW? is a documentary about a very talented and successful young entrepreneur from Holland: Jeroen Wijering. He is the creator of the JW Player´, an open source videoplayer which is used on millions (!) of websites throughout the world. Many prestigious websites like Disney, Harvard, IMDB, Intel, NASA en The White House use his JW Player. Even YouTube ran on the JW Player in the first 18 months of their existence.This documentary is all about entrepreneurship. Jeroen started programming as a student in 2005 and is now co-owner of a company in New York which is worth millions of dollars. He is a role model for students worldwide! In this documentary we are trying to uncover the secrets behind the success of one of Hollands most viewed and yet least-known export products.Jeroen Wijerings parents, colleagues, university teachers and business contacts answer the question Who is Jeroen Wijering? and give their personal views on the unprecedented success of the JW Player."
}