{
  "imdb_id": "tt2446502",
  "tmdb_id": "206213",
  "douban_id": null,
  "title": "Zombie Hunter (2013)",
  "genres": [
    "Action",
    "Comedy",
    "Horror"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "93 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.5,
  "director": [
    {
      "id": "nm4283294",
      "name": "K. King"
    }
  ],
  "writer": [
    {
      "id": "nm4283294",
      "name": "K. King",
      "description": "written by as Kevin King"
    },
    {
      "id": "nm5323274",
      "name": "Kurt Knight",
      "description": "co-writer"
    }
  ],
  "cast": [
    {
      "id": "nm0001803",
      "name": "Danny Trejo",
      "character": "Jesús"
    },
    {
      "id": "nm0178840",
      "name": "Martin Copping",
      "character": "Hunter"
    },
    {
      "id": "nm3743828",
      "name": "Clare Niederpruem",
      "character": "Alison"
    },
    {
      "id": "nm2611883",
      "name": "Jade Regier",
      "character": "'Fast Lane' Debbie"
    },
    {
      "id": "nm2673512",
      "name": "Jason K. Wixom",
      "character": "Ricky"
    },
    {
      "id": "nm5678768",
      "name": "Terry Guthrie",
      "character": "Jerry"
    },
    {
      "id": "nm1315949",
      "name": "Jake Suazo",
      "character": "Lyle"
    },
    {
      "id": "nm4695830",
      "name": "Jeff Kirkham",
      "character": "Funny Man"
    },
    {
      "id": "nm4594105",
      "name": "Michael Monasterio",
      "character": "Casanova"
    },
    {
      "id": "nm2369044",
      "name": "Marianne Smith",
      "character": "Cheerleader"
    },
    {
      "id": "nm2667589",
      "name": "Shona Kay",
      "character": "Female Reporter"
    },
    {
      "id": "nm2326393",
      "name": "Jarrod Phillips",
      "character": "Male Reporter"
    },
    {
      "id": "nm7294121",
      "name": "Ashley Halbash",
      "character": "Daughter"
    },
    {
      "id": "nm7294122",
      "name": "Cali Gonzalez",
      "character": "Wife"
    },
    {
      "id": "nm2278904",
      "name": "Adam Judd",
      "character": "Lead Zombie"
    },
    {
      "id": "nm4217101",
      "name": "Amy Savannah",
      "character": "Sexy Zombie"
    },
    {
      "id": "nm7294123",
      "name": "Jake Bushman",
      "character": "Death Angel"
    }
  ],
  "overview": "Zombie Hunter is set in a post-apocalyptic Zombie wasteland caused by the mysterious street drug \"Natas\". We follow one man who has nothing left other than a beat up Camaro and a trunk full of guns and booze. He runs down Flesh Eaters, hunting for sport and redemption, while also running from his past. After crashing into a small group of survivors, who are running low on resources, he decides to lend a hand. But a surprise attack by the Flesh Eaters forces them on the run and puts the Hunter's skills to the test.",
  "storyline": "Zombie Hunter is set in a post-apocalyptic Zombie wasteland caused by the mysterious street drug \"Natas\". We follow one man who has nothing left other than a beat up Camaro and a trunk full of guns and booze. He runs down Flesh Eaters, hunting for sport and redemption, while also running from his past. After crashing into a small group of survivors, who are running low on resources, he decides to lend a hand. But a surprise attack by the Flesh Eaters forces them on the run and puts the Hunter's skills to the test.",
  "plot": "The film opens with a news report on \"Natas\", a strange drug which has been reported to induce zombie-like effects in those who consume it. The film then fast forwards in time, to an Earth mostly inhabited by zombies. The Hunter (Martin Copping) drives along a post-apocalyptic wasteland and meets a hostile \"Death Angel\". The zombie is reduced to purplish goo after Hunter rams his car at it. He proceeds to stop at a deserted filling station to fill his car's empty gas tank. Hunter enters the station's convenience store to check out any available supplies, but is ambushed by invading zombies. He eliminates them all after a gory battle and downs his sorrows by gulping a bottle of tequila. It is revealed that Hunter's daughter and wife have both died. Resuming his journey, Hunter unknowingly ventures into the turf of the survivors, who have not been infected by Natas. Thinking Hunter is a zombie, an unknown assailant takes a shot at him. Hunter survives nevertheless and is greeted by survivor Fast Lane Debbie (Jade Regier) upon regaining consciousness.\n\nA flirty Debbie attempts to make out with Hunter but fellow survivor Alison (Clare Niederpruem) awkwardly walks into the room to hand him a can of cola, before coercing an annoyed Debbie to leave Hunter alone. Outside, Debbie accuses Alison of being a slut. The latter woman throws back the same insult and they start to quarrel. The audience is then introduced to Father Jesús (Danny Trejo), a pastor-like zombie slayer and leader of the survivor's colony. As the survivors assemble in a small room to have a meal together, a groggy Hunter joins the crowd and gets to formally know the other survivors. Alison and Hunter start to get romantically passionate with each other.\n\nAll is well until a wave of normal zombies and a monstrously large zombie somehow make their way into the survivor's camp. The survivors are able to fend off the normal zombies but the gigantic zombie is seemingly unstoppable to the point that even bullets do not faze it. Jesús rushes in to save them and is able to mutilate the hulking zombie with his axe by slicing off its arm. However, Jesús is unable to defeat him wholly and as a result, the zombie slices off his head. The remaining survivors scramble into a car and drive off to an airport in hopes of being able to find a working aeroplane to fly off with.\n\nThe zombies, unshakable, still manage to track them down. Consequently, all of the survivors, except for Alison, Hunter, and Alison's brother Ricky (Jason K. Wixom), are killed. Mustering their courage, they confront the zombies and begin shooting them. At last, only the giant zombie is left. Having run out of bullets, Hunter is impaled by the sharp-clawed zombie. Nonetheless, he miraculously finds the energy to detonate a grenade, wiping out the creature and destroying the rundown airport. Just as the bomb explodes, Alison and Ricky climb into a truck and drive off to safety.\n\nAlison vows to always remember Hunter and his courageous deed, echoing that he had finally found what he yearned for — peace. In the aftermath of the explosion, Hunter is shown to be still alive. He explains that he feels cursed as the zombies never seem to be able to kill him and decides to take his own life before the credits roll.",
  "synopsis": "A new street drug called NATAS unleashes a zombie apocalypse that spreads like wildfire and mutates its users into flesh eaters. With nothing left but a beat-up Camaro and trunk full of guns & booze, Hunter (Martin Copping) spends his day running down the flesh eaters for sport and redemption from his tortured past. After crashing into a small group of survivors, led by an ax-wielding priest named Jesús (Danny Trejo), Hunter is seduced into escorting the eclectic group (strippers, rednecks, and in innocent beauty) to a mythical place of refuge. Under constant assault from zombies and a chain-saw wielding psychotic clown, a surprise attack by a new breed of giant mutant flesh eaters forces them to abandon their quest, and put Hunter's skills to the test."
}