{
  "imdb_id": "tt2401789",
  "tmdb_id": "228606",
  "douban_id": null,
  "title": "The Secret Village (2013)",
  "genres": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "89 min",
      "description": ""
    }
  ],
  "imdb_rating": 2.4,
  "director": [
    {
      "id": "nm3155173",
      "name": "Swamy M. Kandan"
    }
  ],
  "writer": [
    {
      "id": "nm3155173",
      "name": "Swamy M. Kandan",
      "description": "writer as Swamy Kandan"
    },
    {
      "id": "nm4217786",
      "name": "Jason B. Whittier",
      "description": "screenplay as Jason Whittier and"
    },
    {
      "id": "nm3155173",
      "name": "Swamy M. Kandan",
      "description": "screenplay as Swamy Kandan"
    }
  ],
  "cast": [
    {
      "id": "nm1057932",
      "name": "Jonathan Bennett",
      "character": "Greg"
    },
    {
      "id": "nm3137126",
      "name": "Ali Faulkner",
      "character": "Rachel"
    },
    {
      "id": "nm0726223",
      "name": "Richard Riehle",
      "character": "Paul"
    },
    {
      "id": "nm0767445",
      "name": "Stelio Savante",
      "character": "Joe"
    },
    {
      "id": "nm1794697",
      "name": "Tobi Gadison",
      "character": "Jim"
    },
    {
      "id": "nm2987317",
      "name": "Karin Duseva",
      "character": "Mary"
    },
    {
      "id": "nm4030500",
      "name": "Kef Lee",
      "character": "Jason"
    },
    {
      "id": "nm4613288",
      "name": "Gerard Rem",
      "character": "Max"
    },
    {
      "id": "nm5154653",
      "name": "Darleen Zradi",
      "character": "Emily"
    },
    {
      "id": "nm5155093",
      "name": "Patrick Muraca",
      "character": "Clark"
    },
    {
      "id": "nm7116159",
      "name": "Olivia Marchione",
      "character": "Young Rachel"
    },
    {
      "id": "nm4217786",
      "name": "Jason B. Whittier",
      "character": "Samuel       (as Jason Whittier)"
    },
    {
      "id": "nm4514199",
      "name": "Miriam Weisbecker",
      "character": "Secretary"
    },
    {
      "id": "nm5155065",
      "name": "Randy Cormier",
      "character": "Baker"
    },
    {
      "id": "nm1508840",
      "name": "Lisa Mears",
      "character": "Mom"
    },
    {
      "id": "nm7116160",
      "name": "Alexa Green",
      "character": "Jessica"
    },
    {
      "id": "nm6032931",
      "name": "Meshell Bordeleau",
      "character": "Teacher"
    },
    {
      "id": "nm7116161",
      "name": "Linda White",
      "character": "Old Villager"
    },
    {
      "id": "nm6285642",
      "name": "John W Bard",
      "character": "Scary Villager"
    },
    {
      "id": "nm7116162",
      "name": "William Taylor",
      "character": "Villager 1"
    },
    {
      "id": "nm7355271",
      "name": "Hana Kenny",
      "character": "Villager"
    }
  ],
  "overview": "Greg,an unsuccessful screenwriter and Rachel,a beautiful journalist research an outbreak of mass hysteria in a small village. They start to uncover a secret about ergot poisoning that has affected this village for years. But the cult activity has been kept a secret by the locals and when Greg disappears, Rachel is left alone to unravel the mystery and save their lives.",
  "storyline": "Greg,an unsuccessful screenwriter and Rachel,a beautiful journalist research an outbreak of mass hysteria in a small village. They start to uncover a secret about ergot poisoning that has affected this village for years. But the cult activity has been kept a secret by the locals and when Greg disappears, Rachel is left alone to unravel the mystery and save their lives.",
  "plot": "Rachel, a reporter, is surprised when her roommate, Greg, arrives earlier than expected. Greg explains that his unsupportive ex-girlfriend has kicked him out, and he needs a place to stay while he works on his thriller screenplay. Both Greg and Rachel have been drawn to a small town in the Berkshires that is said to have been plagued with repeated cases of ergot poisoning. Greg wants to write a story about an insular town with a dark past, and Rachel believes that ergot poisoning can explain the accusations of witchcraft in the Salem witch trials. However, Rachel's questions upset the townspeople, who are tired of discussions about the town's history. Encouraged by Greg's faith in her, Rachel continues to dig deeper and ask more questions. Eventually, she meets Paul, a friendly townsperson who is willing to speak about the town's history, rumors of ergot poisoning, and a vague conspiracy that involves the town's elders. Paul urges Rachel to be careful, as there are dangerous secrets in the town that people will kill to protect. Unconvinced, Rachel proceeds with her investigation, only to find Paul dead.\n\nWhen Greg disappears, Rachel becomes increasingly worried about her own safety. Her fears are realized when Joe and Jason, local townspeople who have stalked and harassed her, seemingly attempt to kidnap her. She sees Jason intentionally infect younger townspeople with ergot poisoning, and Jim, a friend of Paul's, shows her evidence that the town keeps these sick people imprisoned as suspected witches. Jim promises to show her further evidence of coverups and cult activity, and Rachel contacts her editor to receive more time to investigate these claims. Dubious of her reports, Rachel's editor insists that she stick to the original story and observe the deadline; instead, she works with Jim to expose the cult. When Greg suddenly reappears, she angrily accuses him of abandoning her and explains the danger that they are in. Greg attempts to calm her and suggests that they get dinner; Rachel reluctantly agrees. While she prepares, she sees Greg go through her research and hand it off to Joe. Hurt by this betrayal, she locks Greg out of the house and asks her skeptical editor to contact the police.\n\nUndeterred, Rachel continues her investigations, and Jim takes her on a tour of the house where the town's cult keeps kidnapped victims of ergot poisoning. Before she can do anything to help them, she runs into Joe, who chases her down. Greg helps Joe hold her as Jason injects her with a syringe. Rachel once again tearfully accuses Greg of betrayal and falls unconscious. In the next scene, flashbacks reveal that Rachel has been suffering from ergot poisoning: Paul and Jim are hallucinations, Joe and Jason are concerned townspeople who have been trying to help Rachel, and Greg has agreed to take her to a specialist in New York. On the way to New York, Jim appears to her one last time, asking for her help, but she swallows a pill that causes him to disappear.",
  "synopsis": null
}