{
  "imdb_id": "tt2419284",
  "tmdb_id": "174358",
  "douban_id": null,
  "title": "Red Obsession (2013)",
  "genres": [
    "Documentary",
    "History",
    "News"
  ],
  "country": "Australia",
  "version": [
    {
      "runtime": "75 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.7,
  "director": [
    {
      "id": "nm0730000",
      "name": "David Roach"
    },
    {
      "id": "nm0743916",
      "name": "Warwick Ross"
    }
  ],
  "writer": [
    {
      "id": "nm0730000",
      "name": "David Roach",
      "description": "co-writer"
    },
    {
      "id": "nm0730000",
      "name": "David Roach",
      "description": null
    },
    {
      "id": "nm0743916",
      "name": "Warwick Ross",
      "description": "co-writer"
    },
    {
      "id": "nm0743916",
      "name": "Warwick Ross",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0000128",
      "name": "Russell Crowe",
      "character": "Narrator       (voice)"
    },
    {
      "id": "nm6109031",
      "name": "Sara Eisen",
      "character": "Herself"
    },
    {
      "id": "nm5915895",
      "name": "Debra Meiburg",
      "character": "Herself - Interviewee"
    }
  ],
  "overview": "France’s Bordeaux region has long commanded respect for its coveted wine, but shifts in the global marketplace mean that a new, voracious consumer base in China is buying up this finite product. Bordeaux both struggles with and courts the spike in demand, sending prices skyrocketing. Narrated by Russell Crowe, Red Obsession is a fascinating look at our changing international economy and how an obsession in Shanghai affects the most illustrious vineyards in France.",
  "storyline": "For centuries, Bordeaux has assumed a mythical status in the world of fine wine as a leitmotif of wealth, power and influence, but its prosperity has always been linked to the capricious nature of markets and the shifting fortunes of global economies. Now change is coming to Bordeaux, with traditional customers like the US and the UK falling away, as China's new rich push prices to stratospheric levels. The demand is unprecedented, but the product is finite and this new client wants it all. Will the China market be the bubble that never bursts or the biggest threat yet to Bordeaux's centuries old reputation?",
  "plot": "Red Obsession takes the audience on a journey from Bordeaux to China, where winemakers, wine critics and wine lovers, are interviewed. The trends of the wine industry are also examined, with occasional narration provided by Russell Crowe.",
  "synopsis": null
}