{
  "imdb_id": "tt2467046",
  "tmdb_id": "218043",
  "douban_id": "21324299",
  "title": "Left Behind (2014)",
  "genres": [
    "Action",
    "Drama",
    "Fantasy",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "110 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.1,
  "director": [
    {
      "id": "nm0002184",
      "name": "Vic Armstrong"
    }
  ],
  "writer": [
    {
      "id": "nm0420874",
      "name": "Jerry B. Jenkins",
      "description": "based on novel"
    },
    {
      "id": "nm0481542",
      "name": "Tim LaHaye",
      "description": "based on novel"
    },
    {
      "id": "nm0482510",
      "name": "Paul Lalonde",
      "description": null
    },
    {
      "id": "nm1146036",
      "name": "John Patus",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0000115",
      "name": "Nicolas Cage",
      "character": "Rayford Steele"
    },
    {
      "id": "nm0614877",
      "name": "Chad Michael Murray",
      "character": "Buck Williams"
    },
    {
      "id": "nm2216125",
      "name": "Cassi Thomson",
      "character": "Chloe Steele"
    },
    {
      "id": "nm1764351",
      "name": "Nicky Whelan",
      "character": "Hattie Durham"
    },
    {
      "id": "nm2554052",
      "name": "Jordin Sparks",
      "character": "Shasta Carvell"
    },
    {
      "id": "nm0000670",
      "name": "Lea Thompson",
      "character": "Irene Steele"
    },
    {
      "id": "nm0344196",
      "name": "Gary Grubbs",
      "character": "Dennis Beese"
    },
    {
      "id": "nm2466842",
      "name": "Quinton Aaron",
      "character": "Simon"
    },
    {
      "id": "nm0458514",
      "name": "Martin Klebba",
      "character": "Melvin Weir"
    },
    {
      "id": "nm0035709",
      "name": "Georgina Armstrong",
      "character": "Venice Baxter       (as Georgina Rawlings)"
    },
    {
      "id": "nm2404349",
      "name": "Han Soto",
      "character": "Edwin"
    },
    {
      "id": "nm2302367",
      "name": "Alec Rayme",
      "character": "Hassid"
    },
    {
      "id": "nm4559582",
      "name": "Kamryn Johnson",
      "character": "Katie"
    },
    {
      "id": "nm1751504",
      "name": "Lauren Swinney",
      "character": "Old Lady       (as Laura Swinney)"
    },
    {
      "id": "nm4161282",
      "name": "Major Dodson",
      "character": "Raymie Steele"
    },
    {
      "id": "nm0629634",
      "name": "Lance E. Nichols",
      "character": "Pastor Bruce Barnes"
    },
    {
      "id": "nm0706619",
      "name": "William Ragsdale",
      "character": "Chris Smith"
    },
    {
      "id": "nm2576863",
      "name": "Stephanie Honoré",
      "character": "Kimmy"
    },
    {
      "id": "nm3141330",
      "name": "Lolo Jones",
      "character": "Airport Gate Attendant"
    },
    {
      "id": "nm1885015",
      "name": "Judd Lormand",
      "character": "Jim"
    },
    {
      "id": "nm2082525",
      "name": "Shanna Forrestall",
      "character": "Checkout Lady"
    },
    {
      "id": "nm0312905",
      "name": "Sabrina Gennarino",
      "character": "New Mom"
    },
    {
      "id": "nm3816748",
      "name": "Candice Michele Barley",
      "character": "Eyewitness Mom"
    },
    {
      "id": "nm0566279",
      "name": "John McConnell",
      "character": "Big Man       (as John Mcconnell)"
    },
    {
      "id": "nm3377216",
      "name": "Tom Lawson Jr.",
      "character": "Old Man       (as Tom Lawson)"
    },
    {
      "id": "nm8528403",
      "name": "Kate Walker",
      "character": "Airport Family"
    },
    {
      "id": "nm8528404",
      "name": "Gregory Walker",
      "character": "Airport Family"
    },
    {
      "id": "nm8528405",
      "name": "Cam Bogle",
      "character": "Airport Family"
    },
    {
      "id": "nm4987843",
      "name": "Jon Arthur",
      "character": "Hospital Security Guard"
    }
  ],
  "overview": "A small group of survivors are left behind after millions of people suddenly vanish during the rapture and the world is plunged into chaos and destruction.",
  "storyline": "Left Behind finds commercial airline pilot Ray Steele (Nicholas Cage) struggling to keep his passengers calm and his plane afloat after the Biblical Rapture strikes mid-flight. Meanwhile, GWN reporter Cameron \"Buck\" Williams (Chad Michael Murray) becomes Ray's reluctant co-pilot, and Ray's terrified daughter Chloe (Cassi Thompson) braves the chaos of the city streets in search of her brother and mother..",
  "plot": "University of Central Arkansas student Chloe Steele (Cassi Thomson) has flown in from college to surprise her father, pilot Rayford Steele (Nicolas Cage), for his birthday party. However, her mother Irene quickly calls to inform her that her father cannot make it. While at the airport waiting for him, Chloe meets up with investigative reporter Cameron \"Buck\" Williams (Chad Michael Murray).\n\nRayford shows up on his way to a flight and apologizes to Chloe for missing his birthday party, insisting he was called in to pilot a flight to London at the last minute. He also assures Chloe things are fine between himself and his wife, who recently had become an active believing Christian, much to Chloe's chagrin. Chloe suspects things are not fine between her father and mother – she had seen him flirting with flight attendant Hattie Durham (Nicky Whelan) and notices he has removed his wedding ring. Her suspicions soon are confirmed when an airport worker hands Chloe two hard-to-get U2 concert tickets in London that Rayford had ordered, indicating his trip to London and possible extramarital fling was planned all along.\n\nChloe brushes off another one of her mother's preachings about Christianity and takes her brother to the mall. While there, her brother suddenly vanishes, leaving only his clothes behind. Chloe is shocked and notices this same thing has happened to numerous others at the mall. Mayhem breaks loose as shoppers begin looting the stores. A driver-less car plows through the mall windows, and a small plane without a pilot crashes in the mall parking lot. Chloe sees television reports of children and some adults disappearing, as worldwide panic sets in.\n\nOn Rayford's flight, the same strange event has occurred – several people, including his co-pilot Chris Smith (William Ragsdale), Kimmy (Stephanie Honore), one of the flight attendants, and all the children on board, have simply disappeared, leaving their clothing and personal effects behind. The remaining passengers panic and demand answers. Rayford does his best to reassure the passengers he will pass on information once he has any. Rayford has difficulty getting radio or satellite phone contact with anyone on the ground, until he is finally informed that people have disappeared everywhere and the world is in uproar. Soon a pilot-less jet approaches directly into Rayford's flight path. He narrowly avoids a midair collision, but the jet damages Rayford's fuel line. He decides his only option is to return to New York and hope his fuel holds out.\n\nOn the ground, Chloe hears her father's mayday call on her cell phone and assumes his plane has crashed. She later finds her mother's jewelry left behind in the shower, as she has also disappeared. Chloe makes her way to New Hope Village Church to discover the family pastor Bruce Barnes (Lance E. Nichols) who explains God has taken his believers to heaven, and the rest have to face the end of days. The pastor explains he was not taken because he did not really believe what he had preached. Rayford comes to the same conclusion by examining his copilot and stewardess' personal effects. He tells Hattie the truth about his wife. She is initially upset as she did not know he was married, but Rayford convinces her to be brave and to help calm the passengers down until they can safely land.\n\nChloe climbs to the top of a bridge, intending to jump off it and end her life, when she gets a call from Buck, who is in the cockpit with Rayford. Rayford explains to Chloe all the New York area airports are closed and the streets full, and he is low on fuel and has nowhere to land. Chloe finds an abandoned Ford truck and uses it to clear away the equipment from a bridge under construction in order to create a makeshift runway. She uses her compass app and tells Rayford the coordinates of the landing site. Rayford is able to glide to a rough landing, saving the passengers, who leave the plane only to see the world aflame. Buck mentions that it looks like the end of the world, while Chloe informs him that it is just the beginning.",
  "synopsis": null
}