{
  "imdb_id": "tt2411218",
  "tmdb_id": "312725",
  "douban_id": null,
  "title": "Homebound (2013)",
  "genres": [
    "Drama",
    "Family",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "105 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.9,
  "director": [
    {
      "id": "nm1921620",
      "name": "Fanny Veliz"
    }
  ],
  "writer": [
    {
      "id": "nm1921620",
      "name": "Fanny Veliz",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0145049",
      "name": "Enrique Castillo",
      "character": "Gilberto Escamilla"
    },
    {
      "id": "nm3067438",
      "name": "Jeremiah Ocanas",
      "character": "Richard Lynn Escamilla"
    },
    {
      "id": "nm0893558",
      "name": "Julia Vera",
      "character": "Grandma Escamilla"
    },
    {
      "id": "nm1921620",
      "name": "Fanny Veliz Grande",
      "character": "Sofia       (as Fanny Veliz)"
    },
    {
      "id": "nm2985178",
      "name": "Kedrick Brown",
      "character": "Freddie C"
    },
    {
      "id": "nm5286713",
      "name": "Cristobal Lamas",
      "character": "Sebastian Palumbo"
    },
    {
      "id": "nm1248567",
      "name": "Jessica Lancaster",
      "character": "Julia"
    },
    {
      "id": "nm0721250",
      "name": "Cisco Reyes",
      "character": "Chris"
    },
    {
      "id": "nm5286946",
      "name": "Crystal Armendariz",
      "character": "Caroline"
    },
    {
      "id": "nm3544316",
      "name": "Juanita Chase",
      "character": "Receptionist"
    },
    {
      "id": "nm5286373",
      "name": "Ray Contreras",
      "character": "Police Officer"
    },
    {
      "id": "nm5285728",
      "name": "Dustin Cordoba",
      "character": ""
    },
    {
      "id": "nm4041223",
      "name": "Manuel C Cruz",
      "character": "Jim"
    },
    {
      "id": "nm2881568",
      "name": "Renee DeBevoise",
      "character": "Carla"
    },
    {
      "id": "nm0305469",
      "name": "Yvette Garcia",
      "character": "Bystander"
    },
    {
      "id": "nm4010381",
      "name": "Martina Griffin",
      "character": "Silvia"
    },
    {
      "id": "nm5287733",
      "name": "Audrey Haller",
      "character": "Dolores"
    },
    {
      "id": "nm5287393",
      "name": "Lisa Hernandez",
      "character": "Lisa"
    },
    {
      "id": "nm5285795",
      "name": "Beverly Holik",
      "character": "Martha"
    },
    {
      "id": "nm2361306",
      "name": "John Hoskins",
      "character": "Mr. Young"
    },
    {
      "id": "nm3924482",
      "name": "Angela Imperial",
      "character": "Co-worker"
    },
    {
      "id": "nm0413999",
      "name": "Ron Jackson",
      "character": "Brother Mark"
    },
    {
      "id": "nm3587508",
      "name": "Joshua Lamont",
      "character": "Josh"
    },
    {
      "id": "nm5287633",
      "name": "Alaniz Lee",
      "character": "DJ Lobo"
    },
    {
      "id": "nm4646472",
      "name": "Eva McQuade",
      "character": "Waitress"
    },
    {
      "id": "nm5300679",
      "name": "Santos Luis O'Cañas",
      "character": "Lawyer"
    },
    {
      "id": "nm5286800",
      "name": "Bobby Ocanas",
      "character": "Edgard"
    },
    {
      "id": "nm5287912",
      "name": "Jacob Ocanas",
      "character": "Young Richard Lynn"
    },
    {
      "id": "nm5287521",
      "name": "Irma Rocha",
      "character": "Laura"
    },
    {
      "id": "nm3443563",
      "name": "Brenda Rodriguez",
      "character": "Ana"
    },
    {
      "id": "nm4124976",
      "name": "Renay Rossi",
      "character": "Girlfriend 1"
    },
    {
      "id": "nm5083094",
      "name": "Keith Van Ness",
      "character": "Drunk Man"
    },
    {
      "id": "nm4768887",
      "name": "Matt Vasquez",
      "character": "Jes"
    },
    {
      "id": "nm5306204",
      "name": "Kobie Washington",
      "character": "Kobe"
    }
  ],
  "overview": "A successful young man must return to his childhood small town in Texas to help his father. His father, who's ill, wants him to take over the family business, a dilapidated bar. Secretly the young man wants to burn down the bar because he blames it for the death of his own mother and the illness of his father.",
  "storyline": "A successful young man must return to his childhood small town in Texas to help his father. His father, who's ill, wants him to take over the family business, a dilapidated bar. Secretly the young man wants to burn down the bar because he blames it for the death of his own mother and the illness of his father.",
  "plot": "Kylie, a troubled young woman, attempts to steal the safe from an ATM. Her accomplice knocks himself out while attacking the ATM with a sledgehammer, and, when she is slowed by attempting to save him, the police capture both. Due to her history of recidivism, she is sentenced by the judge to house arrest for eight months under the care of her mother, Miriam. Kylie does not get along with either her mother or her step-father, Graeme, both of whom she considers to be nothing but boring annoyances. A security contractor, Amos, explains that Kylie's ankle monitor will alert the police if she ever leaves the premises of her mother's house.\n\nKylie is further frustrated when Miriam calls a radio talk show and says that her house is haunted. After a disembodied hand grabs her ankle in the basement, Kylie becomes convinced that an intruder is in the house. Amos, responding to an alert from her ankle monitor after it reports tampering, takes Miriam's suggestion of a haunting seriously, much to Kylie's annoyance. Amos promises to return with ghost hunting equipment and perform a thorough examination of the house for free. When Kylie expresses continued skepticism, Amos chides her for having a closed mind.\n\nAfter a series of unexplained experiences, including repeatedly encountering the same animatronic teddy bear, Kylie comes to believe that there may be a ghost in the house. Dennis, a clinical psychologist assigned to Kylie, becomes concerned with what he believes to be possible delusions in both Miriam and Kylie. After reviewing footage from security cameras, Amos does not believe her reports and accuses her of lying. However, once Graeme reveals to Kylie that their home was once a halfway house and the site of a horrific murder, Amos once again becomes interested. As they investigate further, they discover evidence of the crime, including an orthodontic retainer. During a visit, a blackout occurs, and Dennis is attacked by an unknown assailant. The police are skeptical of Miriam's insistence that a ghost is responsible, but they do not push any further.\n\nWhen Kylie and Amos discover that her neighbour uses a retainer, Kylie breaks into the man's house and wakes him as she attempts to take his retainer. After she flees back to the family's home and hides in the basement, Kylie panics when she believes the neighbour to be stalking her, and she accidentally stabs Graeme, who has also entered the basement. As Graeme recuperates in the hospital, Amos in turn attempts to break into her neighbour's house. The neighbour says that he is not the killer, and he tells the story of a young savant, Eugene, whom he adopted. Eugene is an expert at mechanics and electronics, and he disappeared a year previous to the killing, though the neighbour believes him to be possibly responsible.\n\nAt the same time, Kylie accidentally discovers Eugene's secret hallways in their house, and she flees. Kylie and Amos separately converge at the police station, and Amos corroborates her wild stories of a serial killer who lives in hidden passageways. However, the police find no evidence, and Dennis convinces all involved that it would be best if Kylie were institutionalized. Once Dennis reveals that he wears a retainer, Kylie becomes suspicious of him. When she confronts him with evidence that he was an intern at the halfway house, he turns hostile and attempts to kill Miriam and Kylie. He kills a policeman. When Amos arrives at the house, Dennis incapacitates him. Kylie and Miriam flee into the secret tunnels, where they encounter Eugene.\n\nRealizing that their paranormal activity has been Eugene all this time, they are at first frightened but realize that he is friendly. Dennis stabs Eugene, and, after an extended hunt that results in Dennis' presumed death, he knocks out Kylie and begins to strangle Miriam. Eugene wakes Kylie and hands her a weapon, which she uses to stab Dennis. As Dennis sees that the weapon is connected to a long cable, Eugene throws a switch, and high voltage explodes Dennis' head. Months later, all have recovered, Amos finally removes Kylie's ankle monitor, and Eugene has seemingly become an accepted (albeit mostly unseen) member of the household.",
  "synopsis": null
}