{
  "imdb_id": "tt2409818",
  "tmdb_id": "151368",
  "douban_id": "19974285",
  "title": "Open Windows (2014)",
  "genres": [
    "Crime",
    "Horror",
    "Thriller"
  ],
  "country": "Spain",
  "version": [
    {
      "runtime": "100 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.2,
  "director": [
    {
      "id": "nm1443023",
      "name": "Nacho Vigalondo"
    }
  ],
  "writer": [
    {
      "id": "nm1443023",
      "name": "Nacho Vigalondo",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0000704",
      "name": "Elijah Wood",
      "character": "Nick Chambers"
    },
    {
      "id": "nm2340248",
      "name": "Sasha Grey",
      "character": "Jill Goddard"
    },
    {
      "id": "nm0556453",
      "name": "Neil Maskell",
      "character": "Chord"
    },
    {
      "id": "nm1971513",
      "name": "Adam Quintero",
      "character": "Pierre - Triop #1"
    },
    {
      "id": "nm0328223",
      "name": "Iván González",
      "character": "Tony"
    },
    {
      "id": "nm4298578",
      "name": "Jaime Olías",
      "character": "Dave"
    },
    {
      "id": "nm5177653",
      "name": "Jake Klamburg",
      "character": "Triop #3       (as Jake S. Klamburg)"
    },
    {
      "id": "nm0701999",
      "name": "Daniel Pérez Prada",
      "character": "Triop #2       (as Dani Pérez Prada)"
    },
    {
      "id": "nm1017538",
      "name": "Rachel Arieff",
      "character": "Carol"
    },
    {
      "id": "nm1043338",
      "name": "Michelle Jenner",
      "character": "Possessed #1"
    },
    {
      "id": "nm1253636",
      "name": "Julián Villagrán",
      "character": "Possessed #2"
    },
    {
      "id": "nm1693112",
      "name": "Carlos Areces",
      "character": "Watchman"
    },
    {
      "id": "nm1832683",
      "name": "Raúl Cimas",
      "character": "Survivor"
    },
    {
      "id": "nm3983536",
      "name": "Miguel Noguera",
      "character": "Man on TV"
    },
    {
      "id": "nm1443023",
      "name": "Nacho Vigalondo",
      "character": "Richy Gabilondo"
    },
    {
      "id": "nm0227259",
      "name": "Richard Diment",
      "character": "Audience #1"
    },
    {
      "id": "nm1079001",
      "name": "Eugenio Mira",
      "character": "Audience #2"
    },
    {
      "id": "nm3188016",
      "name": "Nancy Yao",
      "character": "News Reader #1"
    },
    {
      "id": "nm2082561",
      "name": "Luis Sanchez-Cañete",
      "character": "News Reader #2"
    }
  ],
  "overview": "Nick is excited to discover that he's won a dinner date with his favorite actress, Jill Goddard. But when Jill refuses to honor the contest, he receives an offer he can't refuse: the ability to view Jill secretly via computer. Nick begins watching the unknowing star on her webcam, not realizing that this decision will put both himself and Jill at risk as they enter a terrifying world of cat-and-mouse where nothing-and no one-are as they seem.",
  "storyline": "An actress named Jill refuses to have dinner with Nick, a fan who won a date with her in an Internet contest. In return, a guy named Chord, posing as Jill's campaign manager, helps Nick to follow in the footsteps of the actress from his own computer. Nick starts a game in which he realizes that he is only a puppet into the maniacal plans devised by Chord, to hunt down the star.",
  "plot": null,
  "synopsis": "Winning an online contest with the prize of dinner with his favorite actress, Jill Goddard, Nick prepares himself in his hotel room. A man naming himself Chord informs him that Jill cancelled the dinner for no reason and sends him hacked live streams on Jill, saying that this would compensate him. Coincidentally Jill is meeting her secret lover Tony at Nick's hotel, so Chord hacks Nick's camera to view their room. Suddenly, the lights in Nick's room all go on, and Tony happens to spot the camera. Suspicious, he calls the hotel's customer service office who tells him the room number, that it's unoccupied, and they can give him a spare keycard to check it out. Tony does so, and heads to Nick's room, Chord guides Nick to knock Tony out with a taser, tie him up, and get out of the hotel. A French hacker team, Triops, contacts Nick, thinking he is the notorious master hacker, Nevada. Confused, Nick ignores them. Chord starts to threaten Nick, showing he has video footage of Nick knocking Tony unconscious, and that the contest Nick won was all a hoax; he also says that he'll hurt Jill if Nick doesn't do what he says. Chord directs Nick to near Jill's house, showing he's nearby and able to kill her, in order to force Nick to send a hack that will allow him to communicate with Jill through her laptop. From there, Chord has the unconscious Tony as a hostage, and zaps him with increasing electric shocks to force Jill to strip, using Nick to relay his commands.When Triops contacts again revealing their faces, Nick asks them to peek into his laptop and they cut the connection from Chord to Nick. Chord storms in and kidnaps Jill. Nick and Triops searches for Chord and find that Chord is actually Nevada, whom Triops were to help. This puts a strain among the Triops members, whose loyalties are now torn, partially because Nevada has done a lot of anarchist/revolutionary hacker activity but has never brought anyone to harm. But Triops gets back to helping Nick after he threatens to spread their faces to the police. They lead Nick to follow Chord's car which later gets into an accident, with Jill in the trunk. Nick is chased by police cars, and he also crashes. A video feed at Nevada's servers shows that Chord and Nevada are actually two different persons and that Chord tricked and killed Nevada to get his servers and get revenge on Jill for her philandering behavior. Chord goes to Nick's car and kills him. He then streams a live feed on Jill, who is bound and gagged with a time bomb set in an abandoned factory, which attracts millions of visitors. Chord says he'll stop the bomb if more than fifty percent of the viewers leave the site. The bomb explodes in time as fewer than ten percent do so.It turns out that Chord faked Jill's death, but still intends to kill her for real. Chord tells Jill he showed her how the world views her. Jill persuades Chord to make a good ending on it, but uses her chance to escape. It is futile as Chord easily recaptures her and ties her up again. But then Chord receives a call. It's actually Nevada, still alive and angry at him. Nevada shows that he was wearing a bulletproof vest as standard procedure, so he survived Chord's assassination attempt, and overheard Chord say he intends to make Nick's website the most popular ever. Nevada easily tracked Nick down and has been impersonating him to find Chord. Nick is still alive, so Chord runs out of his hideout to check Nick's car. Nevada reveals that he's used a recording to lure Chord out while he frees Jill and sets the place on fire as Chord goes back in. Chord dies in the fire as they escape through a bunker.Jill watches internet news reports showing that the world thinks she is dead. When Nevada tells her that he intends to disappear back into the underground hacker movement, she asks what's in it for her if she doesn't talk about him. As if answering her, the news report mentions that in the wake of her supposed death, advance ticket sales for her upcoming movie are skyrocketing. Satisfied, and since the world believes she is dead, Jill asks to go with Nevada and for him to help her disappear as well."
}