{
  "imdb_id": "tt2414766",
  "tmdb_id": "218425",
  "douban_id": null,
  "title": "Frequencies (2013)",
  "genres": [
    "Mystery",
    "Romance",
    "Sci-Fi"
  ],
  "country": "Australia",
  "version": [
    {
      "runtime": "105 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm0279441",
      "name": "Darren Paul Fisher"
    }
  ],
  "writer": [
    {
      "id": "nm0279441",
      "name": "Darren Paul Fisher",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm2200824",
      "name": "Daniel Fraser",
      "character": "Zak"
    },
    {
      "id": "nm2284961",
      "name": "Eleanor Wyld",
      "character": "Marie"
    },
    {
      "id": "nm4099580",
      "name": "Owen Pugh",
      "character": "Theo"
    },
    {
      "id": "nm3780043",
      "name": "Dylan Llewellyn",
      "character": "Teen Zak"
    },
    {
      "id": "nm2814113",
      "name": "Georgina Minter-Brown",
      "character": "Teen Marie"
    },
    {
      "id": "nm4100967",
      "name": "Tom England",
      "character": "Teen Theo"
    },
    {
      "id": "nm4100867",
      "name": "Charlie Rixon",
      "character": "Child Zak"
    },
    {
      "id": "nm4100318",
      "name": "Lily Laight",
      "character": "Child Marie"
    },
    {
      "id": "nm4100765",
      "name": "Ethan Turton",
      "character": "Child Theo"
    },
    {
      "id": "nm2421514",
      "name": "David Broughton-Davies",
      "character": "Strauss"
    },
    {
      "id": "nm0694110",
      "name": "Emma Powell",
      "character": "Miss. Anderson"
    },
    {
      "id": "nm1409895",
      "name": "David Barnaby",
      "character": "Mr. Fortune"
    },
    {
      "id": "nm3169669",
      "name": "Doris Zajer",
      "character": "Mrs. Fortune"
    },
    {
      "id": "nm0088772",
      "name": "Timothy Block",
      "character": "Bridges"
    },
    {
      "id": "nm3863132",
      "name": "Ria Carroll",
      "character": "Nicola Tesla"
    },
    {
      "id": "nm4348191",
      "name": "Katherine Moran",
      "character": "Teen Nicola Tesla       (as Kayti Moran)"
    },
    {
      "id": "nm4100950",
      "name": "Jasmine San",
      "character": "Child Nicola Tesla"
    },
    {
      "id": "nm1701574",
      "name": "Gareth Llewelyn",
      "character": "Thomas Edison"
    },
    {
      "id": "nm3239109",
      "name": "Freddie Rose",
      "character": "Child Thomas Edison"
    },
    {
      "id": "nm7293889",
      "name": "Drew Blackall",
      "character": "Child Leonardo"
    },
    {
      "id": "nm3531913",
      "name": "Elizabeth Webster",
      "character": "Mrs. Cook"
    },
    {
      "id": "nm0390417",
      "name": "Joanna Hole",
      "character": "Headmistress"
    },
    {
      "id": "nm7120358",
      "name": "Iain Batchelor",
      "character": "Mr. Thales"
    },
    {
      "id": "nm1801680",
      "name": "Carolyn Tomkinson",
      "character": "Mrs. Midgeley"
    },
    {
      "id": "nm3185399",
      "name": "Scarlett Murphy",
      "character": "Pupil #1"
    },
    {
      "id": "nm7293890",
      "name": "Hannah Murphy",
      "character": "Pupil #2"
    },
    {
      "id": "nm3239842",
      "name": "Andrew Ashford",
      "character": "Agent #1"
    },
    {
      "id": "nm4100747",
      "name": "Simon Yadoo",
      "character": "Agent #2"
    },
    {
      "id": "nm2991307",
      "name": "Jim Conway",
      "character": "Agent #3"
    },
    {
      "id": "nm7293888",
      "name": "Lucy Conway",
      "character": "Shop Assistant"
    },
    {
      "id": "nm7204185",
      "name": "Rory Kilalea",
      "character": "Doctor"
    },
    {
      "id": "nm0669460",
      "name": "Gordon Peaston",
      "character": "Panel Member #1"
    },
    {
      "id": "nm1041863",
      "name": "Mario Vernazza",
      "character": "Panel Member #2"
    },
    {
      "id": "nm7293893",
      "name": "Beth Cohl",
      "character": "Panel Member #3"
    },
    {
      "id": "nm7293892",
      "name": "Ned Berry",
      "character": "Angry Man"
    },
    {
      "id": "nm7293891",
      "name": "Lucy Fisher",
      "character": "Patient Woman"
    },
    {
      "id": "nm7293894",
      "name": "Katja Mackintosh",
      "character": "Smiling Girl"
    },
    {
      "id": "nm4926588",
      "name": "Francisco De Negri",
      "character": "Reading Man"
    },
    {
      "id": "nm7293895",
      "name": "Momo Assaad Taha",
      "character": "Male Customer"
    },
    {
      "id": "nm3685246",
      "name": "Beth Bainbridge",
      "character": "Female Customer       (as Beth Wignall)"
    }
  ],
  "overview": "Frequencies (aka OXV: THE MANUAL) is being billed as the world's first Scientific-Philosophical romance. Boy meets girl in a not-quite-here, not-quite-now world where one simple discovery has forever changed all human interaction. The film could perhaps best be described as a combination of 'Eternal Sunshine of the Spotless Mind', '(500) Days of Summer' and 'Primer'.",
  "storyline": "In an alternate reality, children learn how lucky they will be (their \"frequency\"), knowledge which shapes their destiny. The unluckiest boy must parse the mysteries of free will in order to pursue his forbidden love of the luckiest girl.",
  "plot": "In October 1969, firefighter Frank Sullivan (Quaid) dies in a warehouse fire, leaving behind his wife Julia (Elizabeth Mitchell) and six-year-old son John. Thirty years later, in 1999, John (Caviezel), now an NYPD detective, is dumped by his girlfriend Samantha for refusing to move out of his father's house. John's childhood friend Gordo (Noah Emmerich) finds a Heathkit single-sideband ham radio that once belonged to Frank, but fails to get it working. The night before the anniversary of his father's death, John is surprised to find the radio broadcasting during an occurrence of the aurora borealis and has a brief conversation with another man concerning the 1969 World Series, which John is able to recount in specific detail. Eventually, he realizes that the other man is Frank and tries to warn him of his impending death. The next day, while attempting to rescue a young girl, Frank heeds his son's warning and manages to escape the warehouse. That evening, the two reconnect and learn a great deal about each other's lives.\n\nSubsequently, John begins to notice major changes in the present: His mother Julia no longer lives at her current address, Samantha doesn't recognize him, and he learns that Frank died in 1989 from lung cancer. His boss, Sgt. Satch DeLeon (Andre Braugher), assigns him to investigate the \"Nightingale\", a serial killer who murdered three nurses in the 1960s. However, John discovers that the Nightingale is now connected to ten murders, including that of his mother two weeks after Frank's now-avoided death. Feeling guilty that their actions somehow led to the Nightingale committing more murders, John persuades his father to help him prevent these crimes from occurring. Frank manages to save the first victim. But when he tries to rescue the second, the Nightingale subdues him, steals his driver's license, and plants it on the victim to frame Frank for the murder.\n\nWhen Frank shares his experience with his son, John realizes Frank's wallet has the Nightingale's fingerprints. John instructs his father to wrap his wallet in plastic and hide it somewhere in the house where John can find it 30 years later. Using the preserved fingerprints from the wallet, John identifies the Nightingale as Jack Shepard (Shawn Doyle), a former detective. In the original timeline, Shepard died from a medical error the same night Frank died. But since, in the new timeline, Julia didn't leave the hospital early after learning of Frank's death, she was at the hospital and prevented the error that would have killed Shepard. Meanwhile, Frank is approached by then-Detective Satch DeLeon who tries to arrest him on suspicion of murder. In the resulting struggle, the radio is knocked over and sustains damage, shutting it off. While awaiting questioning, Frank activates the precinct's fire sprinkler system, escapes, and breaks into Shepard's apartment, where he finds jewelry taken from the victims. Shepard catches Frank in the act and pursues him, ending with a fight underwater where Frank appears to have killed Shepard.\n\nFrank fixes the radio, but while talking both he and John are attacked by the 1969 and 1999 versions of Shepard. Using a shotgun, Frank manages to blow off Shepard's right hand in 1969, causing Shepherd's hand to disappear in 1999 just as he's about to kill John. The timeline rapidly fixes itself in 1999 and an elderly Frank kills Shepard and embraces his son. The film concludes with a baseball game including John, Samantha (now his wife), John's young son, Frank, Julia, Satch and Gordo, who's now wealthy on account of having invested in Yahoo! on John's advice.",
  "synopsis": "Imagine that your destiny and ability to succeed in life is actually determined by a certain personal frequency that can never be changed. Imagine also that there was a definite way of determining that frequency at a very young age, thus sealing your fate forever as either a success or a failure.During testing, little Marie (Eleanor Wyld) is discovered to have an impossibly high frequency, making her the luckiest girl in the world. At the same testing, Zak (Daniel Fraser) is discovered to have a frequency so low, it measures as a negative number.Zak feels a certain connection to Marie, and subsequently falls in love with her, while Marie, besides being very curious about Zak and being interested in the results of an ultra high and ultra low frequency interaction, does not have any feelings for him whatsoever. In fact, due to the \"side effect\" of a high frequency, she has no emotional feelings at all. \"The higher someone's frequency, the less capable they are of appreciating it.\" But, nonetheless, she initiates a series of experiments, though they never last beyond one minute without something bad happening to Zak.Therefore, Zak is desperate to raise his frequency so as to be with Marie, who is herself also earnestly desiring to experience emotion, both of which are considered complete impossibilities. But Zak is determined to find a way. With the help of his higher frequencied friend, Theo (Owen Pugh), he devotes his life to cracking this mystery.After many years, they finally make an immense breakthrough, managing to raise Zak's frequency, at least for short periods at a time. He can finally spend more than a minute with his beloved Marie, as well as offer her the chance to at last be able to feel empathy and emotion. With a touch, a kiss, and some prolonged exposure, the experiment is a success. Not only can Marie feel emotion, but for the first time in her life she is truly happy... and in love, with the man who has always loved her.When she brings him home to her parents, though her mother is skeptical, her father is bursting with joy, not only that his daughter is finally happy, but with the excitement of this new invention that is poised to change the world, level the playing field, and even bring an end to war and poverty! But upon further investigation, it turns out this device is not only a frequency balancer, but is in fact capable of mind control. This comes as a shock, not only to Marie and her parents, but even more so to Zak. As a result, everyone turns on him, especially his beloved Marie, who feels that he has in fact brainwashed her to love him.How will he explain? Will Marie and her family ever forgive him? Will Marie ever love him genuinely?"
}