{
  "imdb_id": "tt2489308",
  "tmdb_id": "183336",
  "douban_id": null,
  "title": "A.C.A.B. All Cats Are Brilliant (2012)",
  "genres": [
    "Drama"
  ],
  "country": "Greece",
  "version": [
    {
      "runtime": "88 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.3,
  "director": [
    {
      "id": "nm2840240",
      "name": "Constantina Voulgaris"
    }
  ],
  "writer": [
    {
      "id": "nm2840240",
      "name": "Constantina Voulgaris",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm3200381",
      "name": "Maria Georgiadou",
      "character": "Ilektra"
    },
    {
      "id": "nm2018407",
      "name": "Dimitris Xanthopoulos",
      "character": "Manousos"
    },
    {
      "id": "nm0063274",
      "name": "Themis Bazaka",
      "character": "Mother"
    },
    {
      "id": "nm0681287",
      "name": "Dimitris Piatas",
      "character": "Father"
    },
    {
      "id": "nm2678122",
      "name": "Kostas Ganotis",
      "character": "Argyris"
    },
    {
      "id": "nm5347192",
      "name": "Alexis Harisis",
      "character": "Petros"
    },
    {
      "id": "nm9530477",
      "name": "Mike Mpogeas",
      "character": "Anarchist"
    },
    {
      "id": "nm6698363",
      "name": "George Psomiadis",
      "character": "Police Officer"
    }
  ],
  "overview": "Director’s statement: “Electra is in her early 30s, living in Athens today. She is an artist, but she makes a living working as a babysitter. She is an activist and her boyfriend is a political prisoner. She feels lonely and is struggling to find her place in the world. We follow her as she meets the most important people in her life. Through these meetings, we understand better not only Electra, but also a whole generation of young people who feel stifled in this world. Capitalism, consumerism, globalization are currently being cast into doubt, so I needed to make a film that addresses all these things. What I’m interested in is showing how they affect our everyday life, our small decisions, our intimate relationships.”",
  "storyline": "A.C.A.B. ALL CATS ARE BRILLIANT follows Electra, a 30-something non-conformist who has a jailed anarchist for a boyfriend, reformed hippies for parents and considers the eight year-old boy she babysits as her best friend.",
  "plot": "Main article: List of Saga story arcs\nEach issue of Saga is titled with a numerical Chapter, such as \"Chapter 1\" for the debut issue. Every six chapters comprise a story arc designated as a \"Volume\" and are reprinted as trade paperbacks. Every three Volumes comprise a \"Book\" and are collected as hardcover editions.\n\nThe opening Volume introduces the series' leads, Alana and Marko, two lovers from different worlds whose people are at war with one another. Alana comes from the technologically advanced Landfall Coalition, so named after Landfall, the largest planet in the galaxy, and Marko is from Wreath, Landfall's only satellite, whose people wield magic. Because the destruction of one of the worlds would send the other spinning out of orbit, the war was \"outsourced\" to other worlds. Although peace was restored on the two home worlds, the conflict spread across all the other known planets, whose native species were forced to choose a side. As Landfall and Wreath were on opposite sides, Alana and Marko met when she was assigned to guard him in a prison on the planet Cleave after he became a prisoner of war. They escaped together twelve hours after meeting. In the beginning of the series' first issue, Alana gives birth to their daughter, Hazel, who occasionally narrates the series. Their respective peoples are incredulous when it is suggested that they have voluntarily mated and they are pursued by both the Wreathers and the Landfallians, both because of the perceived betrayal of the two fugitives and to prevent knowledge of their pairing from spreading and damaging morale among their troops. On Landfall, Prince Robot IV is assigned by his father to capture him and comes into conflict with his counterpart from Wreath, a mercenary named The Will. The ghost of a dead girl named Izabel is bonded to Hazel and the four of them escape Cleave before being joined by Marko's parents.\n\nIn the second Volume, more is revealed about Marko's parents and his upbringing and his initial time with Alana. Marko's ex-fiancée, Gwendolyn, joins The Will's hunt as does a six-year-old sex slave rescued by The Will and Gwendolyn who takes the name Sophie. The family later takes refuge at the home of writer D. Oswald Heist (the author of Alana's favorite novel), where they first come into contact with Prince Robot IV.\n\nThe third Voume, beginning in August 2013, which Vaughan intended as a \"big tonal shift\", introduces the tabloid journalists Upsher and Doff, as they pursue their own investigation of Alana and Marko, who take refuge at the lighthouse home of author D. Oswald Heist. There, the family first comes into direct contact with, and manages to escape from, Prince Robot IV and Gwendolyn. By the end of the story, Hazel has begun to walk, and Upsher and Doff have been silenced by contract killer The Brand, The Will's sister, using a substance that will kill them if they report their findings about the family to anyone else.\n\nThe fourth Volume, which begins Book Two, establishes the family living on the planet Gardenia, with Alana acting in an underground entertainment program called the Open Circuit in which all the actors wear masks. She secured this employment through Yuma, Heist's ex-wife. Hazel is now speaking in simple phrases, while Prince Robot IV's son is born. A disgruntled robot janitor, Dengo, kills Prince Robot IV's wife, kidnaps his infant son and journeys to Gardenia, where he kidnaps the family. Marko and Prince Robot IV team up with Yuma to pursue them. Meanwhile, The Brand teams with Gwendolyn and Sophie to acquire an elixir to heal The Will's injuries.\n\nThe fifth Volume begins three months later. The family's rocketship has set down in a frozen region of a planet, where Dengo meets with members of The Last Revolution, a radical anti-war group, who wish to use Hazel as a pawn in their campaign against Landfall and Wreath. Meanwhile, as Marko and Prince Robot IV struggle to maintain their alliance while in pursuit of their kidnapped loved ones, Alana and Yuma both deal with the consequences of their use of the drug Fadeway. By the end of the arc, Dengo has turned on the revolutionaries, but is himself killed by Prince Robot IV, who is united with his son. Marko and Alana are reunited, but Hazel and Klara are relegated to a Landfallian prison. The Brand, Gwendolyn and Sophie have acquired the elixir, but the Brand was killed in the process.\n\nIn the sixth Volume, Alana and Marko search for Hazel and Klara, who remain incarcerated in a detention center on Landfall. Upsher and Doff resume their investigation of the couple after hearing of The Brand's death. The journalists are confronted by The Will, who has resumed his vendetta against Prince Robot IV. Meanwhile, Price Robot is using the name Sir Robot and is raising his rapidly growing son, Squire. New characters introduced include Hazel's sympathetic schoolteacher Noreen and a transgender female prisoner, Petrichor. The arc closes with Hazel successfully reunited with her parents and the revelation that Alana is once again pregnant.\n\nThe seventh Volume—\"The War for Phang\"—began with issue 37 and was released on August 31, 2016. It is the beginning of Book Three of the series, and as indicated by its title, Sophie's home, the comet Phang, will be a central setting. The family deals with the addition of Petrichor to the reunited family, and Alana's second pregnancy.",
  "synopsis": null
}