{
  "imdb_id": "tt2494280",
  "tmdb_id": "227300",
  "douban_id": null,
  "title": "Stretch (2014)",
  "genres": [
    "Comedy",
    "Crime"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm0138620",
      "name": "Joe Carnahan"
    }
  ],
  "writer": [
    {
      "id": "nm0138620",
      "name": "Joe Carnahan",
      "description": "screenplay"
    },
    {
      "id": "nm0179971",
      "name": "Jerry Corley",
      "description": "story &"
    },
    {
      "id": "nm3911112",
      "name": "Rob Rose",
      "description": "story and"
    },
    {
      "id": "nm0138620",
      "name": "Joe Carnahan",
      "description": "story"
    }
  ],
  "cast": [
    {
      "id": "nm0933940",
      "name": "Patrick Wilson",
      "character": "Stretch"
    },
    {
      "id": "nm1159180",
      "name": "Ed Helms",
      "character": "Karl"
    },
    {
      "id": "nm0197647",
      "name": "James Badge Dale",
      "character": "Laurent"
    },
    {
      "id": "nm2395937",
      "name": "Brooklyn Decker",
      "character": "Candace"
    },
    {
      "id": "nm0004695",
      "name": "Jessica Alba",
      "character": "Charlie"
    },
    {
      "id": "nm0000501",
      "name": "Ray Liotta",
      "character": "Himself"
    },
    {
      "id": "nm0001327",
      "name": "David Hasselhoff",
      "character": "Himself"
    },
    {
      "id": "nm2626488",
      "name": "Jennifer Barbosa",
      "character": "Restaurant Patron"
    },
    {
      "id": "nm3707003",
      "name": "Kevin Bigley",
      "character": "Faux Hawk"
    },
    {
      "id": "nm4535518",
      "name": "Mindy Robinson",
      "character": "The Jovi's Girl"
    },
    {
      "id": "nm0004554",
      "name": "Ben Hernandez Bray",
      "character": "Ignacio       (as Ben Bray)"
    },
    {
      "id": "nm6356668",
      "name": "Sydney Bruso",
      "character": "Girl #2"
    },
    {
      "id": "nm3016924",
      "name": "Zach Calig",
      "character": "Honeymoon Husband       (as Zachary Calig)"
    },
    {
      "id": "nm6828781",
      "name": "Tiffany Calig",
      "character": "Honeymoon Wife"
    },
    {
      "id": "nm3305680",
      "name": "Woody Carnahan",
      "character": "Clark Hanna       (as John Carnahan)"
    },
    {
      "id": "nm1330276",
      "name": "Randy Couture",
      "character": "The Jovi"
    },
    {
      "id": "nm0198502",
      "name": "Rad Daly",
      "character": "Fed #1 /              Tweaker"
    },
    {
      "id": "nm0200034",
      "name": "Max Daniels",
      "character": "Paparazzo 2"
    },
    {
      "id": "nm8554022",
      "name": "Gary Falco",
      "character": "Valet #2"
    },
    {
      "id": "nm0271988",
      "name": "Nick Fenske",
      "character": "Paparazzo 1"
    },
    {
      "id": "nm0272961",
      "name": "Eddie J. Fernandez",
      "character": "Store Clerk       (as Eddie Fernandez)"
    },
    {
      "id": "nm0319831",
      "name": "Sandra Lee Gimpel",
      "character": "Old Woman       (as Sandra Gimpel)"
    },
    {
      "id": "nm2200632",
      "name": "Matthew Willig",
      "character": "Boris"
    },
    {
      "id": "nm1476524",
      "name": "Ahman Green",
      "character": "Security Guard"
    },
    {
      "id": "nm1194663",
      "name": "Jacqui Holland",
      "character": "Hooker #1"
    },
    {
      "id": "nm0869467",
      "name": "Shaun Toub",
      "character": "Nasseem"
    },
    {
      "id": "nm2129123",
      "name": "Christopher Michael Holley",
      "character": "Caesar"
    },
    {
      "id": "nm2077124",
      "name": "Keith Jardine",
      "character": "Burly Doorman"
    },
    {
      "id": "nm1661634",
      "name": "Erika Jordan",
      "character": "Hooker #3"
    },
    {
      "id": "nm4801670",
      "name": "Katie Kerr",
      "character": "Marcy"
    },
    {
      "id": "nm4525810",
      "name": "Kendall Lake",
      "character": "Girl #3"
    },
    {
      "id": "nm2267294",
      "name": "Claire Lanay",
      "character": "Girl #1"
    },
    {
      "id": "nm1727621",
      "name": "Jason Mantzoukas",
      "character": "Manny the Valet"
    },
    {
      "id": "nm8554023",
      "name": "Mona Marandi",
      "character": "Naseem's Wife       (as Mona Marandy)"
    },
    {
      "id": "nm1645352",
      "name": "Ryan O'Nan",
      "character": "Hudack /              Masked Valet"
    },
    {
      "id": "nm0675894",
      "name": "P.J. Pesce",
      "character": "Enzo"
    },
    {
      "id": "nm0709835",
      "name": "Mike Randleman",
      "character": "Bystander"
    },
    {
      "id": "nm0005342",
      "name": "Norman Reedus",
      "character": "Norman Reedus"
    },
    {
      "id": "nm5361470",
      "name": "Monique Brock",
      "character": "Hooker #2       (as Monique Rock)"
    },
    {
      "id": "nm2286347",
      "name": "Regalia Thomas",
      "character": "Cameo #1"
    },
    {
      "id": "nm3647004",
      "name": "Chris Waters",
      "character": "Clipboard Holder"
    },
    {
      "id": "nm1027039",
      "name": "Shaun White",
      "character": "Cameo #3"
    },
    {
      "id": "nm2307223",
      "name": "Kaleti Williams",
      "character": "Samoan"
    },
    {
      "id": "nm1621050",
      "name": "Rick Yudt",
      "character": "Doorman"
    },
    {
      "id": "nm8813634",
      "name": "Nancy Tran",
      "character": "Club Patron"
    }
  ],
  "overview": "A hard-luck limo driver struggling to go straight and pay off a debt to his bookie takes on a job with a crazed passenger whose sought-after ledger implicates some seriously dangerous criminals.",
  "storyline": "A hard-luck limo driver struggles to go straight and pay off a debt to his bookie. He takes on a job with a crazed passenger, whose sought-after ledger implicates some seriously dangerous criminals.",
  "plot": "A man nicknamed Stretch is thrown out of his car after a traffic accident in which the other driver, Candace, ignores a red light. Miraculously uninjured, he confronts Candace, only to fall instantly in love with her. A year later, Stretch is inspired to give up his addictions to cocaine and gambling. As Stretch considers proposing to her, Candace abruptly tells him that she wants to break up. Hurt by the sudden rejection, Stretch's life spirals into self-destruction and failure, which he blames on Candace. A failed actor, he works in Los Angeles as a limo driver. Though he has quit gambling, he retains a $6000 debt to Ignacio, who demands the debt be paid by midnight. At the same time, Stretch begins hallucinating the bitter ghost of another failed actor and limo driver named Karl, who committed suicide in front of a customer.\n\nHis boss, Naseem, calls him to his office and tells him that their chief competitor, a mysterious man known only as The Jovi, has been stealing their clients. Unless they can steal clients away from The Jovi, Naseem will be forced to fold his business. Although unsure how he will retain his job or pay back his debts, Stretch takes time to set up a blind date with a woman from an online dating site. At the same time, he begs Charlie, a sympathetic employee, to direct any high-paying customers his way. When The Jovi steals his first client, actor David Hasselhoff, Charlie sends Stretch to intercept one of The Jovi's clients, Ray Liotta. Liotta tasks Stretch with returning a pistol and prop badge, but before he can do so, Charlie sends him another client, Roger Karos, an eccentric playboy with a reputation for extremist hedonism. Karos parachutes down naked to the arranged location and offers to pay Stretch's gambling debt if he serves without question.\n\nAs Stretch drives Karos to exclusive nightclubs and hotspots of dubious legality, Karl berates him for putting himself at increasing risk, both personally and legally, for such a small sum of money. Karos' final destination is a secretive sex club. Karos gives Stretch 100 minutes to return to the sex club with an important briefcase and a supply of cocaine. When Stretch attempts to retrieve the briefcase, he learns from Laurent, a French blackmailer, that Karos has promised to trade a ledger for the contents of the briefcase. Using Liotta's props, Stretch successfully cons Laurent and his men into believing that he is a police officer, and they surrender the briefcase. As he leaves the nightclub, he sees Candace and nonchalantly insinuates that he is both successful and important now. When Candace expresses interest in him, he turns her down. Unimpressed, Karl continues to harangue him for his inadequacies.\n\nStretch procures the cocaine from a reality television star, who then steals the limo. Meanwhile, Liotta complains to Naseem, who fires Stretch. Undeterred, Stretch reacquires the limo, which has been trashed, only to lose it to The Jovi's brother, Boris, who operates a tow truck. Stretch once again retrieves the limo, though it has been reported as stolen. Stretch fast talks the security system operator into believing that he is a cop whose life is on the line during a gunfight, and he returns to Karos, who complains that he is a minute late. Ignacio also complains that he is late in his payment, and Stretch instructs Ignacio to meet him at Karos' destination. There, Karos abandons Stretch to The Jovi and Boris, though Ignacio intercedes. Laurent, revealed to be an American cop, also appears and arrests Karos, who is wanted for embezzlement. As Karos prepares to kill Laurent in a sneak attack, Stretch creates a diversion, saves Laurent's life, and escapes.\n\nLater, at a diner, Stretch gives the ledger to Laurent, who declines to arrest him and compliments his acting skills. As Stretch looks around the diner, he realizes that he has ended up at the meeting point he set up with his blind date. He is surprised to find that the woman is there; when she is revealed to be Charlie, the two laugh and passionately kiss.",
  "synopsis": null
}