{
  "imdb_id": "tt2498626",
  "tmdb_id": "199565",
  "douban_id": null,
  "title": "The Movie Out Here (2012)",
  "genres": [
    "Comedy"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.5,
  "director": [
    {
      "id": "nm0382839",
      "name": "David Hicks"
    }
  ],
  "writer": [
    {
      "id": "nm5477018",
      "name": "Catherine Allen",
      "description": "story and"
    },
    {
      "id": "nm5476683",
      "name": "Ian Simpson",
      "description": "story and"
    },
    {
      "id": "nm1544840",
      "name": "Matthew Bass",
      "description": "story"
    },
    {
      "id": "nm2548515",
      "name": "David Chiavegato",
      "description": "screenplay and"
    },
    {
      "id": "nm1560888",
      "name": "Rich Pryce-Jones",
      "description": "screenplay and"
    },
    {
      "id": "nm1544840",
      "name": "Matthew Bass",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0630974",
      "name": "Robin Nielsen",
      "character": "Adam"
    },
    {
      "id": "nm0494892",
      "name": "Viv Leacock",
      "character": "Jason"
    },
    {
      "id": "nm1621843",
      "name": "James Wallis",
      "character": "Theo"
    },
    {
      "id": "nm0410622",
      "name": "Katharine Isabelle",
      "character": "Danielle"
    },
    {
      "id": "nm0465269",
      "name": "Karin Konoval",
      "character": "Edith"
    },
    {
      "id": "nm0149942",
      "name": "Garry Chalk",
      "character": "Vick"
    },
    {
      "id": "nm3137445",
      "name": "Nils Hognestad",
      "character": "Fresh"
    },
    {
      "id": "nm1152538",
      "name": "Artine Tony Browne",
      "character": "Glacier       (as Artine Brown)"
    },
    {
      "id": "nm1853214",
      "name": "Benjamin Arthur",
      "character": "Mick"
    },
    {
      "id": "nm2814333",
      "name": "Scott Patey",
      "character": "Barry"
    },
    {
      "id": "nm0636868",
      "name": "John Novak",
      "character": "The Ranger"
    },
    {
      "id": "nm1100221",
      "name": "Snow",
      "character": "Himself       (as Darrin K. O'Brien)"
    },
    {
      "id": "nm0574562",
      "name": "Marty McSorley",
      "character": "Himself       (as Martin McSorley)"
    },
    {
      "id": "nm3698398",
      "name": "Nancy Amelia Bell",
      "character": "Old Lady       (as Nancy Bell)"
    },
    {
      "id": "nm4244968",
      "name": "Andre Tricoteux",
      "character": "Sasquatch"
    },
    {
      "id": "nm2120507",
      "name": "Lisa Durupt",
      "character": "Clare"
    },
    {
      "id": "nm1490435",
      "name": "Angelo Renai",
      "character": "Businessman on Elevator"
    },
    {
      "id": "nm0634213",
      "name": "Angie Nolan",
      "character": "Businesswoman on Elevator"
    },
    {
      "id": "nm2784156",
      "name": "Jason Burkart",
      "character": "Gary"
    },
    {
      "id": "nm3899645",
      "name": "Caley Dimmock",
      "character": "Stephanie"
    },
    {
      "id": "nm1867004",
      "name": "Ildiko Ferenczi",
      "character": "Sarah"
    },
    {
      "id": "nm0403828",
      "name": "Rebecca Husain",
      "character": "Hot Mom - Annie Benson"
    },
    {
      "id": "nm3719136",
      "name": "Anelore Popa",
      "character": "Cathy"
    },
    {
      "id": "nm2602557",
      "name": "Scotty Mac",
      "character": "Pan"
    },
    {
      "id": "nm0587667",
      "name": "Gardiner Millar",
      "character": "Chief"
    },
    {
      "id": "nm1059765",
      "name": "Raugi Yu",
      "character": "Jeremiah"
    },
    {
      "id": "nm4203370",
      "name": "Karyn Halpin",
      "character": "Hot Wax Girl - Veronica"
    },
    {
      "id": "nm5986971",
      "name": "Robert Harper",
      "character": "Sergio"
    },
    {
      "id": "nm2993483",
      "name": "Simon Hill",
      "character": "Liquor Store Clerk"
    },
    {
      "id": "nm0627586",
      "name": "Peter New",
      "character": "Gord"
    },
    {
      "id": "nm3276414",
      "name": "Chasty Ballesteros",
      "character": "Glacier Girl #1"
    },
    {
      "id": "nm3718957",
      "name": "Jasmine Mooney",
      "character": "Glacier Girl #2"
    },
    {
      "id": "nm5986968",
      "name": "Michelle Starchuck",
      "character": "Hot Female Clerk"
    },
    {
      "id": "nm1995155",
      "name": "Janet Glassford",
      "character": "Permit Clerk - Phyllis"
    },
    {
      "id": "nm5986969",
      "name": "Jamie McKersie",
      "character": "Permit Guy Male       (as Jamie McKerse)"
    },
    {
      "id": "nm5986970",
      "name": "Peter Bradshaw",
      "character": "Mike"
    },
    {
      "id": "nm0107023",
      "name": "Eric Breker",
      "character": "Arnold the Bartender"
    },
    {
      "id": "nm5383323",
      "name": "Greg Potocky",
      "character": "Businessman on Escalator"
    }
  ],
  "overview": "Adam (Robin Nielsen) works as a junior associate for a large Toronto law firm. When a business trip takes him to his hometown of Fernie, he reunites with his old friends, Jason (Viv Leacock) and Theo (James Wallis). Adam gets more than he bargained for when he finds out that, due to a series of terrible business decisions, Theo's ski waxing business \"Waxopolis\" is in serious financial trouble and at risk of being taken over by an evil developer. The three guys hatch a plan to throw a massive fundraising party to try and save the business. But, with the developer and his son on their back, party permit hassles, and a Sasquatch on the loose, will they be able to pull it off?",
  "storyline": "Adam (Robin Nielsen) works as a junior associate for a large Toronto law firm. When a business trip takes him to his hometown of Fernie, he reunites with his old friends, Jason (Viv Leacock) and Theo (James Wallis). Adam gets more than he bargained for when he finds out that, due to a series of terrible business decisions, Theo's ski waxing business \"Waxopolis\" is in serious financial trouble and at risk of being taken over by an evil developer. The three guys hatch a plan to throw a massive fundraising party to try and save the business. But, with the developer and his son on their back, party permit hassles, and a Sasquatch on the loose, will they be able to pull it off?",
  "plot": "A young Peter Parker discovers his father Richard Parker's study has been burgled. Gathering up hidden documents, Peter's parents take him to the home of his Aunt May and Uncle Ben, then mysteriously depart.\n\nYears later, a teenaged Peter attends Midtown Science High School, where he is bullied by Flash Thompson and has caught the eye of the beautiful Gwen Stacy. At home, Peter finds his father's papers and learns he worked with fellow scientist Dr. Curt Connors at Oscorp. Sneaking into Oscorp, Peter enters a lab where a \"biocable\" is under development from genetically modified spiders, one of which bites him. On the subway ride home, he discovers that he has developed spider-like abilities, such as sharp senses, reflexes and speed.\n\nAfter studying Richard's papers, Peter visits the one-armed Connors, reveals he is Richard Parker's son and gives Connors his father's \"decay rate algorithm\", the missing piece in Connors' experiments on regenerating limbs. Connors is being pressed by his superior, Dr. Ratha, to devise a cure for the dying (but unseen) head of Oscorp, Norman Osborn. In school, Peter gets into trouble after a basketball challenge with Flash in which Peter accidentally shatters the backboard glass. His uncle changes work shifts to meet with the principal and asks Peter to replace him walking home with May that night. Peter gets distracted and helps Connors regenerate the limb of a laboratory mouse. Peter's failure causes an argument with Ben and he leaves. At a nearby deli, a cashier refuses to let Peter buy milk when Peter is two cents short; when a thief suddenly raids the store, Peter indifferently observes. While searching for Peter, Ben attempts to stop the thief and is killed. The thief escapes as Peter finds Ben dead on the sidewalk.\n\nAfterward, Peter uses his new abilities to hunt criminals matching the killer's description. After a fall lands him inside an abandoned gym, a luchador-wrestling poster inspires him to create a mask to hide his identity. He adds a spandex suit and builds mechanical devices to attach to his wrists to shoot a biocable \"web\". Peter accepts a dinner invitation from Gwen, where he meets and has a tense conversation with her father, police captain George Stacy, over the new masked vigilante's motives. After dinner, Peter reveals his identity to Gwen and they kiss.\n\nAfter seeing success with the mouse using lizard DNA, Ratha demands Connors begin human trials immediately if Osborn is to survive. Connors refuses to rush the drug-testing procedure and put innocent people at risk. Ratha fires Connors and decides to test Connors' serum at a Veterans Administration hospital under the guise of a flu shot. In an act of desperation, Connors tries the formula on himself. After passing out, he awakens to find his missing arm has regenerated. Discovering that Ratha is on his way to the VA hospital, Connors, whose skin is turning green and scaly, goes to intercept him. By the time he gets to the Williamsburg Bridge Connors has become a violent hybrid of lizard and man, tossing cars, including Ratha's, over the side of the bridge. Peter, now calling himself Spider-Man, snatches each falling car with his web-lines.\n\nSpider-Man suspects Connors is Lizard and unsuccessfully confronts the creature in the sewers. Lizard learns Spider-Man's real identity via the name on an abandoned camera and follows Peter to school where they fight. In response, the police start a manhunt for both Spider-Man and Lizard. The police corner Spider-Man and Captain Stacy discovers that he is really Peter. Lizard plans to make all humans lizard-like by releasing a chemical cloud from Oscorp's tower, to eliminate the weaknesses he believes plague humanity. Spider-Man eventually disperses an antidote cloud instead, restoring Connors and earlier victims to normal, but not before Lizard mortally wounds Captain Stacy. Before his death, Captain Stacy requests Peter to leave Gwen out of it to keep her safe. Peter initially does so, but later at school suggests to Gwen he may see her after all.\n\nIn a mid-credits scene, Connors, in a prison cell, speaks with a man in the shadows who asks if Peter knows the truth about his father. Connors replies, \"No\", and demands Peter to be left alone before the man disappears.2",
  "synopsis": null
}