{
  "imdb_id": "tt2436386",
  "tmdb_id": "227719",
  "douban_id": null,
  "title": "Project Almanac (2015)",
  "genres": [
    "Drama",
    "Mystery",
    "Sci-Fi",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "106 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm2410311",
      "name": "Dean Israelite"
    }
  ],
  "writer": [
    {
      "id": "nm3091255",
      "name": "Jason Pagan",
      "description": "written by as Jason Harry Pagan &"
    },
    {
      "id": "nm2065670",
      "name": "Andrew Deutschman",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm4103976",
      "name": "Jonny Weston",
      "character": "David Raskin"
    },
    {
      "id": "nm3733763",
      "name": "Sofia Black-D'Elia",
      "character": "Jessie Pierce"
    },
    {
      "id": "nm1348102",
      "name": "Sam Lerner",
      "character": "Quinn Goldberg"
    },
    {
      "id": "nm1570766",
      "name": "Allen Evangelista",
      "character": "Adam Le"
    },
    {
      "id": "nm4722966",
      "name": "Virginia Gardner",
      "character": "Christina Raskin"
    },
    {
      "id": "nm0484541",
      "name": "Amy Landecker",
      "character": "Kathy Raskin"
    },
    {
      "id": "nm0917314",
      "name": "Gary Weeks",
      "character": "Ben Raskin"
    },
    {
      "id": "nm3978751",
      "name": "Macsen Lintz",
      "character": "David, Age 7"
    },
    {
      "id": "nm0344196",
      "name": "Gary Grubbs",
      "character": "Dr. Lou"
    },
    {
      "id": "nm3350137",
      "name": "Michelle DeFraites",
      "character": "Sarah Nathan"
    },
    {
      "id": "nm5214224",
      "name": "Curry Stone",
      "character": "Male Student"
    },
    {
      "id": "nm3573893",
      "name": "Jamila Thompson",
      "character": "Marina"
    },
    {
      "id": "nm2095613",
      "name": "Katie Garfield",
      "character": "Liv"
    },
    {
      "id": "nm5035424",
      "name": "Hillary Harley",
      "character": "Blonde"
    },
    {
      "id": "nm3950972",
      "name": "Courtney Bowers",
      "character": "Jess' Friend"
    },
    {
      "id": "nm3416247",
      "name": "Patrick Johnson",
      "character": "Todd"
    },
    {
      "id": "nm5271067",
      "name": "Joshua Brady",
      "character": "Break Up Guy"
    },
    {
      "id": "nm5365275",
      "name": "Danielle Rizzo",
      "character": "Break Up Girl"
    },
    {
      "id": "nm0060995",
      "name": "Mychael Bates",
      "character": "Car Salesman"
    },
    {
      "id": "nm2218291",
      "name": "Onira Tares",
      "character": "Lotto Woman"
    },
    {
      "id": "nm3738291",
      "name": "Mani Yarosh",
      "character": "Ingrid"
    },
    {
      "id": "nm0070235",
      "name": "Andrew Benator",
      "character": "Ace Hardward Employee"
    },
    {
      "id": "nm0546056",
      "name": "Aaron Marcus",
      "character": "History Teacher"
    },
    {
      "id": "nm0625858",
      "name": "André Nemec",
      "character": "Newscaster"
    },
    {
      "id": "nm0721593",
      "name": "Anthony Reynolds",
      "character": "Policeman"
    },
    {
      "id": "nm5558954",
      "name": "Ben McKee",
      "character": "Imagine Dragons"
    },
    {
      "id": "nm3760549",
      "name": "Daniel Platzman",
      "character": "Imagine Dragons"
    },
    {
      "id": "nm5558239",
      "name": "Dan Reynolds",
      "character": "Imagine Dragons       (as Daniel Reynolds)"
    },
    {
      "id": "nm5557632",
      "name": "Wayne Sermon",
      "character": "Imagine Dragons       (as Daniel Wayne Sermon)"
    },
    {
      "id": "nm5722496",
      "name": "Wadette Bradford",
      "character": "Birthday Party Mom"
    },
    {
      "id": "nm6058320",
      "name": "Taylor Hogan",
      "character": "Sarah's Friend"
    },
    {
      "id": "nm6248193",
      "name": "Elijah Iniekpo",
      "character": "Student /              Baseball Player"
    },
    {
      "id": "nm6044288",
      "name": "Sydney Isaac",
      "character": "Track Girl"
    },
    {
      "id": "nm6043800",
      "name": "Scott Ledbetter",
      "character": "Detective"
    },
    {
      "id": "nm3229476",
      "name": "Alexandra Norris",
      "character": "Student"
    },
    {
      "id": "nm6127103",
      "name": "Tyler j Phillips",
      "character": "Student /              baseball player"
    },
    {
      "id": "nm6161332",
      "name": "Brett David Stelter",
      "character": "Basketball Coach"
    }
  ],
  "overview": "A group of teens discover secret plans of a time machine, and construct one. However, things start to get out of control.",
  "storyline": "As a group of friends discover plans for a time machine, they build it and use it to fix their problems and for personal gain. But as their future falls apart with disasters, and they come to realize the irreversible ripple effects caused by their time travels, they must decide to fix this once and for all.",
  "plot": "In 2014, 17-year-old high school senior and aspiring inventor David Raskin (Jonny Weston) is admitted into MIT, but is unable to afford its tuition fees. Upon learning his mother, Kathy Raskin (Amy Landecker), is planning to sell the house, David enlists his sister Christina (Virginia Gardner) and his friends Adam Le (Allen Evangelista) and Quinn Goldberg (Sam Lerner) to sift through the belongings of his father Ben Raskin (Gary Weeks), an inventor who died in a car crash on David's seventh birthday, in the hope of finding something that David can use to get a scholarship. David finds an old camera with a video recording of his seventh birthday party, in which he briefly spots his 17-year-old self in a reflection. Noting how he appears to be reaching for a basement light switch in the reflection, David and his friends go to the basement, which was forbidden by his father. Underneath a trapdoor activated by the basement switch, the group find the blueprints of a temporal relocation device that Ben was developing named \"Project Almanac\", and use the available resources to build a functional time machine. David, Christina, Adam, and Quinn later use the battery from the car of David's longtime crush, Jessie Pierce (Sofia Black-D'Elia), to charge up the machine, and successfully send a toy car back in time, but blow out the power for the entire neighborhood. They end up being caught by Jessie and recruit her to their experiment.\n\nDavid, Jessie, Christina, Adam, and Quinn eventually travel back in time to the day before and break into Quinn's house, where he draws a smiley face on the back of the neck of his sleeping past self (which simultaneously appears on the back of the visiting Quinn's neck). However, he awakens and seeing his future self causes a feedback loop that nearly erases them both from the timeline. The five agree to use the machine for personal gain on the condition that they always use it together. Adam uses it to win the lottery, Christina gets back at her bullies, Quinn aces a chemistry test to secure his academic future, and the group eventually decides to travel back to Lollapalooza three months before. David hesitates to declare his feelings for Jessie and their relationship becomes awkward. David decides to travel back to Lollapalooza alone to change that, leading to a future in which they are a couple. When he returns, he finds that the blackout caused by them sending the toy car back resulted in their school's star basketball player getting hit by a car and breaking his leg; the team doesn't make it to the championships, and those that would have attended go elsewhere, including the player's father, a pilot who ends up crashing a commercial airliner, along with multiple other catastrophes around the world. David goes back alone once again and prevents the accident that would lead to the player's injury, and averts the plane crash. He returns to the future to learn that instead Adam is in critical condition in the hospital after being run over.\n\nDavid continues to travel back in time to rectify the poor outcomes, but eventually is caught by Jessie during one of his trips, accidentally sending her back with him. Jessie confronts David, who is forced to admit to using the time machine to win her affection. As Jessie lambastes David for his deception, her past self runs up, causing another feedback loop, and Jessie is erased from the timeline. David decides to go back to prevent the machine from being created, but the machine is out of hydrogen. As David returns to the present, he is confronted by the police, who suspect him of being connected to Jessie's disappearance. Narrowly evading the manhunt after him, David is able to get to his school and obtains a hydrogen canister. He manages to activate the machine just as the police break into the supply room, and sends himself back to the day of his seventh birthday.\n\nIn the basement, David confronts his father Ben, who recognizes him and realizes that this means he will eventually complete the machine. David convinces Ben of the machine's danger and tells him that he should say goodbye to his son. Meanwhile, David destroys the blueprints and a vital component, causing him to be erased from the timeline. However, the camera he and his friends have been using all along is left behind and records the whole thing. Back in the future, David and Christina are once again going through their father's belongings, when they find their father's camera as well as the alternate David's camera. This second camera still contains all the footage of David and the group from the original timeline, including the original recording of him and Christina finding only one camera in the attic. Shocked to see this, they go through all the footage and see their adventures traveling through time. Later, at school, David approaches Jessie for the first time once again, displaying knowledge of the future, and confides in her that they are about to \"change the world\".",
  "synopsis": "High school senior David Raskin (Jonny Weston) is testing an experiment with his friends Adam Le (Allen Evangelista) and Quinn Goldberg (Sam Lerner) while David's sister Christina (Ginny Gardner) films it. The video is for a scholarship to MIT University. David shows off an aircraft he made that he can control with a material placed on his fingers. The gang sets the craft loose outside when someone calls David's phone, jamming the signal on Quinn's laptop to connect with the craft. The craft plummets to the ground and crashes.A few weeks later, David gets an envelope from MIT. He gathers with Christina and their mom Kathy (Amy Landecker), along with Adam and Quinn, to open it. David gets into MIT, but he only receives $5,000 instead of the proposed $45,000, to his disappointment.At school, we learn that David has a crush on a girl named Jessie Pierce (Sofia Black-D'Elia). Quinn flunks a chemistry test in front of his whole class. Christina is bullied by the school's head bitch Sarah Nathan (Michelle DeFraites).Back home, David and Christina discover that Kathy is trying to sell the house. Later, David rummages through the attic. Christina comes upstairs and they find a videotape of David's 7th birthday party. It was the last day the two saw their dad Ben (Gary Weeks) before he died in a car crash. The two look at the video and David notices something strange - he, in his current age, is physically visible in the video. He shows the tape to Adam and Quinn, who both react with surprise.David obsesses over the video and notices details like that he has a blue stain on his shirt and that he's holding keys with a ballerina figure key chain. He looks in his bag and notices he's actually holding Jessie's bag. He goes over to return it to her and awkwardly tries to talk to her. He returns the bag and she congratulates him on getting into MIT.The gang goes to David's basement and they uncover a secret hatch in the floor that contains blueprints for a temporal relocation device, or a time machine. The boys get excited and begin to gather the materials they need to build it. After a few failed tests, they steal hydrogen canisters from the school to properly charge their batteries. They manage to activate something that causes objects in the basement to levitate, but the batteries keep short-circuiting.A party goes on next door one night. Jessie brings her car and parks it in David's driveway. The gang hooks up their cables to her car battery to test their next experiment: they are trying to send Christina's red toy Corvette through time. They activate the machine, just as Jessie comes in when she sees what they're doing to her car. The room begins to shake and objects start floating, and then all the power on the street goes out. When the lights go back on, the gang sees that the toy car DID go through time, and is somehow fused to the wall. They look on the GoPro that they attached to the car and see that it was already sitting there recording them as they set up the machine.Jessie joins the gang as they show her David's birthday video and prove to her what they can do. They get together that night in the neighborhood and attempt to go back to one night ago. They activate the machine and jump through time. The gang is left deafened and disoriented for a brief moment. They then run to Quinn's home where Quinn was sleeping the previous night. Quinn draws a smiley face on his own neck. Past Quinn then rolls over and wakes up and sees his future self. This causes a glitch in time, and the two of them start to disappear. The gang runs out of there and then excitedly jump for the fact that they successfully time-jumped. When they get back to the area where they made the jump, they find a dog. As they drive through the streets, they notice a bunch of \"missing dog\" flyers that weren't there earlier. They return the dog to its rightful owner.The gang starts to imagine the possibilities of their newfound ability and decide to utilize it for personal matters as long as they all time-jump together. Quinn uses it to ace his chemistry test until he finally gets it right. Christina uses it to catch Sarah moments after she caused Christina to spill her drink, only for Future Christina to show up and purposely spill drinks on Sarah, humiliating her and declaring, \"I'm everywhere, bitch!\" Adam has the gang time-jump so they can win the lottery. However, he only got five out of the six numbers right, and after taxes, they only make $1.8 million. Quinn still uses the money to buy himself a cool car and to bring a line of food trucks to the school. At home, Kathy ends up getting a new job, to the delight of David and Christina.During class, David pulls the gang out of class to meet under the bleachers. They jump to three months ago for Lollapalooza. They watch their favorite bands play and even score VIP passes (after getting them cheaply on eBay in the present) to go backstage and hang with the band. The gang has the time of their lives. They hang on water slides and party all day. Christina and Adam hook up. Before the day is over, David goes over to Jessie as she checks out the wall that says \"Before the world ends...\" with a number of things people would do. Jessie drops HUGE hints to David like going to the statement that reads, \"Before the world ends, I want to fall in love.\" David misses the chance to make his move, and they later jump back to the present, where only 41 seconds passed.Frustrated with his failure, David jumps back alone to Lollapalooza and makes his move on Jessie. He kisses her and then returns to the present. He's in his room and tries calling Jessie, only to see her phone is on his desk. She emerges from the bathroom wearing only a towel. David asks her if they had sex. She says yes.The two become an item, but when they get to school, David notices odd things. The school's basketball captain Justin has a broken leg. Sarah walks by David crying. There's a banner hung up that reads \"Titans Basketball - Better Luck Next Year\". After school, David learns from Adam and Quinn that there was a plane crash that killed 77 people, including Sarah's dad, who was the pilot. The boys think that their time-jumping is responsible for this, as well as the basketball team losing the championship.The gang meets up at night when David tells Adam that he jumped alone. Despite Adam telling him not to do it again, David jumps back alone to the night of the party. After he and the others kill the power when they jumped Christina's toy car, David runs into the street and pushes Justin out of the path of a car to prevent him from breaking his leg. The other partygoers hail him as a hero. David jumps back to the present and sees that not only did the team win the championship, but the plane landed safely. However, Adam lands in the hospital following an incident after the basketball game.David runs home and tries to figure out how to stop Adam from being hurt. He gets the machine ready when Jessie comes into the basement. They both jump through time, and David is forced to explain to her that he jumped alone to go back and make his move on her. Jessie is hurt and admits that she liked David since she first met him, and that she would use the machine to go back and meet him sooner. Then, Jessie's past self comes by, and once they see each other, she completely vanishes into thin air, leaving behind only her car keys, which David grabs.Seeing no other way out, David decides he must jump all the way back to his 7th birthday to prevent the machine from ever existing. Quinn goes to his home after Jessie goes missing. David explains the whole situation to him and apologizes for his mistake. The police then show up to David's home, suspecting him of being involved in Jessie's disappearance. David escapes his home and runs to the school where he takes one more hydrogen canister. He is able to fuel the machine just as the cops barge in, moments before he makes the jump.David goes back ten years and makes it home. He sees himself in the mirror, right where the video first got him. He follows his dad to the basement and they come face-to-face. Ben recognizes his son and realizes he got the machine to work. David tells him that there are no second chances and that they need to stop this. The two of them hug and Ben leaves. David gathers all the components of the time machine and burns them. His body flickers repeatedly until he vanishes.David is back in the present, looking in the attic where Christina finds him. They find their dad's video camera, which has footage of what they were doing and saying mere minutes ago (them questioning how the camera got there, specifically).The gang is at school during the moment when David sees he has Jessie's bag. He goes over to give it to her with more confidence, and he repeats a statement that Jessie made to him the first time they spoke. When she asks how he knew what he was going to say, David leans in and says, \"This is gonna sound crazy, but I think we're about to change the world.\""
}