{
  "imdb_id": "tt2476750",
  "tmdb_id": "226443",
  "douban_id": null,
  "title": "Banaz: A Love Story (2012)",
  "genres": [
    "Documentary",
    "Biography",
    "Crime",
    "Drama"
  ],
  "country": "Norway",
  "version": [
    {
      "runtime": "69 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.1,
  "director": [
    {
      "id": "nm1821069",
      "name": "Deeyah Khan"
    },
    {
      "id": "nm5339887",
      "name": "Darin Prindle"
    }
  ],
  "writer": [
    {
      "id": "nm5339887",
      "name": "Darin Prindle",
      "description": "written by &"
    },
    {
      "id": "nm3983919",
      "name": "Honora Foah",
      "description": "written by &"
    },
    {
      "id": "nm2684798",
      "name": "Hamilton Craig",
      "description": "written by"
    },
    {
      "id": "nm3012888",
      "name": "Andrew Smith",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3351652",
      "name": "Nazir Afzal",
      "character": "Himself - Crown Prosecution Service, London"
    },
    {
      "id": "nm5996457",
      "name": "Bobbie Cheema",
      "character": "Herself - Prosecutor"
    },
    {
      "id": "nm5996454",
      "name": "Andy Craig",
      "character": "Himself - Detective Sergeant, Met Police"
    },
    {
      "id": "nm5996452",
      "name": "Caroline Goode",
      "character": "Herself - Detective Chief Inspector, Met Police"
    },
    {
      "id": "nm5988325",
      "name": "Banaz Mahmod",
      "character": "Herself"
    },
    {
      "id": "nm5988326",
      "name": "Bekhal Mahmod",
      "character": "Herself - Banaz's sister"
    },
    {
      "id": "nm5996453",
      "name": "Diana Nammi",
      "character": "Herself - Iranian and Kurdish Women's Rights Organisation"
    },
    {
      "id": "nm5996456",
      "name": "Joanne Payton",
      "character": "Herself - Honour Based Violence Awareness Network"
    },
    {
      "id": "nm5996458",
      "name": "Stuart Reeves",
      "character": "Himself - Detective Sergeant, Met Police"
    },
    {
      "id": "nm5996455",
      "name": "Palbinder Singh",
      "character": "Himself - Metropolitan Police Sikh Association"
    },
    {
      "id": "nm5740646",
      "name": "Victor Temple",
      "character": "Himself - Prosecutor       (as Victor Temple QC)"
    }
  ],
  "overview": "This is a documentary film chronicling the brutal Honour Killing of Banaz Mahmod, a young British Kurdish woman in London, killed by her own family for choosing a life for herself.",
  "storyline": "This is a documentary film chronicling the brutal Honour Killing of Banaz Mahmod, a young British Kurdish woman in London, killed by her own family for choosing a life for herself.",
  "plot": null,
  "synopsis": "Banaz Mahmod was murdered by her own family, in an honour killing. This film tells Banaz's story, in her own words, for the first time and tells the story of the extraordinary police team who refused to give up, and finally brought her killers to justice.This is a documentary film chronicling an act of overwhelming horror the honour killing of Banaz Mahmod, a young British woman in suburban London in 2006, killed and disappeared by her own family, with the agreement and help of a large section of the Kurdish community, because she tried to choose a life for herself.It was a case which shocked the entire world and received enormous international press coverage; but until now, the voice of Banaz herself has never been heard.As the result of four painstaking years gaining the trust and co-operation of the extraordinary police officers who solved the case, the film contains heart-breaking footage of Banaz herself, detailing the horrors she was facing and accurately predicting her own brutal murder. The footage, which has never before been seen and has been obtained by the filmmakers for the first time, displays the warmth, beauty and courage of Banaz.Despite the horror, what emerges is a story of loveOf Banaz, an ordinary young British teenager, whose relationship with Rahmat put her life in danger. It was her video messages from beyond the grave which convicted her father and uncle of the murder she feared would happen.Of Bekhal, a young woman of incredible spirit and bravery, whose love for her murdered sister gave her the strength to testify against her own family and community bringing justice to Banaz but consigning her to a life forever lived in hiding.Of Detective Chief Inspector Caroline Goode, the senior Scotland Yard detective, who says she came to love Banaz beyond the grave. It was Carolines dedication and passion which drove her on, finding her body against all the odds, laying her to rest, and relentlessly pursuing her killers, even to Iraq.And Deeyah, international music producer and activist turned filmmaker, who has herself been subject to honour related abuse and threat. It was Deeyahs love for the story, for Banaz, for Bekhal and for Caroline, and for raising awareness for the issue of honour killing, which has driven her to spend four years making this harrowing and deeply emotional film, running out of funding long ago, but forming an intimate bond with all the key players, which plays out on screen in scenes of astonishingly confessional testimony.Banaz is a symbol of horror and hope in the fight to overcome oppression and outdated, abominable cultural practices, practices which claim the lives of thousands of other women like Banaz every year.But above all, the film is an act of remembrance, an act of recovery of Banaz, one human being. After her family tried so brutally to erase her from the face of the earth, for the first time, Banazs voice is finally being heard."
}