{
  "imdb_id": "tt2402127",
  "tmdb_id": "340018",
  "douban_id": null,
  "title": "Kick (2015)",
  "genres": [
    "Drama",
    "Horror",
    "Thriller"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "76 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.2,
  "director": [
    {
      "id": "nm1668000",
      "name": "Marcus Warren"
    }
  ],
  "writer": [
    {
      "id": "nm1668000",
      "name": "Marcus Warren",
      "description": "writer"
    },
    {
      "id": "nm1668000",
      "name": "Marcus Warren",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2156294",
      "name": "Daniel Bayle",
      "character": "Steve       (rumored)"
    },
    {
      "id": "nm5135586",
      "name": "Robert Bond",
      "character": "Police Officer"
    },
    {
      "id": "nm3761559",
      "name": "Alexander Bracq",
      "character": "Office Worker"
    },
    {
      "id": "nm9041660",
      "name": "Oliver Bury",
      "character": "Footballer"
    },
    {
      "id": "nm5381505",
      "name": "Mark Chan",
      "character": "Board Executive"
    },
    {
      "id": "nm4701008",
      "name": "Chris Cowlin",
      "character": "Police Officer"
    },
    {
      "id": "nm5153722",
      "name": "Nigel Genis",
      "character": "Football Crowd"
    },
    {
      "id": "nm5178582",
      "name": "John Heartstone",
      "character": "Football spectator"
    },
    {
      "id": "nm5123771",
      "name": "Celine Jedidi",
      "character": "Couple at the bar"
    },
    {
      "id": "nm2380651",
      "name": "Simone Kaye",
      "character": "Constable Roberts"
    },
    {
      "id": "nm0498523",
      "name": "Pete Lee-Wilson",
      "character": "George       (rumored)"
    },
    {
      "id": "nm2180458",
      "name": "Steve Lorrigan",
      "character": "PC Alan Davies"
    },
    {
      "id": "nm5126775",
      "name": "Bharat Mistri",
      "character": "Supporting football team"
    },
    {
      "id": "nm5126893",
      "name": "Kumud Pant",
      "character": "Football Spectator"
    },
    {
      "id": "nm1870939",
      "name": "Nicola Posener",
      "character": "Kelly"
    },
    {
      "id": "nm1277450",
      "name": "Kellie Shirley",
      "character": "Tracey       (rumored)"
    },
    {
      "id": "nm5373218",
      "name": "Austin Staton",
      "character": "Victim 1"
    },
    {
      "id": "nm0833380",
      "name": "Richard Strange",
      "character": "Smiley"
    },
    {
      "id": "nm0842199",
      "name": "Steve Sweeney",
      "character": ""
    },
    {
      "id": "nm5248182",
      "name": "Samuel Williams",
      "character": "Customer At The Bar"
    },
    {
      "id": "nm0949996",
      "name": "Rik Young",
      "character": "Dan"
    }
  ],
  "overview": "The film centres around two aspiring young footballers who have bribed their way into a premier league football stadium to play illicit underground football only to discover that they are trapped in a game of survival.",
  "storyline": "Office workers and avid soccer fans Dan and Steve have bribed their way into a London premier league soccer stadium one evening after work fora once in a lifetime chance to play on their team's hallowed turf. Only when the match finishes and the lights go out do they realize they are trapped in a game for their own survival.",
  "plot": "Kalyan Krishna (Shaam) comes to meet his old friend, Kalyan (Ravi Teja), who is now married to Naina (Ileana), settled in Virginia, and has become very rich but still looking for a kick in life. When Krishna asks Kalyan about his son, Kalyan gets angry and says his son is worse than him. Robin Hood (Ravi Teja) is Kalyan's son and despite his father saying, Robin looks for \"comfort\" more than Kick. Robin was taken out of his mother's womb in only seven months because he felt it was uncomfortable. Robin became a doctor so that if he gets injured, he can treat himself immediately. Robin wishes to start a hospital in Hyderabad with their land, but Kalyan says that it has been grabbed by a goon, Settlement Durga (Ashish Vidyarthi). Robin arrives in India and stays in the rented house of Pandit Ravi Teja (Brahmanandam), but Pandit is continuously tortured by Robin. Robin also challenges Durga that he will get back his land without taking out a hand on him.\n\nMeanwhile, in Bihar, there is a small town called Vilaspur, which is cruelly ruled over by an evil man, Solomon Singh Thakur (Ravi Kishen). The villagers expect a godsend to arrive soon to save them. Robin gets into a fight with Jatcharlla Balram (Madhu), a local politician in Hyderabad. A villager of Vilaspur, Chandan (Shekhar) witnesses this and informs his villagers about Robin. The village decides to send three of their people to Hyderabad to keep an eye on Robin and also announce the three people dead to the Thakur. Meanwhile, Robin is persuaded by a writer, Chaitra (Rakul Preet Singh), who wants to write his story. Chaitra soon falls in love with Robin, who does not reciprocate as he loves only himself. Yet, he tells her that she can treat him as her lover, and he will play along and if he manages to fall in love with her, he will stay back with her. Chaitra does all she can to impress him. Robin soon cheats Pandit and takes his houses from him and sells them. Chaitra tells him that now there is no difference between him and Durga. But Robin says that Pandit was the one who gave the land grabbing idea to Durga and this was his punishment. Using his brains, Robin soon gets his land back from Durga as well as the lands of all the other people which Durga grabbed. On the day of his departure, Robin tells Chaitra he still has no feelings for her, but tells her that she will always be his best friend. She runs away sadly, but it is now revealed that she was sent by Vilaspur villagers to get Robin to their village. At the airport, Robin realizes that he does love Chaitra and rushes back to her. She gets taken to the village suddenly and leaves for him a diary so that he knows where to come to. The village is remodeled so that it will suit for Robins \"comforts\". The villagers make Robin believe he has to stay there for 10 days so that he can win Chaitra. One of their own villagers, Venkatratnam (Tanikella Bharani) continuously discourages them of their ideas to beat the Thakur. Thakur's son Munna (Kabir Duhan Singh), arrives in town and kills a young girl who was the daughter of a villager. Robin beats him up after a small misunderstanding at the temple. Soon Munna begins to get scared of Robin and the Thakur kills him too. It is also revealed that Pandit Ravi Teja came to Vilaspur and became an astrologer at the Thakur's palace. Pandit reveals everything to Robin who was conned by the villagers into a battle with the Thakur. He decides to leave back to Virginia, but Venkatratnam finally advises him against it saying that trying to cheat him, the villagers actually loved him.\n\nRobin realizes and goes back to Vilaspur to save the villagers. He kills all of the Thakur's henchmen using the Thakur's army itself. But he does not kill Thakur and instead tells the villagers to burn the Thakur themselves. They tie him to a pole and put kerosene on him, but drop their fire blazing wooden logs saying they know only to love and not to kill. A pigeon whose mate was shot dead by the Thakur, stands down on one of the logs which burns the pole killing the Thakur. Robin finally realizes the value of his father's \"kick\", and the movie ends with the announcement of \"kick 3\"",
  "synopsis": null
}