{
  "imdb_id": "tt2446042",
  "tmdb_id": "260346",
  "douban_id": "20277632",
  "title": "Taken 3 (2014)",
  "genres": [
    "Action",
    "Thriller"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "108 min",
      "description": ""
    },
    {
      "runtime": "115 min",
      "description": "Unrated Edition"
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm0576298",
      "name": "Olivier Megaton"
    }
  ],
  "writer": [
    {
      "id": "nm0000108",
      "name": "Luc Besson",
      "description": "written by &"
    },
    {
      "id": "nm0436543",
      "name": "Robert Mark Kamen",
      "description": "written by"
    },
    {
      "id": "nm0000108",
      "name": "Luc Besson",
      "description": "characters &"
    },
    {
      "id": "nm0436543",
      "name": "Robert Mark Kamen",
      "description": "based on characters created by"
    }
  ],
  "cast": [
    {
      "id": "nm0000553",
      "name": "Liam Neeson",
      "character": "Bryan Mills"
    },
    {
      "id": "nm0001845",
      "name": "Forest Whitaker",
      "character": "Franck Dotzler"
    },
    {
      "id": "nm0000463",
      "name": "Famke Janssen",
      "character": "Lenore St. John"
    },
    {
      "id": "nm1192254",
      "name": "Maggie Grace",
      "character": "Kim Mills"
    },
    {
      "id": "nm0779084",
      "name": "Dougray Scott",
      "character": "Stuart St. John"
    },
    {
      "id": "nm0819874",
      "name": "Sam Spruell",
      "character": "Oleg Malankov"
    },
    {
      "id": "nm0367496",
      "name": "Don Harvey",
      "character": "Garcia"
    },
    {
      "id": "nm0116465",
      "name": "Dylan Bruno",
      "character": "Smith"
    },
    {
      "id": "nm0650702",
      "name": "Leland Orser",
      "character": "Sam (Gilroy)"
    },
    {
      "id": "nm0913175",
      "name": "David Warshofsky",
      "character": "Bernie (Harris)"
    },
    {
      "id": "nm0340973",
      "name": "Jon Gries",
      "character": "(Mark) Casey"
    },
    {
      "id": "nm4103976",
      "name": "Jonny Weston",
      "character": "Jimy"
    },
    {
      "id": "nm0095960",
      "name": "Andrew Borba",
      "character": "Clarence"
    },
    {
      "id": "nm0066327",
      "name": "Judi Beecher",
      "character": "Claire"
    },
    {
      "id": "nm0397110",
      "name": "Andrew Howard",
      "character": "Maxim"
    },
    {
      "id": "nm3883399",
      "name": "Cedric Cirotteau",
      "character": "Maxim Partner #1"
    },
    {
      "id": "nm0245696",
      "name": "Catherine Dyer",
      "character": "NSA Woman"
    },
    {
      "id": "nm0658861",
      "name": "Jimmy Palumbo",
      "character": "Cop Brooks"
    },
    {
      "id": "nm1128418",
      "name": "Robert Pralgo",
      "character": "Cop Crime Scene #1"
    },
    {
      "id": "nm1732262",
      "name": "Tony Williams",
      "character": "Cop Crime Scene #2"
    },
    {
      "id": "nm0015673",
      "name": "Al Vicente",
      "character": "Cop Crime Scene #3"
    },
    {
      "id": "nm2066764",
      "name": "Alexander Wraith",
      "character": "Cop Utility Room"
    },
    {
      "id": "nm1014554",
      "name": "Shelley Calene-Black",
      "character": "Cop Debriefing Room"
    },
    {
      "id": "nm1889407",
      "name": "Adam J. Smith",
      "character": "Cop Technician Surveillance Van"
    },
    {
      "id": "nm1281943",
      "name": "Jimmy Gonzales",
      "character": "Cop Lenore House #1"
    },
    {
      "id": "nm2304140",
      "name": "David Clark",
      "character": "Cop Malankov Garage #1"
    },
    {
      "id": "nm3369698",
      "name": "Michael Shikany",
      "character": "Clerk Convenience Store"
    },
    {
      "id": "nm1839680",
      "name": "Robert Bryan Davis",
      "character": "Clerk Gas Station"
    },
    {
      "id": "nm0197422",
      "name": "Nazareth Dairian",
      "character": "Clerk Toy Store"
    },
    {
      "id": "nm2551500",
      "name": "Tony Demil",
      "character": "Impound Technician"
    },
    {
      "id": "nm4111010",
      "name": "Stefanie Kleine",
      "character": "Waitress Rancho Cafe"
    },
    {
      "id": "nm4663267",
      "name": "Johnny Harvill",
      "character": "Customer Rancho Cafe"
    },
    {
      "id": "nm0226826",
      "name": "Angie Dillard",
      "character": "Waitress Restaurant"
    },
    {
      "id": "nm0005120",
      "name": "Wallace Langham",
      "character": "Mike"
    },
    {
      "id": "nm0624161",
      "name": "Franck Neel",
      "character": "Stuart Bodyguard #2"
    },
    {
      "id": "nm0156700",
      "name": "Cédric Chevalme",
      "character": "Malankov Guard Elevator Garage #1       (as Cedric Chevalme)"
    },
    {
      "id": "nm0945063",
      "name": "Anton Yakovlev",
      "character": "Malankov Guard Security Station #1"
    },
    {
      "id": "nm3102674",
      "name": "Ellen Ho",
      "character": "USC Girl #1"
    },
    {
      "id": "nm4302649",
      "name": "Haley Craft",
      "character": "USC Girl #2"
    },
    {
      "id": "nm2576863",
      "name": "Stephanie Honoré",
      "character": "USC Girl #3       (as Stephanie Honore)"
    },
    {
      "id": "nm0183548",
      "name": "Steve Coulter",
      "character": "USC Professor"
    },
    {
      "id": "nm0203860",
      "name": "Mike Davies",
      "character": "Pilot Private Jet"
    },
    {
      "id": "nm7044529",
      "name": "Jonathan Waite",
      "character": "Co-Pilot Private Jet"
    },
    {
      "id": "nm4365438",
      "name": "Lauren Sivan",
      "character": "Reporter Crime Scene"
    },
    {
      "id": "nm5391189",
      "name": "Cornelius Peter",
      "character": "Pastor Lenore Funeral       (as Cornelius M. Peter)"
    },
    {
      "id": "nm0296765",
      "name": "Kevin Fry",
      "character": "Bodyguard Many       (as Kevin Fry-Bowers)"
    },
    {
      "id": "nm3626606",
      "name": "Katie Mary Garland",
      "character": "Bagel Clerk       (as Katie M. Garland)"
    },
    {
      "id": "nm0002326",
      "name": "Al Sapienza",
      "character": "Johnson"
    },
    {
      "id": "nm0232414",
      "name": "Chad Donella",
      "character": "Phillips"
    },
    {
      "id": "nm1508382",
      "name": "Peter Thias",
      "character": "Malankov Guard Elevator Garage #2"
    },
    {
      "id": "nm2069038",
      "name": "Cedric Camus",
      "character": "Malankov Guard Security Station #2"
    },
    {
      "id": "nm1716704",
      "name": "Karim Ben Haddou",
      "character": "Malankov Guard Elevator Penthouse #1"
    },
    {
      "id": "nm5673736",
      "name": "Vincent Parisi",
      "character": "Malankov Guard Elevator Penthouse #2"
    },
    {
      "id": "nm0861962",
      "name": "Scott Thrun",
      "character": "Malankov Guard Elevator Penthouse #3"
    },
    {
      "id": "nm1226239",
      "name": "Laurent Desponds",
      "character": "Malankov Building Security"
    },
    {
      "id": "nm7044530",
      "name": "Amanda Nima",
      "character": "Waitress #2"
    },
    {
      "id": "nm2780772",
      "name": "Alex Disdier",
      "character": "Steward Gulfstream"
    },
    {
      "id": "nm6720847",
      "name": "Martin Vaughan Lewis",
      "character": "Controller Airport"
    },
    {
      "id": "nm1236209",
      "name": "Dale Liner",
      "character": "Officer Bernard"
    }
  ],
  "overview": "Ex-government operative Bryan Mills finds his life is shattered when he's falsely accused of a murder that hits close to home. As he's pursued by a savvy police inspector, Mills employs his particular set of skills to track the real killer and exact his unique brand of justice.",
  "storyline": "Liam Neeson returns as ex-covert operative Bryan Mills, whose long awaited reconciliation with his ex-wife is tragically cut short when she is brutally murdered. Consumed with rage, and framed for the crime, he goes on the run to evade the relentless pursuit of the CIA, FBI and the police. For one last time, Mills must use his \"particular set of skills,\" to track down the real killers, exact his unique brand of justice, and protect the only thing that matters to him now - his daughter.",
  "plot": "In 2014, former covert operative Bryan Mills (Liam Neeson) visits his daughter, Kim (Maggie Grace), to deliver a birthday gift. After an awkward visit, he invites his ex-wife, Lenore (Famke Janssen), to dinner. Although she declines, she shows up at his apartment and tells him about her marital problems. He agrees to let her try to work things out with her current husband Stuart (Dougray Scott).\n\nThe following day, Bryan receives a text from Lenore asking to meet him for breakfast. Bryan goes out for bagels; and, when he returns to his apartment, he discovers her lifeless body. L.A.P.D. units immediately appear and try to arrest him; but he resists and escapes. Meanwhile, L.A.P.D. Inspector Frank Dotzler (Forest Whitaker) familiarizes himself with Bryan's background and issues a B.O.L.O. for him.\n\nBryan retreats to a safe house equipped with weapons and surveillance electronics. He retraces Lenore's travels to a remote gas station convenience store and finds surveillance footage of her being abducted by unidentified men with unique hand tattoos; but L.A.P.D. detectives arrive and arrest him. While in-transit, Bryan frees himself, hijacks the police cruiser, escapes, and downloads phone records from an L.A.P.D. database onto a thumb drive. He contacts Kim at Lenore's funeral via a camera hidden in his friend Sam's suit, instructing her to maintain her \"very predictable schedule\". She purchases her daily yogurt drink with a \"Drink Me Now\" note which unknowingly is drugged by Bryan. During a lecture, she feels nauseated and runs to the restroom where Bryan is waiting. He surprises her and gives her the antidote to the drug. Bryan removes a surveillance bug that, unknown to her, was planted by Dotzler. He tells her that he is looking for the real murderer and that she should keep safe. Kim tells Bryan of her pregnancy and that Stuart is acting scared and has hired bodyguards which he has never done before.\n\nBryan tails Stuart's car but is ambushed by a pursuing SUV that pushes his car over the edge of a cliff. He survives the crash, hijacks a car, follows the attackers to a roadside liquor store and kills them. Bryan then abducts and interrogates Stuart, who confesses that his failure to repay a debt to a former business partner and ex-Spetsnaz operative named Oleg Malankov (Sam Spruell) was the reason Lenore was killed and that he exposed Bryan's identity to Malankov out of jealousy.\n\nWith assistance from his old colleagues and a nervous Stuart, Bryan gains entry to Malankov's heavily secured penthouse. After killing the guards, a furious gun battle, and brutal fight, a mortally wounded Malankov reveals that Stuart tricked them both. Stuart had planned Lenore's murder and framed Bryan as part of a business deal to collect on a $12M insurance policy. When Malankov failed to kill Bryan, Stuart used Bryan to kill Malankov and remove all threats. Meanwhile, Stuart shoots Bryan's ally, Sam (Leland Orser), and abducts Kim, intending to flee with the money. Under police pursuit, Bryan arrives at the airport in Malankov's Porsche as Stuart's plane is taxiing toward takeoff. After destroying the landing gear, preventing the plane from taking off, Bryan overpowers Stuart and prepares to kill him but pauses at Kim's pleas. He tells Stuart to expect final punishment if he escapes justice or completes a reduced prison sentence. Dotzler and the LAPD arrive to arrest Stuart. Bryan is acquitted and cleared of all charges.\n\nIn the aftermath of Stuart's arrest, Kim who is pregnant, informs Bryan that she wants to name her baby after her mother.",
  "synopsis": "A couple of Russian thugs come into a man's home and quietly take him away from his wife. The man is brought before a Russian mob boss, Oleg Malankov (Sam Spruell), who demands that the man opens the safe in the room they're standing in. The safe is opened, but it's empty. Malankov calls his employer and tells him there is nothing in the safe, but he will leave him something else. Malankov shoots the man dead.Meanwhile, Bryan Mills (Liam Neeson) buys a giant panda bear for his daughter Kim's (Maggie Grace) birthday. At home, Kim holds up a pregnancy test and looks at it worriedly. Bryan shows up with the panda, followed moments later by Kim's boyfriend Jamie (Jonny Weston). Kim comments that Bryan is predictable, while Jamie says Kim is as well, since she follows the same routine and goes to the convenience store to get the exact same orange smoothie drink from the exact same position. Bryan departs and takes the panda with him, even though Kim admits to feeling a bit bad about not wanting it. After he leaves, Bryan talks to his ex-wife Lenore (Famke Janssen) on the phone about Kim. He invites her over to dinner but she declines.Lennie surprises Bryan by showing up at his place while he's making dinner. She tells him that she's not very happy at home with her husband Stuart (Dougray Scott). She makes a pass at Bryan by kissing him. However, he knows this would be inappropriate and he politely turns down Lennie's advances.During a game of golf with his friends, Bryan gets a call from Kim and she invites him to meet with her at a diner. She prepares to tell him about her pregnancy when they see a bratty child making a fuss at another table. Kim gets nervous and tells Bryan she wants his advice on whether or not she should get a puppy.Bryan is visited by Stuart, who thinks that in order for his marriage with Lennie to work, Bryan needs to be out of the picture and that he should stop seeing her socially. Bryan assures Stuart that they're only friends and that there is nothing going on between them.Bryan gets a text from Lennie asking him to meet her at his apartment for some bagels. Bryan gets the bagels and returns to find a knife on the floor. He goes in the bedroom and sees Lenore lying dead on the bed with her throat slashes. As Bryan recoils in horror, two policemen burst in with guns pointed at Bryan. They prepare to handcuff him when Bryan ends up cuffing both of them. He jumps out the window as he hears more cops coming. They chase him through the streets until he runs into a garage and escapes through a hatch door into the river and out to the basin.Bryan calls Kim from a payphone while she is at Lennie's home looking for a sweater. He breaks the news to Kim about her mother's murder and that he is now being framed. He tells her to stay safe and that he will protect her. Kim steps back in shock and sits down to cry.Hot on Bryan's trail is Inspector Franck Dotzler (Forest Whitaker). He and his men investigate the crime scene and also visit Stuart and Lennie's home. Stuart returns immediately from a business trip. He is brought in to identify Lennie's body at the morgue. He breaks down and tells Dotzler about Bryan's past.Bryan sneaks into the morgue and finds Lennie's body. He solemnly touches her face and collects a hair sample.The cops inspect the parking garage where Lennie left her car. Bryan gets a scan on the car's GPS and sees that Lennie went to the gas station prior to her death. He goes to the gas station and sneaks into the security room to play a video. He sees footage of Lennie being snatched by a masked man and thrown into a van. One of the men has a star-like tattoo on his hand. Two detectives stop at the same gas station and learn that Bryan was there. They find him in the security room and arrest him. Bryan goes in calmly.The detectives inform Dotzler of their arrest of Bryan, but, since Dotzler has just followed up on Bryan's past, he knows that Bryan is setting them up. In the backseat of the police cruiser, Bryan carefully uncuffs himself and knocks out one cop while forcing the other to keep driving. The detectives chase Bryan as he takes control of the cruiser. This leads them through a garage where the cruiser ends up falling down an elevator shaft. The car explodes, but Bryan escapes. Dotzler talks to Bryan on the phone and tells him to stand down since everyone is going to be looking for him. Bryan responds, \"Good luck.\"Bryan visits his friend Sam (Leland Orser), to whom he gave the sample to and also informs him of what happened to Lenore. Sam stands by Bryan and is willing to help him. He tells Sam he wants to go to the funeral.Lenore's funeral takes place, with everyone going to console Kim and Stuart. Sam goes over to Kim and tells her to follow her \"predictable schedule.\" He motions to the button on his lapel, which is a hidden camera. Kim knows her dad is watching and she smiles.Kim leaves Stuart's home when she sees that he kept too many guards around. One detective follows Kim as she goes to the convenience store to get her smoothie drink. She finds the one she wants and finds a note on it that says \"Drink me now\". She drinks it all in one standing. She then goes to school and feels nauseous during class. She goes to the bathroom and is pulled into a stall by Bryan. They embrace and he gives her a serum to counter what he put in the drink to make her nauseous. Kim comes clean about the pregnancy. With little time, Bryan tells Kim he'll find the real culprits right before the detectives burst in. Bryan is already gone by then.While driving away, Bryan is pursued by some Russian thugs. They run him off the road, causing his car to explode. One goon comments on going to get drunk. Bryan gets a man to let him drive his car to follow the goons to the liquor store. Bryan beats the thugs all around the store until they are all knocked out, save for one last man - the man with the tattoo on his hand. Bryan takes him down and orders him to tell him who sent him. The man says he would rather die than tell, so he grabs Bryan's gun, puts it in his mouth, and pulls the trigger.Bryan locates Stuart, who retreated to a beach house. He knows Stuart sent the thugs, and Bryan takes Stuart to another area and waterboards him for information. Stuart was involved in a bad business deal with Oleg Malankov, and Lennie unfortunately became a victim of his when Stuart failed to return the man his money. He was merely counting on Bryan to find out about the situation and to utilize his killing skills to make the problem disappear. Stuart also tells Bryan that Malankov is a trained killer that joined the army and Special Forces, and that he is just as good at killing as Bryan. Together, with Kim, Sam, and other friends of Bryan's, they have Stuart set up a meeting with Malankov. Malankov arranges for them to meet at a building downtown.Bryan gets his opening to run through the building, beating up and killing all of Malankov's goons before finding the man himself in his apartment. The two fight each other, with Malankov nearly shooting Bryan, until Bryan takes the gun from him and shoots him twice. Bryan approaches Malankov to deliver the final shot, until Malankov says they were played by the same man - Stuart. Bryan leaves Malankov to die slowly.In Sam's van, Kim sees some texts from Lenore's phone that mention going to a specific location. She texts Bryan and then tries to contact him on his earpiece. Stuart knows what's happening, so he grabs Kim and shoots Sam in the neck. Stuart flees with Kim. The cops find the van with Sam unconscious but alive.Bryan realizes Kim is in trouble and he hijacks a car to go after her and Stuart. He tracks her location and sees she's headed for the airport. The cops track Bryan and follow him. At the airport, Stuart gets his private plane ready to take off with him and Kim. The pilots begin to steer the plane off the tarmac when Bryan drives over quickly and plows through the wheels, taking the plane down. Stuart emerges from the plane with Kim at gunpoint. She manages to escape him, leaving him to Bryan. Bryan puts together just how Stuart tried to get away with Lenore's murder while beating the man senseless. Before Bryan can kill Stuart, they hear the police sirens getting closer. Stuart says Bryan can't kill him now, and when Bryan tries to prove him wrong, he looks over to Kim, who shakes her head and urges him not to. Bryan figures that Stuart will probably get a good lawyer and be out of jail in a few years, and that's when Bryan will get him. He knocks Stuart out and leaves him to get arrested.Bryan meets with Dotzler in his office. Dotzler says he knew Bryan was innocent because he found the bagels in his apartment, and they were still warm. By that logic, he couldn't have bought bagels and then committed murder. They part ways, and Dotlzer closes Bryan's files.Bryan joins Kim and Jamie on the pier. He supports the two of them as they expect their child. Kim says that if it's a girl, they will name her after Lenore. Bryan agrees with that choice."
}