{
  "imdb_id": "tt2422212",
  "tmdb_id": "217366",
  "douban_id": null,
  "title": "House of Cards (2013)",
  "genres": [
    "Action",
    "Drama"
  ],
  "country": "Australia",
  "version": [
    {
      "runtime": "107 min",
      "description": ""
    }
  ],
  "imdb_rating": 2.1,
  "director": [
    {
      "id": "nm2278332",
      "name": "Ian Chinsee"
    }
  ],
  "writer": [
    {
      "id": "nm2278332",
      "name": "Ian Chinsee",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm5717994",
      "name": "Benjamin Alldridge",
      "character": "Arena Security Guard"
    },
    {
      "id": "nm4566715",
      "name": "Daniel Cason",
      "character": "Pretty Boy Roy"
    },
    {
      "id": "nm2278332",
      "name": "Ian Chinsee",
      "character": "Simon"
    },
    {
      "id": "nm5718044",
      "name": "Renee Dallas",
      "character": "Cheerleader"
    },
    {
      "id": "nm5717736",
      "name": "Isabelle Monique Dodin",
      "character": "Cheerleader"
    },
    {
      "id": "nm3169696",
      "name": "Anna Doody",
      "character": "Holly"
    },
    {
      "id": "nm5298607",
      "name": "Kathleen Doody",
      "character": "Natalie"
    },
    {
      "id": "nm3260247",
      "name": "Scott Driscoll",
      "character": "Arena Security Guard"
    },
    {
      "id": "nm4832324",
      "name": "Grace Endicott",
      "character": "Alison"
    },
    {
      "id": "nm5717538",
      "name": "Malua Fa'aleava",
      "character": "Bonecrusher"
    },
    {
      "id": "nm4186495",
      "name": "Aaron Flores",
      "character": "Tony"
    },
    {
      "id": "nm5298439",
      "name": "Paul Gaffney",
      "character": "Paul"
    },
    {
      "id": "nm2521588",
      "name": "Vincent B. Gorce",
      "character": "Reynard"
    },
    {
      "id": "nm4306207",
      "name": "Nate Gothard",
      "character": "Tim"
    },
    {
      "id": "nm5208337",
      "name": "Jessica Gould",
      "character": "Newspaper Reporter"
    },
    {
      "id": "nm6462392",
      "name": "Karen Gould",
      "character": "Newspaper Editor"
    },
    {
      "id": "nm3136012",
      "name": "Jamie Edward Harris",
      "character": "Solulus       (as James Harris)"
    },
    {
      "id": "nm4837829",
      "name": "David Healy",
      "character": "Norman"
    },
    {
      "id": "nm7522546",
      "name": "Damonn Hull",
      "character": "Pedestrian"
    },
    {
      "id": "nm4306328",
      "name": "Kristy Jackson",
      "character": "Miya"
    },
    {
      "id": "nm3363372",
      "name": "Elise Lamb",
      "character": "Talia       (as Rebecca Elise Lamb)"
    },
    {
      "id": "nm5718048",
      "name": "Andy Lee",
      "character": "Simon's Crew"
    },
    {
      "id": "nm5717750",
      "name": "Silvia Lee",
      "character": "Cheerleader"
    },
    {
      "id": "nm0508956",
      "name": "Richard V. Licata",
      "character": "Chief Justice"
    },
    {
      "id": "nm5717225",
      "name": "Stephen Loo",
      "character": "Simon's Crew"
    },
    {
      "id": "nm2980047",
      "name": "Woodie Mister",
      "character": "Billionaire Tycoon"
    },
    {
      "id": "nm5299578",
      "name": "Brooke Mitchell",
      "character": "Nyssa"
    },
    {
      "id": "nm6104577",
      "name": "Aziz Mohamed",
      "character": "Simon's Crew"
    },
    {
      "id": "nm2280829",
      "name": "Emlyn Elisabeth Morinelli",
      "character": "Lieutenant /              General McGinnis Staffer       (as Emlyn Morinelli McFarland)"
    },
    {
      "id": "nm4282999",
      "name": "Andrew Nathan",
      "character": "George"
    },
    {
      "id": "nm5299171",
      "name": "Lorraine Page",
      "character": "Emerald"
    },
    {
      "id": "nm4258037",
      "name": "Darrell Plumridge",
      "character": "Newspaper Boss"
    },
    {
      "id": "nm5717872",
      "name": "Rebecca Redstar",
      "character": "Cheerleader"
    },
    {
      "id": "nm2792721",
      "name": "Matthew Scully",
      "character": "John"
    },
    {
      "id": "nm9240094",
      "name": "Michael Spencer",
      "character": "Waiter /              Server       (as Michael Ziehfreund)"
    },
    {
      "id": "nm4413887",
      "name": "Sara Synnot",
      "character": "Air Council Member"
    },
    {
      "id": "nm5351555",
      "name": "Robert Weaver",
      "character": "Staffer"
    },
    {
      "id": "nm4653832",
      "name": "Satoru Yamaguchi",
      "character": "Takeshi"
    }
  ],
  "overview": "An elite firm of assassins must face their own mortality as they are hunted down one by one by a mysterious assailant. Caught up in the drama is a disgraced journalist who is more connected to the assassins' world than he could ever know.",
  "storyline": "An elite firm of assassins must face their own mortality as they are hunted down one by one by a mysterious assailant. Caught up in the drama is a disgraced journalist who is more connected to the assassins' world than he could ever know.",
  "plot": "See also: List of House of Cards episodesSeasonEpisodesOriginally released\n113February&#160;1,&#160;2013&#160;(2013-02-01)\n213February&#160;14,&#160;2014&#160;(2014-02-14)\n313February&#160;27,&#160;2015&#160;(2015-02-27)\n413March&#160;4,&#160;2016&#160;(2016-03-04)Season 1 (2013)\nMain article: House of Cards (season 1)\nFrancis \"Frank\" Underwood, a power-hungry Democratic congressman from South Carolina and House majority whip, celebrates the election of President Garrett Walker, whose campaign he assisted to get himself appointed Secretary of State. However, Underwood soon learns that he is no longer being considered for the position. Chief of Staff Linda Vasquez tells Underwood that the president wants him to promote his agenda in Congress and will not honor their agreement. Inwardly seething, Underwood quickly gains control of his anger and hides his disappointment to present himself as a helpful lieutenant to the president and his agenda. In reality, Underwood begins an elaborate plan behind the president's back, with the ultimate goal of gaining power for himself.\n\nFrank's wife Claire runs an NGO, the Clean Water Initiative (\"CWI\"), using the charity to cultivate her own power and influence, yet its ultimate purpose remains unknown. Despite the success of the operation, Claire seeks to expand its scope to the international stage, often utilizing Frank's connections to push the organization to new heights. It is clear from the outset that Claire shares both her husband's cold-hearted, ruthless pragmatism and his lust for power, and they frequently plan and scheme together to ensure the success of one another's ventures. They both work with Remy Danton, a corporate lobbyist and former Underwood staffer, to secure funds for their operations and further their influence.\n\nUnderwood begins a highly intricate plan to obtain a cabinet position, acquiring pawns he can manipulate in his power play. Underwood begins a symbiotic, and ultimately sexual, relationship with Zoe Barnes, an ambitious young political reporter, secretly feeding her damaging stories about his political rivals to sway public opinion as needed. Meanwhile, he manipulates Peter Russo, a troubled alcoholic and congressman from Pennsylvania, into helping him undermine Walker's pick for Secretary of State, Senator Michael Kern. Underwood eventually has Kern replaced with his own choice, Senator Catherine Durant. Underwood also uses Russo in a plot to end a teachers' strike and pass an education bill, which improves Underwood's standing with President Walker.\n\nBecause the new Vice President is the former governor of Pennsylvania, a special election is to be held for governor. Underwood helps Russo get clean and props up his candidacy but later uses call girl Rachel Posner to break his sobriety and trigger his public downfall shortly before the election. Distraught, Russo decides to make amends for his failure by coming clean to the press about his role in Underwood's schemes. In response, Frank kills Russo by leaving him passed out in a closed garage with Russo's car running, causing him to die of carbon monoxide poisoning. With the Pennsylvania special election in chaos, Underwood convinces the vice president to step down and run for his old position of governor – leaving the vice presidency open to Underwood, as was his plan all along.\n\nPresident Walker appears to have other plans, however. Underwood ends up vetting a surprising choice for vice president: Missouri billionaire Raymond Tusk. He later finds out that Tusk is actually appraising Underwood for vice president and has been a close advisor and friend of Walker for many years. Tusk reveals he suggested that Walker break his agreement to make Underwood Secretary of State. Tusk explains he will influence Walker to nominate Underwood if Underwood agrees to perform one unnamed favor for him that will benefit Tusk's financial interests. Underwood, after some thought, counterproposes to Tusk that they work together to fulfill both their interests, and Tusk accepts. Meanwhile, after Underwood ends their affair, Zoe begins piecing together clues about Underwood's scheming. The season ends when Underwood is offered the nomination for vice president, which he accepts.\nSeason 2 (2014)\nMain article: House of Cards (season 2)\nWith Frank on the verge of being sworn in as vice president, Zoe and her colleagues, Lucas Goodwin and Janine Skorsky, continue to dig for information into Frank's meddling, and ultimately locate Rachel Posner. As a protective measure, Frank's aide Doug Stamper brings Rachel to a safe house while Frank lures Zoe to a D.C. Metro station and, unseen by witnesses or security cameras, pushes her in front of a train, killing her. Janine realizes the truth and the danger Frank represents and decides to abandon journalism completely. Zoe's death galvanizes Lucas to continue the search alone, and he solicits the help of a hacker to retrieve Frank's text history. However, the hacker, Gavin Orsay, is actually working for Doug Stamper to entrap Lucas, and he leads the reporter to be ultimately caught in an FBI sting and plead guilty to cyber-terrorism. Later, the hacker uses the existence of Rachel Posner to extort Doug. Fearing another relocation, potential harm, and Doug's increasing obsession with her, Rachel hits Doug with a rock, leaves him for dead, and flees the scene in his car.\n\nAfter Frank begins his vice presidential duties, Claire becomes close with the First Lady, and they support a bill to reform the military's prosecution of sexual assault, after Claire reveals in an interview that she had an abortion after being raped in college by a man who has just been commissioned as a general. (Claire lied by conflating two events; a sexual assault by the college classmate, and an abortion she had several years later). She learns the president's marriage is strained and offers the First Lady the aid of a spiritual advisor and marriage counselor.\n\nThough Raymond Tusk wields major influence over the president, Frank aims to drive a wedge between them. He meets Xander Feng, a Chinese businessman and ally of Tusk's, to engage in backchannel diplomatic negotiations which Frank intentionally scuttles, though he uses the chaos of the situation to make it appear as if Tusk is equally responsible for the failed talks. This sours Sino-U.S. relations and leads to a trade war over rare earth minerals and a spike in U.S. energy prices. Tusk openly opposes the president's efforts to deal with the crisis and begins having a tribal casino funnel money into Republican PACs in retaliation. When Frank discovers that the source of the funneled money is in fact Xander Feng, he gets Feng to end his partnership with Tusk in exchange for a lucrative bridge contract.\n\nThe Department of Justice discovers that Doug Stamper was videotaped at the casino and begins to investigate the relationships among Feng, Tusk, and the White House. Seeking to establish trust with the special prosecutor, Frank manipulates the president into volunteering his travel records, which reveal his visits to the marriage counselor and raise questions about whether the illicit campaign donations were ever discussed. Wishing to avoid public disclosure of his personal issues, the president has the White House Counsel coach the counselor, which the special prosecutor interprets as witness tampering. As the House Judiciary Committee begins drafting articles of impeachment, both the President and Frank offer Tusk a presidential pardon in exchange for implicating each other. Tusk sides with the president at first, leaving Frank no other option than to regain the president's trust as a friend. The president calls off Tusk's pardon deal as a sign of friendship to Frank. Tusk appears before the Judiciary Committee where he mostly pleads the fifth. He ultimately confesses that the president knew about the deal with China. This leaves the president with no choice but to resign. Frank is sworn in as the new president of the United States.\nSeason 3 (2015)\nMain article: House of Cards (season 3)\nThe season starts six months after Frank Underwood's ascension to the Presidency. Frank begins by pushing for a new jobs program called \"America Works\" or \"AmWorks\" for short. He immediately faces immense pressure as betrayal and opposition grow inside his party. This is mostly because \"America Works\" features cutting many social programs to fund the work stations and pay workers. Determined to leave a legacy and not be a \"placeholder\" president after assuming the office, Underwood makes ambitious moves to run in the 2016 presidential elections, starting with the Democratic primaries, where he faces off against Heather Dunbar. This decision to run is announced several months after he states he will not run for the presidency during a nationwide press conference.\n\nMeanwhile, Doug Stamper recovers from the injuries caused by Rachel Posner. During his recovery, Frank Underwood will not allow Doug to help or return to his former position as Frank's chief of staff. Doug appears to switch sides and begins to work for Heather Dunbar, helping with her 2016 presidential campaign. Gavin Orsay helps Doug find Rachel in exchange for lifting the ban on his passport; the findings he delivers are of a body reported as a Jane Doe but with fingerprints matching Rachel's. Distraught and once again struggling with alcoholism, Doug entreats his brother Gary to stay with him for two months. Doug tells Frank of what has been going on while he worked for Heather Dunbar and Frank blames Doug's relapse on the extra stress. After fleeing to Venezuela, Gavin reveals he gave Doug false information and that Rachel is alive. He says he will reveal her location if Doug helps a friend get out of jail. Doug tracks down Gavin and brutalizes him for the information, then sets out to find Rachel, who is working odd jobs in New Mexico to pay for a false identity. Doug captures Rachel and drives into the desert with her, intending to kill her. He reconsiders when she tries to assure Doug she won't reveal any information about Frank Underwood's crimes and shows proof of her new identity to him. He releases her along a desolate road, but vacillates and is last seen burying her body. He returns to work as Frank Underwood's Chief of Staff after Remy Danton resigns, presumably jaded by the treatment Frank showed Jackie Sharp during the presidential debate.\n\nMeanwhile, First Lady Claire Underwood is named the United States Ambassador to the United Nations after being rejected once by the Senate and given a recess appointment by Frank. She then faces a crisis in the Jordan Valley, where Frank and the United States are pitted against the cunning President of Russia Petrov. During this crisis President Petrov has an American gay rights activist arrested in Russia and held under violation of his law on sexuality in public. Frank and Claire both try to persuade Petrov to release the man and they eventually agree on terms for release. However, one of Petrov's demands is that the activist must apologize on national television to the country for the trouble he has caused. The activist decides he would rather hang himself than apologize and does so when Claire comes to visit him. Later, after Russian troops are killed in the Jordan Valley, Petrov convinces Frank to remove Claire as ambassador to the UN in exchange for the removal of Russian troops from the Valley. Claire resigns, giving the reason that she wants to be more active in Frank's presidential campaign and would not be able to perform her duties as ambassador.\n\nDuring most of the season a writer, Thomas Yates, follows the Underwoods. Yates is hired by Frank to write a biography that Frank plans to use as publicity towards his \"AmWorks\" bill. Yates, a fiction writer with a dark past of his own, decides to put a different spin on the book and writes less about just Frank and more about the relationship between Frank and Claire. Yates reads Frank his prologue which Frank does not understand at first, but agrees is a decent beginning. By the end of the season, Yates has the first chapter written and Frank, not liking the direction the book has taken, fires Yates.\n\nIn the season finale, tensions rise between Frank and Claire and culminate in Claire's declaration that she intends to leave Frank.\nSeason 4 (2016)\nMain article: House of Cards (season 4)\nImmediately after the events of Season 3, Claire leaves D.C. for Dallas, intending to run for Congress in her home district. The incumbent, Doris Jones, is planning to retire and endorse her daughter Celia to replace her. Claire offers them federal funding for a key Planned Parenthood clinic in exchange for stepping down in the upcoming election, but they refuse the offer. Frank desperately seeks to get Claire back by his side as he loses ground in key primary states. He convinces her to return to his side after promising not to sabotage her campaign in Texas, but he later blocks Claire's congressional bid by publicly endorsing Celia Jones at the State of the Union address weeks later. Frank and Claire travel to South Carolina for the primary, but a series of scandals casts Frank in a bad light and causes him to narrowly lose the state to Heather Dunbar. Frank discovers that Claire had been leaking information to Dunbar's campaign to fuel the negative press, and she threatens to continue sabotaging his presidential bid unless he puts her on the ticket for vice presidency, which he refuses to do.\n\nLucas Goodwin is released from prison and seeks revenge against Frank. He approaches Dunbar at a campaign event and explains his story, but she turns him away. Desperate, he attempts to assassinate Frank following a public speech; he shoots the president in the abdomen and also mortally wounds Edward Meechum, but Meechum shoots Goodwin dead before dying. Frank remains comatose for weeks pending a liver transplant, and Blythe is sworn in as acting president. Blythe is indecisive during a critical military situation involving Russia, and turns to Claire for guidance on foreign policy. Claire goes against Frank’s wishes by convincing Blythe to involve China in the ensuing dispute and maneuvering into a meeting with Russian President Petrov, where she brokers an ambitious peace deal single-handedly. While Frank remains incapacitated, Doug Stamper decides to go after Dunbar by leaking information about her secret meeting with Lucas prior to the assassination attempt. Dunbar is questioned about the meeting, and she publicly denounces the proceedings as a smear campaign by the Underwoods, a move that is widely panned and leads to her suspending her presidential bid. Frank undergoes transplant surgery and recovers fully, resuming his position as president, and agrees to put Claire on the ticket for the upcoming election.\n\nTom Hammerschmidt, Goodwin's former editor at The Washington Herald, digs deeper into Lucas's claims of Frank's misdeeds. He approaches Remy Danton looking for information, and with his help, starts to piece together Frank's corruption. Tom meets with former President Walker to expose the Underwoods, convincing him to help by appealing to his anger for being forced to resign thanks to Frank's meddling. Danton and Jackie Sharp also decide to go on the record against Frank to lend credibility to the story.\n\nAn American family is kidnapped in Tennessee by two supporters of a radical Islamist group called the Islamic Caliphate Organization (ICO), and the situation makes national headlines after the kidnappers agree to negotiate only with Governor Will Conway, the social-media-savvy Republican nominee. Frank invites Conway and his family to the White House to assist in the negotiations as a publicity stunt, and Conway helps buy critical time in locating the suspects, earning him public praise. However, tensions between the Conways and Underwoods lead to the governor ending his role in the crisis and leaving D.C. with his family. Frank and Claire allow the kidnappers to speak to the deposed leader of ICO, Yusuf al Ahmadi, after successfully obtaining the release of two of the hostages. Instead of defusing the situation as he agreed, al Ahmadi urges the kidnappers to kill the remaining hostage and broadcast the killing to the public. Meanwhile, Hammerschmidt publishes his story through the Herald and threatens to end Frank's campaign weeks before the election. Claire urges Frank to use a heavier hand in the situation, and they decide to fight back by creating chaos. Frank addresses the public declaring that the nation is at total war, ordering the full force of the military be used to combat terror around the world, regardless the cost. The season ends with Frank and Claire watching the live execution of the hostage together and Claire breaking the fourth wall for the first time by looking into the camera along with Frank.\nSeason 5\n\nOn January 28, 2016, Netflix renewed House of Cards for a fifth season. It was also announced that Willimon would step down as showrunner following the fourth season. It was announced in February 2016 that Melissa James Gibson and Frank Pugliese, who both joined the show in the third season, would serve as co-showrunners for the fifth season. Season 5 will be released on May 30, 2017. In October 2016, it was announced that Patricia Clarkson and Campbell Scott had been cast for the fifth season.",
  "synopsis": null
}