{
  "imdb_id": "tt2412338",
  "tmdb_id": "133983",
  "douban_id": null,
  "title": "The Spies (2012)",
  "genres": [
    "Action",
    "Comedy"
  ],
  "country": "South Korea",
  "version": [
    {
      "runtime": "115 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm4259286",
      "name": "Min-ho Woo"
    }
  ],
  "writer": [
    {
      "id": "nm4259286",
      "name": "Min-ho Woo",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1322404",
      "name": "Hee-Bong Byun",
      "character": "Yoon       (as Hie-bong Byeon)"
    },
    {
      "id": "nm3692524",
      "name": "Gyu-Woon Jung",
      "character": "Woo"
    },
    {
      "id": "nm1047988",
      "name": "Myung-Min Kim",
      "character": "Kim"
    },
    {
      "id": "nm10300947",
      "name": "Saeromi Lee",
      "character": "President of Fujisan"
    },
    {
      "id": "nm1041999",
      "name": "Hae-jin Yoo",
      "character": "Choi"
    },
    {
      "id": "nm0947514",
      "name": "Jung-ah Yum",
      "character": "Kang"
    }
  ],
  "overview": "Kim Myeong-min (39) is Agent Kim, a family man who lives a happy and contented life with his wife and two children. He is disguised as a manager in a company that sells fake viagra imported from China. Together with his three comrades, Agent Kang (Yeom Jeong-ah, 39), Agent Woo (Jeong Kyeo-woon, 29) and Adviser Yoon (Byeon Hee-bong, 70), Agent Kim was sent to South Korea 10 years ago for a special mission.",
  "storyline": "Kim Myeong-min (39) is Agent Kim, a family man who lives a happy and contented life with his wife and two children. He is disguised as a manager in a company that sells fake viagra imported from China. Together with his three comrades, Agent Kang (Yeom Jeong-ah, 39), Agent Woo (Jeong Kyeo-woon, 29) and Adviser Yoon (Byeon Hee-bong, 70), Agent Kim was sent to South Korea 10 years ago for a special mission.",
  "plot": "Austin Millbarge is a basement-dwelling codebreaker at the Pentagon who aspires to escape his under-respected job to become a secret agent. Emmett Fitz-Hume, a wisecracking, pencil-pushing son of an envoy, takes the foreign service exam under peer pressure. Millbarge and Fitz-Hume meet during the test, on which Fitz-Hume openly attempts to cheat after an attempt to bribe his immediate supervisor in exchange for the answers backfires. Millbarge, however, was forced to take the test, having had only one day to prepare after his supervisor gives him a notice that was two weeks old.\n\nNeeding expendable agents to act as decoys to draw attention away from a more capable team, the DIA decides to enlist the two, promote them to be Foreign Service Operatives, put them through minimal training, and then send them on an undefined mission into Soviet Central Asia. Meanwhile, professional agents are well on their way to reaching the real objective: the seizure of a mobile SS-50 ICBM launcher. The main team takes a loss, while Millbarge and Fitz-Hume escape enemy attacks and eventually encounter Karen Boyer, the only surviving operative from the main team.\n\nIn the Pamir Mountains of the Tajik Soviet Socialist Republic, the trio overpowers a mobile missile guard unit using hastily constructed extraterrestrial outfits and tranquilizer guns. Following orders in real-time from the intelligence agency (operating from a military bunker located deep under an abandoned drive-in theater), they begin to operate the launcher. At the end of their instructions, the vehicle launches the ICBM into space, targeting an unspecified area in the United States. Thinking they have begun a nuclear war, the American agents and their Soviet counterparts pair up to have sex before the world ends.\n\nMeanwhile, the military commander at the operations bunker, initiates the conversion of the drive-in theater to expose what is hidden beneath the screens and projection booth: a huge black-op SDI-esque laser and collector/emitter screen. The purpose of sending the agents to launch a Soviet ICBM is thereby exposed as a means to test this anti-ballistic missile system. Unfortunately, the laser fails to intercept the nuclear missile, which is heading for the U.S. and will almost certainly trigger a global thermonuclear war.\n\nBack in the Soviet Union, horrified at the thought of having launched a nuclear missile at their own country, the American spies and the Russian soldiers use Millbarge's technical knowledge to force a malfunction in the launcher vehicle and transmit junk instructions to the traveling missile, sending it off into space where it detonates harmlessly. Immediately after, the underground bunker is stormed by U.S. Army Rangers, and the intelligence and military officials involved in the covert operation are arrested. Millbarge, Fitz-Hume, and Boyer go on to become nuclear disarmament negotiators, playing a nuclear version of Risk-meets-Trivial Pursuit against the Soviets.",
  "synopsis": "Kim Myeong-min (39) is Agent Kim, a family man who lives a happy and contented life with his wife and two children. He is disguised as a manager in a company that sells fake viagra imported from China. Together with his three comrades, Agent Kang (Yeom Jeong-ah, 39), Agent Woo (Jeong Kyeo-woon, 29) and Adviser Yoon (Byeon Hee-bong, 70), Agent Kim was sent to South Korea 10 years ago for a special mission."
}