{
  "imdb_id": "tt2401575",
  "tmdb_id": "157763",
  "douban_id": null,
  "title": "Shannon's Rainbow (2009)",
  "genres": [
    "Drama",
    "Family"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "92 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm0425100",
      "name": "Frank E. Johnson"
    }
  ],
  "writer": [
    {
      "id": "nm1117218",
      "name": "Linda Morris",
      "description": "writer"
    },
    {
      "id": "nm0610286",
      "name": "John Mowod",
      "description": "writer"
    },
    {
      "id": "nm2234909",
      "name": "Larry Richert",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0585034",
      "name": "Julianne Michelle",
      "character": "Shannon Greene"
    },
    {
      "id": "nm0000435",
      "name": "Daryl Hannah",
      "character": "Rita Baker"
    },
    {
      "id": "nm0000514",
      "name": "Michael Madsen",
      "character": "Dave Blair"
    },
    {
      "id": "nm0001586",
      "name": "Joanna Pacula",
      "character": "Emily Blair"
    },
    {
      "id": "nm0001231",
      "name": "Claire Forlani",
      "character": "Christine Pearson"
    },
    {
      "id": "nm0389423",
      "name": "Suzi Hofrichter",
      "character": "Nurse Dana"
    },
    {
      "id": "nm1739873",
      "name": "Stephen Colletti",
      "character": "Brandon"
    },
    {
      "id": "nm1891268",
      "name": "Carson Brown",
      "character": "Rio"
    },
    {
      "id": "nm0001263",
      "name": "Jason Gedrick",
      "character": "Eric Parker"
    },
    {
      "id": "nm0000616",
      "name": "Eric Roberts",
      "character": "Mitchell Prescott"
    },
    {
      "id": "nm0020739",
      "name": "Krista Allen",
      "character": "Jessica"
    },
    {
      "id": "nm0308606",
      "name": "Willie Garson",
      "character": "Richard"
    },
    {
      "id": "nm2207222",
      "name": "Scott Eastwood",
      "character": "Joey"
    },
    {
      "id": "nm0000430",
      "name": "Steve Guttenberg",
      "character": "Ed"
    },
    {
      "id": "nm0001164",
      "name": "Charles Durning",
      "character": "Floyd"
    },
    {
      "id": "nm0257495",
      "name": "Joycelyn Engle",
      "character": "Jaimie"
    },
    {
      "id": "nm3051380",
      "name": "Melissa Spielberg Katz",
      "character": "Rory"
    },
    {
      "id": "nm0001283",
      "name": "Louis Gossett Jr.",
      "character": "Max Donovan"
    },
    {
      "id": "nm0610286",
      "name": "John Mowod",
      "character": "Pritchard"
    },
    {
      "id": "nm0040662",
      "name": "Tom Atkins",
      "character": "Captain Martin"
    },
    {
      "id": "nm2234909",
      "name": "Larry Richert",
      "character": "Weatherman"
    },
    {
      "id": "nm5055142",
      "name": "Western Hurricane",
      "character": "Rainbow"
    }
  ],
  "overview": "After the sudden death of her father leaves a teenage girl without a family, she becomes lost in her own anger and sadness. Her family doctor (Daryl Hannah) informs her that her father had a secret, that the mother she never knew (Claire Forlani) was alive and well. When she travels to meet her, she befriends a horse trainer (Louis Gossett Jr) and discovers that in caring for the horse, she is able to overcome her hardships and emotional trauma. Together they begin to win many races and upset the favorites, owned by an egocentric mogul (Eric Roberts). Through the victories and new friendships she forms, she learns to find her way back to happiness.",
  "storyline": "After the sudden death of her father leaves a teenage girl without a family, she becomes lost in her own anger and sadness. Her family doctor (Daryl Hannah) informs her that her father had a secret, that the mother she never knew (Claire Forlani) was alive and well. When she travels to meet her, she befriends a horse trainer (Colletti, Stephen) and discovers that in caring for the horse, she is able to overcome her hardships and emotional trauma. Together they begin to win many races and upset the favorites, owned by an egocentric mogul (Eric Roberts). Through the victories and new friendships she forms, she learns to find her way back to happiness.",
  "plot": "A 17-year-old girl (Julianne Michelle) faces and overcomes hardship with the discovery of the mother she never knew and with her love for a hobbled horse named Rainbow. With her father dying in the earliest moments of the film Shannon has to learn from a friend of the family that her father participated in kidnapping her from her mother (Christine) moments after birth. Once the hospital therapist is through with her she ends up moving from Florida to Pennsylvania where Christine lives and works as a neo-natal pediatrician. She gets involved in the lives of Christine's boyfriend Eric and his nephew Brandon and niece Rio. They have a stables that works in harness racing and have been bringing along a filly named Rainbow who takes very strongly to Shannon. Eric and those around him are targets of a spiteful grudge held by the rich Mitchell Prescott who buys the filly for $15,000 in a claiming race she was entered in for experience. Mitchell runs Rainbow into the ground, having her beaten until nearly dead for the sin of having a mind of her own and an unshakable preference for Shannon, then sells her off to the knackers. Eric is alerted to this and tracks down the horse van en route to the location where Rainbow is due to be slaughtered and buys her back for $400. The filly is returned to Shannon's care and a trainer with a murky past (Max) is given the task to return her to health and soundness. They move Rainbow to a neighboring farm to train her to racing fitness while avoiding a spy at Parker stables. The culmination is at the Pennsylvania Cup harness race.",
  "synopsis": null
}