{
  "imdb_id": "tt2419640",
  "tmdb_id": "263498",
  "douban_id": null,
  "title": "Vanavarayan Vallavarayan (2014)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "136 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.1,
  "director": [
    {
      "id": "nm3597166",
      "name": "Rajamohan"
    }
  ],
  "writer": [
    {
      "id": "nm3597166",
      "name": "Rajamohan",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4935635",
      "name": "Krishna Sekhar",
      "character": "Vannavarayan"
    },
    {
      "id": "nm5295004",
      "name": "Makapa Anand",
      "character": "Vallavarayan"
    },
    {
      "id": "nm5237591",
      "name": "Monal Gajjar",
      "character": "Anjali"
    },
    {
      "id": "nm5294040",
      "name": "Niharika Kareer",
      "character": ""
    },
    {
      "id": "nm1335574",
      "name": "S.P.B. Charan",
      "character": ""
    },
    {
      "id": "nm0417310",
      "name": "Showkar Janaki",
      "character": ""
    },
    {
      "id": "nm0764821",
      "name": "Kovai Sarala",
      "character": ""
    },
    {
      "id": "nm4446366",
      "name": "Thambi Ramayya",
      "character": ""
    },
    {
      "id": "nm1957308",
      "name": "V. Jayaprakash",
      "character": ""
    },
    {
      "id": "nm1572739",
      "name": "Meera Krishna",
      "character": ""
    },
    {
      "id": "nm1962272",
      "name": "Santhanam",
      "character": "Guest Appearance"
    }
  ],
  "overview": "Vaanu (Kreshna) and Vallu (Ma Ka Pa Anand) belong to a wealthy family and lead a happy life. They are jobless and roam around their town doing mischievous acts. They behave as arch rivals, who really care for each other. What happens when Vaanu falls in love with Anjali (Monal Gajjar) forms the crux of the story.",
  "storyline": "Vanavarayan (Krishna) and Vallavarayan (Makapa Anand) are siblings and their unity seems to end with the same family that they belong to, and come across as arch rivals who bring the roof down in their fight. But they share a unique bond wherein no matter however much they fight, they never let down on the other. After several failures straight, Vanavarayan finally lands a beautiful girl, Anjali (Monal) and is very sincerely in love with her. Their secret affair creeps out and when their respective families and villagers come into the picture, it turns into a nasty business. Vallavarayan tries to help but only complicates issues further at each step !",
  "plot": "The story revolves around two brother's relationship that breaks because of a girl and the story is filled with love, romance, comedy, action, entertainment etc.\n\nVanavarayan and Vallavarayan are two brothers who are care-free teenagers. One day Vanavarayan meets a girl named Anjali in a marriage and falls in love with her. In the beginning she rejects him. Vanavarayan follows her and she accepts his love at last. Their love journey goes well until one day they travel to Pazhani. Anjali with her lover is seen by her uncle who is a drunkard. After this incident, Anjali's family arranges her marriage with Suresh, a USA return wealthy man, portrayed by Santhanam.\n\nAnjali breaks down and secretly meets Vanavarayan. But the family mistakes them as they are running away. So Anjali's brother, portrayed by S. P. B. Charan beats Vanavarayan. On hearing this incident Vallavarayan in drunken state pulls Anjali's father, portrayed by Jayaprakash from her house and beats and tears his cloth before the public. This makes Anjali to hate Vanavarayan and insists Vanavarayan to throw away his relation with his brother, then only she will marry him. But Vanavarayan says that his brother is important to him than her and starts to ignore her.\n\nBut Vallavarayan finds that Vanavarayan is unable to forget Anjali. So he plan to reunite Vanavarayan with Anjali but all plans going in vain. How Vanavarayan unites the pair and Does Vanavarayan sacrifice his relation with his brother for his love for Anjali? is the rest of the story.",
  "synopsis": null
}