{
  "imdb_id": "tt2483208",
  "tmdb_id": "255278",
  "douban_id": null,
  "title": "Way of the Wicked (2014)",
  "genres": [
    "Fantasy",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "92 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.8,
  "director": [
    {
      "id": "nm0140109",
      "name": "Kevin Carraway"
    }
  ],
  "writer": [
    {
      "id": "nm0403926",
      "name": "Matthew Robert Kelly",
      "description": "as Matt Kelly"
    }
  ],
  "cast": [
    {
      "id": "nm0005068",
      "name": "Vinnie Jones",
      "character": "John Elliot"
    },
    {
      "id": "nm0000225",
      "name": "Christian Slater",
      "character": "Father Henry"
    },
    {
      "id": "nm0855045",
      "name": "Emily Tennant",
      "character": "Heather Elliot"
    },
    {
      "id": "nm5651478",
      "name": "Jake Croker",
      "character": "Robbie Mueller"
    },
    {
      "id": "nm3208246",
      "name": "Aren Buchholz",
      "character": "Greg"
    },
    {
      "id": "nm0403926",
      "name": "Matthew Robert Kelly",
      "character": "Detective Fleming       (as Matt Kelly)"
    },
    {
      "id": "nm1243009",
      "name": "Brittney Wilson",
      "character": "Cindy"
    },
    {
      "id": "nm5288835",
      "name": "Jedidiah Goodacre",
      "character": "Matt"
    },
    {
      "id": "nm0267295",
      "name": "Jillian Fargey",
      "character": "Elizabeth"
    },
    {
      "id": "nm1528483",
      "name": "Chris Shields",
      "character": "Teacher"
    },
    {
      "id": "nm0303442",
      "name": "Anna Galvin",
      "character": "Laura"
    },
    {
      "id": "nm5670303",
      "name": "Sydney Waack",
      "character": "Young Heather"
    },
    {
      "id": "nm2566096",
      "name": "Ryan Grantham",
      "character": "Young Robbie"
    },
    {
      "id": "nm2784156",
      "name": "Jason Burkart",
      "character": "Janitor"
    },
    {
      "id": "nm3295755",
      "name": "Bal Nagra",
      "character": "Boy #1"
    },
    {
      "id": "nm4109908",
      "name": "Clive Holloway",
      "character": "Boy #2"
    },
    {
      "id": "nm8375403",
      "name": "Daniel Jones",
      "character": "Steve"
    },
    {
      "id": "nm5757013",
      "name": "Adrian Preoteasa",
      "character": "Greg's Buddy"
    },
    {
      "id": "nm0912714",
      "name": "Ally Warren",
      "character": "Teacher"
    }
  ],
  "overview": "Lawrence Salva's script centers on a detective (Facinelli), on the trail of a murderer, who is led to believe that a local teenager, harboring some sort of strange supernatural power, may be involved. Slater plays the man's disbelieving boss, while Hauer plays a man-of-the-cloth who aids the cop on his mission.",
  "storyline": "Father Henry goes to a local police detective and they learn that a troubled teen with a dark past has recently moved to town and has set his sights on the cop's beautiful, young daughter. Father Henry, who turns out to have secrets of his own, finds himself pitted against a demonic force more diabolically evil and twisted than any of them could have imagined.",
  "plot": "Act One\n\nThe Ozians are cheering that the Wicked Witch of the West, Elphaba, is dead (\"No One Mourns the Wicked\"). Glinda arrives and an Ozian asks her if she and Elphaba were friends. She admits that they knew each other, which surprises all of the Ozians, leading Glinda to tell them the story of how they became best friends. She also tells them her name was Galinda before she changed it. A flashback starts with a scene in a school, Shiz, where Elphaba arrives. Elphaba (later known as the Wicked Witch of the West) was the daughter of the governor of Munchkinland - but it is heavily implied that she is the product of an affair between the governor's wife and a mysterious stranger and his bottle of \"green elixir.\" Elphaba was born with green skin. Her father despised her and showered his affection on her younger sister, Nessarose, who is a wheelchair user. The two sisters both go to Shiz University, where the pretty and popular Galinda is also in their class (\"Dear Old Shiz\"). As their father says goodbye, he gives Nessarose a pair of silver slippers. The headmistress, Madame Morrible, decides to take Nessarose under her protection, despite Elphaba's objections. Elphaba is now without a roommate and ends up with Galinda, to the disgust of both. Elphaba attempts to take back her sister as she is wheeled away, and her frustration manifests itself physically in an explosion. Madame Morrible recognizes that she has special powers and decides to teach her sorcery - and to teach no one else, even though Galinda had her heart set on studying magic at school. She even tells Elphaba that her powers might allow her to work with the Wonderful Wizard of Oz, something which Elphaba has dreamed of (\"The Wizard and I\").\n\nAll of this does little to endear Elphaba to Galinda and the feeling is mutual (\"What is this Feeling?\"). They clash constantly, even in their classes, such as their history class with Dr. Dillamond. Dr. Dillamond is the only Animal professor at the university and is beginning to suffer from discrimination, even from the students, which is shown when someone writes \"Animals should be seen and not heard\" on the chalkboard. He tells Elphaba that there is a conspiracy to stop the Animals from speaking, and she wants to let the Wizard know, for he would surely stop it (\"Something Bad\").\n\nMeanwhile, a young roguish prince, Fiyero, has arrived at Shiz. Galinda is charmed when Fiyero shares his life philosophy (\"Dancing Through Life\"). They all decide to have a party that evening. Boq, a Munchkin that has developed a crush on Galinda, tries to invite her to the party, but she convinces him instead to ask Nessarose out of pity, leaving her free to go with Fiyero. Nessarose is delighted and tells her sister how she and Boq are meant to be together and how Galinda helped it happen. When Galinda offers Elphaba a hat to wear to the party, Elphaba begins to wonder if she was wrong about her roommate.\n\nAt the party that evening, Boq tries to tell Nessarose the real reason he invited her, but is unable to hurt her feelings. She is becoming infatuated with him. Madame Morrible arrives to tell Galinda that she can join her sorcery class, at Elphaba's request. Elphaba herself arrives, wearing the hat Galinda gave her, a witch's hat. The other students laugh and stare while Elphaba awkwardly dances on her own. Galinda feels terrible, and goes to dance with Elphaba. Soon everyone joins them, and the two girls look at each other in a new light.\n\nBack in their room, they continue to bond. Galinda tells Elphaba of her plans to marry Fiyero even though he hasn't proposed and Elphaba confesses that her father blames her for the death of her mother, who died birthing Nessarose. Galinda decides that she will help Elphaba become popular and she gives her roommate the nickname \"Elphie\" (\"Popular\"). When Elphaba arrives at class the next day, Fiyero sees Galinda's influence, and tells Elphaba that she doesn't need to change. Dr. Dillamond enters to tell the class that he is leaving - he is no longer permitted to teach. Elphaba wants to help, but no one will stand up with her. The students are introduced to the new technological advancement of the cage, which will keep Animals controlled, so that they never learn to speak. Elphaba's outrage cannot be contained, and in the ensuing chaos, she and Fiyero grab the Lion cub (\"Cowardly Lion\") in the cage and escape.\n\nFiyero is confused about what he has just seen and what he is doing, but he is caught up in Elphaba's passion. She begins to fall in love with him and they share a moment before he has to leave to free the lion cub. Elphaba reminds herself that it's pointless to wish for something to happen between them (\"I'm Not that Girl\"). Madame Morrible comes and tells her that the Wizard has asked to meet her. Nessarose and Galinda come to see her off, and Fiyero meets her too. Galinda is saddened by Fiyero's emotional distance from her, and tries to win his respect by changing her name to \"Glinda\", in solidarity with Dr. Dillamond, who could not pronounce the first syllable of her name. But Fiyero barely notices, saying goodbye to Elphaba, and it is suggested that her feelings for him are mutual. Elphaba invites Glinda to the Emerald City with her (\"One Short Day\").\n\nAt last, the two girls stand in front of the Wizard. He turns out to be not quite as terrifying as they thought (\"A Sentimental Man\"). He promises Elphaba that he will grant her request if she proves herself. Madame Morrible appears - she is the Wizard's new \"Press Secretary\". She gives Elphaba an ancient book of spells, called the \"Grimmerie,\" which only the magically gifted can read. Elphaba is asked to try a levitation spell on the Wizard's monkey servant, Chistery. However, the spell doesn't go the way Elphaba plans when Chistery sprouts wings, and she realizes that the Wizard is the one behind the suppression of the Animals. Elphaba has been tricked, and instead of just performing the spell on one monkey, she actually performed the spell on all of them. Elphaba realizes that the Wizard is not who she thought he was - he has no powers; he is merely a charlatan who cannot read the Grimmerie. He offers her and Glinda everything they've ever wanted if they will help him, but Elphaba is unable to comply. She runs away, and in order to prevent the truth from getting out, Madame Morrible spreads reports that Elphaba is \"wicked,\" not to be trusted, and claims that Elphaba is the one behind the animal mischief. This only reaffirms Elphaba's belief that she must not let anyone hold her down; she must go on her own to do what's best for her. She performs a spell on a broom and flies. (\"Defying Gravity\").\n\nAct Two\n\nSome time later, Elphaba's opposition of the Wizard's regime has earned her the title \"The Wicked Witch of the West\". Glinda has become the smiling public front of the Wizard's regime, given the title \"Glinda the Good\" and positioned by Morrible as the nation's defender against the Witch. A press conference to celebrate Fiyero's appointment as Captain of the Guard (a position he has accepted in order to find Elphaba) is hijacked by the crowd's panicked rumors about the Witch, including an idiotic story that she will be melted by water. Fiyero is furious and not calmed by Glinda's insistence that Elphaba does not want to be found. He is further shocked when Morrible announces his engagement to Glinda. This is news to Fiyero and he storms off. Glinda attempts to keep a cheerful front for the press, but it is clear she realizes her dream life has come at a great price (\"Thank Goodness\").\n\nElphaba pays a visit to Nessarose, who is now the governor of Munchkinland following the death of their father, who Nessarose says \"died of shame\" when he heard what Elphaba did. Nessarose has taken away the rights of the Munchkins in a desperate attempt to keep Boq at her side. Elphaba tries to convince her sister to side with her against the Wizard, but Nessarose is more concerned with her own problems. Elphaba tries to help by giving Nessarose the power to walk by turning the silver slippers into the \"Ruby Slippers\". Convinced that Boq must love her now, Nessarose calls for him, but he only sees this as proof that she doesn't need him any more. Furious, Nessarose takes Elphaba's spell book and tries to cast a spell to make Boq fall in love with her. However, the spell backfires, making her the \"Wicked Witch of the East\", shrinking Boq's heart. Elphaba must work another spell to save his life, if in a slightly different condition than he was before. When Boq awakens, he is horrified at his new state as a man made of tin, and Nessarose tells him it was Elphaba who did this to him.\n\nElphaba returns to the Wizard's palace to free the monkey servants and comes across the Wizard himself. He tries once again to convince her to work with him, telling her that he is not evil - just a mediocre man who came into his position by chance, led to stay by the reverence of the Ozians, and he offers to redeem Elphaba's reputation (\"Wonderful\"). She is almost won over, until she sees Dr. Dillamond, who has lost the power of speech. She vows to fight the Wizard until the end. Fiyero and the guards enter, followed by Glinda. Fiyero helps Elphaba escape, and decides to escape with her, leaving Glinda behind. Though she was broken-hearted, Glinda reminds the Wizard and Madame Morrible that the way to recapture Elphaba is to make her think her sister is in trouble, and she will be sure to come to her rescue. She mourns that Fiyero does not love her (\"I'm Not that Girl, Reprise\").\n\nElphaba and Fiyero are both taken by surprise by the strength of their feelings for each other, and promise to be together always (\"As Long As You're Mine\"). Their happiness is interrupted when Elphaba suddenly has a vision of a house flying through the sky and Nessarose being in pain. Before Elphaba leaves to investigate, Fiyero tells her about a castle that his family owns that she can stay in.\n\nGlinda and Elphaba meet again at the site where Nessarose has been crushed by a house with a girl named Dorothy inside. Fueled by the rivalry over Fiyero, the two have a heated argument. The guards arrive, and Elphaba guesses that Glinda arranged for all of this. Fiyero arrives as well, and holds Glinda hostage until Elphaba can escape. Glinda realizes that Fiyero does truly love Elphaba, and tells the guards not to hurt him, but they don't listen as they escort Fiyero to the field where they can interrogate him into revealing where Elphaba has fled to so they can recapture her. Elphaba tries to cast a spell to save his life and protect him from injury, but is frustrated by the limitations of her power. She decides that from this point on, she will live up to her reputation as the Wicked Witch of the West (\"No Good Deed\").\n\nMeanwhile, the citizens of Oz, spurred on by Madame Morrible and Boq's testimony, band together to help rescue Dorothy from the clutches of the Wicked Witch of the West. Glinda has realized Morrible, who can control the weather, is responsible for Nessarose's death, but when she confronts her, Morrible tells her that there is blood on her hands as well and advises her to smile and wave. Glinda flees in horror to warn Elphaba as the angry mob sets out to Kiamo Ko to kill Elphaba. (\"March of the Witch Hunters\").\n\nBack at Kiamo Ko, Elphaba has already captured Dorothy, refusing to release her until she relinquishes Nessarose's slippers – the only things left of her dead sister. Glinda travels to Elphaba's castle to warn her of the danger and persuade her to let Dorothy go. Elphaba refuses until she suddenly receives a letter saying that Fiyero has supposedly died. The two women forgive each other for all grievances, acknowledging they have both made mistakes. To help her in her future, Elphaba gives the Grimmerie to Glinda. The two friends embrace for the last time before saying goodbye forever, and acknowledge that they are who they are because of each other (\"For Good\"). As the mob arrives at the castle, Elphaba tells Glinda to hide, and she watches from the shadows as Dorothy throws a bucket of water on Elphaba, who appears to melt away. Grief-stricken, Glinda sees that all that remains of her friend is her black hat and the small bottle of green elixir which she had slept with under her pillow.\n\nBack at the Emerald City, Glinda confronts the Wizard with Elphaba's bottle, which he recognizes as identical to his own. He was Elphaba's biological father, and the cause of her green skin. He breaks down in agony, and Madame Morrible surmises that Elphaba's powers were so strong because she was a child of two worlds. Glinda orders the Wizard to leave Oz and sends Madame Morrible to prison for murdering Nessarose.\n\nMeanwhile, back at the castle, Fiyero (now a scarecrow) comes to the spot where Elphaba was melted. Making sure that no one is observing, he knocks on the floor and out from a trap door steps Elphaba, very much alive; the entire thing was a ruse to convince her enemies of her death and to ensure her future with Fiyero, who was transformed into the scarecrow by her spell in the process. Before leaving, Elphaba regrets that she'll never see Glinda again and tell her that she and Fiyero are alive. Simultaneously, returning to the musical's starting point, Glinda reports to the people of Oz that the Wicked Witch of the West has been killed and promises to properly earn her title as Glinda the Good. As the people celebrate and Glinda mourns, Elphaba and Fiyero leave Oz behind. (\"Finale\")",
  "synopsis": null
}