{
  "imdb_id": "tt2402105",
  "tmdb_id": "192134",
  "douban_id": null,
  "title": "Dom Hemingway (2013)",
  "genres": [
    "Comedy",
    "Crime",
    "Drama"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "93 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm0791672",
      "name": "Richard Shepard"
    }
  ],
  "writer": [
    {
      "id": "nm0791672",
      "name": "Richard Shepard",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0000179",
      "name": "Jude Law",
      "character": "Dom Hemingway"
    },
    {
      "id": "nm6391377",
      "name": "Luca Zoo Franzoni",
      "character": "Dom's Prison Buddy       (as Luca Franzoni)"
    },
    {
      "id": "nm0334262",
      "name": "Richard Graham",
      "character": "Prison Guard"
    },
    {
      "id": "nm0842118",
      "name": "George Sweeney",
      "character": "Man Outside Pub"
    },
    {
      "id": "nm0935047",
      "name": "Mark Wingett",
      "character": "Man Outside Pub 2"
    },
    {
      "id": "nm0062030",
      "name": "David Baukham",
      "character": "Security Guard"
    },
    {
      "id": "nm0706456",
      "name": "Nick Raggett",
      "character": "Sandy Butterfield"
    },
    {
      "id": "nm2941345",
      "name": "Simeon Moore",
      "character": "Andrew"
    },
    {
      "id": "nm0001290",
      "name": "Richard E. Grant",
      "character": "Dickie Black"
    },
    {
      "id": "nm2376677",
      "name": "Glenn Hirst",
      "character": "Barman"
    },
    {
      "id": "nm6391378",
      "name": "Kaitana Taylor",
      "character": "Girl at Bar"
    },
    {
      "id": "nm5181018",
      "name": "Colette Morrow",
      "character": "Girl at Bar"
    },
    {
      "id": "nm3390573",
      "name": "Jeanie Gold",
      "character": "Barmaid"
    },
    {
      "id": "nm6391379",
      "name": "Brenda Palmer",
      "character": "Lady on Train"
    },
    {
      "id": "nm5222195",
      "name": "Philippe Pierrard",
      "character": "Lardo"
    },
    {
      "id": "nm4793106",
      "name": "Mãdãlina Ghenea",
      "character": "Paolina       (as Madalina Ghenea)"
    },
    {
      "id": "nm0065007",
      "name": "Demián Bichir",
      "character": "Mr. Fontaine       (as Demian Bichir)"
    },
    {
      "id": "nm0174403",
      "name": "Kerry Condon",
      "character": "Melody"
    },
    {
      "id": "nm3869310",
      "name": "Claire Viville",
      "character": "Blond Party Girl"
    },
    {
      "id": "nm3592338",
      "name": "Emilia Clarke",
      "character": "Evelyn"
    },
    {
      "id": "nm2805533",
      "name": "Nathan Stewart-Jarrett",
      "character": "Hugh"
    },
    {
      "id": "nm5636183",
      "name": "Jordan A. Nash",
      "character": "Jawara       (as Jordan Nash)"
    },
    {
      "id": "nm6391380",
      "name": "Fams Camara",
      "character": "Senegalese Friend"
    },
    {
      "id": "nm6391381",
      "name": "Omar Jallow",
      "character": "Senegalese Friend"
    },
    {
      "id": "nm6391382",
      "name": "Aileen McNally",
      "character": "Evelyn's Band"
    },
    {
      "id": "nm6391383",
      "name": "Moses Elliott",
      "character": "Evelyn's Band"
    },
    {
      "id": "nm6391384",
      "name": "Robb Skipper",
      "character": "Evelyn's Band"
    },
    {
      "id": "nm2567996",
      "name": "Joel Hodge",
      "character": "Evelyn's Band"
    },
    {
      "id": "nm2238584",
      "name": "Jumayn Hunter",
      "character": "Lestor"
    },
    {
      "id": "nm6391385",
      "name": "Brahim Shala",
      "character": "Lestor's Goon"
    },
    {
      "id": "nm6391386",
      "name": "Earnesto Guthrie",
      "character": "Lestor's Goon"
    },
    {
      "id": "nm6391387",
      "name": "Samio Olowu",
      "character": "Lestor's Girl"
    },
    {
      "id": "nm2410873",
      "name": "Hayley-Marie Coppin",
      "character": "Ping Pong Girl       (as Hayley Coppin)"
    },
    {
      "id": "nm6391388",
      "name": "Scott Goodall",
      "character": "Safe Security Guard"
    },
    {
      "id": "nm6391389",
      "name": "Ray Sloane",
      "character": "Safe Security Guard"
    },
    {
      "id": "nm0751167",
      "name": "Grant Russell",
      "character": "Paolina's Date"
    }
  ],
  "overview": "After spending 12 years in prison for keeping his mouth shut, notorious safe-cracker Dom Hemingway is back on the streets of London looking to collect what he's owed.",
  "storyline": "Vulgar, brash and loud, Dom Hemingway has just been released from prison after serving twelve years for his crime as a safe-cracker working for Ivan Fontaine, who Dom's best friend and associate Dickie Black calls one of the most dangerous men in Europe. Dom left the employ of Lestor McGreevy, a man he generally disliked, to work for Fontaine. Dom could have easily plea bargained with the authorities to give up information on Fontaine for a reduced sentence, he not doing so which resulted in he never again seeing his wife Katherine who died of cancer while he was in prison, and now being estranged from his young adult daughter Evie who sees his choice as his priority of Fontaine over her and her mother. For his silence and giving up twelve years of his life, Dom believes Fontaine owes him and owes him big, and with Dickie by his side, tries to track down Fontaine for that payment. Despite his encounter with a young new ageist woman named Melody, his actions which she vows will lead to...",
  "plot": "Safecracker Dom Hemingway (Jude Law) is released after spending 12 years in prison and seeks payment for refusing to rat out his boss Ivan Fontaine (Demián Bichir). He reunites with his best friend Dickie (Richard E. Grant) and they travel to Fontaine's villa in the French countryside. Dom flirts with Fontaine's Romanian girlfriend Paolina (Mădălina Diana Ghenea) and becomes angry that he spent 12 years in jail for Fontaine. He begins to mock Fontaine and storms out. At dinner, he apologises and Fontaine presents Dom with £750,000.\n\nThey spend the night partying with two girls, one of whom, Melody (Kerry Condon) strikes up a conversation with Dom. When the group go driving in Fontaine's car, they crash into another car. While unconscious, Dom has a vision of Paolina asking for his money. He wakes up, resuscitates Melody, and finds Fontaine impaled on the car's fender. Melody tells Dom that, because he saved her, he shall gain good luck when he least expects it.\n\nDom and Dickie head back to the mansion, where they find Paolina has taken Dom's money, but they see her leaving in a car. Dom runs through the forest and into the road, where he is almost hit by Paolina. She asks him if she strikes him as a woman who wants to be poor, and drives away.\n\nA few days later, Dom returns to London and collapses outside the apartment of his estranged daughter, Evelyn (Emilia Clarke). He wakes up and Evelyn's boyfriend Hugh (Nathan Stewart-Jarrett) introduces Dom to his grandson, Jawara. Hugh says that Evelyn is upset that Dom left her and was in prison, missing out on her childhood and his wife Katherine's death. Hugh suggests Dom visit Evelyn after her concert at a local club and attempt to reconcile. He goes to the concert, but leaves and meets Dickie. Dom says he wants to work for Lestor McGreevy Jr., the son of Fontaine's old rival. Dickie says Lestor is even worse than his father, but Dom says he needs work. Dom follows Lestor on his daily jog and learns Lestor holds a grudge for Dom killing his cat when he was a child is loosely based on (Punch) Pavle or Paulie subsequently all the crime characteristic's of the son of this one time crime figure Voislav Stanimirović his son owned clubs. Lestor tells Dom to go to his club that night. They make a bet. If he opens an electronic safe he gets work, if he fails to open it in 10 minutes, Lestor will cut off his genitalia.\n\nDom and Dickie go to Lestor's club and Dom opens a safe in 10 minutes with a sledgehammer, only to learn the real safe is inside that safe. Before Lestor can cut off Dom's penis, Dickie smashes Lestor on the head with a statue and Dom knocks out his thugs with the sledgehammer. They run away from Lestor's club and Dom goes back to the local club where Evelyn was performing. There, Evelyn tells Dom he would only have spent three years in prison if he had ratted on Fontaine; because he didn't, he missed out on her childhood and her mother dying. Evelyn tells Dom that all she wanted was a real father. She turns her back on him and leaves. The next day, Dom sees Melody on her scooter and says he hasn't received good luck. She says it will come soon.\n\nDom visits the grave of his wife Katherine and apologises. He turns and sees his grandson Jawara sitting next to him. He walks Jawara out of the cemetery and takes him back to Evelyn. He asks if he can walk with them in silence, but she says they have to hurry home. She says Dom can take Jawara to school on Monday if he doesn't get drunk on Sunday night. As they walk away, Jawara waves to Dom, who waves back. He walks in the opposite direction and sees Paolina enter a restaurant with an older man. He enters the restaurant and grips Paolina's hand. He whispers threats and continues to clutch her hand, before leaving he kisses her. As he leaves the restaurant, he smiles as it is revealed that he has stolen Paolina's diamond ring.",
  "synopsis": "The first thing we hear is Dom Hemingway (Jude Law) asking, \"Is my cock not exquisite?\" He continues to praise his cock, saying outlandish things like it ought to win the first ever Nobel Peace Prize to be given to a cock, and that it could save starving children in third world countries. He then orgasms and tells the person giving him oral sex, sorry for not giving him a warning.Chapter 1: 12 YEARS IS A LONG TIMEDom is eating pudding in the prison cafeteria when a guard comes over to talk to him. He tells Dom to put his fork down but Dom insists on finishing his pudding. He relents and speaks to the guard. He tells Dom that the call he's been waiting for has arrived. Dom smiles. He is released from prison, with the other inmates chanting his name and throwing toilet paper out the windows.Dom spots two men standing outside a pub. He asks both of them where to find Sandy Butterfield (Nick Raggett). After he shoves one man's drink out of his hand, the other man tells Dom that Sandy is still working at a garage. Dom goes to this garage and beats Sandy's face in because he got with Dom's wife while he was in prison. Sandy defends his actions because they had been divorced, but Dom continues to pound the guy's face. When he's done, he turns to two other guys and makes friendly talk with them.Dom reunites with his former partner, Dickie Black (Richard E. Grant), in a pub. Dom pulls out a cigarette to smoke, but he's told by the bartender and Dickie that smoking's been banned. Regardless, he lights it up and gives Dickie one to smoke as well. Dickie tells Dom that their former employer, Mr. Ivan Anatoly Fontaine (Demian Bichir) has not forgotten that he owes Dom. Dom had worked for Fontaine as a safe-cracker and served 12 years for not testifying against him. Dom knows he's missed a lot over the years, including a relationship with his daughter Evelyn (Emilia Clarke). In the corner of the pub are two girls, said by Dickie to be sent as gifts to Dom from Fontaine. An eager Dom scoops one of the ladies up and kisses the other. He announces to the pub, \"No one call me for three days!\"The next day, a hungover Dom ventures with Dickie on a train to head to the south of France to meet with Fontaine. At the station, a heavyset man meets the two and says he was sent by Fontaine. He tells the two to follow him, and Dom makes him carry his luggage.Chapter 2: A WEEKEND IN THE COUNTRY AMONGST THIEVESThe thieves arrive at Fontaine's villa. Dom's eye is caught by Fontaine's beautiful girlfriend Paolina (Madalina Ghenea). Dickie tells him to not look at her. They find Fontaine out hunting with his rifle. He asks Dom if he ever uses a gun for hunting. Dom says no, but only to hold up a place or threaten someone...or rob them...or pistol-whip them...or scare them, but never for hunting. Fontaine invites the two inside for a drink. He makes a comment about \"Leftie\" being right about Dom maintaining his vanity and wit, yet Dom has no idea who he's talking about. Fontaine means Dickie, making Dom aware of Dickie's left hand sporting a glove. It was shot off a while ago, but Dom just thought the glove was a fashion statement. Dom then starts to mock Fontaine, calling him \"Ivana Anal-tolly\", still enraged at being locked up for 12 years because of him. Fontaine never gets angry, but he warns Dom to not make him get rough. Dom calms down and leaves.Dickie finds Dom storming off outside completely nude. He runs out to get him back, reprimanding him for speaking rudely to Fontaine, saying he's lucky that Fontaine didn't kill him right there. Dom feels like he shouldn't be there, but Dickie convinces him to stay. Dickie adds that he's not burying Dom out there because he's \"too fucking old and he didn't bring the right shoes.\"Dom apologises to Fontaine and he and Dickie have dinner with Fontaine and Paolina. Fontaine treats the two to a musical performance by Paolina. As she sings, Fontaine tells Dom a story about how he viciously beat his best friend's jaw, nearly completely destroying it, after the man accidentally drove a bicycle into a woman that Fontaine had interest in. He didn't kill Dom for his behavior because he knew that he still owed him.Chapter 3: GOOD THINGS COME TO THOSE WHO WAITFontaine presents Dom with a quarter of a million pounds, plus another half a million. Dom becomes excited and hugs the money.Fontaine invites two women over to party and do coke with his guests, and everybody gets in the pool. One of the women, Melody (Kerry Condon), swims over to Dom. She compliments his chin, and he, in turn, compliments her breasts. Later, the whole party drives down the road. Dom stands up and shouts boastfully, right before the car collides with another car, throwing everybody out. Dom is unconscious, but he hears Paolina's voice calling his name and saying \"I want the money\". He briefly has a fantasy of her in a sexy swimsuit emerging from the pool before he's awoken by a thunderclap. Dom walks through the rain. He calls out for anybody. Fontaine walks by him, impaled by a piece of the car. He falls against the car, dead. Dom then finds Melody lying face down near a lake. He tries to resuscitate her and is able to revive her. She thanks Dom for saving her life and tells him good luck will come to him for this deed when he least expects it and most needs it. Dickie comes in and finds them. He says he saw Paolina heading down the road.Dom and Dickie return to Fontaine's home for Dom's money. All Dom finds is a few fifty pound notes put together in the shape of a heart. Dom then sees Paolina driving down the road, far away with the money. He runs through the woods to catch up to her, falling right in the middle of the road, inches from where she pulls up. Paolina rolls down the window, and Dom sees his money sitting in the passenger seat next to her. He asks her \"Why?\" She asks him, \"Do I strike you as the type of woman that wants to be poor?\" She rolls the window back up and drives away, leaving Dom sitting in the road as the rain pours.Dom shows up at Evelyn's apartment, drinking from a bottle of whiskey and with his face messed up. All she can say is, \"You've gotta be fucking kidding me,\" and Dom drops to the floor like a ton of bricks.Chapter 4: FATHER OF THE YEARDom wakes up to see Evelyn's boyfriend Hugh (Nathan Stewart-Jarrett), along with his father, brother, and son. Later, Hugh introduces Dom to his and Evelyn's son, Jawara (Jordan Nash). Dom questions the name choice, which Hugh defends as it means \"peace-loving\". Dom jokes that his own name means \"unlucky son of a bitch.\" Hugh tells Dom that Evelyn is mad at him and that she's hurt by his absence. He adds that she will play music with him that evening at a club called Cargo so Dom can check them out. Dom does go see the performance, with Evelyn singing \"Fisherman's Blues\". Dom is mesmerized by hearing his daughter singing.Dom goes to Dickie's home, lamenting that Evelyn wants nothing to do with him. He decides that he needs to seek employment from Lestor, Jr. (Jumayn Hunter), the son of Dom's old nemesis. Dickie warns Dom that Lestor is worse than his father.Dom finds Lestor jogging with his two goons. Lestor recognizes him and then punches him in the stomach. He hates Dom for killing his cat Bernard when Lestor was a boy. Even though they hate each other, Dom proposes that they do business. Although he doesn't like the idea, Lestor gives him a challenge - Dom is to open a new electronic safe at Lestor's club in under ten minutes, and if he is successful, Dom is to work for him. If Dom fails, Lestor will cut off Dom's cock and use it as a doorstop. Dom agrees, and then gets punched in the gut again as payback for the cat.Chapter 5: AND JUST LIKE THAT, OPPORTUNITY KNOCKSDickie joins Dom as they go to Lestor's club to crack the safe inside a wall. Dom takes a sledgehammer and smashes the wall up until he can see the wires around the safe, which he cuts off with a power saw. He grabs the safe and starts thrusting against it sexually, so that the 'pins are out of alignment' then throws it on the floor, where it finally opens. Dom feels triumphant, until Lestor tells him he only has 52 seconds left. He takes out a smaller safe from a box, revealing that to be the safe he wanted him to open. He forces Dom to drop his trousers so he can cut off his cock. At the last second, two safe security guards run into the room. Dickie smashes a small statue over Lestor's head, and Dom hits his goons with the sledgehammer. They run like hell out of the club, and then split up.Dom waits outside Cargo to find Evelyn after her band's performance. She is still angry with him, stating that he could have served only two or three years if he struck a deal and testified against Fontaine, but he ended up missing his wife dying and most of Evelyn's life. Dom tells her he is going to visit her mother's grave the next day and that she should bring her son with her so they can go together. Evelyn tells him that she only ever wanted a real father, but instead got him. She turns her back and leaves.Chapter 6: A MAN WITH NO OPTIONS SUDDENLY HAS ALL THE OPTIONS IN THE WORLDThe next morning, Dom is out on the streets when he spots Melody riding her motor scooter. He stops her and tells her that he hasn't had any good luck since saving her. Melody asks him what it is that he really wants. Dom firmly states he wants his money back, then he realizes that he just wants Evelyn to talk to him. Melody tells him that by admitting this, the \"pendulum of luck\" will swing his way because love is what he makes of it.Dom visits his wife's grave, tearfully apologizing and feeling regretful for all the years he's missed and for abandoning her and Evelyn. He looks up and sees Jawara next to him. He tells the boy this is his grandmother's grave. Apparently, she wasn't fond of colored people, but Dom thinks she would have loved him. He walks Jawara out of the cemetery to meet back up with Evelyn. Dom asks her if he can walk around with her and Jawara without having to say anything. She says not today, but he is welcome to take Jawara to school on Monday if he's not too drunk the night before. They walk away, and Jawara waves to Dom. He waves back.Dom walks away, still feeling a lack of closure, until he sees someone and a smile forms on his face. It's Paolina walking into a restaurant with an older man. Dom follows them in and approaches their table. He greets Paolina, who claims to not know who he is. He leans in to place his hand on hers and whisper in her ear menacingly that he is the fucker who will gut her with a butter knife and dump her body in the river without anybody knowing. Paolina trembles in fear. He warns her not to say a word when he removes his hand or else he'll do all of that right now. After all the heartbreaks and sadness, he feels that the pendulum of luck has finally swung back his way. He stands up, drinks her date's wine, and then kisses her. He exits the restaurant and we see him holding something - Paolina's diamond ring. Dom flicks it up and walks away with it, wearing a big victorious grin on his face."
}