{
  "imdb_id": "tt2486630",
  "tmdb_id": "214597",
  "douban_id": null,
  "title": "Fright Night 2 (Video 2013)",
  "genres": [
    "Comedy",
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "100 min",
      "description": "Unrated Edition"
    }
  ],
  "imdb_rating": 4.3,
  "director": [
    {
      "id": "nm1161979",
      "name": "Eduardo Rodriguez"
    }
  ],
  "writer": [
    {
      "id": "nm1107639",
      "name": "Matt Venne",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm3610536",
      "name": "Will Payne",
      "character": "Charley Brewster"
    },
    {
      "id": "nm1444665",
      "name": "Jaime Murray",
      "character": "Gerri Dandridge"
    },
    {
      "id": "nm0694463",
      "name": "Sean Power",
      "character": "Peter Vincent"
    },
    {
      "id": "nm1853152",
      "name": "Sacha Parkinson",
      "character": "Amy Peterson"
    },
    {
      "id": "nm4071343",
      "name": "Chris Waller",
      "character": "'Evil' Ed Bates"
    },
    {
      "id": "nm2545839",
      "name": "John-Christian Bateman",
      "character": "Chaperone"
    },
    {
      "id": "nm1195463",
      "name": "Liana Margineanu",
      "character": "Old Lady"
    },
    {
      "id": "nm5404833",
      "name": "Alina Minzu",
      "character": "Shayla Sunshine       (as Aaliyah)"
    },
    {
      "id": "nm5404806",
      "name": "Adi Hostiuc",
      "character": "Dragomir"
    },
    {
      "id": "nm4865802",
      "name": "Joelle Coutinho",
      "character": "French Girl"
    },
    {
      "id": "nm5404827",
      "name": "Ada Gales",
      "character": "Hostel Clerk"
    },
    {
      "id": "nm0053881",
      "name": "Constantin Barbulescu",
      "character": "Inspector Constantin"
    },
    {
      "id": "nm5202506",
      "name": "Catalin Banghea",
      "character": "Tagger       (as Catalin-Emanuel Banghea)"
    },
    {
      "id": "nm1150631",
      "name": "Calin Andrei Razvan",
      "character": "Huffer"
    },
    {
      "id": "nm1152572",
      "name": "Marius Chivu",
      "character": "Fright Night Grip"
    },
    {
      "id": "nm5404849",
      "name": "Roxana Lupu",
      "character": "Peter's Assistant       (as Roxana Girleanu)"
    },
    {
      "id": "nm5404853",
      "name": "Nicholas Lupu",
      "character": "Tour Guide       (as Lupu Nicolae)"
    },
    {
      "id": "nm5201909",
      "name": "Deliu Ionut",
      "character": "Tourist       (as Ionut Deliu)"
    },
    {
      "id": "nm5404874",
      "name": "Andreea Mihalascu",
      "character": "Female Victim 1"
    },
    {
      "id": "nm5404818",
      "name": "Ana Maria Saragia",
      "character": "Female Victim 2       (as Saragia Ana Maria)"
    },
    {
      "id": "nm5404867",
      "name": "Costinel Lenghel",
      "character": "Male Victim"
    },
    {
      "id": "nm2276136",
      "name": "Banica Gheorghe",
      "character": "Taxi Driver       (as Gheorghe Banica)"
    },
    {
      "id": "nm0893660",
      "name": "Mihai Verbintschi",
      "character": "Homeless Man       (as Mihai Verbitchi)"
    },
    {
      "id": "nm5404855",
      "name": "Carmen Popa",
      "character": "Pamphlet Girl"
    },
    {
      "id": "nm5404841",
      "name": "Anastasia Pirogova",
      "character": "Russian Waitress"
    }
  ],
  "overview": "By day Gerri Dandridge is a sexy professor, but by night she transforms into a real-life vampire with an unquenchable thirst for human blood. So when a group of high school students travel abroad to study in Romania, they find themselves ensnared in her chilling web of lust and terror. Charlie and “Evil” Ed must stop Gerri from drinking and bathing in the blood of a “new moon virgin,” which just so happens to be Charlie’s ex-girlfriend, Amy.",
  "storyline": "By day Gerri Dandridge is a sexy professor, but by night she transforms into a real-life vampire with an unquenchable thirst for human blood. So when a group of high school students travel abroad to study in Romania, they find themselves ensnared in Gerri's chilling web of lust and terror. Charley and \"Evil\" Ed must stop Gerri from drinking and bathing in the blood of a \"new moon virgin,\" which just so happens to be Charley's ex-girlfriend, Amy. They enlist help from Peter Vincent, the vampire hunting host of a reality show called \"Fright Night,\" to drive a stake through Gerri's plan and save Amy from a fate far worse than death.",
  "plot": null,
  "synopsis": "The film begins with a woman in an isolated gas station in the middle of the night. She is suddenly attacked by a supernatural figure. Though she manages to set the creature on fire, the flames have no effect and it eventually catches the girl and drinks her blood.Charley Brewster (Will Payne), \"Evil\" Ed Bates (Chris Waller) and Amy Peterson (Sacha Parkinson) are three college freshman doing a semester abroad in Romania. Charley and Amy have recently broken up due to Charley having cheated on her, though he is very remorseful and is trying to win her back. One night, Charley witnesses their Romanian art teacher Gerri Dandridge (Jaime Murray) making out with a woman, and then biting her neck. Later that night, he again sees Gerri, this time pleasuring a man before bleeding him dry. Gerri notices Charley both times and begins messing with him using her psychic powers.Charley eventually breaks in to Gerri's house and finds a coffin and bathtub filled with blood. Gerri comes home with a woman (all the victims are seemingly hypnotized) and begins to have sex with her Gerri then uses her telekinetic powers to slit the girl's throat and drain her blood into the bathtub. Gerri then crawls into the blood-filled tub. Charley sees these blood-baths restore Gerri's youth. Charley escapes and runs to Amy's apartment, only to find Gerri already there (she also has super-speed, strength and agility). He accuses Gerri of being a vampire, but Amy doesn't believe him and tells Charley to leave her alone.Charley tells his roommate, Evil Ed, his theory that Gerri is a vampire. The pair go online and look up artwork depicting one of the first-ever vampires - Elizabeth Bathroy - and discover that she looks just like Gerri. Evil Ed tells Charley the legend of Bathroy. One night, a vampire killed Bathroy's bodyguards and then drank her blood, but left her alive. She too became a vampire, and has been alive for generations. She is seeking to bathe in the blood of a virgin who was born at midnight under a blood moon, as such blood would break her curse and allow her to walk in the daylight again.Evil Ed convinces Charley to track down Peter Vincent (Sean Power), the host of a popular horror/ghost hunter show that happens to be filming in Romania, and ask him for help. They find Peter in a strip club and he is dismissive of their claims that Gerri is a vampire. Evil Ed agrees to pay Peter $3,000 if he agrees to go to Gerri's house with them. He reluctantly agrees, and as the three go down to the subway, they meet Amy and she decides to tag along.The foursome enter a subway car to find Gerri waiting there for them. Her eyes turn blood red, though only Peter notices this. Peter jumps out of the subway car before the doors close, not bothering to tell the trio of the danger they are in. Gerri attacks them, and Evil Ed sacrifices himself so that the others may escape. Gerri drinks Evil Ed's blood but doesn't drain him, allowing him to become a vampire and her minion. She tracks Amy and Charley into some tunnels beneath the subway using some radar powers and begins breaking the walls and windows of the tunnel with a sonic-scream power. The two are cornered, but manage to find a tunnel that leads into a church where Gerri cannot follow. Gerri slashes Amy's leg before she makes it into the church. After tasting Amy's blood on her talons, Gerri realizes Amy has the blood needed to break her curse.The two hail a taxi to the airport and admit they still love each. Gerri suddenly appears and destroys the cab. She then abducts Amy and tells Charley she can find Amy in the Bathroy castle. Charley tracks down Peter, who is prepping to leave Romania. Though he refuses to help Charley, Peter does give Charley wooden stakes, garlic powder and holy water. He also says that if a vampire is killed at dawn, all others that the vampire has turned the prior night will have their humanity restored.Meanwhile, Gerri bites Amy and turns her into a vampire and reveals that she needs Amy to kill her true love for the ritual to work (Gerri also notes that she will remain a vampire after the ritual is complete, but simply be immune to sunlight).Charley shows up and is attacked by Evil Ed. He defeats Evil Ed by pouring holy water down his throat, causing Ed's stomach to explode. He finds Amy, but can't bear to attack her. Amy, lacking her own willpower, bites into Charley's neck. Eventually Charley turns into a vampire himself, but because Amy bit him, he is not under Gerri's spell. Gerri then intervenes and even with his supernatural powers, Charley is no match for her. Gerri pins Charley down and gives Amy a stake to finish him off. Peter surprisingly shows up and stabs Gerri (though misses her heart). Gerri counter-attacks while Amy and Charley continue to struggle. Peter yells out to Charley that it is dawn, so Charley uses his vampire sonic-scream powers to shatter the room's windows and the sunlight destroys Gerri (Charley grabs Amy and forces she and himself underneath the blood in one of Bathroy's giant blood baths to escape the sun). Gerri's curse is broken and Amy and Charley become human again. Peter, Amy and Charley mourn the loss of Evil Ed, and then walk off heroically.... with Amy and Charley sharing a passionate kiss as the credits roll."
}