{
  "imdb_id": "tt2446600",
  "tmdb_id": "256836",
  "douban_id": null,
  "title": "Next Goal Wins (2014)",
  "genres": [
    "Documentary",
    "Sport"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.9,
  "director": [
    {
      "id": "nm5318845",
      "name": "Mike Brett"
    },
    {
      "id": "nm5318586",
      "name": "Steve Jamison"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm5903556",
      "name": "Thomas Rongen",
      "character": "Football Trainer American Samoa Team"
    },
    {
      "id": "nm6386868",
      "name": "Jaiyah Saelua",
      "character": "Herself"
    },
    {
      "id": "nm6386869",
      "name": "Nicky Salapu",
      "character": "Himself"
    },
    {
      "id": "nm6386870",
      "name": "Gene Ne'emia",
      "character": "Himself"
    },
    {
      "id": "nm6386871",
      "name": "Larry Mana'o",
      "character": "Himself"
    },
    {
      "id": "nm6386872",
      "name": "Rawlston Masaniai",
      "character": "Himself"
    },
    {
      "id": "nm6386873",
      "name": "Charles Uhrle",
      "character": ""
    }
  ],
  "overview": "An inspirational story about the power of hope in the face of seemingly insurmountable odds, and an object lesson in what it really means to be a winner in life.",
  "storyline": "In 2001, the tiny Pacific island of American Samoa suffered a world record 31-0 defeat at the hands of Australia, garnering headlines across the world as the worst soccer team on the planet. A decade after that humiliating night, they remain rooted to the bottom of FIFA's World rankings, having scored only twice in seventeen years. They have lost every competitive game they have ever played. Against this backdrop of serial underachievement, the team face the daunting prospect of a qualification campaign for the upcoming 2014 World Cup in Brazil. It would take a miracle-maker or a madman to turn the team's fortunes around - and in maverick Dutch coach Thomas Rongen the islanders somehow find both. As a loan appointment from the mighty U.S. Soccer Federation, with experience of playing alongside football greats like George Best and Johann Cruyff, Rongen is completely unprepared for what greets him on the island - in his own words it is \"by far the lowest standard\" of football he's ever ...",
  "plot": null,
  "synopsis": "In 2001, the tiny Pacific island of American Samoa suffered a world record 31-0 defeat at the hands of Australia, garnering headlines across the world as the worst football team on the planet.A decade after that humiliating night, they remain rooted to the bottom of FIFAs World rankings, having scored only twice in seventeen years. They have lost every competitive game they have ever played.Against this backdrop of serial underachievement, the team face the daunting prospect of a qualification campaign for the upcoming 2014 World Cup in Brazil. It would take a miracle-maker or a madman to turn the teams fortunes around and in maverick Dutch coach Thomas Rongen the islanders somehow find both.As a loan appointment from the mighty U.S. Soccer Federation, with experience of playing alongside football greats like George Best and Johann Cruyff, Rongen is completely unprepared for what greets him on the island in his own words it is by far the lowest standard of football hes ever seen, with only half of his team even fit enough to play a whole game.A lack of athleticism to one side, TRs ailing squad contains the emotionally scarred goalkeeper who conceded 31 goals against Australia a decade earlier and a member of Samoas third gender, the fafafine, who lives 24/7 as a woman. To complicate matters further the teams best player has been posted 6000 miles away by the US military.With the team about to embark on a gruelling World Cup Qualification campaign, Rongen has just one month to transform this ragtag band of losers into a winning team and perhaps learn a little about himself along the way."
}