{
  "imdb_id": "tt2458776",
  "tmdb_id": "214314",
  "douban_id": null,
  "title": "Bears (2014)",
  "genres": [
    "Documentary",
    "Family"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "78 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.4,
  "director": [
    {
      "id": "nm0288144",
      "name": "Alastair Fothergill"
    },
    {
      "id": "nm0774582",
      "name": "Keith Scholey"
    },
    {
      "id": "nm7920865",
      "name": "Adam Chapman"
    }
  ],
  "writer": [
    {
      "id": "nm0288144",
      "name": "Alastair Fothergill",
      "description": "written by &"
    },
    {
      "id": "nm7920865",
      "name": "Adam Chapman",
      "description": "written by"
    },
    {
      "id": "nm0962596",
      "name": "Pamela Ribon",
      "description": "narration consultant"
    }
  ],
  "cast": [
    {
      "id": "nm0000604",
      "name": "John C. Reilly",
      "character": "Narrator       (voice)"
    }
  ],
  "overview": "A documentary that follows an Alaskan bear family as its young cubs are taught life's most important lessons.",
  "storyline": "In an epic story of breathtaking scale, Disneynature's new True Life Adventure \"Bears\" showcases a year in the life of a bear family as two impressionable young cubs are taught life's most important lessons. Set against a majestic Alaskan backdrop teeming with life, their journey begins as winter comes to an end and the bears emerge from hibernation to face the bitter cold. The world outside is exciting-but risky-as the cubs' playful descent down the mountain carries with it a looming threat of avalanches. As the season changes from spring to summer, the brown bears must work hard to find food-ultimately feasting at a plentiful salmon run-while staying safe from rival male bears and predators, including an ever-present wolf. \"Bears\" captures the fast-moving action and suspense of life in one of the planet's last great wildernesses-Alaska!",
  "plot": "An Alaskan brown bear mother named Sky gives birth to two cubs named Amber and Scout in her den on a mountain slope. When April comes the bears will be ready to leave the den. As the bears leave the oncoming summer brings with it a threat of avalanches. Fortunately the bears are able to avoid disaster. Upon reaching the lush valley below, the cubs meet the other bears, some of which pose a threat to the cubs; among these bears are Magnus, a big healthy male, and Chinook, an older male. The family works together to survive the spring, with Sky keeping the cubs safe from Tikaani, a pesky lone wolf. The cubs get to know how to defend themselves in encounters with Tikaani. Also the family must stay clear of the frequent dominance fights between Magnus and Chinook.\n\nAs the spring wears on, the cubs learn about how to catch food. Sky leads the cubs to the mudflats to dig up clams hiding under the mud. The family has a good time until the tide turns. In the chaos, Scout gets stranded on a sandbar. Unable to do much, Sky can only look on as the cub tries to free himself. He finally comes to his senses and swims over to Sky. The family heads to higher ground, where, after another encounter with Magnus, Chinook attacks again. As Sky fights off the male bear, Amber and Scout hide in a nearby log. After Chinook is driven away, Amber reappears from the log, but Scout is nowhere to be seen. Sky looks for him all day, but he's nowhere to be seen. Eventually, just as Sky and Amber are about to give up searching, Scout comes right back out of the log—he'd been hiding there the whole time.\n\nWhen summer comes, so does the yearly salmon run. Dozens of bears gather along salmon streams on the coast to get the best of the run before it ends. This also leads in an increase in dominance fights between Magnus and Chinook. Sky, meanwhile, is looking for a different place to find food. A raven leads Sky and her two cubs to the golden pond just in time to save the brown bear family from their starvation. She and her cubs leave Katmai National Park and Preserve and head north to Lake Clark National Park and Preserve, where a pool filled with salmon supposedly awaits. When the bears arrive, however, they find that the salmon are not there yet. They wait and wait, and the situation gets worse by the hour. When it seems that their journey was for nothing, the salmon arrive. After the family fill themselves on the riches of the feast, they head back to Katmai as winter approaches. When the first snow arrives, all the bears head back up the mountains to their dens to sleep out the harsh cold winter. The cubs have learned a lot from their first year which will greatly help them for the rest of their lives.",
  "synopsis": null
}