{
  "imdb_id": "tt2466678",
  "tmdb_id": "168433",
  "douban_id": null,
  "title": "Katiyabaaz (2013)",
  "genres": [
    "Documentary",
    "Drama"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.8,
  "director": [
    {
      "id": "nm4484295",
      "name": "Deepti Kakkar"
    },
    {
      "id": "nm4483474",
      "name": "Fahad Mustafa"
    }
  ],
  "writer": [
    {
      "id": "nm4483474",
      "name": "Fahad Mustafa",
      "description": "story"
    }
  ],
  "cast": [
    {
      "id": "nm8184127",
      "name": "Ritu Maheshwari",
      "character": "Herself"
    },
    {
      "id": "nm8184126",
      "name": "Loha Singh",
      "character": "Himself"
    },
    {
      "id": "nm8184128",
      "name": "Irfan Solanki",
      "character": "Himself"
    }
  ],
  "overview": "In Kanpur, India, an electricity thief provides Robin Hood style services to the poor in the face of day long power-cuts. Meanwhile the first female chief of the local electricity supply company has vowed to put an end to all illegal connections, for good. In a summer of crisis, both come to terms with India's energy poverty.",
  "storyline": "In a city with 15 hour power cuts, hundreds of people risk their lives to steal electricity. With the first female chief of the electricity company vowing to eliminate all illegal connections, the lines are drawn for a battle over electricity.",
  "plot": "Katiyabaaz is a story of Kanpur's electricity crisis, resulting in loadshedding. Power cuts of up to 15 hours a day, cause great trouble to residents and factories alike. This gap in supply and demand becomes the bedrock of local electricity thieves like Loha Singh, who provide illegal power connection to people, by plugging into official supply through live wires. However such free connection causes heavy financial losses to the power supply company, whose MD struggles to fight the menace of power theft, and local fixers. The film follows Loha Singh, an electricity thief, and Ritu Maheshwari an official with Kanpur Electricity Supply Company.",
  "synopsis": null
}