{
  "imdb_id": "tt2401585",
  "tmdb_id": "330417",
  "douban_id": null,
  "title": "Achcham Yenbadhu Madamaiyada (2016)",
  "genres": [
    "Action",
    "Romance",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "135 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.4,
  "director": [
    {
      "id": "nm1069826",
      "name": "Gautham Menon"
    }
  ],
  "writer": [
    {
      "id": "nm1069826",
      "name": "Gautham Menon",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1167656",
      "name": "T.R. Silambarasan",
      "character": "Rajinikanth Muralidharan"
    },
    {
      "id": "nm7222220",
      "name": "Manjima Mohan",
      "character": "Leela Raman"
    },
    {
      "id": "nm0782242",
      "name": "Baba Sehgal",
      "character": "Kamath"
    },
    {
      "id": "nm1422363",
      "name": "Daniel Balaji",
      "character": "Gangster Hiren"
    },
    {
      "id": "nm3193037",
      "name": "Sathish",
      "character": "Mahesh"
    },
    {
      "id": "nm4031719",
      "name": "Nagineedu",
      "character": "Sathyamoorthy"
    },
    {
      "id": "nm3830348",
      "name": "R.N.R. Manohar",
      "character": "Mahesh's Father"
    },
    {
      "id": "nm9638669",
      "name": "Anjali Rao",
      "character": "Maythrei (Rajinikanth's Sister)"
    },
    {
      "id": "nm10396177",
      "name": "Krrish Menon",
      "character": "Atul"
    },
    {
      "id": "nm9497172",
      "name": "Mathew Varghese",
      "character": "Muralidharan"
    },
    {
      "id": "nm8614178",
      "name": "Rishabh Paul",
      "character": "Inspector Thambe"
    },
    {
      "id": "nm9640640",
      "name": "Priyaa Rajkumar",
      "character": "Leela mother , Anamika"
    },
    {
      "id": "nm7628617",
      "name": "Vicky Vijai",
      "character": "(as Vicky R)"
    }
  ],
  "overview": "A youngster goes on a road trip with the girl of his dreams and but an accident leads things to spiraling out of control.",
  "storyline": "A happy go lucky protagonist tries to embark on a secret road-trip on his Royal Enfield. He has eyes for his sister's classmate, but constrains himself to open up at a later point of time. On a road trip with his girl as days pass and nights are spent in random strangers' place, they witness nature's expanse through its length and breadth. However, things take a turn for the worse as they encounter something unexpected.",
  "plot": "The movie opens with the flashback snapshots of the protagonist (Silambarasan) in a small brawl with a mob.\n\nThe protagonist, whose name is not mentioned, is revealed to be a care free MBA student and bike enthusiast, accompanied by his close friends Mahesh (Sathish Krishnan), Shyam (R. Shyam), Srikanth (Vicky Vijai) and Auto Selvam (R. S. Karthik). He has two younger sisters.\n\nHis friends and the protagonist gets into a fight because of his sister, Maithrei (Anjali Rao), this is revealed to be the fight shown in the flashback at the start of the movie.\n\nMaitheri's friend Leela (Manjima Mohan) stays in his house to complete a short course. He falls in love with her from the first moment. They spend time together everyday where it is revealed the hero is aimless and he has not found his passion in life.\n\nThe hero was going on a trip with his friend Mahesh to Kannyakumari on his beloved bike - a Royal Enfield. Leela expresses interest that she would like to join him on his trip if he is going alone. He ditches Mahesh and the couple start their trip. Before they leave, Leela says that she doesn't even know his name at which he is surprised but refuses not to tell his name.During the trip, for a night, they go to a rural village and stay in a kind-hearted villager's (Madurai Mohan) home.\n\nTowards the end of the trip, they get into an accident in which the hero injures his shoulder and breaks his arm. Afraid that he is going to die, before he loses consciousness, he tells Leela that he loves her.\n\nWhen awake, he is in a hospital but Leela is not with him. She calls and explains that she admitted him in the hospital as \"Mr Mahesh\" (as she doesn't know his name) but she had to leave immediately as her parents were brutally attacked in Maharashtra. She is tending to her father, Raman (Nagineedu), who is on life support in the hospital. She also advises him that the accident that they were in was a planned attack on her. Mahesh and him visit Leela to be a support to her.\n\nThere is another murder attempt on Leela in the hospital. The hero saves Leela. Police Officer Kamath (Baba Sehgal) comes to the hospital to enquire about the incident. Kamath pressures Mahesh and the protagonist to leave but he refuses, which results in Kamath punching the protagonist and leaving him with a broken nose.\n\nThen the protagonist stops yet another murder attempt on the parents by shooting the attackers dead and organises for an ambulance to transport Leela's family out of the hospital. They are attacked by a gangster, Hiren (Daniel Balaji), on the way but the protagonist saves the day again. Mahesh marvels at his friend's bravery.\n\nThey go to Leela's friend Atul's (Krissh) house, whose father is also a doctor. Kamath comes there as well with Hiren and Atul. It is revealed that they are all working together.\n\nMahesh and Leela's parents are shot dead by the gang. However, Leela and the hero escape. They follow Atul to find the reason behind the murder attempts. The hero traces and kills both Hiren and Atul.\n\nWhile on their way to Chennai, Kamath finds them and shoots Leela. Hero fights him and escape with the dying Leela but couldn't kill Kamath as he is a police officer. Then, Leela reveals that she loves the hero too.\n\nHis father, Muralidharan finally reveals the hero's name - Rajinikanth when Kamath traces him back to Chennai. But there's a twist - the Rajini living there is a different man.\n\nTwo years later, it is revealed that Rajnikanth Muralidharan IPS, gets his posting where Kamath is working. Rajini explains that he doesn't like to reveal his name as most people usually tease him about it.\n\nRajinikanth reveals that a woman named Anamika was pregnant with a minister's child. The minister finds out and tries to kill Anamika and her child but she escapes. She gives birth to a daughter, Leela, who she gives to her sister, Kalpana, who raises her up as her own.\n\nYears later when the minister is in the running for the Chief Minister post, Anamika turns up at his office out of the blue and demands to reveal that Leela is his daughter. The minister then plans the whole family's murder.\n\nRajini finally assassinates Kamath and goes on a trip to Kanyakumari again with Leela and proposes to her.",
  "synopsis": null
}