{
  "imdb_id": "tt2466830",
  "tmdb_id": "169864",
  "douban_id": null,
  "title": "The Short Game (2013)",
  "genres": [
    "Documentary",
    "Sport"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "99 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.5,
  "director": [
    {
      "id": "nm2307949",
      "name": "Josh Greenbaum"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm6614316",
      "name": "Amari Avery",
      "character": "Herself"
    },
    {
      "id": "nm6614317",
      "name": "Jed Dy",
      "character": "Himself"
    },
    {
      "id": "nm6614318",
      "name": "Allan Kournikova",
      "character": "Himself"
    },
    {
      "id": "nm6614319",
      "name": "Zamokuhle Nxasana",
      "character": "Himself"
    },
    {
      "id": "nm6614320",
      "name": "Alexa Pano",
      "character": "Herself"
    },
    {
      "id": "nm6614321",
      "name": "Sky Sudberry",
      "character": "Herself"
    },
    {
      "id": "nm6614322",
      "name": "Augustin Valery",
      "character": "Himself"
    },
    {
      "id": "nm6614323",
      "name": "Yang Kuang",
      "character": "Himself"
    },
    {
      "id": "nm1455354",
      "name": "Jack Nicklaus",
      "character": "Himself"
    },
    {
      "id": "nm1711253",
      "name": "Gary Player",
      "character": "Himself"
    },
    {
      "id": "nm1985359",
      "name": "Annika Sörenstam",
      "character": "Herself"
    },
    {
      "id": "nm1537864",
      "name": "Chi Chi Rodriguez",
      "character": "Himself       (as Juan 'Chi Chi' Rodriguez)"
    },
    {
      "id": "nm6614324",
      "name": "Don Law",
      "character": "Himself"
    },
    {
      "id": "nm6614325",
      "name": "Dan Martin",
      "character": "Himself"
    },
    {
      "id": "nm6614326",
      "name": "John Nieporte",
      "character": "Himself"
    },
    {
      "id": "nm6614327",
      "name": "Alla Kournikova",
      "character": "Herself"
    },
    {
      "id": "nm6614328",
      "name": "Geoff Nxasana",
      "character": "Himself"
    },
    {
      "id": "nm6614329",
      "name": "Pumla Nxasana",
      "character": "Herself"
    },
    {
      "id": "nm6614330",
      "name": "Sizwe Nxasana",
      "character": "Himself"
    },
    {
      "id": "nm6614331",
      "name": "Judy Nxasana",
      "character": "Herself"
    },
    {
      "id": "nm6614332",
      "name": "Gavan Levenson",
      "character": "Himslf"
    },
    {
      "id": "nm6614333",
      "name": "Zhi Wei Kuang",
      "character": "Himself"
    },
    {
      "id": "nm6614334",
      "name": "Brian Symonds",
      "character": "Himself"
    },
    {
      "id": "nm6614335",
      "name": "Rick Pano",
      "character": "Himself"
    },
    {
      "id": "nm6614336",
      "name": "Donna Sarino",
      "character": "Herself"
    },
    {
      "id": "nm6614337",
      "name": "Lani Dy",
      "character": "Herself"
    },
    {
      "id": "nm6614338",
      "name": "Bob Dy",
      "character": "Himself"
    },
    {
      "id": "nm6614339",
      "name": "Bobbett Bruce",
      "character": "Himself"
    },
    {
      "id": "nm6614340",
      "name": "Maryi",
      "character": "Herself"
    },
    {
      "id": "nm6614341",
      "name": "Mario",
      "character": "Himself"
    },
    {
      "id": "nm6614342",
      "name": "Ryan",
      "character": "Himself"
    },
    {
      "id": "nm6614343",
      "name": "Mike Credo",
      "character": "Himself"
    },
    {
      "id": "nm6614344",
      "name": "Sabine Cordesse",
      "character": "Herself"
    },
    {
      "id": "nm6614345",
      "name": "Bob Sudberry Jr.",
      "character": "Himself       (as Bob Sudberry)"
    },
    {
      "id": "nm6614346",
      "name": "Marv Kostelecky",
      "character": "Himself"
    },
    {
      "id": "nm6614347",
      "name": "Sally Johnson",
      "character": "Herself"
    },
    {
      "id": "nm6614348",
      "name": "Bob Sudberry Sr.",
      "character": "Himself       (as Bob Sudberry)"
    },
    {
      "id": "nm6614349",
      "name": "Mary Jo Sidberry",
      "character": "Herself"
    },
    {
      "id": "nm6614350",
      "name": "Donnie Massengale",
      "character": "Himself"
    },
    {
      "id": "nm6614351",
      "name": "Andre Avery",
      "character": "Himself"
    },
    {
      "id": "nm6614352",
      "name": "Brian Schwartz",
      "character": "Himself"
    },
    {
      "id": "nm6614353",
      "name": "Liz Hardy",
      "character": "Herself"
    },
    {
      "id": "nm6614354",
      "name": "Maria Avery",
      "character": "Herself"
    },
    {
      "id": "nm6614355",
      "name": "Alona Avery",
      "character": "Herself"
    },
    {
      "id": "nm6614356",
      "name": "Robin Sudberry",
      "character": "Herself"
    },
    {
      "id": "nm6614357",
      "name": "Bob Toski",
      "character": "Himself"
    },
    {
      "id": "nm6614358",
      "name": "Dan Van Horn",
      "character": "Himself"
    },
    {
      "id": "nm6614359",
      "name": "Justin Sun",
      "character": "Himself"
    },
    {
      "id": "nm6614360",
      "name": "Rafe Cochran",
      "character": "Himself"
    }
  ],
  "overview": "Each year, the world’s best 7 year-old golfers descend on Pinehurst, North Carolina to compete in the World Championships of Junior Golf. The Short Game follows eight of these very young athletes on their quest to become the sport’s next phenom.",
  "storyline": "The best 7 year old golfers from around the world descend on the world famous Pinehurst Golf course in North Carolina to determine the next world champion and who might become golf's next phenomenon. Most of these young prodigies have been holding clubs since before they could walk and are better by the time they are six than most people will be in their lifetime. This is the breeding ground for the PGA and the stakes are huge. The short game follows 9 young golfers vying for the title of 'world champion'.",
  "plot": "In a Lego world populated by anthropomorphic minifigures, the evil Lord Business finds a super weapon called the \"Kragle\". The wizard Vitruvius attempts to stop him, but is blinded by Business' robots; he prophesies that a person called \"the Special\" will find the Piece of Resistance, a brick capable of stopping the Kragle.\n\n8½ years later, construction worker Emmet Brickowski finds a woman named Wyldstyle searching for something at his construction site after hours. When he investigates, Emmet falls into a hole and finds the Piece of Resistance. Compelled to touch it, Emmet experiences vivid visions and passes out. He awakens with the Piece of Resistance attached to his back, in the custody of Bad Cop, Lord Business's lieutenant. Wyldstyle rescues Emmett, believing him to be the Special, and takes him to meet Vitruvius in the Old West. Emmet learns that Wyldstyle and Vitruvius are \"Master Builders\"—people capable of building anything from their imagination without the need of instructions—who oppose Business. Wyldstyle explains Business wants to use the Kragle, a tube of Krazy Glue with a weathered label, to freeze the world into perfection. Though disappointed to find Emmet is not a Master Builder, Wyldstyle and Vitruvius are convinced of his potential when he recalls visions of a seemingly human deity referred to as \"the Man Upstairs\".\n\nEmmet, Wyldstyle, and Vitruvius evade Bad Cop's forces with the aid of Batman, Wyldstyle's boyfriend. They go to the hidden Cloud Cuckooland where they attend a council of Master Builders, who are unimpressed with Emmet and refuse to fight Business. Bad Cop's forces attack, having placed a tracking device on Emmett, and capture everyone except Emmet and a small team of Master Builders. Escaping, Emmet devises a plan to infiltrate Business's office tower and disarm the Kragle, but the group is captured and imprisoned in the Think Tank, where all the Master Builders are forced to make instructions. Trying to retaliate, Vitruvius is decapitated by Business, who sets a self-destruct protocol and leaves everyone to die. As he dies, Vitruvius reveals he made up the prophecy. He soon reappears to Emmet as a ghost and tells him that his belief makes him the Special. Strapped to the self-destruct mechanism's battery, Emmet jumps into the abyss outside the tower and severs the connection, saving his friends. Inspired by Emmet's sacrifice, Wyldstyle rallies the Lego people across the universe to use whatever creativity they have to build machines and weapons to fight against Lord Business's forces.\n\nEmmet finds himself in the human world as a Lego minifigure unable to move. The events of the story are being played out by a little boy named Finn on his father's expansive Lego set in their basement. His father—\"the Man Upstairs\"—comes home from work and chastises his son for ruining the set by creating variations of different playsets, and proceeds to permanently rebuild and glue his perceived perfect creations together. Realizing the danger his friends are in, Emmet wills himself to move and gains Finn's attention. Finn returns Emmet and the Piece of Resistance to the set, where Emmet now possesses the powers of a Master Builder and confronts Business. Meanwhile, Finn's father looks at his son's creations and realizes that Finn had based the villainous Business on him and his perfectionism. Through a speech Emmet gives Business, Finn tells his father that he is special and has the power to change everything. Finn reconciles with his father, which plays out as Business having a change of heart, capping the Kragle, and ungluing his victims with mineral spirits. Emmet is hailed as a hero, and begins a relationship with Wyldstyle with Batman's blessing.\n\nAs a result of Finn's father allowing Finn's younger sister to join them in playing with his Lego sets, aliens from the planet Duplo beam down and announce their plans to destroy them.",
  "synopsis": null
}