{
  "imdb_id": "tt2409300",
  "tmdb_id": "171846",
  "douban_id": null,
  "title": "Killers (2014)",
  "genres": [
    "Action",
    "Crime",
    "Drama",
    "Horror",
    "Thriller"
  ],
  "country": "Indonesia",
  "version": [
    {
      "runtime": "137 min",
      "description": ""
    },
    {
      "runtime": "126 min",
      "description": "censored"
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm3125415",
      "name": "Kimo Stamboel"
    },
    {
      "id": "nm3464186",
      "name": "Timo Tjahjanto"
    }
  ],
  "writer": [
    {
      "id": "nm1959174",
      "name": "Takuji Ushiyama",
      "description": "original story"
    },
    {
      "id": "nm1959174",
      "name": "Takuji Ushiyama",
      "description": "writer"
    },
    {
      "id": "nm3464186",
      "name": "Timo Tjahjanto",
      "description": "story and screenplay"
    },
    {
      "id": "nm3464186",
      "name": "Timo Tjahjanto",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0457556",
      "name": "Kazuki Kitamura",
      "character": "Nomura"
    },
    {
      "id": "nm2680798",
      "name": "Oka Antara",
      "character": "Bayu"
    },
    {
      "id": "nm3140698",
      "name": "Rin Takanashi",
      "character": "Hisae"
    },
    {
      "id": "nm2532164",
      "name": "Luna Maya",
      "character": "Dina Aditya"
    },
    {
      "id": "nm1228805",
      "name": "Ray Sahetapy",
      "character": "Dharma"
    },
    {
      "id": "nm5224068",
      "name": "Ersya Aurelia",
      "character": "Elly"
    },
    {
      "id": "nm7080664",
      "name": "Tensui Sakai",
      "character": "Souichi"
    },
    {
      "id": "nm2148934",
      "name": "Epy Kusnandar",
      "character": "Robert"
    },
    {
      "id": "nm0475869",
      "name": "Mei Kurokawa",
      "character": "Midori"
    },
    {
      "id": "nm4620730",
      "name": "Tara Basro",
      "character": "Dewi"
    },
    {
      "id": "nm0218942",
      "name": "Denden",
      "character": "Oyaji /              Father at Jukai"
    },
    {
      "id": "nm6600890",
      "name": "Dimas Argoebie",
      "character": "Rizal"
    },
    {
      "id": "nm2792322",
      "name": "Steve Jean",
      "character": "Ahmad"
    },
    {
      "id": "nm6843318",
      "name": "Yuki Konoe",
      "character": "Yumi"
    },
    {
      "id": "nm0551665",
      "name": "Roy Marten",
      "character": "Ayah Dina"
    },
    {
      "id": "nm7080666",
      "name": "Lily Sp",
      "character": "Ibu Dina"
    },
    {
      "id": "nm7080667",
      "name": "Tristan",
      "character": "John"
    },
    {
      "id": "nm7080668",
      "name": "Firza Afero",
      "character": "Taxi Driver Robber"
    },
    {
      "id": "nm6423124",
      "name": "Cansirano",
      "character": "Taxi Robber"
    },
    {
      "id": "nm7080669",
      "name": "Ananditaa",
      "character": "TV Reporter"
    },
    {
      "id": "nm1966361",
      "name": "Motoki Fukami",
      "character": "Undercover Cop #1"
    },
    {
      "id": "nm7080670",
      "name": "Kosei Hattanda",
      "character": "Undercover Cop #2"
    },
    {
      "id": "nm7080671",
      "name": "Mio Kadoshima",
      "character": "Kaoru"
    },
    {
      "id": "nm7080672",
      "name": "Momoko",
      "character": "Sister of Nomura"
    },
    {
      "id": "nm5014183",
      "name": "Ryûto",
      "character": "Little Bully       (as Ryuto)"
    },
    {
      "id": "nm7080674",
      "name": "Nikolaus Samesada",
      "character": "Mamad the Enforcer"
    },
    {
      "id": "nm7080675",
      "name": "Habibie Alatas",
      "character": "Dharma's Bodyguard #1"
    },
    {
      "id": "nm7080676",
      "name": "Bastian",
      "character": "Dharma's Bodyguard #2"
    },
    {
      "id": "nm7080677",
      "name": "Maratuah",
      "character": "Dharma's Bodyguard #3"
    },
    {
      "id": "nm7080678",
      "name": "Ajoy Ardi",
      "character": "Dharma's Bodyguard #4"
    },
    {
      "id": "nm7080679",
      "name": "Deden",
      "character": "Dharma's Bodyguard #5"
    },
    {
      "id": "nm6948323",
      "name": "Eka",
      "character": "Dharma's Bodyguard #6"
    },
    {
      "id": "nm7080680",
      "name": "Ade",
      "character": "Dharma's Bodyguard #7"
    },
    {
      "id": "nm4479850",
      "name": "Saat",
      "character": "Dharma's Bodyguard #8"
    },
    {
      "id": "nm7080681",
      "name": "Herry",
      "character": "Dharma's Bodyguard #9"
    },
    {
      "id": "nm7080682",
      "name": "Gondo",
      "character": "Dharma's Bodyguard #10"
    },
    {
      "id": "nm7080683",
      "name": "Stanlee Saklil",
      "character": "Nomura's Taxi Driver"
    },
    {
      "id": "nm7080684",
      "name": "Anggika",
      "character": "TV Host"
    },
    {
      "id": "nm7080685",
      "name": "Rika",
      "character": "Robert's WIfe"
    },
    {
      "id": "nm7080686",
      "name": "Salsabila",
      "character": "Robert's Daughter"
    },
    {
      "id": "nm7080687",
      "name": "Ali Al Tway",
      "character": "Robert's Driver"
    },
    {
      "id": "nm5225429",
      "name": "Andre Yosinda",
      "character": "Robert Victim Kid 1"
    },
    {
      "id": "nm7080688",
      "name": "Raka Alfianto",
      "character": "Robert Victim Kid 2"
    },
    {
      "id": "nm7080689",
      "name": "Benny",
      "character": "Hotel Waiter"
    },
    {
      "id": "nm7080690",
      "name": "Dafa",
      "character": "Kid with Camera"
    }
  ],
  "overview": "Mr. Nomura is an eerily handsome, sharply dressed, sociopathic serial killer who preys on the women of Tokyo. In Jakarta, a world-weary journalist named Bayu finds himself unexpectedly falling into vigilantism after brutally killing two sadistic robbers. When each posts videos of their violent sprees online, the pair find one another on the Internet and begin a toxic and competitive duel. While Bayu clings to the hope that he can resume a normal life, Nomura continues to spill blood without remorse. Killing, advises Nomura, is something everyone ought to consider.",
  "storyline": "In Tokyo, a serial killer is murdering women and posting his violent crimes on-line. In Jakarta, a rogue vigilante uploads his murdering spree for the world to see. A psychotic game of cat and mouse ensues as the two men battle for notoriety. Soon it becomes clear that it's only a matter of time until the two killers square off face to face.",
  "plot": "This article may need to be rewritten entirely to comply with Wikipedia's quality standards. You can help. The discussion page may contain suggestions. (July 2016)\nNomura Shuhei is a charismatic, wealthy Japanese executive based in Tokyo who has a hidden dark side. He uses different methods to brutally murder people, mostly young women, and video records his deeds. Using local internet cafes to leave no trace of his personal IP address, Nomura uploads his murders to a video-sharing website which quickly go viral.\n\nWhile driving home from work, Nomura witnesses a young woman, Hisae, attempting to get her autistic younger brother killed by getting him to stand in the middle of the street. Hisae fails to do so and tearfully pulls her brother away, immediately regretting her decision. Fascinated by Hisae's compulsion to \"kill\", Nomura develops a friendship with the woman.\n\nMeanwhile, in Indonesia, Bayu Aditya, an ambitious Jakarta-based journalist, attempts to interview a corrupt politician, Dharma, about recent rumors surrounding domestic violence against his wife. Bayu's obsession to publicize Dharma's scandals has caused his marriage and career to fall apart. While trying to get the latest scoop, Bayu corners Dharma in the parking lot and attempts to gather more footage, only to be beaten up by one of Dharma's bodyguards.\n\nComing home from work, Bayu is kidnapped by a taxi-driver and his accomplice. In self-defense, Bayu fights back and gunfire is exchanged within the taxi. Both of the thugs are killed and a terrified Bayu hurriedly leaves the scene of the crime for home. Traumatized and delirious, Bayu sees one of Nomura's videos and develops a fascination for the killer, who is masked in the footage. Bayu eventually follows the same dark path to become a serial killer himself. He forms his own killer-persona, personally vows to kill in the name of justice, and also uploads his deeds to the internet, similar to Nomura's modus operandi. Nomura is pleased with Bayu's work and eventually gets in contact with him via social media however neither knows each other's true identity.\n\nBayu goes to Dharma's personal fixer, Robert, and corners him in his home. Upon detaining Robert, Bayu hears rumbling upstairs. He investigates and finds a young boy shackled to the bed, revealing that Robert is a child-molester. Disturbed and angered by this, Bayu pistol-whips Robert and locks him in the basement. Upon gaining information on Dharma's whereabouts, Bayu sets Robert on fire, records the murder, and uploads it to the internet.\n\nMeanwhile, Nomura stalks a hooker and eventually lures her into his car. He plans to take her back to his house and murder her but is interrupted by a hallucination of his deceased sister, causing the car to violently swivel across the road. Temporarily regaining his sanity, Nomura decides not to carry out his deed and drives the hooker back, who is outraged at his reckless driving. The hooker complains to her pimp and Nomura is subsequently beaten up for mistreating the prostitute. Before leaving, the pimp takes Nomura's wallet which contains his driver's license.\n\nNomura frequently visits Hisae at her flower store, but their friendship quickly sours one day when Nomura talks about his perverse thoughts about murder and death. Nomura further degrades his friendship with Hisae by inappropriately giving Hisae's brother a tazer as a toy.\n\nBayu begins to develop feelings of remorse and seeks Nomura for counseling over webcam chat, but Nomura only encourages him to kill again. Bayu, under the guise of a masked intruder, storms Dharma's Star Hotel but only finds Dharma's son, Adit. Bayu becomes delirious and shoots Adit dead, alerting Dharma's bodyguards. A lengthy chase follows and Bayu manages to escape the hotel, but he loses his mask in the process and his identity gets compromised.\n\nOn a busy night in downtown Tokyo, Nomura attempts to find the prostitute who caused him trouble. He stalks her pimp to a nightclub, stabs him to death, and retrieves his stolen wallet and ID. He then searches the nightclub, grabs the intoxicated hooker, and throws her into the trunk of his car. He attracts the attention of undercover policemen, but they fail to discover his crime. Upon returning home, Nomura decides to kill the hooker on webcam for Bayu to see. Nomura calls up Bayu on social media and prepares to kill her in front of the webcam. Bayu screams and pleads Nomura to stop, but Nomura believes that Bayu is \"just like him\" in that he shares the same sadistic pleasure in seeing people killed. Right before Nomura is about to hurt his victim, Hisae rings his doorbell and Nomura knocks out the hooker before leaving to answer it. Hisae is furious with Nomura for giving her brother a taser and confronts him about his abnormal behavior. Their conversation is interrupted once the prostitute wakes up and screams for help. Hisae manages to temporarily disable Nomura and get the hooker out of Nomura's house, but eventually they are both killed by Nomura.\n\nBayu passes out that night from all his stress and wakes up the next morning to be greeted by his daughter. Bayu and his wife decide to get back together and repair their failed marriage. Unfortunately, Bayu's daughter is eventually kidnapped by Dharma's thugs for Adit's death. Bayu returns home and discovers his wife murdered and the deed recorded. He tears up and stumbles out of his house, only to see Nomura who has just arrived in Indonesia.\n\nBayu attempts to chase down Nomura as he suspects him as the murderer of his wife, but is hit by a car and kidnapped by Dharma's thugs in the process. Dharma's thugs bring a detained Bayu to a floor in a high-rise building. Right before Dharma's bodyguard kills Bayu in front of his kidnapped daughter, Nomura arrives and shoots dead the bodyguard. Nomura, armed, taunts Bayu and commands him to kill Dharma or else his daughter will be shot dead as well. Bayu strangles Dharma to death but Nomura decides to kill Bayu's daughter anyways. Bayu grabs hold of Nomura and both of them scuffle for a while before falling off the high-rise building.\n\nThe pair land on a car, Bayu dead and Nomura mortally wounded. Nomura's utters a final \"Cut\" before dying.",
  "synopsis": "Nomura Shuhei (Kazuki Kitamura), a young charismatic and well liked Japanese executive, turns out to have a dark side. He kills people and documenting them in a video. Besides that, Nomura also uploaded videos of the killing on the internet in order to be seen by all people for the sake of personal satisfaction.\nOn the other side of the earth, Bayu Aditya (Oka Antara), an ambitious Indonesian journalist who was broke. His obsession to uncover the case of a politician named Dharma (Ray Sahetapy), makes his relationship with his wife Dina (Luna Maya) and his career fell apart.\nWhen his life was filled with problems, Bayu saw one of Nomura's video and began to find his other side. Bayu was inspired to do the same thing to be a serial killer. He started to form his own character and start killing in the name of justice, then uploading the videos to the internet.\nUnexpectedly, Bayu's video got a response, as well as Nomura's video. Then they were connected via the Internet and the bond between them became more complicated. Since then, Nomura decided to see Bayu"
}