{
  "imdb_id": "tt2409754",
  "tmdb_id": "233185",
  "douban_id": null,
  "title": "To the Woods (2012)",
  "genres": [
    "Comedy",
    "Romance"
  ],
  "country": "Czech Republic",
  "version": [
    {
      "runtime": "110 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm0903438",
      "name": "Tomás Vorel"
    }
  ],
  "writer": [
    {
      "id": "nm5289080",
      "name": "Bara Schlesingerova",
      "description": "as Bara Schlesinger"
    },
    {
      "id": "nm0903438",
      "name": "Tomás Vorel",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1980194",
      "name": "Tomás Vorel Jr.",
      "character": "Ludva Papos"
    },
    {
      "id": "nm4738823",
      "name": "Anna Linhartová",
      "character": "Anyna Marakova"
    },
    {
      "id": "nm0689990",
      "name": "Bolek Polívka",
      "character": "Ludva Papos"
    },
    {
      "id": "nm0392714",
      "name": "Eva Holubová",
      "character": "Vlasta Paposova"
    },
    {
      "id": "nm0361579",
      "name": "Tomás Hanák",
      "character": "Honza Marak"
    },
    {
      "id": "nm0632346",
      "name": "Barbora Nimcová",
      "character": "Marketa Marakova       (as Bara Schlesingerova)"
    },
    {
      "id": "nm0773533",
      "name": "Jirí Schmitzer",
      "character": "Josef Cvrk"
    },
    {
      "id": "nm3296862",
      "name": "Marie Stípková",
      "character": "Lida Cvrkova"
    },
    {
      "id": "nm0825873",
      "name": "Milan Steindler",
      "character": "Chairman"
    },
    {
      "id": "nm5913534",
      "name": "Zdenek Fator",
      "character": ""
    },
    {
      "id": "nm10308220",
      "name": "Gábina Haunerová",
      "character": "Servírka"
    },
    {
      "id": "nm5531635",
      "name": "Jirí Hruska",
      "character": ""
    },
    {
      "id": "nm1172540",
      "name": "Anezka Kusiaková",
      "character": "Anca"
    },
    {
      "id": "nm4851807",
      "name": "Denisa Malvaldová",
      "character": "Forest worker"
    },
    {
      "id": "nm0546905",
      "name": "Václav Marhoul",
      "character": ""
    },
    {
      "id": "nm10308219",
      "name": "Rumpíková Michaela",
      "character": ""
    },
    {
      "id": "nm10308221",
      "name": "Bílá Nikola",
      "character": ""
    },
    {
      "id": "nm6251965",
      "name": "Jirí Pelikán",
      "character": "Policista"
    },
    {
      "id": "nm4215225",
      "name": "Jaroslav Pízl",
      "character": ""
    },
    {
      "id": "nm0990068",
      "name": "Radomil Uhlir",
      "character": "Farár"
    },
    {
      "id": "nm2417543",
      "name": "Tomás Vanek",
      "character": ""
    },
    {
      "id": "nm1173900",
      "name": "Michal Vorel",
      "character": "Policista"
    },
    {
      "id": "nm0903438",
      "name": "Tomás Vorel",
      "character": ""
    },
    {
      "id": "nm6002487",
      "name": "Vojtech Vovesný",
      "character": ""
    },
    {
      "id": "nm0904703",
      "name": "David Vávra",
      "character": ""
    }
  ],
  "overview": "Honza Marak has long since abandoned a career in IT and has bought a cottage on the outskirts of a small village, where he’s settled in with his wife Marketa, daughter Anyna and son Sayen. He works in the woods as a forest labourer repairing roads and enclosures, cutting wood to sell and assisting the foresters. Marketa earns a living as a masseuse and alternative healer, making use of various mind-altering plants and mushrooms, which leads to conflict with the old inhabitants and eventually with drug enforcement. Daughter Anyna attends a distant school where her grades deteriorate as she wanders the woods learning from nature rather than from her textbooks.",
  "storyline": "To the Woods is a sequel to Vorel's successful Out of the City (2000). Having abandoned city life long ago, the Marak's live in a quaint cottage on the outskirts of a small rural village. Honza earns a very modest living as a forest laborer, while his wife Marketa works as a masseuse and alternative healer. Anyna, their nymph-like, pubescent daughter, explores the verdant landscape by night, communicating with the stags that still make the endangered woodland their home. It is in these wanderings that Anyna makes the acquaintance of locally born-and-bred forest ranger and hunter, Ludva. Meanwhile her parents are persecuted by local authorities, with her mother being taken into custody for her popular magic mushroom séance. As their financial situation becomes increasingly dire, a solution emerges following an unexpected life change.",
  "plot": "Detective Joona to apprehend a killer who has executed the whole family seeks help from a Dr. Erik who is specialized in Acute Trauma and Hypnotism to know case details from Josef who is in comatose. Erik is an insomniac who takes heavy sleeping pills and has marital troubles with paranoid and controlling wife. Though he is suspended from practice due to alleged complaints he tries to help but pulls back from seeing discomfort in Josef. Later Erik son is kidnapped by drugging both his wife and son with a threatening note to not further hypnotize Josef. Erik who is in search of his son hypnotizes Josef and understands he was the killer and did it under the instruction of his birth mother. Later Erik hypnotizes his wife and understands Josef's mother is Lydia, a nurse who looked after him at the hospital. Joon finds out she is mentally unstable and the place she stays with Erik's son. They reach there to negotiate and peacefully arrest Lydia. Lydia who thinks its her son Josef and the policemen have come to takeaway her child fires her weapon and tries to escape with Erik's son but in panic she drives her van with Erik's son inside into thin ice. Erik's son is saved and Lydia drowns. Erik and his family eats out happily and Joona goes out with Daniella for a proper date.",
  "synopsis": null
}