{
  "imdb_id": "tt2415838",
  "tmdb_id": "171784",
  "douban_id": null,
  "title": "Wampler's Ascent (2013)",
  "genres": [
    "Documentary",
    "Adventure",
    "Drama",
    "Family"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "77 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm5291658",
      "name": "Elizabeth Wampler"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm5291047",
      "name": "Stephen Wampler",
      "character": "Wamp"
    }
  ],
  "overview": "Steve Wampler, a man with severe form of cerebral palsy ascends the biggest rock face in the world, El Captain in Yosemite National Park. 20,000 pull-ups, 5 nights 6 days on the sheer face of the mountain and, with only the use of one limb, this is a story of terror and triumph. Steve Wampler's story is a American feel-good tale which will leave the viewer inspired and happy.",
  "storyline": "Steve Wampler, a man with severe form of cerebral palsy ascends the biggest rock face in the world, El Captain in Yosemite National Park. 20,000 pull-ups, 5 nights 6 days on the sheer face of the mountain and, with only the use of one limb, this is a story of terror and triumph. Steve Wampler's story is a American feel-good tale which will leave the viewer inspired and happy.",
  "plot": "During the Great Patriotic War (World War II), two Soviet partisans go to a Belarusian village in search of food. After taking a farm animal from the collaborationist headman (Sergei Yakovlev), they head back to their unit, but are spotted by a German patrol. After a protracted gunfight in the snow in which one of the Germans is killed, the two men get away, but Sotnikov (Boris Plotnikov) is shot in the leg. Rybak (Vladimir Gostyukhin) has to take him to the nearest shelter, the home of Demchikha (Lyudmila Polyakova), the mother of three young children. However, they are discovered and captured.\n\nThe two men and a sobbing Demchikha are taken to the German headquarters. Sotnikov is interrogated first by local collaborator Portnov (Anatoli Solonitsyn), a former Soviet club-house director and children's choirmaster who became the local head of the Belarusian Auxiliary Police, loyal to the Germans. When Sotnikov refuses to answer Portnov's questions, he is brutally tortured by members of the collaborationist police, but gives up no information. However, Rybak tells as much as he thinks the police already know, hoping to live so he can escape later. The headman, now suspected of supporting the partisans, and Basya Meyer, the teen daughter of a Jewish shoemaker, are imprisoned in the same cellar for the night.\n\nThe next morning, all are led out to be hanged. Rybak persuades Portnov and the Germans to let him join the police. Sotnikov and the others are executed.\n\nAs he heads back to the camp with his new comrades, Rybak is vilified by the villagers. Realizing what he has done, he tries to hang himself in the outhouse with his belt, but fails. A fellow policeman begins calling for Rybak until Rybak opens the door. The policeman tells Rybak that their commander wants him, and leaves Rybak alone in the courtyard. Rybak stares out the open camp door. He begins to laugh and weep.",
  "synopsis": "Heroism takes many forms, has many faces. Wamplers Ascent is a story of Steve Wamplers legendary climb up the biggest rock face in the world, El Capitan in Yosemite. This valiant effort took 20,000 pull-ups climbing for 6 days and sleeping on the side of the mountain for 5 nights. Wampler is a husband, father and has a severe form of Cerebral Palsy. In a story sure to rouse compassion, this athlete, who has the complete use of one limb, his right arm, and uses an electric wheelchair to get around, overcomes panic and terror using his steel will, guts and grit to show the power of the human force. This is a story of tenderness, warmth and the love of family that has the toughest among us encouraged by the expanse of human measure and reach. This is a feel-good story, which elicits delight and angst, dread and strength of character. It will leave the viewer moved, encouraged and optimistic, energized and heartened."
}