{
  "imdb_id": "tt2414166",
  "tmdb_id": "137366",
  "douban_id": null,
  "title": "Led Zeppelin: Celebration Day (2012)",
  "genres": [
    "Documentary",
    "Music"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "124 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.9,
  "director": [
    {
      "id": "nm1006692",
      "name": "Dick Carruthers"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm0656211",
      "name": "Jimmy Page",
      "character": "Himself - Guitars       (as Led Zeppelin)"
    },
    {
      "id": "nm0686619",
      "name": "Robert Plant",
      "character": "Himself (Vocals and harmonica)       (as Led Zeppelin)"
    },
    {
      "id": "nm0428429",
      "name": "John Paul Jones",
      "character": "Himself (Bass guitar and keyboards)       (as Led Zeppelin)"
    },
    {
      "id": "nm0094495",
      "name": "Jason Bonham",
      "character": "Himself (Drums, percussion and backing vocals)       (as Led Zeppelin)"
    }
  ],
  "overview": "On December 10, 2007, Led Zeppelin took the stage at London's O2 Arena to headline a tribute concert for dear friend and Atlantic Records founder Ahmet Ertegun. What followed was a two-hour-plus tour de force of the band's signature blues-infused rock 'n' roll that instantly became part of the legend of Led Zeppelin. Founding members John Paul Jones, Jimmy Page and Robert Plant were joined by Jason Bonham, the son of their late drummer John Bonham, to perform 16 songs from their celebrated catalog including landmark tracks \"Whole Lotta Love,\" \"Rock And Roll,\" \"Kashmir,\" and \"Stairway To Heaven.\"  .",
  "storyline": "On 12 December 2007 legendary rock band Led Zeppelin reformed to perform a tribute concert for Atlantic Records founder Ahmed Ertegun. This is that concert. The concert, performed at London's O2 Arena, included their most well-known songs. Set list: Good Times, Bad Times; Ramble On; Black Dog; In My Time of Dying; For Your Life; Trampled Under Foot; Nobody's Fault But Mine; No Quarter; Since I've Been Loving You; Dazed and Confused; Stairway to Heaven; The Song Remains the Same; Misty Mountain Hop; Kashmir; Whole Lotta Love; Rock and Roll.",
  "plot": null,
  "synopsis": null
}