{
  "imdb_id": "tt2401099",
  "tmdb_id": "108476",
  "douban_id": null,
  "title": "Trashed (2012)",
  "genres": [
    "Documentary"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "98 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm4692370",
      "name": "Candida Brady"
    }
  ],
  "writer": [
    {
      "id": "nm4692370",
      "name": "Candida Brady",
      "description": "idea"
    }
  ],
  "cast": [
    {
      "id": "nm3171307",
      "name": "Paul Connett",
      "character": "Himself"
    },
    {
      "id": "nm0000460",
      "name": "Jeremy Irons",
      "character": "Himself"
    },
    {
      "id": "nm7035549",
      "name": "Evangelos Kalafatis",
      "character": "Himself"
    },
    {
      "id": "nm2823897",
      "name": "Charles Moore",
      "character": "Himself"
    },
    {
      "id": "nm7035547",
      "name": "Clive Oxenden",
      "character": "Himself"
    },
    {
      "id": "nm2544822",
      "name": "Lynn Parker",
      "character": "Herself"
    },
    {
      "id": "nm7035548",
      "name": "Asif Rangoonwala",
      "character": "Himself"
    }
  ],
  "overview": "Trashed - looks at the risks to the food chain and the environment through pollution of our air, land and sea by waste. The film reveals surprising truths about very immediate and potent dangers to our health. It is a global conversation from Iceland to Indonesia between the film star Jeremy Irons and scientists, politicians and ordinary individuals whose health and livelihoods have been fundamentally affected by waste pollution. Visually and emotionally the film is both horrific and beautiful: an interplay of human interest and political wake-up call. But it ends on a message of hope: showing how the risks to our survival can easily be averted through sustainable approaches that provide far more employment than the current 'waste industry.'",
  "storyline": "Jeremy Irons sets out to discover the extent and effects of the global waste problem, as he travels around the world to beautiful destinations tainted by pollution. This is a meticulous, brave investigative journey that takes Irons (and us) from skepticism to sorrow and from horror to hope.",
  "plot": "With the participation of Jeremy Irons, the documentary looks at the risks to the food chain and the environment through pollution of our air, land and sea by waste. The film reveals surprising truths about very immediate and potent dangers to human health. It is a global conversation between the film star Jeremy Irons and scientists, politicians and ordinary individuals whose health and livelihoods have been fundamentally affected by waste pollution. It shows how the risks to our survival can easily be averted through sustainable approaches that provide far more employment than the current waste industry. Many sites were visited and filmed, around 11 cities, including:\nSidon in Lebanon; the 40 metre mountain of household rubbish in the city port which is affecting the Eastern Mediterranean.Yorkshire and Gloucestershire in England; the massive toxic waste mounds, near a school and a future hospital as well as housing. Recent research showed that the clay used under liners, designed to prevent contamination of ground water, actually enhances the leaching process.Ísafjörður in Iceland; the garbage incinerator Funi (among many in the world like those of Covanta Energy) had filters which stopped working, releasing highly toxic dioxin gas up to 20 times over the safe limit. According to Irons, it \"showed me how state agencies can so easily be seduced by experts who promise to make their problems go away, but who become conspicuously absent when their promises do not deliver\".Grignon and Gilly-sur-Isère near Albertville in the Auvergne-Rhône-Alpes; the Gilly incinerator was closed following a series of catastrophic dioxin emission readings which caused a scandalous occurrence of cancer among the inhabitants, and their subsequent court fight for justice.Từ Dũ hospital of Obstetrics and Gynecology in Ho Chi Minh City in Vietnam; health impact of Agent Orange (TCDD), which was used by the U.S. military during the Vietnam War, on the people of Vietnam including the impact of toxic chemicals on reproductive outcomes, dioxin induced risk to pregnancies, and women giving birth to grossly deformed babies. It showed the result of large quantities of dioxin on humans.Wales coastline; action of cleaning the garbage from the sea coast.Jakarta and Ciliwung river in Indonesia; by the highly polluted river live the numerous poor of society.Gulf of California; an interview with Charles J. Moore about the Great Pacific garbage patch of plastic, chemical sludge (chemicals like flame retardants, pesticides, herbicides, dioxins among other are often hydrophobic and thus are attracted by the plastic) and other waste which are affecting the sea life, and by the food chain the humans.Plymouth in England; the microparticles of plastic are affecting shellfish.Great Cumbrae in Scotland; the microparticles of plastic are affecting crabs, and shrimp (up to 83%).London Zoo in England; interview with Paul D. Jepson about the biomagnification of the toxins among the sea mammals, for example the Beluga whales at the Saint Lawrence Seaway between Canada and United States.Ross-on-Wye and London in England; organic stores which raise the issue of food packaging, as well British prison which successfully treats food waste.San Francisco; it reached 75% diversion or zero waste in 2012, compared to New York City which creates 1.5% of total global waste, while recycling only 11-18% of it in 2012, as well that waste reduction and recycling is \"ideally suited to the creation of a new and forward-thinking industry that could be profitable and create new jobs\".",
  "synopsis": null
}