{
  "imdb_id": "tt2461132",
  "tmdb_id": "277432",
  "douban_id": null,
  "title": "Happy New Year (2014)",
  "genres": [
    "Action",
    "Comedy",
    "Music"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "180 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.3,
  "director": [
    {
      "id": "nm0007134",
      "name": "Farah Khan"
    }
  ],
  "writer": [
    {
      "id": "nm4904771",
      "name": "Althea Kaushal",
      "description": null
    },
    {
      "id": "nm0007134",
      "name": "Farah Khan",
      "description": null
    },
    {
      "id": "nm1190754",
      "name": "Mayur Puri",
      "description": "dialogue"
    }
  ],
  "cast": [
    {
      "id": "nm0451321",
      "name": "Shah Rukh Khan",
      "character": "Charlie"
    },
    {
      "id": "nm2138653",
      "name": "Deepika Padukone",
      "character": "Mohini Joshi"
    },
    {
      "id": "nm0440604",
      "name": "Anurag Kashyap",
      "character": ""
    },
    {
      "id": "nm0451600",
      "name": "Anupam Kher",
      "character": "Manohar Sharma"
    },
    {
      "id": "nm0045393",
      "name": "Abhishek Bachchan",
      "character": "Nandu Bhide /              Vicky Grover"
    },
    {
      "id": "nm0006763",
      "name": "Jackie Shroff",
      "character": "Charan Grover"
    },
    {
      "id": "nm1224082",
      "name": "Boman Irani",
      "character": "Tammy Irani"
    },
    {
      "id": "nm0222150",
      "name": "Prabhu Deva",
      "character": "Dance Teacher       (as Prabhudheva)"
    },
    {
      "id": "nm0451215",
      "name": "Gauri Khan",
      "character": "Cameo"
    },
    {
      "id": "nm0037019",
      "name": "Malaika Arora",
      "character": ""
    },
    {
      "id": "nm1399243",
      "name": "Sonu Sood",
      "character": "Jag"
    },
    {
      "id": "nm1349318",
      "name": "Sajid Khan",
      "character": "Director"
    },
    {
      "id": "nm3591549",
      "name": "Sarah-Jane Dias",
      "character": "Laila"
    },
    {
      "id": "nm0603352",
      "name": "Dino Morea",
      "character": "Himself"
    },
    {
      "id": "nm2214392",
      "name": "Kiku Sharda",
      "character": "Dance Teacher"
    },
    {
      "id": "nm0438473",
      "name": "Geeta Kapoor",
      "character": "Judge"
    },
    {
      "id": "nm3729231",
      "name": "Varun Pruthi",
      "character": ""
    },
    {
      "id": "nm1318670",
      "name": "Vishal Dadlani",
      "character": "Judge"
    },
    {
      "id": "nm3865073",
      "name": "Vivaan Shah",
      "character": "Rohan"
    },
    {
      "id": "nm6870476",
      "name": "Jason Tham",
      "character": "Korea Team Member"
    },
    {
      "id": "nm6040403",
      "name": "Sameer Ali Khan",
      "character": "BOB (underground Fighter)"
    },
    {
      "id": "nm0409787",
      "name": "Daisy Irani",
      "character": "Tammy's mother"
    },
    {
      "id": "nm1018245",
      "name": "Mohan Kapoor",
      "character": "Mr. Kapoor"
    },
    {
      "id": "nm1404287",
      "name": "Kavi Shastri",
      "character": "Mr. Gupta"
    },
    {
      "id": "nm1375717",
      "name": "Vishal Malhotra",
      "character": "Anchor"
    },
    {
      "id": "nm1576905",
      "name": "Puneet Vashist",
      "character": ""
    },
    {
      "id": "nm5366273",
      "name": "Ciara A. Lyons",
      "character": "Performer"
    },
    {
      "id": "nm1336618",
      "name": "Jimmy Moses",
      "character": ""
    },
    {
      "id": "nm3256872",
      "name": "Rio Kapadia",
      "character": ""
    },
    {
      "id": "nm9039432",
      "name": "Manjit Singh",
      "character": "Rahul"
    },
    {
      "id": "nm7395520",
      "name": "Chuka Ekweogwu",
      "character": "Bodyguard"
    },
    {
      "id": "nm6875547",
      "name": "Rahul Kohli",
      "character": "DJ Badmaash"
    },
    {
      "id": "nm6862441",
      "name": "Abram Khan",
      "character": "Himself"
    },
    {
      "id": "nm6916867",
      "name": "Blake Curtis-Woodcock",
      "character": "MemberTeam Britain       (as Blake Curtis Woodcock)"
    },
    {
      "id": "nm7022116",
      "name": "Shashank Sharma",
      "character": "Extra"
    },
    {
      "id": "nm9487097",
      "name": "Aryan Singh",
      "character": "Boy Dancer"
    },
    {
      "id": "nm9339468",
      "name": "Farida Mughal Singh",
      "character": "Dancing Contestant"
    },
    {
      "id": "nm6592586",
      "name": "Cameron Singh",
      "character": "Young Fan"
    }
  ],
  "overview": "Six would-be thieves enter a prestigious dance competition as a cover for their larger goal of pulling off a major heist",
  "storyline": "A team of losers attempt to pull off mass revenge against a past traitor. They are required to win a dance competition as part of the plan, they get entangled with the presence of a somewhat unintelligent local dance performer who cannot learn the backstory of the betrayal.",
  "plot": "Lucy is a 24-year-old American woman living and studying in Taipei, Taiwan. She is tricked into working as a drug mule by her new boyfriend whose employer, Mr. Jang, is a Korean mob boss and drug lord. Lucy delivers a briefcase to Mr. Jang containing a highly valuable synthetic drug called CPH4. After seeing her boyfriend shot and killed, she is captured. A bag of the drug is forcibly sewn into her abdomen and that of three other drug mules who will also transport the drug for sale in Europe. While Lucy is in captivity, one of her captors kicks her in the abdomen, breaking the bag and releasing a large quantity of the drug into her system. As a result, she begins acquiring increasingly enhanced physical and mental capabilities, such as telepathy, telekinesis, mental time travel, and the ability not to feel pain or other discomforts. She kills off her captors and escapes.\n\nLucy travels to the nearby Tri-Service General Hospital to get the bag of drugs removed from her abdomen. The bag is successfully removed and Lucy is told by the operating doctor that natural CPH4 is a volatile substance produced in minute quantities by pregnant women to provide fetuses the energy to develop. Lucy is fortunate to have survived having such a large amount introduced into her body. Sensing her growing physical and mental abilities, Lucy returns to Mr. Jang's hotel, kills his bodyguards, assaults Mr. Jang, and telepathically extracts the locations of the three remaining drug mules from his brain.\n\nAt her shared apartment, Lucy begins researching her condition and contacts well-known scientist and doctor Professor Samuel Norman whose research may be the key to saving her. After Lucy speaks with Professor Norman and provides proof of her developed abilities, she flies to Paris and contacts a local police captain, Pierre Del Rio, to help her find the remaining three packets of the drug. During the plane ride, she starts to disintegrate as her cells destabilize from consuming a sip of champagne, which made her body inhospitable for cellular reproduction. Only by consuming more CPH4 is she able to prevent her total disintegration. Her powers continue to grow, leaving her able to telepathically incapacitate armed police and members from the Korean drug gang. With the help of Del Rio, Lucy recovers the drug and hurries to meet Professor Norman. Alongside Professor Norman and his colleagues, she agrees to share everything she now knows after Professor Norman points out that the main point of life is to pass on knowledge, something for which she now possesses an infinite capacity. Jang and the mob also want the drug and a gunfight ensues with the French police.\n\nIn the professor's lab, Lucy discusses the nature of time and life and how people's humanity distorts their perceptions. She tells the scientists that time is the only true measure of human life and of existence. At her urging, she is intravenously injected with the contents of all three remaining bags of CPH4. Her body begins to metamorphose into a bizarre black substance which behaves like nanites, spreading over computers and other objects in the lab, as she transforms these into an unconventionally shaped, next-generation supercomputer that will contain all of her enhanced knowledge of the universe. She then begins a spacetime journey into the past, eventually reaching the oldest discovered ancestor of mankind, implied to be Lucy. She touches fingertips with her, then goes all the way to the beginning of time and witnesses the Big Bang. Meanwhile, back in the lab, after an M136 AT4 anti-tank weapon destroys the door, Jang enters and points a gun at Lucy's head from behind. He shoots, but in the instant before the bullet strikes, Lucy reaches 100% of her cerebral capacity and disappears within the spacetime continuum, where she explains that everything is connected and existence is only proven through time. Only her clothes, Louboutin shoes and the black supercomputer are left behind.\n\nDel Rio enters and fatally shoots Jang. Professor Norman takes a black, presumably highly advanced flash drive offered by the advanced supercomputer, after which the computer disintegrates. Del Rio asks Professor Norman where Lucy is, immediately after which Del Rio's cell phone sounds and he sees a text message: \"I AM EVERYWHERE.\" With an overhead shot, Lucy's voice is heard stating \"Life was given to us a billion years ago. Now you know what to do with it.\"",
  "synopsis": "Charlie(Shah Rukh Khan), is a street fighter who has been yearning for revenge from Charan Grover(Jackie Shroff) for 8 years. Grover labeled Charlie's father as a thief because Charan had conned him into stealing his own Diamonds worth $15 million. Charlie finds out that diamonds worth $300 crore will reach the Atlantis Hotel on Christmas Eve. He wants to steal the same diamonds and frame Grover. To accomplish this, he assembles a dynamic team consisting of Jag, Tammy, Rohan Singh and a lookalike of Vicky Grover(Charan grover's son), named Nandu Bhide (Abishek Bachan).Tammy is the only one to open the vault. The team finds out that the room 9C, connected to the vault through duct system, is booked for a participant in the World Dance Championship. The group refuses, but Charlie re-motivates the group, convincing them to become a dance team. The film moves to a flashback- Manohar, Chalie's father met Charan Grover who gave him a contract to build an impenetrable vault. After the vault was completed, Charan drugged Manohar and conned him into stealing the diamonds by using his fingerprints. The film returns where desperate to win the competition, they employ many dance teachers, but to no avail. In desperation, Nandu introduces Charlie to Mohini, who is a Marathi bar dancer. Mohini eventually helps them learn to dance, unaware of their intentions. Charlie and Mohini grow very close.They manage to qualify in the first round by bribing the judges and eventually win the competition to represent Team India in the WDC by gaining votes through hacking. Many people despise them for their lack of dancing skill, but Charlie and his team are all only concerned with the heist except Mohini. In Dubai, Team Korea are especially hostile towards Team India, including Grover. At the semi final, Charlie saves a Korean member, instantly gaining respect and admiration from the audience. India advances to finals after judges are moved by Charlie's action. Team India becomes loved by everyone. After going over the plan, everything is ready. The team eventually find out that the diamonds will arrive on New Year's Eve instead of Christmas which impedes the heist.Mohini ends up hearing about heist, angrily confronting Charlie and his false motivations of the competition. Charlie reveals a shocking secret that Manohar is actually dead. After Manohar was arrested, he appealed for a trial, but Grover bribed Manohar's lawyers. The next day, Manohar committed suicide by slitting his wrists. Charlie kept this a secret to avoid demoralization. However, the team makes their determination to avenge Manohar even stronger. Mohini joins the team and helps them for the heist.The night of the final round, the heist is set in motion. Mohini lures Vicky into an elevator, where his thumbprint is copied on Nandu who opens the chamber. They open the crack but Charlie and Tammy find another glass safe which houses the diamonds. Tammy realizes that Manohar built this safe. Charlie opens the safe later after deep thinking, realizing that the password to open the safe was his own name. After stealing the diamonds, the team boards a boat, but Mohini refuses to come as she feels dedicated to protecting India's honor with the competition. Rohan joins her as well, leading to a fight amongst the remaining members.When Team India is found missing, Grover claims that they are the thieves. As he watches Mohini perform, other members also join her. Soon after, Charlie makes appearance and eventually helps the team win the competition. With all suspicions removed from Team India, Charan and Vicky Grover are arrested. Charlie reveals himself to Charan and completes the revenge. Team India reach the airport and manage to bypass security. Charlie camouflages the diamonds in his soft-drink, but the security guard disposes it. Later, during the flight Charlie reveals that he switched the fake diamonds on the trophy with the real ones. The team reaches India.During a post-credits scene, Mohini opens her own \"Dence School\" and everyone laughs at Nandu who is thrown out of bank for showing a winners' cheque."
}