{
  "imdb_id": "tt2404233",
  "tmdb_id": "205584",
  "douban_id": "26662345",
  "title": "Gods of Egypt (2016)",
  "genres": [
    "Action",
    "Adventure",
    "Fantasy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "127 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.5,
  "director": [
    {
      "id": "nm0001639",
      "name": "Alex Proyas"
    }
  ],
  "writer": [
    {
      "id": "nm1948885",
      "name": "Matt Sazama",
      "description": "written by"
    },
    {
      "id": "nm2332952",
      "name": "Burk Sharpless",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm4154798",
      "name": "Brenton Thwaites",
      "character": "Bek"
    },
    {
      "id": "nm0759628",
      "name": "John Samaha",
      "character": "Vendor"
    },
    {
      "id": "nm5196907",
      "name": "Courtney Eaton",
      "character": "Zaya"
    },
    {
      "id": "nm0182666",
      "name": "Nikolaj Coster-Waldau",
      "character": "Horus"
    },
    {
      "id": "nm0038042",
      "name": "Paula Arundell",
      "character": "Fussy Older Maidservant"
    },
    {
      "id": "nm6844615",
      "name": "Alia Seror-O'Neill",
      "character": "First Young Maidservant"
    },
    {
      "id": "nm1720228",
      "name": "Emily Wheaton",
      "character": "Second Younger Maidservant"
    },
    {
      "id": "nm1392388",
      "name": "Elodie Yung",
      "character": "Hathor"
    },
    {
      "id": "nm0086697",
      "name": "Rachael Blake",
      "character": "Isis"
    },
    {
      "id": "nm0000986",
      "name": "Bryan Brown",
      "character": "Osiris"
    },
    {
      "id": "nm0852904",
      "name": "Michael-Anthony Taylor",
      "character": "Priest"
    },
    {
      "id": "nm1134439",
      "name": "Emma Booth",
      "character": "Nephthys"
    },
    {
      "id": "nm0932028",
      "name": "Felix Williamson",
      "character": "Nobleman"
    },
    {
      "id": "nm1569276",
      "name": "Chadwick Boseman",
      "character": "Thoth"
    },
    {
      "id": "nm0124930",
      "name": "Gerard Butler",
      "character": "Set"
    },
    {
      "id": "nm1542397",
      "name": "Alexander England",
      "character": "Mnevis"
    },
    {
      "id": "nm0001722",
      "name": "Rufus Sewell",
      "character": "Urshu"
    },
    {
      "id": "nm0731167",
      "name": "Ian Roberts",
      "character": "Urshu Guard 1"
    },
    {
      "id": "nm5670587",
      "name": "Matt Ruscic",
      "character": "Urshu Guard 2"
    },
    {
      "id": "nm2043464",
      "name": "Elvis Sinosic",
      "character": "Urshu Guard 3"
    },
    {
      "id": "nm2751144",
      "name": "Daniel Mifsud",
      "character": "Urshu Guard 4       (as Danny Mifsud)"
    },
    {
      "id": "nm2377520",
      "name": "Goran D. Kleut",
      "character": "Anubis"
    },
    {
      "id": "nm6374073",
      "name": "Yaya Deng",
      "character": "Astarte"
    },
    {
      "id": "nm3880181",
      "name": "Abbey Lee",
      "character": "Anat"
    },
    {
      "id": "nm0001691",
      "name": "Geoffrey Rush",
      "character": "Ra"
    },
    {
      "id": "nm0358046",
      "name": "Markus Hamilton",
      "character": "Set's Mortal General"
    },
    {
      "id": "nm0710408",
      "name": "Kenneth Ransom",
      "character": "Sphinx"
    },
    {
      "id": "nm0627505",
      "name": "Robyn Nevin",
      "character": "Sharifa"
    },
    {
      "id": "nm0817748",
      "name": "Bruce Spence",
      "character": "Head Judge"
    },
    {
      "id": "nm0602350",
      "name": "Tiriel Mora",
      "character": "Rich Man"
    },
    {
      "id": "nm7534259",
      "name": "Keala Pringley",
      "character": "Female Child"
    },
    {
      "id": "nm1842413",
      "name": "Lindsay Farris",
      "character": "Older Bek       (voice)"
    }
  ],
  "overview": "A common thief joins a mythical god on a quest through Egypt.",
  "storyline": "Set, the merciless god of darkness, has taken over the throne of Egypt and plunged the once peaceful and prosperous empire into chaos and conflict. Few dare to rebel against him. A young thief, whose love was taken captive by the god, seeks to dethrone and defeat Set with the aid of the powerful god Horus.",
  "plot": "In an alternate version of Egypt, the world is flat and gods live among humans. The Egyptian gods are distinguished from humans by their greater height, golden blood, and ability to transform into their animal-headed deity forms.\n\nBek (Brenton Thwaites), a thief with little faith in gods and their goodwill towards humans, with his love Zaya (Courtney Eaton) are attending the coronation of Horus: God of the Air (Nikolaj Coster-Waldau). Horus is shown getting ready for his coronation as his love Hathor (Élodie Yung) surprises him. Horus hints at marriage and they discuss Hathor's protection bracelet made of the stars which Horus gave to her to protect and save her from her previous role as a guide to dead souls in the underworld. During the ceremony, Osiris (Bryan Brown) is killed by his extremely jealous brother Set: God of the Desert (Gerard Butler) who seizes the throne and declares a new regime where the dead will have to pay with riches to pass into the afterlife. Horus is stripped of his eyes, which are the source of his power, and almost killed. Hathor pleads with Set in surrender to spare him and he is instead exiled. Hathor becomes an enslaved mistress to Set.\n\nA year later, Bek has been working as a slave building monuments while Zaya is now under the ownership of the chief architect Urshu (Rufus Sewell). Believing that Horus is the only one who can defeat Set, she gives Bek the floor plans to Set's treasure vault. Bek is able to steal back one of Horus' eyes. However, Urshu finds out about their theft and kills Zaya as the couple flee. Bek takes her body to the blind Horus and makes a bargain: Horus agrees to bring Zaya back from the dead for his eye and Bek's knowledge about Set's pyramid.\n\nLater, they are traveling to Ra's divine vessel above the Earth. Horus is unable to convince Ra (Geoffrey Rush) to regrant him his power in full or to intervene and defeat Set himself as Ra is both neutral about their conflict and daily at war with an enormous shadow beast Apophis, that threatens to devour the world. Nevertheless, Horus obtains divine waters from Ra's vessel which can be used at Set's pyramid to extinguish the desert thirst and weaken him gravely. Ra tells Horus that his weakness is the result of him not fulfilling his destiny, which Horus believes means avenging his parents' deaths.\n\nSet asks Hathor to take him to the underworld which he next desires to conquer, but she refuses and manages to escape. Horus saves Bek when the Egyptian Minotaurs led by Mnevis (Alexander England) arrive to reclaim Horus' eye for Set. Eventually, Hathor finds Bek and Horus. Horus at first doesn't trust her as she is a mistress of Set, who had blinded him, while she tries to convince him that Set is her enemy as well. When they tell her of their plan regarding Set's pyramid, she warns them of a guardian sphinx who will kill anyone not wise enough to solve a riddle. The group then heads to the library of Thoth: God of Wisdom (Chadwick Boseman), recruiting him to solve the riddle.\n\nArriving at Set's shrine, they overcome its traps including the sphinx (Kenneth Ransom) to reach the source of Set's power. But before they can pour in the divine water, Set traps them and reveals Horus's deception to Bek: that he is unable to bring Zaya back from the dead. Set destroys their flask of divine water and kills Thoth by taking his brain. Horus is able to save Hathor and Bek.\n\nHorus admits before the enraged Bek to caring more about his revenge than the mortals. Hathor feels guilt for not exposing the deception, and as the Goddess of Love, helps the doomed lovers. She sacrifices her own safety for Zaya's payment into the afterlife by giving Bek the protective bracelet which stops the underworld souls from overwhelming her and calling Anubis (Goran D. Kleut) to take him to Zaya. Therefore, she lets herself be dragged to the underworld while Horus realizes that he still loves her.\n\nHaving obtained Thoth's brain, Osiris's heart, one of Horus's eyes, and wings from Nephthys (Emma Booth), Set has them combined with himself. Set travels to Ra, appealing to his father for approval and asking why Osiris was favored, while he was denied leadership and children. Ra claims that all of Set's prior mistreatments were tests preparing Set for his true role: the honor and burden of taking Ra's place as the defender of the world aboard his solar barge, fighting against the demon Apophis. Set is dismayed to hear his destiny is to be alone above the planet until he dies and refuses the offer. He wants to destroy the afterlife so that he can be immortal. Ra tries to fight Set by blasting him with his spear, though Set survives. Ra shows his surprise by saying \"No god could withstand that\", to which Set replies \"I'm not just ONE god!\", revealing to Ra that he stole the attributes of the other gods. Set then stabs Ra, taking his fiery spear of power, and casts him off the boat freeing Apophis to consume both the mortal and underworld realms.\n\nBek finds Zaya, who refuses Hathor's gift as she doesn't want an afterlife without Bek, but then Apophis attacks and the gate to the afterlife is closed by Anubis. Bek returns to the mortal world, where Horus is amazed that Bek still wants to help take down Set. Bek tells him it was Zaya who told him to, as she still has faith in Horus.\n\nHorus climbs up the outer wall of an obelisk Set is standing on and attempts to battle him, but is heavily outmatched. Bek ascends on the inside and joins the battle, removing Horus's stolen eye from Set's armor, being wounded in the process. As Bek slides toward the edge of the obelisk, he throws the eye toward Horus, who must choose to catch it or save Bek instead. Horus reaches for Bek and apologizes for all he has put him through. As they plummet toward the ground, Horus finds that he now has the power to transform into his divine form and he catches Bek and flies him to safety. Horus realizes that it wasn't the recovery of his eye nor revenge that was his destiny, it was the protection of his people that he needed to fight for. Now, Horus has the strength for battling Set, and he gains the obelisk and kills him. After the battle and Set's death, he then finds Ra wounded and floating in space, and returns his spear to him, allowing Ra to once again repel Apophis and for Anubis to reopen the gates.\n\nAs Horus returns to Bek, a child holds out his other eye which she has found, while people cheer him. But Horus's joy turns to sadness as he arrives to find Bek dying. Horus carries him to Osiris's tomb and lays him beside Zaya. Ra arrives and offers to bestow any power on him to repay Horus for his life and Egypt's survival. All Horus wants is bringing Bek and Zaya back to life. The other gods are also revived and have their attributes restored.\n\nHorus is crowned king by Thoth and declares the afterlife will be for those who do good in the world. Bek is made chief advisor, and he gives Horus back Hathor's bracelet letting Horus leave to rescue her from the underworld.",
  "synopsis": "An opening voice-over states that according to a legend, Egypt was the birthplace of civilization. The gods co-existed among the mortals and created the flourishing land for them to share. The son of Ra, Osiris, ruled over the land, while his brother Set was relegated to the desert, to his anger. The time has come for Horus, the son of Osiris, to take his place as king.A mortal young man named Bek (Brenton Thwaites) steals a dress from a vendor in the market to give to his beloved Zaya (Courtney Eaton). They are preparing to go to the coronation event later that day.Horus (Nikolaj Coster-Waldau) is passed out from a wild event of drinking with the gods the previous night. His beloved woman is Hathor (Elodie Yung), the goddess of love.The time comes for the coronation to take place. Bek and Zaya, along with nearly the whole city, is in attendance. Osiris (Bryan Brown) and his wife Isis (Rachael Blake) bring their son forward and are prepared to pass leadership to him, when Set (Gerard Butler) arrives at the last minute with a gift for Horus, a battle horn. Horus blows into it, summoning Set's army to the front. Turns out Set is staging a coup against his brother and nephew. He demands Osiris to battle him, but he refuses. Set stabs Osiris in the abdomen, leaving him to bleed gold and die. Enraged, Horus transforms into his winged god form, while Set morphs into his dog-like form. They battle in front of everyone, but Set gains the upper hand and is ready to kill Horus until Hathor kneels before him so that Horus may be spared. Set orders all the gods and mortals to kneel before him, and he plucks out both of Horus's all-seeing eyes.A year passes, and all of Egypt is under Set's rule. Those who do not follow him are either left dead or thrown into slavery, like Zaya. Bek frequently visits her in secrecy while her cruel master Urshu (Rufus Sewell) tends to his business with Set, which is building monuments in his honor. Zaya says that only Horus can save them, but he needs his eyes, which are kept in Set's vaults.Bek sneaks into one of the vaults and overcomes three bridges that are booby-trapped. He reaches the end, but he finds only one of Horus's eyes. Still, it is powerful and bright enough to ward off scorpions from down below.Bek returns to Urshu's home to rescue Zaya. Urshu and his guards are already waiting for him. Bek pulls out the eye to release a blinding white light, allowing him and Zaya to escape. Unfortunately, during the escape, Zaya is struck by an arrow shot by Urshu. She tells Bek she'll always love him and that death won't keep them apart. She dies before Bek knows it.Bek arrives at Horus's home where the disgraced god lives in squalor. He asks Horus for help, but he refuses until Bek brings out the eye. The two of them briefly duel until Bek says he can get him his other eye if he helps bring Zaya back to life. Horus promises, despite the truth being that it is impossible. For now, Horus summons Anubis (Goran D. Kleut) to guide her toward the afterlife, but Bek must rescue her before she reaches the final gate.Set learns that his vault was broken into. He travels to Horus's now empty home and finds Zaya's body lying under the floor, knowing what is going on. Set later sends his army toward the home of another god, Nephthys (Emma Booth), who was Horus's wife. He cruelly strikes her down and cuts off her wings.Horus brings Bek to the top of a pyramid to pray to his grandfather Ra (Geoffrey Rush) for help. Ra answers his prayer and allows him to morph into his god form so that he may fly up with Bek to Ra's home near the sun. Ra is constantly fighting Apep, the serpent god of chaos that appears as a gigantic black cloud. Horus seeks his grandfather's help to defeat Set. Horus is allowed to take special water from the Nile to hydrate the deserts and take away Set's power.Hathor, who has been kept as Set's slave, chooses to rebel against him. She grabs her bracelet, which wards off evil spirits, and she takes it off, which plunges her into the world of the evil spirits until she puts it back on and is transported somewhere far from Set.Horus and Bek are in the desert and are pursued by Set's hunters, Astarte (Yaya Deng) and Atat (Abbey Lee), both riding enormous fire-breathing serpents. The villains chase after the heroes. Horus traps Atat onto her serpent as it rides over the edge of a cliff to their deaths. Hathor arrives and commands Astarte's serpent to set itself on fire, killing itself and Astarte.The three continue their journey. In order to get into the vault to retrieve the other eye, they must pass the riddle of the Sphinx. They go to the temple of Thoth (Chadwick Boseman), the god of wisdom. Before entering, Hathor commands Bek to get her some water, but because his heart belongs to another, her powers don't work on him. He tells her about Zaya. Hathor is able to contact Zaya from beyond worlds to let her know that Bek is trying to rescue her.Although highly knowledgeable, Thoth is vain and has multiple copies of himself doing work for him. Bek plays on his ego and gets him to help them. He joins the three as they encounter the Sphinx. The Sphinx recites the riddle, and Thoth answers, but his first two guesses are incorrect. He decides to think as a mortal instead of a god, and he gets the answer right. The heroes find the eye, and Bek is preparing to pour the water to stop Set, until Set himself shows up. He steals Thoth's brain and tells Bek that he knows what Horus promised him, and that he cannot bring Zaya back. Set takes the water and pours it out.Set travels to Ra's home and expresses his anger over his destiny. He criticizes Ra for not allowing him to have children. Ra says it was part of a test that he has yet to pass. Ra wanted Set to take over his own duties to fight Apep, but Set instead duels his father and takes Ra's spear, impaling him. Set sends Ra over the edge, thus allowing Apep to break free and begin tearing through Egypt.Hathor gives Bek her bracelet to bring to Zaya so she may have something to offer before entering the afterlife. Hathor is then pulled away by the evil spirits. Anubis takes Bek to Zaya to give her the amulet, but Apep's arrival means the gate to the afterlife is sealed. Bek returns to the mortal world and reunites with Horus, despite feeling betrayed by him. Meanwhile, Set's armor is upgraded with Nephthys' wings, Thoth's brain, Horus's eye, and Ra's spear. He summons Apep toward him.Horus morphs into his falcon form once again and begins to fight Set. They battle across the top of the pyramid, while Bek is cornered by Urshu. After a brief fight, Bek manages to push Urshu over the edge to his death. Bek manages to pry the eye off of Set, getting himself mortally wounded in the process. Bek tosses the eye to Horus, but the god chooses to rescue Bek as he falls over the side of the pyramid. Horus brings Bek to safety and then flies up to continue fighting Set until he manages to weaken his uncle. Horus takes Ra's spear and impales Set, destroying him for good. He flies back to recover Ra and return his spear, allowing him to hold Apep away once again.A little village girl gives Horus his eye back, and the people of Egypt cheer for him freeing them. Horus then goes to Bek, moments before he dies. He brings his body back to his home to lay next to Zaya. Ra appears and thanks Horus, saying he owes him a debt. Horus says he wants what cannot be given. Ra knows what it means, and he uses his power to bring Bek and Zaya back to life. They awaken and kiss.Horus is then properly made king to rule over Egypt, while Thoth and Nephthys are also brought back to life. Horus then takes Hathor's bracelet and decides to go rescue her. He leaves Bek, now Horus's advisor, to make sure Egypt is left in good hands."
}