{
  "imdb_id": "tt2517622",
  "tmdb_id": "286699",
  "douban_id": null,
  "title": "Love Alien (2012)",
  "genres": [
    "Documentary",
    "Biography",
    "Family",
    "Romance"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "72 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm4484126",
      "name": "Wolfram Huke"
    }
  ],
  "writer": [
    {
      "id": "nm4484126",
      "name": "Wolfram Huke",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm4484126",
      "name": "Wolfram Huke",
      "character": "Himself"
    }
  ],
  "overview": null,
  "storyline": "You find yourself turning 30 without being initiated into the mysteries of love. What happened? LOVE ALIEN is a filmmaker's radical, subjective look at his life's problem. Accompanied by his camera, he explores the unknown world of lovers. On this journey he encounters relationship counselors, wardrobe consultants, partygoers, Valentine's Day shoppers, a neighbor's cat, his own family - and women. A filmmaker's cinematic attempt to find his first girlfriend.",
  "plot": "The commercial spacecraft Nostromo is on a return trip to Earth with a seven-member crew in stasis: Captain Dallas (Skerritt), Executive Officer Kane (Hurt), Navigator Lambert (Cartwright), Science Officer Ash (Holm), Warrant Officer Ripley (Weaver), and Engineers Parker (Kotto) and Brett (Stanton). Detecting a mysterious transmission from a nearby planetoid— possibly a distress signal—the ship's computer, Mother, awakens the crew. Following standard company policy for such situations, the Nostromo lands on the planetoid, sustaining damage from the planetoid's dusty atmosphere in the process. Parker and Brett begin repairing the ship, while Dallas, Kane, and Lambert head out to investigate. They discover the signal is coming from a derelict alien spacecraft. Inside, they find the remains of a large alien creature whose rib cage appears to have exploded from the inside.\n\nOn the Nostromo, Ripley determines that the transmission is not a distress signal but a warning. Ash responds by telling her that she wouldn't be able to communicate with the others in time. In the alien ship, Kane discovers a chamber containing hundreds of eggs. As he inspects one, a creature springs out and attaches itself to his face. Dallas and Lambert carry the unconscious Kane back to the Nostromo. As acting senior officer, Ripley refuses to let them aboard, citing quarantine regulations, but Ash violates protocol by overriding Ripley's lock and letting them in. The crew unsuccessfully attempt to remove the creature from Kane's face, discovering that its blood is an extremely corrosive acid. It detaches on its own and is found dead.\n\nWith the ship repaired, the crew lifts off. Kane awakens with some memory loss but otherwise unharmed. However, during the crew's final meal before re-entering stasis, he chokes and convulses in pain before a small alien creature bursts from his chest, killing him, and escapes into the depths of the ship. Since attacking the creature with conventional weapons could result in its corrosive blood breaching the ship's hull, the crew attempts to locate and capture it with motion trackers, nets, electric prods, and flamethrowers.\n\nBrett follows the crew's cat, Jones, into an engine room and the now fully grown alien (Badejo) attacks him and disappears with his body into the air shafts. After a heated discussion, the group devises a plan to jettison the creature out of the ship. Dallas enters the Nostromo's labyrinthine ventilation shafts, intending to force the alien into an airlock, but it ambushes him. Lambert, realizing the alien is killing the crew one by one, implores the others to escape in the ship's shuttle. Now in command, Ripley explains that the shuttle will not support four people, and recommends that they continue with Dallas' plan of flushing the alien out.\n\nAccessing Mother, Ripley discovers that Ash has secretly been ordered to return the alien to the crew's employers, who consider the crew expendable. When Ripley confronts Ash, he tries to choke her to death. Parker intervenes and knocks off Ash's head, revealing him to be an android. Parker reanimates Ash's head, and Ripley interrogates him. They learn he was assigned to the Nostromo to convince the crew to capture the creature and return it for analysis, even at the expense of the human personnel. Ash taunts them about their chances of survival against the \"perfect organism.\" Parker turns a flamethrower on Ash.\n\nRipley, Lambert and Parker agree to set the Nostromo to self-destruct and escape in the shuttle. However, Parker and Lambert are ambushed and killed by the alien while gathering life-support supplies. Ripley initiates the self-destruct sequence and heads for the shuttle with Jones, but the alien blocks her path. She retreats and unsuccessfully attempts to abort the self-destruct sequence, then returns to retrieve Jones, finding the alien gone. She narrowly escapes in the shuttle as the Nostromo explodes.\n\nAs she prepares to enter stasis, Ripley discovers the alien is aboard the shuttle. She dons a spacesuit and opens the shuttle's airlock, causing explosive decompression which forces the alien into the shuttle's open doorway. She propels it into space by shooting it with a grappling hook, but the gun catches in the closing door, tethering the alien to the shuttle. It attempts to crawl into one of the engines but Ripley then activates them, blasting the alien into space. After recording the ship's final log entry, she places herself and Jones into stasis for the voyage home.",
  "synopsis": null
}