{
  "imdb_id": "tt2586000",
  "tmdb_id": "164328",
  "douban_id": null,
  "title": "The Strange Little Cat (2013)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "72 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.7,
  "director": [
    {
      "id": "nm3885065",
      "name": "Ramon Zürcher"
    }
  ],
  "writer": [
    {
      "id": "nm3885065",
      "name": "Ramon Zürcher",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0771739",
      "name": "Jenny Schily",
      "character": "Mutter"
    },
    {
      "id": "nm2100161",
      "name": "Anjorka Strechel",
      "character": "Karin"
    },
    {
      "id": "nm5186397",
      "name": "Mia Kasalo",
      "character": "Clara"
    },
    {
      "id": "nm4036953",
      "name": "Luk Pfaff",
      "character": "Simon"
    },
    {
      "id": "nm0228570",
      "name": "Matthias Dittmer",
      "character": "Vater"
    },
    {
      "id": "nm0546546",
      "name": "Armin Marewski",
      "character": "Schwager"
    },
    {
      "id": "nm5459082",
      "name": "Leon Alan Beiersdorf",
      "character": "Jonas"
    },
    {
      "id": "nm0921477",
      "name": "Sabine Werner",
      "character": "Tante"
    },
    {
      "id": "nm3396632",
      "name": "Kathleen Morgeneyer",
      "character": "Hanna"
    },
    {
      "id": "nm0381775",
      "name": "Monika Hetterle",
      "character": "Großmutter"
    },
    {
      "id": "nm5458379",
      "name": "Gustav Körner",
      "character": "Nachbarsjunge"
    },
    {
      "id": "nm2181372",
      "name": "Lea Draeger",
      "character": "Frau auf Balkon"
    },
    {
      "id": "nm10587237",
      "name": "Ferdinand",
      "character": "Hund"
    },
    {
      "id": "nm10587238",
      "name": "Kasimir",
      "character": "Katze"
    }
  ],
  "overview": "It is a Saturday in autumn, and Karin and Simon are visiting their parents and youngest sister Clara. This family gathering provides the occasion for a dinner together, at which other relatives appear over the course of the day. While the family members animate the apartment’s space with their conversations, everyday activities and cooking preparations, the cat and dog range through the various rooms. they too become a central element in this quotidian familial dance that repeatedly manifests stylized elements, disrupting any naturalistic mode of presentation. In this way, adjoining spaces open up between family drama, fairy tale and the psychological study of a mother.",
  "storyline": "Siblings Karin and Simon are visiting their parents and their little sister Clara. That evening, other relatives will be joining them for dinner. Over the course of the day, the washing machine is repaired, people sit together at the kitchen table, carry out an experiment with orange peel, talk about lungs, and sew on a button that was deliberately torn off. This sequence of family scenes in a Berlin flat complete with cat and dog creates a wondrous world of the everyday: Coming and going, all manner of doings, each movement leading to the next, one word following another. It is a carefully staged chain reaction of actions and sentences. And in between, silent gazes and anecdotes about experiences. The people act oddly even-temperedly; their dialogues are direct and unemotional. Even the pets and the material surroundings play a part. Some objects seem alive as if by magic. Commonplace actions and familiar items appear absurd and eerie in this narrative cosmos. Putting the absurdities...",
  "plot": "The story begins as a girl named Sally and her unnamed brother, who serves as the narrator of the book, sit alone in their house on a cold, rainy day, staring wistfully out the window. Then they hear a loud bump which is quickly followed by the arrival of the Cat in the Hat, a tall anthropomorphic cat in a red and white striped hat and a red bow tie. The Cat proposes to entertain the children with some tricks that he knows. The children's pet fish refuses, insisting that the Cat leave. The Cat responds by balancing the fish on the tip of his umbrella. The game quickly becomes more complicated, as the Cat balances himself on a ball and tries to balance lots of household items on his limbs until he falls on his head, dropping everything he was holding. The fish admonishes him again, but the Cat in the Hat just proposes another game.\n\nThe Cat brings in a big red box from outside, from which he releases two identical creatures with blue hair and red suits called Thing One and Thing Two. The Things cause more trouble, such as flying kites in the house, knocking pictures off the wall and picking up the children's mother's new polka-dotted gown. All this comes to an end when the fish spots the children's mother out the window. In response, Sally's brother catches the Things in a net, and the Cat, apparently ashamed, stores them back in the big red box. He takes it out the front door as the fish and the children survey the mess he has made. But the Cat soon returns, riding a machine that picks everything up and cleans the house, delighting the fish and the children. The Cat leaves just before their mother arrives, and the fish and the children are back where they started at the beginning of the story. As she steps in, the mother asks the children what they did while she was out, but the children are hesitant and do not answer. The story ends with the question, \"What would you do if your mother asked you?\"",
  "synopsis": null
}