{
  "imdb_id": "tt2560102",
  "tmdb_id": "248212",
  "douban_id": null,
  "title": "Lilting (2014)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "83 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm0393234",
      "name": "Hong Khaou"
    }
  ],
  "writer": [
    {
      "id": "nm0393234",
      "name": "Hong Khaou",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0924210",
      "name": "Ben Whishaw",
      "character": "Richard"
    },
    {
      "id": "nm0155607",
      "name": "Pei-Pei Cheng",
      "character": "Junn       (as Cheng Pei Pei)"
    },
    {
      "id": "nm4942550",
      "name": "Andrew Leung",
      "character": "Kai"
    },
    {
      "id": "nm1410360",
      "name": "Morven Christie",
      "character": "Margaret"
    },
    {
      "id": "nm6228755",
      "name": "Naomi Yang",
      "character": "Vann       (as Naomi Christie)"
    },
    {
      "id": "nm0101248",
      "name": "Peter Bowles",
      "character": "Alan"
    }
  ],
  "overview": "Lilting is a touching, intimate film about finding the things which bring us together. In contemporary London, a Cambodian Chinese mother mourns the untimely death of her son. Her world is further disrupted by the presence of a stranger. We observe their difficulties in trying to connect with one another without a common language, as through a translator they begin to piece together memories of a man they both loved.",
  "storyline": "In contemporary London, a Cambodian-Chinese mother mourns the untimely death of her son. Her world is further disrupted by the presence of a stranger. We observe their difficulties in trying to connect with each other without a common language as, through a translator, they begin to piece together memories of a man they both loved.",
  "plot": "Lilting tells the story of a mother’s attempt at understanding who her son was after his untimely death. Her world is suddenly disrupted by the presence of his lover. Together, they attempt to overcome their grief whilst struggling against not having a shared language.",
  "synopsis": "An intimate and thoughtful film about what is like to live in a world where you\nhave no grasp of its language, and your only lifeline to that is lost. Its about falling in\nlove without a common language, forming relationships without a common language.\nHow necessary it is to overcome cultural and generational barriers. Memory, grief,\nour familiar and often difficulties with language and communication are explored."
}