{
  "imdb_id": "tt2573750",
  "tmdb_id": "254420",
  "douban_id": null,
  "title": "Gulaab Gang (2014)",
  "genres": [
    "Action",
    "Drama"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "139 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm2265536",
      "name": "Soumik Sen"
    }
  ],
  "writer": [
    {
      "id": "nm2265536",
      "name": "Soumik Sen",
      "description": "story and screenplay"
    },
    {
      "id": "nm3451648",
      "name": "Amitosh Nagpal",
      "description": "dialogue &"
    },
    {
      "id": "nm2265536",
      "name": "Soumik Sen",
      "description": "dialogue"
    }
  ],
  "cast": [
    {
      "id": "nm0002043",
      "name": "Madhuri Dixit",
      "character": "Rajjo"
    },
    {
      "id": "nm0004487",
      "name": "Juhi Chawla",
      "character": "Sumitra Devi"
    },
    {
      "id": "nm0415555",
      "name": "Divya Jagdale",
      "character": "Mahie"
    },
    {
      "id": "nm3140757",
      "name": "Priyanka Bose",
      "character": "Sandhya"
    },
    {
      "id": "nm1318578",
      "name": "Tannishtha Chatterjee",
      "character": "Kajri"
    },
    {
      "id": "nm6342069",
      "name": "Lata S. Singh",
      "character": "Tara"
    },
    {
      "id": "nm6278693",
      "name": "Ashish Bhatt",
      "character": "Arun's friend"
    },
    {
      "id": "nm4710099",
      "name": "Sudev Nair",
      "character": "Arun"
    },
    {
      "id": "nm6720052",
      "name": "Ankit Anil Sharma",
      "character": "Sarju"
    }
  ],
  "overview": "A fearless woman fights social injustice; creating a sanctuary for abused women and battling a crooked politician.",
  "storyline": "Rajjo has created an ashram (sanctuary) for girls and women. The youngest students are taught to read. The adults are given a chance for employment, grounding spices, weaving beautiful pink saris, and when necessary picking up weapons to fight social injustices. Rajjo and her rose-hued gang members are asked to back Sumitra Bagrecha, a politician whose grand promises inspire hope in Rajjo. But when Sumitra reveals her callous, greedy nature, the Gulaab Gang become her worse enemy.",
  "plot": "The Gulaab Gang members are activists and vigilantes in Bundelkhand Uttar and Madhya Pradesh. They wear pink sarees and take up issues like domestic violence, the dowry system, rape, electricity matters, and education. Their fierce leader, Rajjo (Madhuri Dixit), locks horns with a conniving and shrewd politician, Sumitra Bagrecha (Juhi Chawla), who uses people.\n\nRajjo runs a Gulaab gang in the village of Madhopur, where she teaches little girls their alphabet, and grown-up girls how to wield a lathi. Her gang is made up of women who wear bright pink. Rajjo's closest friends in the gang are a tomboy (Divya Jagdale), a woman abandoned by her husband (Tannishtha Chatterjee), and a kohl-eyed woman (Priyanka Bose). These ladies go about standing up for the meek and the downtrodden, and clash against villainous husbands, cops and politicians. The plot gains momentum when Rajjo decides to take part in the local elections against a manipulative and conniving politician, Sumitra Devi (Juhi Chawla). Sumitra does her best to make sure Rajjo is incapacitated during election campaigns by having most of her gang members killed by the henchmen. Towards the end, Rajjo decides to take revenge against Sumitra. During Holi celebrations, when Sumitra conspires to finish off the Gulaab Gang, Rajjo retaliates by chopping off Sumitra Devi's hand as the latter tries to shoot the gang with a machine gun. At the end, Sumitra is arrested and is sentenced to life in prison and Rajjo is also arrested for her violent retribution. However, Rajjo eventually realises her dream of establishing a school for unprivileged girls.",
  "synopsis": null
}