{
  "imdb_id": "tt2537064",
  "tmdb_id": "200896",
  "douban_id": null,
  "title": "Route of Acceptance (2012)",
  "genres": [
    "Drama"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "114 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.0,
  "director": [
    {
      "id": "nm2832396",
      "name": "Heather Tobin"
    }
  ],
  "writer": [
    {
      "id": "nm2832396",
      "name": "Heather Tobin",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm9110256",
      "name": "Dre Carrwgton",
      "character": "Matty"
    },
    {
      "id": "nm3577098",
      "name": "Emily Alatalo",
      "character": "Ryan Stark"
    },
    {
      "id": "nm2028004",
      "name": "Ry Barrett",
      "character": "Cory       (as Ryan Barrett)"
    },
    {
      "id": "nm3579773",
      "name": "Wade Gamble",
      "character": "Dave Sweeney"
    },
    {
      "id": "nm2436789",
      "name": "Yvonne Gauthier",
      "character": "Emily Abbott"
    },
    {
      "id": "nm3289900",
      "name": "Kelly-Marie Murtha",
      "character": "Kali"
    },
    {
      "id": "nm5377272",
      "name": "Janice Tate",
      "character": "Helen Stark"
    },
    {
      "id": "nm5466813",
      "name": "Susan Q Wilson",
      "character": "Gran"
    }
  ],
  "overview": "Aspiring film writer Ryan Stark is having a hard time deciding what University to go to and is fearful to leave the comforts and predictability of high school and her life thus far. The film explores three realities of this young lesbian's life and shows how a decision like your school selection can change your entire future. Each life path evokes intense emotions as Ryan is torn between her love for career, family and marriage.",
  "storyline": "To Each Her Own Films new dramatic feature, 'Route of Acceptance', is a concept film that plays with the idea of the possible existence of destiny. Aspiring film writer Ryan Stark, is having a hard time deciding what University to go to and is fearful to leave the comforts and predictability of high school and her life thus far. The film explores three realities of this young lesbian's life and shows how a decision like your school selection can change your entire future. Each life path evokes intense emotions as Ryan is torn between her love for career, family and marriage. Written and Directed by Heather Tobin, Cinematography by Justin Dyck.",
  "plot": null,
  "synopsis": null
}