{
  "imdb_id": "tt2556992",
  "tmdb_id": "277765",
  "douban_id": null,
  "title": "Art as a Weapon (2012)",
  "genres": [
    "Documentary",
    "Adventure"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "76 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm5398641",
      "name": "Jeffrey Durkin"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm6209554",
      "name": "Gaston D'Agrivieri",
      "character": "Rebel Messenger"
    },
    {
      "id": "nm1735854",
      "name": "Shepard Fairey",
      "character": "Himself"
    },
    {
      "id": "nm6562845",
      "name": "Erik Nordtvedt",
      "character": "Himself"
    },
    {
      "id": "nm2199855",
      "name": "EJ Scalzi",
      "character": "Scott"
    },
    {
      "id": "nm6562846",
      "name": "King Zero",
      "character": "Himself"
    }
  ],
  "overview": "Street art, creativity and revolution collide in this beautifully shot film about art’s ability to create change. The story opens on the politically charged Thailand/Burma border at the first school teaching street art as a form of non-violent struggle. The film follows two young girls (Romi &amp; Yi-Yi) who have escaped 50 years of civil war in Burma to pursue an arts education in Thailand. Under the threat of imprisonment and torture, the girls use spray paint and stencils to create images in public spaces to let people know the truth behind Burma's transition toward \"artificial democracy.\" Eighty-two hundred miles away, artist Shepard Fairey is painting a 30’ mural of a Burmese monk for the same reasons and in support of the students' struggle in Burma. As these stories are inter-cut, the film connects these seemingly unrelated characters around the concept of using art as a weapon for change.",
  "storyline": "Art as a weapon explores the concept of street art being used as a political tool. Exploring the intersection between Democracy, Buddhism and art by following a group of students doing street art on the Burmese boarder and contrasting it with stories from American street artist Shepard Fairey.",
  "plot": null,
  "synopsis": null
}