{
  "imdb_id": "tt2507592",
  "tmdb_id": "159942",
  "douban_id": null,
  "title": "An Episode in the Life of an Iron Picker (2013)",
  "genres": [
    "Drama"
  ],
  "country": "Bosnia and Herzegovina",
  "version": [
    {
      "runtime": "75 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm0849786",
      "name": "Danis Tanovic"
    }
  ],
  "writer": [
    {
      "id": "nm0849786",
      "name": "Danis Tanovic",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm5409662",
      "name": "Nazif Mujic",
      "character": "Nazif"
    },
    {
      "id": "nm5410008",
      "name": "Senada Alimanovic",
      "character": "Senada"
    },
    {
      "id": "nm5407719",
      "name": "Semsa Mujic",
      "character": "Semsa"
    },
    {
      "id": "nm5408184",
      "name": "Sandra Mujic",
      "character": "Sandra"
    }
  ],
  "overview": "Senada is 31 and she lives in Poljice neighborhood in Lukavac municipality with her partner and two daughters. She is pregnant with her third child for approximately five months. Since she didn’t have health insurance, she does not go to the doctor’s. When she started bleeding, she goes to the hospital. The doctor told Senada that she needs an emergency surgery and she needs to pay 500 EUR. Without a health insurance card and without money, Senada returns home.",
  "storyline": "A Roma family lives far from the urban centres of Bosnia-Herzegovina. The father Nazif salvages metal from old cars and sells it to a scrap-dealer. The mother Senada keeps the house tidy, cooks, bakes and cares for their two small daughters. One day, she feels a sharp pain in her abdomen. At the hospital she is told there is something wrong with the baby she is carrying: \"They say it's dead.\" She is at risk of septicaemia and they must operate immediately. But Senada has no medical insurance; since the operation will cost much more than the family can afford the hospital's head refuses to treat her. A race against time together with a mounting sense of hopelessness played by a cast of non-professional actors re-enacting an episode from their own lives. Winner of the Silver Bear Jury Grand Prix and the Silver Bear for best actor at the Berlin Film Festival 2013.",
  "plot": null,
  "synopsis": "Nazif barely makes ends meet as an iron picker to support his family. He searches daily for scrap metal while his partner Senada tends to their home and their two young daughters. A third baby is on the way.After a long days work, Nazif finds Senada laid up in pain. The following day, he borrows a car to drive her to the nearest clinic. The diagnosis is that Senada has miscarried and is still carrying her dead five-month old fetus. The condition is critical and Senada needs immediate treatment at a faraway city hospital.Because she does not have a state-provided health insurance card, the hospital requests that Senada pay 980 Bosnian marks (500 euros), a fortune for a modest iron picker. Despite Nazifs begging, Senada is denied the crucial surgery and forced to return home to their Roma community in central Bosnia and Herzegovina.For the next 10 days, Nazif will do everything he can to try and save Senadas life desperately searching for more scrap metal, seeking help from state institutions For the next 10 days, Nazif and Senada will be fully exposed to the callousness of contemporary society."
}