{
  "imdb_id": "tt2512582",
  "tmdb_id": "199291",
  "douban_id": null,
  "title": "The Dark Matter of Love (2012)",
  "genres": [
    "Documentary"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "93 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.4,
  "director": [
    {
      "id": "nm2864533",
      "name": "Sarah McCarthy"
    }
  ],
  "writer": [
    {
      "id": "nm2864533",
      "name": "Sarah McCarthy",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm8638556",
      "name": "Caitlyn Maria Diaz",
      "character": "Herself"
    },
    {
      "id": "nm8638555",
      "name": "Camilena Anna Diaz",
      "character": "Herself"
    },
    {
      "id": "nm8638557",
      "name": "Cayden Marcel Diaz",
      "character": "Himself"
    },
    {
      "id": "nm8638554",
      "name": "Cheryl Diaz",
      "character": "Herself"
    },
    {
      "id": "nm2740982",
      "name": "Claudio Diaz",
      "character": "Himself"
    },
    {
      "id": "nm8638558",
      "name": "Cole Vadim Diaz",
      "character": "Himself"
    },
    {
      "id": "nm8638560",
      "name": "Maddie Fischer",
      "character": "Herself"
    },
    {
      "id": "nm3283417",
      "name": "Robert Marvin",
      "character": "Himself       (as Dr. Robert Marvin)"
    },
    {
      "id": "nm8638559",
      "name": "Nicole Milliren",
      "character": "Herself"
    },
    {
      "id": "nm8638561",
      "name": "Michael Rounds",
      "character": "Himself"
    }
  ],
  "overview": "Eleven year old Masha Kulabokhova is about to be adopted into fourteen year old Cami Diaz's family. Masha grew up in a Russian orphanage; Cami was born and raised in Wisconsin and has been the exclusive focus of her parents' love her whole life. The process of Masha becoming part of the Diaz family is going to change both girls forever. The Dark Matter of Love follows Masha as she leaves Russia to the spend her first year as part of the Diaz family, who have also adopted five year old twin boys Marcel and Vadim. When the reality of bonding with children who have grown up in institutions turns out to be more difficult than they ever imagined, the Diaz's hire two of the world's best developmental psychologists to help them build their new family - through science. Sometimes hilarious, sometimes heartbreaking, The Dark Matter of Love melds the story of the Diaz family learning to love, with rare archive footage of science experiments exploring parent-child love.",
  "storyline": "ABOUT THE FILM Eleven year old Masha Kulabokhova is about to be adopted into fourteen year old Cami Diaz's family. Masha grew up in a Russian orphanage; Cami was born and raised in Wisconsin and has been the exclusive focus of her parents' love her whole life. The process of Masha becoming part of the Diaz family is going to change both girls forever. THE DARK MATTER OF LOVE follows Masha as she leaves Russia to spend her first year as part of the Diaz family, who have also adopted five year old twin boys Marcel and Vadim. When the reality of bonding with children who have grown up in institutions turns out to be more difficult than they ever imagined, the Diaz's hire two of the world's best developmental psychologists to help them build their new family - through science. Professor Emeritus at the University of Virginia School of Medicine, Dr Robert Marvin, has spent a lifetime developing a world-renowned therapy program that draws upon the past 100 years of scientific discoveries in...",
  "plot": "The Dark Knight Returns is set in a dystopian near-future version of Gotham City. Bruce Wayne, at 50, has given up the mantle of Batman after the death of Jason Todd 10 years prior. As a result, crime is running rampant through the city and a gang calling themselves 'The Mutants' has risen to terrorize the people of Gotham. Upon seeing this, Wayne returns to his role as a vigilante. On his first night as Batman he puts a stop to multiple assaults- including one on two young girls, Carrie Kelley and her friend Michelle. While attempting to foil an armed robbery on the same night, Batman learns that the men involved are working for Harvey Dent. Dent, previously known for his criminal acts as Two-Face, underwent extensive therapy and plastic surgery financed by Wayne to reemerge into society. Batman informs Commissioner James Gordon that Dent may be planning a larger scheme. Soon after, Dent hijacks the television sets of the city and announces his intention to hold the city to ransom with a bomb. When Batman defeats Dent and his goons, he realizes that Dent's mind has completely warped into his Two-Face persona.\n\nInspired by Batman's rescue, Kelley buys herself an imitation Robin costume and searches for him, seeking to help him. She learns that Batman will be at the city dump and follows the Mutants there. Although Batman defeats the Mutants with his advanced weaponry in the ensuing battle, the Mutant Leader ends up goading him into a fight. During their hand-to-hand brawl, Batman, despite being able to match the Leader in strength, is rusty and slightly slow due to a decade's lack of activity which results him in getting seriously injured. Kelley creates a diversion, allowing Batman to immobilise the Mutant Leader, and the two of them escape. At the Batcave, Wayne's butler Alfred Pennyworth tends to his wounds while Kelley admires the Robin costume that belonged to Todd. Wayne decides to keep Kelley as his new sidekick. Gordon allows Batman to defeat the Mutant Leader (who he had arrested) on his own terms. The two engage in a fight at a sewage run-off pipe surrounded by members of the Mutant gang. Batman, leveraging the mud from the sewage to slow him down, deals the Leader a brutal defeat. Seeing Batman defeat their leader, the Mutants disband and some rename themselves the Sons of Batman, using excessive violence against criminals.\n\nAt the White House, Superman and the president discuss the events in Gotham, with the latter suggesting that Superman may have to arrest Batman. Superman informs the president that he may only be able to talk to Wayne. He is then deployed by Washington to the Latin American country of Corto Maltese where he fights Soviet combat forces in a conflict that may ignite WWIII.\n\nGordon hands over the role of commissioner to Captain Ellen Yindel, who issues a statement declaring that Batman is a wanted criminal for his vigilante activities. At the same time, Batman's return stimulates the Joker to awaken from catatonia at Arkham Asylum. With renewed purpose, the Joker manipulates his caretakers to allow him onto a television talk show, where he murders everyone with gas and escapes. Batman and Robin track him to a county fair while evading a police pursuit led by Yindel. There, they realise that he is already making attempts to kill fairgoers. Batman defeats the Joker in a violent confrontation, nearly killing him. To incriminate Batman for murder, the Joker seemingly commits suicide by breaking his own spine. After another confrontation with the Gotham police, Batman escapes with the help of Robin and a citywide manhunt begins.\n\nSuperman diverts a Soviet nuclear warhead which detonates in a desert, nearly killing himself in the process. The United States is hit by an electromagnetic pulse as a result and descends into chaos during the resulting blackout. In Gotham, Batman realizes what has happened, and he and Robin turn the remaining Mutants and Sons of the Batman into a non-lethal vigilante gang. He leads them against looters and ensures the flow of essential supplies. In the midst of the blackout, Gotham becomes the safest city in the country. The U.S. government sees this as an embarrassment, and orders Superman to remove Batman. Oliver Queen predicts to Wayne that the government lackey Superman and the maverick Batman will have a final confrontation. Superman demands to meet Batman. Knowing he may die, Wayne chooses Crime Alley, where he first became Batman. He relies on Superman's weakness caused by near-death in the nuclear blast (Superman only just managed to survive by absorbing the energy of the sun, but he is still vulnerable to attack).\n\nSuperman tries to reason with Batman, but Batman uses his technological inventions and mastery of hand-to-hand combat to fight him. During the battle, Superman compromises Batman's exoframe, while Queen shoots a kryptonite-tipped arrow to greatly weaken Superman. Batman reveals that he intentionally spared Superman's life by not using a more powerful kryptonite mix; the fight and near-death experience was meant as a warning to Superman to stay out of Batman's way. Before he can fully defeat Superman, Batman suddenly has a heart attack, apparently dying. Alfred destroys the Batcave and Wayne Manor before dying of a stroke, exposing Batman as Bruce Wayne, whose fortune has disappeared. After Wayne's funeral, it is revealed that his death was staged using his own chemical concoction that can suspend his vital life signs. Clark Kent attends the funeral and winks at Robin after hearing Wayne's heartbeat resume. Some time afterward, Bruce Wayne leads Robin, Queen, and the rest of his followers into the caverns beyond the Batcave and prepares to continue his war on crime.",
  "synopsis": null
}