{
  "imdb_id": "tt2569298",
  "tmdb_id": "168145",
  "douban_id": null,
  "title": "Devil May Call (2013)",
  "genres": [
    "Horror",
    "Thriller"
  ],
  "country": "Thailand",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.4,
  "director": [
    {
      "id": "nm1231999",
      "name": "Jason Cuadrado"
    }
  ],
  "writer": [
    {
      "id": "nm1231999",
      "name": "Jason Cuadrado",
      "description": "story"
    },
    {
      "id": "nm1231999",
      "name": "Jason Cuadrado",
      "description": "writer"
    },
    {
      "id": "nm1231999",
      "name": "Jason Cuadrado",
      "description": null
    },
    {
      "id": "nm5417430",
      "name": "Wyatt Doyle",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0257598",
      "name": "Corri English",
      "character": "Sam"
    },
    {
      "id": "nm0541932",
      "name": "Tyler Mane",
      "character": "John"
    },
    {
      "id": "nm0000183",
      "name": "Traci Lords",
      "character": "Valerie"
    },
    {
      "id": "nm2082499",
      "name": "Van Hansis",
      "character": "Jess"
    },
    {
      "id": "nm0762520",
      "name": "Camillia Monet",
      "character": "Emily       (as Camillia Sanes Monet)"
    },
    {
      "id": "nm1659569",
      "name": "Tracy Perez",
      "character": "Jules"
    },
    {
      "id": "nm0446298",
      "name": "Daniel Hugh Kelly",
      "character": "Tony"
    },
    {
      "id": "nm3874989",
      "name": "Carina Aviles Marshall",
      "character": "Victim #1       (as Carina Aviles)"
    },
    {
      "id": "nm10581684",
      "name": "Andrea Vicuna",
      "character": "Victim #2"
    },
    {
      "id": "nm4356153",
      "name": "Krystal Alvarez",
      "character": "Hotline Caller"
    },
    {
      "id": "nm4496290",
      "name": "Krystelle Lorraine",
      "character": "Hotline Caller"
    },
    {
      "id": "nm3365191",
      "name": "Joe Cabello",
      "character": "Hotline Caller"
    },
    {
      "id": "nm5417333",
      "name": "Leora Kashani",
      "character": "Staffer"
    },
    {
      "id": "nm5418041",
      "name": "Arthur Oganesyan",
      "character": "Staffer"
    },
    {
      "id": "nm4852333",
      "name": "Phoebe Phillips",
      "character": "Staffer"
    },
    {
      "id": "nm4616019",
      "name": "Scott Thomas Reynolds",
      "character": "Staffer"
    },
    {
      "id": "nm5502343",
      "name": "Israel Solis",
      "character": "Staffer"
    },
    {
      "id": "nm3065259",
      "name": "Urs Brunner",
      "character": "Uniformed Guard"
    },
    {
      "id": "nm0274682",
      "name": "Marc Ferrero",
      "character": "Uniformed Guard"
    }
  ],
  "overview": "Samantha \"Sam\" works at a crisis hot-line where she listens to strangers and helps them deal with their pain. It's a pain she knows well since the hot-line saved her life once when she lost her sight and didn't know how to live in a world of darkness. On her last night on the job, Sam receives an terrifying visit from one of her regular callers who feels betrayed that she's leaving him. This man is no ordinary caller. He's a sadistic serial killer she's unknowingly been keeping from killing himself for over a year. With only a skeleton on the graveyard shift, there's very little that stands between him and Sam. He's come for her and won't let anything or anyone stand in his way. Will Sam survive the longest, darkest night of her life?",
  "storyline": "Samantha \"Sam\" works at a crisis hot-line where she listens to strangers and helps them deal with their pain. It's a pain she knows well since the hot-line saved her life once when she lost her sight and didn't know how to live in a world of darkness. On her last night on the job, Sam receives a terrifying visit from one of her regular callers who feels betrayed that she's leaving him. This man is no ordinary caller. He's a sadistic serial killer she's unknowingly been keeping from killing himself for over a year. With only a skeleton crew on the graveyard shift, there's very little that stands between him and Sam. He's come for her and won't let anything or anyone stand in his way. Will Sam survive the longest, darkest night of her life?",
  "plot": "See also: Characters of Devil May Cry\nThe game is set in an alternate reality of the series. The game's story takes place in Limbo City, a modern-day city secretly controlled by all-powerful demons, manipulating humanity through the comforts of life, with the demons themselves residing in a parallel plane called 'Limbo'. Living on the fringes of the brainwashed society is Dante, a young man at odds with the demons who constantly hunt him, and the civilian authorities they control. Dante is warned by a young woman named Kat that he is in danger just as a Hunter demon drags him into Limbo. Dante navigates the Bellevue Pier's carnival and kills the demon with Kat's aid, who can see into Limbo with her psychic powers. Dante returns to the human world and accepts Kat's offer to meet with her boss, Vergil.\n\nAlong the way, Kat explains that Vergil leads \"The Order\", a rogue vigilante organisation intent on exposing the demons and releasing the world from their control. Vergil tells Dante that with his help the Order can bring down the demons. Dante learns that he and Vergil are not only long lost twin brothers but also Nephilim, the children of Angel and Demon and the only beings capable of killing the cruel demon king Mundus. Their demon father Sparda was Mundus' chief lieutenant in the war against the angels until he betrayed Mundus when he fell in love with the angel Eva and sired the twins. Mundus, afraid of the Nephilim, attacked the family and killed Eva. Sparda spirited his sons to safety, wiped their memories for their own protection and gave each a sword (Rebellion for Dante, Yamato for Vergil). Mundus imprisoned Sparda and condemned him to eternal torture and has hunted Dante ever since. After learning of his past, Dante resolves to help Vergil bring down Mundus and his regime.\n\nDante, with help from Kat, gradually takes down Mundus' operations. During the final stages of his campaign, Dante witnesses a SWAT team raid the Order's headquarters, killing everyone in sight. Dante rescues Vergil from Limbo but he is helpless to protect Kat from being brutally beaten and dragged back to Mundus' lair. Dante then kidnaps Lilith, Mundus' demon concubine carrying Mundus' unborn child, and offers to trade her to Mundus for Kat. During the exchange, Vergil kills Lilith, her child and the SWAT troops. The three allies narrowly escape as Mundus tears much of city apart in an outburst of power that depletes the Hellgate, a portal to the demon world within his stronghold in Silver Sacks Tower. Kat, recovering from her injuries, leads the brothers through a detailed plan to infiltrate the Towers and defeat Mundus. Dante draws Mundus out of his lair and Vergil closes the Hellgate, rendering Mundus mortal. Mundus forms a massive body for himself and confronts the brothers but ultimately, Dante lands the killing blow to destroy Mundus for good. Limbo collapses into the human world, making demons visible to humans and creating chaos and pandemonium worldwide.\n\nAfter Mundus' defeat, Vergil reveals his true intentions: with their family avenged, he intends to rule humanity in Mundus' place. Vergil argues that as their saviours, they must protect humans \"from themselves\" yet he callously dismisses the human Kat's role in saving humanity. Dante is appalled at Vergil's attitude and defeats him in a climactic sword fight. Kat stops Dante from killing his brother and Vergil leaves in disgrace. Faced with a world now infested with demons and abandoned by his own brother, Dante questions his own identity with Kat comforting him claiming he's \"Dante, nothing more and nothing less\". The game ends with Dante's eyes glowing Nephilim Purple.\n\nThe DLC chapter Vergil's Downfall follows Vergil after escaping from Dante. He finds himself in an unknown dimension, where he is guided by the voice of Eva to \"head toward the lights\". Vergil reaches the light area but is stopped by illusions of Kat and Dante, who stabs him again. Vergil is saved by a hollow version of himself and is transported to an area where he has to fight to heal his wounds. In his journey Vergil kills the illusions to heal his wounds, and left Eva to mourn after discovering what a monster he had chosen to become. Vergil later defeats his hollow counterpart and takes his amulet. Vergil then returns to the real world and encounters demons, who begin to bow at his feet. Confident in his future, Vergil becomes the new Demon King.",
  "synopsis": null
}