{
  "imdb_id": "tt2551378",
  "tmdb_id": "220495",
  "douban_id": null,
  "title": "Bullett Raja (2013)",
  "genres": [
    "Action",
    "Crime",
    "Drama"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "138 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.0,
  "director": [
    {
      "id": "nm0223606",
      "name": "Tigmanshu Dhulia"
    }
  ],
  "writer": [
    {
      "id": "nm0223606",
      "name": "Tigmanshu Dhulia",
      "description": "dialogue"
    },
    {
      "id": "nm0223606",
      "name": "Tigmanshu Dhulia",
      "description": "story and screenplay"
    },
    {
      "id": "nm5984483",
      "name": "Amaresh Misra",
      "description": "story and screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0451307",
      "name": "Saif Ali Khan",
      "character": "Raja Misra"
    },
    {
      "id": "nm0792116",
      "name": "Jimmy Sheirgill",
      "character": "Rudra Tripathi       (as Jimmy Shergill)"
    },
    {
      "id": "nm4651098",
      "name": "Vidyut Jammwal",
      "character": "Arun Singh 'Munna'       (as Vidyut Jamwal)"
    },
    {
      "id": "nm3848064",
      "name": "Sonakshi Sinha",
      "character": "Mitali"
    },
    {
      "id": "nm0044796",
      "name": "Raj Babbar",
      "character": "Minister Ram Babu Shukla"
    },
    {
      "id": "nm0004109",
      "name": "Gulshan Grover",
      "character": "Balraj bajaj (Main villain)"
    },
    {
      "id": "nm0457410",
      "name": "Ravi Kishan",
      "character": "Sumer Yadav"
    },
    {
      "id": "nm0659233",
      "name": "Chunky Pandey",
      "character": "Lallan Tiwari"
    },
    {
      "id": "nm1479650",
      "name": "Vipin Sharma",
      "character": "Shrivastava Ji"
    },
    {
      "id": "nm4432309",
      "name": "Rishad Rizvi",
      "character": ""
    },
    {
      "id": "nm5960086",
      "name": "Gaurav Jha",
      "character": "Mithilesh Don       (rumored)"
    },
    {
      "id": "nm8450324",
      "name": "Hemendra Dandotiya",
      "character": "Dakait"
    },
    {
      "id": "nm2977124",
      "name": "Mahie Gill",
      "character": ""
    },
    {
      "id": "nm0694986",
      "name": "Vishwajeet Pradhan",
      "character": ""
    },
    {
      "id": "nm1516058",
      "name": "Deep Raj Rana",
      "character": "Inspector General of Police"
    },
    {
      "id": "nm0768296",
      "name": "Sharat Saxena",
      "character": ""
    }
  ],
  "overview": "A common man who transforms into a gangster revolts against the very system he once obediently followed by declaring war on the police, the government, and the industrialists.",
  "storyline": "Bullett Raja is the story of a common man, Raja Mishra, who transforms into a dreaded gangster of the Hindi heartland. A victim of the system and chained by it, Raja's life changes as he takes on those that rule and shakes the very foundations of the nexus of the police, the government, and the industrialists. As he rises and revolts against the system becoming an outlaw, Bullett sets ablaze the nexus and changes the landscape forever. The powers that be, fight back in a compelling struggle for power and money against the backdrop of personal ambitions, greed and revenge. Redefining love, friendship and loyalty, Bullet Raja creates a world, where a common man, tests his endurance and fortitude against the very system he once obediently followed and then declared a war on it!",
  "plot": "Raja Mishra (Saif Ali Khan) gatecrashes into a marriage while trying to escape from a brawl. The bride's cousin, Rudra Tripathi (Jimmy Shergill), and Raja form a friendship upon Raja revealing that he is a uninvited guest. While in process of seducing the mujra dancer, Raja overhears a plot by Lallan Tiwari (Chunky Pandey) to execute everyone in the wedding upon instructions from a land lord wanting to use Rudra's uncle's land for poppy farming. Raja warns everyone about the impending attack and Raja and Rudra fight off the attacking Lallan Singh's gang. Rudra's uncle (Sharat Saxena) sees the potential in Raja and Rudra forming an alliance for offering protection to political personalities and offers them to join his gang. Not wanting to enter the world of politics, they refuse and Rudra's uncle advices them to take refuge from Lallan's gang in jail. In a later incident Rudra's uncle is killed by the poppy field owner with help of Lallan Singh.\n\nIn jail, Raja and Rudra meet Shirivastav ji - a political advisor having knowledge of everything happening in UP politics. He arranges for Raja and Rudra to leave jail and avenge the death of Rudra's uncle by killing Lallan. Their success creates news in political circles and Shirivastav advises them to join hands with Ram Babu Shukla in order to take revenge against the poppy field owner.\n\nThey start working for Ram Babu Shukla (Raj Babbar), a politician, and in the process kill the poppy fields' owner, gain credibility and support in the political circles which brings them fortune and fame amongst youth. Their friendship and partnership is talk of the town making the otherwise preferred hitman Sumer Yadav rendering useless.\n\nWhile representing Ram Babu Shukla in an important meeting Raja and Rudra are insulted by Bajaj (Gulshan Grover). In order to teach him a lesson Raja and Rudra kidnap Bajaj while he is in process of pretend interviewing a girl named Mitali (Sonakshi Sinha) for the role of actress. They extort money from Bajaj and in process Raja started to develop feelings for Mitali. On advice of Shukla, Raja, Rudra and Mitali go to Mumbai until matters settle and avoid any attacked from Bajaj. Raja proposes to Mitali and Rudra approves of their relationship. Later they return to UP and while Raja is getting his sister's engagement done, Bajaj arrives at their house with a shooter Sumer Yadav (Ravi Kishan) and kills Rudra.\n\nRaja takes his revenge by killing Bajaj which turns all political and business fraternity against him. They all want him dead in order to gain Bajaj's money which is needed to fund their election campaigns but is being held by Shirivastav. They plot to kill him by appointing a police officer from Chambal, Arun Singh Munna (Vidyut Jamwal). Raja meanwhile moves to Kolkata with Mitali where their romance furthers. Upon returning from Kolkata, Raja finds Sumer and kills him in front of Arun and in the following fight spares Arun's life. A mole in Raja's gang (Gaurav Dixit), ordered by Shukla, plots to kill Raja. According to the plan, Arun will kill Raja, but then the mole will kill Arun to appease the youth that support Raja. Raja finds out about the plan and reveals it to Arun. Together, they kill the mole and fake Raja's death. In the end, it shows Raja leaving with Mitali for a new life and Arun is also shown to be leaving with them.",
  "synopsis": null
}