{
  "imdb_id": "tt2544182",
  "tmdb_id": "231038",
  "douban_id": null,
  "title": "The Enemy Within (2013)",
  "genres": [
    "Crime",
    "Drama"
  ],
  "country": "Greece",
  "version": [
    {
      "runtime": "107 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.7,
  "director": [
    {
      "id": "nm0874905",
      "name": "Yorgos Tsemberopoulos"
    }
  ],
  "writer": [
    {
      "id": "nm2888074",
      "name": "Giannis Tsiros",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0561422",
      "name": "Manolis Mavromatakis",
      "character": "Kostas Stasinos /              Father"
    },
    {
      "id": "nm1143170",
      "name": "Maria Zorba",
      "character": "Rania Stasinou /              Mother"
    },
    {
      "id": "nm2075913",
      "name": "Yiorgos Gallos",
      "character": "Sotiris Logaras /              Neighbor"
    },
    {
      "id": "nm1464162",
      "name": "Antonis Karistinos",
      "character": "Achilleas /              friend"
    },
    {
      "id": "nm0660363",
      "name": "Thanasis Papageorgiou",
      "character": "Father in Law"
    },
    {
      "id": "nm5393827",
      "name": "Ariadni Kavalierou",
      "character": "Louiza Stasinou /              Daughter"
    },
    {
      "id": "nm5393598",
      "name": "Ilias Moulas",
      "character": "Andreas Stasinos /              Son"
    },
    {
      "id": "nm1268982",
      "name": "Vesela Kazakova",
      "character": "Romanian Woman"
    },
    {
      "id": "nm0158147",
      "name": "Tudor Chirila",
      "character": "Romanian Man"
    },
    {
      "id": "nm2013638",
      "name": "Kostas Antalopoulos",
      "character": "Police Officer"
    },
    {
      "id": "nm0198045",
      "name": "Nikos Dallas",
      "character": "Police Interrogator       (as Nikos Dalas)"
    },
    {
      "id": "nm0334558",
      "name": "Thanos Grammenos",
      "character": "Uncle-Village"
    },
    {
      "id": "nm2801340",
      "name": "Anna Kalaitzidou",
      "character": "Doctor"
    },
    {
      "id": "nm5957135",
      "name": "Frixos Manasakis",
      "character": "Gang member"
    },
    {
      "id": "nm4751176",
      "name": "Konstantinos Moraitis",
      "character": "Rapist       (as Konstadinos Moraitis)"
    },
    {
      "id": "nm1742306",
      "name": "Yiannis Niarros",
      "character": "Aris /              Friend       (as Giannis Niaros)"
    },
    {
      "id": "nm2441202",
      "name": "Kostis Savvidakis",
      "character": "Neighbour"
    }
  ],
  "overview": "Revenge is a recurrent theme in thrillers, usually dispensed by action heroes with a well-stocked arsenal. But in Yorgos Tsemberopoulos’s nuanced moral maze the protagonist is the bookish Kostas (Manolis Mavromatakis), a suburban florist well versed in social and political theory, which he discusses at length with a local publican. But when his home is invaded by masked hoodlums, who bind his family and rape his teenage daughter, our everyman hero finds his intellectual stance untenable. Encouraged by his paranoid, militarist neighbour, Kostas decides to take the law into his own hands, and in doing so begins to understand – for the first time – the world he has been living in. The vigilante movie is a well-explored genre too, but Tsemberopoulos gives it a whole new urgency, subverting the cliched right-wing fantasy structure and seeing it through the eyes of a man who comes to find his real self while trying to live up to the (imagined) expectations of others. (Source: LFF programme)",
  "storyline": "In Athens today, Kostas, a progressive ideologist, lives a regular life with his wife and their teenage daughter and son, until his home is ransacked by a hooded gang. The experience of extreme violence shatters the family's peace, bringing his father's hunting rifle violently into their lives. The story of a morally demolished man who used to be the pillar of his family and of his struggle to get life back to normal.",
  "plot": "Setting\n\nThe game's campaign begins in the spring of 2015, as a global alien invasion begins. Prior to the start of the game, a group of countries called the Council of Nations has banded together to create XCOM (short for Extraterrestrial Combat Unit), the most elite military and scientific organization in human history, tasked with defending them from the alien attack. The player assumes the role of the commander of XCOM, and proceeds to engage in a war against an extraterrestrial enemy with overwhelming technological superiority.\nStory\n\nAfter success with shooting down alien scout ships and securing the crash sites from surviving alien crews, as well as interdicting alien attempts to abduct human civilians for unknown purposes, XCOM manages to also obtain the corpses of various different alien troops. Autopsies reveal that all these types have been genetically and/or cybernetically altered, which seems to indicate they are merely foot-soldiers for unseen leaders. XCOM's head of research, Dr. Vahlen, requests that a live alien be captured for interrogation. This also involves developing a specialized weapon capable of capturing a live alien, and constructing a facility in XCOM's subterranean base capable of safely holding a live alien prisoner.\n\nCapturing one of the alien troops and conducting the interrogation reveals vague information about another type of alien called the Outsiders, artificially-created crystalline beings encountered aboard UFOs, that appear to serve as pilots and navigators. Dr. Vahlen then requests that XCOM capture an Outsider for study. Upon capturing one of these, the examination reveals that the Outsiders' exotic crystalline structures behave in a manner similar to antennas, receiving a signal broadcast from a location buried underground on Earth. XCOM dispatches a team to investigate the signal; it is found to be coming from a base that the aliens have secretly established on Earth, where experiments are performed on abducted humans.\n\nXCOM develops a method for gaining entry to the alien base and assaults it. During the mission, the alien serving as the base commander is discovered to have psychic abilities, but is nevertheless defeated by the soldiers. The commander's psychic communication device is recovered and reverse engineered. Tapping into the aliens' communications reveals a previously hidden, stealth \"Overseer\" UFO making rounds across the Earth. When the UFO is shot down, it is found to hold an alien species that had not been previously encountered, as well as a strange psionic artifact. The newly discovered species, called Ethereals, possess powerful psionic abilities.\n\nOnce the Overseer ship is shot down and the psionic artifact recovered, the massive enemy \"Temple Ship\" reveals itself in low Earth orbit and attacks the Earth, causing earthquakes even as far away as XCOM HQ. The reverse-engineering efforts enable XCOM to unlock and develop latent psionic powers that are present in certain human beings, thus enhancing their human soldiers. Out of these psychic human soldiers, the most powerful becomes the Volunteer, using the psionic artifact recovered from the Overseer UFO to tap into the aliens' psychic communication \"hive\", an experience that also increases his or her psionic strength. This allows them to attack and board the Temple Ship to seek out the Uber Ethereal, the leader of the alien invasion.\n\nDuring the final battle aboard the ship, the Uber Ethereal reveals that, because of their own failure to improve their own race further, they have been testing and experimenting on other species throughout the universe in an attempt to identify a race worthy of being \"Uplifted\", searching for a race that is strong in both mind and body; the various species of alien troops that the player has encountered have all been failures in the Ethereals' experiments. By allowing humans to obtain their technology a few steps at a time, the Ethereals allowed humans to evolve to a fuller potential, and believe that humanity may be the culmination of their search, to find the perfect species to move on and prepare for \"what lies ahead\", a vaguely worded destiny that they do not describe further.\n\nAfter slaying the Uber Ethereal, the Temple Ship begins to collapse into a black hole, which would destroy the Earth due to its close proximity. While the psionically gifted Volunteer urges the other XCOM soldiers to rush back to their transport and escape the doomed ship, the Volunteer stays behind, using the psychic gift to take control of the ship and fly it further away from the planet, finally causing it to self-destruct and save Earth, though at cost of [what was thought to be] the Volunteer's own life. In 2014, Jake Solomon, lead designer of XCOM, revealed that the Volunteer in fact did not die, and instead disappeared before the temple ship explodes.",
  "synopsis": null
}