{
  "imdb_id": "tt2580150",
  "tmdb_id": "349025",
  "douban_id": null,
  "title": "Hawa Bodol (2013)",
  "genres": [
    "Comedy"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "136 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm1913625",
      "name": "Parambrata Chatterjee"
    }
  ],
  "writer": [
    {
      "id": "nm4984906",
      "name": "Anindya Bose",
      "description": null
    },
    {
      "id": "nm1913625",
      "name": "Parambrata Chatterjee",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2754475",
      "name": "Rudranil Ghosh",
      "character": "Rajarshi aka Raaj"
    },
    {
      "id": "nm1913625",
      "name": "Parambrata Chattopadhyay",
      "character": "Satrajit aka Jeet       (as Parambrata Chatterjee)"
    },
    {
      "id": "nm1907554",
      "name": "Kaushik Ganguly",
      "character": "(as Koushik Ganguly)"
    },
    {
      "id": "nm0784025",
      "name": "Raima Sen",
      "character": "Tanuka aka Tanu"
    },
    {
      "id": "nm5376718",
      "name": "Neha Panda",
      "character": "Inca"
    },
    {
      "id": "nm3437506",
      "name": "Dwijen Banerjee",
      "character": ""
    },
    {
      "id": "nm5815448",
      "name": "Dwijendranath Banerjee",
      "character": ""
    },
    {
      "id": "nm5815449",
      "name": "Angana Basu",
      "character": ""
    },
    {
      "id": "nm5815461",
      "name": "Sayan Adhikari",
      "character": ""
    },
    {
      "id": "nm5815453",
      "name": "Anushila Banerjee",
      "character": ""
    },
    {
      "id": "nm3358260",
      "name": "Kamalika Banerjee",
      "character": ""
    },
    {
      "id": "nm3517585",
      "name": "Saibal Banerjee",
      "character": ""
    },
    {
      "id": "nm5815464",
      "name": "Soma Banerjee",
      "character": ""
    },
    {
      "id": "nm3374648",
      "name": "Sudipa Basu",
      "character": "(as Sudipa Bose)"
    },
    {
      "id": "nm5815450",
      "name": "Sophie Berry",
      "character": ""
    },
    {
      "id": "nm5815462",
      "name": "Abhirup Bhattacharya",
      "character": ""
    },
    {
      "id": "nm5815455",
      "name": "Udayan Bhattacharya",
      "character": ""
    },
    {
      "id": "nm5815460",
      "name": "Amlan Chakraborty",
      "character": ""
    },
    {
      "id": "nm1393288",
      "name": "Pradeep Chakraborty",
      "character": "(as Pradip Chakraborty)"
    },
    {
      "id": "nm5815452",
      "name": "Saikat Das",
      "character": ""
    },
    {
      "id": "nm5815451",
      "name": "Sanat Das",
      "character": ""
    },
    {
      "id": "nm4855453",
      "name": "Abhijit Dutta",
      "character": ""
    },
    {
      "id": "nm5010576",
      "name": "Rai Sengupta Ganguly",
      "character": "(as Rai Sengupta)"
    },
    {
      "id": "nm5815459",
      "name": "Akash Ghosh",
      "character": ""
    },
    {
      "id": "nm4828324",
      "name": "Chanchal Ghosh",
      "character": ""
    },
    {
      "id": "nm4855731",
      "name": "Koushik Ghosh",
      "character": ""
    },
    {
      "id": "nm5815458",
      "name": "Arnab Mallick",
      "character": ""
    },
    {
      "id": "nm5815457",
      "name": "Pradip Mitra",
      "character": ""
    },
    {
      "id": "nm5815454",
      "name": "Kaberi Mukherjee",
      "character": ""
    },
    {
      "id": "nm5815456",
      "name": "Sridip Mukherjee",
      "character": ""
    },
    {
      "id": "nm5815463",
      "name": "Supratim Roy",
      "character": ""
    },
    {
      "id": "nm4856024",
      "name": "Triparna Sen",
      "character": ""
    }
  ],
  "overview": "The film moves around two old school friends,Jeet and Raj who coincidentally came across each after a quite a while. While Jeet, a associate in a big designer company, which he got from his dead father-in-law; Raj is a having difficulties musician in a group. Jeet and Raj was welcomed to a celebration of a non-Bengali business customer of Jeet, where Raj flirted with the businessman's daughter Inka.",
  "storyline": "The film moves around two old school friends, Jeet (Parambrata Chattopadhyay) and Raj (Rudranil Ghosh) who coincidentally came across each after a quite a while. While Jeet, a associate in a big designer company, which he got from his dead father-in-law; Raj is a having difficulties musician in a group. Jeet and Raj was welcomed to a celebration of a non-Bengali business customer of Jeet, where Raj flirted with the businessman's daughter Inka (Neha Panda). After celebration, both the buddies purchased beverages from shut stores and consumed in the start. Both of them desired they had each other lifestyle. After getting up from rest, both of them discovered that their spirit has interchanged. Both of the buddies were amazed to find themselves in that scenario. While both of them tried to be faithful, but discovered it challenging to reside in each other people's lifestyle. In the meantime, Raj (in Jeet's body) frequented Chandannagar, his area to fulfill his mother and dad, which he ...",
  "plot": "The movie revolves around two old school friends, Jeet (Parambrata Chattopadhyay) and Raj (Rudranil Ghosh) who coincidentally came across each after a long time. While Jeet, a partner in a big architect firm, which he inherited from his deceased father-in-law; Raj is a struggling singer in a band. Jeet and Raj were invited to a party of a non-Bengali business client of Jeet, where Raj flirted with the businessman's daughter Inka (Neha Panda). After party, both the friends bought drinks from closed shops and drank in the open. Both of them wished they had each other life. After getting up from sleep, both of them found that their soul has interchanged. Both of the friends were surprised to find themselves in that situation. While both of them tried to be loyal, but found it difficult to live in each other's life. In the meanwhile Raj (in Jeet's body) visited Chandannagar, his home town to meet his parents, which he left years ago to make a career in singing. Even, Jeet (in Raj's body) came to visit his house to see his child. Inka came to stay with Raj (actually Jeet's soul) after she had a fight with her parents. Both the friends tried to manage each other's work. While, Raj gave an interesting solution of using terracotta in bathroom instead of gold plates to the Indonesian clients. Jeet, on the other hand introduced Inka as a lead singer in their band, whose performance was well appreciated. The two friends, decided to get back to each other's life, they repeated the same acts they did on the day they interchanged and were successful in getting back their souls in their own body. The movie ended with Raj going for a trip to Chandannagar to visit his parents.",
  "synopsis": null
}