{
  "imdb_id": "tt2558550",
  "tmdb_id": "159009",
  "douban_id": null,
  "title": "Life According to Sam (2013)",
  "genres": [
    "Documentary",
    "Biography",
    "Drama",
    "News"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.1,
  "director": [
    {
      "id": "nm0277658",
      "name": "Sean Fine"
    },
    {
      "id": "nm2107225",
      "name": "Andrea Nix"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm6212745",
      "name": "Sam Berns",
      "character": "Himself"
    },
    {
      "id": "nm3707605",
      "name": "Leslie Gordon",
      "character": "Herself"
    },
    {
      "id": "nm5386648",
      "name": "Scott Berns",
      "character": "Himself"
    },
    {
      "id": "nm2732099",
      "name": "Francis Collins",
      "character": "Himself       (archive footage)"
    },
    {
      "id": "nm9409500",
      "name": "Audrey Gordon",
      "character": "Herself"
    },
    {
      "id": "nm9409504",
      "name": "Sumaria",
      "character": "Herself"
    },
    {
      "id": "nm9409505",
      "name": "Priya",
      "character": "Herself"
    },
    {
      "id": "nm9409506",
      "name": "Niccolo",
      "character": "Himself"
    },
    {
      "id": "nm9409507",
      "name": "Sammy",
      "character": "Himself"
    },
    {
      "id": "nm9409508",
      "name": "Megan",
      "character": "Herself"
    },
    {
      "id": "nm9409509",
      "name": "Devin",
      "character": "Himself"
    },
    {
      "id": "nm9409517",
      "name": "Zoe",
      "character": "Herself"
    },
    {
      "id": "nm0559986",
      "name": "Dave Matthews",
      "character": "Himself"
    }
  ],
  "overview": "Progeria is an extremely rare and fatal disease, exemplified by accelerated aging in the children who are afflicted by it. There is no treatment. There is no cure. Enter Doctors Leslie Gordon and Scott Berns. When their son, Sam, was diagnosed with progeria at age two, the prognosis was grim—the couple were simply told to enjoy the few years they had left with their only son—but they weren’t willing to give up that easily. They spearheaded a campaign to save Sam and the other children in the world who share this devastating illness. In a little more than a decade, their extraordinary advances have led not only to identifying the gene that causes progeria and testing the first experimental drug to treat it but also to the amazing discovery that it is linked to the aging process in all of us.",
  "storyline": "'Life According to Sam' is about one family's courageous fight to save their only son from a rare and fatal disease, progeria. The average age of death from progeria is 13, there is no treatment, and no cure. Dr. Leslie Gordon and Dr. Scott Berns are set on changing this. When their son Sam, now 16 years old, was diagnosed with progeria at age two, doctors told Leslie and Scott to enjoy Sam while they could. They refused to believe this was the answer. In less than a decade, their advances have led to identifying the gene at fault, creating the first drug trials for treatment, and revealing the amazing discovery that progeria is linked to the aging process in all of us.",
  "plot": null,
  "synopsis": null
}