{
  "imdb_id": "tt2517044",
  "tmdb_id": "271164",
  "douban_id": null,
  "title": "The Song (2014)",
  "genres": [
    "Drama",
    "Music",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "116 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm4870080",
      "name": "Richard Ramsey"
    }
  ],
  "writer": [
    {
      "id": "nm4870080",
      "name": "Richard Ramsey",
      "description": "writer"
    },
    {
      "id": "nm4870080",
      "name": "Richard Ramsey",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3466196",
      "name": "Alan Powell",
      "character": "Jed King"
    },
    {
      "id": "nm3137126",
      "name": "Ali Faulkner",
      "character": "Rose Jordan King"
    },
    {
      "id": "nm5178482",
      "name": "Caitlin Nicol-Thomas",
      "character": "Shelby Bale"
    },
    {
      "id": "nm0899087",
      "name": "Danny Vinson",
      "character": "Shep Jordan"
    },
    {
      "id": "nm2485463",
      "name": "Aaron Benward",
      "character": "David King"
    },
    {
      "id": "nm1349770",
      "name": "Kenda Benward",
      "character": "Bethany King"
    },
    {
      "id": "nm4870336",
      "name": "Jude Ramsey",
      "character": "Ray King"
    },
    {
      "id": "nm5393986",
      "name": "Gary Jenkins",
      "character": "Stan"
    },
    {
      "id": "nm4708227",
      "name": "Landon Marshall",
      "character": "Eddie"
    },
    {
      "id": "nm5529019",
      "name": "Rachel T. Mitchell",
      "character": "Kristen"
    },
    {
      "id": "nm5475663",
      "name": "Baxter Clement",
      "character": "Bill"
    },
    {
      "id": "nm4424244",
      "name": "Jason Bynum",
      "character": "Steel player"
    },
    {
      "id": "nm6141444",
      "name": "Ryan Thomas",
      "character": "Electric Guitar Player - Jed's Band"
    },
    {
      "id": "nm5475970",
      "name": "Mayrk Mcneely",
      "character": "Bass Player - Jed's Band"
    },
    {
      "id": "nm5475637",
      "name": "Verity Vice Jones",
      "character": "Bass Player - Shelby's Band"
    },
    {
      "id": "nm5475975",
      "name": "Jeremy King",
      "character": "Acoustic Guitar Player - Shelby's Band"
    },
    {
      "id": "nm5475703",
      "name": "David Graham",
      "character": "Electric Guitar Player - Shelby's Band"
    },
    {
      "id": "nm5475818",
      "name": "Tyler Boydstun",
      "character": "Drummer - Shelby's Band"
    },
    {
      "id": "nm6152554",
      "name": "Kristen Adair",
      "character": "Angry fan"
    },
    {
      "id": "nm6457189",
      "name": "Ana Aguilar",
      "character": "Concert Fan       (as Ana Quintana)"
    },
    {
      "id": "nm3671362",
      "name": "Sue-Lynn Ansari",
      "character": "Musician"
    },
    {
      "id": "nm5689702",
      "name": "Kathlene Ashcraft",
      "character": "Pop Star Groupie"
    },
    {
      "id": "nm7747197",
      "name": "David Ayres",
      "character": "Festival Patron"
    },
    {
      "id": "nm5981723",
      "name": "Kelly Burdsal",
      "character": "Angry Concert Fan"
    },
    {
      "id": "nm3009275",
      "name": "Sonny Burnette",
      "character": "Booth Operator"
    },
    {
      "id": "nm5958962",
      "name": "Brennan James Callan",
      "character": "Concert Attendee /              Festival Attendee /              Wedding Ceremony Guest /              Funeral Mourner       (as Brennan Callan)"
    },
    {
      "id": "nm5125403",
      "name": "Brendan Cipriano",
      "character": "Festival Attendee"
    },
    {
      "id": "nm5015852",
      "name": "Joey Cipriano",
      "character": "Festival Attendee       (as Joe Cipriano)"
    },
    {
      "id": "nm6325712",
      "name": "Sonya Delormier",
      "character": "Hotel Room Groupie"
    },
    {
      "id": "nm9678945",
      "name": "Kyle B. Dietz",
      "character": "Security guard"
    },
    {
      "id": "nm5891755",
      "name": "Carolyn Dodd",
      "character": "Funeral Girl"
    },
    {
      "id": "nm6340936",
      "name": "Nichole Doimer",
      "character": "Festival Patron"
    },
    {
      "id": "nm6314558",
      "name": "Bowman Elijah",
      "character": "Drummer for Jeds band"
    },
    {
      "id": "nm5541627",
      "name": "Elizabeth Gammons",
      "character": "Extra       (as Liz Gammons)"
    },
    {
      "id": "nm6402005",
      "name": "Allyson Nicole Jones",
      "character": "Festival Attendee /              Concert Attendee"
    },
    {
      "id": "nm7995352",
      "name": "Meghan Ketz",
      "character": "Festival Attendee"
    },
    {
      "id": "nm6397791",
      "name": "Emmett King",
      "character": "Boy at Funeral"
    },
    {
      "id": "nm0500894",
      "name": "Brad Leland",
      "character": "Mr. Harrison"
    },
    {
      "id": "nm4488076",
      "name": "Michael Loos",
      "character": "Paramedic Kimbler"
    },
    {
      "id": "nm6314577",
      "name": "Savannah Lyle",
      "character": "Extra"
    },
    {
      "id": "nm6818373",
      "name": "Veda McClain",
      "character": "Nurse"
    },
    {
      "id": "nm3624799",
      "name": "Lindsey Melton",
      "character": "Angry fan"
    },
    {
      "id": "nm7264045",
      "name": "Cheyenne Mize",
      "character": "Herself"
    },
    {
      "id": "nm2095123",
      "name": "Tiffany Montgomery",
      "character": "Laura"
    },
    {
      "id": "nm0606234",
      "name": "Vin Morreale Jr.",
      "character": "Matt"
    },
    {
      "id": "nm9076733",
      "name": "Bridgette Prioletti",
      "character": "Festival attendee"
    },
    {
      "id": "nm1413251",
      "name": "Phil Russell",
      "character": "Philip Jordan"
    },
    {
      "id": "nm9232114",
      "name": "Daniel H. Shoemaker",
      "character": "Bar patron"
    },
    {
      "id": "nm6807228",
      "name": "Evan Swetnam",
      "character": "Teen Jed"
    },
    {
      "id": "nm6236804",
      "name": "Joy Whitten",
      "character": "Band Groupie"
    },
    {
      "id": "nm9228757",
      "name": "Anissa Wood",
      "character": "Festival Attendee /              Concert Attendee"
    },
    {
      "id": "nm3785597",
      "name": "Benjamin Wood",
      "character": "Bouncer /              Doorman"
    }
  ],
  "overview": "The film follows aspiring singer-songwriter Jed King (Alan Powell) as he struggles to catch a break and escape the long shadow of his father, a country music legend. After reluctantly accepting a gig at a local vineyard harvest festival, Jed is love-struck by the vineyard owner’s daughter, Rose (Ali Faulkner), and a romance quickly blooms. Soon after their wedding, Jed writes Rose “The Song,” which becomes a breakout hit. Thrust into a life of stardom and a world of temptation in the form of fellow performer Shelby Bale (Caitlin Nicol-Thomas), Jed’s life and marriage begin to fall apart.",
  "storyline": "Aspiring singer-songwriter Jed King is struggling to catch a break and escape the long shadow of his famous father when he reluctantly agrees to a gig at a local vineyard harvest festival. Jed meets the vineyard owner's daughter, Rose, and a romance quickly blooms. Soon after their wedding, Jed writes Rose \"The Song,\" which becomes a breakout hit. Suddenly thrust into a life of stardom and a world of temptation, his life and marriage begin to fall apart.",
  "plot": "Conor, a lighthouse keeper, lives on an island with son Ben, his pregnant wife Bronagh, and sheepdog Cú. Bronagh disappears late one night, presumably dying after childbirth, leaving behind daughter Saoirse.\n\nSix years later, Conor is broken, Saoirse is mute, and Ben is antagonistic towards Saoirse, blaming her for Bronagh's disappearance. On her birthday, she is visited by Granny, the grandmother. That night, Ben scares Saoirse with a story of Mac Lir and his mother Macha, the Owl Witch, who stole his feelings and turned him to stone. Later, Saoirse plays a seashell horn given to Ben by their mother, leading her to a white sealskin coat in Conor's closet. She wears the coat and walks to a group of seals in the sea, revealing her as a selkie. After swimming, she is found by Granny, who insists upon taking the children to the city. Conor reluctantly agrees despite Ben's protests, and locks the coat in a chest, throwing it into the sea.\n\nOn Halloween, Saoirse plays the shell, alerting Færie to her. Ben and her attempt to go home, but encounter the Færie, hopeful that Saoirse will allow them to go to Tír na nÓg. However, they are attacked by Macha's owls, turning the Færie to stone. They take a country bus, where they run into Cú, who had followed them. However, Saoirse is growing ill. They come across a sacred well that Saoirse falls into. Ben follows and meets the Great Seanachaí: They learn that she was kidnapped by Macha, and that she is mute because she needs the coat otherwise she will die. He gives Ben one of his hairs that will lead him to Macha, showing that Bronagh - a selkie herself - returned to the ocean, remorsefully watching.\n\nBen then meets Macha, who claims that when Mac Lir suffered from a broken heart, she turned him into an island near their home. Ben manages to rescue Saoirse, giving Macha her feelings, recognizing that taking away feelings doesn't help. She helps them fly them back home, and Conor attempts to take Saoirse to a hospital; simultaneously, Granny is near the island to find them. Ben dives into the sea in search of Saoirse's coat, and recovers it with the seals and Conor. The group is then washed up on Mac Lir's island, where Saoirse is fully healthy and sings the song of the sea. Færie rise and travel to Mac Lir and he emerges with Macha and his dogs as they head to Tír na nÓg.\n\nBronagh appears preparing to depart with Saoirse, but Ben pleads to let her stay with them. Since she is half-human, the choice rests with Saoirse, who elects to remain behind with her father and brother. Bronagh takes her coat and departs. After a tearful goodbye, the Faeries depart across the sea, and Ben and his family happily return home to their island, where Granny finally arrives, and decides the children can stay with their father. Ben and Saoirse reconcile and become friends.",
  "synopsis": "THE SONG follows the story of Jed King (Alan Powell, Anthem Lights lead singer) an aspiring singer/songwriter who wrestles with the personal and professional struggles of pursuing stardom and a quest for significance. The son of country legend David King, Jed struggles to step out from under the dim shadow cast by his fathers tainted reputation. Bent on making a name for himself he reluctantly accepts a gig at a local vineyard harvest festival. This decision changes everything. Jed meets Rose (Ali Faulkner, TWILIGHT: BREAKING DAWN) the vineyard owners daughter and a sweet yet sometimes heated romance ensues.The morning following their wedding ceremony Jed wakes up early to write Rose \"The Song,\" which soon becomes a breakout hit launching an iconic music career. After a few years touring on the road his rise to fame begins to take its toll on his and Roses marriage. Warm-up artist Shelby Bale (Caitlin Nicol- Thomas, \"Nashville\"), joins Jeds tour and their lives begin to spiral downward and completely out of control. Jed eventually succumbs to the temptations of Shelby and infidelity, alcohol abuse and drugs finally lead to an on-stage meltdown.Jed is faced head-on with the question, what is a man if he gains the whole world but loses his life? A question many wrestle with at some point along their lifes journey. Viewers will walk out of the theatre inspired by THE SONG and encouraged to pursue a life of significance yet challenged with the question, From where does true significance come?The Song is a modern day adaption of Song of Solomon. Executive Producer, Kyle Idleman (author of Not a Fan) does not apologize for the movie being referenced as the sexiest Christian movie released to date. I believe the greatest way to impact culture is for the church to come out from under its hidden covers when it comes to issues like sex, love and marriage. As long as the church community remains silent on these issues popular culture will continue to shape how we think about them.I highly recommend this movie as well as its soundtrack. I plan to see it again with my family and friends this weekend. THE SONG is truly at the top of my list of best romantic movies of the year as well as best faith-based romantic movie released to date. Make plans to be in the theatre opening weekend you wont be disappointed. The Song is a movie worth your dollars and one that will leave you moved and inspired by the power of true love."
}