{
  "imdb_id": "tt2518788",
  "tmdb_id": "217316",
  "douban_id": null,
  "title": "1 (2013)",
  "genres": [
    "Documentary",
    "History",
    "Sport"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "112 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.0,
  "director": [
    {
      "id": "nm0189581",
      "name": "Paul Crowder"
    }
  ],
  "writer": [
    {
      "id": "nm0598531",
      "name": "Mark Monroe",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1055413",
      "name": "Michael Fassbender",
      "character": "Narrator"
    },
    {
      "id": "nm0484399",
      "name": "Niki Lauda",
      "character": "Himself"
    },
    {
      "id": "nm2619894",
      "name": "Lewis Hamilton",
      "character": "Himself"
    },
    {
      "id": "nm1635856",
      "name": "Michael Schumacher",
      "character": "Himself"
    },
    {
      "id": "nm0004707",
      "name": "Mario Andretti",
      "character": "Himself"
    },
    {
      "id": "nm0829455",
      "name": "Jackie Stewart",
      "character": "Himself"
    },
    {
      "id": "nm2697599",
      "name": "Sebastian Vettel",
      "character": "Himself"
    },
    {
      "id": "nm1794748",
      "name": "Jenson Button",
      "character": "Himself"
    },
    {
      "id": "nm1494814",
      "name": "Eddie Jordan",
      "character": "Himself"
    },
    {
      "id": "nm1411416",
      "name": "Damon Hill",
      "character": "Himself"
    },
    {
      "id": "nm1687495",
      "name": "Bernie Ecclestone",
      "character": "Himself"
    },
    {
      "id": "nm4065589",
      "name": "Sid Watkins",
      "character": "Himself"
    },
    {
      "id": "nm1277188",
      "name": "Nina Rindt",
      "character": "Herself       (archive footage)"
    },
    {
      "id": "nm1081197",
      "name": "Emerson Fittipaldi",
      "character": "Himself"
    },
    {
      "id": "nm0543748",
      "name": "Nigel Mansell",
      "character": "Himself"
    },
    {
      "id": "nm0116069",
      "name": "Martin Brundle",
      "character": "Himself"
    },
    {
      "id": "nm0406797",
      "name": "Jacky Ickx",
      "character": "Himself"
    },
    {
      "id": "nm2651927",
      "name": "Robert Kubica",
      "character": "Himself - Polish Formula One Driver"
    },
    {
      "id": "nm0839735",
      "name": "John Surtees",
      "character": "Himself"
    },
    {
      "id": "nm1167481",
      "name": "Jody Scheckter",
      "character": "Himself"
    },
    {
      "id": "nm5511216",
      "name": "Koen Vergeer",
      "character": "Himself"
    },
    {
      "id": "nm1694500",
      "name": "Max Mosley",
      "character": "Himself"
    },
    {
      "id": "nm5510779",
      "name": "Sally Swart",
      "character": "Herself"
    },
    {
      "id": "nm5511377",
      "name": "Jane Birbeck",
      "character": "Herself"
    },
    {
      "id": "nm4398211",
      "name": "Paddy McNally",
      "character": "Himself"
    },
    {
      "id": "nm4300229",
      "name": "Maurice Hamilton",
      "character": "Himself"
    },
    {
      "id": "nm5510995",
      "name": "Roy Topp",
      "character": "Himself"
    },
    {
      "id": "nm2478858",
      "name": "Nigel Roebuck",
      "character": "Himself"
    },
    {
      "id": "nm5511507",
      "name": "John Barnard",
      "character": "Himself"
    },
    {
      "id": "nm7192797",
      "name": "Colin Chapman",
      "character": "Himself       (archive footage)"
    },
    {
      "id": "nm5511304",
      "name": "John Miles",
      "character": "Himself"
    },
    {
      "id": "nm0219444",
      "name": "Eddie Dennis",
      "character": "Himself"
    },
    {
      "id": "nm5511495",
      "name": "John Hogan",
      "character": "Himself"
    },
    {
      "id": "nm3979069",
      "name": "Clive Chapman",
      "character": "Himself"
    },
    {
      "id": "nm5511539",
      "name": "Brigitte Hill",
      "character": "Herself"
    },
    {
      "id": "nm5510785",
      "name": "Brett Lunger",
      "character": "Himself"
    },
    {
      "id": "nm5511330",
      "name": "Lord Hesketh",
      "character": "Himself"
    },
    {
      "id": "nm5510866",
      "name": "Freddie Hunt",
      "character": "Himself"
    },
    {
      "id": "nm4007594",
      "name": "Herbie Blash",
      "character": "Himself"
    },
    {
      "id": "nm3156215",
      "name": "John Watson",
      "character": "Himself"
    },
    {
      "id": "nm4414112",
      "name": "Jo Ramírez",
      "character": "Himself       (as Jo Ramirez)"
    }
  ],
  "overview": "Set in the golden era of Grand Prix Racing '1' tells the story of a generation of charismatic drivers who raced on the edge, risking their lives during Formula 1's deadliest period, and the men who stood up and changed the sport forever.",
  "storyline": "Set in the golden era of Grand Prix Racing '1' tells the story of a generation of charismatic drivers who raced on the edge, risking their lives during Formula 1's deadliest period, and the men who stood up and changed the sport forever.",
  "plot": "In the future, humanity is preparing to launch an attack on the homeworld of an alien race called the Formics who had attacked Earth and killed millions; however, their invasion was stopped by Mazer Rackham, who crashed his F-35 Lightning II into a Formic queen ship, stopping the invasion at the apparent cost of his life. Over the course of fifty years, gifted children are trained by the International Fleet to become commanders of a new fleet for this counter-attack.\n\nCadet Andrew \"Ender\" Wiggin (Asa Butterfield) draws the attention of Colonel Hyrum Graff (Harrison Ford) and Major Gwen Anderson (Viola Davis) by his aptitude in simulated space combat. They order the removal of his monitor, signifying the end of the cadet program. Ender is attacked by Stilson, a student he defeated in the combat sim, but Ender fights back and severely injures him. Ender confesses his grief to his older sister Valentine, but is harassed further by their older brother Peter. Graff arrives to reveal he was being tested and is still part of the program. Graff brings Ender to Battle School, placing Ender with other cadets his age, but treats him as extraordinary, ostracizing him from the others.\n\nAmong other studies, the cadets are placed in squads and perform training games in a zero gravity \"Battle Room\". Ender quickly adapts to the games, devising new strategies older students have not yet seen. Graff reassigns Ender to Salamander Army, led by Commander Bonzo Madrid. Bonzo, believing that Ender is inept due to his size, prevents him from training with the rest of the squad. Another cadet, Petra Arkanian, takes Ender and trains him privately. While Bonzo is aware of this, he does not take any action against Petra. In one match, Bonzo orders Ender to stay behind while the rest of the Salamander Army fights another team; however, seeing Petra in trouble, Ender comes to her aid and helps the Salamander Army win. After the match, Bonzo is humiliated by the other students and threatens Ender if he embarrasses him again.\n\nMeanwhile, Ender plays a computerized \"mind game\" set in a fantasy world aimed to present difficult choices to the player. In one situation, Ender creates an outside the box solution to overcome a seemingly unsolvable problem. Later, he encounters a Formic in the game, and then a simulated image of Valentine entering the ruins of a castle. Inside, he finds another image of Valentine but as he nears, it turns into an image of Peter before the game ends.\n\nGraff promotes Ender to his own squad, made from other students that have gained Ender's trust. They are put in increasingly difficult battles. In one match against two other teams including Bonzo's squad, Ender devises a novel strategy of sacrificing part of his team to achieve a goal, impressing Graff. Bonzo accosts Ender in the bathroom after the match, but Ender fights back and Bonzo falls during the struggle, seriously injured. Distraught over this, Ender prepares to quit Battle School, but Graff has Valentine speak to him and convince him to continue.\n\nGraff takes Ender to humanity's forward base on a former Formic planet near their homeworld. There, Ender meets Mazer Rackham, who explains how he spotted the shared-mind nature of the Formics to stop the attack fifty years prior. Ender finds that his former squad members are also here to help him train in computerized simulations of large fleet combat; Rackham puts special emphasis on the fleet's Molecular Detachment (MD) Device that is capable of disintegrating matter.[note 1] Ender's training is rigorous and Anderson expresses concern they are pushing Ender too fast, but Graff notes they have run out of time to replace Ender.\n\nEnder's final test is monitored by several of the fleet commanders. As the simulation starts, Ender finds his fleet over the Formic homeworld and vastly outnumbered. He orders most of his fleet to sacrifice themselves to protect the MD long enough to fire on the homeworld. The simulation ends, and Ender believes the test is over, but the commanders restart the video screens, showing that the destruction of the Formic homeworld was real and Ender had been controlling the real fleet this time. Despite Graff's assurance he will be known as a hero, Ender is furious as he feels responsible for the annihilation and everyone will remember him as a killer.\n\nAs Ender struggles with his emotions, he recognizes one of the Formic structures nearby similar to the ruined castle from the game, and believing they were trying to communicate with him, races out towards it. He follows the path set by the game, and encounters a dying Formic queen. The Queen acknowledges Ender's role in the genocide of their race, but that he simply wanted peace in the long term and forgives him. The Queen later gives Ender a queen egg that it had been protecting.\n\nAfter the war, Ender is promoted to Admiral, given a small ship, and left to his own devices. In a letter to Valentine, he tells her that he is going into deep space, determined to form a new Formic colony with the queen egg.",
  "synopsis": null
}