{
  "imdb_id": "tt2557276",
  "tmdb_id": "302828",
  "douban_id": null,
  "title": "Against the Sun (2014)",
  "genres": [
    "Adventure",
    "Biography",
    "Drama",
    "War"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "100 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm1803137",
      "name": "Brian Falk"
    }
  ],
  "writer": [
    {
      "id": "nm1803137",
      "name": "Brian Falk",
      "description": "written by"
    },
    {
      "id": "nm5405965",
      "name": "Mark David Keegan",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0226813",
      "name": "Garret Dillahunt",
      "character": "Harold Dixon"
    },
    {
      "id": "nm0271657",
      "name": "Tom Felton",
      "character": "Tony Pastula"
    },
    {
      "id": "nm1831976",
      "name": "Jake Abel",
      "character": "Gene Aldrich"
    },
    {
      "id": "nm5684969",
      "name": "Nadia Parra",
      "character": "Frances Pastula"
    },
    {
      "id": "nm0283594",
      "name": "Quinton Flynn",
      "character": "Newsreel Narrator"
    }
  ],
  "overview": "A WWII pilot, bombardier, and radioman find themselves adrift on a lifeboat without food or water after being forced to ditch their plane during a scouting mission.",
  "storyline": "In one of the most harrowing true stories of World War II, three US Navy airmen crash land their torpedo bomber in the South Pacific and find themselves on a tiny life raft, surrounded by open ocean. No food. No water. No hope of rescue. Against incredible odds, these three virtual strangers must survive storms, sharks, starvation - and each other - as they try to sail more than a thousand miles to safety.",
  "plot": "Based on a true story, three US Navy airmen are forced to ditch their torpedo bomber in the South Pacific during World War II. They then find themselves on a tiny life raft, surrounded by open ocean. With no food, water and little hope of rescue they drift across the ocean. Against incredible odds, these three virtual strangers survive storms, sharks, starvation and each other as they try to sail more than a thousand miles to safety.",
  "synopsis": null
}