{
  "imdb_id": "tt2527560",
  "tmdb_id": "308762",
  "douban_id": null,
  "title": "Quito 2023 (2013)",
  "genres": [
    "Sci-Fi",
    "Thriller"
  ],
  "country": "Ecuador",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.1,
  "director": [
    {
      "id": "nm4980762",
      "name": "César Izurieta"
    },
    {
      "id": "nm5381728",
      "name": "Juan Fernando Moscoso"
    }
  ],
  "writer": [
    {
      "id": "nm5370130",
      "name": "Lorena Caicedo",
      "description": "original idea"
    },
    {
      "id": "nm4980762",
      "name": "César Izurieta",
      "description": "story"
    },
    {
      "id": "nm5381728",
      "name": "Juan Fernando Moscoso",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm5411135",
      "name": "Silvio Villagómez",
      "character": "Santiago"
    },
    {
      "id": "nm5411098",
      "name": "Jose Luís Vergara",
      "character": "Marcos"
    },
    {
      "id": "nm5409142",
      "name": "Enrique Carvajal",
      "character": "General Ponce"
    },
    {
      "id": "nm5408257",
      "name": "Elvira Durango",
      "character": "Lorena"
    },
    {
      "id": "nm4501710",
      "name": "Jorge Ulloa",
      "character": "Francisco"
    },
    {
      "id": "nm3621147",
      "name": "Orlando Herrera",
      "character": "Traitor"
    }
  ],
  "overview": "Is the year 2023. Quito has been walled by Leonardo Ponce, a military dictator that took control of the city in the early 2010's. A group of revolutionaries led by Marcos and Santiago are on the verge of giving a coup d'état. Just hours before the strike, Santiago steps forward and starts asking tough questions that led everybody to rethink why are they really doing this. Meanwhile at Ponce's palace, he is trying to decipher what is going on at the city wall. There's unusual movement and one of the revolutionaries is captured. Ponce tries to get as much information as he can from him. Confined to just 2 locations, Quito 2023 shows the human side of the revolution, the internal conflicts of their leaders and the hopelessness of a region that cannot be governed.",
  "storyline": "Quito 2023 is a thriller/Sci-Fi feature film that focuses on the Ecuadorian capital, some years from now. After several internal political problems, a coup has left the country under military control. Quito is the last frontier, the city has been completely fenced, enclosed and sheltered. The film starts from this point and focuses on two locations only. One, the palace where the General Ponce, a cynical and cunning man who runs the party, and is in charge of the city. The second, the headquarters of a group of young revolutionaries led by Marcos and Santiago, two guys with completely different visions. Marcosis hungry for power and strength. The other, his buddy Santiago, a man that has lost all hope for a better tomorrow. The film, without any political agenda, focuses on the hours before the revolutionaries make their last attack with the goal of overthrowing the tyranny that surrounds the city. These two places and characters are woven together to tell a story that is directly ...",
  "plot": null,
  "synopsis": null
}