{
  "imdb_id": "tt2520808",
  "tmdb_id": "143295",
  "douban_id": null,
  "title": "What About Dick? (Video 2012)",
  "genres": [
    "Comedy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "81 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm0001385",
      "name": "Eric Idle"
    },
    {
      "id": "nm0694023",
      "name": "Aubrey Powell"
    }
  ],
  "writer": [
    {
      "id": "nm0001385",
      "name": "Eric Idle",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1258970",
      "name": "Russell Brand",
      "character": "Dick"
    },
    {
      "id": "nm0175262",
      "name": "Billy Connolly",
      "character": "Inspector McGuffin"
    },
    {
      "id": "nm0000347",
      "name": "Tim Curry",
      "character": "Reverend Whoopsie"
    },
    {
      "id": "nm0001385",
      "name": "Eric Idle",
      "character": "Piano"
    },
    {
      "id": "nm0412850",
      "name": "Eddie Izzard",
      "character": "Deepak Obi Ben Kingsley"
    },
    {
      "id": "nm0682063",
      "name": "Jim Piddock",
      "character": "Sergeant Ken Russell"
    },
    {
      "id": "nm0001808",
      "name": "Tracey Ullman",
      "character": "Aunt Maggie"
    },
    {
      "id": "nm0005137",
      "name": "Jane Leeves",
      "character": "Emma Schlegel"
    },
    {
      "id": "nm1258830",
      "name": "Sophie Winkleman",
      "character": "Helena"
    }
  ],
  "overview": "What About Dick? begins with the birth of a sex toy invented in Shagistan in 1898 by Deepak Rushdie Obi Ben Kingsley (Eddie Izzard), and tells the story of the subsequent decline of the British Empire as seen through the eyes of a Piano. The Piano (Eric Idle) narrates the tale of Dick (Russell Brand); his two cousins: Emma, (Jane Leeves) an emotionally retarded English girl; her kleptomaniac sister Helena (Sophie Winkleman) and their dipsomaniac Aunt Maggie (Tracey Ullman) who all live together in a large, rambling, Edwardian novel.  When the Reverend Whoopsie (Tim Curry) discovers a piano on a beach, a plot is set afoot that can be solved only by a private Dick, the incomprehensible Scottish sleuth Inspector McGuffin (Billy Connolly) who with the aid of Sergeant Ken Russell (Jim Piddock) finally reveals the identity of the Houndsditch Mutilator.",
  "storyline": "What About Dick? begins with the birth of a sex toy invented in Shagistan in 1898 by Deepak Rushdie Obi Ben Kingsley, and tells the story of the subsequent decline of the British Empire as seen through the eyes of a Piano. The Piano narrates the tale of Dick; his two cousins: Emma, an emotionally retarded English girl; her kleptomaniac sister Helena and their dipsomaniac Aunt Maggie who all live together in a large, rambling, Edwardian novel. When the Reverend Whoopsie discovers a piano on a beach, a plot is set afoot that can be solved only by a private Dick, the incomprehensible Scottish sleuth Inspector McGuffin who with the aid of Sergeant Ken Russell finally reveals the identity of the Houndsditch Mutilator.",
  "plot": "At the end of the 21st century, Earth is devastated by chemical warfare. What little habitable land remains is divided into two territories, the United Federation of Britain (UFB, located on the British Isles and western mainland Europe) and the Colony (Australia). Many residents of the Colony travel to the UFB to work in factories via “The Fall,” a gravity elevator running through the Earth’s core. A Resistance operating in the UFB, which the UFB views as a terrorist movement, seeks to improve life in the Colony.\n\nColony citizen Douglas Quaid has been having dreams of being a secret agent, aided by an unknown woman. Tired of his factory job building police robots with friend Harry, he visits Rekall, a virtual entertainment company that implants artificial memories. Among the choices Rekall salesman Bob McClane offers Quaid are the memories of a secret agent. An emblem of Rekall is stamped onto his arm. Just as Quaid is starting to be implanted, McClane discovers that he already has real memories of being a covert operative. As McClane starts to question Quaid about the memories, UFB police officers burst in, killing the Rekall crew and attempting to arrest Quaid. Quaid instinctively reacts and kills the officers before escaping. Upon returning home his wife Lori attempts to kill him, revealing that she is an undercover UFB agent who has been monitoring him only for the past six weeks, and that she doesn’t know who or what he was. After Quaid escapes, Charles Hammond, a “friend” Quaid does not recognize, contacts him and directs him to a safe-deposit box numbered 10549 at First Bank. Quaid finds a recorded message from his former self with the address of a UFB apartment.\n\nWhile being pursued by Lori and other human and robot police, Quaid meets Melina, the woman from his dreams. At the apartment Quaid finds another recording, revealing that his name is actually Carl Hauser, an agent working for UFB Chancellor Vilos Cohaagen. After defecting to the Resistance, Hauser was captured by the UFB and implanted with false memories. The recording reveals that Cohaagen will use robots to invade the Colony so the UFB will have more living space. Hauser, however, has seen a “kill code” that would disable the robots. The code can be recovered from his memory by Resistance leader Matthias. Melina reveals that she was Hauser’s lover before Hauser was captured; she proves that they knew each other by showing that they have matching scars from a time they were both shot while holding hands. The police surround the apartment building and Harry appears. He tries to convince Quaid that he is still in a Rekall-induced dream and that killing Melina is the only way out. Quaid is conflicted, but notices a tear on Melina’s cheek and shoots Harry instead. Lori pursues the pair inside the building's elevators, but fails to capture them.\n\nQuaid and Melina meet with Matthias. While Matthias searches Quaid’s memories, Lori and Cohaagen storm the Resistance base. Cohaagen reveals that Hauser was in fact working for him without Quaid even knowing it due to the memory alteration, using the kill code as a trap. Cohaagen kills Matthias and arranges to restore Hauser’s memory before leaving with Melina as a prisoner. As the officers are about to inject Quaid, Hammond (revealed to be one of the police officers involved in the raid) sacrifices himself to help Quaid escape. Cohaagen begins his invasion of the Colony, loading The Fall with his army of robots. Quaid sneaks onboard, setting timed explosives throughout the ship while searching for Melina. After freeing her, they climb atop The Fall as it arrives at the Colony. As they fight the soldiers and Cohaagen, Quaid's explosives detonate. Quaid and Melina jump off before the ship plummets back into the tunnel and explodes underground, killing Cohaagen and destroying his army and The Fall itself. Waking up in an ambulance, Quaid is greeted by Melina. When he notices that she is missing her scar, he realizes that she is Lori using a holographic disguise; they fight and Lori is killed. Quaid finds the real Melina outside the ambulance and they embrace. As news channels declare the independence of The Colony, Quaid looks up to find an advertisement of Rekall on an electronic billboard and sees that the stamp given by the Rekall crew on his arm is missing.",
  "synopsis": null
}