{
  "imdb_id": "tt2525596",
  "tmdb_id": "168026",
  "douban_id": null,
  "title": "Ah Boys to Men (2012)",
  "genres": [
    "Comedy"
  ],
  "country": "Singapore",
  "version": [
    {
      "runtime": "110 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm0626090",
      "name": "Jack Neo"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm6277301",
      "name": "Tosh Zhang",
      "character": "Sergeant Alex Ong"
    },
    {
      "id": "nm6277302",
      "name": "Weiliang Wang",
      "character": "Recruit Lobang"
    },
    {
      "id": "nm7099852",
      "name": "Noah Yap",
      "character": "Recruit IP Man"
    },
    {
      "id": "nm5462623",
      "name": "Charlie Goh",
      "character": "Recruit Tan Wei Ming"
    },
    {
      "id": "nm8251648",
      "name": "Daniel Ang",
      "character": "Chng Kia Ann"
    },
    {
      "id": "nm5115682",
      "name": "Vivek Arora",
      "character": "Extra"
    },
    {
      "id": "nm2370920",
      "name": "Fish Chaar",
      "character": "Cpt Tham SL"
    },
    {
      "id": "nm4873806",
      "name": "Elena Choo",
      "character": "Nurse"
    },
    {
      "id": "nm5104893",
      "name": "Luke Lee",
      "character": "Sergeant Jed Heng"
    },
    {
      "id": "nm8247617",
      "name": "Wang Lei",
      "character": "Ken's uncle"
    },
    {
      "id": "nm8251647",
      "name": "Janson Lim",
      "character": "Sam Too"
    },
    {
      "id": "nm4434951",
      "name": "Maxi Lim",
      "character": "Wayang King"
    },
    {
      "id": "nm5379286",
      "name": "Maxi Lin",
      "character": ""
    },
    {
      "id": "nm8251646",
      "name": "Hanrey Low",
      "character": "Liao Kong Chai"
    },
    {
      "id": "nm7215054",
      "name": "Justin Dominic Mission",
      "character": "70s platoon sergeant"
    },
    {
      "id": "nm8251645",
      "name": "Feng Wen Na",
      "character": "Sun Li Liang"
    },
    {
      "id": "nm5707415",
      "name": "Aizuddiin Nasser",
      "character": "Recruit Muthu Shanmugam"
    },
    {
      "id": "nm3841025",
      "name": "Wilson Ng",
      "character": "Sergeant Major"
    },
    {
      "id": "nm6107693",
      "name": "Alvin Richard",
      "character": "Kenneth Pang, sergeant"
    },
    {
      "id": "nm2371420",
      "name": "Joshua Wei-En Tan",
      "character": "(as Joshua Tan)"
    },
    {
      "id": "nm1106725",
      "name": "Ah Min Yoo",
      "character": "Ken's grandmother"
    }
  ],
  "overview": "Ah Boys to Men (新兵正传) is a 2012–2013 Singaporean two-part comedy film produced and directed by Jack Neo, written by Neo and Link Sng and starring Wang Wei Liang, Noah Yap, Joshua Tan and Maxi Lim. It revolves around a group of army recruits in National Service in Singapore.",
  "storyline": "The film opens with the Republic of Singapore apparently being under an immense invasion from a fictional army, with iconic Singaporean landmarks (such as the Merlion and the Esplanade) coming under fire and many civilians killed brutally. It is later revealed that the war was fictitious setting of a war-based role-playing game played by Ken Chow (Joshua Tan), a rich and spoiled child reluctant to enlist into National Service. Ken plans to study abroad with his girlfriend Amy (Bong Qiu Ting), but his plans are derailed by NS. After being chided by Amy for his childishness, Ken takes it out on a nearby rubbish bin, to be apprehended by two policemen in the vicinity. A disappointed and embarrassed Amy looked very sad and angry.Back home, after being driven back by his father (Richard Low), Ken confides to his parents about his fears of National Service. His overprotective mother (Irene Ang) decides to help him think of ways to defer, but to no avail. Eventually, they are all forced to ...",
  "plot": "Ken is quick to adopt a change in personality by becoming an \"on-the-ball\" recruit, even more so than \"Wayang King\" Aloysius. Differing viewpoints sour the friendship between Ken and Lobang. Meanwhile, Ken's father has become partially paralyzed because of his stroke but is determined to make a recovery. After booking out, Aloysius seeks advice from his parents as he feels excluded from the group; his father (Chen Tianwen) tells him the best solution is not to do anything. Back at Tekong, Recruit IP Man learns about \"Real Bullet\" Zhen Zi Dan (Benjamin Mok), an \"Ah Beng\" who stole his girlfriend Mayoki (Sherraine Law). IP Man hits back by criticizing Mayoki for her inferior qualities. \"Real Bullet\" in turn uploads a video of him and Mayoki engaging in an initimate act. Crestfallen, IP Man seeks help from his bunk mates; Lobang plots a scheme to ambush \"Real Bullet\" and Mayoki at a car-park by throwing heaps of human excretion mixed with chilli and wasabi at them while they are in the car. However, a gang soon chases after them after \"Real Bullet\" calls for back-up, but at last the recruits manage to shake the gang off; they celebrate at a restaurant at White Sands later that evening. However, at the restaurant, they are ambushed by more gang members, who have managed to track them down. Ken runs back to save his mates, per the principle \"Leave no man behind\", unlike Aloyisus, who is quick to flee. Because Ken saved his life, Lobang vows to stop smoking in return.\n\nAfter an investigation by the sergeants, Ken and the perpetrators of the earlier scheme carried out that day are punished. Ken's concerned parents speak to CPT Tham after learning of what had happened. His father has shown visible signs of improvement and is starting to be able to talk, thanks the OC for training Ken to become a \"real soldier\", but is against him being punished for fighting. The OC agrees to make an exception and exclude Ken from punishment. Ken, though, after learning that the others still would be punished, is granted permission to continue his punishment. The next day, Lobang attempts to sabotage Aloysius for abandoning the team earlier on by throwing his rifle magazine but after a comical turn of events, it is Lobang who loses his magazine. However, Aloysius quickly gives his magazine to Lobang during an equipment check and takes the blame. While searching for the missing magazine, the relationship between the two grow better.\n\nThe eccentric Lieutenant S.T. Choong (mrbrown) is chased by a large herd of wild boars halfway into an assessment for leadership potential; the soldiers are quick to come to his rescue. Following their passing out parade, the recruits reunite with their kins. Ken's father is present and comes to greet Ken; he is finally able to walk steadily without any aid. As the film ends, various recruits' postings are shown — with Lobang being posted to Officer Cadet School (OCS), and Aloysius being posted to Specialist Cadet School (SCS). Ken also goes to Specialist Cadet School, later to be posted to Officer Cadet School.",
  "synopsis": "The film opens with the Republic of Singapore apparently being under an immense invasion from a fictional army, with iconic Singaporean landmarks (such as the Merlion and the Esplanade) coming under fire and many civilians killed brutally. It is later revealed that the war was fictitious setting of a war-based role-playing game played by Ken Chow (Joshua Tan), a rich and spoiled child reluctant to enlist into National Service. Ken plans to study abroad with his girlfriend Amy (Bong Qiu Ting), but his plans are derailed by NS. After being chided by Amy for his childishness, Ken takes it out on a nearby rubbish bin, to be apprehended by two policemen in the vicinity. A disappointed and embarrassed Amy looked very sad and angry.Back home, after being driven back by his father (Richard Low), Ken confides to his parents about his fears of National Service. His overprotective mother (Irene Ang) decides to help him think of ways to defer, but to no avail. Eventually, they are all forced to face the hard truth - there is no going against the law. The Chow family sadly send off Ken on the day of his enlisting. Thereafter, Ken and a few other recruits are assigned to Ninja Company (Platoon 2, Section 2) and are sent to their bunk and introduced to their Platoon Sergeant (Tosh Zhang), a portrayal of the tough-nails sergeant stereotype. Whilst waiting for the mandatory haircut, Ken gets to know a few people - \"Lobang\" (Wang Wei Liang), Aloysius Jin Sia-lan (Maxi Lim) and \"I.P. Man\" (Noah Yap).After two weeks of training, Ken and the other recruits are allowed to book out. A lavish party is thrown to celebrate Ken's return, but his mood is ruined when he is shown a photo of his girlfriend with another man. Ken angrily confronts her and demands that they meet, which she does not agree to. She later admits that she has fallen for another man and dumps Ken on the highway. Determined to regain her love, Ken devises a plan to escape from Pulau Tekong and send her off, for he feels she is merely just testing him. Ken stops drinking water, in hopes to get a heat injury, for which he would be sent home for ten days; he takes the extra measure of sleeping under a ceiling-fan after dousing himself in cold water. However, he gets into a situation worse than expected and he is quickly sent off to a hospital after collapsing during training. Ken's father is alerted of his son's critical condition while in a company meeting. He quickly drives off to the hospital, but the shock and strain is too much and he suffers a stroke while driving and violently collides with another vehicle.Ken wakes up in the next scene, surrounded by his two sisters, in a hospital. He realised his foolish actions have caused problems for many people and cannot bear to face his father, who has survived the car crash and is recuperating in another ward in the same hospital. Awakened to reality, Ken is finally fit enough to go back to training. The film ends at this junction, and snippets of the next part are shown."
}