{
  "imdb_id": "tt2567712",
  "tmdb_id": "209276",
  "douban_id": "24703986",
  "title": "Starred Up (2013)",
  "genres": [
    "Crime",
    "Drama"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "106 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.4,
  "director": [
    {
      "id": "nm0533284",
      "name": "David Mackenzie"
    }
  ],
  "writer": [
    {
      "id": "nm5414053",
      "name": "Jonathan Asser",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1925239",
      "name": "Jack O'Connell",
      "character": "Eric Love"
    },
    {
      "id": "nm0318353",
      "name": "Gilly Gilchrist",
      "character": "Principal Officer Scott"
    },
    {
      "id": "nm5520750",
      "name": "Frederick Schmidt",
      "character": "Officer Gentry"
    },
    {
      "id": "nm6246250",
      "name": "Edna Caskey",
      "character": "Officer Evans"
    },
    {
      "id": "nm2259536",
      "name": "Darren Hart",
      "character": "MacDonald"
    },
    {
      "id": "nm5596669",
      "name": "Raphael Sowole",
      "character": "Jago"
    },
    {
      "id": "nm3461674",
      "name": "Duncan Airlie James",
      "character": "Officer White"
    },
    {
      "id": "nm3455151",
      "name": "Anthony Welsh",
      "character": "Hassan"
    },
    {
      "id": "nm2916966",
      "name": "David Ajala",
      "character": "Tyrone"
    },
    {
      "id": "nm5098642",
      "name": "Jerome Bailey",
      "character": "Reames"
    },
    {
      "id": "nm6732173",
      "name": "Basil Abdul-Latif",
      "character": "Mubarak"
    },
    {
      "id": "nm0578853",
      "name": "Ben Mendelsohn",
      "character": "Neville Love"
    },
    {
      "id": "nm3169992",
      "name": "Matt Faris",
      "character": "Officer Hall"
    },
    {
      "id": "nm3456755",
      "name": "Aisha Bywaters",
      "character": "Nurse Bankford       (as Aisha Walters)"
    },
    {
      "id": "nm0819874",
      "name": "Sam Spruell",
      "character": "Deputy Governor Haynes"
    },
    {
      "id": "nm3479337",
      "name": "David Avery",
      "character": "Ashley"
    },
    {
      "id": "nm4556190",
      "name": "Tommy McDonnell",
      "character": "Officer Self"
    },
    {
      "id": "nm0243696",
      "name": "James Doran",
      "character": "Officer Smith"
    },
    {
      "id": "nm0064155",
      "name": "Ian Beattie",
      "character": "Officer Johnson"
    },
    {
      "id": "nm0806905",
      "name": "C.C. Smiff",
      "character": "Officer Corsair"
    },
    {
      "id": "nm1670029",
      "name": "Rupert Friend",
      "character": "Oliver Baumer"
    },
    {
      "id": "nm4771827",
      "name": "Gershwyn Eustache Jnr",
      "character": "Des"
    },
    {
      "id": "nm0157717",
      "name": "Ashley Chin",
      "character": "Ryan"
    },
    {
      "id": "nm2616270",
      "name": "Sian Breckin",
      "character": "Governor Cardew"
    },
    {
      "id": "nm1676496",
      "name": "Mark Asante",
      "character": "Denton"
    },
    {
      "id": "nm4416700",
      "name": "Paul Lewis Ferguson",
      "character": "Worsley"
    },
    {
      "id": "nm0272252",
      "name": "Peter Ferdinando",
      "character": "Dennis Spencer"
    },
    {
      "id": "nm5414053",
      "name": "Jonathan Asser",
      "character": "Officer Edwards"
    },
    {
      "id": "nm0734304",
      "name": "Paddy Rocks",
      "character": "Officer Henry       (as Patrick Rocks)"
    },
    {
      "id": "nm4416560",
      "name": "Ryan McKenna",
      "character": "O'Sullivan"
    },
    {
      "id": "nm1820953",
      "name": "Anthony Adjekum",
      "character": "Officer Wilson"
    },
    {
      "id": "nm6732174",
      "name": "Amma Boateng",
      "character": "Officer Stokes"
    }
  ],
  "overview": "19-year-old Eric, arrogant and ultra-violent, is prematurely transferred to the same adult prison facility as his estranged father. As his explosive temper quickly finds him enemies in both prison authorities and fellow inmates — and his already volatile relationship with his father is pushed past breaking point — Eric is approached by a volunteer psychotherapist, who runs an anger management group for prisoners. Torn between gang politics, prison corruption, and a glimmer of something better, Eric finds himself in a fight for his own life, unsure if his own father is there to protect him or join in punishing him.",
  "storyline": "Eric Love is a 19 year old teenager who is so violent he has been 'Starred Up' (Moved to Adult prison) where he finds his father Neville who Eric hasn't seen since he was 5 (since he was put into care). Neville tries to get Eric to settle down, so Eric gets a chance to go through therapy with Oliver.",
  "plot": "Melding elements of romantic comedy, James Bond-style action and Pink Panther-like capers, My Lucky Star tells the story of lovelorn Sophie (Zhang), who winds up in the midst of an international diamond heist, while falling in love with a dashing, heroic spy named David (Wang). Stuck in a dull job as a travel agent in Beijing, Sophie whiles away her time daydreaming and drawing cartoons of imaginary adventures starring a handsome hero or hanging out with friends Lily (Yao Chen) and Lucy (Ruby Lin). Her luck suddenly changes when she wins an all-expenses paid trip to a luxurious hotel in Singapore (shot on location at the Marina Bay Sands resort). Ditched by Lily and Lucy at the last minute, Sophie decides to go to Singapore on her own, where she runs into David, the living embodiment of her illustrated dream man. An American secret agent, David is at the hotel to retrieve the stolen Lucky Star diamond. The valuable gem has the potential to fuel a major atomic weapon, capable of destroying the world. David must retrieve the diamond from the evildoers in order to save the world. David intends to thwart a covert sale of the Lucky Star between arms dealer Li Wan (Morris Rong) and Mr. Gao (Jack Kao) at a posh rooftop party. Lovestruck Sophie crashes the party hoping to meet David. Through a series of misunderstandings and a case of mistaken identity, she briefly winds up in possession of the gem herself and is the only one who can unlock its top-secret case. Now with the help of David and his techie sidekick Bo (Ryan Zheng), Sophie is in hot pursuit of the jewel trying to retrieve it from evil mastermind Charlize (Terri Kwan), who plans to bomb Bermuda. Their chase takes them to the fishing villages of coastal Hong Kong and Charlize's secret underworld lair, culminating at the Venetian Hotel &amp; Casino in Macau, where Sophie goes undercover as a gondolier on the resort's famous canal. In addition to the fast-paced, comedic action, which includes several fight scenes and a daring parachute jump off the hotel skyscraper, romantic sparks fly between Sophie and David. The film is also interspersed with dynamic animated sequences (straight from Sophie's doodles) and concludes with the ballad, \"Love a Little (Ai Yidian)\"&lt;爱一点&gt; sung by Wang and Zhang.",
  "synopsis": null
}