{
  "imdb_id": "tt2523692",
  "tmdb_id": "148644",
  "douban_id": null,
  "title": "Decay (2012)",
  "genres": [
    "Horror"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "76 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm5383581",
      "name": "Luke Thompson"
    },
    {
      "id": "nm0563392",
      "name": "Michael Mazur"
    }
  ],
  "writer": [
    {
      "id": "nm5383581",
      "name": "Luke Thompson",
      "description": "writer"
    },
    {
      "id": "nm5383581",
      "name": "Luke Thompson",
      "description": "story and"
    },
    {
      "id": "nm7110934",
      "name": "James Howarth",
      "description": "story"
    },
    {
      "id": "nm0563392",
      "name": "Michael Mazur",
      "description": "additional writer and"
    },
    {
      "id": "nm5390715",
      "name": "Vashti Gwynn",
      "description": "additional writer and"
    },
    {
      "id": "nm7110934",
      "name": "James Howarth",
      "description": "additional writer"
    }
  ],
  "cast": [
    {
      "id": "nm5383288",
      "name": "Zoë Hatherell",
      "character": "Amy"
    },
    {
      "id": "nm5383335",
      "name": "Tom Procter",
      "character": "Connor"
    },
    {
      "id": "nm5383565",
      "name": "Stewart Martin-Haugh",
      "character": "James"
    },
    {
      "id": "nm5383792",
      "name": "William P. Martin",
      "character": "Matt"
    },
    {
      "id": "nm5383078",
      "name": "Sara Mahmoud",
      "character": "Kate"
    },
    {
      "id": "nm5391937",
      "name": "Ed Friesen",
      "character": "Director General"
    },
    {
      "id": "nm5391676",
      "name": "Kurt Rinnert",
      "character": "Dr. Niven"
    },
    {
      "id": "nm5391148",
      "name": "Jenn Strauss",
      "character": "Lisa"
    },
    {
      "id": "nm6108664",
      "name": "David Voong",
      "character": "Biff"
    },
    {
      "id": "nm6108665",
      "name": "Sergey Senkin",
      "character": "First guard"
    },
    {
      "id": "nm2039926",
      "name": "Katie Malone",
      "character": "Swipey"
    },
    {
      "id": "nm6108666",
      "name": "Jake Searcy",
      "character": "Angry"
    },
    {
      "id": "nm6108667",
      "name": "Johannes Ebke",
      "character": "Dopey"
    },
    {
      "id": "nm6108668",
      "name": "Christopher Young",
      "character": "Tardy"
    },
    {
      "id": "nm6108669",
      "name": "Ty Gray",
      "character": "Sneaky"
    },
    {
      "id": "nm0563392",
      "name": "Michael Mazur",
      "character": "Nosey"
    },
    {
      "id": "nm6108670",
      "name": "Martin Read",
      "character": "Not-paying-attention-y"
    },
    {
      "id": "nm6108671",
      "name": "Heikke Laube-Pohto",
      "character": "Creepy"
    },
    {
      "id": "nm6108672",
      "name": "Paulo Gandini",
      "character": "Cagey       (as Paulo Gandin I)"
    },
    {
      "id": "nm6108673",
      "name": "Ailsa Sparks",
      "character": "Hungry"
    },
    {
      "id": "nm5390812",
      "name": "Lee Allison",
      "character": "Speedy"
    },
    {
      "id": "nm6108674",
      "name": "Noémie Chappuis",
      "character": "Savvy"
    },
    {
      "id": "nm6108675",
      "name": "Nick Edwards",
      "character": "Focusy"
    },
    {
      "id": "nm6108676",
      "name": "Tim Brooks",
      "character": "Dummy"
    },
    {
      "id": "nm6108677",
      "name": "James Buchanan",
      "character": "Shocky"
    },
    {
      "id": "nm5389848",
      "name": "Clara Nellist",
      "character": "Bitey"
    },
    {
      "id": "nm5391049",
      "name": "Ellie Davies",
      "character": "Grabby"
    },
    {
      "id": "nm4317759",
      "name": "Ryan Reece",
      "character": "Holey"
    }
  ],
  "overview": "Decay follows several students that discover that the maintenance crew of the Large Hadron Collider have been transformed into zombies after the particle accelerator malfunctions. The students must try to evade the zombies while running through CERN's maintenance tunnels.",
  "storyline": "A group of PhD students who work at the Large Hadron Collider (LHC) at CERN find themselves in an emergency situation as a result of a problem with the accelerator. The maintenance crew have been transformed into zombies after the particle accelerator malfunctions. The students must try to evade the zombies while running through CERN's maintenance tunnels.",
  "plot": "A security guard is walking along the maintenance tunnel of the Large Hadron Collider (LHC) at CERN when he turns around, meets a man (face is not shown) whom he recognizes, and informs him that he is not supposed to be down there. The man proceeds to shoot the guard dead.\n\nConnor and James are roommates and were at a party the previous night. Amy is James's sister; she and Matt come over to Connor's and James's apartment to pick them up for work. All four of them are physicists at CERN working on the Large Hadron Collider. James works with the LHC, while the others analyze the data generated by it. They are on their way to attend an emergency meeting at CERN. They have no idea why the meeting was called, but Amy believes it can't be very important. At CERN, they overhear Dr. Niven and the Director General arguing over safety. Dr. Niven wants the LHC to be stopped till he can assess the safety, but the Director General overrides his concerns and informs him that, once the problem is fixed, the LHC would work normally and finding the Higgs boson is of utmost importance. The Director General realizes that Connor, James and Amy are listening to them and he asks the security guard to shut the door.\n\nAt the conference room they meet Lisa, who was supposed to be in Barcelona for a conference but missed her flight due to the party. The Director General addresses the attendees and informs them that the previous night there was a beam dump in LHC. The beam dump occurred because the beam sensors had detected that the monopole magnet at LHC segment 11G had quenched due to an unknown event, which triggered the LHC to shut down. He further warns that, if the event occurs again, there could be a catastrophic accident at CERN. Dr. Niven is selected to take a team of technicians down to the LHC tunnel to investigate the cause of the incident and try to get the LHC running again. The Director General requests four volunteers to be in the control room while Dr. Niven is busy. Connor volunteers for the task and the Director General selects Connor, James, Amy and Lisa. Lisa bails out, informing the Director General that she has to attend a conference in Barcelona, so Matt is selected instead.\n\nAmy is working on a task assigned to her by Dr. Niven, which involves simulating the impact of Higgs boson radiation on human tissues. The simulation fails because of some parameters, Dr. Niven proposes changes and requests Amy to try again. James introduces his girlfriend Kate to Connor, Amy and Matt. Kate works as a trainee nurse and joins them in the control room. Amy's simulation is crashing after the changes proposed by Dr. Niven. Connor proposes running the simulation on the mainframe computer instead of her laptop and grants her access to start the simulation on the mainframe. As Amy runs the simulation on the mainframe, the LHC beam monitor indicates that the LHC is up and running. James checks the system and realizes that the system has turned on by itself and Amy had nothing to do with it.\n\nThe team led by Dr. Niven is still in the maintenance tunnel of the LHC and they are at risk of being exposed to radiation. James and Connor try to shut down the LHC, but they are unsuccessful; the emergency shutdown switch is not working. The radiation alarm goes off and they decide to run away to avoid being exposed to the radiation. The elevator near the control room is not working and there is no mobile signal since they are over hundred meter underground. They decide to go down to the maintenance tunnel and James manually shuts down the LHC. Connor informs the group that the LHC cannot be turned on from the control room and neither do they have access rights to turn on the LHC. Since the LHC is now off, they can use the elevator in the maintenance tunnel to get out; they believe that the team led by Dr. Niven is dead due to radiation.\n\nAs they walk through the maintenance tunnel, they are attacked by the technicians of the team led by Dr. Niven and Kate is captured. Connor, Amy, James and Matt lock themselves up in a room and James uses the coolant to scare away the technicians. Amy and Connor realize that the technicians had radiation burn marks on their skin and cannot comprehend how the technicians are still alive. Connor finds another way out of the room and they head back into the maintenance tunnel, where they find the dead body of the security guard killed at the beginning of the movie. They find the interlock array and see that it has been destroyed, which indicates sabotage. They are again attacked by the technicians, so they decide to find a mainframe to contact somebody for help. On their way, they are attacked again and this time James is bitten.\n\nThey finally find the mainframe server room, James wants to check if Kate is still alive. Amy and Connor work on the mainframe consoles to breach the firewall to ask for help, but are unsuccessful. Finally, the results of Amy's simulations come up; they indicate that the boson radiation has the capability to destroy human brain. This makes them realize that the technicians are all dead and have become zombie like. Amy and James head back into the maintenance tunnel, where they find the Director General's security guard is dead. James recovers a gun from the guard. Finally, they find Kate's dead body, which the zombies have mutilated. Meanwhile, Connor is studying the simulation data when somebody triggers a deletion of the results. Amy and James return to the mainframe server room, where Connor informs them that only the Director General has the rights to delete the data.\n\nJames and Connor manage to unlock all the doors using the mainframe console. Finally, James succumbs to his injury and turns into a zombie, attacking the others. Matt bolts, leaving Connor and Amy to defend themselves. Connor shoots James. Amy and Connor go back to the maintenance tunnel and are attacked by the zombies. Connor is bitten and Amy shoots him when he turns. Zombies escape the maintenance tunnel through the unlocked doors and attack people outside. Amy is chased by zombies, but she manages to elude them. Matt is attacked and eaten alive by the zombies.\n\nAmy manages to reach the surface and is chased by the zombies. She goes to Dr. Niven's office to collect data about his simulation to collect evidence against the Director General. She calls up Lisa on her mobile to inform her that the Director General is responsible for the deaths at CERN, but she is redirected to her voice mail. The Director General enters Dr. Niven's office, picks up the gun left behind by Amy and points it at her. Amy manages to get a confession out of the Director General; as he is about to pull the trigger it is shown that Amy had not disconnected the call and that the confession has gone to Lisa's voice mail. The screen goes black and the sound of a gunshot is heard.",
  "synopsis": null
}