{
  "imdb_id": "tt2543508",
  "tmdb_id": "309018",
  "douban_id": null,
  "title": "Life Inside Out (2013)",
  "genres": [
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "102 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm0194866",
      "name": "Jill D'Agnenica"
    }
  ],
  "writer": [
    {
      "id": "nm0047896",
      "name": "Maggie Baird",
      "description": null
    },
    {
      "id": "nm0621994",
      "name": "Lori Nasso",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0047896",
      "name": "Maggie Baird",
      "character": "Laura"
    },
    {
      "id": "nm3906552",
      "name": "Finneas O'Connell",
      "character": "Shane"
    },
    {
      "id": "nm0621994",
      "name": "Lori Nasso",
      "character": "Lydia"
    },
    {
      "id": "nm0184748",
      "name": "David Cowgill",
      "character": "Mike"
    },
    {
      "id": "nm0402669",
      "name": "William Dennis Hunt",
      "character": "Bill"
    },
    {
      "id": "nm4643422",
      "name": "Roscoe Brandon",
      "character": "Eli"
    },
    {
      "id": "nm1978534",
      "name": "Orson Ossman",
      "character": "Devin"
    },
    {
      "id": "nm0640148",
      "name": "Patrick O'Connell",
      "character": "Skip"
    },
    {
      "id": "nm0366356",
      "name": "Joe Hart",
      "character": "Wayne"
    },
    {
      "id": "nm2686432",
      "name": "Goh Nakamura",
      "character": "Sam"
    },
    {
      "id": "nm0068187",
      "name": "Emma Bell",
      "character": "Keira"
    },
    {
      "id": "nm0519534",
      "name": "Yogi Lonich",
      "character": "Yogi"
    },
    {
      "id": "nm4828067",
      "name": "Xenia",
      "character": "Xenia"
    },
    {
      "id": "nm0932971",
      "name": "Alexandra Wilson",
      "character": "Vicky"
    },
    {
      "id": "nm1790431",
      "name": "Emily Jordan",
      "character": "Lucy"
    },
    {
      "id": "nm3093522",
      "name": "Kalilah Harris",
      "character": "Chloe"
    },
    {
      "id": "nm2133328",
      "name": "John Bain",
      "character": "Phillip"
    },
    {
      "id": "nm1687620",
      "name": "Frank Gangarossa",
      "character": "Barton Wheyfield"
    },
    {
      "id": "nm1736667",
      "name": "Julia Garcia Combs",
      "character": "Drunk Julia"
    },
    {
      "id": "nm3818442",
      "name": "Michael Child",
      "character": "Poet"
    },
    {
      "id": "nm3784510",
      "name": "Cindy Shapiro",
      "character": "Cherelle"
    },
    {
      "id": "nm5599697",
      "name": "Victoria Pollack",
      "character": "Waitress #1"
    },
    {
      "id": "nm5413067",
      "name": "Jodie Jimenez",
      "character": "Shelly"
    },
    {
      "id": "nm5415622",
      "name": "Charles La Font",
      "character": "Peter"
    },
    {
      "id": "nm4883052",
      "name": "Christopher Kozina",
      "character": "Alex"
    },
    {
      "id": "nm5599817",
      "name": "Cassandra Jensen",
      "character": "Waitress #2"
    },
    {
      "id": "nm5599588",
      "name": "Terrie Ann McCartney",
      "character": "Kazoo Ballerina"
    },
    {
      "id": "nm6438723",
      "name": "Steve McMorran",
      "character": "Jackson"
    },
    {
      "id": "nm5413871",
      "name": "Larry Treadwell",
      "character": "Burned out Guitarist"
    },
    {
      "id": "nm1965631",
      "name": "Jen Fitch",
      "character": "Pam"
    },
    {
      "id": "nm0305060",
      "name": "Angela Garcia Combs",
      "character": "Angela"
    },
    {
      "id": "nm5599148",
      "name": "Richard Mendez",
      "character": "Tattoo Artist"
    },
    {
      "id": "nm3311223",
      "name": "Ashley James",
      "character": "Barton's Date"
    },
    {
      "id": "nm5599384",
      "name": "Mickianne Bradshaw",
      "character": "Allison"
    },
    {
      "id": "nm2481051",
      "name": "Darius Campo",
      "character": "Violinist"
    },
    {
      "id": "nm5599778",
      "name": "Tori Ann Carranza",
      "character": "Tattoo Shop Assistant"
    },
    {
      "id": "nm5599590",
      "name": "Kristy Beauvais",
      "character": "Heather"
    },
    {
      "id": "nm0508923",
      "name": "Stacie Rasmussen",
      "character": "Stacie"
    },
    {
      "id": "nm5599487",
      "name": "Samantha Rubin",
      "character": "Emma"
    },
    {
      "id": "nm5599737",
      "name": "George Tavera",
      "character": "Tattoo Shop Owner"
    },
    {
      "id": "nm5599482",
      "name": "Brian Wilett",
      "character": "Keyboard Player"
    },
    {
      "id": "nm5599415",
      "name": "Kate Pitner",
      "character": "Kate"
    },
    {
      "id": "nm3626097",
      "name": "Peter Stoia",
      "character": "Bartender"
    }
  ],
  "overview": "When a mother returns to her musical roots, she rediscovers the passion of her youth, and finds a way to connect with her troubled youngest son.",
  "storyline": "\"Life Inside Out\" tells the parallel stories of Laura, a devoted mother of three teenage sons, and her struggling son Shane, the family misfit and a mystery to his Dad and brothers. When Laura stumbles upon her long forgotten guitar, she rediscovers her passion for music and songwriting. In an impulsive move to avoid attending another of her sister Lydia's scrapbook parties, Laura goes to her first open mic night, taking Shane (anxious to escape his own unpleasant fate on a father-son fishing trip) along for the ride. Despite her rocky entry into a new world of clubs and unusual characters, this first step into expressing herself proves to be the catalyst for changing not only her life, but Shane's, in complex and unpredictable ways.",
  "plot": "Riley Andersen is born in Minnesota and within her mind, five personifications of her basic emotions—Joy, Sadness, Fear, Disgust, and Anger—gradually come to life and influence her actions via a console in her mind's Headquarters. As she grows up, her experiences become memories, stored in colored orbs, which are sent into long-term memory each night. Her five most important \"core memories\" (all of which are happy ones) are housed in a hub that each power an aspect of her personality which take the form of floating islands. In Headquarters, Joy acts as a de facto leader to maintain Riley's cheerful childhood, but since she and the other emotions do not understand Sadness' purpose, she frequently tries to keep Sadness away from the console.\n\nAt the age of eleven, Riley and her parents move to San Francisco for her father's new business. Riley has poor first experiences: the new house is cramped and old, the moving van with all their belongings was misdirected, her father is under stress from his business, and a poor encounter at a pizza restaurant leaves her disheartened. When Sadness begins touching Riley's happy memories, turning them sad, Joy tries to guard them by isolating her. On Riley's first day at her new school, Sadness accidentally causes Riley to cry in front of her class, creating a sad core memory. Joy, panicking, tries to dispose of it, but accidentally knocks the other core memories loose during a struggle with Sadness, deactivating the personality islands. Joy, Sadness, and the core memories are sucked out of Headquarters, and taken to the maze-like storage area of long-term memory.\n\nThe other emotions try to maintain Riley's happiness in Joy's absence with disastrous results, distancing her from her parents, friends and hobbies. As a result, her personality islands gradually begin to crumble and fall, one by one, into the \"Memory Dump\", an abyss where memories are forgotten. In desperation, Anger inserts an idea into the console prompting Riley to run away, believing that her return to Minnesota will enable her to make new happy core memories.\n\nJoy and Sadness encounter Bing Bong, Riley's childhood imaginary friend, who suggests riding the train of thought back to Headquarters. The three eventually catch the train, but it is halted when Riley falls asleep. They succeed in manipulating Riley's dreams to wake her and restart the train, but it is derailed when the \"Honesty Island\" collapses (when Riley steals her mother's credit card and begins to run away). In desperation, Joy tries to ride a \"recall tube\" back to Headquarters, but abandons Sadness since close proximity to Sadness will cause the core memories to turn sad, which Joy believes will hurt Riley. But as she takes off, the ground below the tube collapses, breaking the tube and plunging Joy and Bing Bong into the Memory Dump. At the bottom, Joy then begins to lose hope, but discovers a sad memory of a hockey game that became happy when Riley's parents and friends comforted her. Joy realizes that Sadness serves an important purpose: to create empathy in others when Riley is emotionally overwhelmed and needs help.\n\nJoy and Bing Bong try to use Bing Bong's old wagon rocket to escape the Memory Dump, but after several tries, Bing Bong realizes their combined weight is too much and jumps out, sacrificing himself to allow Joy to escape. Joy reunites with a despondent Sadness and manages to get them to Headquarters, only to discover that Anger's idea has disabled the console, rendering Riley apathetic. To the surprise of the others, Joy hands control of the console to Sadness, who is able to successfully extract the idea, reactivating the console and prompting Riley to return home.\n\nAs Sadness reinstalls the core memories, turning them sad, Riley arrives home to her parents and breaks down in tears, confessing that she misses Minnesota. As her parents comfort her, they tell her that they also miss Minnesota and Joy and Sadness work the console together, creating a new core memory that combines their emotions; a new island forms representing Riley's acceptance of her new life in San Francisco. A year later, Riley has adapted to her new home, made new friends, returned to her old hobbies, and adopted a few new ones (fueled by new, more nuanced core memories from combinations of her emotions). Inside Headquarters, her emotions all work together on a new expanded console with room for them all, enabling Riley to lead a more emotionally complex life.",
  "synopsis": "Life Inside Out tells the story of Laura (Maggie Baird), a devoted mother of three teenage boys and her youngest son Shane (Finneas O'Connell), the family misfit and a disappointment to his father. When Laura stumbles upon her long forgotten guitar, the cast off passion of her youth, she is taken under its spell and soon rediscovers her love for songwriting. When, in an impulsive move to avoid another of her sisters scrap booking parties, Laura impulsively flies off to her first open-mic night; she takes Shane, anxious to escape an annual father-son fishing trip, along for the ride. Despite a rocky entry into the late night mélange of musicians and unusual characters that populate the club, Laura starts to blossom and Shane seems oddly at home. Soon, following his mothers lead and with a little help from Youtube, Shane begins to discover musical gifts of his own. Although the family struggles under the burden of financial pressure and the path to creative expression is bumpy, Lauras first brave steps prove to be the catalyst for changing not only her life, but also Shanes in complex and unpredictable ways."
}