{
  "imdb_id": "tt2587198",
  "tmdb_id": "141702",
  "douban_id": null,
  "title": "The Gangster (2012)",
  "genres": [
    "Action",
    "Crime",
    "Drama",
    "History",
    "Thriller"
  ],
  "country": "Thailand",
  "version": [
    {
      "runtime": "114 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm0995978",
      "name": "Kongkiat Khomsiri"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm5434191",
      "name": "Krisada Sukosol Clapp",
      "character": "Jod"
    },
    {
      "id": "nm1001179",
      "name": "Somchai Kemglad",
      "character": "Daeng"
    },
    {
      "id": "nm5434505",
      "name": "Sakarin Suthamsamai",
      "character": ""
    },
    {
      "id": "nm5434876",
      "name": "Krisada Supapprom",
      "character": ""
    },
    {
      "id": "nm5434250",
      "name": "Pakchanok Wo-Onsri",
      "character": ""
    },
    {
      "id": "nm3802763",
      "name": "Wasu Sangsingkaew",
      "character": ""
    },
    {
      "id": "nm1403029",
      "name": "Boonsong Nakphoo",
      "character": ""
    },
    {
      "id": "nm4703191",
      "name": "Nantharat Chaowarat",
      "character": ""
    },
    {
      "id": "nm0108881",
      "name": "Libby Brien",
      "character": "Woman interviewee /              wife       (voice)"
    },
    {
      "id": "nm1042831",
      "name": "Philip Hersh",
      "character": "Jod       (voice)"
    }
  ],
  "overview": "\"Antapal\" is a fact-based tale with documentary segments in which old-timers from the era are interviewed and talk about the young gangsters of 1950s and '60s Thailand, but centres on Dang's friend Jod this time. Jod is a gangster who has been sent to jail as a result of a military coup who brings new order to the streets. In the young gangsters' neighbourhood, it is a uniformed officer named Neung who rules like a dictator and is a frequent thorn in the side of Jod's gang. When he emerges from prison, Jod is a changed man with a determination to set things right. But, knowing no other life, he returns to his old gangster ways with his old crew, which the new kids have joined. Amidst beefing with rival gangs and paranoia over a possible mole within their ranks, Jod's new gang quickly unravels...",
  "storyline": "Bangkok in the 1950s. Jod and his friend Daeng are fearless aspiring gangsters. Their ability in street fight have them hired by a local gang and admired by all. But as years go by, this violent lifestyle is more and more difficult for Jod. He tries to avoid violence when he can but is soon put aside by more violent youngsters. When some of his friends die in internal wars, he decides to take his revenge on the gang.",
  "plot": null,
  "synopsis": "Bangkok in the fifties. Jod and his friend Daeng are fearless aspiring gangsters. Their ability in street fight have them hired by a local gang and admired by all. But as years go by, this violent lifestyle is more and more difficult for Jod. He tries to avoid violence when he can but is soon put aside by more violent youngsters. When some of his friends die in internal wars, he decides to take his revenge on the gang."
}