{
  "imdb_id": "tt2524674",
  "tmdb_id": "208277",
  "douban_id": null,
  "title": "Wetlands (2013)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "109 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm1177494",
      "name": "David Wnendt"
    }
  ],
  "writer": [
    {
      "id": "nm5542022",
      "name": "Claus Falkenberg",
      "description": "screenplay &"
    },
    {
      "id": "nm1177494",
      "name": "David Wnendt",
      "description": "screenplay"
    },
    {
      "id": "nm0687861",
      "name": "Sabine Pochhammer",
      "description": "co-writer"
    },
    {
      "id": "nm0733919",
      "name": "Charlotte Roche",
      "description": "novel"
    }
  ],
  "cast": [
    {
      "id": "nm3231562",
      "name": "Carla Juri",
      "character": "Helen Memel"
    },
    {
      "id": "nm2556155",
      "name": "Christoph Letkowski",
      "character": "Robin"
    },
    {
      "id": "nm4170693",
      "name": "Marlen Kruse",
      "character": "Corinna"
    },
    {
      "id": "nm0000888",
      "name": "Meret Becker",
      "character": "Helens Mutter"
    },
    {
      "id": "nm0586923",
      "name": "Axel Milberg",
      "character": "Helens Vater"
    },
    {
      "id": "nm3973870",
      "name": "Peri Baumeister",
      "character": "Schwester Valerie"
    },
    {
      "id": "nm0783124",
      "name": "Edgar Selge",
      "character": "Dr. Notz"
    },
    {
      "id": "nm6426265",
      "name": "Clara Wunsch",
      "character": "Helen, 8 Jahre"
    },
    {
      "id": "nm5716198",
      "name": "Ludger Bökelmann",
      "character": "Toni"
    },
    {
      "id": "nm5576193",
      "name": "Bernardo Arias Porras",
      "character": "Michael"
    },
    {
      "id": "nm3300509",
      "name": "Selam Tadese",
      "character": "Kanell"
    },
    {
      "id": "nm1717744",
      "name": "Pia Röver",
      "character": "Neue Freundin"
    },
    {
      "id": "nm0006781",
      "name": "Harry Baer",
      "character": "Neuer Freund"
    },
    {
      "id": "nm3612367",
      "name": "Merlin Rose",
      "character": "Pommesbuden Junge"
    },
    {
      "id": "nm5355894",
      "name": "Florian Rummel",
      "character": "Drummer"
    },
    {
      "id": "nm2524138",
      "name": "Anna König",
      "character": "Marleen - rothaarige Prostituierte"
    },
    {
      "id": "nm3073812",
      "name": "Kathrin Wehlisch",
      "character": "Puffmutter"
    },
    {
      "id": "nm0508886",
      "name": "Ramona Kunze-Libnow",
      "character": "Frau im Supermarkt"
    },
    {
      "id": "nm4297753",
      "name": "Christian Natter",
      "character": "Pizzabote"
    },
    {
      "id": "nm5675338",
      "name": "Monika Obmalko",
      "character": "Frederike - Pizza-Mädchen"
    },
    {
      "id": "nm3792110",
      "name": "Amelie Plaas-Link",
      "character": "Cordelia - Pizza-Mädchen"
    },
    {
      "id": "nm0196500",
      "name": "Conny Dachs",
      "character": "Pizzabäcker"
    },
    {
      "id": "nm0281832",
      "name": "Catherine Flemming",
      "character": "Freundin der Eltern"
    },
    {
      "id": "nm6426214",
      "name": "Mike Moses",
      "character": "Pizzabäcker"
    },
    {
      "id": "nm0772805",
      "name": "Andreas Schmidt",
      "character": "Freund der Eltern"
    },
    {
      "id": "nm6426215",
      "name": "Jérôme Schmoll",
      "character": "Pizzabäcker"
    },
    {
      "id": "nm1162240",
      "name": "Michael Zühlke",
      "character": "Pizzabäcker       (as Pornfighter Long John)"
    }
  ],
  "overview": "Helen is a nonconformist teenage girl who maintains a conflictual relationship with her parents. Hanging out most of her time with her friend Corinna, with whom she breaks one social taboo after another, she uses sex as a way to rebel and break the conventional bourgeois ethic. After an intimate shaving accident, Helen ends up in the hospital where it doesn’t take long before she makes waves. But there she finds Robin, a male nurse who will sweep her off her feet...",
  "storyline": "The eccentric 18 year-old Helen narrates the story of her life, including stories about her preferred sexual practices that involve vegetables, her attitude towards hygiene, drugs, her best friend Corinna and her challenging childhood. The frame story takes place in a hospital where she is treated because of an anal fissure. During her stay she plans to reunite her divorced parents and falls in love with the male nurse Robin.",
  "plot": "18-year-old Helen uses vegetables for masturbation and believes that body hygiene is overrated in our society. She provokes others by saying and doing things most people would not even dare to imagine.\n\nHelen's parents are divorced and she desperately wishes that they get back together. But her mother is depressive, hygiene-obsessed and mentally unstable, and her father is insensitive and seems not to take notice of what people around him think. She also has a quiet, younger brother whom she teases by taking his stuffed bear.\n\nHelen feels alone and unloved in the world. Only her best friend Corinna makes her feel comfortable. Together they break many of society's taboos.\n\nBy shaving her anal hair too fast, she cuts herself badly and needs to go to hospital. There she plans to get her parents back together and charms her handsome nurse Robin, who is still suffering from a relationship with another nurse from two years before. That nurse does not get along with Helen and is still infatuated with Robin. She makes Helen's life in the hospital more difficult, but Helen and Robin fall in love during her hospital stay.\n\nHelen's behaviour is revealed to be related to a traumatic experience she had when she was eight years old. At the end of the movie, she reflects on this trauma by saying that she finally talked to her little brother and that this was the hardest talk she ever had: still being a child, she found her mother trying to kill herself and Helen's little brother, using the gas from the oven.",
  "synopsis": "Helen Hemel (Carla Juri) is an 18-year-old girl who uses vegetables for masturbation and believes that body hygiene is overrated in our society. She provokes others by saying and doing things most people would not even dare to imagine. She is sexually adventurous and visits a brothel to experience being with another woman.Helen's parents are divorced and she desperately wishes that they get back together. But her mother (Meret Becker) is depressive, hygiene-obsessed and mentally unstable, and her father (Axel Milburg) is insensitive and seems not to take notice of what people around him think. She also has a quiet, younger brother whom she teases by taking his stuffed bear.Helen feels alone and unloved in the world. Only her best friend Corinna (Marlen Kruse) makes her feel comfortable. Together they break many of society's taboos.By shaving her anal hair too fast, Helen cuts herself badly and needs to go to hospital. There she plans to get her parents back together and charms her handsome male nurse named Robin (Christoph Letkowski), who is still suffering from a relationship with another nurse from two years before. That nurse does not get along with Helen and is still infatuated with Robin. She makes Helen's life in the hospital more difficult, but Helen and Robin fall in love during her hospital stay.Helen's behavior is revealed to be related to a traumatic experience she had when she was eight years old, when she found her mother trying to kill herself and Helen's little brother using the gas from the oven.Helen reflects on that trauma by saying that she finally talked to her little brother about that experience and that it was the hardest talk she ever had. In the end, as she is with Robin in his van leaving the hospital, she sees her parents finally meeting in the parking lot, and she asks Robin to continue driving."
}