{
  "imdb_id": "tt2581244",
  "tmdb_id": "244566",
  "douban_id": null,
  "title": "Life After Beth (2014)",
  "genres": [
    "Comedy",
    "Fantasy",
    "Horror",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "89 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm1337885",
      "name": "Jeff Baena"
    }
  ],
  "writer": [
    {
      "id": "nm1337885",
      "name": "Jeff Baena",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2201555",
      "name": "Aubrey Plaza",
      "character": "Beth Slocum"
    },
    {
      "id": "nm2851530",
      "name": "Dane DeHaan",
      "character": "Zach Orfman"
    },
    {
      "id": "nm0000604",
      "name": "John C. Reilly",
      "character": "Maury Slocum"
    },
    {
      "id": "nm0788340",
      "name": "Molly Shannon",
      "character": "Geenie Slocum"
    },
    {
      "id": "nm0385644",
      "name": "Cheryl Hines",
      "character": "Judy Orfman"
    },
    {
      "id": "nm0001663",
      "name": "Paul Reiser",
      "character": "Noah Orfman"
    },
    {
      "id": "nm1131557",
      "name": "Matthew Gray Gubler",
      "character": "Kyle Orfman"
    },
    {
      "id": "nm0447695",
      "name": "Anna Kendrick",
      "character": "Erica Wexler"
    },
    {
      "id": "nm0245749",
      "name": "Eva La Dare",
      "character": "Pearline"
    },
    {
      "id": "nm2973459",
      "name": "Thomas McDonell",
      "character": "Dan       (scenes deleted)"
    },
    {
      "id": "nm0790057",
      "name": "Alia Shawkat",
      "character": "Roz       (scenes deleted)"
    },
    {
      "id": "nm2005930",
      "name": "Allan McLeod",
      "character": "Supermarket Stocker"
    },
    {
      "id": "nm0919369",
      "name": "Paul Weitz",
      "character": "Mr. Levin"
    },
    {
      "id": "nm0044110",
      "name": "Michelle Azar",
      "character": "Mrs. Levin"
    },
    {
      "id": "nm0641389",
      "name": "Jim O'Heir",
      "character": "Chip the Mailman"
    },
    {
      "id": "nm3008739",
      "name": "Rob Delaney",
      "character": "News Anchor"
    },
    {
      "id": "nm1269723",
      "name": "Adam Pally",
      "character": "Diner Sommelier"
    },
    {
      "id": "nm5823687",
      "name": "Elizabeth Stillwell",
      "character": "Lucy       (as Elizabeth Jayne)"
    },
    {
      "id": "nm5583222",
      "name": "Jenna Nye",
      "character": "Brittany"
    },
    {
      "id": "nm2827438",
      "name": "Keedar Whittle",
      "character": "Male Onlooker"
    },
    {
      "id": "nm0005190",
      "name": "Garry Marshall",
      "character": "Grandpa"
    },
    {
      "id": "nm1128443",
      "name": "Bud Sabatino",
      "character": "Mr. Howard"
    },
    {
      "id": "nm0587323",
      "name": "Peggy Miley",
      "character": "Mrs. Howard"
    },
    {
      "id": "nm2718355",
      "name": "Bechir Sylvain",
      "character": "Haitian Man"
    },
    {
      "id": "nm0123182",
      "name": "Bonnie Burroughs",
      "character": "Woman Zombie"
    },
    {
      "id": "nm0342957",
      "name": "Brian Groh",
      "character": "Homeless Man"
    },
    {
      "id": "nm6258281",
      "name": "Eileen Finizza",
      "character": "Mourner       (as Eileen Finney Finizza)"
    }
  ],
  "overview": "Zach is devastated by the unexpected death of his girlfriend, Beth. When she mysteriously returns, he gets a second chance at love. Soon his whole world turns upside down...",
  "storyline": "A hike alone in the woods ends tragically for Beth Slocum with a fatal snake bite. Her death leaves her parents and boyfriend Zach reeling. After the funeral, Zach tries to make friends with Mr. and Mrs. Slocum, but even they reject him, and he's determined to figure out why. Then he sees Beth. Her parents are trying to keep her resurrection a secret, but zombie Beth provides Zach with the opportunity to do everything with her that he didn't get to do while she was still alive. But with Beth's increasingly erratic behavior and even more strange occurrences around town, life with the undead Beth proves to be particularly complicated for her still-living loved ones.",
  "plot": "After his girlfriend Beth Slocum (Aubrey Plaza) dies, Zach Orfman (Dane DeHaan) is left devastated. He begins to spend time with Beth's parents Maury (John C. Reilly) and Geenie (Molly Shannon) as a source of comfort. Zach confesses to Maury that he and Beth were having problems in their relationship; Maury advises him not to let the end of the relationship define it.\n\nThe Slocums stop contacting Zach. Confused, he goes to their house and sees Beth through a window. Zach yells at the Slocums to let him in but his brother Kyle, a security officer, escorts him off the premises. At home, Zach's manic demeanor and strange comments that Beth is alive causes his parents, Judy and Noah, to worry. That night, Zach breaks in and discovers that Beth's parents have been hiding her. A heated argument ensues before Zach storms off. Later, he goes to Beth's grave and sees a large hole in its place. He confronts Geenie and Maury with this and they explain that, after the funeral, Beth suddenly reappeared, seemingly alive and well. Beth's parents are reluctant to let her leave the house, especially during daytime, and refuse to tell her that she died. When Zach takes Beth on a daytime date in the park, she gets blisters on her face, apparently from the sun. Maury bans Zach from the Slocum house and seeing Beth, but Zach continues to sneak in.\n\nZach starts to notice people around town acting similarly to Beth, who has grown increasingly violent and has mood swings; he also discovers smooth jazz can calm her down. He also notes that Beth and people like her are stronger now than when they were living humans. Zach brings Beth to her grave and informs her of her death and resurrection, then tries to break up with her, only for her to angrily run off with his car. Zach walks home and discovers his family members shocked by the sudden reappearance of his dead grandfather. Maury picks up Zach and tells him that Beth is extremely upset, insisting that Zach tell her that he lied about her death and promise to be with her forever; Zach reluctantly agrees.\n\nZach's attempts to talk to Beth fail. When she eats a bystander, he drives away, with her in the car. Maury catches them, knocks Zach unconscious, and takes Beth. Once he has recovered, Zach heads home, and finds a stranger inside the house and burnt bodies in the backyard. Believing his family dead, Zach packs his bags, and prepares to leave the state. However, he changes his mind and drives back to the Slocum house.\n\nHe finds the house is in disarray, with Geenie and Beth in the kitchen. Tied to a stove, Beth has become a full-fledged, bloodthirsty zombie, having eaten Maury and bitten off Geenie's hand. Zach convinces Geenie to leave, then calms Beth by promising to hike with her like she always asked him to. They run into Kyle, who has gone hunting zombies. He reveals that their parents are still alive, having escaped to a safehouse. Kyle gives Zach his handgun, reminding him that Beth is suffering.\n\nOn their hike, Zach and Beth stop by a cliff. He tearfully apologizes to her for never doing the things she wanted when she was still alive. They say \"I love you\" to each other, and Zach shoots her in the head.\n\nZach is reunited with his family at the safehouse, along with a traumatized Erica (Anna Kendrick), who was forced to kill her own grandmother. The survivors make plans to leave town but, suddenly, the power returns and a TV news story shows things inexplicably going back to normal. Zach visits the graves of Beth and Maury, leaving Beth's scarf on her tombstone, and a knight chess piece on Maury's. Zach's mom picks him up in her car, with Erica in the backseat. Zach invites Erica for dinner and she accepts, smiling as they drive off.",
  "synopsis": "In the opening shot, a woman named Beth Slocum (Aubrey Plaza) is walking through the woods while looking at her phone. She looks back, thinking she heard something, then continues walking.Her boyfriend Zach Orfman (Dane DeHaan) is out at the supermarket looking for black napkins. He has to settle for beige napkins. He goes to Beth's funeral, as she has died from a snake bite. Everyone gives Zach their condolences. Later, he goes to Beth's home to play chess with her parents, Maury and Geenie (John C. Reilly and Molly Shannon). Maury takes out a joint and smokes it with Zach. Zach admits that he and Beth had some problems in their relationship before she died. Maury says that Beth's last words to him was to stop being annoying. He tells Zach that they shouldn't let things like that define the entire relationship they had with someone. Geenie gives Zach one of Beth's scarves as a keepsake.Despite his family's advice to move on, Zach is still a wreck. The Slocums stop contacting Zach and ignore his calls. He goes over to visit them, but they won't let him in. One afternoon, he peeks through the window and sees what he thinks is Beth walking through the halls. Zach freaks out and pounds on the door. His brother Kyle (Matthew Grey Gubler), who is a security officer, comes over and threatens to have Zach arrested. To fuel his suspicions further, he visits Beth's grave and sees a big hole in the ground.Zach finally manages to get into the Slocum house, even as Maury tries to push him away. He sees Geenie trying to push Beth into the closet, forcing them to come clean. Zach is both elated and alarmed to see his girlfriend alive. Beth has no memory of being dead, claiming that she has a test to study for the next day. She also mistakes Zach's questioning as thinking he believes she cheated on him or that he wants to break up. Against her parents' orders, Zach decides to spend time with Beth, swimming with her and going to the park to have sex. He does happen to notice the snake bite in her skin, and she later goes home with a blistering sore on her cheek.One evening, Zach takes Beth to the beach. He begins to serenade her with a song he wrote, but she hates it so much to the point where it pisses her off. She starts breaking off the lifeguard stand, causing it to catch fire. Zach tries to calm her down and takes Beth back to the car. He barely turns around for a second before she breaks the window with her elbow, thinking he was already trying to abandon her.People in town start behaving oddly, exhibiting similar mood swings and spaced-out behavior like Beth. Needing a break from Beth, Zach goes to a diner. There, he sees an old childhood friend, Erica Wexler (Anna Kendrick). She sits with him and she gives her condolences to him over Beth. Zach has a hard time telling her what's going on and that he has now preferred that Beth stay dead. After they finish their meal, Zach accidentally runs Beth over with his car. She is okay, but when people try and help her, she screams at them and scares them off. She even frightens Erica after thinking Zach has replaced her. Zach then takes her to her grave and tells the truth about her death. This makes her angrier and she steals his car.Zach walks home and sees Kyle and their parents panicking, since Zach's dead grandfather is sitting in their living room, now a reanimated corpse. Then enters the previous owners of the house. Kyle tries shooting at them, but they don't go down. In fact, they're not flesh-hungry zombies, just cranky undead people. Maury then comes to get Zach and tell him that it's his fault this is happening since he went and told Beth about her death. He wants Zach to lie to her and tell her he made up the story about her death. They resolve to have Maury call their former housekeeper, Pearline, to see if she may know anything about stopping zombies, purely based on the fact that Pearline is Haitian. They go back to the Slocum house, where Beth breaks through the window and comes back with her face caked in blood. Zach brings her in the car.Zach goes to a motel to find Pearline, only to find her cousin there, who thinks it's offensive that anyone would assume they know about voodoo or zombies because they're Haitian. The cousin says Pearline had nothing to do with what's happening and that she quit working for the Slocums because Maury wanted her to walk around naked. Zach is left without any answers. Maury shows up, knocks Zach out, and takes Beth home.When he returns home, Zach finds someone in his home, who then runs away. Outside in the backyard are burnt corpses, leading Zach to assume his family is dead. He packs his bags and prepares to get out of town, though he has a change of heart and goes back to Beth's home. She has officially turned into a mindless bloodthirsty zombie, having eaten Maury which led to Geenie tying her to the stove. Zach convinces Geenie to let him take Beth with him. He tells her they're going on a hike. Outside, Kyle shows up, shooting any zombies in his path. He tells Zach that their parents are alive and are hiding in a safe house. He gives Zach his gun and tells him he needs to let Beth go.Zach takes Beth on a hike, when they get to a cliff and stop to check out the view. He tearfully apologizes for not doing all the things Beth wanted to do when she was alive. He tells her he loves her, and Beth is able to mutter \"I love you too.\" He shoots Beth in the head, and her body tumbles down the hill with the stove crushing her as it goes down with her.Zach finds the safe house, reuniting with his family, and he sees that Erica has joined them after her own mother turned into a zombie. She was forced to kill her, leaving her traumatized. The news comes on, with a report that although things look messed up, people seem to be going back to normal.Zach's mom takes him and Erica to the graveyard where he visits Beth's and Maury's graves. He leaves Beth's scarf on her grave. They leave, and Zach asks Erica out to dinner. She accepts and smiles as his mom drives them away."
}