{
  "imdb_id": "tt2555958",
  "tmdb_id": "188540",
  "douban_id": null,
  "title": "Arrambam (2013)",
  "genres": [
    "Action",
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "157 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm3315387",
      "name": "Vishnuvardhan"
    }
  ],
  "writer": [
    {
      "id": "nm5394336",
      "name": "A.N. Balakrishnan",
      "description": null
    },
    {
      "id": "nm4338863",
      "name": "D. Suresh",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0015001",
      "name": "Ajith Kumar",
      "character": "Ashok Kumar (AK)"
    },
    {
      "id": "nm1951127",
      "name": "Arya",
      "character": "Arjun       (as Aarya)"
    },
    {
      "id": "nm1521381",
      "name": "Nayanthara",
      "character": "Maya"
    },
    {
      "id": "nm3966456",
      "name": "Taapsee Pannu",
      "character": "Anita"
    },
    {
      "id": "nm2281292",
      "name": "Rana Daggubati",
      "character": "Sanjay"
    },
    {
      "id": "nm0542498",
      "name": "Mahesh Manjrekar",
      "character": "Mahadev Rani"
    },
    {
      "id": "nm0474609",
      "name": "Atul Kulkarni",
      "character": "Milind Virekar"
    },
    {
      "id": "nm3132784",
      "name": "Kishore Kumar G.",
      "character": "Mumbai Inspector Prakash       (as Kishore)"
    },
    {
      "id": "nm0710046",
      "name": "Suman Ranganath",
      "character": "Ramya Radhakrishnan       (as Suman Ranganathan)"
    },
    {
      "id": "nm4362376",
      "name": "Krishna",
      "character": "Mango"
    },
    {
      "id": "nm5566329",
      "name": "Akshara Gowda",
      "character": "Deeksha"
    },
    {
      "id": "nm4861046",
      "name": "Aadukalam Naren",
      "character": "Sriram Raghavan       (as Narein)"
    },
    {
      "id": "nm1302330",
      "name": "Murli Sharma",
      "character": "Durani"
    },
    {
      "id": "nm6058337",
      "name": "Sirish Sharma",
      "character": "Sirish Sharma"
    },
    {
      "id": "nm6058338",
      "name": "T.S. Siddhu",
      "character": ""
    },
    {
      "id": "nm5574971",
      "name": "Suhail Chandhok",
      "character": ""
    },
    {
      "id": "nm6058339",
      "name": "Muthukumar",
      "character": ""
    },
    {
      "id": "nm6058340",
      "name": "Sumesh Krishnan",
      "character": ""
    },
    {
      "id": "nm0924121",
      "name": "Lee Whittaker",
      "character": "Special Appearance"
    },
    {
      "id": "nm6058341",
      "name": "Bhavna",
      "character": ""
    },
    {
      "id": "nm6058342",
      "name": "Rajan",
      "character": ""
    },
    {
      "id": "nm6058343",
      "name": "Jailakshmi",
      "character": ""
    },
    {
      "id": "nm6058344",
      "name": "Kshishti",
      "character": ""
    },
    {
      "id": "nm1094012",
      "name": "Nithiin",
      "character": ""
    },
    {
      "id": "nm4975518",
      "name": "Prashant Nair",
      "character": "Christopher"
    },
    {
      "id": "nm6058357",
      "name": "Satish",
      "character": ""
    },
    {
      "id": "nm6058359",
      "name": "Mona Khakade",
      "character": ""
    },
    {
      "id": "nm6058360",
      "name": "Gita Babu",
      "character": ""
    },
    {
      "id": "nm6058366",
      "name": "Manikandan",
      "character": ""
    },
    {
      "id": "nm6058364",
      "name": "Baby Ayan",
      "character": ""
    },
    {
      "id": "nm6058346",
      "name": "Shoban",
      "character": ""
    },
    {
      "id": "nm6058347",
      "name": "Manish Mishra",
      "character": ""
    },
    {
      "id": "nm6058348",
      "name": "Wacky",
      "character": ""
    },
    {
      "id": "nm6058349",
      "name": "Amit Kashyap",
      "character": ""
    },
    {
      "id": "nm6058350",
      "name": "Libert",
      "character": ""
    },
    {
      "id": "nm6058351",
      "name": "Khaleel",
      "character": ""
    },
    {
      "id": "nm3074168",
      "name": "Bobby Bedii",
      "character": "(as Bobby Bedi)"
    },
    {
      "id": "nm6058353",
      "name": "Vikas",
      "character": ""
    },
    {
      "id": "nm6058354",
      "name": "Hanishka",
      "character": ""
    },
    {
      "id": "nm6058355",
      "name": "Bala",
      "character": ""
    },
    {
      "id": "nm6058356",
      "name": "Bansooth Seenu",
      "character": ""
    },
    {
      "id": "nm5297450",
      "name": "Rajagopalan",
      "character": ""
    },
    {
      "id": "nm6058358",
      "name": "Karthik",
      "character": ""
    },
    {
      "id": "nm6058361",
      "name": "Rodhi",
      "character": ""
    },
    {
      "id": "nm6058362",
      "name": "Kunjan",
      "character": ""
    },
    {
      "id": "nm6058363",
      "name": "Sada Yadav",
      "character": ""
    },
    {
      "id": "nm6058365",
      "name": "Jayant",
      "character": ""
    }
  ],
  "overview": "The film's plot is set in the backdrop of 26/11 serial blasts in Mumbai, and revolves around Ashok Kumar (Ajith), who is on a mission to expose a scam regarding faulty bullet proof jackets that are provided to security forces, which resulted in many bloody deaths including his best friend and colleague, Assistant Commissioner Sanjay (Rana).",
  "storyline": "The story is set in Mumbai. AK alias Ashok (Ajith) a former bomb disposal specialist and a Dirty Harry type who shoots-the-scums of earth is on a revenge romp. Along with his lady love Maya (Nayanthara), he forcibly ropes in a computer hacker Arjun (Arya) and his lover Anita (Taapsee) into his nefarious plans. How they take revenge on the Home Minister (Mahesh Manjrekar) and his acolytes ( Atul Kulkarni) forms the rest of the story.",
  "plot": "The film starts with Ashok Kumar aka AK (Ajith Kumar) setting bombs in three places and informing the police about them. Before the police arrive, the bombs are set off. He along with his lady love Maya (Nayanthara), both threaten her old collegemate hacker Arjun (Arya), who starts hacking one system after the other. AK then threatens Sridhar Raghavan (Aadukalam Naren) by trying to kill his baby so that he can extract the truth about black money. AK murders him in a fit of rage. Arjun, who is particularly irritated by the things happening around him, complains about the misdeeds of AK to Inspector Prakash (Kishore). When AK gets closer to achieving his goals, Arjun gives him away to the police and both are arrested. Arjun is later released after his true identity is revealed.\n\nLater, Maya, who had escaped from the scene, tracks Arjun and Anita and tells them AK's original motive. AK is revealed to be a former member of an Anti-Terrorist Squad, who is on a mission to expose a scam regarding faulty bulletproof jackets, that are provided to security forces, which resulted in many bloody deaths including his best friend and colleague, Assistant Commissioner Sanjay (Rana Daggubati). It turns out that Home Minister Mahadev Rane (Mahesh Manjrekar) and his associates Milind Virekar (Atul Kulkarni) and Ramya Radhakrishnan (Suman Ranganathan) are the people involved in the scam. Ramya kills Sanjay's pregnant wife and her parents by poisoning while Maya, who is also poisoned, and Mango (Five Star Krishna), who was placed on a railway track, survive the attack. Arjun, who hears the flashback, decides to help them.\n\nAK and Arjun arrive at Dubai to meet Deeksha (Akshara Gowda), the daughter of Mahadev Rane. Arjun enters a bank in the guise of a service engineer, opening an account so that AK can transfer all the money of the minister into his account. Maya kills Ramya by pushing her off a building. Deeksha later finds out their plan but later she is threatened at gunpoint by AK. AK, Arjun and Maya later arrive in Mumbai but they come to know that Mahadev has kidnapped Anitha (Taapsee Pannu), who is Arjun's girlfriend. AK tactfully kidnaps Deeksha and Durrani (Murali Sharma) in Kashmir. Mahadev arrives at Kashmir with Anitha. Here, both Durrani and Deeksha get killed in the mayhem while Anitha is saved. AK kidnaps Mahadev and ties him to various bombs and he questions his corrupt activities. Prakash, who arrives there, calls AK to defuse the bombs. AK advises Prakash to think from the point of view of a common man, instead of a policeman, to think whether it is right on his part to save a corrupt person. Prakash later changes his mind and asks the other policemen to leave him. Mahadev is killed in the blast. Arjun and Anitha get married while AK transfers all the illegal money of the minister to Reserve Bank without revealing his appearance.",
  "synopsis": "The Movie opens up with Mumbai Witnessing a series of bomb explosions. Ashok (Ajith) is wanted by the police for three blasts in the hub of Mumbai. Arjun (Arya as a Hacker) gets duped into Ashoks plan of hacking one system after another beginning with the flash network. Hacking into peoples computers at each step, Ashok gets closer to his ultimate goal. But all that comes to a sudden stop when he gets arrested by the police, as a result of Arjuns smart and secretive complaint. In the second half, we get a clear picture about the revenge drama. What is the motivate behind the bomb explosion? Does Ashok have a terrorist connection? Why does he target a media company? What next is a racy climax???"
}