{
  "imdb_id": "tt2507280",
  "tmdb_id": "174678",
  "douban_id": null,
  "title": "Mr. Jones (2013)",
  "genres": [
    "Drama",
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.7,
  "director": [
    {
      "id": "nm2656048",
      "name": "Karl Mueller"
    }
  ],
  "writer": [
    {
      "id": "nm2656048",
      "name": "Karl Mueller",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0287898",
      "name": "Jon Foster",
      "character": "Scott"
    },
    {
      "id": "nm1967673",
      "name": "Sarah Jones",
      "character": "Penny"
    },
    {
      "id": "nm0825209",
      "name": "Mark Steger",
      "character": "Mr. Jones"
    },
    {
      "id": "nm0846687",
      "name": "Faran Tahir",
      "character": "The Anthropologist"
    },
    {
      "id": "nm0379221",
      "name": "Stanley B. Herman",
      "character": "The Old Journalist"
    },
    {
      "id": "nm0768158",
      "name": "Ethan Sawyer",
      "character": "Alleged Scarecrow Recipient"
    },
    {
      "id": "nm0971731",
      "name": "Jordan Byrne",
      "character": "Peter Cavagnaro"
    },
    {
      "id": "nm0166359",
      "name": "David Clennon",
      "character": "The Curator"
    },
    {
      "id": "nm3082982",
      "name": "Jessica Dowdeswell",
      "character": "Hooded Penny"
    },
    {
      "id": "nm1011812",
      "name": "Diane Neal",
      "character": "The Scholar"
    },
    {
      "id": "nm1528245",
      "name": "Rachel O'Meara",
      "character": "The Skeptic"
    }
  ],
  "overview": "Scott (Jon Foster) is a filmmaker in need of inspiration. He and his girlfriend Penny (Sarah Jones) move into a desolate house hoping to make a breakthrough. Then they discover their neighbor, the elusive Mr. Jones. Famous for his haunting sculptures, Mr. Jones has remained a mystery to the world. Scott and Penny, convinced that they have found the perfect film subject, sneak into his workshop and realize that their curiosity may have chilling consequences. Who is Mr. Jones?",
  "storyline": "A young couple moves to the woods and soon finds their nightmares and reality colliding.",
  "plot": "Scott (Jon Foster) and Penny (Sarah Jones) move out to the woods for a year to make a nature documentary. After a few weeks tensions rise as it becomes obvious that the project isn't as well thought out as they had intended. Things begin to look up when Scott's backpack is stolen and they trace the thief to a cabin not far from the one that they are staying in. This new cabin is surrounded by bizarre stick figures and other strange objects.\n\nThey go into the cabin and retrieve his backpack. Scott sees that there is a basement, and a sub-basement, and wants to explore more, but Penny persuades him to leave. They realize that this is the home of the almost legendary and mysterious artist, Mr. Jones (Mark Steger).\n\nScott and Penny decide to make Mr. Jones the subject of their documentary. Scott flies back to New York City where he discovers that Mr. Jones is an elusive artist who has been sending his artwork to random people across the country with no rhyme or reason. He interviews several of them, all of whom seem to indicate that the weird figures have led to disturbing events in their lives. One tells him that he should stop his investigation of Mr. Jones, and if he sees him, he should just run away.\n\nWhile Scott is away, Penny goes out to photograph Mr. Jones' figures. On one occasion, he approaches her silently from behind, carrying a new figure. Penny tries to ask Mr. Jones for an interview but he does not respond. As she approaches him, she is shocked to glimpse a gnarled and blackened face. She leaves, but films Mr. Jones putting up his new figure from a distance. Darkness falls and suddenly Penny is terrified as thunderous growls fill the air and she glimpses a disfigured face watching her from the bushes. She runs around disoriented until she sees Mr. Jones in the distance holding a lantern. Penny makes a decision to follow him and eventually Mr. Jones' lantern dissolves into one of the lights of her own cabin, and Mr. Jones vanishes. Penny later tells Scott that she felt safe, and thought that Mr. Jones guided her home.\n\nScott returns to the woods and he and Penny make plans to return to Mr. Jones's house. They wait outside until he leaves, and then Scott sneaks in with Penny keeping watch and communicating by radio. Scott enters the house and goes down into both the basement and the sub-basement where he finds a huge underground maze of tunnels filled with more stick figures. In one of the rooms he finds a figure the size of a doll, with candles for eyes. He puts it in his backpack and starts to make his way out.\n\nOutside, Penny is trying to warn Scott that Mr. Jones has returned. She can't reach him though, and her camera crashes to the ground. Underground, Scott is having trouble finding his way out. He frantically calls Penny, but can't reach her. Eventually he finds the right passage and runs out of the house. Penny is nowhere to be found.\n\nScott runs back to his own house, determined to find Penny. What he does find is that there are now stick figures in his front lawn, and even inside of his cabin. Penny turns up in their bedroom, seemingly unharmed. She doesn't know how she got there as she just remembers waking up there.\n\nScott and Penny are now terrorized with a series of bizarre and dreamlike images where they encounter strange sounds, a monitor that shows them video footage of themselves that they didn't film, and even a duplicate of Scott who is trying to break into the house. Time is also distorted as they experience a night that doesn't seem to end, even though their clocks indicate it should be mid-morning. During one episode of terrifying noises outside, there is an urgent knocking on the door. Penny tells Scott to open it, and that it's Mr. Jones. Scott opens the door to find a masked figure who grabs Scott - but he is just trying to hold on in vain as strong winds suck him away into the night. Scott is left holding only the visitor's sack-like mask in his hands.\n\nEventually they decide to leave the cabin and hike out of the area. Immediately they are separated and Scott runs into a duplicate of Penny who urges him to return the doll that he stole. Another Penny tells him that she never returned to the cabin and that Mr. Jones is gone. She wants him to forget about the doll and just leave.\n\nScott ends up back in Mr. Jones' house and in the sub-basement where he is chased by hooded figures. He returns the doll and relights the candles in its eyes. He then puts on the mask he was left with earlier and pulls up his hood, making him look quite strange and bizarre.\n\nIn the final scene we see Scott kissing Penny goodbye. A voice over suggests that he has become Mr. Jones. Apparently Mr. Jones was a shaman that guarded the borderline between a dream world and the waking world. Somehow Scott and Penny disturbed the balance between those worlds, so now Scott must protect it.",
  "synopsis": null
}