{
  "imdb_id": "tt2582496",
  "tmdb_id": "308369",
  "douban_id": "24325923",
  "title": "Me and Earl and the Dying Girl (2015)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "105 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.8,
  "director": [
    {
      "id": "nm0004234",
      "name": "Alfonso Gomez-Rejon"
    }
  ],
  "writer": [
    {
      "id": "nm5428959",
      "name": "Jesse Andrews",
      "description": "novel"
    },
    {
      "id": "nm5428959",
      "name": "Jesse Andrews",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm3287038",
      "name": "Thomas Mann",
      "character": "Greg"
    },
    {
      "id": "nm5518972",
      "name": "RJ Cyler",
      "character": "Earl"
    },
    {
      "id": "nm4972453",
      "name": "Olivia Cooke",
      "character": "Rachel"
    },
    {
      "id": "nm0644406",
      "name": "Nick Offerman",
      "character": "Greg's Dad"
    },
    {
      "id": "nm0110168",
      "name": "Connie Britton",
      "character": "Greg's Mom"
    },
    {
      "id": "nm0788340",
      "name": "Molly Shannon",
      "character": "Denise"
    },
    {
      "id": "nm1256532",
      "name": "Jon Bernthal",
      "character": "Mr. McCarthy"
    },
    {
      "id": "nm2711305",
      "name": "Matt Bennett",
      "character": "Scott Mayhew"
    },
    {
      "id": "nm3675325",
      "name": "Katherine Hughes",
      "character": "Madison"
    },
    {
      "id": "nm1642004",
      "name": "Masam Holden",
      "character": "Ill Phil"
    },
    {
      "id": "nm1442928",
      "name": "Bobb'e J. Thompson",
      "character": "Derrick"
    },
    {
      "id": "nm6599858",
      "name": "Gavin Dietz",
      "character": "Young Greg       (as George Gavin Dietz)"
    },
    {
      "id": "nm6637327",
      "name": "Edward DeBruce III",
      "character": "Young Earl"
    },
    {
      "id": "nm4408300",
      "name": "Natalie Marchelletta",
      "character": "Anna"
    },
    {
      "id": "nm4499755",
      "name": "Chelsea Zhang",
      "character": "Naomi"
    },
    {
      "id": "nm3931686",
      "name": "Marco Zappala",
      "character": "Theater Dork"
    },
    {
      "id": "nm6595744",
      "name": "Kaza Marie Ayersman",
      "character": "Rachel's Friend"
    },
    {
      "id": "nm0185016",
      "name": "Etta Cox",
      "character": "Principal"
    },
    {
      "id": "nm5044934",
      "name": "Karriem Sami",
      "character": "Limo Driver"
    },
    {
      "id": "nm0413168",
      "name": "Hugh Jackman",
      "character": "Hugh Jackman"
    },
    {
      "id": "nm7374784",
      "name": "Cheryl Kline",
      "character": "Rabbi"
    },
    {
      "id": "nm4179095",
      "name": "Joan Augustin",
      "character": "Elderly Mourner"
    },
    {
      "id": "nm7374785",
      "name": "Mark Granatire",
      "character": "Testimonial Student #1"
    },
    {
      "id": "nm7374786",
      "name": "Kayana White",
      "character": "Testimonial Student #2"
    },
    {
      "id": "nm7374787",
      "name": "Linda Kanyarusoke",
      "character": "Testimonial Student #3"
    },
    {
      "id": "nm4925752",
      "name": "Drew Palajsa",
      "character": "Testimonial Student #4"
    },
    {
      "id": "nm5293423",
      "name": "Elly Silberstein",
      "character": "Testimonial Student #5"
    },
    {
      "id": "nm5389594",
      "name": "Nicole Tubbs",
      "character": "Children's Hospital Nurse"
    },
    {
      "id": "nm8697454",
      "name": "Bruno Mello",
      "character": "Greg       (voice)"
    }
  ],
  "overview": "Greg is coasting through senior year of high school as anonymously as possible, avoiding social interactions like the plague while secretly making spirited, bizarre films with Earl, his only friend. But both his anonymity and friendship threaten to unravel when his mother forces him to befriend a classmate with leukemia.",
  "storyline": "Seventeen-year-old Greg has managed to become part of every social group at his Pittsburgh high school without having any friends, but his life changes when his mother forces him to befriend Rachel, a girl he once knew in Hebrew school who has leukemia.",
  "plot": "Awkward, lanky, and self-loathing, Greg Gaines (Thomas Mann) is a senior at Pittsburgh's Schenley High School who appears to drift through life while only seeming to broadly associate himself with the various cliques within Schenley's halls. He learns that a fellow student and former childhood friend of his, Rachel Kushner (Olivia Cooke), has been diagnosed with leukemia and is forced by his parents (Nick Offerman and Connie Britton) to befriend her in her time of need. Despite neither of them truly wanting the other's company, Greg manages to strike up a conversation about her pillow collection. She finds his quirky personality endearing and they make plans to meet on a regular basis.\n\nOver time, Greg introduces Rachel to his longtime co-worker Earl (RJ Cyler), with whom he makes short films parodying famous film titles. At Greg's reluctance, Earl convinces Greg to share their collection of short films with her, which she finds entertaining. As Rachel begins chemotherapy, her disease worsens, and Greg begins spending less time at school and more time caring for her.\n\nDiscovering them shooting another film, Madison (Katherine C. Hughes), Greg's crush, convinces Greg and Earl to make a film dedicated to Rachel, and Rachel persuades Greg to apply to a local college. Despite being accepted by the college, Greg continues to ignore schoolwork, and eventually school altogether, in order to finish the film. After realizing that her chemotherapy is doing more harm than good, Rachel opts to discontinue her treatment. Greg and Rachel have a heated argument over her choice where she points out his unwillingness to do anything selfless unless he's told to do so. He leaves, devastated that he can no longer help her.\n\nIn a rage, Greg confronts Earl, blaming him for the events leading to the end of his friendship with Rachel, with Earl admonishing Greg's inability to care and sympathize for anyone but himself despite the genuine affection she gave him. Afterward, Earl gives Greg a heartfelt testimonial for Rachel before letting him know that he's finished with their friendship. Greg is also told that due to his failing grades, he has been rejected by the college he thought he would attend.\n\nLater in the year, Greg's mom lets him know that Rachel has been moved into hospice as she begins to succumb to her disease, which only depresses him further. Taking pity on him, Madison invites him to the prom. However, after dressing up in a tuxedo, he decides not to go to pick up Madison but instead goes to the hospital where Rachel is receiving hospice care. He brings his iPhone and a portable projector and runs the film he made for Rachel on the front wall of her room, lying beside her as they did when they watched his other films. Rachel is moved to tears by the movie. However, while viewing the film, she falls into a coma, dying a few hours later.\n\nAt her Shiva, Greg and Earl reconcile, and Greg sneaks up into Rachel's room, where he finds a card to him from her explaining that she wrote a letter to the college Greg applied to in order to let them know that he missed school for her sake. He also finds several intricate carvings within her books depicting scenes of her with Greg and Earl, proving that she still cared for him. Greg leaves with one of the books and his favorite of Rachel's pillows.\n\nSome time later, Greg writes his story of his time with Rachel (which is the basis for the film's narrative) and mails it to the college along with the film he made for her.",
  "synopsis": null
}