{
  "imdb_id": "tt2566580",
  "tmdb_id": "187925",
  "douban_id": null,
  "title": "Step Dogs (2013)",
  "genres": [
    "Comedy",
    "Family"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "82 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.5,
  "director": [
    {
      "id": "nm1010592",
      "name": "Geoff Anderson"
    }
  ],
  "writer": [
    {
      "id": "nm0921043",
      "name": "Willem Wennekers",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0419005",
      "name": "Joris Jarsky",
      "character": "Terrance"
    },
    {
      "id": "nm1108472",
      "name": "Ryan Belleville",
      "character": "Louie"
    },
    {
      "id": "nm4415201",
      "name": "Dylan Schmid",
      "character": "Josh"
    },
    {
      "id": "nm4107867",
      "name": "Eliana Jones",
      "character": "Lacey"
    },
    {
      "id": "nm2422305",
      "name": "Emilie Ullerup",
      "character": "Sabrina"
    },
    {
      "id": "nm1638236",
      "name": "Jeff Pangman",
      "character": "Rick"
    },
    {
      "id": "nm1266084",
      "name": "Shannon Jardine",
      "character": "Krystal"
    },
    {
      "id": "nm2422851",
      "name": "Ryland Alexander",
      "character": "Sheriff Carson"
    },
    {
      "id": "nm0865064",
      "name": "Lee Tockar",
      "character": "Meatball       (voice)"
    },
    {
      "id": "nm1243009",
      "name": "Brittney Wilson",
      "character": "Cassie       (voice)"
    },
    {
      "id": "nm4995250",
      "name": "Kendahl Cardinal",
      "character": "TV announcer /              Mission control"
    },
    {
      "id": "nm3021409",
      "name": "Tank",
      "character": "Cassie"
    },
    {
      "id": "nm5947969",
      "name": "Lily",
      "character": "Skunk"
    },
    {
      "id": "nm7595883",
      "name": "Justice",
      "character": "Meatball"
    },
    {
      "id": "nm7595884",
      "name": "Jury",
      "character": "Meatball"
    },
    {
      "id": "nm7595885",
      "name": "Quest",
      "character": "Meatball"
    }
  ],
  "overview": "When a pampered Hollywood pooch is sent up to North to live with a wise cracking farm-mutt, all leashes are off.",
  "storyline": "When humble rancher Rick Patterson marries movie star Sabrina Eastman, his son Josh (10) finds himself with a new step-sister, Lacey (14). Josh is an introverted boy who doesn't have a lot of confidence and Lacey is a spoiled Hollywood brat who's angry at Sabrina for not letting her have her own reality show. The two kids do not get along and neither do their respective dogs: Josh's dog Meatball is a scruffy, farm mutt who's laid-back and friendly; Cassie is a prim, spoiled, purse city dog who is not into country living. Rick and Sabrina go on their honeymoon for a couple of days, leaving Lacey and Josh in the care of Krystal, a hippie-trippy New Age neighbour. When Lacey sees some people outside the house one night, she starts to think someone is watching the house but Josh dismisses her fears. However, as Cassie quickly develops her 'country nose', she learns that Lacey wasn't wrong. She and Meatball discover that a pair of bumbling crooks, Louie and Terrance, are plotting to steal ...",
  "plot": "In 1940, nine-year-old Carl Fredricksen idolizes famous explorer Charles F. Muntz. When Muntz is accused of fabricating the skeleton of a giant exotic bird he says he discovered at Paradise Falls, he vows not to return until he captures one alive. One day, Carl befriends a girl named Ellie, also a Muntz fan. She confides to Carl her desire to move her \"clubhouse\"—an abandoned house in the neighborhood—to a cliff overlooking Paradise Falls.\n\nCarl and Ellie grow up, get married and live in the restored house. Carl sells toy balloons at the zoo where Ellie works. After she suffers a miscarriage and they are told they cannot have a child, the two decide to realize their dream of visiting Paradise Falls. They save for the trip, but repeatedly have to spend the money on more pressing needs. Finally, the now elderly Carl arranges for the trip, but Ellie suddenly becomes ill and dies.\n\nYears later, Carl still lives in the house, stubbornly holding out while the neighborhood homes are torn down and replaced by skyscrapers. When he accidentally injures a construction worker, the court deems him a public menace, ordering him to move to a retirement home. However, Carl comes up with a scheme to keep his promise to Ellie by turning his house into a makeshift airship, using thousands of helium balloons. Russell, a young Wilderness Explorer who visited Carl in his effort to earn his final merit badge, for assisting the elderly, becomes an accidental stowaway.\n\nAfter surviving a thunderstorm, the flying house lands on a tepui opposite Paradise Falls. Carl and Russell harness themselves to the still-buoyant house and begin to walk it across the mesa, hoping to reach the falls before the balloons deflate. Russell encounters a tall, colorful flightless bird, whom he names \"Kevin\". They then meet a Golden Retriever named Dug, who wears a special collar that allows him to speak and who vows to take the bird to his master. The next day, they encounter a pack of aggressive dogs led by Alpha, a Doberman Pinscher, and are taken to their master, who turns out to be Charles Muntz. Muntz invites Carl and Russell aboard his dirigible, where he explains to them that he is searching for a giant bird. When Russell notes the bird's similarity to Kevin, Muntz becomes hostile, believing they are attempting to capture the bird themselves. Carl flees with Kevin and Dug, but Muntz captures Kevin and starts a fire beneath Carl's house, forcing him to choose between saving it or Kevin. Carl rushes to put out the fire, and he and Russell eventually reach the falls, though Russell is upset at Carl for abandoning Kevin. Carl looks through Ellie's childhood scrapbook and is surprised to find that she has filled in the blank pages with photos of their marriage, along with a note thanking him for the \"adventure\" and encouraging him to go have a new one.\n\nReinvigorated, Carl goes outside, only to see Russell sailing off with some balloons and the leaf blower as propulsion to try to rescue Kevin. Carl lightens the house enough to follow. Russell is captured by Muntz, but Carl manages to board the dirigible, tether the house, and free Russell and Kevin. Dug accidentally defeats Alpha and becomes the dogs' new leader. Muntz pursues them around the airship, trapping Dug, Kevin and Russell inside Carl's house. Carl lures Kevin back onto the airship, with Dug and Russell clinging to her back. Muntz leaps after them, but snags his foot on some balloon lines and falls to his death. The house then descends out of sight through the clouds.\n\nAfter reuniting Kevin with her chicks, Carl and Russell fly the dirigible back to the city. Carl presents Russell with his final badge: a grape soda cap that Ellie gave to Carl when they first met. Meanwhile, Carl's house has landed on the cliff beside Paradise Falls, fulfilling his promise to Ellie.",
  "synopsis": null
}