{
  "imdb_id": "tt2523600",
  "tmdb_id": "167221",
  "douban_id": null,
  "title": "Long Live Freedom (2013)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "Italy",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.0,
  "director": [
    {
      "id": "nm0027948",
      "name": "Roberto Andò"
    }
  ],
  "writer": [
    {
      "id": "nm0027948",
      "name": "Roberto Andò",
      "description": "novel"
    },
    {
      "id": "nm0027948",
      "name": "Roberto Andò",
      "description": "screenplay &"
    },
    {
      "id": "nm0664760",
      "name": "Angelo Pasquini",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0785842",
      "name": "Toni Servillo",
      "character": "Enrico Oliveri /              Giovanni Ernani"
    },
    {
      "id": "nm0557609",
      "name": "Valerio Mastandrea",
      "character": "Andrea Bottini"
    },
    {
      "id": "nm0116254",
      "name": "Valeria Bruni Tedeschi",
      "character": "Danielle"
    },
    {
      "id": "nm1538552",
      "name": "Michela Cescon",
      "character": "Anna"
    },
    {
      "id": "nm0853732",
      "name": "Gianrico Tedeschi",
      "character": "Furlan"
    },
    {
      "id": "nm0629008",
      "name": "Eric Nguyen",
      "character": "Mung"
    },
    {
      "id": "nm0719956",
      "name": "Andrea Renzi",
      "character": "De Bellis"
    },
    {
      "id": "nm1927432",
      "name": "Judith Davis",
      "character": "Mara"
    },
    {
      "id": "nm2108143",
      "name": "Brice Fournier",
      "character": "Bertrand"
    },
    {
      "id": "nm1707723",
      "name": "Paolo Bessegato",
      "character": ""
    },
    {
      "id": "nm2979380",
      "name": "Giulia Andò",
      "character": "Hostess"
    },
    {
      "id": "nm1414930",
      "name": "Alessandro Averone",
      "character": ""
    },
    {
      "id": "nm3592093",
      "name": "Vincenzo Pirrotta",
      "character": ""
    },
    {
      "id": "nm0518422",
      "name": "Giovanni Lombardo Radice",
      "character": ""
    },
    {
      "id": "nm2370210",
      "name": "Antonio Gerardi",
      "character": ""
    },
    {
      "id": "nm1779469",
      "name": "Lucia Mascino",
      "character": "Contestatrice"
    },
    {
      "id": "nm0895348",
      "name": "Saskia Vester",
      "character": "Cancelliera"
    },
    {
      "id": "nm5526670",
      "name": "Stella Kent",
      "character": "Hélène"
    },
    {
      "id": "nm0208452",
      "name": "Massimo De Francovich",
      "character": "Presidente"
    },
    {
      "id": "nm0769237",
      "name": "Renato Scarpa",
      "character": "Arrighi"
    },
    {
      "id": "nm0093718",
      "name": "Anna Bonaiuto",
      "character": "Evelina Pileggi"
    },
    {
      "id": "nm8088506",
      "name": "Marco Balsamo",
      "character": ""
    },
    {
      "id": "nm1256496",
      "name": "Lionel Becimol",
      "character": ""
    },
    {
      "id": "nm7097844",
      "name": "Giovanna Cappuccio",
      "character": ""
    },
    {
      "id": "nm5343447",
      "name": "Paola Caprara",
      "character": "Impiegata della sede del partito"
    },
    {
      "id": "nm2636932",
      "name": "Francesco Carrassi",
      "character": ""
    },
    {
      "id": "nm4363851",
      "name": "Aurelio D'Amore",
      "character": ""
    },
    {
      "id": "nm8088507",
      "name": "Armanda Di Stazio",
      "character": ""
    },
    {
      "id": "nm3910752",
      "name": "Guillaume Faure",
      "character": "Paul"
    },
    {
      "id": "nm2672667",
      "name": "Annalisa Lori",
      "character": ""
    },
    {
      "id": "nm2505273",
      "name": "Marianella Laszlo",
      "character": ""
    },
    {
      "id": "nm3146635",
      "name": "Olivier Martinaud",
      "character": "Claude"
    },
    {
      "id": "nm8088508",
      "name": "Massimo Onofri",
      "character": ""
    },
    {
      "id": "nm5586877",
      "name": "Tibor Radvanyi",
      "character": "Maxime"
    },
    {
      "id": "nm0711589",
      "name": "Benjamin Rataud",
      "character": ""
    },
    {
      "id": "nm4621459",
      "name": "Marielle de Rocca-Serra",
      "character": "Annette       (as Marielle de Rocca Serra)"
    },
    {
      "id": "nm0868370",
      "name": "Federico Torre",
      "character": "Portiere"
    },
    {
      "id": "nm0889749",
      "name": "Veronika Varga",
      "character": ""
    },
    {
      "id": "nm8088509",
      "name": "Sandro Volpe",
      "character": ""
    },
    {
      "id": "nm2645420",
      "name": "Carla Cagnetti",
      "character": "Paziente manicomio"
    },
    {
      "id": "nm6351771",
      "name": "Julie Morel",
      "character": ""
    }
  ],
  "overview": "The elections are approaching and the largest opposition party in the country do not look good. Its leader, Enrico Oliveri can not stand the pressure and disappears. Fearing a scandal, the eminence grise of the party had brought into play the twin brother of the politician. Even if looks like two drops of water with his brother Giovanni may have a different personality. His ideas are innovative and direct approach to get the party in the polls ...",
  "storyline": "When a politician disappears, his (mad) twin brother is brought to replace him.",
  "plot": "Based on South African President Nelson Mandela's autobiography of the same name, which chronicles his early life, coming of age, education and 27 years in prison before becoming President and working to rebuild the country's once segregated society.",
  "synopsis": "In this chilling story about world politics, Toni Servillo defies expectations playing two roles, imbuing each character with brilliant nuance and astonishing attention to detail. In the first, he personifies political failure in the role of the disgraced ideologue and party leader, Enrico Oliveri. In the second, he embodies the shrewd genius of a madman as Oliveris unhinged twin brother who seizes control of the nation amidst the void of his brothers disappearance. As the national election approaches, Enrico Oliveri has plummeted in the polls and his supporters and adversaries alike begin to acknowledge his impending downfall. Unwilling to face the failure of his party and his nation, Oliveri vanishes into the night. The party leadership tries to hedge for time by concealing Oliveris disappearance with a series of acrobatic sidesteps. In a desperate move, right hand man Andrea Bottini seeks out Oliveris look-alike twin brother, Giovanni Ernani, a prolific author and philosopher who is freshly released from an insane asylum. Slowly and steadily, Giovanni insinuates himself into his brothers public persona, impersonating Oliveris every tick and mannerism exquisitely yet slightly imperfectly. Giovanni quickly surpasses his brothers political prowess with an eerie talent for rallying the masses through fearless and heroic speeches. As Andò shifts between the failure of the sincere intellectual and the heroics of a madman, he probes the driving forces behind our contemporary global political reality leaving behind a rich web of questions in this unpredictable and provocative thriller.Il segretario del principale partito di opposizione, Enrico Oliveri, si abbandona alla nostalgia in seguito ad uno stato depressivo dovuto ai sondaggi sempre più sfavorevoli per il suo partito.\nAllinsaputa di sua moglie Anna e del suo stretto collaboratore Bottini, fugge una notte improvvisamente per raggiungere a Parigi la donna con la quale, 20 anni prima, aveva avuto una relazione, Danielle. Danielle è oggi una segretaria di edizione sposata al celebre regista cinese Mung con il quale ha una figlia dodicenne, Hélène.\nNel frattempo in Italia Anna e Bottini cercano di risolvere la situazione ricorrendo al fratello gemello di Enrico, Ernani, professore di filosofia reduce da un lungo soggiorno in ospedale psichiatrico. Pur essendo fratelli gemelli apparentemente identici, i due uomini sono in realtà profondamente diversi.\nErnani prende dunque il posto di Enrico: rilascia interviste, tiene discorsi in pubblico, presiede conferenze immettendo nella politica un vento rivoluzionario, è la creatività al potere, la poesia che lascia stupefatti gli avversari e fa sognare gli elettori.\nSarà questo linizio di un misterioso passo a due in cui si intrecciano la vita pubblica e la vita privata di un uomo, ma anche quelle di due fratelli gemelli innamorati della stessa donna.\nUna partita a distanza la cui posta in gioco sono la verità e la falsità del potere."
}