{
  "imdb_id": "tt2508332",
  "tmdb_id": "240206",
  "douban_id": null,
  "title": "Touchless (2013)",
  "genres": [
    "Drama",
    "Thriller"
  ],
  "country": "Czech Republic",
  "version": [
    {
      "runtime": "72 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.7,
  "director": [
    {
      "id": "nm5401837",
      "name": "Matej Chlupacek"
    }
  ],
  "writer": [
    {
      "id": "nm5676598",
      "name": "Jan Mazanec",
      "description": "writer"
    },
    {
      "id": "nm4059153",
      "name": "Michal Samir",
      "description": "contributing writer"
    }
  ],
  "cast": [
    {
      "id": "nm0405402",
      "name": "Krystof Hádek",
      "character": "Richard"
    },
    {
      "id": "nm0419354",
      "name": "Adrian Jastraban",
      "character": "Stin"
    },
    {
      "id": "nm0527352",
      "name": "Petra Lustigová",
      "character": "Daniela"
    },
    {
      "id": "nm0540892",
      "name": "Ondrej Malý",
      "character": "Kleiner"
    },
    {
      "id": "nm2121960",
      "name": "Marian Roden",
      "character": "Igor"
    },
    {
      "id": "nm1856560",
      "name": "Hana Vagnerová",
      "character": "Tyna"
    },
    {
      "id": "nm5662198",
      "name": "Tereza Vítu",
      "character": "Jolana"
    }
  ],
  "overview": "Jolana (18) is an object of her stepf-father's desire. She is unable to cope, especially when her own mother turns a blind eye. Those events are heavily paid for when she finds herself working in a brothel. Her inability to cope raise a question: What is it she actually wants? Are her dreams of escaping really better than the reality she finds herself in?",
  "storyline": "Jolana (18) is an object of her stepfather's desire. She is unable to cope, especially when her own mother turns a blind eye. Those events are heavily paid for when she finds herself working in a brothel. Her inability to cope raise a question: What is it she actually wants? Are her dreams of escaping really better than the reality she finds herself in?",
  "plot": "At night in Paris, Driss is driving Philippe's Maserati at high speed. They are chased through the streets by the police, and eventually cornered. Driss claims the quadriplegic Philippe must be urgently driven to the emergency room; Philippe pretends to have a seizure and the fooled police officers escort them to the hospital.\n\nThe story of the friendship between the two men is then told as a flashback: Philippe, a wealthy quadriplegic who owns a luxurious hôtel particulier, and his assistant Magalie, are interviewing candidates to be his live-in caregiver. Driss, a candidate, has no ambitions to get hired. He is just there to get a signature showing he was interviewed and rejected in order to continue receiving his welfare benefits. He is told to come back the next morning to get his signed letter.\n\nThe next day, Driss returns and learns that he is on a trial period for the live-in caregiver job. Despite being uninterested in the job and his lack of professional experience, Driss does well caring for Philippe, even if his methods are unconventional. Driss learns the extent of Philippe's disability and accompanies Philippe in every moment of his life, assisting him in all the ways needed. A friend of Philippe's reveals Driss's criminal record which includes six months in jail for robbery. Philippe states he does not care about Driss's past because he is the only one that does not treat him with pity. He says he will not fire him as long as he does his job properly.\n\nPhilippe discloses to Driss that he became disabled following a paragliding accident and that his wife died without bearing children. Gradually, Philippe is led by Driss to put some order in his private life, including being stricter with his adopted daughter Elisa. Driss discovers modern art, opera, and even takes up painting. For Philippe's birthday, a private concert of classical music is performed in his living room. Feeling that the concert is too boring, Driss plays Earth, Wind &amp; Fire's \"Boogie Wonderland\", resulting in a less boring birthday for Philippe.\n\nDriss discovers that Philippe has a purely epistolary relationship with a woman called Eléonore, who lives in Dunkirk. Driss encourages him to meet her, but Philippe fears her reaction when she discovers his disability. Driss eventually convinces Philippe to talk to Eléonore on the phone. Philippe agrees with Driss to send a photo of him in a wheelchair to her, but he hesitates and asks his aide, Yvonne, to send a picture of him as he was before his accident. A date between Eléonore and Philippe is agreed. At the last minute, Philippe is too scared to meet Eléonore and leaves with Yvonne before Eléonore arrives. Philippe then calls Driss and invites him to travel with him in his private jet for a paragliding weekend.\n\nAdama, Driss's younger cousin, who is in trouble with a gang, comes to fetch Driss at Phillipe's mansion on the pretext of delivering mail. Overhearing, Philippe recognizes Driss's need to be supportive to his family and releases him from his job, suggesting he may not want to push a wheelchair all his life.\n\nDriss returns to his urban projects, joining his friends, and manages to help his younger cousin. In the meantime, Philippe has hired caregivers to replace Driss, but he is not happy with any of them. His morale is very low and he stops taking care of himself. Yvonne becomes worried and contacts Driss, who arrives and decides to drive Philippe in the Maserati, which brings the story back to the first scene of the film, the police chase. After they have eluded the police, Driss takes Philippe to the seaside. Upon shaving and dressing elegantly, Philippe and Driss arrive at a Cabourg restaurant with a great ocean view. Driss suddenly leaves the table and says good luck to Philippe for his lunch date. A few seconds later, Eléonore arrives. Emotionally touched, Philippe looks through the window and sees Driss outside, smiling at him. Driss bids Philippe farewell and walks away.\n\nThe film ends with shots of Philippe Pozzo di Borgo and Abdel Sellou, the people on whom the film is based, together on a hillside, reminiscent of the paragliding scene earlier in the film. The closing caption states how the men remain close friends to this day.",
  "synopsis": null
}