{
  "imdb_id": "tt2574698",
  "tmdb_id": "250551",
  "douban_id": null,
  "title": "Gunday (2014)",
  "genres": [
    "Action",
    "Drama",
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "152 min",
      "description": ""
    }
  ],
  "imdb_rating": 2.0,
  "director": [
    {
      "id": "nm1804614",
      "name": "Ali Abbas Zafar"
    }
  ],
  "writer": [
    {
      "id": "nm1804614",
      "name": "Ali Abbas Zafar",
      "description": "writer"
    },
    {
      "id": "nm1300956",
      "name": "Sanjay Masoom",
      "description": "additional dialogue"
    }
  ],
  "cast": [
    {
      "id": "nm3828984",
      "name": "Ranveer Singh",
      "character": "Bikram"
    },
    {
      "id": "nm1819083",
      "name": "Arjun Kapoor",
      "character": "Bala"
    },
    {
      "id": "nm1231899",
      "name": "Priyanka Chopra",
      "character": "Nandita"
    },
    {
      "id": "nm0451234",
      "name": "Irrfan Khan",
      "character": "Satya"
    },
    {
      "id": "nm7727977",
      "name": "Karan Aanand",
      "character": "Dutta"
    },
    {
      "id": "nm0051856",
      "name": "Victor Banerjee",
      "character": "Inspector"
    },
    {
      "id": "nm3953723",
      "name": "Diwakar Dhayani",
      "character": "Das"
    },
    {
      "id": "nm6267541",
      "name": "Darshan Gurjar",
      "character": "Young Bikram"
    },
    {
      "id": "nm4723600",
      "name": "Uttam Halder",
      "character": "Coal Seller"
    },
    {
      "id": "nm10342295",
      "name": "Susanta Joddar",
      "character": "Fighter"
    },
    {
      "id": "nm6267542",
      "name": "Jayesh V. Kardak",
      "character": "Young Bala"
    },
    {
      "id": "nm6609380",
      "name": "Ajay Pathania",
      "character": "Bangladesh Army Man #2"
    },
    {
      "id": "nm1516058",
      "name": "Deep Raj Rana",
      "character": "Dibakar"
    },
    {
      "id": "nm8277952",
      "name": "Anant Vidhaat Sharma",
      "character": "Himanshu"
    },
    {
      "id": "nm0795661",
      "name": "Saurabh Shukla",
      "character": "Kale kaka"
    },
    {
      "id": "nm8710919",
      "name": "Gautam Siddhartha",
      "character": "Shop Keeper"
    }
  ],
  "overview": "Based in Calcutta during its most unsettled times in the 1970s, the film deals with the inseparable life of Bikram and Bala. The story of 2 boys, boys who became refugees. Refugees who became gun couriers. Gun Couriers who became coal bandits, coal bandits who became Calcutta's Most Loved, Most Celebrated, Most Reckless, Most Fearless, Most Powerful! A story of two happy-go-lucky renegades who came to be known as...GUNDAY!",
  "storyline": "Based in Calcutta during its most unsettled times in the 1970s, the film deals with the inseparable life of Bikram and Bala. The story of 2 boys, boys who became refugees. Refugees who became gun couriers. Gun couriers who became coal bandits, coal bandits who became Calcutta's most loved, most celebrated, most reckless, most fearless, Most Powerful! A story of two happy-go-lucky renegades who came to be known as... GUNDAY!",
  "plot": "The film opens with the narration of the historic event of the independence of Bangladesh after the third Indo-Pakistani War of 1971. Amongst the desolate people affected by the partition are two orphan kids: Bikram and Bala. A man named Lateef (Pankaj Tripathi) happens to meet them, offers them nourishment and asks them if they'll work for him in the illegal smuggling of guns. The two kids agree and manage to do so successfully, using all the tricks of the trade. One day, the chief army officer that Lateef supplies guns to asks Lateef to leave one of the two boys behind to be his personal sex slave, or else he'll forcibly take Lateef's daughter. Bikram hears this and tells Lateef that he'll stay behind in order to save Bala. Bala, however, refuses to part with his best friend and comes back to save Bikram. Bala saves Bikram from the lecherous officer and they both kill him in the process - thereby becoming \"partners in crime\". As the army chases after the duo, Lateef tries to protect the kids, but in the ensuing skirmish Lateef is killed by the police.\n\nBikram and Bala arrive at Calcutta by train and begin their lives by working at a small restaurant. Bala gets into a fight with the owner who slaps him and calls him a \"refugee\" and a \"Bangladeshi\". The owner then throws both of them out. When Bikram asks a local merchant about the coal's market price, he realizes it's a great opportunity to earn easy money by looting coal from trains and selling it in the market at a lower price. Bala reimburses the restaurant owner for the broken cutlery, slaps the owner and warns him not to mistreat children from hereon.\n\nAs they grow up, Bikram (Ranveer Singh) and Bala (Arjun Kapoor) have started looting entire coal trains to increase their market share. Their main competitor is Dibakar (Deepraj Rana), a coal trader. When Bikram and Bala loot one of his trains, Dibakar's men try to unsuccessfully threaten the duo, who promise them that they will loot Dibakar's next cargo as well. When Bikram and Bala, as promised, turn up to loot Dibakar's coal-filled train, Dibakar goads them by calling them \"refugees\", and a fight breaks out. Before killing Dibakar, Bikram and Bala mention they are not refugees and are Indians as well. The duo, now the undisputed kings of the coal business, start expanding by owning other businesses and become Kings of Calcutta. They convert all their illegal trades to legal business with the help of Kaali Kaka (Saurabh Shukla) and become town heroes by building hospitals, donating to charities and building schools, even though they're both illiterate. They also provide work and help to the poor, thus becoming white-collared and good-hearted samaritans, but their businesses and dealings make them a target of the law, who call them Gunday. Assistant Commissioner of Police Satyajeet Sarkar (Irrfan Khan) is summoned to Calcutta to apprehend Bikram and Bala and bring them to justice. Sarkar, knowing that Bikram and Bala are able to successfully cover up their tracks using Kaali Kaka, warns the duo that he will arrest them the day he finds a single piece of evidence against them.\n\nA local businessman invites Bikram and Bala to the inauguration of the new cabaret he wishes to run in Calcutta, which the duo happily accept. The businessman introduces Bikram and Bala to Himanshu (Anant Vidhaat Sharma), and the businessman assures the duo that Himanshu will be more than happy to assist the duo in any way possible. At the inauguration, Nandita (Priyanka Chopra), a cabaret dancer, enters Bikram and Bala's lives and they both fall in love with her. They decide that whoever manages to win her heart will marry her. After some persistent wooing, Nandita calls both of them to a theater to reveal whom she loves. While Nandita performs onstage on the sensual song \"Kaate Nahi Katte Ye Din Ye Raat\" from Mr. India, Bala gets into a quarrel with a person over a lewd comment the guy passes on Nandita, and in the subsequent brawl shoots the man. Bikram asks Bala to run away for the time being as Sarkar is searching for Bala, and promises not to meet Nandita until Bala returns. ACP Sarkar advices Bikram to tell Bala not to return to Calcutta or he (Bala) will be killed. Nandita tells Bikram that she's in love with him and if he does not come to Durga Puja, she will never see him again. Bikram agrees to meet her and they perform Durga Puja together. Bala finds out about this through Himanshu, and returns to Calcutta during Durga Puja. On seeing Bikram and Nandita happy together, an enraged Bala shoots at Bikram after blaming him of breaking his promise, but misses and hits Nandita instead. She is rushed to hospital and survives, but Bikram and Bala's friendship is damaged in the process.\n\nBala then finds out that all business they both owned are in Bikram's name, hence he angrily calls Bikram and asks for an equal partition of the business. Bikram agrees, and transfers half the business to Bala, even the ration card which is a proof of their Indian nationality. Bala then talks about dividing Nandita between them as well. Bikram becomes livid, and a fight erupts. Bikram wins, but he spares Bala, remembering how Bala once saved Bikram's life when they were kids, thus making them \"even\". Bikram warns Bala not to bother Nandita or he will kill him.\n\nBikram asks Nandita to marry him, but Nandita tells him that she cannot marry him unless he leaves his criminal life behind. Bikram agrees, and they decide to get married. To exact revenge on Bikram, Bala blows up Bikram's coal mines and kidnaps Nandita. As Bikram readies to end the feud once and for all, Sarkar asks Bikram to turn state's evidence and implicate Bala so that Bikram and Nandita can live happily.\n\nBala threatens Nandita that if she won't leave Bikram, he will kill her. Nandita tells him that she still loves Bikram, explaining why she chose Bikram, and not him. She also reveals the truth: that Bikram did not wish to break his promise to Bala, and it was she who asked Bikram to come to Durga Puja. Bala, heartbroken, realizes his mistakes, and drops Nandita off to let her go back to Bikram and apologizes to her before he leaves. Nandita is then revealed to be an undercover police officer working for Sarkar, who is helping Sarkar to get Bikram and Bala separated and arrested.\n\nMeanwhile, as Bikram gets ready to work together with Sarkar to implicate Bala, he runs into the man who Bala supposedly \"killed\", and finds out that the man is actually a police officer. Nandita tries to convince Bikram that upon surrendering he will be treated leniently by the law, but Bikram truly believes that the police and the system were responsible for destroying his and Bala's innocence and childhood. Nandita reveals her identity to Bikram, and the bewildered Bikram realizes that Nandita was a part of the trap Sarkar set up to divide Bikram and Bala. When she requests him to surrender, he refuses and goes to reunite himself with Bala.\n\nHimanshu takes Bala deep in the coal mine under the guise of having to meet Dutta, thereby trapping Bala. Himanshu then reveals his true identity: he is the brother of Dibakar, and he had witnessed the murder of his brother at the hands of Bikram and Bala. Himanshu also reveals Nandita's true identity and attempts to kill Bala, but Bikram shows up to rescue Bala, after which Bala kills Himanshu by impaling him. The duo get reunited at last, and Bala asks Bikram for forgiveness. The duo find themselves surrounded by police, spearheaded by Sarkar and Nandita, and decide to make a run for it. After a long chase, Bala and Bikram get cornered by Sarkar and Nandita. Nandita confesses once again to Bikram that she truly loves him and he should surrender, whilst Sarkar also tries to convince Bala to surrender and to begin life anew. But, to their surprise, Bikram and Bala spot a train passing by and start running towards it to catch it. Sarkar and Nandita fire bullets at them, as the film ends with the death of Bikram and Bala and their narrative, saying:\n\n\"Khudaa Ke Banday Hain Hum; Hum Gunday The, Gunday Hain, Gunday Rahenge Hum...\"\n\n\"We Are God's Creations; We Were, We Are, And We'll Always Be Outlaws...\"",
  "synopsis": "This movie is a disgrace for Bangladeshi liberation history.Full of rubbish info's through out the movie.We protest for all the lies this movie is spreading now.this movie has some good songs.but again full of junk history."
}