{
  "imdb_id": "tt2571140",
  "tmdb_id": "228355",
  "douban_id": null,
  "title": "Boss (2013)",
  "genres": [
    "Action"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "143 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.5,
  "director": [
    {
      "id": "nm3051114",
      "name": "Anthony D'Souza"
    }
  ],
  "writer": [
    {
      "id": "nm1440053",
      "name": "Siby K. Thomas",
      "description": "original story &"
    },
    {
      "id": "nm1437907",
      "name": "Udaykrishnan",
      "description": "original story"
    },
    {
      "id": "nm2260872",
      "name": "Farhad Samji",
      "description": "writer as Farhad &"
    },
    {
      "id": "nm2678319",
      "name": "Sajid",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0474774",
      "name": "Akshay Kumar",
      "character": "Suryakant Shastri /              Boss"
    },
    {
      "id": "nm3109407",
      "name": "Shiv Panditt",
      "character": "Shiv Shastri       (as Shiv Pandit)"
    },
    {
      "id": "nm0149822",
      "name": "Mithun Chakraborty",
      "character": "Satyakant Shastri"
    },
    {
      "id": "nm0747172",
      "name": "Ronit Roy",
      "character": "Ayushman Thakur"
    },
    {
      "id": "nm2390814",
      "name": "Aditi Rao Hydari",
      "character": "Ankita Thakur"
    },
    {
      "id": "nm0505323",
      "name": "Johnny Lever",
      "character": "Inspector Zorawar Singh"
    },
    {
      "id": "nm0756378",
      "name": "Parikshat Sahni",
      "character": "Raghunath"
    },
    {
      "id": "nm0620636",
      "name": "Govind Namdeo",
      "character": "Vishwas Pradhan"
    },
    {
      "id": "nm3561962",
      "name": "Aakash Dabhade",
      "character": "Vishal Pradhan"
    },
    {
      "id": "nm0219939",
      "name": "Danny Denzongpa",
      "character": "Big Boss"
    },
    {
      "id": "nm0000821",
      "name": "Amitabh Bachchan",
      "character": "Narrator"
    },
    {
      "id": "nm0077681",
      "name": "Sudesh Berry",
      "character": "Dushyant"
    },
    {
      "id": "nm5244643",
      "name": "Swantatra Bharat",
      "character": "Baktawar"
    },
    {
      "id": "nm2713930",
      "name": "Harry Josh",
      "character": "Man sent to kill Surya"
    },
    {
      "id": "nm2234698",
      "name": "Pradeep Kabra",
      "character": "Lalan (Big Boss driver)"
    },
    {
      "id": "nm0007106",
      "name": "Shakti Kapoor",
      "character": "Nandu Plumber"
    },
    {
      "id": "nm6020983",
      "name": "Mustaq Khan",
      "character": "Yadav"
    },
    {
      "id": "nm1572643",
      "name": "Neelu Kohli",
      "character": "Kamini Zorawar Singh"
    },
    {
      "id": "nm5884809",
      "name": "Mike 'Leo' Leonardi",
      "character": "Chicago Alderman"
    },
    {
      "id": "nm5366273",
      "name": "Ciara A. Lyons",
      "character": "Lead Dancer"
    },
    {
      "id": "nm0592799",
      "name": "Sanjay Mishra",
      "character": "Trilok"
    },
    {
      "id": "nm4496208",
      "name": "Rishiraj Pawar",
      "character": "Young Surya /              Boss"
    },
    {
      "id": "nm3848064",
      "name": "Sonakshi Sinha",
      "character": "Dancer - Party all Night"
    },
    {
      "id": "nm0864608",
      "name": "Mukesh Tiwari",
      "character": "Inspector"
    }
  ],
  "overview": "A young man disowned by his family is aided by a big business owner.",
  "storyline": "Boss (Akshay Kumar) takes the blame for a murder done by his father mistakenly... after serving his jail term he becomes a gangster who is cool and fearless. But all hell breaks loose when a corrupt police officer and a politician give him a contract to kill, which causes him a terrible dilemma.",
  "plot": "The film starts of with School Teacher Satyakant Shastri (Mithun Chakraborty) who has two children, Surya and Shiv. After Surya brawls with another child multiple times and eventually kills him, Satyakant kicks him out and disowns him. Years later, Shiv (Shiv Pandit) grows up as the only son to his father. It is revealed that after being disowned, Surya had saved the life of a transport businessman Tauji aka Big Boss (Danny Denzongpa) who had taken him in and raised him like a son for 15 years. Now, Surya (Akshay Kumar) has transformed himself into Boss, a suave, tough transport businessman who fights for justice.\n\nShiv falls in love with Ankita (Aditi Rao Hydari), who turns out to be the sister of a corrupt Police Officer named Ayushman Thakur (Ronit Roy). Ayushman is in cahoots with the corrupt and power hungry Home Minister, Pradhan (Govind Namdeo). Pradhan suggests to Ayushman that he should get Ankita married to his son Vishal (Aakash Dabhade). Ayushman agrees and decides that Ankita will marry him whether she wants to or not. Upon finding out she is in love with Shiv, he has Shiv arrested and convicted for crimes he hasn't committed. It's also revealed that Surya didn't murder his classmate. Instead, Satyakant accidentally impaled him when he shoved them into a room so that they would learn to deal with each other.\n\nSatyakant then tries to bail Shiv out and calmly explains to Ayushman, but instead is humiliated and thrown out of the police station. Without any choice, Satyakant decides to turn to his other son, for help.\n\nBoss meets Ayushman and convinces him to free Shiv from all charges alleged on him, telling him that Boss would kill Shiv when he is released from the police custody. Boss helps Shiv escape from custody. Pradhan sends his cops to capture Boss and take him to farm house of ACP Ayushman. Boss manages to escape from the goons, and reaches Ayushman's farm house. Pradhan calls Tauji there to complain about Boss. There in front of Tauji, Pradhan cancels his contract of killing Shiv with Tauji. After noticing the presence of Ankita there, Boss asks her whether she loves Shiv to which she replies positively. Boss takes the responsibility of getting Ankita married to Shiv in front of Tauji and her brother Ayushman. Satyakant and Shiv are attacked by a contract killer Jabbar Bhai sent by Pradhan. Boss kills Jabbar Bhai and his gang, saving his father and brother.\n\nTwenty five of the MLAs of Pradhan are caught red handed at a brothel with prostitutes by media with the help of an unknown informer, later revealed to be Boss. Ayushman sets a trap against Shiv using the friend of Ankita and arrests Shiv in a fake rape case. Boss kidnaps son of Pradhan and sets a time bomb on him to get have Shiv freed from Police custody. Tauji informs Satyakant that Surya (Boss) did not kill his school-mate and that it was an accident. Satyakant rushes to meet Boss along with Tauji but their car is hit by a truck sent by Ayushman. Tauji survives the accident but Satyakant is injured and hospitalized. Finally, Boss brutally defeats Ayushman followed by a long fight. In the end, Satyakant along with Shiv is shown opening his arms calling Boss to hug and they reunite.",
  "synopsis": null
}