{
  "imdb_id": "tt2545936",
  "tmdb_id": "296371",
  "douban_id": null,
  "title": "Jake's Road (2017)",
  "genres": [
    "Action",
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.0,
  "director": [
    {
      "id": "nm1977125",
      "name": "Mike Mayhall"
    }
  ],
  "writer": [
    {
      "id": "nm1977125",
      "name": "Mike Mayhall",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0000616",
      "name": "Eric Roberts",
      "character": "Keith"
    },
    {
      "id": "nm2584077",
      "name": "Garrett Hines",
      "character": "Sam"
    },
    {
      "id": "nm3605836",
      "name": "Leticia Jimenez",
      "character": "Kay"
    },
    {
      "id": "nm2482839",
      "name": "Patrick Flanagan",
      "character": "Chris"
    },
    {
      "id": "nm1419241",
      "name": "Tim Bell",
      "character": "Mike"
    },
    {
      "id": "nm1977125",
      "name": "Mike Mayhall",
      "character": "George"
    },
    {
      "id": "nm3554130",
      "name": "Ashton Leigh",
      "character": "Joanie"
    },
    {
      "id": "nm3969329",
      "name": "Miles Doleac",
      "character": "Heath"
    },
    {
      "id": "nm3174927",
      "name": "Taryn Terrell",
      "character": "Silvia"
    },
    {
      "id": "nm3525785",
      "name": "Kristin Samuelson",
      "character": "Martha"
    }
  ],
  "overview": "Waking in a hospital, bruised and beaten, a young man struggles to piece together the events of a horrifying weekend. Amid flashes of relaxing with friends, the image of a killer begins to emerge - creeping ever closer. Somewhere within his memories and the madness lies the key to the killer’s identity, which, once discovered, may be more horrific than the murders themselves. Set in rural southern Louisiana Jake’s Road is a tale of family and how one moment can rip loved ones apart or bind them forever. With enough twists and turns to keep viewers guessing until the very end, we discover what drives a man to kill all that he loves and fight for all that he has.",
  "storyline": "Jake's Road, a full length suspense thriller that descends into horror. A young man awakens in a hospital bruised and beaten. He struggles to piece together the events flooding through his mind. As flashes of a relaxing weekend with friends slowly emerge, so does the horrific image of a killer - creeping ever closer. Somewhere within the madness is the key to the killer's identity, but once discovered it may be more horrific than the murders themselves. Set in rural southern Louisiana 'Jake's Road' is a tale of family and how one moment can rip you apart or bind you forever together. With enough twists and turns to keep you guessing until the very end as we discover what drives a man to kill all he loves and fight for all he has.",
  "plot": null,
  "synopsis": null
}