{
  "imdb_id": "tt2568760",
  "tmdb_id": "165755",
  "douban_id": null,
  "title": "Theevram (2012)",
  "genres": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "135 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.3,
  "director": [
    {
      "id": "nm4115259",
      "name": "Roopesh Peethambaran"
    }
  ],
  "writer": [
    {
      "id": "nm4115259",
      "name": "Roopesh Peethambaran",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4921260",
      "name": "Dulquer Salmaan",
      "character": "Harsha Vardhan"
    },
    {
      "id": "nm0820208",
      "name": "Sreenivasan",
      "character": "Circle Inspector Alexander"
    },
    {
      "id": "nm4265894",
      "name": "Vinay Forrt",
      "character": "Ramachandran"
    },
    {
      "id": "nm5398535",
      "name": "Vishnu Raghav",
      "character": "Dr. Roy"
    },
    {
      "id": "nm3351235",
      "name": "Aashiq Abu",
      "character": "Himself"
    },
    {
      "id": "nm0417314",
      "name": "Janardanan",
      "character": ""
    },
    {
      "id": "nm7075333",
      "name": "Anu Mohan",
      "character": "Raghavan"
    },
    {
      "id": "nm4520191",
      "name": "Unni Mukundan",
      "character": "Himself"
    },
    {
      "id": "nm5416136",
      "name": "Shikha Nair",
      "character": "Maya"
    },
    {
      "id": "nm6031807",
      "name": "Andrea Marian Renji",
      "character": "Piano Student"
    },
    {
      "id": "nm5416722",
      "name": "Amala Rose",
      "character": "Maina"
    },
    {
      "id": "nm5398845",
      "name": "Riya Saira",
      "character": "Nimmi"
    },
    {
      "id": "nm4432862",
      "name": "Ahamed Shaheen",
      "character": "No Name"
    },
    {
      "id": "nm0820200",
      "name": "Sreekumar",
      "character": ""
    }
  ],
  "overview": "Theevram (Malayalam: തീവ്രം, Extreme) is a 2012 Malayalam language Indian action thriller film written and directed by Roopesh Peethambaran, starring Dulquer Salmaan, Shikha Nair, Sreenivasan, Vinay Forrt, Vishnu Raghav, Riya Saira and Anu Mohan.[1][2] The film is produced by V.C Ismayil under the banner of VCI Movies and features music composed by Roby Abraham, whilst cinematography is handled by Hari Nair and the editing by Kapil Gopalakrishnan. Distribution of the film is done by Lal Jose under the banner of LJ Films.The film is loosely based on two sensational murders that happened in Bangalore - the 2003 BV Girish murder case and 2005 BPO employee Pratibha rape and murder case.",
  "storyline": "A wannabe musician seeks wild justice by plotting the perfect murder of the man who wronged him. A missing auto-rickshaw driver and unidentifiable mutilated body parts found at different leaves the Kerala Police dumbfounded.Parallel to the investigation the history of the murderer and the murdered are revealed.",
  "plot": "In 1815, French prisoner Jean Valjean is released on parole from Toulon prison after serving 19 years for stealing a loaf of bread and trying to escape multiple times. On the outside, Valjean’s paroled status prevents him from getting work. He is offered shelter by the kindly Bishop of Digne, but Valjean steals his silverware. Captured by police and taken to the Bishop, Valjean is shocked when the Bishop, representing the grace of God, says he gave Valjean the silver, then giving him much more, telling him to use it to do something worthwhile with his life. Valjean breaks his parole to start a new life.\n\nEight years later, Valjean is factory owner and mayor of Montreuil, Pas-de-Calais. He is shocked when a Toulon prison guard Javert arrives as his new chief of police. Javert suspects Valjean’s identity when he rescues an injured worker trapped under a heavy cart. One of Valjean’s workers, Fantine, is dismissed by the factory foreman upon learning she is sending her earnings to her illegitimate daughter Cosette, who lives with the greedy innkeepers, the Thénardiers. To support her daughter, Fantine becomes a prostitute but is arrested by Javert when she attacks an abusive customer. Valjean, learning who she is, has her hospitalized.\n\nValjean learns a man has been wrongly identified as him, and reveals his true identity to a court before returning to the dying Fantine, promising to care for Cosette. Javert arrives but Valjean escapes, finding Cosette and pays Fantine’s debts to the Thénardiers, though they refuse to believe he payed enough. Valjean and Cosette flee Javert, hiding in a convent, aided by the worker Valjean rescued before. Nine years later, Valjean has become a philanthropist and helps the poor in Paris. General Lamarque, the only government official sympathetic to the poor, dies, and a group of revolutionists called the Friends of the ABC plot to rebel against the monarchy. Marius Pontmercy, a member of the Friends, encounters Cosette and they fall in love, asking Éponine, the Thénardiers’ daughter to help find her.\n\nAfter Marius and Cosette meet and profess their love for each other, Éponine (who is in love with Marius) prevents her father from robbing Valjean’s house. Valjean, believing Javert is near, makes plans to flee to England with Cosette. Cosette writes a letter for Marius, but Éponine hides it, intending on dying with Marius during the rebellion. During Lamarque’s funeral procession, the revolt begins and barricades are built across Paris. Javert pretends to be an ally to spy on the rebels but the street urchin Gavroche (the Thénadiers′ abandoned son) exposes him as a policeman, and they subdue him. During the first skirmish against the soldiers, Éponine takes a bullet for Marius and dies in his arms, giving him Cosette’s letter and confesses her deceit to him beforehand. Gavroche takes Marius’ reply to Valjean, who joins the revolution to guard Marius.\n\nValjean offers to execute Javert but actually releases him, faking his death. By dawn, the soldiers are close to ending the revolution, storming the students’ barricade and killing everyone but Valjean and Marius, who escape into the sewers. Thénardier comes across Valjean and the unconscious Marius, stealing the latter’s ring, before pointing a way out. Valjean finds Javert waiting for him, ignoring his nemesis’ threats. Javert, morally confused by the mercy of Valjean, commits suicide by throwing himself in the Seine. Marius recovers but is traumatized by the death of his friends.\n\nMarius and Cosette plan to marry but Valjean, concerned his presence would threaten their happiness, makes plans to leave and reveals his identity to Marius, who promises to remain silent for the benefit of Cosette. Cosette and Marius marry but the Thénardier's crash the wedding to try and blackmail Marius, Thénardier saying he witnessed Valjean carrying a murdered corpse and showing the stolen ring. Realizing it was Valjean who rescued him, he forces Thénardier to reveal Valjean's whereabouts, at the convent. The dying Valjean reunites with Cosette and Marius, giving them letters of confession, before peacefully dying, guided away by Fantine and the Bishop’s spirits.",
  "synopsis": "The Movie opens with a crime where a young man is beaten to death with a club in front of his fiance. Then comes an investigation officer Alexander (Sreenivasan), and an assistant Ramachandran (Vinay Forrt). Alexander unlike the assistant, is an officer who doesn't believe in torturing the accused people to prove crimes. Though he is a man who even fears to witness a live postmortem, he is intelligent enough to prove crimes. He proves this one too without much problems. Parallel to this, Harsha Vardhan (Dulquer Salmaan), a man of mystery, lives lonely in a big house, and teaches music to a girl named Sophie. He one day kidnaps and brings an auto driver (Anu Mohan) and tortures him in his house cellar covered with plastic. Alex and Ramachandran take up the case and upon investigation, Alex suspects Harsha. But Harsha turns out to be quick and swift before his suspicion turns into his belief. He kills the auto driver and then eradicates every single evidence which proved him guilty and revealed the identity of the driver. Once the severed parts are found, the case heats up further and Alex realizes that it's a well planned murder, only after he finds Harsha to have left the city without any notice.The story then moves four years back. Harsha, as an aspiring young musician, struggles not only in his career, but also in his life to maintain his relationship with his lover Maya. After getting married, both of them, with their two more friends, Nimmy (Riya Saira) and Dr. Roy (Vishnu Raghav) start living together. One day, May joins a call center and gets miffed with a driver on his careless driving. Harsha leaves for Chennai, after getting his break and while he's away, the driver murders his wife and buries her severed head to avoid suspicion. But Alex finds it out and the driver is imprisoned. Harsha gets devastated by the loss of Maya and gets furious upon finding that first of all, the driver was given life imprisonment instead of death penalty, and secondly, he got freed before time. He makes a plan along with his two friends to kill the driver. Nimmy starts using his auto and befriends him. One day, while going with him, Nimmy follows Harsha's plan and the driver takes her on a route through a forest, and she suddenly jumps out. In order to stop her from running, he jumps out but is held by Harsha. A fight takes place between them in which Harsha overpowers the driver and injects him to unconsciousness.Then in the present, Nimmy and Roy are shown watching news which proves the system's failure in finding out the dead body's identity and that the case would go on with further investigations. Upon being asked by Ramachandran about what was to be their next action, Alex smiles and replies that, \"It's not Jesus Christ who has died. It's Judas. He'll have to die\", after which he is accompanied by Ramachandran through his laughter, indicating that they won't disclose anything about Harsha."
}