{
  "imdb_id": "tt2538128",
  "tmdb_id": "182228",
  "douban_id": null,
  "title": "100 Degrees Below Zero (2013)",
  "genres": [
    "Action",
    "Adventure",
    "Drama",
    "Sci-Fi",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "89 min",
      "description": ""
    }
  ],
  "imdb_rating": 2.4,
  "director": [
    {
      "id": "nm5189759",
      "name": "R.D. Braunstein"
    }
  ],
  "writer": [
    {
      "id": "nm4437450",
      "name": "H. Perry Horton",
      "description": "screenplay"
    },
    {
      "id": "nm0770942",
      "name": "Richard Schenkman",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0001194",
      "name": "Jeff Fahey",
      "character": "Steve Foster"
    },
    {
      "id": "nm1523899",
      "name": "Sara Malakul Lane",
      "character": "Taryn Foster"
    },
    {
      "id": "nm4162416",
      "name": "Marc Ewins",
      "character": "Ryan Foster"
    },
    {
      "id": "nm0722636",
      "name": "John Rhys-Davies",
      "character": "Colonel Ralph Dillard"
    },
    {
      "id": "nm0436442",
      "name": "Iván Kamarás",
      "character": "Dr. Goldschein"
    },
    {
      "id": "nm0372345",
      "name": "Luke Healy",
      "character": "Lieutenant Perkins"
    },
    {
      "id": "nm2436632",
      "name": "Judit Fekete",
      "character": "Lacey"
    },
    {
      "id": "nm3633008",
      "name": "Zsófi Trecskó",
      "character": "Angelique"
    },
    {
      "id": "nm5693616",
      "name": "Fru Roszil",
      "character": "Ana"
    },
    {
      "id": "nm0512897",
      "name": "Peter Linka",
      "character": "C-160 Pilot"
    },
    {
      "id": "nm1992693",
      "name": "András Korcsmáros",
      "character": "Philippe - French Soldier"
    },
    {
      "id": "nm2155145",
      "name": "Tamás Deák",
      "character": "Stuart the Furrier"
    },
    {
      "id": "nm0360426",
      "name": "Declan Hannigan",
      "character": "Channel Attendant"
    },
    {
      "id": "nm0961287",
      "name": "Tamás Lengyel",
      "character": "Claude"
    },
    {
      "id": "nm5693977",
      "name": "Zoltan Erdelyi",
      "character": "Channel Guard"
    },
    {
      "id": "nm2779137",
      "name": "Csaba Gerner",
      "character": "Thug"
    },
    {
      "id": "nm5581326",
      "name": "Lajos Kalmár",
      "character": "Second Thug"
    },
    {
      "id": "nm3229974",
      "name": "Steve Carlson",
      "character": "Frank"
    },
    {
      "id": "nm5693666",
      "name": "Gabor F. Gabriel",
      "character": "Old Gentleman"
    },
    {
      "id": "nm3965248",
      "name": "Maximilian Elfeldt",
      "character": "Lieutenant Redding"
    },
    {
      "id": "nm0424499",
      "name": "Andray Johnson",
      "character": "Chief Dawson"
    },
    {
      "id": "nm3989911",
      "name": "Jordan James Smith",
      "character": "Dr. Oppemheim"
    },
    {
      "id": "nm0770942",
      "name": "Richard Schenkman",
      "character": "American Scientist"
    },
    {
      "id": "nm5694062",
      "name": "Ross John Gilbert",
      "character": "Background person"
    },
    {
      "id": "nm5537385",
      "name": "Livia Bús",
      "character": "Background"
    },
    {
      "id": "nm6889492",
      "name": "Jane Doole",
      "character": "Jana Foster"
    },
    {
      "id": "nm3778773",
      "name": "Jabari King",
      "character": "Background"
    },
    {
      "id": "nm9870969",
      "name": "Irina Lyons",
      "character": "Background"
    },
    {
      "id": "nm5510194",
      "name": "Zsuzsa Nyitrai",
      "character": "Background"
    },
    {
      "id": "nm5809061",
      "name": "William Snider",
      "character": "Background"
    }
  ],
  "overview": "After freak climate and weather events destroy the world around them, a group of rogue scientists attempt to reverse the deadly new ice age.",
  "storyline": "When a chain of volcanic eruptions rips through Europe, the enormous ash cloud blocks out the sun, plunging the continent into a new ice age. An American couple must find their kids and get them out of Paris before it freezes over.",
  "plot": null,
  "synopsis": "After a volcanic eruption, a giant ash cloud begins to block out the sun from the majority of Europe, causing freezing temperatures, and dangerous ice to form, which leads to Colonel Ralph Dillard starting a mass evacuation. Meanwhile, Steve Foster, and his wife Lacey, are flying to Paris to see Steve's children Taryn, and Ryan, who have been going to college there, although are grounded due to the weather conditions. They call, and tell Taryn, and Ryan the news. Later, giant hail begins falling out of the sky, which injures Ryan. An 8.4 earthquake soon occurs, causing Ryan to smash his phone, and Taryn's loses connection.Steve, and Lacey, meanwhile, decide to pick up the kids in Paris, and rent a car in order to reach them. Taryn, and Ryan seek warmth in an abandoned hotel, although they only find a man trying to collect documents. The two soon fall down into the basement, although manage to get back onto ground level shortly after. An aftershock occurs when Ryan is touching elevator cables, electrocuting him. Taryn finds a defibrillator, and the man collecting the documents uses it to revive Ryan. Steve, and Lacey then manage to successfully call Taryn, and the two groups agree to meet at the Eiffel Tower.Taryn, and Ryan arrive at a clothing store, where they find two fur coat jackets, although the owner of the store, Stuart, demands they pay him a large amount of money. As Taryn, and Ryan attempt to leave, Stuart holds them at gunpoint, although another earthquake occurs, during which Stuart is crushed under a shelf, and Taryn becomes stuck under the same shelf, although Ryan manages to rescue her. Meanwhile, Steve, and Lacey begin driving through an underwater tunnel, although water quickly begins to break through, and they make it out just before they are engulfed. Steve then contacts Dillard, who is an old war friend of his, and Dillard gives them directions to an air force base where they can get a helicopter. Dillard also arranges them to meet him at his military base when the evacuation begins. Steve, and Lacey soon reach the base, and begin flying to the Eiffel Tower.Taryn, and Ryan are picked up by National Guards attempting to evacuate survivors, although their car soon crashes, killing the guards. Taryn, and Ryan continue their journey to the Eiffel Tower, with a french woman named Angelique in tow. They manage to steal some bikes, although a group of thugs steal their bikes, and their coats shortly before they reach the tower. They climb near the top of the tower, where they see Steve, and Lacey. Steve, and Lacey use an improvised zip-line to get them onto the helicopter. They then crash land at Dillard's base, and board an evacuation plane before flying out of the disaster zone."
}