{
  "imdb_id": "tt2574576",
  "tmdb_id": "284875",
  "douban_id": null,
  "title": "Cut Snake (2014)",
  "genres": [
    "Thriller"
  ],
  "country": "Australia",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm0044016",
      "name": "Tony Ayres"
    }
  ],
  "writer": [
    {
      "id": "nm1538151",
      "name": "Blake Ayshford",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0822982",
      "name": "Sullivan Stapleton",
      "character": "Pommie"
    },
    {
      "id": "nm3887625",
      "name": "Alex Russell",
      "character": "Sparra Farrell"
    },
    {
      "id": "nm2681284",
      "name": "Jessica De Gouw",
      "character": "Paula"
    },
    {
      "id": "nm1744534",
      "name": "Megan Holloway",
      "character": "Yvonne"
    },
    {
      "id": "nm0907942",
      "name": "Kerry Walker",
      "character": "Mrs. Farrell"
    },
    {
      "id": "nm0604989",
      "name": "Robert Morgan",
      "character": "Duck"
    },
    {
      "id": "nm0388023",
      "name": "Paul Moder",
      "character": "Carl"
    },
    {
      "id": "nm0751231",
      "name": "Jim Russell",
      "character": "Neil"
    },
    {
      "id": "nm0488023",
      "name": "Catherine Larcey",
      "character": "May"
    },
    {
      "id": "nm3205371",
      "name": "Richard Anastasios",
      "character": "Wayne"
    },
    {
      "id": "nm0415725",
      "name": "Graham Jahne",
      "character": "Len"
    },
    {
      "id": "nm0109771",
      "name": "Syd Brisbane",
      "character": "Ben"
    },
    {
      "id": "nm0254275",
      "name": "Luke Elliot",
      "character": "Bruce"
    },
    {
      "id": "nm0841467",
      "name": "Brett Swain",
      "character": "Boss"
    },
    {
      "id": "nm6944924",
      "name": "Jack Daye",
      "character": "Nightclub Drag Artist"
    },
    {
      "id": "nm1912979",
      "name": "Christopher Bunworth",
      "character": "Mr. McGrath"
    },
    {
      "id": "nm1647620",
      "name": "Rosie Traynor",
      "character": "Mrs. McGrath"
    },
    {
      "id": "nm3726202",
      "name": "Beau Karolos",
      "character": "Uniformed Cop in Factory"
    },
    {
      "id": "nm1267243",
      "name": "Han Tran",
      "character": "Waiter"
    },
    {
      "id": "nm3171656",
      "name": "Robert Maxwell",
      "character": "Paula's Brother"
    },
    {
      "id": "nm5535394",
      "name": "Antonius Verlaan",
      "character": "Bear"
    },
    {
      "id": "nm3581087",
      "name": "Tristan Meecham",
      "character": "Barman in Club"
    },
    {
      "id": "nm7578340",
      "name": "Na Li",
      "character": "Chinese Woman"
    },
    {
      "id": "nm7578341",
      "name": "Robert Adams",
      "character": "Transvestite in Club #1"
    },
    {
      "id": "nm7230364",
      "name": "Benjamin Hancock",
      "character": "Transvestite in Club #2"
    },
    {
      "id": "nm7578342",
      "name": "James Andrews",
      "character": "Transvestite in Club #3"
    },
    {
      "id": "nm7578343",
      "name": "Michael Zinner",
      "character": "Dancing Boy #1"
    },
    {
      "id": "nm7578344",
      "name": "Nathan Dubber",
      "character": "Dancing Boy #2"
    },
    {
      "id": "nm4742379",
      "name": "Kai Mann-Robertson",
      "character": "Dancing Boy #3"
    },
    {
      "id": "nm4066548",
      "name": "Ross Grant",
      "character": "Prisoner #1"
    },
    {
      "id": "nm3779543",
      "name": "Jace Martin",
      "character": "Prisoner #2"
    },
    {
      "id": "nm0441046",
      "name": "Zlatko Kasumovic",
      "character": "Prisoner #3"
    },
    {
      "id": "nm0740389",
      "name": "Reg Roordink",
      "character": "Prisoner #4"
    },
    {
      "id": "nm0794857",
      "name": "Robert Shook",
      "character": "Prisoner #5"
    },
    {
      "id": "nm1932878",
      "name": "Michael M. Foster",
      "character": "Prisoner #6"
    }
  ],
  "overview": "Young, charismatic, and hardworking, Sparra Farrell seems to be sailing into a happy, respectable life. He has a solid job and an adorable fiancée named Paula, and already owns a modest house in the country outside Melbourne. The only odd thing is that Sparra says precious little about his past — but that past is about to catch up with him, and wrest control of his present.",
  "storyline": "Set in Melbourne in the mid-1970s, Cut Snake tells the story of Sparra Farrell (Alex Russell), an ex-convict who is trying to make a new life for himself in a new city. He has found honest work and even becomes engaged but the prospect of this new life is challenged when his foreboding and charismatic cell mate Pommie (Sullivan Stapleton) tracks him down upon his own release. Sparra finds himself enigmatically drawn back toward a world and a man that he was certain he had wanted to leave behind.",
  "plot": "A sword is forged by a blacksmith, who then shows it to his young son, Conan, as he tells him of the \"Riddle of Steel\", an aphorism on the importance of the metal to their people, the Cimmerians. One day, the Cimmerians are massacred by a band of warriors led by Thulsa Doom; Conan's father is killed by dogs, and his sword is taken by Doom to decapitate Conan's mother. The children are taken into slavery and then chained to a large mill, the Wheel of Pain. Conan survives into adulthood, building his muscles after years of pushing the heavy grindstone. His master eventually trains him to be a gladiator; after winning many pit fights and receiving training and education in the East, Conan is freed. He soon stumbles upon a warrior's tomb and retrieves a fine sword. He then encounters a prophetic witch and befriends Subotai, a thief and archer.\n\nFollowing the witch's advice, Conan and Subotai go to the city of Zamora to seek out Doom. There they meet Valeria, a female brigand. They burgle the Tower of Serpents, stealing jewels and other valuables from a shrine, slaying a giant snake in the process. After escaping with their loot, the thieves celebrate, and Conan and Valeria become lovers. The city guards capture the trio and bring them to King Osric, who requests they rescue his daughter — now a zealot in Doom's cult — for a handsome reward. Subotai and Valeria refuse to take up the quest; Conan, motivated by his hatred for Doom, sets off alone to the villain's Temple of Set.\n\nDisguised as a priest, Conan infiltrates the temple, but he is discovered, captured, and tortured. Doom lectures him on the power of flesh, which he demonstrates by compelling a girl to leap to her death. He then orders Conan crucified on the Tree of Woe. The barbarian is on the verge of death when he is discovered by Subotai and brought to the Wizard of the Mounds, who lives on a burial site for warriors and kings. The wizard summons spirits to heal Conan and warns that they will \"extract a heavy toll\", which Valeria is willing to pay. These spirits also try to abduct Conan, but he is restored to health after Valeria and Subotai fend them off.\n\nSubotai and Valeria agree to help Conan complete Osric's quest and infiltrate the Temple of Set. As the cult indulges in a cannibalistic orgy, the thieves attack and flee with the princess. Valeria is mortally wounded by Doom after he shoots a stiffened snake at her. She dies in Conan's arms and is cremated at the Mounds, where Conan prepares with Subotai and the wizard to battle Doom. By using booby-traps and exploiting the terrain, they manage to slay Doom's warriors when they arrive. Valeria reappears for a brief moment as a Valkyrie to save Conan from a mortal blow. After losing his men, Doom shoots a stiffened snake at the princess, but Subotai blocks the shot with his shield and the villain flees to his temple.\n\nConan sneaks back to the temple where Doom is addressing the members of his cult. He confronts Doom, who attempts to mesmerize him, but the barbarian resists and uses his father's recovered sword to behead his nemesis. After the disillusioned cultists disperse, Conan burns down the temple and returns the princess.",
  "synopsis": "Cut Snake is a tense, psychologically driven crime thriller in which one man discovers his biggest enemy to putting the past behind him may be only himself. Set in Melbourne in the mid-1970s, Cut Snake tells the story of Sparra Farrell (Alex Russell), an ex-convict who is trying to make a new life for himself in a new city. He has found honest work and even becomes engaged but the prospect of this new life is challenged when his foreboding and charismatic cell mate Pommie (Sullivan Stapleton) tracks him down upon his own release. Sparra finds himself enigmatically drawn back toward a world and a man that he was certain he had wanted to leave behind."
}