{
  "imdb_id": "tt2579952",
  "tmdb_id": "232580",
  "douban_id": null,
  "title": "The Good Life (2013)",
  "genres": [
    "Adventure",
    "Drama",
    "Romance"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "93 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm2604836",
      "name": "Jean Denizot"
    }
  ],
  "writer": [
    {
      "id": "nm2604836",
      "name": "Jean Denizot",
      "description": "scenario &"
    },
    {
      "id": "nm2212508",
      "name": "Frédérique Moreau",
      "description": "scenario"
    },
    {
      "id": "nm1771591",
      "name": "Catherine Paillé",
      "description": "collaboration"
    }
  ],
  "cast": [
    {
      "id": "nm2165214",
      "name": "Zacharie Chasseriaud",
      "character": "Sylvain"
    },
    {
      "id": "nm0098961",
      "name": "Nicolas Bouchaud",
      "character": "Yves"
    },
    {
      "id": "nm3851446",
      "name": "Jules Pélissier",
      "character": "Pierre"
    },
    {
      "id": "nm4296971",
      "name": "Solène Rigot",
      "character": "Gilda"
    },
    {
      "id": "nm0959897",
      "name": "Jean-Philippe Écoffey",
      "character": "François"
    },
    {
      "id": "nm0763022",
      "name": "Maya Sansa",
      "character": "Elena"
    },
    {
      "id": "nm0896631",
      "name": "Cédric Vieira",
      "character": "Eric"
    },
    {
      "id": "nm0875585",
      "name": "Christèle Tual",
      "character": "La mère"
    },
    {
      "id": "nm5795509",
      "name": "Nyal Doya",
      "character": "Musicien manouche"
    },
    {
      "id": "nm4853750",
      "name": "Calypso Buijtenhuijs",
      "character": "Fille marché 1"
    },
    {
      "id": "nm5795510",
      "name": "Marie Buijtenhuijs",
      "character": "Fille marché 2"
    },
    {
      "id": "nm0213488",
      "name": "Corinne Debonnière",
      "character": "Femme de la ferme"
    },
    {
      "id": "nm5795511",
      "name": "Jerry Tabary",
      "character": "Homme du marché"
    },
    {
      "id": "nm5795512",
      "name": "Thierry Véron",
      "character": "L'épicier"
    },
    {
      "id": "nm5795513",
      "name": "Marie Lemiale",
      "character": "Maryse"
    },
    {
      "id": "nm5795514",
      "name": "Samuel Denizot",
      "character": "Bébé"
    },
    {
      "id": "nm2184018",
      "name": "François Denizot",
      "character": "Le maraîcher"
    },
    {
      "id": "nm4426634",
      "name": "Clémence Dumon",
      "character": "Marjorie, la serveuse"
    },
    {
      "id": "nm5795515",
      "name": "Mathieu Martegoute",
      "character": "Petit garçon square"
    },
    {
      "id": "nm5795516",
      "name": "Fleur Sitruk",
      "character": "Voix journaliste       (voice)"
    }
  ],
  "overview": "Sylvain and Pierre have been running from the law ever since a custody battle with their mother pushed their father Yves into hiding ten years ago. But now that they’re older, the two brothers are road-weary and eager to take advantage of the perks of young adulthood. When the authorities discover their whereabouts, they are forced to move yet again and Pierre, the elder, disappears. Alone with his father on an island in the Loire River, Sylvain meets Gilda: his first girl, his first crush, and the first stop on his way to “the good life” – his own.",
  "storyline": "Yves is living in hiding with his sons, Sylvain and Pierre. Two years before, he had abducted them from their mother after a judge ruled against him. But the boys are growing up now, and constantly being on the run deprives them of their adolescent dreams. Hidden on an island in the Loire, Sylvain, the younger, meets Gilda: love at first sight... and they are on their way to the good life?",
  "plot": "In 2013, alien monsters called Kaiju emerge from an interdimensional portal called “The Breach” at the bottom of the Pacific Ocean. Over the course of 2 years, the kaiju wreak havoc upon coastal cities along the ring of fire, such as San Francisco, Sydney, Manila and Hong Kong. Humanity responds by constructing giant mecha called Jaegers, to combat the alien threat. Each Jaeger is co-piloted by two or more people, who share a mental link via a process called “Drifting” to share the mental stress of piloting the machine.\n\nIn 2020, Gipsy Danger, piloted by brothers Raleigh and Yancy Becket, defends Anchorage from a Kaiju named Knifehead. They leave their post, disobeying orders from Marshal Stacker Pentecost, in order to rescue a fishing boat, only for the Kaiju to ambush them, wrecking the Jaeger and killing Yancy. Raleigh manages to pilot Gipsy Danger alone, killing Knifehead, but quits the Jaeger Program. Several years later, the world governments decide to end funding for the continuous construction of Jaegers in favour of anti-Kaiju coastal walls, since Kaiju are appearing more frequently and Jaegers are being destroyed faster then they are built. The remaining Jaegers are relocated to Hong Kong under Pentecost’s command, who plans to destroy the Breach using a tactical nuclear weapon.\n\nPentecost tracks down Raleigh to a wall construction site to recruit him for the assault, though Raleigh still remains traumatised by Yancy’s death. Travelling to the Hong Kong base, the Shatterdome, Raleigh is introduced to Mako Mori, the director of the Jaeger’s restoration program and Pentecost’s adoptive daughter. Four Jaegers remain in operation – the refurbished Gipsy Danger, the Russian Cherno Alpha, Chinese Crimson Typhoon, and the Australian Striker Eureka, piloted by father and son Herc and Chuck Hansen. To find a new co-pilot, Raleigh participates in tryouts, deciding Mako is “drift-compatible”. During their first test, Raleigh falls out of alignment reliving Yancy’s death, causing Mako to become lost in the memory of the Kaiju attack on Tokyo that orphaned her, nearly firing Gipsy’s energy cannon. Pentecost grounds both pilots.\n\nPentecost consults Kaiju experts Newton Geiszler and Herman Gottlieb. Hermann claims the Breach will stabilise and the Kaiju will increase in number, but it will allow the assault to succeed, while Newton suggests attempting to drift with a Kaiju’s brain to learn more about them, but is dismissed by his colleagues. Newton attempts it regardless, discovering Kaiju are bioweapons grown by alien colonists. Pentecost instructs Newton to find black market dealer Hannibal Chau to obtain another Kaiju brain to drift with it. Newton realises the Kaiju hive mind gained access to his brain, since drifting is a two-way link, and two new Kaiju, Leatherback and Otachi, are sent simultaneously to find him.\n\nAll Jaegers save Gipsy Danger are dispatched to intervene. The Kaiju destroy Crimson Typhoon and Cherno Alpha and kill their pilots, while Leatherback paralyzes Striker Eureka with an EMP blast. Pentecost sends Gipsy Danger to help, the only Jaeger powered by a nuclear reactor while the others are digital. Gipsy kills Leatherback and Otachi shortly after during her search for Newton. Newton and Hannibal go to harvest Otachi’s secondary brain, discovering she is pregnant. The infant Kaiju bursts out, devours Hannibal, before choking on its own umbilical cord. Newton and Hermann drift with the infant’s brain, discovering the Breach only opens in the presence of a Kaiju’s DNA.\n\nPentecost reveals to Raleigh he has terminal cancer due to piloting a first-generation Jaeger which lacked radiation shielding. The last time he piloted a Jaeger was in the Tokyo attack, during which he was forced to kill the Kaiju alone, making him and Raleigh the only pilots who have piloted a Jaeger without a copilot (known as solo combat). Two new Kaiju are detected guarding the Breach, prompting Gipsy and Striker, piloted by Pentecost and Chuck, to go ahead with the assault. Approaching the Breach, the Jaegers are attacked by the Kaiju, and a new “Category Five” Kaiju, Slattern, leading to Striker being crippled. Learning the truth from Newton and Hermann, Pentecost and Chuck decide to sacrifice Striker while Gipsy acts as the nuclear bomb to seal the Breach. After Striker self-destructs, Gipsy slaughters the Kaiju, riding Slattern’s corpse into the Breach. Raleigh removes Mako from Gipsy, manually causing Gipsy to self-destruct, escaping before it explodes and seals the Breach.",
  "synopsis": null
}