{
  "imdb_id": "tt2646540",
  "tmdb_id": "251564",
  "douban_id": null,
  "title": "Estudiar en primavera (2014)",
  "genres": [
    "Documentary",
    "Drama",
    "Musical",
    "News"
  ],
  "country": "Spain",
  "version": [
    {
      "runtime": "53 min",
      "description": ""
    }
  ],
  "imdb_rating": 9.2,
  "director": [
    {
      "id": "nm4175147",
      "name": "Amparo Fortuny"
    }
  ],
  "writer": [
    {
      "id": "nm4175147",
      "name": "Amparo Fortuny",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm3524304",
      "name": "Klaus and Kinski",
      "character": "Ley y Moral (music video)       (archive footage)"
    }
  ],
  "overview": null,
  "storyline": "The documentary delves into the world of a group of teenagers whose protests in defense of Public Education triggered the so-called Valencian Spring. It was the very first experience of protest for many of them and lead to their crash with reality. Not only did these teenagers become the symbol of the student protests throughout Spain; they also became a reflection of the youth's disenchantment facing an uncertain future in a country where the austerity policies are beginning to seriously affect society. In the documentary we find testimonials from students from 13 to 19 years of age with shocking images of the demonstrations together with foregrounds of the young protagonists enduring police charges and the destruction of children icons (dolls, balloons, cakes and confetti, etc..)",
  "plot": null,
  "synopsis": "The documentary delves into the world of a group of teenagers whose protests in defense of Public Education triggered the so-called Valencian Spring. It was the very first experience of protest for many of them and lead to their crash with reality. Not only did these teenagers become the symbol of the student protests throughout Spain; they also became a reflection of the youth's disenchantment facing an uncertain future in a country where the austerity policies are beginning to seriously affect society.In the documentary we find testimonials from students from 13 to 19 years of age with shocking images of the demonstrations together with foregrounds of the young protagonists enduring police charges and the destruction of children icons (dolls, balloons, cakes and confetti, etc..)When the revolution is triggered by 15 year old kids, blossom tales as pleasant, tender and critique as these."
}