{
  "imdb_id": "tt2615584",
  "tmdb_id": "222430",
  "douban_id": null,
  "title": "Phata Poster Nikhla Hero (2013)",
  "genres": [
    "Action",
    "Comedy"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "146 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.9,
  "director": [
    {
      "id": "nm0764316",
      "name": "Rajkumar Santoshi"
    }
  ],
  "writer": [
    {
      "id": "nm0764316",
      "name": "Rajkumar Santoshi",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1372788",
      "name": "Shahid Kapoor",
      "character": "Vishwas Rao"
    },
    {
      "id": "nm2299825",
      "name": "Ileana D'Cruz",
      "character": "Kajal"
    },
    {
      "id": "nm0464075",
      "name": "Padmini Kolhapure",
      "character": "Savitri"
    },
    {
      "id": "nm0864608",
      "name": "Mukesh Tiwari",
      "character": "Yeshwant Rao /              Napolean"
    },
    {
      "id": "nm1189762",
      "name": "Darshan Jariwala",
      "character": "Shivanand Khare"
    },
    {
      "id": "nm0795661",
      "name": "Saurabh Shukla",
      "character": "Gundappa Das"
    },
    {
      "id": "nm1664541",
      "name": "Zakir Hussain",
      "character": "Deepak Ghorpade"
    },
    {
      "id": "nm0592799",
      "name": "Sanjay Mishra",
      "character": "Guruji"
    },
    {
      "id": "nm1429165",
      "name": "Shiva Natrajan",
      "character": "Dr. Vinod Khanna"
    },
    {
      "id": "nm1021129",
      "name": "Rana Jung Bahadur",
      "character": "Villager"
    },
    {
      "id": "nm3872436",
      "name": "Prateek",
      "character": ""
    },
    {
      "id": "nm6173661",
      "name": "Ishtiyaq",
      "character": ""
    },
    {
      "id": "nm5199669",
      "name": "Vishwanath",
      "character": ""
    },
    {
      "id": "nm0025627",
      "name": "Tinnu Anand",
      "character": "Director"
    },
    {
      "id": "nm3721677",
      "name": "Vishwanath Chatterjee",
      "character": "Vishwanath"
    },
    {
      "id": "nm0154218",
      "name": "Mithilesh Chaturvedi",
      "character": "Biscuit"
    },
    {
      "id": "nm5023700",
      "name": "James Crabtree",
      "character": "Detective"
    },
    {
      "id": "nm3258670",
      "name": "Pratik Dixit",
      "character": "Father Anthony Gonzalves"
    },
    {
      "id": "nm3668216",
      "name": "Nargis Fakhri",
      "character": "Dancer"
    },
    {
      "id": "nm2093242",
      "name": "Vijay Gupta",
      "character": ""
    },
    {
      "id": "nm0006795",
      "name": "Salman Khan",
      "character": "Salman Khan"
    },
    {
      "id": "nm0451864",
      "name": "Viju Khote",
      "character": "Borkar"
    },
    {
      "id": "nm3390124",
      "name": "Talib Mehdi",
      "character": "Inspector"
    },
    {
      "id": "nm2562720",
      "name": "Navin Prabhakar",
      "character": "Vishwas's Friend"
    },
    {
      "id": "nm0728262",
      "name": "Mukesh Rishi",
      "character": ""
    }
  ],
  "overview": "Vishwas, an aspiring actor, is mistaken for an inspector while dressed for a photo shoot.",
  "storyline": "After Vishwas Rao (Shahid Kapoor) is raised by his Mother (Padmini Kolhapure), who apparently dreams of him becoming a Police Inspector. However, he has different plans in mind. Vishwas wants to become a film star. In Mumbai, after helping out a social-worker, Kajal (Ileana D'Cruz), whilst dressed as an Police Inspector for a photo shoot, she mistakes him as an Inspector, and he eventually plays along. Suddenly her mother arrives in Mumbai. How will Vishwas get rid of his troubles?",
  "plot": "Savitri Rao (Padmini Kolhapure), a widow, hopes that her only son, Vishwas (Shahid Kapoor) will grow up to be a brave Inspector. But Vishwas wants to become an actor. Dressed as a Police Inspector for a photo shoot, he meets social worker Kajal (Ileana D'Cruz) during a car chase. Kajal mistakes him as an inspector and thanks him for helping her catch the goons, while Vishwas plays along. He is mistakenly published in the newspaper as an Inspector, which Savitri sees. She arrives in Mumbai to see her dream come true, and circumstances lead Vishwas to carry on his lie not only to Kajal, but also to his mother.\n\nWhile shooting for a film, Vishwas's mother comes to know that he is not an inspector. She faints and is admitted in the hospital, where the doctor tells him that she needs to be operated and the amount required is rupees ten lakhs. He agrees to work for Gundappa (Saurabh Shukla) (the boss of the goons Vishwas and Kajal caught) for money where he needs to bring a CD for them. While escaping after getting the CD he is caught by police and accidentally shoots two police officers. Since he became a murderer he was left with no other choice than to join Gundappa's gang. Meanwhile, Kajal, who is under the impression that Vishwas has gone bad, along with some men plans to save him from doing any crime. So they go to the gangs den purposely and tells the foolish Gundappa that she came to marry Vishwas. Hence, creating a confusion so that Gundappa leaves Vishwas. On the other hand, Joint Commissioner (Darshan Jariwala) (who was also kidnapped) tells Savitri that Vishwas is actually not doing any crime rather is working for the police. Kajal knows this from Savitri later and goes to apologise to Vishwas for misunderstanding him. Not knowing that they are being watched on CCTV, she apologises to Vishwas and leakes details of his plans. Somehow, Vishwas and his mates are able to flee. But his mother and Kajal are held by Napoleon (Mukesh Tiwari) (the ultimate Don, boss of Gundappa). After fighting the goons, Vishwas hands over Napoleon (who is earlier revealed to be his own father) to the police and tells everyone that he will become a police officer as they are real life heroes. He did all the filmy actions as a fake police officer now he wanted to be a real police man and do his duty for his country and his mother's dreams finally fulfilled.",
  "synopsis": null
}