{
  "imdb_id": "tt2668670",
  "tmdb_id": "278387",
  "douban_id": null,
  "title": "Love Thing (2012)",
  "genres": [
    "Comedy",
    "Fantasy",
    "Musical"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "91 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.0,
  "director": [
    {
      "id": "nm4374972",
      "name": "Michael Mannetta"
    }
  ],
  "writer": [
    {
      "id": "nm4374972",
      "name": "Michael Mannetta",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0478636",
      "name": "Joaquin La Habana",
      "character": "Chi-Chi"
    },
    {
      "id": "nm1133729",
      "name": "Ray Matthews",
      "character": "Bill"
    },
    {
      "id": "nm5571932",
      "name": "Joseph Montalbo",
      "character": "Junior"
    },
    {
      "id": "nm0808542",
      "name": "Jack Smith",
      "character": ""
    }
  ],
  "overview": "Love Thing captures the emerging multicultural spirit and personal freedom of the late 1970s with an outrageous attitude and experimental style. A work in progress now finally completed it's the last American musical comedy from that era which can be viewed today as a prophetic satire. Through its provocative, entertaining storyline highlighted by song and dance, the movie answers the burning question of our time, \"What happens after the marriage?",
  "storyline": "Channels change on an old television set. Are we watching a nostalgic TV show or a funny American movie musical? Yes, it's reality TV from the past. Your average Latina housewife, Chi-Chi, is suffering from a sexless marriage while husband, Bill, is more annoyed by their lack of communication. Their middle class suburban life begins to unravel through musical fantasies and flashbacks. The gay son, Junior, suggests she call a self-help guru, Mr. Loveboy, who guarantees to transform her into an 'ultimate woman, fabulous housewife.' After-work in a bar, Bill has a strange daydream that awakens the 'man' in him and returns home for a big surprise. But is this family living in the real world or on TV, for an audience or themselves? .",
  "plot": "Nam is a bespectacled, swarthy girl who has a crush on P'Shone (also known as Shone), a popular student in her high school, but she feels that he is too handsome for her. Helped by her three friends, Nam follows the advice of the guidebook Nine Recipes of Love, which supposedly has the magical power to win affection from the boy of choice. The nine steps require Nam to beautify herself by switching her glasses with contacts, wearing teeth braces, and whitening her skin, as well as secretly leaving a chocolate cake inside Shone's motorbike, though all of them seems futile in attracting his attention. Nam also has an additional pursuit of going to the United States, where her father works; he promises to Nam and her sister a plane ticket for whoever gets the top grade in school.\n\nAfter getting into a fight with the influential Faye, Nam and her friends are unable to enter the Thai dance club and forced to register in the unpopular English drama club for the school fair. Nam is selected to play Snow White in the titular play, while Shone works as an stage painter. Thanks to the drama, Nam instantly becomes a hot issue within the school, and her popularity further explodes when she is chosen as the drum major of the school parade.\n\nDuring the second year, Shone's childhood friend, Top, transfers to the school. He falls in love at first sight with Nam and declares his love for her. The shocked Nam does not respond for fear of hurting him, so Top thinks that she accepts the confession. Nam is uncomfortable with the situation, especially when Top kisses her suddenly when the two are attending a friend's birthday party, during which Top shares the story about a promise he made with Shone: that they would never like the same girl. Meanwhile, Nam's increasingly close relationship with Top, Shone, and their associates has distanced her from her three old friends; the four barely talk with each other anymore as they enter their third year.\n\nUnable to repress her emotions, Nam breaks up with Top shortly before the finals, in which she ranks first, making her able to settle in the United States. She then has a tearful reconciliation with her old friends, who help her to do the \"10th recipe\" of the love guidebook: direct confession. However, to her dismay, Shone reveals that he is dating Pin, a mutual friend. That night, Shone comes home to find out that he is accepted into a trainee program in a professional soccer team, and has to leave for the camp the following morning. He goes into his room and takes out a diary containing all of Nam's photos; Shone has always loved Nam, even before her transformation, but never manages to gain the courage to confess. He leaves the diary in front of Nam's house; at the same time, Nam is shown mourning his rejection in her bedroom.\n\nNine years later, Nam and Shone have become successful fashion designer and photographer, respectively. Nam returns back to Thailand to attend a variety show. She gets a surprise visit by Shone, who reveals that he has been waiting for her after all those years.",
  "synopsis": null
}