{
  "imdb_id": "tt2638104",
  "tmdb_id": "191741",
  "douban_id": null,
  "title": "Biriyani (2013)",
  "genres": [
    "Action",
    "Comedy",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "148 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm1862815",
      "name": "Venkat Prabhu"
    }
  ],
  "writer": [
    {
      "id": "nm1862815",
      "name": "Venkat Prabhu",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1912683",
      "name": "Karthi",
      "character": "Sugan"
    },
    {
      "id": "nm1394426",
      "name": "Hansika Motwani",
      "character": "Priyanka"
    },
    {
      "id": "nm2908893",
      "name": "Premgi Amaren",
      "character": "Parasuram"
    },
    {
      "id": "nm1682953",
      "name": "Ramki",
      "character": "Vijay Ramakrishnan"
    },
    {
      "id": "nm3164309",
      "name": "Nitin Sathya",
      "character": "Hari"
    },
    {
      "id": "nm1360185",
      "name": "Madhumitha",
      "character": "Sugan's Sister"
    },
    {
      "id": "nm4029706",
      "name": "Mandy Takhar",
      "character": "Maya"
    },
    {
      "id": "nm0621937",
      "name": "Nassar",
      "character": "Varadharajan       (as Nasser)"
    },
    {
      "id": "nm1957308",
      "name": "V. Jayaprakash",
      "character": "AC Sampath"
    },
    {
      "id": "nm3164292",
      "name": "Sampath Raj",
      "character": "Riwaz Khan"
    },
    {
      "id": "nm3164348",
      "name": "Shanmuga Sundharam",
      "character": "Kasi"
    },
    {
      "id": "nm4082417",
      "name": "Subbu Panchu",
      "character": "Subbu       (as Panchu Subbu)"
    },
    {
      "id": "nm1428808",
      "name": "Uma Riyaz Khan",
      "character": "Police Inspector"
    },
    {
      "id": "nm3607395",
      "name": "Prem",
      "character": "Vikram"
    },
    {
      "id": "nm5097020",
      "name": "Badava Gopi",
      "character": "Gopi"
    },
    {
      "id": "nm6058821",
      "name": "Tharika",
      "character": ""
    },
    {
      "id": "nm5628626",
      "name": "Sam Anderson",
      "character": "Sam"
    },
    {
      "id": "nm0741429",
      "name": "Honey Rose",
      "character": "Shanthi"
    },
    {
      "id": "nm5897304",
      "name": "Leena Maria Paul",
      "character": "Sree Devi"
    },
    {
      "id": "nm6058820",
      "name": "Aadhavan",
      "character": "Sugan's Friend"
    },
    {
      "id": "nm5611699",
      "name": "Mithun",
      "character": "Kiran"
    },
    {
      "id": "nm0415773",
      "name": "Jai",
      "character": "Special Appearance"
    },
    {
      "id": "nm1525688",
      "name": "Aravind Akash",
      "character": "Special Appearance"
    },
    {
      "id": "nm3163817",
      "name": "Vaibhav Reddy",
      "character": "Special Appearance"
    },
    {
      "id": "nm3586481",
      "name": "Vijay Vasanth",
      "character": "Special Appearance"
    },
    {
      "id": "nm2320000",
      "name": "Vijayalakshmi",
      "character": "Special Appearance"
    }
  ],
  "overview": "Sugan, depressed after his break up with Priyanka Sharma, goes in search for biriyani with his buddy Parasuram after few drinks. But the search takes a big twist and the real journey of Biriyani begins.",
  "storyline": "Karthi (Sugan), is a playboy who seems to have had a style makeover with his trendy clothes, new hairstyle and colored eye lens. Despite having a gorgeous girlfriend Priyanka (Hansika), Sugan flirts with all the pretty women he meets and they too, are besotted by him. Sugan, on a journey with his childhood friend Parasu (Premji) stops at a roadside eatery for biriyani (food), his weakness. But they gets into a problem after having the dish.",
  "plot": "The movie starts with Sugan(Karthi) and his friend Parasuram(Premgi Amaren ) being chased by cops. The flashback shows Sugan as a playboy who has a weakness for Biryani and Parasuram who is his childhood friend. Sugans playboy attitude always gets him into a fight with his girlfriend Priyanka(Hansika Motwani). Sugan and Parasuram attending a function for branch opening of one of their offices where they meet Varadharajan(Nassar), who is the chief guest for the ceremony. In the meantime, its shown that a CBI officer Riyaz Khan (Sampath Raj) has been deputed to track Vardharajan's illegal activities. Varadharajan gets impressed with Sugan and decides later to make him his son-in law and this decision gets him into an argument with his other son in law Vijayakrishna(Ramki).\n\nVaradharajan later hosts a cocktail party and also invites Sugan and Parasuram where they get drunk. Sugan who has a weakness for Biriyani after getting drunk searches for a biriyani shop. There they both get to meet Maya. The very next day they find police cars searching for Varadharajan, who is missing. Meanwhile, Sugan and Parasuram find Varadharajan's dead body in their car trunk.They are blamed for Varadharajan's death and are chased by police which is the starting scene of the movie.\n\nSugan and Parasu go to their friend's house and Parasu sends a picture of Maya to his friends. The next day, one of their friend finds Maya at Egmore Railway Station. Sugan comes there and Maya tells the truth, that she put drugs in their drinks and a police officer is responsible. As Sugan tries to get more information, a female cop stops Maya from telling the truth and later kills her on the train tracks. Back at home, Sugan gets a message from the female cop which makes him realize that she is not even a police officer but an assassin. Her next victim is no one other than Varalakshmi, Sugan's sister. At the temple Sugan's friend, his brother-in-law and Varalakshmi are in a car accident and the female assassin captures Varalakshmi. Sugan gets a call from Vijayakrishna that he needs Varadharajan alive so that he can give Varalakshmi back to Sugan.\n\nSugan decides that Parasu should impersonate Varadharajan alive since the real Varadharajan is dead. He comes there with Parasu, but finds the assassin trying to kill Sugan. Vijayakrishna wants Varadharajan back but it was not him who called Sugan. Sugan and Vijaykrishna get into a fight along with Sampath who gets in a fight with the hit-woman. Another police officer ACP Vikram kills the female assassin and returns Varalakshmi safe. Three days later at Varadharajan's funeral Sugan tells the truth about Varadharajan's death. Avinash was in love with Varadharajan's daughter for money only but Sugan and Parasu stopped their love on the way to the new branch opening. Avinash uses his brother to get his love back by bringing Sugan and Parasu using Maya and that Maya used drugs to make Sugan and Parasu very drunk. Then the assassin comes by killing Maya so that she does not tell the truth to Sugan. Sugan figures out that it was no one other than ACP Vikram, Avinash's brother who had behind everything. Even Riyaz and Vijaykrishna also finds out the truth. Riyaz tells Sugan to kill ACP Vikram and Sugan fights with him and they both fall from the first floor to the ground.",
  "synopsis": null
}