{
  "imdb_id": "tt2671980",
  "tmdb_id": "228381",
  "douban_id": null,
  "title": "Broken Glass Park (2013)",
  "genres": [
    "Drama"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.9,
  "director": [
    {
      "id": "nm2037668",
      "name": "Bettina Blümner"
    }
  ],
  "writer": [
    {
      "id": "nm3422261",
      "name": "Katharina Kress",
      "description": "screenplay"
    },
    {
      "id": "nm5641955",
      "name": "Alina Bronsky",
      "description": "novel"
    }
  ],
  "cast": [
    {
      "id": "nm3672175",
      "name": "Jasna Fritzi Bauer",
      "character": "Sascha Naimann"
    },
    {
      "id": "nm0633947",
      "name": "Ulrich Noethen",
      "character": "Volker Trebur"
    },
    {
      "id": "nm3047086",
      "name": "Max Hegewald",
      "character": "Felix Trebur"
    },
    {
      "id": "nm0122095",
      "name": "Vladimir Burlakov",
      "character": "Peter"
    },
    {
      "id": "nm0514146",
      "name": "Jana Lissovskaia",
      "character": "Mascha       (as Jana Lissovskaja)"
    },
    {
      "id": "nm3622821",
      "name": "Cedric Koch",
      "character": "Anton"
    },
    {
      "id": "nm5449709",
      "name": "Lara Melina Siebertz",
      "character": "Alissa       (as Lara Siebertz)"
    },
    {
      "id": "nm2661864",
      "name": "Maria Dragus",
      "character": "Anna       (as Maria-Victoria Dragus)"
    },
    {
      "id": "nm0296291",
      "name": "Konstantin Frolov",
      "character": "Igor"
    },
    {
      "id": "nm3663396",
      "name": "Yung Ngo",
      "character": "Kevin"
    },
    {
      "id": "nm3407037",
      "name": "Michael Keseroglu",
      "character": "Murat"
    },
    {
      "id": "nm1521145",
      "name": "Piet Fuchs",
      "character": "Kioskbesitzer"
    }
  ],
  "overview": "Teenage Sascha has two dreams: to write a novel about her mother and to take revenge on her step-father who brutally murdered her. When she meets the newspaper editor Volker, he invites her to come to his and his son's place. A subtle love triangle begins which helps Sascha to find her personal way of growing up.",
  "storyline": "Seventeen-year-old Sascha Naimann comes to Germany from Russia when she was ten. She's very smart - and particularly good at maths - but has more than the usual coming-of-age difficulties to deal with. She has only one goal in mind: She wants to kill her stepfather Vadim. She wants retribution for what he did to her and her family. He shot their mother before her and her two little siblings' eyes. Sascha lives in an ugly high-rise housing estate and has her very own way, with the trauma. So she goes promptly into the offensive when an article is published in the newspaper, which puts the murderer of her mother in a positive light. She writes the responsible editor in a rage. As a compensation, he offers his house as temporary residence, on which a triangle between Sascha, the journalist and his son Felix.",
  "plot": "Troubled by a strange recurring dream and mourning the loss of her father, 19-year-old Alice Kingsleigh attends a garden party at Lord Ascot's estate. There she is confronted by an unwanted marriage proposal to Hamish Ascot and the stifling expectations of the society in which she lives. Unsure of how to proceed, she pursues a rabbit wearing a blue waistcoat and accidentally falls into a large rabbit hole under a tree. She emerges in a forest where she is greeted by the White Rabbit, the Dormouse, the Dodo, the Talking Flowers, and Tweedledee and Tweedledum. They argue over her identity as \"the right Alice\" who must slay the Red Queen's Jabberwocky and restore the White Queen to power, as foretold by Absolem the Caterpillar and his prophetic scroll. The group is then ambushed by the Bandersnatch and a group of playing-card soldiers led by the Knave of Hearts. Alice, Tweedledum and Tweedledee escape into the woods. The Knave steals the Caterpillar's scroll. The Dormouse leaves the others behind with one of the Bandersnatch's eyes in her possession. Tweedledum and Tweedledee are then captured by the Red Queen's Jubjub bird.\n\nThe Knave informs the Red Queen that Alice threatens her reign, and the soldiers and Bayard the Bloodhound are ordered to find Alice immediately. Meanwhile, the Cheshire Cat guides Alice to the March Hare and the Hatter. The Hatter helps Alice avoid capture by allowing himself to be seized instead. Later, Alice is found by Bayard the Bloodhound; but Alice insists upon helping the Hatter. At the Queen's citadel, the Red Queen is unaware of Alice's true identity and therefore welcomes her as a guest, named Um from Umbridge. Alice learns that the Vorpal Sword, the only weapon capable of killing the Jabberwock, is locked inside the den of the Bandersnatch. The Knave crudely attempts to seduce Alice, but she rebuffs him, and a jealous Red Queen orders Alice beheaded. Alice obtains the sword and befriends the Bandersnatch by returning its eye. She then escapes on the back of the grateful Bandersnatch and delivers the sword to the White Queen. The Cheshire Cat saves the Hatter from the executioner, and the Hatter calls for rebellion against the Red Queen. The rebellion is quickly put down by the Jubjub bird, but the resistance flees to the White Queen's castle, and both armies prepare for battle. Former caterpillar Absolem advises Alice to fight the Jabberwocky just before completing his transformation into a pupa.\n\nOn the appointed day, the White and Red Queens gather their armies on a chessboard-like battlefield and send Alice and the Jabberwocky to decide the battle in single combat. Encouraged by the advice of her late father, Alice fights the Jabberwocky among the ruins surrounding the battlefield and finally jumps from the remains of a spiral staircase onto the Jabberwocky's neck and beheads it. The White Queen sends the Red Queen and the Knave into exile. After the Hatter performs a celebration dance called Futterwacken, the White Queen gives Alice a vial of the Jabberwocky's purple blood whose power will bring her whatever she wishes. She decides to rejoin the everyday world. Back in England, Lord Ascot takes Alice as his apprentice with the idea of establishing oceanic trade routes to Hong Kong. As the story closes, Alice prepares to set off on a trading ship. A light-blue butterfly lands on her shoulder, and Alice recognizes him as Absolem.",
  "synopsis": null
}