{
  "imdb_id": "tt2679456",
  "tmdb_id": "311612",
  "douban_id": null,
  "title": "Boys Behind Bars (2013)",
  "genres": [
    "Drama"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "83 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm2563700",
      "name": "Jason Impey"
    }
  ],
  "writer": [
    {
      "id": "nm5083794",
      "name": "Wade Radford",
      "description": "concept"
    }
  ],
  "cast": [
    {
      "id": "nm1620124",
      "name": "Wade Radford",
      "character": "Darrell       (rumored)"
    },
    {
      "id": "nm5510130",
      "name": "Tama Phethean",
      "character": "Seth"
    },
    {
      "id": "nm5544017",
      "name": "Gavin Jackson",
      "character": "Lanks"
    },
    {
      "id": "nm5585119",
      "name": "James Whitehurst",
      "character": "Nico"
    }
  ],
  "overview": "Darrell is a well trained prison bitch looking forward to a night alone in his cell getting jacked on the drugs he's had smuggled in, when a riot erupts on the floors above. To separate the offenders, three of the inmates are placed in Darrell's cell. Always up for a laugh, Darrell teases, flirts and annoys his fellow cellies Seth &amp; Lanks, until a new boy is placed with them and becomes prey to these wild animals. Nothing short of offensive and disgusting, these boys are savage and hell bent on abusing, insulting, and degrading each other throughout the night. 4 Boys, One Room, &amp; Pure Hell in the Cell, this trashy British arthouse, throwback captures the reality of the 80s.",
  "storyline": "Darrell is a well trained prison bitch looking forward to a night alone in his cell getting jacked on the drugs he's had smuggled in, when a riot erupts on the floors above. To separate the offenders, three of the inmates are placed in Darrell's cell. Always up for a laugh, Darrell teases, flirts and annoys his fellow cellies Seth & Lanks, until a new boy is placed with them and becomes prey to these wild animals. Nothing short of offensive and disgusting, these boys are savage and hell bent on abusing, insulting, and degrading each other throughout the night. 4 Boys, One Room, & Pure Hell in the Cell, this trashy British arthouse, throwback captures the reality of the 80s",
  "plot": "This article's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (January 2017) (Learn how and when to remove this template message)\nIn 1993, alcoholic advertising executive Joe Doucett (Josh Brolin) goes on a drinking spree after ruining an important account by hitting on the client's girlfriend. While stuck outside in the rain, he spots a woman with a yellow umbrella, who takes him away before he passes out.\n\nHe awakens in an isolated, locked hotel room and finds that he is being held prisoner. His captors provide him with basic hygiene items and meagre portions of processed food and vitamin pills, along with a pint of vodka with every meal to prevent withdrawal, but do not provide reason for his imprisonment. Through a news bulletin on the TV in the room, Joe learns that his ex-wife Donna has been brutally raped and murdered, and he is the prime suspect. He also learns that his infant daughter Mia has been adopted.\n\nJoe tries to commit suicide, but his mysterious captors save his life. Joe starts writing Mia letters, gives up drinking, and spends the next 20 years planning his revenge. He gets in shape, becomes a skilled boxer by watching televised matches, and compiles a list of everyone who might be responsible for his imprisonment.\n\nIn 2013, Joe watches a grown Mia being interviewed by a TV show called Mysteries of Crime, and claiming she could try to forgive him if he returns. Suddenly, he is drugged and awakes in a trunk in a field, with money and a cell phone. He spots the woman with the yellow umbrella and chases after her. He does not find her but violently assaults several high school students in his way. He arrives at a nearby clinic where he meets Marie Sebastian (Elizabeth Olsen), a nurse who offers to help him. Joe refuses help but takes her card.\n\nHe later visits his old friend Chucky (Michael Imperioli) and tells him what happened. He receives a mocking phone call from the mastermind behind his imprisonment, the Stranger (Sharlto Copley). He investigates the potential suspects on his list, but finds they are all innocent. He eventually passes out from dehydration, and Chucky calls Marie, who gives Joe medical treatment.\n\nMarie reads the letters Joe has written for Mia and offers to help him. He threatens to assault Marie but she sticks with him, and with her help Joe is able to locate the Chinese restaurant that provided the food he was given in captivity. He follows a man who arrives to take a large order to an abandoned factory, which is where he was held captive.\n\nAfter killing a security guard Joe confronts the owner, Chaney (Samuel L. Jackson), and tortures him into giving him a taped conversation in which he discusses the terms of Joe's imprisonment with the Stranger. Joe is then forced to fight off all of Chaney's men, one of whom stabs him in the back. Joe is then returned to Chucky's bar, where he meets the Stranger himself and his bodyguard Haeng-Bok, the woman with the yellow umbrella, who has kidnapped Mia.\n\nThe Stranger offers Joe a proposition: if Joe is able to discover his real identity and his motives for imprisoning Joe in 46 hours, he will not only release Mia but also give Joe proof of his innocence along with $20 million in diamonds. He also promises to shoot himself in the head while allowing Joe to watch. After the Stranger leaves, Joe rushes to Marie's house to save her from Chaney and his men. Chaney sets up a table and gets ready to torture Joe before receiving a phone call from the Stranger, who offers him some money in exchange for Joe's release.\n\nMarie digitally identifies the Stranger's ringtone as being the theme song of Evergreen Academy, a prep school Joe attended. They visit the former Chancellor's house, where Marie distracts her while Joe enters through the back to look through the yearbook from the year he graduated. Looking through the names, Joe recognizes one, Adrian Doyle Pryce, and recalls tormenting his sister, Amanda, for her promiscuity. Joe sends the name to Chucky, who investigates the name on the internet.\n\nWhile visiting the school late at night, Joe remembers seeing Amanda having sex with an older man in the outside greenhouse, and spread the news throughout campus. The man was later revealed to be Adrian and Amanda's father, Arthur, who was having incestuous relationships with both of them. To escape the humiliation, Arthur moved the family to Luxembourg, but could not live down what he had done. Arthur then murdered his wife and Amanda, attempted to murder Adrian, and then committed suicide. Joe deduces that Adrian, the sole survivor, blamed him and swore revenge against him for humiliating and destroying the family. Chucky confirms that the Stranger is indeed Adrian Pryce and tries to call Joe, but Adrian, having cloned Joe's phone and hearing Chucky refer to his deceased sister as a whore, finds him and strangles him to death in a rage.\n\nJoe hides Marie in a motel, where they have sex, while Adrian watches on a camera. Joe later goes to Adrian's penthouse, kills Haeng-Bok, and answers his questions. Adrian congratulates Joe on discovering the truth. He keeps his word, giving him the diamonds and starts taking him to see Mia. Along the way, Adrian tells Joe he is surprised that he hasn't asked another crucial question: \"Why did I let you go?\" He shows Joe a studio, in which the crime show Joe watched in prison was shot, revealing that it was all fake.\n\nJoe then happily sees Mia playing her cello in another room. Adrian then reveals to Joe that \"Mia\" is actually an actress on his payroll and, while playing a slideshow full of pictures and videos, Joe's real daughter is revealed to actually be Marie, having changed her name and background through 20 years. Horrified by what Adrian has engineered him to do, Joe begs for death, but Adrian refuses, saying that he needs to experience this moment so Joe could truly understand what he had lost. His revenge exacted, Adrian keeps his last promise, and shoots himself in the head in front of a visibly shaken Joe. Joe writes Marie a letter, stating they can never meet again and that he loves her, and leaves her all but a few of the diamonds, the rest of which he gives to Chaney in exchange for returning him to captivity—supposedly for the rest of his life.",
  "synopsis": null
}