{
  "imdb_id": "tt2632308",
  "tmdb_id": "307631",
  "douban_id": null,
  "title": "God Loves the Fighter (2013)",
  "genres": [
    "Crime",
    "Drama"
  ],
  "country": "Trinidad and Tobago",
  "version": [
    {
      "runtime": "104 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.1,
  "director": [
    {
      "id": "nm4222368",
      "name": "Damian Marcano"
    }
  ],
  "writer": [
    {
      "id": "nm2373764",
      "name": "Alexa Bailey",
      "description": "co-writer"
    },
    {
      "id": "nm4222368",
      "name": "Damian Marcano",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm2544320",
      "name": "Darren Cheewah",
      "character": "Putao"
    },
    {
      "id": "nm5469506",
      "name": "Zion Henry",
      "character": "Chicken"
    },
    {
      "id": "nm5470160",
      "name": "Simon Junior John",
      "character": "Moses"
    },
    {
      "id": "nm1195270",
      "name": "Albert Laveau",
      "character": "Mr. Odrick"
    },
    {
      "id": "nm5469151",
      "name": "Lou Lyons",
      "character": "King Curtis"
    },
    {
      "id": "nm4628258",
      "name": "Muhammad Muwakil",
      "character": "Charlie"
    },
    {
      "id": "nm5469489",
      "name": "Jamie Lee Phillips",
      "character": "Dinah"
    },
    {
      "id": "nm5469351",
      "name": "Tyker Phillips",
      "character": "Nina"
    },
    {
      "id": "nm3311806",
      "name": "Penelope Spencer",
      "character": "Chicken's Mother"
    },
    {
      "id": "nm5470182",
      "name": "Abdi Waithe",
      "character": "Stone"
    },
    {
      "id": "nm5469112",
      "name": "Jaleel Waithe",
      "character": ""
    }
  ],
  "overview": "TRINIDAD - King Curtis, a vagrant on the streets of Port of Spain, is constantly ignored by passersby. He speaks and if he has to - sometimes shouts the truth about the stories behind the newspaper headlines. As the conductor of our story, King Curtis introduces us to a young man named Charlie...  Charlie, a resident east of the lighthouse, is trying his best to stay on the right path. However, with no job in sight, he is finding it hard to say no to other \"opportunities\". A chance of redemption presents itself when Dinah, a professional streetwalker, crosses his path in need of help.  As the story unfolds, King Curtis reveals the ripple effect created by a person's decision making; leading to moments of triumph and moments of tragedy.  'God Loves The Fighter' is a feature film. Set and filmed in Trinidad, W.I.",
  "storyline": "TRINIDAD - King Curtis, a vagrant on the streets of Port of Spain, is constantly ignored by passersby. He speaks and if he has to - sometimes shouts the truth about the stories behind the newspaper headlines. As the conductor of our story, King Curtis introduces us to a young man named Charlie... Charlie, a resident east of the lighthouse, is trying his best to stay on the right path. However, with no job in sight, he is finding it hard to say no to other \"opportunities\". A chance of redemption presents itself when Dinah, a professional streetwalker, crosses his path in need of help. As the story unfolds, King Curtis reveals the ripple effect created by a person's decision making; leading to moments of triumph and moments of tragedy.",
  "plot": null,
  "synopsis": null
}