{
  "imdb_id": "tt2609758",
  "tmdb_id": "175555",
  "douban_id": null,
  "title": "A Madea Christmas (2013)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "100 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.7,
  "director": [
    {
      "id": "nm1347153",
      "name": "Tyler Perry"
    }
  ],
  "writer": [
    {
      "id": "nm1347153",
      "name": "Tyler Perry",
      "description": "screenplay"
    },
    {
      "id": "nm1347153",
      "name": "Tyler Perry",
      "description": "based on the stage play \"A Madea Christmas\" written by"
    }
  ],
  "cast": [
    {
      "id": "nm1347153",
      "name": "Tyler Perry",
      "character": "Madea"
    },
    {
      "id": "nm0395428",
      "name": "Anna Maria Horsford",
      "character": "Eileen"
    },
    {
      "id": "nm1754366",
      "name": "Tika Sumpter",
      "character": "Lacey"
    },
    {
      "id": "nm0515123",
      "name": "Eric Lively",
      "character": "Conner"
    },
    {
      "id": "nm3818357",
      "name": "JR Lemon",
      "character": "Oliver"
    },
    {
      "id": "nm1249256",
      "name": "Larry the Cable Guy",
      "character": "Buddy"
    },
    {
      "id": "nm0001562",
      "name": "Kathy Najimy",
      "character": "Kim"
    },
    {
      "id": "nm0614877",
      "name": "Chad Michael Murray",
      "character": "Tanner"
    },
    {
      "id": "nm0001860",
      "name": "Alicia Witt",
      "character": "Amber"
    },
    {
      "id": "nm4776683",
      "name": "Noah Urrea",
      "character": "Bailey"
    },
    {
      "id": "nm0924075",
      "name": "Lisa Whelchel",
      "character": "Nancy Porter"
    },
    {
      "id": "nm6131734",
      "name": "Caroline Kennedy",
      "character": "Lucy"
    },
    {
      "id": "nm4152547",
      "name": "Julie Ann Doan",
      "character": "Customer 1"
    },
    {
      "id": "nm1304777",
      "name": "Vickie Eng",
      "character": "Customer 3"
    },
    {
      "id": "nm3077188",
      "name": "Whitney Christopher",
      "character": "Supervisor"
    },
    {
      "id": "nm0092906",
      "name": "Steve Boles",
      "character": "Mayor"
    },
    {
      "id": "nm2349949",
      "name": "Brooke Jaye Taylor",
      "character": "Parent 1"
    },
    {
      "id": "nm0152592",
      "name": "Clay Chappell",
      "character": "Parent 2"
    },
    {
      "id": "nm6131735",
      "name": "Heather Moore",
      "character": "Reporter"
    },
    {
      "id": "nm5721863",
      "name": "Sweet Brown",
      "character": "Sweet Brown"
    },
    {
      "id": "nm3237083",
      "name": "Ashlee Heath",
      "character": "Audry"
    },
    {
      "id": "nm5941266",
      "name": "Maddie Compton",
      "character": "Milly"
    },
    {
      "id": "nm2360398",
      "name": "Michael H. Cole",
      "character": "Business Owner       (as Michael Hyland Cole)"
    },
    {
      "id": "nm0360593",
      "name": "Bart Hansard",
      "character": "Country Lawyer"
    },
    {
      "id": "nm1170394",
      "name": "Jonathan Chase",
      "character": "Man"
    },
    {
      "id": "nm4135756",
      "name": "Antoine Dodson",
      "character": "YouTube Guy"
    },
    {
      "id": "nm4963906",
      "name": "Mike Davidson",
      "character": "Country Store Owner"
    },
    {
      "id": "nm6131736",
      "name": "Warren Barfield",
      "character": "Band"
    },
    {
      "id": "nm6131737",
      "name": "Doug Price",
      "character": "Band"
    },
    {
      "id": "nm6131738",
      "name": "Adam Silverman",
      "character": "Band"
    },
    {
      "id": "nm6131739",
      "name": "Travis Terrell",
      "character": "Band"
    },
    {
      "id": "nm6131740",
      "name": "Ana Rodriguez",
      "character": "Choir Singer"
    },
    {
      "id": "nm6131741",
      "name": "Diego Wren",
      "character": "Choir Singer"
    },
    {
      "id": "nm6131742",
      "name": "Emma Callicutt",
      "character": "Choir Singer"
    },
    {
      "id": "nm6131743",
      "name": "Evie Brady",
      "character": "Choir Singer"
    },
    {
      "id": "nm6131744",
      "name": "Evie Richardson",
      "character": "Choir Singer"
    },
    {
      "id": "nm6131745",
      "name": "Gideon Davinsky",
      "character": "Choir Singer"
    },
    {
      "id": "nm6131746",
      "name": "Isabelle Hanna",
      "character": "Choir Singer"
    },
    {
      "id": "nm6131747",
      "name": "Keith Tinaglia",
      "character": "Choir Singer"
    },
    {
      "id": "nm6131748",
      "name": "Lily Kostka",
      "character": "Choir Singer"
    },
    {
      "id": "nm6131749",
      "name": "Matthew Boulis",
      "character": "Choir Singer"
    },
    {
      "id": "nm6131750",
      "name": "Sam Henderson",
      "character": "Choir Singer"
    }
  ],
  "overview": "Madea dispenses her unique form of holiday spirit on rural town when she's coaxed into helping a friend pay her daughter a surprise visit in the country for Christmas.",
  "storyline": "Madea gets coaxed into helping a friend pay her daughter a surprise visit in the country for Christmas, but the biggest surprise is what they'll find when they arrive. As the small, rural town prepares for its annual Christmas Carnival, new secrets are revealed and old relationships are tested while Madea dishes her own brand of Christmas Spirit to all.",
  "plot": "This article's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (August 2015) (Learn how and when to remove this template message)\nIn Atlanta, Georgia Mabel \"Madea\" Simmons (Tyler Perry) has been talked into getting a job at a local store by her great-niece Eileen Murphy (Anna Maria Horsford). Madea gets fed up with the customers and starts speaking rudely, causing herself to get fired on her first day. She then asks for her paycheck, but her boss tells her they will mail it. Infuriated, Madea steals a dress and some money from the cash register, then leaves.\n\nMeanwhile, Eileen's daughter, Lacey Williams (Tika Sumpter), who is working as a teacher at a small school in Alabama, has many problems on her hands: the school does not have enough money to fund its annual Christmas Jubilee. This angers the townsfolk, thus pressuring Lacey to have her ex-boyfriend, Oliver (JR Lemon), fund the school through his business. Lacey also wants one of her students, Bailey McCoy (Noah Urrea) to sing in the Christmas Jubilee. Stuck with many issues to deal with, she tells her mother that she will not be able to come home for Christmas. Eileen, determined to see her daughter for Christmas, decides to pay Lacey a surprise visit. She brings Madea, who is hesitant at first, with her, and has Oliver, who is on his way with a contract for the sponsorship, as their ride, as Eileen feels that Lacey and Oliver could still be a couple. The trio then head to Alabama, where Lacey lives. Following a short run-in with the Ku Klux Klan, the trio eventually make it to Alabama. This makes things awkward, since Lacey was not expecting her mother to come see her, and Eileen has never wanted Lacey to marry a white man. Lacey is married to a white man named Connor Williams (Eric Lively), and has made her mother believe that Connor is the \"farm help\" at her house.\n\nLacey goes to the meeting with the school principal, Oliver, and the town mayor to go over the contract for Oliver's representatives' sponsorship of the jubilee. While she is out, Madea looks after Lacey's class. Bailey walks into the class late and tells Madea his name. The class bully, who Bailey usually sits next to, tells him not to sit next to her due to the fact that he is very dirty from helping his father, Tanner McCoy (Chad Michael Murray), a man who has bullied Lacey's husband Connor ever since they were both children, work on their farm before school. Another girl tells Bailey that he better hope that Lacey comes back because she is the only teacher at the school who likes him. Madea tells the two girls to knock it off and that they need to learn to be nicer to people. When Madea turns around to write her name on the chalkboard, the class bully steals her purse. Madea tells the students a modern day version of the story of the first Christmas, in order to keep the class busy. When Madea realizes that someone stole her purse, she tries to then tell the children the story of Easter, but then loses her temper half way through the story and demands that somebody find her purse. Meanwhile, with the contract glazed over and signed, the town and school now have the money they need. Lacey then prepares to return to her class, but is interrupted by Oliver, who gives her a kiss. While she tries to tell Oliver that she is married and is not interested in getting back together with him, her and the principal discover that Madea has tied the girl that stole her purse to the cross decoration in the classroom.\n\nConnor's parents, Buddy (Larry the Cable Guy), and Kim (Kathy Najimy), arrive at Connor and Lacey's house, as they have come to visit him for Christmas and are told that they must not mention that he and Lacey are married, as they do not know that Eileen has never wanted Lacey to marry a white man. Meanwhile, Eileen decides to get a Christmas tree and cuts down a tree with a yellow ribbon wrapped around it in the backyard, not knowing that Kim planted the tree in memory of her deceased father. The family soon realizes that Eileen cut down Kim's tree, upsetting Kim. That night, Eileen walks in on Buddy and Kim, seeing Buddy with a sheet over his head, convincing her that Buddy is in the KKK. Now scared, she bars the door to the room that she and Madea are sharing, resulting in Madea telling her to remove it, because she has to go to the bathroom several times at night.\n\nThe next day, Eileen still thinks that Buddy and Kim are in the KKK, and does not let Kim help her cook meals. While helping Connor with the farm animals, Madea reveals to Connor and Buddy that she has secretly discovered the secret that Connor and Lacey are hiding. However, she does not know that they are married. When Connor tells Madea that Lacey is planning to tell Eileen about their marriage on Christmas day, Madea says that Eileen is going to be very upset when she finds out the truth.\n\nWhile at the school that same day, it is discovered by the mayor and several towns people - including Tanner McCoy - that Oliver's representatives require that if they are going to sponsor the jubilee, it must be a holiday jubilee. This means that there may not be any references to Jesus, God, or the Bible.\n\nThe company that is sponsoring the event is Sheldon Construction Company, which caused the jobs of many of the citizens in the town to end. Angered at these facts, Tanner and the other citizens convince the mayor to fire Lacey. This upsets Bailey, and he complains about it to his mother and yells about it to his father. Tanner does not take what Bailey says into consideration, saying that Lacey made a deal with the devil. Tanner's wife tells him that he is acting more like the devil himself.\n\nLater that day, Lacey and Connor's parents clash. Buddy and Kim become offended by the fact that Eileen thought that they were in the KKK. Kim threatens to cut Eileen's finger off, which causes Eileen to try and kick Connor's parents out of the house. Madea forces Lacey to confess the truth to her mother. Madea reveals that Eileen despises white people because her husband left her for a white woman when Lacey was 2 years old; she has lied about the story and said that a white man killed her husband. She also reveals that Eileen lied to Lacey about a heart attack that she had the previous year; when Madea and Eileen arrived at the hospital, the doctor told Eileen that nothing was wrong with her and that she just had gas. Angered by the lies, Eileen packs her bags and sits outside of the house, hoping for a taxi to come by and pick her up. Buddy, Kim, and Madea come outside with a cup of hot chocolate, tell Eileen that it is very cold outside and try to convince her to come back into the house and get to know them and Connor, but to no avail. The three give up on Eileen, resulting in her deciding to walk into town and take a bus back to Atlanta.\n\nConnor walks into he and Lacey's bedroom and finds Lacey sitting on the bed and thinking about all of the things that have happened to her that day. Lacey reveals to Connor what Tanner did to her earlier that day, which sets Connor off. Connor storms out of the house in a fit of rage, gets into his truck and heads off to Tanner's house, his father riding along. While walking to town, Eileen discovers Tanner in his truck, which has been crashed and knocked upside down. Eileen helps Tanner out of the truck before it explodes. Connor and Buddy drive up to this. Connor walks over to Tanner and punches him in the face. When Eileen tells Connor to leave Tanner alone, Connor angrily tells her, \"Lady, I am not in the mood for your foolishness! Now get your ass in the truck!\" He tells Tanner to never say another word to Lacey again and that he is planting the corn that Tanner has told him not to plant and that Tanner can do nothing about it. Connor, Buddy and Eileen then drive home, while Tanner, now realizing the error of his ways, walks back to his house.\n\nBack at Connor and Lacey's house, the other five eventually convince Eileen to accept the fact that Connor and Lacey are married. However, not everything has yet been settled, as Tanner and his wife pull up to the house. Connor, Lacey, and Eileen walk outside, Connor threatening to punch Tanner again if he does not get off his property. Tanner apologizes for the things that he has done to Connor and Lacey. He also thanks Eileen for saving him and gives her a homemade pie and a hug. Tanner's wife explains that Tanner really is a good man but has just had a lot of issues that have been affecting him. Connor asks Tanner if he wants to help him with his corn, and Tanner accepts the offer.\n\nAt the Christmas Jubilee, Lacey thanks the Sheldon Construction Company for helping to sponsor the event. Bailey then begins to sing, with his parents cheering him on. Lacey also reveals to Oliver that she is married to Connor.",
  "synopsis": null
}