{
  "imdb_id": "tt2654192",
  "tmdb_id": "201666",
  "douban_id": null,
  "title": "Llyn Foulkes One Man Band (2013)",
  "genres": [
    "Documentary",
    "Biography"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "88 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.3,
  "director": [
    {
      "id": "nm0356968",
      "name": "Tamar Halpern"
    },
    {
      "id": "nm0703635",
      "name": "Chris Quilty"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm3827265",
      "name": "Llyn Foulkes",
      "character": ""
    },
    {
      "id": "nm0000454",
      "name": "Dennis Hopper",
      "character": "Himself"
    },
    {
      "id": "nm3426577",
      "name": "Paul Schimmel",
      "character": ""
    },
    {
      "id": "nm0001992",
      "name": "Johnny Carson",
      "character": "(archive footage)"
    },
    {
      "id": "nm2182271",
      "name": "Mat Gleason",
      "character": "Himself"
    },
    {
      "id": "nm5498800",
      "name": "George Herms",
      "character": ""
    }
  ],
  "overview": "This documentary follows painter and musician Lyn Foulkes from age 70 to 77 as he labors to complete two astonishing tableaux that demonstrate his outsider's perspective and eye for evocative imagery. As his reworking of one piece stretches into its second decade, we watch Foulkes' righteous contempt for the establishment erode, replaced by a yearning for the recognition he's due.",
  "storyline": "At age 70, LA painter and one-man-band musician Llyn Foulkes struggles to be remembered. As he finishes two paintings, one that cost him his marriage, he feverishly works to create deep, three-dimensional 'pictures' layering real objects and shadows. When no one attends his NY show, he blames himself. With commentary from Dennis Hopper, we learn Llyn was kicked out of the Ferus Gallery for insulting another artist's work, setting the tone for the next fifty years of his refusal to sell out. Twenty years after performing on the Tonight Show, he plays 'The Machine' alone, a one-man band in both music and art. Part Clint Eastwood, part political anarchist, this intimate portrait of Llyn Foulkes follows his obsessive craft and process for eight years.",
  "plot": null,
  "synopsis": null
}