{
  "imdb_id": "tt2637490",
  "tmdb_id": "200131",
  "douban_id": null,
  "title": "Schweizer Geist (2013)",
  "genres": [
    "Documentary"
  ],
  "country": "Switzerland",
  "version": [
    {
      "runtime": "88 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.0,
  "director": [
    {
      "id": "nm3669152",
      "name": "Severin Frei"
    }
  ],
  "writer": [
    {
      "id": "nm3669152",
      "name": "Severin Frei",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm5494847",
      "name": "Regina Steiner",
      "character": ""
    },
    {
      "id": "nm5494959",
      "name": "Fredy Tscherrig",
      "character": ""
    },
    {
      "id": "nm5494974",
      "name": "Dionys Frei",
      "character": ""
    },
    {
      "id": "nm5494846",
      "name": "Davide Tiraboschi",
      "character": ""
    },
    {
      "id": "nm5494845",
      "name": "Dario Klaiss",
      "character": ""
    },
    {
      "id": "nm5494881",
      "name": "Bruno Ritler",
      "character": ""
    },
    {
      "id": "nm5494883",
      "name": "Corsin Sialm",
      "character": ""
    },
    {
      "id": "nm5494932",
      "name": "Fritz Bieri",
      "character": ""
    },
    {
      "id": "nm5494981",
      "name": "Fulvio Giudici",
      "character": ""
    },
    {
      "id": "nm5494882",
      "name": "Doris Röthlin",
      "character": ""
    },
    {
      "id": "nm5494896",
      "name": "Hans Schorno",
      "character": ""
    },
    {
      "id": "nm5494907",
      "name": "Max Kappler",
      "character": ""
    },
    {
      "id": "nm3786051",
      "name": "Claude-Alain Bugnon",
      "character": ""
    },
    {
      "id": "nm5479604",
      "name": "Dani Arnold",
      "character": "Himself"
    },
    {
      "id": "nm3108053",
      "name": "Michael Elsener",
      "character": "Himself"
    }
  ],
  "overview": "Searching the Spirit of Switzerland",
  "storyline": "Der Schweizer Geist was ist das? Mit dieser Frage macht sich Dokumentarfilmer Severin Frei auf, um das Wesen seiner Heimat zu erkunden und seinen Landsleuten den Puls zu fühlen. Er besucht die nördlichste, südlichste, östlichste und westlichste Gemeinde der Schweiz, taucht in alle vier Sprachkulturen ein und klettert auf den höchsten Punkt. Dabei begegnet er Menschen, die ihm eindrückliche Einblicke in ihre Lebensformen und Wertvorstellungen gewähren: vom Kabarettisten über die Alphornspielerin und den Extremkletterer bis zu innovativen Tüftlern. «Schweizer Geist» ist eine persönliche Entdeckungstour durch die eigene Heimat, eine Annäherung an Klischees, Mythen und wahre Werte. Und ein spannendes Zeitdokument, das eine Schweiz zeigt, wie sie 2013 von Schweizern gesehen wird authentisch, spontan und verblüffend herzlich.",
  "plot": null,
  "synopsis": "Der Schweizer Geist was ist das? Mit dieser Frage macht sich Dokumentarfilmer Severin Frei auf, um das Wesen seiner Heimat zu erkunden und seinen Landsleuten den Puls zu fühlen. Er besucht die nördlichste, südlichste, östlichste und westlichste Gemeinde der Schweiz, taucht in alle vier Sprachkulturen ein und klettert auf den höchsten Punkt. Dabei begegnet er Menschen, die ihm eindrückliche Einblicke in ihre Lebensformen und Wertvorstellungen gewähren: vom Kabarettisten über die Alphornspielerin und den Extremkletterer bis zu innovativen Tüftlern.\n«Schweizer Geist» ist eine persönliche Entdeckungstour durch die eigene Heimat, eine Annäherung an Klischees, Mythen und wahre Werte. Und ein spannendes Zeitdokument, das eine Schweiz zeigt, wie sie 2013 von Schweizern gesehen wird authentisch, spontan und verblüffend herzlich."
}