{
  "imdb_id": "tt2689966",
  "tmdb_id": "177703",
  "douban_id": null,
  "title": "Broadway Idiot (2013)",
  "genres": [
    "Documentary",
    "Music",
    "Musical"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "81 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.7,
  "director": [
    {
      "id": "nm1470984",
      "name": "Doug Hamilton"
    }
  ],
  "writer": [
    {
      "id": "nm1470984",
      "name": "Doug Hamilton",
      "description": "uncredited"
    }
  ],
  "cast": [
    {
      "id": "nm1555287",
      "name": "Michael Mayer",
      "character": "Himself, Book, Director"
    },
    {
      "id": "nm3984992",
      "name": "Steven Hoggett",
      "character": "Himself, Choreographer"
    },
    {
      "id": "nm3967129",
      "name": "Tom Kitt",
      "character": "Himself, Orchestrations, Arrangements, Musical Supervision"
    },
    {
      "id": "nm3794680",
      "name": "Christine Jones",
      "character": "Herself, Scenic Design"
    },
    {
      "id": "nm1250079",
      "name": "Andrea Lauer",
      "character": "Herself, Costume Design"
    },
    {
      "id": "nm1504154",
      "name": "Kevin Adams",
      "character": "Himself, Lighting Design"
    },
    {
      "id": "nm3508606",
      "name": "Brian Ronan",
      "character": "Himself, Sound Design"
    },
    {
      "id": "nm7025084",
      "name": "Darrel Maloney",
      "character": "Himself, Video and Production Design"
    },
    {
      "id": "nm3979373",
      "name": "Carmel Dean",
      "character": "Herself, Music Director, Conductor, Keyboard, Accordion"
    },
    {
      "id": "nm7025085",
      "name": "James Harker",
      "character": "Himself, Stage Manager"
    },
    {
      "id": "nm4476273",
      "name": "Lorin Latarro",
      "character": "Herself, Associate Choreographer"
    },
    {
      "id": "nm1421043",
      "name": "Johanna McKeon",
      "character": "Herself, Associate Director"
    },
    {
      "id": "nm7025086",
      "name": "Austin Regan",
      "character": "Himself, Associate Director"
    },
    {
      "id": "nm0035626",
      "name": "Billie Joe Armstrong",
      "character": "Himself, Lead Vocals, Guitar, St. Jimmy"
    },
    {
      "id": "nm0228238",
      "name": "Mike Dirnt",
      "character": "Himself, Bass, Vocals"
    },
    {
      "id": "nm0177566",
      "name": "Tre Cool",
      "character": "Himself, Drums, Vocals"
    },
    {
      "id": "nm0302330",
      "name": "John Gallagher Jr.",
      "character": "Himself, Johnny"
    },
    {
      "id": "nm1092022",
      "name": "Michael Esper",
      "character": "Will,"
    },
    {
      "id": "nm1929864",
      "name": "Matt Caplan",
      "character": "Himself, Tunny"
    },
    {
      "id": "nm1197466",
      "name": "Stark Sands",
      "character": "Himself, Tunny"
    },
    {
      "id": "nm3135063",
      "name": "Rebecca Naomi Jones",
      "character": "Herself, Whatsername"
    },
    {
      "id": "nm3402188",
      "name": "Christina Sajous",
      "character": "Herself, The Extraordinary Girl"
    },
    {
      "id": "nm4171388",
      "name": "Mary Faber",
      "character": "Herself, Heather"
    },
    {
      "id": "nm0898778",
      "name": "Tony Vincent",
      "character": "Himself, St. Jimmy"
    },
    {
      "id": "nm4226678",
      "name": "Declan Bennett",
      "character": "Himself"
    },
    {
      "id": "nm2407066",
      "name": "Andrew Call",
      "character": "Himself"
    },
    {
      "id": "nm2270989",
      "name": "Gerard Canonico",
      "character": "Himself"
    },
    {
      "id": "nm1321706",
      "name": "Miguel Cervantes",
      "character": "Himself"
    },
    {
      "id": "nm5655733",
      "name": "Sydney James Harcourt",
      "character": "Himself       (as Sydney Harcourt)"
    },
    {
      "id": "nm2348438",
      "name": "Joshua Henry",
      "character": "Himself"
    },
    {
      "id": "nm1807206",
      "name": "Van Hughes",
      "character": "Himself"
    },
    {
      "id": "nm4811041",
      "name": "Brian Charles Johnson",
      "character": "Himself"
    },
    {
      "id": "nm1352623",
      "name": "Joshua Kobak",
      "character": "Himself"
    },
    {
      "id": "nm5363785",
      "name": "Omar Lopez Cepero",
      "character": "Himself       (as Omar Lopez-Cepero)"
    },
    {
      "id": "nm5013475",
      "name": "Leslie McDonel",
      "character": "Herself"
    },
    {
      "id": "nm2397839",
      "name": "Chase Peacock",
      "character": "Himself"
    },
    {
      "id": "nm4094023",
      "name": "Corbin Reid",
      "character": "Himself"
    },
    {
      "id": "nm2087489",
      "name": "Theo Stockman",
      "character": "Himself"
    },
    {
      "id": "nm3428323",
      "name": "Ben Thompson",
      "character": "Himself"
    },
    {
      "id": "nm2155704",
      "name": "Alysha Umphress",
      "character": "Herself"
    },
    {
      "id": "nm0587931",
      "name": "Aspen Vincent",
      "character": "Herself"
    },
    {
      "id": "nm3361443",
      "name": "Morgan Weed",
      "character": "Herself"
    },
    {
      "id": "nm0935962",
      "name": "Libby Winters",
      "character": "Herself"
    },
    {
      "id": "nm7025088",
      "name": "Jared Stein",
      "character": "Himself, Associate Conductor, Keyboard"
    },
    {
      "id": "nm7025089",
      "name": "Trey Files",
      "character": "Himself, Drums, Percussion"
    },
    {
      "id": "nm0007497",
      "name": "Michael Aarons",
      "character": "Himself, Guitar       (as Mike Aarons)"
    },
    {
      "id": "nm7025090",
      "name": "Alec Berlin",
      "character": "Himself, Guitar"
    },
    {
      "id": "nm7025091",
      "name": "William Evankovich",
      "character": "Himself, Guitar"
    },
    {
      "id": "nm7025092",
      "name": "Dan Grennes",
      "character": "Himself, Bass"
    },
    {
      "id": "nm7025093",
      "name": "K. Joseph Shaughnessy",
      "character": "Himself, Bass"
    },
    {
      "id": "nm1522843",
      "name": "Cenovia Cummins",
      "character": "Herself, Violin"
    },
    {
      "id": "nm7025094",
      "name": "Kathy Marshall",
      "character": "Herself, Violin"
    },
    {
      "id": "nm6447172",
      "name": "Erin Benin",
      "character": "Herself, Viola"
    },
    {
      "id": "nm2834184",
      "name": "Alissa Smith",
      "character": "Herself, Viola"
    },
    {
      "id": "nm7025095",
      "name": "Rachel Turner Houk",
      "character": "Herself, Cello"
    },
    {
      "id": "nm7025096",
      "name": "Amy Ralske",
      "character": "Herself, Cello"
    }
  ],
  "overview": "Broadway Idiot follows Green Day's Billie Joe Armstrong from a punk rock concert at Madison Square Garden to the opening of his musical American Idiot on Broadway - only ten blocks away, but worlds apart. From behind the curtain share in the crazy journey of turning the mega-hit album into a punk rock musical - and ultimately see how the world of theater transformed Billie Joe.",
  "storyline": "Broadway Idiot follows Green Day's Billie Joe Armstrong from a punk rock concert at Madison Square Garden to the opening of his musical American Idiot on Broadway - only ten blocks away, but worlds apart. From behind the curtain share in the crazy journey of turning the mega-hit album into a punk rock musical - and ultimately see how the world of theater transformed Billie Joe.",
  "plot": "Set in the recent past, the musical opens on a group of suburban youths living unhappily in \"Jingletown, USA\" and saturated with TV. Fed up with the state of the union, the company explodes in frustration (\"American Idiot\"). One of the youths, Johnny (\"Jesus of Suburbia\"), goes to commiserate with his friend Will. A third friend, Tunny, joins the two and they party until they run out of beer, prompting them to pick up more at the local 7-Eleven. Tunny soon exposes the do-nothing go-nowhere quicksand of their lives (\"City of the Damned\"). They get riled up, and Johnny challenges his friends to engage (\"I Don't Care\"). Will's girlfriend, Heather, soon makes an appearance. She is pregnant and doesn't know what to do (\"Dearly Beloved\"). Johnny borrows money and buys bus tickets to the city for the three young men, eager to escape suburbia. Before the boys are able to leave, Heather tells Will of her pregnancy. With no other choice, he stays home (\"Tales of Another Broken Home\"). Johnny and Tunny depart for the city with a group of other jaded youths (\"Holiday\").\n\nWhile Johnny wanders the city and pines for a woman he sees in an apartment window (\"Boulevard of Broken Dreams\"), Tunny finds it hard to adjust to urban life and is seduced by a television ad for the army (\"Favorite Son\"). Tunny realizes that his generation has been so numbed and apathetic that nothing, not even the bright lights of the city, will excite him (\"Are We the Waiting\"). He enlists in the army.\n\nA frustrated Johnny manifests a rebellious drug-dealing alter ego called St. Jimmy, and injects heroin for the first time (\"St. Jimmy\"). His newfound courage thanks to St. Jimmy and the drugs allow Johnny to make a successful move on the girl in the window. Back in Jingletown, Will sits on the couch as his girlfriend's pregnancy progresses. He drinks beer and begs for a release. Meanwhile, Tunny is deployed to a war zone, and is soon shot and wounded (\"Give Me Novacaine\").\n\nJohnny spends the night with the girl he saw in the window, whom he calls \"Whatsername\". Johnny is smitten with Whatsername and wants to celebrate, but St. Jimmy has other plans for them (\"Last of the American Girls/She's a Rebel\"). Johnny and Whatsername go to a club, take drugs together, and have passionate sex. By this time, Will and Heather's baby girl has been born, and Will is increasingly oblivious as Heather tenderly commits herself to her baby's future (\"Last Night on Earth\").\n\nHeather has had enough of Will's pot-and-alcohol-fueled apathy. Despite Will's protestations, she takes the baby and walks out (\"Too Much, Too Soon\"). Around the same time, lying in a bed in an army hospital (\"Before the Lobotomy\"), Tunny falls victim to the hopelessness he has seen during wartime and hallucinates. He and his nurse engage in a balletic aerial dance (\"Extraordinary Girl\"). He quickly falls in love with her. His hallucination disappears, and he's left with his fellow soldiers in agony (\"Before the Lobotomy (Reprise)\").\n\nBack in the city, Johnny reveals the depth of his love for Whatsername as she sleeps (\"When It's Time\"). The temptation of drugs, however, is too great; Jimmy forces Johnny to become increasingly erratic, and he eventually threatens Whatsername (and then himself) with a knife (\"Know Your Enemy\"). Whatsername attempts to talk about Johnny's behavior, while the Extraordinary Girl dresses Tunny's wounds and Will sits on the couch, once again alone (\"21 Guns\"). Johnny leaves a note for Whatsername, saying he has chosen Jimmy and drugs over her. Frightened and fed up, Whatsername tells Johnny that he is not the \"Jesus of Suburbia\" and reveals that St. Jimmy is nothing more than \"a figment of [his] father's rage and [his] mother's love\" (\"Letterbomb\"). She leaves him.\n\nHurt by Whatsername's departure, Johnny longs for better days ahead, Tunny longs for home, and Will longs for all the things he's lost (\"Wake Me Up When September Ends\"). St. Jimmy appears and makes one last attempt to get Johnny's attention, but that part of Johnny has died, resulting in the metaphorical suicide of St. Jimmy (\"The Death of St. Jimmy\"). Johnny cleans up and gets a desk job but soon realizes there is no place for him in the city (\"East 12th Street\"). Will, all alone with his television, bemoans his outcast state (\"Nobody Likes You\"). As he finally gets up off the couch, Heather appears with her new show-off rockstar boyfriend (\"Rock and Roll Girlfriend\"). Will heads to the 7-Eleven to get away from them and, surprisingly, finds Johnny there. Johnny had sold his guitar for a bus ticket home. Tunny returns from the war zone (as an amputee) with the Extraordinary Girl. As Tunny introduces his friends to the Extraordinary Girl, Johnny becomes furious with him for leaving the group, but quickly forgives him and the three friends embrace. Heather and her boyfriend arrive. In an uneasy truce, she gives the baby to Will. Other friends show up to greet the three men they haven't seen in a year (\"We're Coming Home Again\"). One year later, Johnny laments that he lost the love of his life, but he accepts that he can live inside the struggle between rage and love that has defined his life. With this acceptance comes the possibility of hope (\"Whatsername\").\n\nAfter the cast takes their bows, the curtain rises to reveal the entire company with guitars, with which they perform the song \"Good Riddance (Time of Your Life)\". Each performance of this song was recorded and given to the audience as a free digital download.",
  "synopsis": "From punk rock mosh pits and sold-out stadiums to the Great White Way, this electrifying documentary follows Green Days Billie Joe Armstrong as he works with Broadway veterans to turn his mega-hit album, American Idiot, into a Broadway musical. The film goes behind the scenes to reveal the creative choices and challenges made by Grammy® winner Billie Joe and Tony® winning director Michael Mayer (Spring Awakening) to create the thrilling and one-of-a-kind musical experience. More than just a making-of profile, Broadway Idiot is a portrait of a world-famous artist having the guts to try something totally new. The film grants insider access to the actors rehearsals, the creative teams process and live performances that reveal Billies transformation from rock star to Broadway star. Broadway Idiot provides a unique window into the art of theater as rock stars and stage stars collide and create something never seen before."
}