{
  "imdb_id": "tt2652092",
  "tmdb_id": "250538",
  "douban_id": null,
  "title": "The Good Lie (2014)",
  "genres": [
    "Biography",
    "Drama"
  ],
  "country": "Kenya",
  "version": [
    {
      "runtime": "110 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.4,
  "director": [
    {
      "id": "nm0265852",
      "name": "Philippe Falardeau"
    }
  ],
  "writer": [
    {
      "id": "nm0619361",
      "name": "Margaret Nagle",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0000702",
      "name": "Reese Witherspoon",
      "character": "Carrie"
    },
    {
      "id": "nm0643668",
      "name": "Arnold Oceng",
      "character": "Mamere"
    },
    {
      "id": "nm1563346",
      "name": "Ger Duany",
      "character": "Jeremiah"
    },
    {
      "id": "nm2897500",
      "name": "Emmanuel Jal",
      "character": "Paul"
    },
    {
      "id": "nm1015684",
      "name": "Corey Stoll",
      "character": "Jack"
    },
    {
      "id": "nm6027546",
      "name": "Kuoth Wiel",
      "character": "Abital"
    },
    {
      "id": "nm2796341",
      "name": "Femi Oguns",
      "character": "Theo"
    },
    {
      "id": "nm1807222",
      "name": "Sarah Baker",
      "character": "Pamela"
    },
    {
      "id": "nm2300510",
      "name": "Lindsey Garrett",
      "character": "Jenny"
    },
    {
      "id": "nm6790908",
      "name": "Peterdeng Mongok",
      "character": "Young Mamere"
    },
    {
      "id": "nm6790909",
      "name": "Okwar Jale",
      "character": "Young Theo"
    },
    {
      "id": "nm6790910",
      "name": "Thon Kueth",
      "character": "Young Jeremiah"
    },
    {
      "id": "nm6790911",
      "name": "Deng Ajuet",
      "character": "Young Paul"
    },
    {
      "id": "nm6790912",
      "name": "Keji Jale",
      "character": "Young Abital"
    },
    {
      "id": "nm6790913",
      "name": "David Madingi",
      "character": "Young Gabriel"
    },
    {
      "id": "nm6790914",
      "name": "Kon Akoue Auok",
      "character": "Young Daniel"
    },
    {
      "id": "nm6790915",
      "name": "Sibusisu Moyo",
      "character": "Young Simon"
    },
    {
      "id": "nm4582971",
      "name": "Antoine Wonder Kalambay",
      "character": "Boy (River of Children)"
    },
    {
      "id": "nm6790916",
      "name": "Elikana Jale",
      "character": "James /              Wounded Man"
    },
    {
      "id": "nm0648416",
      "name": "Afemo Omilami",
      "character": "Dr. Monyang"
    },
    {
      "id": "nm2360398",
      "name": "Michael H. Cole",
      "character": "Reverend Trutner       (as Michael Cole)"
    },
    {
      "id": "nm4133426",
      "name": "Brian Kurlander",
      "character": "Frank"
    },
    {
      "id": "nm5038314",
      "name": "Jimi Kocina",
      "character": "Karl"
    },
    {
      "id": "nm2282254",
      "name": "Joshua Mikel",
      "character": "Dave"
    },
    {
      "id": "nm0687772",
      "name": "Mike Pniewski",
      "character": "Nick"
    },
    {
      "id": "nm0524745",
      "name": "Thad Luckinbill",
      "character": "Matt"
    },
    {
      "id": "nm2079627",
      "name": "Vince Pisani",
      "character": "INS Boston"
    },
    {
      "id": "nm2767931",
      "name": "Kimberly Banta",
      "character": "INS Kansas City       (as Kim Banta)"
    },
    {
      "id": "nm1990075",
      "name": "Travis Smith",
      "character": "Roger"
    },
    {
      "id": "nm2759438",
      "name": "Sharon Conley",
      "character": "Erin Sullivan"
    },
    {
      "id": "nm4360199",
      "name": "Raj Kala",
      "character": "Man in English Class"
    },
    {
      "id": "nm3966712",
      "name": "Parisa Johnston",
      "character": "Sari Woman in English Class"
    },
    {
      "id": "nm4791344",
      "name": "Heather Lyda",
      "character": "Homeless Woman"
    },
    {
      "id": "nm0398016",
      "name": "Maria Howell",
      "character": "INS Agent"
    },
    {
      "id": "nm3623484",
      "name": "Clifton Guterman",
      "character": "INS Clerk"
    },
    {
      "id": "nm0019171",
      "name": "Kenny Alfonso",
      "character": "Police Officer"
    },
    {
      "id": "nm1035730",
      "name": "Victor McCay",
      "character": "Reed"
    },
    {
      "id": "nm6790917",
      "name": "Jacob Kuol Alier",
      "character": "Fargo Boy"
    },
    {
      "id": "nm5627754",
      "name": "Berglind Jonsdottir",
      "character": "Swedish Official"
    },
    {
      "id": "nm6790918",
      "name": "Dhan Kueth",
      "character": "Majok"
    },
    {
      "id": "nm1987447",
      "name": "Israel Matseke-Zulu",
      "character": "Bracelet Soldier       (as Israel Makoe)"
    },
    {
      "id": "nm0941887",
      "name": "Keith Woulard",
      "character": "Soldier"
    },
    {
      "id": "nm2601624",
      "name": "John Prendergast",
      "character": "Toby"
    },
    {
      "id": "nm6790919",
      "name": "Tiffany Jones",
      "character": "Refugee Worker"
    },
    {
      "id": "nm2269623",
      "name": "Nathaniel Ramabulana",
      "character": "U.N. Worker"
    },
    {
      "id": "nm6790920",
      "name": "Lavine Dimo",
      "character": "Guinea Worm Girl"
    },
    {
      "id": "nm6790921",
      "name": "Julia Ayiol",
      "character": "Village Mother"
    },
    {
      "id": "nm3571491",
      "name": "Sope Aluko",
      "character": "Processing Office Woman"
    },
    {
      "id": "nm2612326",
      "name": "Suehyla El-Attar",
      "character": "Immigration Official"
    },
    {
      "id": "nm1547963",
      "name": "Abena Ayivor",
      "character": "Immigration Official #2"
    },
    {
      "id": "nm4562041",
      "name": "Levi Burdick",
      "character": "INS Official"
    },
    {
      "id": "nm1001283",
      "name": "Lele Ledwaba",
      "character": "Food Worker"
    },
    {
      "id": "nm5080507",
      "name": "Mari Malek",
      "character": "Party Guest"
    },
    {
      "id": "nm6790922",
      "name": "Flora Peter Deng",
      "character": "Abital's Mother"
    }
  ],
  "overview": "A young refugee of the Sudanese Civil War who wins a lottery for relocation to the United States with three other lost boys. Encountering the modern world for the first time, they develop an unlikely friendship with a brash American woman assigned to help them, but the young man struggles to adjust to this new life and his feelings of guilt about the brother he left behind.",
  "storyline": "Four Sudanese children are orphaned after their village is massacred in the Second Sudanese Civil War. Consequently, they make an arduous and dangerous trek through the plains, enduring hardship, death and sacrifice all the way until they reach safety in a refugee camp in Kenya. Years later, these youths are among 3600 selected for resettlement in America, only to have the one girl among them sent to Boston, while the three boys must to make a new life in Kansas City. Together, these young men must adjust to an alien culture even as the emotional baggage of their past haunts them. However, these newcomers, and their new friends like employment counselor Carrie Davis, strive to understand each other in this new home, as they make peace with their histories in a challenge that will change all their lives.",
  "plot": "In 1988, following his mother's death, a young Peter Quill is abducted from Earth by the Ravagers, a group of space pirates led by Yondu Udonta. Twenty-six years later on the planet Morag, Quill steals an orb but is attacked by Korath, a subordinate to the fanatical Kree Ronan. Although Quill escapes with the orb, Yondu discovers his theft and issues a bounty for his capture, while Ronan sends the assassin Gamora after the orb.\n\nWhen Quill attempts to sell the orb on Xandar, capital of the Nova Empire, Gamora ambushes him and steals it. A fight ensues, drawing in a pair of bounty hunters: the genetically and cybernetically modified raccoon Rocket, and the tree-like humanoid Groot. Nova Corps officers capture the four, detaining them in the Kyln. A powerful inmate there, Drax, attempts to kill Gamora due to her association with Ronan, who killed his family. Quill convinces Drax that Gamora can bring Ronan to him, though Gamora reveals that she has betrayed Ronan, unwilling to let him use the orb's power. Learning that Gamora has a buyer for the orb, Quill, Rocket, Groot, and Drax work with her to escape the Kyln in Quill's ship, the Milano.\n\nRonan meets with Gamora's adoptive father, Thanos, to discuss her betrayal. Quill's group flee to Knowhere, a remote criminal outpost in space built in the giant severed head of a Celestial. A drunken Drax summons Ronan while the rest of the group meet Gamora's contact, the collector Taneleer Tivan. Tivan opens the orb, revealing an Infinity Stone, an item of immeasurable power that destroys all but the most powerful beings who wield it. Tivan's tormented assistant grabs the Stone, triggering an explosion that engulfs Tivan's archive.\n\nRonan arrives and easily defeats Drax, while the others flee by ship, pursued by Ronan's followers and Gamora's adoptive sister Nebula. Nebula destroys Gamora's ship, leaving her floating in space, and Ronan's fighters capture the orb. Quill contacts Yondu before following Gamora into space, giving her his helmet to survive; Yondu arrives and retrieves the pair. Rocket, Drax, and Groot threaten to attack Yondu's ship to rescue them, but Quill negotiates a truce, promising the orb to Yondu. Quill's group agrees that facing Ronan means certain death, but that they cannot let him use the Infinity Stone to destroy the galaxy. On Ronan's flagship, the Dark Aster, Ronan embeds the Stone in his warhammer, taking its power for himself. He contacts Thanos, threatening to kill him after first destroying Xandar; hateful of her adoptive father, Nebula allies with Ronan.\n\nThe Ravagers and Quill's group join with the Nova Corps to confront the Dark Aster at Xandar, with Quill's group breaching the Dark Aster with the Milano. Ronan uses his empowered warhammer to destroy the Nova Corps fleet. Gamora fights and defeats Nebula, who then escapes, but the group find themselves outmatched by Ronan's power until Rocket crashes a Ravager ship through the Dark Aster. The damaged Dark Aster crash-lands on Xandar, with Groot sacrificing himself to shield the group. Ronan emerges from the wreck and prepares to destroy Xandar, but Quill distracts him, allowing Drax and Rocket to destroy Ronan's warhammer. Quill grabs the freed Stone, and with Gamora, Drax, and Rocket sharing its burden, they use it to destroy Ronan.\n\nIn the aftermath, Quill tricks Yondu into taking a container supposedly containing the Stone, and gives the real Stone to the Nova Corps. As the Ravagers leave Xandar, Yondu remarks that it turned out well that they did not deliver Quill to his father per their contract. Quill's group, now known as the Guardians of the Galaxy, have their criminal records expunged, and Quill learns that he is only half-human, his father being part of an ancient, unknown species. Quill finally opens the last present he received from his mother: a cassette tape filled with her favorite songs. The Guardians leave in the rebuilt Milano along with a sapling cut from Groot.\n\nIn a post-credits scene, Tivan sits in his destroyed archive with two of his living exhibits: a canine cosmonaut and an anthropomorphic duck.[N 1]",
  "synopsis": null
}