{
  "imdb_id": "tt2650978",
  "tmdb_id": "248933",
  "douban_id": "22254890",
  "title": "The Dark Valley (2014)",
  "genres": [
    "Drama",
    "Mystery",
    "Western"
  ],
  "country": "Austria",
  "version": [
    {
      "runtime": "115 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm0698283",
      "name": "Andreas Prochaska"
    }
  ],
  "writer": [
    {
      "id": "nm0024377",
      "name": "Martin Ambrosch",
      "description": "screenplay &"
    },
    {
      "id": "nm0698283",
      "name": "Andreas Prochaska",
      "description": "screenplay"
    },
    {
      "id": "nm5552625",
      "name": "Thomas Willmann",
      "description": "novel"
    }
  ],
  "cast": [
    {
      "id": "nm0727165",
      "name": "Sam Riley",
      "character": "Greider"
    },
    {
      "id": "nm0604349",
      "name": "Tobias Moretti",
      "character": "Hans Brenner"
    },
    {
      "id": "nm3559009",
      "name": "Paula Beer",
      "character": "Luzi"
    },
    {
      "id": "nm4752229",
      "name": "Thomas Schubert",
      "character": "Lukas"
    },
    {
      "id": "nm1169774",
      "name": "Carmen Gratl",
      "character": "Gaderin"
    },
    {
      "id": "nm0771332",
      "name": "Clemens Schick",
      "character": "Luis Brenner"
    },
    {
      "id": "nm2932341",
      "name": "Helmuth Häusler",
      "character": "Hubert Brenner"
    },
    {
      "id": "nm1058827",
      "name": "Martin Leutgeb",
      "character": "Otto Brenner"
    },
    {
      "id": "nm0631958",
      "name": "Johannes Nikolussi",
      "character": "Rudolf Brenner"
    },
    {
      "id": "nm1278705",
      "name": "Florian Brückner",
      "character": "Edi Brenner"
    },
    {
      "id": "nm1816289",
      "name": "Heinz Ollesch",
      "character": "Schmied"
    },
    {
      "id": "nm2310953",
      "name": "Franz Xaver Brückner",
      "character": "Franz"
    },
    {
      "id": "nm3384029",
      "name": "Xenia Assenza",
      "character": "Maria"
    },
    {
      "id": "nm2127962",
      "name": "Beatrix Brunschko",
      "character": "Mutter Lukas"
    },
    {
      "id": "nm0509508",
      "name": "Gerhard Liebmann",
      "character": "Vater Lukas"
    },
    {
      "id": "nm0341005",
      "name": "Josef Griesser",
      "character": "Wirt       (as Pepi Griesser)"
    },
    {
      "id": "nm0084507",
      "name": "Johanna Bittenbinder",
      "character": "Wirtin"
    },
    {
      "id": "nm0826071",
      "name": "Erwin Steinhauer",
      "character": "Pfarrer Breiser"
    },
    {
      "id": "nm0716795",
      "name": "Hans-Michael Rehberg",
      "character": "Brenner"
    },
    {
      "id": "nm7516223",
      "name": "Thomas Hochkofler",
      "character": "Brennerbauer Rückblende"
    },
    {
      "id": "nm7516224",
      "name": "Selina Weithaler",
      "character": "Lukas' Schwester"
    },
    {
      "id": "nm7516225",
      "name": "Sara Weithaler",
      "character": "Lukas' Schwester"
    },
    {
      "id": "nm5118755",
      "name": "Elisabeth Marmsoler",
      "character": "Lukas' Grossmutter"
    },
    {
      "id": "nm7516226",
      "name": "Hannah Rainer",
      "character": "Maria als Kind"
    },
    {
      "id": "nm7516227",
      "name": "Marcus Elias Gamper",
      "character": "Vater von Maria"
    },
    {
      "id": "nm7516228",
      "name": "Victoria Angerer",
      "character": "Mutter von Maria"
    },
    {
      "id": "nm7516229",
      "name": "Verena Schönhofer",
      "character": "Luis' Ehefrau"
    },
    {
      "id": "nm7516230",
      "name": "Noah Kofler",
      "character": "Luis' Sohn"
    },
    {
      "id": "nm7516231",
      "name": "Vera Lindner",
      "character": "Ottos Ehefrau"
    },
    {
      "id": "nm7516232",
      "name": "Nina Dölle",
      "character": "Rudolfs Ehefrau"
    },
    {
      "id": "nm7516233",
      "name": "Giordano di Stasio",
      "character": "Luis Brenner 16 Jahre"
    },
    {
      "id": "nm7516234",
      "name": "Moritz Selva",
      "character": "Edi Brenner 10 Jahre"
    },
    {
      "id": "nm7516235",
      "name": "Leon Gigler",
      "character": "Kind Brennerhof"
    },
    {
      "id": "nm7516236",
      "name": "Annabell Schröter",
      "character": "Kind Brennerhof"
    },
    {
      "id": "nm7516237",
      "name": "Marius Dölle",
      "character": "Kind Brennerhof"
    }
  ],
  "overview": "Through a hidden path a lone rider reaches a little town high up in the Alpes. Nobody knows where the stranger comes from, nor what he wants there. But everyone knows that they don't want him to stay.",
  "storyline": "Through a hidden path a lone rider reaches a little town high up in the Alps. Nobody knows where the stranger comes from, nor what he wants there. But everyone knows that they don't want him to stay.",
  "plot": "The film opens with a scene of a scared young man and woman hiding in the basement of a wooden building. Footsteps are heard from above, and then several men find them, severely assaulting the man and then dragging them both away as the woman screams. Time passes.\n\nA young stranger rides into a remote town somewhere in the Austrian Alps. Having introduced himself as a photographer, Mr&#160;Greider, he becomes the lodger of a widow whose husband and son suffered an untimely death. Soon the newcomer learns that the entire town is firmly under the dominion of an aged rich man named Old Brenner and his six power-drunk sons. One day the widow sends her daughter to town to run some errands. Greider is invited, and decides to accompany young Luzi. As Luzi does her shopping, Greider asks for coffee and horseshoe nails. The brothers discover him at her side within the store, and command him to drink their schnapps. When he politely refuses by stating that he \"doesn't drink,\" one of the brothers beats him into compliance. Later, one of the Brenner brothers dies in what looks like a freak logging accident. Soon this same fate befalls another of the brothers; he falls off a cliff having been blinded by a branch with nails on it. Old Brenner finds nails in his dead son's eyes. Since Greider is suspected to have had his hand in these accidents, he hides. Meanwhile, it is revealed that the Brenner brothers walk in the footsteps of their father. At every local wedding they claim the medieval prerogative of Primae noctis; only Greider's parents (the young couple shown at the opening of the film) had refused to comply. For that defiance, the Brenners crucified Greider's father, but his mother managed to escape and find refuge in America. The local priest still supports what the Brenners do. Greider confronts the priest in private, revealing that he's come to crack down on the Brenners. He admits that he did kill the two Brenner sons. After telling the priest that he's next to die, Greider shoots him.\n\nGreider rescues Luzi from the grasp of the Brenners after she marries Lukas and is abducted. Greider challenges them to a duel on the next day. Rather than waiting for the appointed duel, the brothers try to ambush Greider at the remote mountain cabin where he is holed up. At dawn they come after him, attacking all together. A shootout ensues. Greider is outnumbered four-to-one, but he has the advantage of a Winchester lever-action repeating rifle, while the Brenners all wield two shot side-by-side and breechloading rifles, and are unfamiliar with a repeating rifle. Skillfully leveraging this edge, Greider kills or leaves for dead the remaining four brothers. He then seeks to deliver the message of their deaths to their father, but discovers that some citizens of the town remain loyal to Brenner senior. As Greider approaches Brenner's home he is attacked by the blacksmith, a hulking giant brandishing a large iron log hook. Lukas manages to save Greider by shooting the blacksmith, but not before the hook finds its way through Grieder's shoulder. After the fight, Greider storms Old Brenner's house and finds him in his bed. Greider gives Old Brenner a picture of his mother, explaining the reason for killing Old Brenner's sons and now him. Old Brenner reminds Greider that he has murdered his own brothers and asks him \"to make it quick\"; Greider shoots Old Brenner in the heart. Greider recovers for three weeks from his wounds. In the meantime the various families that live on the valley ask to punish Greider. Many families have relatives to Old Brenner due to his ways. Greider leaves the valley, never to return.",
  "synopsis": null
}