{
  "imdb_id": "tt2667690",
  "tmdb_id": "162007",
  "douban_id": null,
  "title": "Kammath & Kammath (2013)",
  "genres": [
    "Comedy"
  ],
  "country": "India",
  "version": [],
  "imdb_rating": 3.6,
  "director": [
    {
      "id": "nm4598503",
      "name": "Thomson K. Thomas"
    },
    {
      "id": "nm0437791",
      "name": "Kanal Kannan"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm0007123",
      "name": "Mammootty",
      "character": "Raja Raja Kammath"
    },
    {
      "id": "nm0226770",
      "name": "Dileep",
      "character": "Deva Raja Kammath       (as Dilip)"
    },
    {
      "id": "nm2055008",
      "name": "Baburaj",
      "character": "Gopi"
    },
    {
      "id": "nm1333687",
      "name": "Dhanush",
      "character": "Himself"
    },
    {
      "id": "nm5852449",
      "name": "Joju George",
      "character": "Malikapurakkal Tomichan"
    },
    {
      "id": "nm3634501",
      "name": "Rima Kallingal",
      "character": "Mahalakshmi"
    },
    {
      "id": "nm3602255",
      "name": "Karthika Nair",
      "character": "Surekha"
    },
    {
      "id": "nm1230844",
      "name": "Narain",
      "character": "Suresh IPS"
    },
    {
      "id": "nm1196446",
      "name": "Shiju",
      "character": "Sunnichan a bhai of Surekha"
    },
    {
      "id": "nm0837797",
      "name": "Sukumari",
      "character": "Grandmother of Surekha and Sunnichan"
    },
    {
      "id": "nm2241427",
      "name": "Suraaj Venjarammoodu",
      "character": "Ward Counselor Sebastien Kuzhivali"
    }
  ],
  "overview": "Raja Raja Kammath and Deva Raja Kammath are two brothers who owns a chain of restaurants that specializes in making Dosa. The story begins when they come to Palakkad to open a new restaurant.",
  "storyline": "The story of Kammath family which migrated to Kochi from Goa during the Portuguese invasion.",
  "plot": "Kammath and Kammath is a duo in the hotel business. It includes Raja Raja Kammath (Mammootty) and Deva Raja Kammath (Dileep). Sulaiman sahib (Rizabawa) is their rival. He runs a non-vegetarian hotel that is opposite a now defunct Brahmin vegetarian hotel. He has a target of acquiring this hotel's land.\n\nThe Kammath brothers plan to inaugurate their new hotel in the building and land of the defunct hotel. On opening day, municipal secretary Mahlakshmi and ward counselor Sebastian Kuzhivelil are brought by Sulaiman Sahib to stop it from opening. They fail because the hotel's name is now Kammath &amp; Kammath and it has obtained a new license and ownership.\n\nSulaiman Sahib, with the help of a thief (Pathrose) arrests the elder Kammath, Raja Raja Kammath, who meets his brother Deva Raja Kammath who has already been arrested for selling liquor in their new hotel.\n\nThe Kammaths threaten Pathrose in the police station and the truth is revealed that he has thrown stones at Mahalakshmi's house that neighbours the Kammaths' house at the request of Sulaiman Sahib and Sebastian Kuzhivelil. The hotel security cameras reveal that people sent by Sulaiman Sahib brought the liquor to the hotel to implicate the Younger Kammath.\n\nLater, both Mahalakshmi and Sulaiman Sahib are convinced by the elder Kammath that they are not problem makers and both become friends with them.\n\nThe Kammaths open their new hotel in Coimbatore with superstar Dhanush as inagurator. One night, Sunnichan, attacks Mahalakshmi, asking about his sister, while she was coming back to Palakkad from Coimbatore. The elder Kammath saves her from Sunnichan by sending his driver+fighter Gopi to deal with him.\n\nOn this journey Kammath and Mahalakshmi go to a restaurant. There Kammath meets his old wife with her new husband.\n\nWhile continuing the journey a flashback reveals that she was his wife, but she had a different nature than the Kammath family had expected. One day when Kammath's father suffers from chest pain, his mother asks her to drive him to hospital. She refuses as she had to deal with Mehnthi. The father dies in hospital. So they divorce. Hearing this story Mahalakshmi empathizes with him.\n\nThe next day Kammath is invited by Mahalakshmi to talk about a problem. She introduces her sister Surekha to Kammath and says Surekha is scared that somebody is following her. The next day Kammath fights with an helmeted person who comes near her. When the helmet is removed Kammath sees his brother Deva. He becomes sad as he realises that he has beaten up his own brother. When they all leave another person with a helmet who was following her arrives.\n\nRaja Raja Kammath proceeds with the idea of his brother marrying Suekha. Mahalakshmi tells them that Surekha is actually her deceased brother's wife and a Christian instead of a Hindu.\n\nSurekha's history is revealed by Mahalakshmi. Her brother Suresh had married her years ago despite opposition from her family. On the first night of marriage Suresh is killed by Vikram her family's henchman. He is Surekha's real stalker. The story reveals that Sunnichan is her brother.\n\nEven after knowing this story Deva Raja Kammath wishes to marry her. Later at her home, the Kammaths realise to their shock that Surekha cannot speak. Deva still wants to marry her.\n\nOn the night before the wedding, Deva is accosted by Vikram and Surekha's brothers. He escapes to a godown where the elder Kammath awaits. A fight ensues.\n\nThe next day the villains are handed over to the police at Surekha's home and Deva marries Surekha. To everyone's surprise Mahalakshmi is married by the groom found by her deceased brother Suresh.",
  "synopsis": null
}