{
  "imdb_id": "tt2640474",
  "tmdb_id": "207686",
  "douban_id": "25823637",
  "title": "The House at the End of Time (2013)",
  "genres": [
    "Drama",
    "Fantasy",
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "Venezuela",
  "version": [
    {
      "runtime": "101 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.9,
  "director": [
    {
      "id": "nm5480120",
      "name": "Alejandro Hidalgo"
    }
  ],
  "writer": [
    {
      "id": "nm5480120",
      "name": "Alejandro Hidalgo",
      "description": "screenplay"
    },
    {
      "id": "nm5480120",
      "name": "Alejandro Hidalgo",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm6554977",
      "name": "Miguel Angel Pacheco",
      "character": "Kaler"
    },
    {
      "id": "nm4247965",
      "name": "Rosmel Bustamante",
      "character": "Leopoldo"
    },
    {
      "id": "nm5744312",
      "name": "Adriana Calzadilla",
      "character": "Vidente Adriana"
    },
    {
      "id": "nm6211921",
      "name": "Simona Chirinos",
      "character": "Madame Victoria"
    },
    {
      "id": "nm0190910",
      "name": "Gonzalo Cubero",
      "character": "Juan José"
    },
    {
      "id": "nm3242589",
      "name": "Alexander Da Silva",
      "character": "Policia Lopéz"
    },
    {
      "id": "nm6562431",
      "name": "Miguel Flores",
      "character": "Inspector"
    },
    {
      "id": "nm2596515",
      "name": "Guillermo Garcia",
      "character": "Priest"
    },
    {
      "id": "nm3558767",
      "name": "Amanda Key",
      "character": "Saraí Adulta"
    },
    {
      "id": "nm1987323",
      "name": "José León",
      "character": "Old Man"
    },
    {
      "id": "nm2995491",
      "name": "Guillermo Londoño",
      "character": "Policia Fermin"
    },
    {
      "id": "nm5480889",
      "name": "Héctor Mercado",
      "character": "Rodrigo"
    },
    {
      "id": "nm5448317",
      "name": "Yucemar Morales",
      "character": "Saraí"
    },
    {
      "id": "nm0736110",
      "name": "Ruddy Rodríguez",
      "character": "Dulce"
    },
    {
      "id": "nm5220871",
      "name": "Efraín Romero",
      "character": "Mario"
    }
  ],
  "overview": "The House at the End of Time is the first Venezuelan thriller suspense and terror. It tells the story of Dulce (Ruddy Rodriguez) a mother who has encounters with apparitions inside her old house, where she must decipher a mystery that could trigger a prophecy: the death of her family.",
  "storyline": "The first Venezuelan supernatural thriller: Dulce is a mother of two who suddenly experiences terrifying encounters with mysterious apparitions inside her old house, a place where a terrible prophecy is about to be unleashed. Thirty years later, an elderly Dulce returns home to decipher the mystery and the tragedy that have tormented her for so long.",
  "plot": "In 1981, Dulce (Ruddy Rodríguez) lived in an old house with her sons Leopoldo (Rosmel Bustamante) and Rodrigo (Hector Mercado), and her husband Juan José (Gonzalo Cubero). Amid strange supernatural phenomena, her family is attacked. Dulce, bleeding from a wound on her face, regains consciousness and races downstairs to protect her family. In the cellar, she finds Juan José dead of a stab wound, and Leopoldo disappears into thin air after being mysteriously pulled through a doorway.\n\nWhen her prints are found on the murder weapon, Dulce is arrested and imprisoned. Thirty years later, an elderly Dulce is released from jail—under the requirement that she serve the rest of her sentence under house arrest in the very house where the murders took place. Once settled, Dulce is visited by a local priest (Guillermo Garcia) who wants to restore her faith in God. When the priest expresses his own faith in her innocence, she enlists his help to learn the truth.\n\nInvestigating the house's history in the library, the priest learns that an English Freemason built the house a hundred years earlier, only to disappear mysteriously. Subsequent news reports indicate frequent disappearances. Dulce claims the house to be haunted after she sees an elderly man scrawl a series of elevens on her mirror, but the police instead accuse her of being crazy. The priest arrives in time to stop Dulce from committing suicide, and, with the house's history, convinces her that she may yet rescue her Leopoldo.\n\nIn 1981, Leopoldo and Rodrigo play with the local children. Rodrigo develops a crush on a girl, and Leopoldo devises a secret handshake with his best friend. After an apparent intruder in the house vanishes, Dulce becomes worried when Leopoldo hands her a note he says comes from a ghost. The note warns her that she must prevent her children from playing together for the next few days and accuses Juan José of attempting to murder Leopoldo in the future. Juan José dismisses the note and allows the children to play together. During a baseball game, Leopoldo is responsible for a freak accident that kills Rodrigo.\n\nNot knowing what else to do, Dulce consults a local medium. The woman channels a conversation from the future in which Juan José refuses to recognize Leopoldo as his son and attempts to kill him. Distraught, Dulce demands a divorce from Juan José. Initially surprised, Juan José then threatens her if she attempts to take the kids away from him. While grieving the loss of Rodrigo and confused about his failed marriage, Juan José finds evidence that Leopoldo is not his child. Enraged that Dulce would keep this secret from him, he attacks Dulce and Leopoldo.\n\nIn 2011, as the clock hits 11:11 and 11 seconds on November 11, Dulce realizes that the house has transported her 30 years into the past, just before Rodrigo's death. As she bangs on the doors and scares her family, she realizes that she is the source of the disturbances and ghostly apparitions that have haunted her family. She quickly writes a note to Leopoldo that explains the future events and make him promise to give it to her 1981 self without reading it. A version of Leopoldo from after Rodrigo's death also travels backward in time to same day and sees Rodrigo again; he tearfully embraces his brother.\n\nWhen Dulce travels to the day of Leopoldo's disappearance, she meets an elderly man who introduces himself as Leopoldo from 2071. He explains that the house has the ability to randomly transport people through time and that she must kill Juan José and abduct his 1981 self, as he has a latent disease that 1981 medicine can not cure. Though reluctant to follow through with causing her own murder conviction and loss of a child, Dulce relents, knowing it is the only way. In 2011, the priest leads Leopoldo out of the house, claiming to the police guards that it is one of his local orphans. When clear, the priest reveals himself as Leopoldo's best friend by performing their secret handshake, and introduces Rodrigo's crush, now a grown woman.",
  "synopsis": null
}