{
  "imdb_id": "tt2679552",
  "tmdb_id": "340677",
  "douban_id": "26608448",
  "title": "I.T. (2016)",
  "genres": [
    "Crime",
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "country": "Ireland",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.4,
  "director": [
    {
      "id": "nm0601382",
      "name": "John Moore"
    }
  ],
  "writer": [
    {
      "id": "nm0443024",
      "name": "Dan Kay",
      "description": "story by"
    },
    {
      "id": "nm0443024",
      "name": "Dan Kay",
      "description": "screenplay and"
    },
    {
      "id": "nm0936537",
      "name": "William Wisher Jr.",
      "description": "screenplay as William Wisher"
    }
  ],
  "cast": [
    {
      "id": "nm0000112",
      "name": "Pierce Brosnan",
      "character": "Mike Regan"
    },
    {
      "id": "nm0058029",
      "name": "Jason Barry",
      "character": "Patrick"
    },
    {
      "id": "nm8449717",
      "name": "Karen Moskow",
      "character": "Karen Moskow"
    },
    {
      "id": "nm5346194",
      "name": "Kai Ryssdal",
      "character": "Kai Ryssdal"
    },
    {
      "id": "nm6448864",
      "name": "Brian F. Mulvey",
      "character": "George       (as Brian Mulvey)"
    },
    {
      "id": "nm0385604",
      "name": "Martin Hindy",
      "character": "Joey       (as Martin 'Mako' Hindy)"
    },
    {
      "id": "nm1549616",
      "name": "Rico Hizon",
      "character": "Rico Hizon"
    },
    {
      "id": "nm0295484",
      "name": "Anna Friel",
      "character": "Rose Regan"
    },
    {
      "id": "nm2640887",
      "name": "Stefanie Scott",
      "character": "Kaitlyn Regan"
    },
    {
      "id": "nm8449718",
      "name": "Michael Lysak",
      "character": "Bloomberg Radio Guest"
    },
    {
      "id": "nm1715135",
      "name": "Clare-Hope Ashitey",
      "character": "Joan"
    },
    {
      "id": "nm6735229",
      "name": "Vincent Murphy",
      "character": "Business Man"
    },
    {
      "id": "nm1305829",
      "name": "David McSavage",
      "character": "Andy"
    },
    {
      "id": "nm3306943",
      "name": "James Frecheville",
      "character": "Ed Porter"
    },
    {
      "id": "nm8449719",
      "name": "Neringa Juodkunaite",
      "character": "Barista"
    },
    {
      "id": "nm5698268",
      "name": "Olivia Romao",
      "character": "Heather"
    },
    {
      "id": "nm1727237",
      "name": "Adam Fergus",
      "character": "Sullivan"
    },
    {
      "id": "nm8449720",
      "name": "Gina Cervetti",
      "character": "Gina Cervetti"
    },
    {
      "id": "nm6695202",
      "name": "Austin Swift",
      "character": "Lance"
    },
    {
      "id": "nm1763223",
      "name": "Melissa Veszi",
      "character": "Linda Martinez"
    },
    {
      "id": "nm4753979",
      "name": "Fionn Walton",
      "character": "Eric"
    },
    {
      "id": "nm4969484",
      "name": "Robyn Dempsey",
      "character": "Lil Eva"
    },
    {
      "id": "nm8449721",
      "name": "Roy Nini",
      "character": "Dr. Klein"
    },
    {
      "id": "nm5103017",
      "name": "Steve Hartland",
      "character": "Policeman"
    },
    {
      "id": "nm0070779",
      "name": "Jay Benedict",
      "character": "Detective Unrein"
    },
    {
      "id": "nm0638824",
      "name": "Michael Nyqvist",
      "character": "Henrik"
    },
    {
      "id": "nm2256122",
      "name": "Eric Kofi-Abrefa",
      "character": "Detective Kayden"
    },
    {
      "id": "nm0424669",
      "name": "Bruce Lester-Johnson",
      "character": "Detective Metzger       (as Bruce Lester Johnson)"
    },
    {
      "id": "nm1727943",
      "name": "Rico Simonini",
      "character": "Detective"
    },
    {
      "id": "nm3721326",
      "name": "Patrik Vrbovsky",
      "character": "Undercover       (as Patrik 'Rytmus' Vrbovsky)"
    }
  ],
  "overview": "Mike Regan is a successful, self-made man who has it all: a gorgeous wife, a beautiful teenage daughter and a sleek, state-of-the-art “smart home”. But he soon finds himself in a deadly, high-stakes game of cat-and-mouse when his I.T. consultant, Ed, starts using his skills to stalk Mike’s daughter and endanger his family, his business, and his life. In a world where there is no privacy, and personal secrets can go viral by the click of a mouse, Mike needs to rely on his old connections to defeat a new kind of nemesis.",
  "storyline": "Mike Regan has everything he could ever want, a beautiful family and a top of the line smart house. The company he owns is on the verge of changing flight leasing forever. That is, until the relationship with his I.T. advisor turns nasty, to the point where his teenage daughter is being stalked and his family is under attack through every technological facet of their lives.",
  "plot": "Harvard University professor Robert Langdon (Tom Hanks) awakens in a hospital room in Florence, Italy, with no memory of what has transpired over the last few days, but being plagued with visions of a scorched Earth. Dr. Sienna Brooks (Felicity Jones), one of the doctors tending to him, reveals that he is suffering from amnesia as a result of a bullet wound to the head. Another doctor says the police are there to question Langdon but the officer turns out to be Vayentha (Ana Ularu), an assassin, who shoots another doctor while heading down the hall towards Langdon's room. Sienna helps Langdon to escape, and they flee to her apartment.\n\nAmong Langdon's personal belongings, Langdon and Sienna find a \"Faraday pointer\", a miniature image projector with a modified version of Sandro Botticelli's Map of Hell, which itself is based on Dante's Inferno. They soon realize this is the first clue in a trail left by Bertrand Zobrist (Ben Foster), a billionaire geneticist who believed that rigorous measures were necessary to reduce the Earth's growing population, and who committed suicide after being chased by armed government agents.\n\nLangdon and Sienna figure out that Zobrist, who is obsessed with Dante, has created a virus he has dubbed \"Inferno\", with the potential of halving the world's population. In the meantime, they have been traced by both Vayentha and agents from the World Health Organization (WHO), who raid the apartment, forcing them to flee again. Langdon's knowledge of Dante's work and history, and of hidden passages in Florence, allows the two to follow clues such as letters and phrases which lead to various locations in Florence and Venice, while evading the assassin and WHO. Along the way, Langdon discovers that he stole and hid the Dante Death Mask, a crucial clue, an event he also does not remember.\n\nVayentha reports to her employer Harry Sims (Irrfan Khan), the CEO of a private security company called \"The Consortium\", who is acting on behalf of Zobrist. The WHO agents are headed by Elizabeth Sinskey (Sidse Babett Knudsen), an old lover of Langdon's, and are trying to prevent the release of the virus. Zobrist has provided Sims with a video message about the virus, to be broadcast after it has been released. Shocked by its content, Sims allies with Sinskey to prevent the outbreak. However, Langdon and Sienna are contacted by Christoph Bouchard (Omar Sy), a man purporting to be working for WHO, warning them that Sinskey has a double agenda and is after the Inferno virus for her own profit. The three cooperate for a while, until Langdon realizes that Bouchard is lying and seeking to profit from Inferno himself, forcing the duo to flee on their own again.\n\nLangdon figures out that the virus is in the Hagia Sophia in Istanbul. With that knowledge, Sienna abandons Langdon, revealing that she was Zobrist's lover and that she will ensure the release of the virus. Zobrist and Sienna used to play treasure hunt games; this trail was the backup plan in case something happened to Zobrist. Langdon is recaptured by Bouchard, but is rescued by Sims and re-teams with Sinskey, who asked him for help in interpreting the imagery from the Faraday pointer. Sims reveals he was hired by Sienna to kidnap Langdon when Zobrist had been killed, and drugged with benzodiazepine to induce a memory loss; the events in the hospital were all staged.\n\nThey realize the virus is in a plastic bag hidden under water in the Basilica Cistern in Istanbul. The WHO team–along with Langdon, Sims, and Sinskey–race to locate and secure the bag, while Sienna and her allies attempt to detonate an explosive that will rupture the bag and aerosolize the virus. Sims is killed by Sienna, and when Langdon confronts her, she commits suicide in an attempt to release the virus. The detonation is able to rupture the bag but because it was already contained in a special containment unit, the virus was secured in time and Sienna's enforcers are killed. The virus is then taken by WHO, and Langdon goes back to Florence in order to return the Dante Death Mask.",
  "synopsis": "Michael \"Mike\" Regan is a self-made aviation tycoon who lives in a state-of-the-art smart home full of modern technologies with his wife, Rose, and their 17-year-old daughter, Kaitlyn. Mike is developing an app called \"Omni Jet\" which is designed to fly at a higher altitude and will be effective upon the approval of Securities and Exchange Commission (SEC).At the company, he meets the 28-year-old I.T. consultant, Ed Porter, and he calls Porter to fix the WiFi signal which his daughter complains is slow. Porter claims that he also worked at NSA and joins the military exercise in Kandahar, Afghanistan. Porter meets Kaitlyn and starts a relationship through social media. Mike fires Porter from work after Kaitlyn invites him to come in the house, although Kaitlyn describes Porter as being nice but Mike tells her that she is too young to have a boyfriend.Devastated, Porter begins to remotely access all the private sectors including Mike's house that he monitored, unbeknownst to Mike, through the security cameras and devices all over the house and he even spies and records Kaitlyn, unbeknown to her, masturbating in the shower room. One day, Porter takes full control of the house, which leaves the family terrified, and using a spoof email to Rose about her mammogram results saying that she tested positive for breast cancer, which leaves her devastated, but the truth is she's negative according to her attending physician. Mike realizes that Porter has done it, he attacks Porter and threatens to kill him if he does not stay away from his family.Porter then uploads the video of Kaitlyn masturbating, immediately catching the attention of her schoolmates, leaving Kaitlyn embarrassed. Kaitlyn blames her father for the technology installed in the house. Angered, Mike drives to Porter's apartment but he is also being monitored. Porter mockingly phones Mike through the car navigation system and sends the video of his daughter masturbating. Porter then remotely activates the car's brake system, hitting a nearby stalled truck and destroying the car.Mike gets help from I.T. expert Henrik who he asks for advice. Henrik states that Mike must destroy all the smart technology across the house and deletes all of the email and bank accounts and computer files. A little later, Henrik explains that he made a background check on Porter and found out that Porter's real name is Richard Edward Portman and his father committed suicide when he was six years old. He also reveals that Porter never worked in NSA, as he claimed, and the photo of him along with the soldiers in Kandahar was fake. In order to take the evidence from the apartment where Porter lives, Henrik makes a diversion by stealing a phone from a coffee shop waitress, Porter's obsessed girlfriend, and chats Porter to come at the coffee shop. While Porter's gone, Mike managed to take the thumb drives containing the evidence and escapes just as the Porter realizes it is a diversion. Realizing that the masked-man he saw in his apartment is Mike, Porter has him arrested him for assault and battery.After getting out of the precinct, Mike goes back to his home where Kaitlyn and Rose are tied up by Porter and being held at gunpoint. A struggle ensues, Porter shoots out a window and Mike punches Porter who hits his head, and lays dying as Mike holds the gun to his chest wanting to kill him, but Rose begs him not to and to turn him over to the police. Sirens are then heard in the background.Some time later, the employees applaud Mike and his family for successfully developing the app and their house is restored."
}