{
  "imdb_id": "tt2664074",
  "tmdb_id": "158943",
  "douban_id": null,
  "title": "Longing for the Rain (2013)",
  "genres": [
    "Biography",
    "Drama",
    "Mystery",
    "Romance"
  ],
  "country": "China",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm0946020",
      "name": "Tian-yi Yang"
    }
  ],
  "writer": [
    {
      "id": "nm0946020",
      "name": "Tian-yi Yang",
      "description": "writer as Lina Yang"
    }
  ],
  "cast": [
    {
      "id": "nm5496980",
      "name": "Siyuan Zhao",
      "character": "Fang Lei"
    },
    {
      "id": "nm5496404",
      "name": "Jia Fu",
      "character": ""
    },
    {
      "id": "nm5495389",
      "name": "Pongpazroj Dej",
      "character": "Man in the Dreams"
    },
    {
      "id": "nm5496256",
      "name": "Hong Xue",
      "character": "Fang Lei's Friend"
    }
  ],
  "overview": "Linking several genres in a surprising and successful way, Yang Lin’s fiction feature debut is an Asian ghost story in which documentary scenes show how incongruous today's reality can look in China. Protagonist Fang Lei lives in material wealth and only has to care for her daughter. One night, a young mysterious lover appears and makes passionate love to her.",
  "storyline": "Fang Lei, a Beijing housewife, is leading a peaceful and affluent life with her husband and daughter. Life goes by until one day a man appears in her dreams. His appearance is unclear, but the touch of his body is awakening a woman Fang Lei didn't know she could be. This shadow slowly becomes the lover she can't live without. Afraid of starting to loose her mind, she turns to a Taoist Monk for help. But the separation with her inner ghost is too painful and she soon returns to him.",
  "plot": "The Garden of Words is considered a romance and drama film. It opens at the start of the rainy season in Tokyo with Takao Akizuki (秋月 孝雄, Akizuki Takao?), a 15-year-old student and aspiring shoemaker, opting to skip his first class and sketch shoe designs in the garden at Shinjuku Gyoen. There he encounters Yukari Yukino (雪野 百香里, Yukino Yukari?), a 27-year-old woman who is skipping work and enjoying beer and chocolate. When she notices the school crest on his uniform, Yukino bids him farewell with a tanka (a form of Japanese poetry), leaving Takao puzzled as to its origin and meaning. The two continue to encounter each other and socialize in the park on rainy mornings, but never formally introduce themselves. After Yukino expresses an interest in Takao's shoemaking, he decides to make a pair of shoes in her size. With the end of the rainy season, Takao stops visiting the park and focuses on his work.\n\n\nなるかみの, すこしとよみて,さしくもり,あめもふらぬか,きみをとどめむ\n\n[A faint clap of thunder,Clouded skies,Perhaps rain will come.If so, will you stay here with me?]\nYukino in The Garden of Wordsfrom Man'yōshū, Book 11, verse 2,513\nFollowing summer break, Takao returns to school and spots Yukino. His friends inform him that she is a literature teacher and that she had been the target of gossip and bullying. Out of kindness and to avoid further confrontation, Yukino opted to avoid work and retreat to the park, hoping she would learn to overcome her fears and be able to \"walk\" again. However, Yukino quits her job and leaves the school. That afternoon, Takao meets Yukino at the park and greets her by reciting the 2,514th poem from the Man'yōshū Japanese poetry collection, the correct response to her tanka, which he found in a classic Japanese literature textbook. After getting soaked by a sudden thunderstorm, both head to Yukino's apartment and spend the afternoon together. When Takao confesses his love following dinner, Yukino is visibly moved, but then reminds him that she is a teacher and tells him that she is moving back to her home town on Shikoku. After Takao abruptly excuses himself, Yukino realizes her mistake and runs after him, finding him in the stairwell. Still upset, Takao angrily takes back what he had said and criticizes her for being so secretive and never opening up to him. Yukino embraces him and the two cry while she explains that their time together in the park had saved her.\n\n\nなるかみの,すこしとよみて,ふらずとも,われはとまらむ,いもしとどめば\n\n[A faint clap of thunder,Even if rain comes or not,I will stay here,Together with you.]\nTakao in The Garden of Wordsfrom Man'yōshū, Book 11, verse 2,514\nThe credits show Takao barely passing his final exams, but still working towards his goals, while Yukino moves back to Shikoku and resumes her teaching career. In a post-credits scene, Takao revisits the park that winter, reads a letter from Yukino, places her finished shoes on the bench and then vows that he will find her after he has made progress with his career.\n\nIn the manga illustrated by Midori Motohashi, scenes were either added or slightly modified from the anime version. For example, after the conclusion of the rainy season, Takao was unable to visit the park during the only rainy morning that summer because he had scheduled to visit the footwear college he wanted to attend, disappointing Yukino who had hoped to see him in the park. Also, at the conclusion of the story, Yukino is seen wearing the shoes Takao had made for her.",
  "synopsis": null
}