{
  "imdb_id": "tt2610798",
  "tmdb_id": "225313",
  "douban_id": null,
  "title": "Hanni & Nanni 3 (2013)",
  "genres": [
    "Family"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "87 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm0786186",
      "name": "Dagmar Seume"
    }
  ],
  "writer": [
    {
      "id": "nm0090067",
      "name": "Enid Blyton",
      "description": "novel"
    },
    {
      "id": "nm1557910",
      "name": "Christoph Silber",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm3556275",
      "name": "Jana Münster",
      "character": "Hanni"
    },
    {
      "id": "nm3552129",
      "name": "Sophia Münster",
      "character": "Nanni"
    },
    {
      "id": "nm0856918",
      "name": "Katharina Thalbach",
      "character": "Mademoiselle Bertoux"
    },
    {
      "id": "nm0902028",
      "name": "Suzanne von Borsody",
      "character": "Frau Mägerlein"
    },
    {
      "id": "nm0255678",
      "name": "Hannelore Elsner",
      "character": "Frau Theobald"
    },
    {
      "id": "nm0778189",
      "name": "Barbara Schöneberger",
      "character": "Daphne Diehl"
    },
    {
      "id": "nm0230649",
      "name": "Justus von Dohnányi",
      "character": "Hugh Gordon"
    },
    {
      "id": "nm0917088",
      "name": "Konstantin Wecker",
      "character": "Professor Konrad Kästner"
    },
    {
      "id": "nm3468229",
      "name": "Nele Guderian",
      "character": "Daniela"
    },
    {
      "id": "nm3958149",
      "name": "Luisa Spaniel",
      "character": "Lilly"
    },
    {
      "id": "nm3758679",
      "name": "Aleen Jana Kötter",
      "character": "Erika"
    },
    {
      "id": "nm3784622",
      "name": "Leopold Klieeisen",
      "character": "Clyde"
    },
    {
      "id": "nm5043307",
      "name": "Liam van Enschot",
      "character": "Seth"
    },
    {
      "id": "nm5843099",
      "name": "Carlos Knöpfel",
      "character": "Wuschel       (as Carlo Knöpfel)"
    },
    {
      "id": "nm6249412",
      "name": "Michelle Heik",
      "character": "Jette"
    },
    {
      "id": "nm6249413",
      "name": "Isabella Pasimeni",
      "character": "Isabella"
    },
    {
      "id": "nm6249414",
      "name": "Johann Florin",
      "character": "Joe"
    }
  ],
  "overview": "The Lindenhof School is expecting a busload of proper young English ladies as exchange students. The shock is great when the students turn out to be teenage boys! But while Mademoiselle Bertoux is delighted to stage “Romeo and Juliet” with real boys, both Hanni and her sister Nanni fall for their “Romeo,” Clyde.",
  "storyline": "After male english guest students arrive to Lindenhof, the school takes the chance to play Romeo and Juliet with the guest students. But since Clyde, crush boy of many Lindenhof girls gets the role of Romeo, fights over the role of Juliet cause trouble.",
  "plot": "Ten years after tracking down serial killer Jame Gumb, FBI Special Agent Clarice Starling is unjustly blamed for a botched drug raid. She is later contacted by Mason Verger, the only surviving victim of the serial killer Hannibal Lecter. A wealthy child molester, Verger was paralyzed and brutally disfigured by Lecter during a therapy session. He has been pursuing an elaborate scheme to capture, torture, and kill Lecter ever since. Using his wealth and political influence, Verger has Starling reassigned to Lecter's case, hoping her involvement will draw Lecter out.\n\nAfter learning of Starling's public disgrace, Lecter sends her a taunting letter. Starling detects a strange fragrance from the letter. A perfume expert later identifies a skin cream whose ingredients are only available to a few shops in the world. She contacts the police departments of the cities where the shops are located, requesting surveillance tapes. In Florence, one of said cities, Chief Inspector Rinaldo Pazzi is investigating the disappearance of a library curator. Pazzi questions Lecter, who is masquerading as Dr. Fell, the assistant curator and caretaker.\n\nUpon recognizing Dr. Fell in the surveillance tape, Pazzi accesses the ViCAP database of wanted fugitives. He then learns of Verger's US$3 million personal bounty on Lecter. Blinded by greed, Pazzi ignores Starling's warnings and attempts to capture Lecter alone. He recruits a pickpocket to obtain Lecter's fingerprint to show Verger as proof. The pickpocket, mortally wounded by Lecter, manages to get the print and gives it to Pazzi. Lecter baits Pazzi into an isolated room of the Palazzo Vecchio, ties him up, then disembowels and hangs him. He then heads back to the United States.\n\nVerger bribes Justice Department official Paul Krendler to accuse Starling of withholding a note from Lecter, leading to her suspension. Lecter lures Starling to Union Station. Verger's men, having trailed Starling, capture and bring Lecter to Verger. Verger means to feed Lecter alive to a herd of wild boars bred specifically for this purpose. After her superiors refuse to act, Starling infiltrates Verger's estate. After neutralizing the two guards and freeing Lecter she is shot by a third guard that was in hiding. Lecter picks up an unconscious Starling just before the boars break through the doors, they are on their way out when Verger arrives. He orders his physician Cordell Doemling to shoot Lecter, but with Lecter's suggestion, Cordell shoves his hated boss into the pen. Lecter carries Starling and watches the boars eat Verger alive.\n\nLecter takes Starling to Krendler's secluded lake house and treats her wounds. When Krendler arrives for the Fourth of July, Lecter subdues and drugs him. Starling, disoriented by morphine and dressed in a black velvet evening gown, awakens to find Krendler seated at the table set for an elegant dinner. Weakened by the drugs, she looks on in horror as Lecter removes part of Krendler's prefrontal cortex, sautés it, and feeds it to him.\n\nAfter the meal, Starling tries to attack Lecter but he overpowers her. She handcuffs his wrist to hers. Hearing the police closing in, Lecter threatens to sever her cuffed hand to escape. Lecter is later seen on a flight with his own boxed lunch, his arm in a sling. As he prepares to eat his meal, including what is assumed to be part of a cooked brain, a young boy seated next to him asks to try some of his food. Initially reluctant, Lecter then assents.",
  "synopsis": null
}