{
  "imdb_id": "tt2689866",
  "tmdb_id": "329862",
  "douban_id": null,
  "title": "A Second Chance: The Janelle Morrison Story (2013)",
  "genres": [
    "Documentary"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.3,
  "director": [
    {
      "id": "nm5509107",
      "name": "Rob Kelly"
    }
  ],
  "writer": [
    {
      "id": "nm5509727",
      "name": "Dave Kelly",
      "description": "written by"
    },
    {
      "id": "nm5509107",
      "name": "Rob Kelly",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm5509343",
      "name": "Janelle Morrison",
      "character": ""
    }
  ],
  "overview": "A Second Chance is the story of Janelle Morrison, a professional long distance triathlete who suffered a near-fatal car crash, and her battle to race again. Nearly every major bone in Janelle's body was broken and her organs pushed into her chest, forcing doctors to place her in a medically induced coma. As Morrison slept, doctors worked hard to reassemble her broken body, questioning whether she would ever walk again. Janelle's recovery was nothing short of miraculous, astonishing doctors every step of the way.",
  "storyline": "A Second Chance is the story of Janelle Morrison, a professional long distance triathlete who suffered a near-fatal car crash, and her battle to race again. Nearly every major bone in Janelle's body was broken and her organs pushed into her chest, forcing doctors to place her in a medically induced coma. As Morrison slept, doctors worked hard to reassemble her broken body, questioning whether she would ever walk again. Janelle's recovery was nothing short of miraculous, astonishing doctors every step of the way. Within three months she was walking without crutches and was able to run a few weeks later. She returned to training camps with her coach 7 months into her recovery and returned to professional racing less than two years from her horrific accident. This inspiring story follows Janelle's incredible road to recovery, from wheelchair to podium, giving audiences a unique insight to what it takes to chase a dream.",
  "plot": null,
  "synopsis": null
}