{
  "imdb_id": "tt2691734",
  "tmdb_id": "285843",
  "douban_id": null,
  "title": "October Gale (2014)",
  "genres": [
    "Drama",
    "Romance",
    "Thriller"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "91 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.2,
  "director": [
    {
      "id": "nm0618779",
      "name": "Ruba Nadda"
    }
  ],
  "writer": [
    {
      "id": "nm0618779",
      "name": "Ruba Nadda",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0165101",
      "name": "Patricia Clarkson",
      "character": "Helen"
    },
    {
      "id": "nm0005454",
      "name": "Scott Speedman",
      "character": "William"
    },
    {
      "id": "nm0000619",
      "name": "Tim Roth",
      "character": "Tom"
    },
    {
      "id": "nm0222593",
      "name": "Aidan Devine",
      "character": "Al Tessier"
    },
    {
      "id": "nm5306718",
      "name": "Eric Murdoch",
      "character": "Henry"
    },
    {
      "id": "nm0719678",
      "name": "Callum Keith Rennie",
      "character": "James"
    },
    {
      "id": "nm0533832",
      "name": "Billy MacLellan",
      "character": "Ed the Marina Guy"
    },
    {
      "id": "nm1595023",
      "name": "Dani Kind",
      "character": "Wait Staff"
    }
  ],
  "overview": "A doctor takes in a mysterious man who washes ashore at her remote cottage with a gunshot wound. Quickly they both learn the killer has arrived to finish the job, while a storm has cut them off from the mainland.",
  "storyline": "A doctor takes in a mysterious man who washes ashore at her remote cottage with a gunshot wound. Quickly they both learn the killer has arrived to finish the job, while a storm has cut them off from the mainland.",
  "plot": "Helen Matthews (Patricia Clarkson), is a widow still grieving the untimely death of her husband, James (Callum Keith Rennie). Against the wishes of her Son, Helen insists on going to the lake island cottage she and her husband used as a vacation home. Early the next morning, Helen leaves the cabin's dock, traveling up Georgian Bay to get groceries. After several miles, her launch's engine fails. Helen raises the Marina staff on her marine radio, who agree to repair her boat's engine in a few days, and he drops her back at her pier.\n\nOn her second night in the cabin, she is awakened by the sound of thunder. When she goes to investigate she finds a strange skiff tied up at her pier. There is a puddle of blood on the rear seat of the boat. Upon her return to the cabin, she finds blood on her cabin's door handle and a stranger (Scott Speedman), who has been shot in the shoulder and has crawled into her home looking for help.\n\nHelen, a doctor, performs surgery on the stranger's shoulder, removing a pistol round, then managing to tend to his wound and save him. The following day she tries to learn who shot Will, the stranger, but he refuses to tell her and insists on departing. However, he is too weak to leave and Helen allows him to return to the house.\n\nLater Al, a local handyman, comes by the house to enquire about odd job work. As we realize later, Al has spotted the boat Will had stolen. Will warns her not to let the man in the house as he will kill both of them but Helen, ignoring him, asks Al to tow both her and Will to shore. Al agrees, but instead unties both Helen and Will's boats from her dock and then departs. In an attempt to stop the boats from drifting off Helen dives into the water and nearly drowns before Will enters the water to save her. The next scene shows Will un-dressing Helen down to her underwear, and warming her the shower. Once out of the shower, she shares a kiss with Will\n\nWill eventually reveals that he accidentally killed a man in a bar fight and, despite serving time, the father of the man he killed is pursuing him and won't stop until he's dead. Helen meanwhile reveals that her husband died the previous year in October after being caught in a storm.\n\nHelen decides to try to help Will survive. They scour her home for bullets for their rifle and remove the dock from her home. Meanwhile, Al returns with Tom and the after searching the house unsuccessfully, they hunt for Helen and Will in the woods where the two have split up and are trying to hide. Helen tries to assault Tom by hitting him in the shoulder, but is unsuccessful. Instead, Tom punches her in the nose, taking away her rifle, returning her to the cabin. Tom tells her that Will was his adopted son, which he raised to look after his own biological son. Will killed his son because his son had attacked a woman, though Tom denied this. When Al bursts back into the cabin, complaining that Tom needed to help him search for Will in the woods. Suddenly, Tom shoots Al, believing that the shot will lure Will back to the cottage.\n\nAfter hearing the gunshot and fearing for Helen's life, Will does return to the house. Will and Tom speak softly of their regrets and share an intimate father and son hug on the porch. Inside the house, Helen remembers that when she and Tom had returned to the house having already had her rifle taken from her; Tom had ejected the cartridge that was in the rifle's chamber onto the floor. Tom then had put the rifles cartridge clip into his pocket, believing that he had disarmed her. Helen found the cartridge on the floor and managed to load the rifle. After Will apologizes, Tom lifts his gun with the intent of murdering Will. Suddenly Helen fires the single round killing Tom before he can hurt Will.\n\nThe following day in town after going to the police, Helen sees what she thinks is her dead Husband James. Only afterspeaking to him for a moment does she realize it is Will. He asks her to leave with him. The film ends with Helen contemplating a return Toronto and to her normal life... Or does she go with Will?",
  "synopsis": null
}