{
  "imdb_id": "tt2625270",
  "tmdb_id": "235478",
  "douban_id": null,
  "title": "To Fool a Thief (2013)",
  "genres": [
    "Comedy",
    "Crime",
    "Romance"
  ],
  "country": "Argentina",
  "version": [
    {
      "runtime": "105 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm1033668",
      "name": "Ariel Winograd"
    }
  ],
  "writer": [
    {
      "id": "nm1299489",
      "name": "Adrián Garelik",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0376655",
      "name": "Daniel Hendler",
      "character": "Sebastián"
    },
    {
      "id": "nm0078452",
      "name": "Valeria Bertuccelli",
      "character": "Mariana"
    },
    {
      "id": "nm0685289",
      "name": "Martín Piroyansky",
      "character": "Chucho"
    },
    {
      "id": "nm0706567",
      "name": "Pablo Rago",
      "character": "Mario"
    },
    {
      "id": "nm0508069",
      "name": "Juan Leyrado",
      "character": "Basile"
    },
    {
      "id": "nm0016039",
      "name": "Mario Alarcón",
      "character": "Pascual"
    },
    {
      "id": "nm1387176",
      "name": "Alan Sabbagh",
      "character": "Gerente"
    },
    {
      "id": "nm6102460",
      "name": "Luis Sagasti",
      "character": "Guntag"
    },
    {
      "id": "nm5455405",
      "name": "Esteban Balbi",
      "character": "Asistente Arquitecto Goicochea"
    },
    {
      "id": "nm5531197",
      "name": "Christian Cardoner",
      "character": "Sergio Goycochea"
    },
    {
      "id": "nm9224173",
      "name": "Hernán Crespo",
      "character": "Bellboy /              Patricio"
    },
    {
      "id": "nm5515903",
      "name": "Juan Pablo García",
      "character": "Seguridad Casa Basile"
    },
    {
      "id": "nm3882868",
      "name": "Iair Said",
      "character": ""
    }
  ],
  "overview": "Sebastian (Hendler) meets Natalia (Bertuccelli) when trying to steal an important piece of art from a museum, and she wins the hand. Rivals declared, the two have to work together later in a robbery more complex: a valuable and unique bottle of Malbec from Bordeaux in the mid-nineteenth century, listed as one of the best wines in the world and jealously guarded in the vault of a bank, in Mendoza.  In a world full of glamor, between vineyards and mountains, the thieves will have to display their magic, but while preparing discover theft, each to his own, that nothing will be as thought",
  "storyline": "Two professional thieves will have to work together to steal a unique bottle of wine kept safe inside a bank in Mendoza.",
  "plot": "The film opens with a narrator describing a prosperous city called the Golden City, ruled by the sleepy King Nod and protected by three golden balls atop its tallest minaret. According to a prophecy, the city would fall to a race of warlike, one-eyed monsters, known as \"One-Eyes\", should the balls be removed, and could only be saved by \"the simplest soul with the smallest and simplest of things\". Living in the city are the good-hearted cobbler Tack, named for the ubiquitous pair of tacks held in his mouth, and a nameless, unsuccessful yet persistent thief.\n\nWhen the thief sneaks into Tack's house, the two fight and stumble outside, causing Tack's tacks to fall onto the street. Zigzag, King Nod's Grand Vizier, steps on one of the tacks and orders Tack to be arrested while the thief escapes. Tack is brought before King Nod and his daughter, Princess Yum-Yum. Before Zigzag can convince Nod to have Tack executed by beheading, Yum-Yum saves Tack by breaking one of her shoes and ordering him to fix it. During repairs, Tack and Yum-Yum become increasingly attracted to each other, much to the jealousy of Zigzag, who plots to take over the kingdom by marrying the princess. Meanwhile, the thief notices the golden balls atop the minaret and decides to steal them. After breaking into the palace through a gutter, the thief steals the repaired shoe from Tack, prompting the cobbler to chase him through the palace. Upon retrieving the shoe, Tack bumps into Zigzag, who notices the shoe is fixed and imprisons Tack in a dungeon.\nFrom left to right: Tack the Cobbler, Zigzag the Grand Vizier, King Nod and Princess Yum-Yum. The character designs are a combination of UPA and classic Disney styles, and the overall style and flat perspective are inspired by Persian miniature paintings.\nThe next morning, Nod has a vision of the Golden City's destruction by the One-Eyes. While Zigzag tries to convince Nod of the kingdom's security, the thief steals the balls after several failed attempts, only to lose them to Zigzag's minions; Tack escapes from his cell using his cobbling tools during the ensuing panic. Nod notices the balls' disappearance when a mortally wounded soldier warns them of the invading One-Eyes. Zigzag attempts to use the stolen balls to blackmail the king into letting him marry Yum-Yum. When Nod dismisses him, Zigzag defects to the One-Eyes and gives them the balls instead.\n\nNod sends Yum-Yum, her nurse, and Tack to ask help from a \"mad and holy old witch\" in the desert. They are secretly followed by the thief, who hears of treasures on the journey but fails in stealing any. In the desert, they discover a band of dimwitted brigands, led by Chief Roofless, whom Yum-Yum recruits as her bodyguards. The protagonists reach the hand-shaped tower where the witch lives, and, after the witch kills herself, learn that Tack is prophesied to save the Golden City. The witch also presents a riddle: \"Attack, attack, attack! A tack, see? But it's what you do with what you've got!\" before destroying the entire tower with a storm cloud.\n\nThe protagonists return to the Golden City to find the One-Eyes' massive war machine approaching. Remembering the witch's riddle, Tack shoots a single tack into the enemy's midst, sparking a Goldberg-esque chain reaction that destroys the entire One-Eye army. Zigzag tries to escape, but falls into a pit where he is consumed by alligators and his fat lazy vulture, Phido. The thief, avoiding many deathtraps, steals the golden balls from the collapsing machine, only to have them taken from him by Tack. With peace restored and the prophecy fulfilled, the city celebrates as Tack and Yum-Yum marry. The story ends with the thief stealing its reel of film and running away.\nChanges made in subsequent versions\nThe Princess and the Cobbler (1993, Allied Filmmakers)\nThe Allied Filmmakers cut is drastically different from Williams's workprint. Four musical numbers have been added; the film originally had none. Many scenes have been cut: These primarily consist of scenes involving the thief, most notably his attempted theft of an emerald and his subsequent evasion of capital punishment for it, and the subplot wherein Zigzag tries to feed Tack to Phido. Also removed are any references to the maiden from Mombassa, whom Zigzag gives to King Nod as a \"plaything\" in the workprint. Tack, almost mute in the workprint, speaks several times and narrates most scenes in past tense; the workprint had narration only in the beginning by a voice-over. Some subplots have been added; in one, Yum-Yum is tired of living a life of \"regal splendor\", and wishes to prove her worth to her father. Another subplot sees the nurse initially disliking Tack, and scolding Yum-Yum for harboring romantic feelings for him, but warming to him later on. There are also several lines of alternate or removed dialogue.\nArabian Knight (1995, Miramax)\nThe Miramax cut includes all changes made in the Allied Filmmakers cut. In addition, several previously mute characters are given voices, most notably the thief, who narrates over all of his scenes in the form of an inner monologue. The Golden City is now referred to as Baghdad. Most scenes featuring the Mighty One-Eye's slave women in detail have been removed, although he can still be seen sitting on them. The sequence featuring the witch has been almost entirely removed, as is most of the climactic battle sequence, which had already been greatly shortened in the Allied cut. One-Eye's death is cut, though he can be heard crying: \"My machine!\" as the war machine burns, whereupon he presumably burns with it.\nThe Recobbled Cut (2006, 2007, 2013)\nGarrett Gilchrist's fan restorations mostly follow Richard Williams's workprint very closely, at least in their intent, using most of its original audio track and editing structure. In order to present a more complete film, Gilchrist added additional music (some from the released versions) and sound effects, and also included finished footage that does not appear in a finished state in the workprint, whether taken from the released versions or from other rare sources. Most of the story changes made by Fred Calvert and Miramax are not present, but it does include a few minor Calvert-only scenes or alterations, either as a side effect of using Calvert's footage for a major video source or because Gilchrist felt these scenes were useful to the plot. For this reason, Gilchrist does not refer to his edit as a \"Director's Cut.\"",
  "synopsis": null
}