{
  "imdb_id": "tt2662230",
  "tmdb_id": "224185",
  "douban_id": null,
  "title": "Flower Girl (2013)",
  "genres": [
    "Comedy",
    "Romance"
  ],
  "country": "Nigeria",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm3700303",
      "name": "Michelle Bello"
    }
  ],
  "writer": [
    {
      "id": "nm5795200",
      "name": "Jigi Bello",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm5270569",
      "name": "Damilola Adegbite",
      "character": "Kemi"
    },
    {
      "id": "nm3906542",
      "name": "Chris Attoh",
      "character": "Umar Abubakar"
    },
    {
      "id": "nm6170442",
      "name": "Blossom Chukwujekwu",
      "character": "Tunde Kulani"
    },
    {
      "id": "nm5496702",
      "name": "Chuks Chukwujekwu",
      "character": "Tunde"
    },
    {
      "id": "nm5519788",
      "name": "Eku Edewor",
      "character": "Sapphire"
    },
    {
      "id": "nm5795194",
      "name": "Bikiya Graham Douglas",
      "character": "Stella"
    }
  ],
  "overview": "Nigerian comedy about a young woman who wants to get married, but her boyfriend is only interested in furthering his career, so she seeks help to get him to tie the knot.",
  "storyline": "A romantic comedy in which a shy florist teams up with a movie star to push her life long boyfriend into proposing marriage",
  "plot": "Kemi works in her parents’ flower shop, and she dreams of becoming one of the happy married couples she sees every day. Her longtime lawyer boyfriend Umar has promised to marry her when he gets a promotion, but she is growing impatient. Still living with her embarrassing parents, she spends her nights in her room, planning the wedding she hopes to have someday. Then comes the day that she has been waiting for; Umar has got the promotion! However, when she arrives expecting a big proposal, he breaks up with her instead. Devastated, she goes on a delivery, and, unable to see where she is going through tears of grief, she gets hit by a car. The driver turns out to be Tunde Kulani, the famous Nollywood movie star.\n\nWhile Tunde tends to her wounds, Kemi breaks down and tells him about her dilemma. Tunde offers to help her get Umar to propose. They devise a plan. They will pretend to be a couple to make Umar jealous and get him back proposing on his knees.",
  "synopsis": null
}