{
  "imdb_id": "tt2677816",
  "tmdb_id": "180855",
  "douban_id": null,
  "title": "Settai (2013)",
  "genres": [
    "Comedy",
    "Crime"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "136 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.6,
  "director": [
    {
      "id": "nm1583171",
      "name": "R. Kannan"
    }
  ],
  "writer": [
    {
      "id": "nm1892316",
      "name": "John Mahendran",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1951127",
      "name": "Arya",
      "character": "Jayaganthan (J K Boss)       (as Aarya)"
    },
    {
      "id": "nm1394426",
      "name": "Hansika Motwani",
      "character": "Madhu"
    },
    {
      "id": "nm3592766",
      "name": "Anjali",
      "character": "Shakthi"
    },
    {
      "id": "nm1962272",
      "name": "Santhanam",
      "character": "Nagaraj (Nadupakka Nakki)"
    },
    {
      "id": "nm2908893",
      "name": "Premgi Amaren",
      "character": "Cheenu"
    },
    {
      "id": "nm0621937",
      "name": "Nassar",
      "character": "Gangster       (as Nasser)"
    },
    {
      "id": "nm0019382",
      "name": "Ali",
      "character": "House Owner"
    },
    {
      "id": "nm0793851",
      "name": "Sayaji Shinde",
      "character": ""
    },
    {
      "id": "nm1007581",
      "name": "Manobala",
      "character": "Dance Teacher"
    },
    {
      "id": "nm1420794",
      "name": "Chitra Lakshmanan",
      "character": "Murugaraj"
    },
    {
      "id": "nm4082417",
      "name": "Subbu Panchu",
      "character": "(as Panchu Subbu)"
    },
    {
      "id": "nm3847450",
      "name": "Suja",
      "character": "Actress"
    },
    {
      "id": "nm4958823",
      "name": "Balaji",
      "character": "Neelakandan"
    },
    {
      "id": "nm2511745",
      "name": "Ashwin Mushran",
      "character": "Richard"
    },
    {
      "id": "nm5542015",
      "name": "Nakshathra",
      "character": "Gayathri"
    },
    {
      "id": "nm1911617",
      "name": "Neetu Chandra",
      "character": "Special Appearance"
    },
    {
      "id": "nm6997072",
      "name": "Natarajan Balkrishna",
      "character": "Cameo       (as Natarajan Balakrishnan)"
    },
    {
      "id": "nm3901254",
      "name": "A.R. Manikandan",
      "character": "Hotel waiter"
    },
    {
      "id": "nm6442108",
      "name": "Kalyani N.",
      "character": "Cameo       (as Kalyani Natarajan)"
    }
  ],
  "overview": "Three struggling room-mates unknowingly become potential prey of a ruthless gangster",
  "storyline": "Madhu (Hansika) agrees to deliver a package for her friend and asks her fiancé, Jayakanthan (Arya), to do it for her. Jayakanthan, in turn, asks one of two of his room-mates, Nagaraj (Santhanam). But Nagaraj forgets to do so and asks the third roommate Cheenu (Premji) to deliver the package. A gangster (Nasser) who was the recipient of this package, starts by brutally questioning Madhu's friend, and finds out that the package may be in the possession of the trio. While Jayaganthan must deal with his attraction for Journalist Shakthi (Anjali) and he still has to fully come to terms whether or not he wants to marry Madhu. And the entry of ruthless gangster seriously jeopardizes any plans Jayaganthan and his friends may have for the future.",
  "plot": "Journalist J.K. Boss (Arya), photographer Nagaraj (N. Santhanam) and Cheenu (Premgi Amaren) are roommates leading an unkempt and debt-ridden life in a shoddy apartment. J.K.'s ditsy fiancée, Madhumita (Hansika Motwani), is an air hostess who agrees to deliver a package for Vladimir Dragunsky (Kim Bodnia) to Somayajulu (Nassar), without realizing its contents or that Somayajulu is a gangster. Madhumita asks J.K. to deliver the package. J.K., in turn, asks Nagaraj to do so. But Nagaraj is unable to do so as he is experiencing 'Chennai Belly'. Nagaraj hands Madhumita's package to Cheenu for delivery to Somayajulu, along with a package containing his stool sample for delivery to Nagaraj's doctor. Cheenu mixes up the two packages which makes Somayajulu furious and he starts the investigation by interrogating Vladimir.\n\nMeanwhile, Nagaraj photographs his landlord with a prostitute. He sends an envelope with the photographs to his landlord to blackmail him. J.K. is with Madhumita, and his colleague Shakthi (Anjali) calls him on the pretext of work. When he reaches the place he realizes that it is just a party and Shakthi called him just to have fun. Rajeev, who was supposed to be Shakthi's husband, sees them together and gives J.K. a black-eye in a fit of jealousy. J.K. retaliates and knocks Rajeev out. As J.K. and Shakthi leave, they are chased by a furious Rajeev and his friends who shoot at them. The duo barely manages to escape.\n\nVladimir informs Somayajulu that the mix-up must have been caused by Madhumita as she didn't know what she was carrying in the package. Somayajulu calls Madhumita, informs her about the mix-up and asks her to give him the address of the person who had delivered the package. When J.K. arrives into his apartment, he walks into Somayajulu who has Cheenu standing on a stool with a noose around his neck. On hard interrogation, Somayajulu discovers the mix-up and realizes that the package must be with Nagaraj's doctor.\n\nNagaraj gets the package from his doctor's office, wherein Somayajulu finds his thirty diamonds hidden inside. Upon recovering his booty, he orders his henchmen to kill the three roommates. One of them is about to shoot J.K., when another kicks the stool on which cheenu was standing to hang him. Luckily for the roommates, the ceiling of the apartment caves in, since it can't take Cheenu's weight. The cave-in injures and knocks-out Somayajulu and his men. J.K., Cheenu and Nagaraj escape along with the diamonds and spend the night at Shakthi's place. The next day they sell the diamonds to a local jewellery store.\n\nAs the roommates prepare to get out of town with the money, they get a call from Somayajulu who has kidnapped Madhumita. He threatens to kill her if they don't return the diamonds. The trio, try to buy back the diamonds from the jewelry store, who demands double the sale amount.\n\nWithout the money, J.K. comes up with a plan. Nagaraj, Cheenu, J.K. and Shakthi disguise themselves in burqa and go back to the jewelry store. They con the owner, gag him and forcefully take back their diamonds and return his money. They make their get-away in J.K.'s car with the police on their tail and make their way to the hotel where Somayajulu is holding Madhumita. As they are about to make the exchange with Somayajulu, the police arrive at the hotel room. There is a shoot-out between the police and Somayajulu's gang.\n\nNagaraj, Cheenu, J.K and Madhumitha, who had hit the floor during gunfight,are left as the only survivors. Shakthi is upset to learn about J.K.'s engagement and walks away from him. J.K. breaks off his engagement to Madhumitha. Later, it is revealed that Nagaraj did not return the cash to the jewellery store owner, and had kept the money for himself. The film ends when Shakthi comes to the roommates' apartment to return J.K.'s car's hubcap lost while escaping from Rajeev. J.K. jumps into her car through the open window and kisses in her lips passionately.",
  "synopsis": null
}