{
  "imdb_id": "tt2631186",
  "tmdb_id": "256040",
  "douban_id": null,
  "title": "Baahubali: The Beginning (2015)",
  "genres": [
    "Action",
    "Drama"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "159 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.4,
  "director": [
    {
      "id": "nm1442514",
      "name": "S.S. Rajamouli"
    }
  ],
  "writer": [
    {
      "id": "nm2353436",
      "name": "Vijayendra Prasad",
      "description": "story"
    },
    {
      "id": "nm1442514",
      "name": "S.S. Rajamouli",
      "description": "screenplay"
    },
    {
      "id": "nm7448575",
      "name": "C.H. Vijay Kumar",
      "description": "telugu dialogue &"
    },
    {
      "id": "nm4488268",
      "name": "Ajay Kumar",
      "description": "telugu dialogue"
    },
    {
      "id": "nm4157919",
      "name": "Madhan Karky",
      "description": "tamil dialogue"
    },
    {
      "id": "nm4191232",
      "name": "Manoj Muntashir",
      "description": "hindi dialogue"
    }
  ],
  "cast": [
    {
      "id": "nm1659141",
      "name": "Prabhas",
      "character": "Shivudu /              Baahubali"
    },
    {
      "id": "nm2281292",
      "name": "Rana Daggubati",
      "character": "Bhallaladeva"
    },
    {
      "id": "nm0471447",
      "name": "Ramya Krishnan",
      "character": "Shivagami       (as Ramya Krishna)"
    },
    {
      "id": "nm0766470",
      "name": "Sathyaraj",
      "character": "Kattappa"
    },
    {
      "id": "nm2011932",
      "name": "Anushka Shetty",
      "character": "Devasena"
    },
    {
      "id": "nm1961459",
      "name": "Tamannaah Bhatia",
      "character": "Avanthika       (as Tamannaah)"
    },
    {
      "id": "nm0621937",
      "name": "Nassar",
      "character": "Bijjaladeva       (as Nasser)"
    },
    {
      "id": "nm1679372",
      "name": "Sudeep",
      "character": "Aslaam Khan"
    },
    {
      "id": "nm7319988",
      "name": "Prabhakar",
      "character": "Kalakeya War Lord"
    },
    {
      "id": "nm6845066",
      "name": "Rajsekhar Aningi",
      "character": "Bhalladeva Samantha Raju"
    },
    {
      "id": "nm4992192",
      "name": "Gabriela Bertante",
      "character": ""
    },
    {
      "id": "nm9860260",
      "name": "Bhanu Sri",
      "character": ""
    },
    {
      "id": "nm0080238",
      "name": "Tanikella Bharani",
      "character": "Swamiji"
    },
    {
      "id": "nm6598222",
      "name": "Nora Fatehi",
      "character": "Dancer in Green Blouse"
    },
    {
      "id": "nm9842626",
      "name": "Sri Simha Koduri",
      "character": ""
    },
    {
      "id": "nm4071279",
      "name": "John Kokken",
      "character": "Kalki Brothers"
    },
    {
      "id": "nm9637391",
      "name": "Venkat Prasad",
      "character": ""
    },
    {
      "id": "nm1094188",
      "name": "Rohini",
      "character": "Sanga"
    },
    {
      "id": "nm0765349",
      "name": "Subbaraya Sarma",
      "character": ""
    },
    {
      "id": "nm3414188",
      "name": "Adivi Sesh",
      "character": "Bhadra"
    },
    {
      "id": "nm8198252",
      "name": "Madhussneha Upadhyay",
      "character": "Dancer in Blue Blouse       (as Sneha Upadhyay)"
    },
    {
      "id": "nm4828532",
      "name": "Venkat Vadisetti",
      "character": "Hero friend       (as Venkataramana Vadisetti)"
    },
    {
      "id": "nm6004604",
      "name": "Rakesh Varre",
      "character": "Bhallaladeva's Soldier"
    },
    {
      "id": "nm5805978",
      "name": "Scarlett Mellish Wilson",
      "character": "Dancer in Orange Blouse       (as Scarlett Wilson)"
    },
    {
      "id": "nm3746935",
      "name": "Preity Üpala",
      "character": "Tapsi Awhan"
    }
  ],
  "overview": "The young Shivudu is left as a foundling in a small village by his mother. By the time he’s grown up, it has become apparent that he possesses exceptional gifts. He meets the beautiful warrior/princess Avanthika and learns that her queen has been held captive for the last 25 years. Shividu sets off to rescue her, discovering his own origins in the process.",
  "storyline": "When Sanga and her husband, part of a tribe living around the province of Mahismathi, save a drowning infant, little do they know the background of the infant or what the future holds for him. The kid grows up to as Shivudu, a free-spirit wanting to explore the mountains and in the process learns of his roots and then realizes the whole purpose of his life and ends up confronting the mighty Bhallala Deva!",
  "plot": "In the ancient Kingdom of Mahishmati in India, Sivagami, the queen (Ramya Krishnan), emerges from a cave adjoining a big waterfall, carrying a baby. She kills the soldiers pursuing her and sacrifices herself to save the baby by holding the baby up over the surface of the water while she herself drowns. Local tribal communities save the baby and tribal queen adopts him. She also gives him the name 'Shiva'.\n\nShiva (Prabhas) grows up to be a strong young man aspiring to ascend the mountain and makes many unsuccessful attempts at it. He then finds a mask of a girl which falls from the waterfall. Driven to find out the identity of the girl, he climbs the mountain again and succeeds this time.\n\nOn top of the waterfall, Shiva discovers that the mask belongs to Avanthika (Tamannaah), a rebellious warrior whose group has indulged in a guerilla warfare against king Bhallala Deva / Pallvalathevan (Rana Daggubati) of the Mahishmati Kingdom. The group intends to rescue their former queen Devasena (Anushka Shetty) who has been chained in the kingdom for the past 25 years. Avanthika is given the opportunity to rescue the queen.\n\nShiva approaches Avanthika while she is on her journey to Mahishmati. Although she is stubborn at first, Avanthika falls in love with Shiva after she finds out that he has climbed the waterfall for her. Shiva pledges to help her in her mission and sneaks into&#160;Mahishmati to rescue Devasena. Shiva rescues her and flees along with her but is chased down by the king's Royal slave Kattappa (Sathyaraj), known for his great warrior abilities. After Shiva beheads Bhadra (Adivi Sesh), Bhallala Deva's son, Kattappa drops his weapons on realising that Shiva is Mahendra Baahubali, the son of late king Amarendra Baahubali.\n\nA flashback reveals Amarendra Bahubali's past. Amarendra's mother died while giving birth to him, while his father had died much before that. Sivagami takes charge of running the kingdom with Kattapa's assistance until a new king is elected. Amarendra Bahubali and Bhallala Deva are brought up together, trained in all areas including arts, science, disguise, politics and warfare, but both of them have different approaches towards kingship. Amarendra Baahubali is liberal to everyone but Bhallala Deva is violent and achieves his goals with any means possible, even trying to kill Baahubali.\n\nWhen the Kalakeyas start a war with the Mahishmati, Sivagami promises that the new king will be the one who beheads the Kalakeya king. When it seems that Mahishmati would end up being defeated, Amarendra inspires his soldiers to fight to the death and they end up crushing the enemy. Despite Bhallala Deva being the one to kill the Kalakeya king, Sivagami announces Amarendra Baahubali as the new emperor because of his nobility and leadership in the war.\n\nAfter the flashback, when asked about Amarendra's current whereabouts, a tearful Katappa reveals that the King is dead, and that Katappa himself is the one responsible for his death. The movie ends in a cliffhanger, leaving the viewer with a surplus of unanswered questions.",
  "synopsis": "A film depicting a battle between 2 brothers. Shiva is an orphan being raised by the tribe that found him in the middle of a river, help up by a solitary hand belonging to a mysterious lady (who drowns). Upon seeing the killed soldiers nearby, they understand that the newborn is at danger. They chance upon a tunnel, probably leading to the mighty kingdom up above. A combination of fear at what they might encounter up there and hope of having their own child, having no children of their own, makes them close out the tunnel.Shiva grows up to be a strong and curious boy who longs to see what surprises the world holds. He's ready to risk his life in an endeavor to climb up the waterfall and look, but keeps failing. His mother, perturbed by his insistence, plans to appease the Lord Shiva by pledging an \"abhisheka\" (cleansing the Shiva's statue - Shiva Linga with water) 100 pots of water that she'll carry from the waterfall. Shiva pleads her to stop, but when she doesn't, he (literally) takes matters into his own hands and uproots the Shiva Linga (a mighty task, known to be done by only Nandi - Shiva's utmost devotee) and plants it right under the Waterfall. It appears that he (instead of his mother) has the Lord's blessings, as a mask falls down the waterfall and intrigues him further.Shiva happens to put down the mask in sand and it seems to belong to a lady. Having gotten an indication of people living up the mountain, he tries with all his heart (imagining himself to be chasing a beautiful girl), succeeds in climbing up the mountain (amid stunning visuals and thrilling stunts). There he encounters a beautiful girl, who turns out to be an assassin pledged to avenge and free their clan's queen who has been imprisoned in the midst of Mahishmati Kingdom (the most powerful kingdom their side of the world). The movie stutters between some romantic, funny and intense sequences and ends up saving the girl from an army unit belonging to Mahishmati. Shiva makes the girl stay and pledges to free her queen, if that's what it takes for them to be together and leaves.Mahishmati Kingdom is shown to be full of horrors, where citizens are ill treated and downtrodden. Shiva enters the kingdom and manages to free the queen (Devasena), but is caught by the Prince and his army unit. He has to escape before Katappa - the feared warrior who is close on their heels, reaches to protect the prince and take them back. The Prince insults Devasena and antagonizes Shiva. Shiva breaks free owing to his raw power and almost kills the Prince, but Katappa reaches and tries to save him. Shiva somehow manages to still be-head the Prince and Kattappa tries to kill Shiva. Upon seeing Shiva's face properly, he drops his weapon, falls down on his knees and kisses Shiva's feet while calling him Baahubali.Meanwhile, Shiva's tribe have been searching for him for many days and realize he has finally climbed up the mountain. They re-open the tunnel and go up. On the other side, Shiva's Girlfriend (Avanthika) brings along her own army. Both these groups chance upon Shiva killing the Prince. When they see Kattappa bowing down to Shiva, they exchange stories and it turns out Shiva is none other than the rightful heir to the Throne of Mahishmati, son of King Baahubali. Bhallala Deva had assasinated Baahubali and tried to kill Shiva, but Sivagami (the lady who saved the newborn Shiva, even though she drowned in the attempt) saved him and went down the tunnel.Shiva wants to know the full story, and the story shifts to the erstwhile Mahishmati kingdom, where we find out that a long time ago, the just king died leaving behind a pregnant queen. The queen dies during childbirth and the newborn's aunt (Rajamata Sivagami) names him Baahubali. The dead Kings jealous brother (Bijjala Deva) craves to take over the throne but isn't able to as his wife Sivagami is more able and just. Sivagami pronounces that her own child (Bhallala Deva) and Baahubali have equal claim to the throne and the one who proves himself worthy shall inherit it. Both Bhalla and Baahu grow up to be fierce, powerful, wise and mighty warriors under the tutelage of Kattappa (the royal bodyguard and head of the army, but sworn to serve whomsoever is the king). Bhalla inherits jealousy from his father, unbeknownst to both Baahubali and Sivagami.A Spy steals the kingdom's military secrets and gets out. The princes catch hold of him, but not before he manages to sell the information to Kalakeya's (fearsome raiders with an army four times Mahishmati's forces and a king known to be as fierce as despicable). Sivagami pronounces that this would be the ideal test to figure out the king to the throne. As the Kalakeya King has insulted her, she wants the princes to kill him and will declare the one who succeeds as the King to the Throne. Amid a spectacular battle sequence, Baahubali tends to overpower Kalakeya, but Bhallala Deva kills him (sort of interrupts Baahubali who was the one who actually beats Kalakeya). Baahubali, being just doesn't mind this and seems happy for his brother, but Sivagami pronounces Baahubali as the king, having seen his superior strategy, battle skills, bravado and willingness to think of his subjects first.The scene shifts to Shiva who asks how did such a fierce warrior die, and Kattappa says he killed Baahubali (amid tears). This is where part 1 ends."
}