{
  "imdb_id": "tt2616010",
  "tmdb_id": "172268",
  "douban_id": null,
  "title": "Alone with You (2013)",
  "genres": [
    "Drama",
    "Thriller"
  ],
  "country": "Argentina",
  "version": [],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm0496029",
      "name": "Alberto Lecchi"
    }
  ],
  "writer": [
    {
      "id": "nm0496029",
      "name": "Alberto Lecchi",
      "description": null
    },
    {
      "id": "nm5619618",
      "name": "Leonardo Siciliano",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0317725",
      "name": "Ariadna Gil",
      "character": "María"
    },
    {
      "id": "nm0768614",
      "name": "Leonardo Sbaraglia",
      "character": "Fuster"
    },
    {
      "id": "nm1076601",
      "name": "Sabrina Garciarena",
      "character": "Florencia"
    },
    {
      "id": "nm1417272",
      "name": "Gonzalo Valenzuela",
      "character": "Ezequiel"
    },
    {
      "id": "nm0083217",
      "name": "Antonio Birabent",
      "character": "Torres"
    },
    {
      "id": "nm0039956",
      "name": "Hugo Astar",
      "character": "Fermín"
    },
    {
      "id": "nm1015451",
      "name": "Atilio Pozzobon",
      "character": "Cura"
    },
    {
      "id": "nm0129322",
      "name": "Raúl Calandra",
      "character": "Baigorria"
    },
    {
      "id": "nm3694331",
      "name": "Mariano Caligaris",
      "character": "Danese"
    },
    {
      "id": "nm0719370",
      "name": "Fabián Rendo",
      "character": "Abogado"
    },
    {
      "id": "nm4142419",
      "name": "Miguel Dao",
      "character": "Subinspector Aguirre"
    },
    {
      "id": "nm3015902",
      "name": "Ariel Nuñez Di Croce",
      "character": "Flores"
    },
    {
      "id": "nm1172096",
      "name": "Diego Freigedo",
      "character": "Ayudante Vázquez       (as Diego Freijedo)"
    },
    {
      "id": "nm10672427",
      "name": "Anna Fantoni",
      "character": "Jessica (Hija 11)"
    },
    {
      "id": "nm10672428",
      "name": "Agustina Navone",
      "character": "Lorena (Hija 13)"
    },
    {
      "id": "nm1307459",
      "name": "Pablo Ini",
      "character": "Vendedor Mueblería"
    },
    {
      "id": "nm10672429",
      "name": "Agustina Ipiña",
      "character": "Notera Valeria"
    },
    {
      "id": "nm7046790",
      "name": "Lucas Merayo",
      "character": "Muchacho 1"
    },
    {
      "id": "nm10672430",
      "name": "Martín Killi Prado",
      "character": "Muchacho 3       (as Martin Killi Prado)"
    },
    {
      "id": "nm10672431",
      "name": "Hernán Yanco",
      "character": "Empleado Shopping 1"
    },
    {
      "id": "nm9745455",
      "name": "Homero González",
      "character": "Empleado Shopping 2"
    },
    {
      "id": "nm10672432",
      "name": "Ana Sol Altmark",
      "character": "Mujer Tren"
    },
    {
      "id": "nm10672433",
      "name": "Marcelo Durán",
      "character": "Raúl (Mozo Bar)"
    },
    {
      "id": "nm8850733",
      "name": "Martín Sochi",
      "character": "Mozo Restaurante       (as Martin Sochi)"
    },
    {
      "id": "nm1925382",
      "name": "Carlos Delger",
      "character": "Choffer Ejercito Salvación       (as Carlos Delguer)"
    },
    {
      "id": "nm10672434",
      "name": "Gustavo Decurgez",
      "character": "Dr. Alejandro Piñeiro"
    },
    {
      "id": "nm10672435",
      "name": "Gabriela Lecchi",
      "character": "Farmacéutica 1"
    },
    {
      "id": "nm10672436",
      "name": "Rocío Cittadini",
      "character": "Niña Chorra"
    },
    {
      "id": "nm1705194",
      "name": "Federico Barga",
      "character": "Niño Chorro"
    },
    {
      "id": "nm0068615",
      "name": "Joselo Bella",
      "character": "Cliente Farmacia       (as Joselo Bello)"
    },
    {
      "id": "nm10672437",
      "name": "Carmen Conforti",
      "character": "Enfermera"
    },
    {
      "id": "nm10672438",
      "name": "Carolina Varas",
      "character": "Recepcionista Terapia"
    },
    {
      "id": "nm10672439",
      "name": "Victoria Navone",
      "character": "Lorena (Hija 5)"
    },
    {
      "id": "nm10672440",
      "name": "Annie Zeller",
      "character": "Jessica (Hija 3)"
    },
    {
      "id": "nm5908463",
      "name": "Iván Steinhardt",
      "character": "Hombre Mirón Bar       (as Ivan Steinhardt)"
    },
    {
      "id": "nm10672441",
      "name": "Alejandra Tossi",
      "character": "Laura (Mujer Baigorria)"
    },
    {
      "id": "nm10672442",
      "name": "José Jurafsky",
      "character": "Saxofonista       (as Jose Jurafsky)"
    },
    {
      "id": "nm0763231",
      "name": "Carlos Santamaría",
      "character": "Voz en Off"
    }
  ],
  "overview": "Maria, a 45-year-old alcoholic woman who lives in Spain, has lost custody of her daughters. That's the reason why she has traveled to Argentina, the country in which her daughters are living with her ​​ex-husband, whom she divorced after a tempestuous marriage.",
  "storyline": null,
  "plot": "In 1945, Logan is held in a Japanese POW camp near Nagasaki. During the atomic bombing of Nagasaki, Logan rescues an officer named Ichirō Yashida and shields him from the blast.\n\nIn the present day, Logan lives as a hermit in Yukon, tormented by hallucinations of Jean Grey, whom he was forced to kill (X-Men: The Last Stand). He is located by Yukio, a mutant with the ability to foresee people's deaths, on-behalf of Yashida, now the CEO of a technology zaibatsu. Yashida, who is dying of cancer, wants Logan to accompany Yukio to Japan so that he may repay his life debt. In Tokyo, Logan meets Yashida's son, Shingen, and granddaughter, Mariko. There, Yashida offers to transfer Logan's healing abilities into his own body, thus saving Yashida's life and alleviating Logan of his near-immortality, which Logan views as a curse. Logan refuses and prepares to leave the following day. That night, Yashida's physician Dr. Green (also known as Viper) introduces something into Logan's body, but Logan dismisses it as a dream.\n\nThe next morning, Logan is informed that Yashida has died. At the funeral, Yakuza gangsters attempt to kidnap Mariko, but Logan and Mariko escape together into the urban sprawl of Tokyo. Logan is shot and his wounds do not heal as quickly as they should. After fighting off more Yakuza on a bullet train, Logan and Mariko hide in a local love hotel. Meanwhile, Yashida's bodyguard Harada meets with Dr. Green who, after demonstrating her mutant powers on him, demands he find Logan and Mariko. Logan and Mariko travel to Yashida's house in Nagasaki, and the two slowly fall in love. Meanwhile, Yukio has a vision of Logan dying, and goes to warn him. Before Yukio arrives, Mariko is captured by the Yakuza. After interrogating one of the kidnappers, Logan and Yukio confront Mariko's fiancé, corrupt Minister of Justice Noburo Mori. Mori confesses that he conspired with Shingen to have Mariko killed because Yashida left control of the company to Mariko, and not Shingen.\n\nMariko is brought before Shingen at Yashida's estate when ninjas led by Harada attack and whisk her away. Logan and Yukio arrive later and, using Yashida's X-ray machine, discover a robotic parasite attached to Logan's heart, suppressing his healing ability. Logan cuts himself open and extracts the device. During the operation, Shingen attacks but Yukio holds Shingen off long enough for Logan to recover and kill Shingen. Logan follows Mariko's trail to the village of Yashida's birth, where he is captured by Harada's ninjas. Logan is placed in a machine by Dr. Green, who reveals her plans to extract his healing factor and introduces him to the Silver Samurai, an electromechanical suit of Japanese armour with energized swords made of adamantium. Mariko escapes from Harada, who believes he is acting in Mariko's interests, and manages to free Logan from the machine. Harada sees the error of his ways and is killed by the Silver Samurai while helping Logan escape.\n\nMeanwhile, Yukio arrives and kills Dr. Green as Logan fights the Silver Samurai. The Silver Samurai severs Logan's adamantium claws and begins to extract Logan's healing abilities, revealing himself to be Yashida, who had faked his death. Yashida starts to regain his youth, but Mariko intervenes and stabs Yashida with Logan's severed claws while Logan regenerates his bone claws and kills Yashida. Logan collapses and has one final hallucination of Jean, in which he decides to finally let go of her. Mariko becomes CEO of Yashida Industries and bids farewell to Logan as he prepares to leave Japan. Yukio vows to stay by Logan's side as his bodyguard, and they depart to places unknown.\n\nIn a mid-credits scene, Logan returns to the United States two years later and is approached at the airport by Erik Lehnsherr, who warns him of a grave new threat to the mutant race, and Charles Xavier, who Logan previously thought was dead.",
  "synopsis": null
}