{
  "imdb_id": "tt2609706",
  "tmdb_id": "256935",
  "douban_id": null,
  "title": "Ruben's Place (2012)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "71 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm5446694",
      "name": "Sam Vasquez"
    }
  ],
  "writer": [
    {
      "id": "nm5446694",
      "name": "Sam Vasquez",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm3683061",
      "name": "Vint Carmona",
      "character": ""
    },
    {
      "id": "nm4609543",
      "name": "David L. Klein",
      "character": "Ruben's Father       (as David Louis Klein)"
    },
    {
      "id": "nm4513551",
      "name": "Jason Lieu",
      "character": "Jimmy"
    },
    {
      "id": "nm9058530",
      "name": "Heywood McGuffee",
      "character": "Mr. Rugglebee"
    },
    {
      "id": "nm4588308",
      "name": "Dawson Montoya",
      "character": "Ruben"
    },
    {
      "id": "nm3780240",
      "name": "Solana Paz",
      "character": "Mercedes       (as Solana Crawford)"
    },
    {
      "id": "nm2354007",
      "name": "Ray Renati",
      "character": "Uncle Vic"
    },
    {
      "id": "nm4189188",
      "name": "Ulises Toledo",
      "character": "Puck"
    },
    {
      "id": "nm4743697",
      "name": "Samuel Vasquez",
      "character": "Producer"
    }
  ],
  "overview": "A slice of life story about a young man named Ruben, who returns home to take care of his ailing father. He reconnects with his boyhood friend Jimmy after starting a job with his Uncle.",
  "storyline": "A slice of life story about a young man named Ruben, who returns home to take care of his ailing father. He reconnects with his boyhood friend Jimmy after starting a job with his Uncle.",
  "plot": "Ranga (Sunil) leads a happy and normal life with his family members. One day two men offers Ranga to buy 30 acres. Innocent Sunil who is unaware of the risk, agrees for the offer. He sells his home which was kept for his younger sister marriage to buy the land. The land which Ranga bought was present in the middle with each of 300 acres on either side belonging to Konda Reddy (Dev Gill) and Lala Goud (Pradeep Rawat) both of them are local dons in that village and would kill if any person tries to buy the land. Ranga left his house and reaches the village to see his newly bought land, between he don't know the fact that he got cheated by buying that land which is under litigation. Soon after arriving the village, he meets his old friend Vasu (Ali), Vasu warns ranga to leave the place and forget about his land revealing the danger about that place. Poor Ranga decides to sell his land and get the money for his sister marriage. Now the story revolves with ranga joining as a member of Konda Reddy batch between Lala Goud daughter Anitha falls in love with Ranga. Ranga doesn't know the fact that Anitha loves him. There is flashback revealing Konda Reddy sister eloping with Lala Goud who was a worker under Konda Reddy's father before. Angry Konda Reddy wants to take revenge on Lala Goud by marrying his daughter for the sake of torturing her. The story continues and ends how Ranga battles against Konda Reddy and wins his love.",
  "synopsis": null
}