{
  "imdb_id": "tt2699840",
  "tmdb_id": "223806",
  "douban_id": null,
  "title": "John Day (2013)",
  "genres": [
    "Drama"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "138 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm1805430",
      "name": "Ahishor Solomon"
    }
  ],
  "writer": [
    {
      "id": "nm3760511",
      "name": "Kartik Krishnan",
      "description": "dialogue"
    },
    {
      "id": "nm1805430",
      "name": "Ahishor Solomon",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0787462",
      "name": "Naseeruddin Shah",
      "character": "John Day"
    },
    {
      "id": "nm0393535",
      "name": "Randeep Hooda",
      "character": "Gautam"
    },
    {
      "id": "nm5056001",
      "name": "Elena Kazan",
      "character": "Tabassum Habibi"
    },
    {
      "id": "nm1617909",
      "name": "Shernaz Patel",
      "character": "Maria Day"
    },
    {
      "id": "nm0768296",
      "name": "Sharat Saxena",
      "character": "Sikander Hayaat Khan"
    },
    {
      "id": "nm1479650",
      "name": "Vipin Sharma",
      "character": "Inspector Mangesh Shinde"
    },
    {
      "id": "nm0221218",
      "name": "Makrand Deshpande",
      "character": "Krishnan"
    },
    {
      "id": "nm1199163",
      "name": "Kenneth Desai",
      "character": "Prakash Nair"
    },
    {
      "id": "nm1221483",
      "name": "Pramod Pathak",
      "character": "Vikrant Ghosh"
    },
    {
      "id": "nm2747851",
      "name": "Sukhwinder Chahal",
      "character": "RDO Officer (who helped John)"
    },
    {
      "id": "nm1473802",
      "name": "Dinesh Lamba",
      "character": "Liyaaqat"
    },
    {
      "id": "nm1189034",
      "name": "Bharat Dabholkar",
      "character": "Ex Mayor Ashok Deshmukh"
    },
    {
      "id": "nm1025262",
      "name": "Deepak Shirke",
      "character": "Waagle"
    },
    {
      "id": "nm4788055",
      "name": "Taran Bajaj",
      "character": "Mr. Singh"
    },
    {
      "id": "nm1122077",
      "name": "Harsh Chhaya",
      "character": ""
    },
    {
      "id": "nm3953723",
      "name": "Diwakar Dhayani",
      "character": "Bambo"
    },
    {
      "id": "nm1018224",
      "name": "Anant Jog",
      "character": ""
    },
    {
      "id": "nm0536705",
      "name": "Ananth Narayan Mahadevan",
      "character": "Editor /              Friend Of JohnDay       (as Anant Mahadevan)"
    },
    {
      "id": "nm3124900",
      "name": "Sushil Pandey",
      "character": "Ranade"
    },
    {
      "id": "nm9580585",
      "name": "Diwakar Prasad",
      "character": "Mambo (Bookie)"
    },
    {
      "id": "nm4198704",
      "name": "Arika Silaichia",
      "character": "Pearl"
    },
    {
      "id": "nm2512562",
      "name": "Ravi Singh",
      "character": "Shafiq"
    },
    {
      "id": "nm1336722",
      "name": "Denzil Smith",
      "character": "Priest"
    }
  ],
  "overview": "A mysterious death of a young girl unfolds a web of secrets and a conspiracy. The father of the girl, John day, is a simple , honest and god fearing man. Gautam , a nihilistic cop, the key player behind the tragic incident gets embroiled and sucked into the deep abyss that turns lethal. The thin line that separates the saint and the beast now stands blurred... broken... forever",
  "storyline": "John Day is a bank manager and lives with his wife Maria Day. The couple has recently lost their only daughter. Maria is always depressed and never opens up with anyone. One day when John is away for office work, a courier-boy enters the house and takes Maria as a captive, then a series of misfortunes start to happen.",
  "plot": "John Day is a bank manager of Royal Citizen Co-operative Bank and lives with his wife Maria Day. The couple has recently lost their only daughter Pearl in a forest fire accident while she was on a trip with her boyfriend Kanishk. Maria is always depressed and never opens up with anyone. One day when John is away for office work, a courier-boy enters the house and takes Maria as a captive. He then calls up John informing him about his wife is a hostage and tells him that a man will visit him at his bank and John has to do his work. It is shown that actually it was a planned bank heist where the visitor gagged John, opened up the cash locker and fled. Meanwhile the kidnapper hammered Maria causing her a serious brain damage and she got admitted to the hospital in a state of coma.\n\nThe news spread like wildfire in all TV channels. An impatient and short tempered Police Officer Gautam (Randeep Hooda)is shocked and calls his girlfriend Tabassum (Elena Kazan) to collect a very important document stored in a locker of the bank. Inside the bank, the bank authorities in the presence of the police are giving away claims to bank customers, when Tabassum approaches and claims her documents which are revealed to be some property papers called \"CASABLANCA ESTATES\". This surprises John Day and he follows the duo in his car and observes them depositing the file in a government property office. John bribes the office personnel and procures the original Casablanca files and investigates.\n\nDuring his investigation he comes to know that police Officer Gautam is also in pursuit of the files and wants to sell them to a Mafia based organization in Dubai. Gautam is under pressure from the Mafia to handover the original documents of \"Casablanca Estates\". John vows to take revenge on the people who has injured his wife and actually eliminates all the informants including the kidnapper, the bank robbers and others involved. He then takes Tabassum as a captive and calls Gautam and another powerful Mafia Khan Saab(Sharat Saxena) at Gautam's place and there the truth is revealed.\n\nCasablanca estate is nothing but 6000 acres of forest land being acquired illegally on papers by Mafia Lord Khan Saab and Dubai based Al Hunain along with the help of Police Officer Gautam who works for Khan. They had acquired the land, registered it with the insurance company and then set fire to the jungle in order to get heavy compensation. It was revealed that on that fateful day when the fire erupted John Day's daughter Pearl was there for a jungle trip and perished in the same while her boy-friend escaped unhurt.\n\nMeanwhile Gautam has a plan to sell the papers for billions to the Dubai based AG group and settling with his girlfriend abroad. When Khan is about to shoot Gautam for his treachery Tabassum opens fire to save him. An ensuing shoot out occurs in the room and results in Tabassum being killed, Khan and his associates badly wounded and finally, Gautam getting shot multiple times by John. John then shoots Khan Saab too. Later he is shown weeping at the graves of his daughter and wife. The film ends with a Biblical quote by Mark \"For what will it profit a man if he gains the whole world, and loses his own soul? Mark 8:36\".",
  "synopsis": "The film revolves around the thought - just like behind every saint there is a beast hidden, similarly, there is a story behind every beast."
}