{
  "imdb_id": "tt2621664",
  "tmdb_id": "221432",
  "douban_id": null,
  "title": "Goldberg & Eisenberg: Til Death Do Us Part (2013)",
  "genres": [
    "Drama",
    "Horror",
    "Thriller"
  ],
  "country": "Israel",
  "version": [],
  "imdb_rating": 5.0,
  "director": [
    {
      "id": "nm5459498",
      "name": "Oren Carmi"
    }
  ],
  "writer": [
    {
      "id": "nm5459498",
      "name": "Oren Carmi",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm4814877",
      "name": "Yitzhak Laor",
      "character": "Goldberg"
    },
    {
      "id": "nm5459450",
      "name": "Yahav Gal",
      "character": "Eisenberg"
    },
    {
      "id": "nm0092016",
      "name": "Eran Bohem",
      "character": "Uncle Solomon"
    },
    {
      "id": "nm4059208",
      "name": "Daniel Brusovani",
      "character": "Neo-Nazi Punk"
    },
    {
      "id": "nm9104338",
      "name": "Roni Dotan",
      "character": "Noa"
    },
    {
      "id": "nm5459384",
      "name": "Ronny Dotan",
      "character": "Noa"
    },
    {
      "id": "nm5460212",
      "name": "Ori Halevy",
      "character": "Absalom"
    },
    {
      "id": "nm5460770",
      "name": "Eyal Kentov",
      "character": "Amnon"
    },
    {
      "id": "nm5460365",
      "name": "Greg Lyahovetsky",
      "character": "Big Punk"
    },
    {
      "id": "nm5461402",
      "name": "Yoav Stapler",
      "character": "Young Policeman"
    },
    {
      "id": "nm3506064",
      "name": "Alena Yiv",
      "character": "Young Mom"
    }
  ],
  "overview": "Goldberg is short and thin. He wears glasses. He's lonely. He's a mediocre computer programmer that lives in Tel Aviv and spends most of his energy searching online for a girlfriend. His only friend is Audrey, his beloved female dog. Eisenberg is a thug. Tall, fat, approaching middle age and not completely sane. He spends his days slouching around Meir Park, harassing innocent bystanders and doing business with petty thieves and small-time criminals. Unfortunately the two cross paths, and Eisenberg decides that they should start hanging out. But something in his demeanor says that he wants to be much more than just friends...This is a story about random meetings with strangers that lead to anxiety and paranoia. About lonely people in the big city. About losing control.",
  "storyline": "Goldberg is short and thin. He wears glasses. He's lonely. He's a mediocre computer programmer that lives in Tel Aviv and spends most of his energy searching online for a girlfriend. His only friend is Audrey, his beloved female dog. Eisenberg is a thug. Tall, fat, approaching middle age and not completely sane. He spends his days slouching around Meir Park, harassing innocent bystanders and doing business with petty thieves and small-time criminals. Unfortunately the two cross paths, and Eisenberg decides that they should start hanging out. But something in his demeanor says that he wants to be much more than just friends... Goldberg tries to avoid him, but Eisenberg's presence is everywhere: his apartment, his dating life, even his nightmares. When Eisenberg threatens Goldberg's beloved dog he realizes he must leave his manners behind, but his actions back-fire and events spin out of control. Goldberg is unwillingly drawn into Eisenberg's bizarre world, a world of petty thieves, ...",
  "plot": null,
  "synopsis": null
}