{
  "imdb_id": "tt2700330",
  "tmdb_id": "53190",
  "douban_id": null,
  "title": "The Two Escobars (2010)",
  "genres": [
    "Documentary",
    "Biography",
    "Sport"
  ],
  "country": "Colombia",
  "version": [
    {
      "runtime": "104 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.2,
  "director": [
    {
      "id": "nm1905310",
      "name": "Jeff Zimbalist"
    },
    {
      "id": "nm3104562",
      "name": "Michael Zimbalist"
    }
  ],
  "writer": [
    {
      "id": "nm1905310",
      "name": "Jeff Zimbalist",
      "description": null
    },
    {
      "id": "nm3104562",
      "name": "Michael Zimbalist",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3996390",
      "name": "María Ester Escobar",
      "character": "Herself"
    },
    {
      "id": "nm3998707",
      "name": "Alexis García V.",
      "character": "Himself"
    },
    {
      "id": "nm3997765",
      "name": "Jaime Gaviria Gómez",
      "character": "Himself"
    },
    {
      "id": "nm3998863",
      "name": "Francisco Maturana",
      "character": "Himself"
    }
  ],
  "overview": "Pablo Escobar was the richest, most powerful drug kingpin in the world, ruling the Medellin Cartel with an iron fist. Andres Escobar was the biggest soccer star in Colombia. The two were not related, but their fates were inextricably-and fatally-intertwined. Pablo's drug money had turned Andres' national team into South American champions, favored to win the 1994 World Cup in Los Angeles. It was there, in a game against the U.S., that Andres committed one of the most shocking mistakes in soccer history, scoring an \"own goal\" that eliminated his team from the competition and ultimately cost him his life. The Two Escobars is a riveting examination of the intersection of sports, crime, and politics.",
  "storyline": "Pablo Escobar was the richest, most powerful drug kingpin in the world, ruling the Medelli­n Cartel with an iron fist. Andres Escobar was the biggest soccer star in Colombia. The two were not related, but their fates were inextricably - and fatally - intertwined. Pablo's drug money had turned Andres' national team into South American champions, favored to win the 1994 World Cup in Los Angeles. It was there, in a game against the U.S., that Andres committed one of the most shocking mistakes in soccer history, scoring an \"own goal\" that eliminated his team from the competition and ultimately cost him his life. THE TWO ESCOBARS is a riveting examination of the intersection of sports, crime, and politics. For Colombians, soccer was far more than a game: their entire national identity rode on the success or failure of their team. Jeff and Michael Zimbalist's fast and furious documentary plays out on an ever-expanding canvas, painting a fascinating portrait of Pablo, Andres, and a country ...",
  "plot": null,
  "synopsis": null
}