{
  "imdb_id": "tt2793490",
  "tmdb_id": "254194",
  "douban_id": null,
  "title": "Starry Eyes (2014)",
  "genres": [
    "Drama",
    "Fantasy",
    "Horror"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "98 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm1556116",
      "name": "Kevin Kolsch"
    },
    {
      "id": "nm1552637",
      "name": "Dennis Widmyer"
    }
  ],
  "writer": [
    {
      "id": "nm1556116",
      "name": "Kevin Kolsch",
      "description": "written by as Kevin Kölsch &"
    },
    {
      "id": "nm1552637",
      "name": "Dennis Widmyer",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm3012273",
      "name": "Alex Essoe",
      "character": "Sarah       (as Alexandra Essoe)"
    },
    {
      "id": "nm0298168",
      "name": "Amanda Fuller",
      "character": "Tracy"
    },
    {
      "id": "nm0781913",
      "name": "Noah Segan",
      "character": "Danny"
    },
    {
      "id": "nm4211652",
      "name": "Fabianne Therese",
      "character": "Erin"
    },
    {
      "id": "nm2529790",
      "name": "Shane Coffey",
      "character": "Poe"
    },
    {
      "id": "nm4904530",
      "name": "Natalie Castillo",
      "character": "Ashley"
    },
    {
      "id": "nm0372366",
      "name": "Pat Healy",
      "character": "Carl"
    },
    {
      "id": "nm2353171",
      "name": "Nick Simmons",
      "character": "Ginko"
    },
    {
      "id": "nm1864017",
      "name": "Maria Olsen",
      "character": "The Casting Director"
    },
    {
      "id": "nm1020345",
      "name": "Marc Senter",
      "character": "The Assistant"
    },
    {
      "id": "nm0223437",
      "name": "Louis Dezseran",
      "character": "The Producer"
    },
    {
      "id": "nm1098746",
      "name": "Danny Minnick",
      "character": "Reggie"
    },
    {
      "id": "nm3506674",
      "name": "Michelle Alvarado",
      "character": "Hipster"
    },
    {
      "id": "nm5387666",
      "name": "Spencer Baik",
      "character": "Hipster"
    },
    {
      "id": "nm5680676",
      "name": "Denis Bolotski",
      "character": "Heinrich"
    },
    {
      "id": "nm4932014",
      "name": "Marcus Bradford",
      "character": "Party Goer"
    },
    {
      "id": "nm5692772",
      "name": "Leonel Claude",
      "character": "Restaurant Patron"
    },
    {
      "id": "nm3552131",
      "name": "Bridget Colella",
      "character": "Receptionist"
    },
    {
      "id": "nm4399439",
      "name": "Burt Culver",
      "character": "Homeless Man"
    },
    {
      "id": "nm6462689",
      "name": "Brent Deibel",
      "character": "Hipster"
    },
    {
      "id": "nm5366698",
      "name": "Amanda Dollinger",
      "character": "Partier /              Friend"
    },
    {
      "id": "nm2233462",
      "name": "Elissa Dowling",
      "character": "Stacy"
    },
    {
      "id": "nm0280495",
      "name": "Brian James Fitzpatrick",
      "character": "Stoked Dude"
    },
    {
      "id": "nm2948932",
      "name": "Emilie Germain",
      "character": "Crying Actress"
    },
    {
      "id": "nm5757596",
      "name": "Patrice Gibbs",
      "character": "Party Goer"
    },
    {
      "id": "nm4842653",
      "name": "Danika Gould",
      "character": "Audition Girl #2       (as Danika Galindo)"
    },
    {
      "id": "nm0351772",
      "name": "Trent Haaga",
      "character": "Trent"
    },
    {
      "id": "nm6376686",
      "name": "Bradley Hawkins",
      "character": "Acting Coach"
    },
    {
      "id": "nm2845557",
      "name": "Emma Julia Jacobs",
      "character": "Big Taters Waitress       (as Emma Jacobs)"
    },
    {
      "id": "nm5531811",
      "name": "Dane Jensen",
      "character": "Bartender"
    },
    {
      "id": "nm4604956",
      "name": "Samantha Ketcherside",
      "character": "Pool Party Drowning Victim       (as Sam Ketcherside)"
    },
    {
      "id": "nm5376469",
      "name": "Christian O'Brien",
      "character": "Hipster"
    },
    {
      "id": "nm5589227",
      "name": "Nik Petcov",
      "character": "Cult Member"
    },
    {
      "id": "nm5685498",
      "name": "Akchtonin Ramos",
      "character": "Mario"
    },
    {
      "id": "nm4577803",
      "name": "Natalija Ugrina",
      "character": "Audition Girl"
    },
    {
      "id": "nm2532751",
      "name": "Lex Ward",
      "character": "Tracy's Friend"
    },
    {
      "id": "nm2674969",
      "name": "Brianna Womick",
      "character": "Hipster"
    }
  ],
  "overview": "A hopeful young starlet uncovers the ominous origins of the Hollywood elite and enters into a deadly agreement in exchange for fame and fortune.",
  "storyline": "In Hollywood, the Big Taters'waitress Sarah Walker is an ambitious aspiring actress that suffers from hair pulling disorder. Sarah does not respect her boss Carl or her job since she believes she will be a great actress and this job is temporary only to pay her bills. She shares an apartment with her roommate Tracy that frequently discloses her secrets to their selfish friends Erin that likes to humiliate Sarah and steal her roles; Danny, who is an aspiring director that likes Sarah; Poe and Ashley that are indifferent to her. When Sarah is invited to an audition of the film The Silver Screen from the company Astraeus Pictures, their auditioners do not show any reaction to her performance. When Sarah leaves the audition, she goes to the toilet room and has an attack, pulling her hair and crying. Immediately after, the casting director invites her to return to the room and repeat what she did in the bathroom for her assistant and she. Sarah is invited again to an audition with the ...",
  "plot": "Sarah (Alex Essoe) is a hopeful young woman suffering from trichotillomania, who is desperate to become famous, but is stuck waitressing at a Hooters-esque restaurant named Big Taters. Her boss Carl (Pat Healy) is frustrated with how Sarah's auditioning occasionally interferes with her job but is unwilling to fire her. Her friends are generally unsupportive and selfish; Erin (Fabianne Therese) is constantly trying to undermine Sarah and steal her roles, and the others are lackadaisical about Sarah's efforts and Erin's actions. This is partially because they are overly involved with themselves and partially because Sarah purposely distances herself from the others. The only people who appear to be interested in her well-being are Sarah's roommate Tracy (Amanda Fuller) and Danny (Noah Segan), an aspiring film director and photographer who seems to have a romantic interest in Sarah.\n\nHer prospects at stardom look dim until Sarah takes an audition for the film The Silver Scream, which is being held by the powerful production company Astraeus Pictures. Her audition is met with a lackluster response by the casting director (Maria Olsen) and the assistant (Marc Senter), and Sarah is summarily dismissed from the room. Upset, Sarah enters a nearby bathroom in the building the auditions are being held in and proceeds to rip her hair out, a move that gains the interest of the casting director. Wanting to gain the role, Sarah returns to the audition room and reluctantly acquiesces to the casting director's demand that she rip her hair out again in front of them. Once this is completed, Sarah is dismissed again, much to her confusion. She then quits her job to pursue her chance at the movie. She is overjoyed when she gets a callback to a second audition. She eagerly returns to the building and is caught off guard when she is now commanded to disrobe. Sarah again reluctantly agrees to their demands, and after being told to open herself up to the potential to \"transform\", she experiences extreme euphoria and undergoes a trance state, during which she notices that the casting director is wearing a pentagram necklace. While in this state of euphoria she begins to show mild erratic behaviors, like laughing when one of her friends breaks her nose.\n\nIt is only when Sarah is called to a third audition that she balks at the demands of Astraeus' employees, as she is now expected to have sex with the producer (Louis Dezseran). Sarah refuses and runs home, where she confesses the night's events to Tracy. Humiliated, Sarah has to beg for her job back from Carl. Danny asks Sarah to be the lead role in his movie and she accepts. To celebrate, they have a pool party. Sarah is surprised when she sees Erin kissing Danny. Angry, Sarah returns to the producer's house, where she performs oral sex on him. During the following days, Sarah shows increasingly erratic behavior even while her body begins to deteriorate. This causes her to lose her job and attack several people, including her friends. Sarah eventually has a heated argument with Tracy and retreats to her room, where she sees the casting director and has a vision of herself as a beautiful and glamorous movie idol. She awakens from the dream and goes to the bathroom to vomit, where she finds that her hair and nails have almost completely fallen out. Sarah climbs into the bathtub, where she vomits maggots. With her last bit of energy, Sarah answers her cell phone. The producer taunts her and tells her that she can either die or she can embrace the transformation and become like him. Sarah embraces the transformation and goes to Erin's house. Sarah and Erin argue until Erin turns on the lights and sees Sarah's disfigured face. Erin tries to persuade her to go to the hospital but she accidentally slices her cheek with a knife. Sarah accepts what she has done and proceeds to violently stab Erin. She then goes to Ashley's room and smashes her face using a dumbbell. Poe witnesses this and he runs away but he slips on a puddle of blood. Sarah stabs him as well. Sarah realizes that Erin is still alive and suffocates her with a plastic bag. She then goes to Danny's van and kills him. After that, the production company Astraeus, which turns out to be a secret cult worshiping a god named Astraeus, conducts a ritual whereby Sarah is reborn from a mound of earth with a healthy, hairless body. Sarah returns to her apartment and kills Tracy by sucking the life out of her mouth in a kiss. She puts on the presents that Astraeus left her, a gown and a wig. The film ends as she admires herself in the mirror.",
  "synopsis": null
}