{
  "imdb_id": "tt2727322",
  "tmdb_id": "292816",
  "douban_id": null,
  "title": "One Third (2014)",
  "genres": [
    "Crime",
    "Drama"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "119 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm2123121",
      "name": "Hiroshi Shinagawa"
    }
  ],
  "writer": [
    {
      "id": "nm3538072",
      "name": "Hanta Kinoshita",
      "description": "based on the novel by"
    },
    {
      "id": "nm2123121",
      "name": "Hiroshi Shinagawa",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0297885",
      "name": "Tatsuya Fujiwara",
      "character": "Shu"
    },
    {
      "id": "nm1972675",
      "name": "Mika Nakashima",
      "character": "Maria"
    },
    {
      "id": "nm0849014",
      "name": "Kôki Tanaka",
      "character": "Koji"
    },
    {
      "id": "nm3304301",
      "name": "Ryûichi Kosugi",
      "character": "Ken"
    },
    {
      "id": "nm4853738",
      "name": "Mitsu Dan",
      "character": "Miss SM"
    },
    {
      "id": "nm3147489",
      "name": "Razor Ramon H.G.",
      "character": ""
    },
    {
      "id": "nm2062549",
      "name": "Ryô Kimura",
      "character": "Wakatsuki"
    },
    {
      "id": "nm0473577",
      "name": "Yôsuke Kubozuka",
      "character": "Sho Hama"
    },
    {
      "id": "nm3587427",
      "name": "Shûichirô Masuda",
      "character": "(as Shuichiro Masuda)"
    },
    {
      "id": "nm2474333",
      "name": "Daisuke Matsuda",
      "character": ""
    },
    {
      "id": "nm0676201",
      "name": "Pîtâ",
      "character": ""
    },
    {
      "id": "nm2123121",
      "name": "Hiroshi Shinagawa",
      "character": ""
    },
    {
      "id": "nm1588733",
      "name": "Tomoharu Shôji",
      "character": ""
    },
    {
      "id": "nm1968060",
      "name": "Yasuhito Wakita",
      "character": "(as Yasuto Wakita)"
    },
    {
      "id": "nm6294316",
      "name": "Yasu-Chin",
      "character": ""
    },
    {
      "id": "nm5412308",
      "name": "Maki Yoshihara",
      "character": "(as Yoshihara Maki)"
    }
  ],
  "overview": "The manger of cabaret club \"Hanibani\" named Shuu, a worker at the club named Koji and one of the patrons named Ken succeed in robbing a bank. They agree to divide the stolen money equally into 3, but they become consumed by greed and try to get more than their share. In addition, a renowned figure is after their money.",
  "storyline": "The manger of cabaret club \"Hanibani\" named Shuu, a worker at the club named Koji and one of the patrons named Ken succeed in robbing a bank. They agree to divide the stolen money equally into 3, but they become consumed by greed and try to get more than their share. In addition, a renowned figure is after their money.",
  "plot": "Bilbo and the Dwarves watch from the Lonely Mountain as the dragon Smaug sets Laketown ablaze. Bard the Bowman breaks out of prison, and eventually kills Smaug with the black arrow brought to him by his son Bain. Smaug's falling body crushes the fleeing Master of Laketown, who was escaping Laketown on a boat laden with the town's gold. Bard reluctantly becomes the new leader of the people of Laketown, as they seek refuge in the ruins of Dale, while Legolas travels to investigate Mount Gundabad with Tauriel. Thorin, now struck with \"dragon sickness\" over the vast treasure in the mountain, searches obsessively for the Arkenstone, which Bilbo had previously found but kept hidden. Thorin, hearing that people have come to Dale, orders the entrance of the Lonely Mountain sealed off.\n\nMeanwhile, Galadriel, Elrond and Saruman arrive at Dol Guldur and free Gandalf, sending him to safety with Radagast. They battle and defeat the Nazgûl and Sauron himself, banishing them to the East. Azog, marching on Erebor with his vast Orc army, sends Bolg to Gundabad to summon their second army. Legolas and Tauriel witness the march of Bolg's army, bolstered by Orc Berserkers and giant bats.\n\nThranduil and an elf army arrive in Dale and they form an alliance with Bard in order to re-claim white gems that are part of the Mountain treasure. Bard goes to the mountain and asks Thorin for the share of the gold that he had previously promised the people of Laketown, but Thorin refuses. Gandalf arrives at Dale to warn Bard and Thranduil of the threat posed by Azog, but Thranduil dismisses him. Bilbo sneaks out of Erebor to hand the Arkenstone over to Thranduil and Bard, so that they can trade it for the gems and gold they believe is theirs, preventing the need for a battle. When Bard and Thranduil's armies gather at the gates of Erebor, offering to trade the Arkenstone for the white gems and gold, Thorin angrily refuses to believe they have it until Bilbo admits giving it away, and chides Thorin for letting greed cloud his judgement. Outraged by what he sees as betrayal, Thorin nearly kills Bilbo, but Gandalf arrives at the gate and shames Thorin into releasing Bilbo. Thorin's cousin Dáin arrives with his Dwarf army, and a battle of Dwarves against Elves and Men is imminent, with the Elves and Men having a significant advantage. Wereworms emerge from the ground, releasing Azog's army from their tunnels. With the Orcs outnumbering Dáin's army, Thranduil and Bard's forces, along with Gandalf and Bilbo, join the battle. However, a second front is opened when many Orcs, Ogres, and Trolls attack Dale.\n\nInside Erebor, Thorin suffers traumatic hallucinations before regaining his sanity and leading his company to join the battle. He rides towards Ravenhill with Dwalin, Fíli and Kíli to kill Azog; Bilbo follows them using the One Ring. Meanwhile, Tauriel leaves with Legolas to warn the Dwarves of Bolg's approaching army. Fíli and Kíli are cornered, and Azog kills Fíli, as Bilbo and the other Dwarves look on. As Thorin engages Azog in a fight to the death, Bolg knocks Bilbo unconscious, overpowers Tauriel and then kills Kíli, who had come to her aid. Legolas battles Bolg, and eventually kills him. Thorin kills Azog, but is fatally wounded in the process. The Great Eagles then arrive with Radagast and Beorn to fight the newly arriving Orc army, and the Orcs are finally decimated. Bilbo regains consciousness, and makes peace with Thorin before he dies. Tauriel mourns Kili and Thranduil acknowledges their love. Legolas then tells Thranduil he must leave, and Thranduil advises him to seek out a Dunedain ranger in the north who goes by the name \"Strider\". Thorin, Fíli and Kíli are respectfully laid to rest and Dáin is crowned King under the Mountain.\n\nBilbo bids farewell to the remaining members of Thorin's company and journeys home to the Shire with Gandalf. As the two part ways on the outskirts of the Shire, Gandalf admits his knowledge of Bilbo's ring, and tells him that magic rings are not to be used lightly. Bilbo returns to Bag End to find his belongings being auctioned off by his least favourite relatives, the Sackville-Bagginses, because he was presumed dead. He aborts the sale, but finds his home pillaged. He starts to tidy up and takes the Ring out of his pocket.\n\nSixty years later, on his 111th birthday, Bilbo receives a visit from Gandalf, initiating the events of The Fellowship of the Ring.",
  "synopsis": null
}