{
  "imdb_id": "tt2774262",
  "tmdb_id": "398586",
  "douban_id": null,
  "title": "Five Pillars (2015)",
  "genres": [
    "Drama",
    "News",
    "Thriller"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "86 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.8,
  "director": [
    {
      "id": "nm4015185",
      "name": "Jon Rosling"
    }
  ],
  "writer": [
    {
      "id": "nm4015185",
      "name": "Jon Rosling",
      "description": "story"
    },
    {
      "id": "nm4015185",
      "name": "Jon Rosling",
      "description": "writer"
    },
    {
      "id": "nm4015185",
      "name": "Jon Rosling",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3125892",
      "name": "Tom Bott",
      "character": "Darren"
    },
    {
      "id": "nm4866237",
      "name": "Aaron Jeffcoate",
      "character": "Gary"
    },
    {
      "id": "nm5577801",
      "name": "Adam Probets",
      "character": "Paul"
    },
    {
      "id": "nm4830345",
      "name": "Charlie Glossop",
      "character": "Billy"
    },
    {
      "id": "nm1675336",
      "name": "George Newton",
      "character": "Robert"
    },
    {
      "id": "nm4592929",
      "name": "Rachel Lucy",
      "character": "Sophie"
    },
    {
      "id": "nm1527944",
      "name": "Mike Kremastoules",
      "character": "Graham"
    },
    {
      "id": "nm0130860",
      "name": "Mhairi Calvey",
      "character": "Ruth"
    },
    {
      "id": "nm4193171",
      "name": "Rick Bithell",
      "character": "David"
    },
    {
      "id": "nm0125241",
      "name": "Sameer Butt",
      "character": "Yusef"
    },
    {
      "id": "nm5578481",
      "name": "Amin Ali",
      "character": "Ishmael"
    },
    {
      "id": "nm1861787",
      "name": "Sarah Jane Honeywell",
      "character": "Carla"
    },
    {
      "id": "nm0371753",
      "name": "Jane Hayward",
      "character": "Mary"
    },
    {
      "id": "nm4773855",
      "name": "Aine Ryan",
      "character": ""
    },
    {
      "id": "nm5447359",
      "name": "Scott Westoby",
      "character": ""
    },
    {
      "id": "nm5576891",
      "name": "Ryan Quarmby",
      "character": ""
    },
    {
      "id": "nm5578921",
      "name": "Jack Ellis",
      "character": ""
    }
  ],
  "overview": "The lives of vastly separate people collide in interweaving stories of liberty, identity, tolerance, responsibility and class.",
  "storyline": "Shattered by the experience of war ex-soldier Darren finds himself back in England and disenfranchised by a society struggling to find an identity. His best friend Paul has moved away to university while his other friend Gary has joined the extremist ranks of the far right National Defence League. Even Paul's teenage brother, Billy, is a changed character from the young boy Darren used to know, one who is now edging towards a mind-set of violence and hate as he comes of age. Darren's former girlfriend, Sophie, has also grown distant. She doesn't want to know him despite his desperate determination to engage. Unknown to him her mind is pre-occupied with problems of her own - namely a secret one night stand with one of his best friends that has left her with a decision to make and a responsibility to face. His only connection is with his estranged grandfather, Graham. However when Sophie is propositioned by a young Asian boy called Yusuf, Darren's grip on sanity slips further and ...",
  "plot": null,
  "synopsis": "Ex-British squaddie Darren (Tom Bott) returns home to the northern town where he grew up after leaving the army, having just completed an 18 month tour of duty in the Middle East.After a brief reunion with his mother (Jayne Hayward) he meets up with old friends Paul (Adam Probets) and Gary (Aaron Jeffcoate), catching up on old times and also on where their lives have taken them since they last spoke. Paul is at university where as motor mechanic Gary has just been made redundant. Gary asks if Darren has contacted his old girlfriend Sophie but Darren has yet to make that call.Meanwhile Sophie (Rachel Lucy) has just discovered she is pregnant. Mulling over what to do with friend Rachel (Aine Ryan) she keeps to herself the secret that Darren's best friend Paul is the father of her child, following a recent one night stand.Darren, Paul and Gary find themselves splitting up a school fight between Paul's rough and ready 16 year old brother Billy (Charlie Glossop) and an Asian teenager Ishmael (Amin Ali). Billy is angered by Ishmael's interest in his girlfriend and proceeds to beat up Ishmael after school one day. The fight is split up by Darren but not before Ishmael's older brother Yusuf himself has a run in with Darren. Issues unresolved, tension set in place everyone goes their separate ways.Gary returns home to his own issues - his drunk father Robert (George Newton) is beating up on his mother Carla (Sarah Jane Honeywell) and tries to attack Gary before being knocked down himself. Robert, who has serious mental health issues following his redundancy from the steel industry, has returned to the bottle as a solution to his problems. Gary offers to go to his benefits review interview with him.The next day Darren's mother urges him to visit his grandfather Graham (Mike Kremastoules) where he discovers the old man's new found love of poetry, in particular William Henley's \"England My England\" which he is learning for a poetry circle. After meeting Graham, Darren tries to contact Sophie and following a tense exchange where he accuses her of seeing someone else she hangs up on him. Later that evening Darren meets Paul and Gary in a local pub where Darren shouts off at an innocent bystander.In a separate storyline newly weds Ruth (Mhairi Calvey) and David (Rick Bithell) are assaulted in the street by a pair of teenagers after a night out. David fails to defend his wife from the assault in the way Ruth would expect him to and when they arrive home she threatens to call the police, accusing him of being feeble in the face of danger. Following a missed call, Paul turns up at Sophie's student flat unannounced. They talk about Darren being back in town but he leaves during the night while she sleeps.Darren takes Graham shopping in an attempt to reconnect with his old life and to get to know his grandfather. They talk about the past and Graham tells Darren he was foolish to let Sophie slip away. Darren, taking these words to heart, parks up in Paul's car outside her student house waiting for her to leave. Paul thinks this is a stupid idea and that he should move on. During the wait the conversation turns to Gary's new found interest in Far Right group the National Defence League, which he describes as being \"standing up for something you believe in\". Paul is skeptical and views Gary's activity as \"scrapping on heap with Muslims\". During the conversation Darren learns that his grandfather Graham was a \"proper skinhead\", a member of the National Front in the 1970s, something that is news to him.As Sophie leaves the house she is stopped in the streets by Yusuf, who tries to strike up a friendly conversation. The others witness this and it troubles Darren greatly who wants to know how she knows Yusuf (which she does not). Sophie tells Yusuf to leave her alone.Gary and his father go to the benefit review meeting, which serves to undermine his confidence further. The interviewer is Ruth and she leaves Robert a nervous wreck and more distressed than he was before he went. Gary and he leave angry.Yusuf approaches Sophie in the supermarket where he works. She asks him what he wants and he demands to know why she finds it so hard to talk to him. He shares his name with her and says he just wants to be her friend. She tells him rudely that she doesn't want to know him.As she returns home Darren is waiting for her. They confront each other face to face, having a major argument in the street and she leaves telling him she cannot see him again.As she runs away Sophie literally bumps into Yusuf in the street. She falls into his arms, an emotional heap, in a non-romantic embrace. Yusuf is confused by this; as is Paul's teenager brother Billy, who witnesses it from afar.The next day Gary and Billy turn up at Ruth and David's house to mend her car (David has called Gary up previously, but Gary is unaware who David's wife is). Ruth is angry at David for not having the job done at the garage and tells him she doesn't want either of Gary or Billy in the house. Later, she encounters Billy in the hallway as he brings two empty mugs in to her. He says the car cannot be mended immediately as they need a part. he tells her that they will be back later in the week.Gary returns home late in the evening from the job at David and Ruth's house. The house is dark and his father is sitting in the gloom in the bathroom, a pistol in his hand. He tells Gary that Carla has left him and that he is ready to kill himself with the gun. Gary talks him down and takes the gun from him.Darren offers to take the gun from Gary and break it before disposing of the pieces. They test the weapon out on some old wasteland and find it works. Whilst there Gary questions Darren about why he left the army and he reveals that ultimately he couldn't handle the stress of the job. He talks about fire fights involving Taliban fighters as young as Billy. \"Can you imagine what it would be like to kill someone that age, Billy's age?\" he says.After taking the gun Darren decides to visit Graham to ask him about his National Front days. Whilst nosing through some of Grahams things he finds some Far Right material and newspaper clippings from the 1970s that implicate Graham in the death of a Sikh teenager. Graham, who returns to find Darren rifling through his private belongings, explains that though not responsible he was tarred with the murder as he knew those who did it. He explains his involvement with the NF in terms of standing up for his class and his identity at a time when no one else would. He likens it to Darren fighting for his country in the armed forces. Darren is less keen on the comparison.Gary returns to mend David and Ruth's car to find out that David has already had it mended at the garage, under orders from his flinty wife. Gary rages at Ruth's middle class snobbery, recognising her from his father's benefit's review. When he returns home he sees that his fatehr has attempted suicide by taking an overdose. He rushes him to the hospital where Darren, Paul and Billy visit later the next day.Whilst at the hospital Billy spills the beans on what he thinks he saw between Yusuf and Sophie, enraging an already jealous Darren. Darren is determined to take some form of retribution out on Yusuf and decides to pursue him after Friday prayers at the local mosque. Paul, who wants nothing to do with it, leaves, urging Billy to join him but Billy is determined to be in on the ultra-violence.Sophie, meanwhile, decides that she must tell Paul that she is expecting his baby. She prepares to leave as Darren, Gary and Billy track down Yusuf and his brother. They pursue the pair through the local town, eventually cornering them in a deserted workman's yard. Billy and Gary beat Ishmael, stamping on his head and kicking him to near unconsciousness before he manages to crawl away. Darren, who is motivated not by racial hatred but by jealousy, beats up Yusuf, knocking him to the ground. Suddenly and unexpectedly he pulls Robert's pistol on Yusuf threatening to shoot him. Gary is incensed that Darren has brought the gun along but Darren threatens him with it. Unable to shoot Yusuf he spins the pistol round and beats him to death with the butt of the gun. The three of them leave.Sophie arrives at Paul's house and tells him that she is expecting his child. He is angry and confused.Gary splits from the others, angry at what Darren has done. He knows that they will all be implicated in the killing as they let Yusuf's brother go and he will obviously inform the police who it was who cornered him and his brother. Gary leaves for the hospital.With no where to go, Billy suggests that Darren heads back to his house, thinking only Paul is there. They return to the house and walk in on a blazing argument between Sophie and Paul about whether or not she should have an abortion. Darren discovers the truth and the betrayal. He raises the gun to shoot Paul in the face but Billy, diving on him to save his brother, is accidentally shot instead. As he lies on the living room floor, blood spilling from the bullet wound, Darren finally realises what it is like to kill someone Billy's age - the very thing he left the army to avoid.Far across the city a police car is called to the shooting. The lead police officer is David, who arrives at the scene and recognises Billy.Graham finally gives his poetry reading while across the city and in a separate existence Ruth breaks down, an emotional flood of self loathing."
}