{
  "imdb_id": "tt2727028",
  "tmdb_id": "255580",
  "douban_id": null,
  "title": "Total Chaos (2014)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "108 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.0,
  "director": [
    {
      "id": "nm0633106",
      "name": "Eeshwar Nivas"
    }
  ],
  "writer": [
    {
      "id": "nm0361828",
      "name": "Dominic Harari",
      "description": "based on the film by"
    },
    {
      "id": "nm7517250",
      "name": "Jayashankarr",
      "description": "co-writer"
    },
    {
      "id": "nm3109770",
      "name": "Neeraj Pandey",
      "description": null
    },
    {
      "id": "nm0670808",
      "name": "Teresa Pelegri",
      "description": "based on the film by"
    }
  ],
  "cast": [
    {
      "id": "nm3773554",
      "name": "Ali Zafar",
      "character": "Aman"
    },
    {
      "id": "nm4417069",
      "name": "Yami Gautam",
      "character": "Asha"
    },
    {
      "id": "nm0451600",
      "name": "Anupam Kher",
      "character": "Asha's Father"
    },
    {
      "id": "nm0451601",
      "name": "Kiron Kher",
      "character": "Asha's Mom"
    },
    {
      "id": "nm4115413",
      "name": "Sara Khan",
      "character": "Jia Singh"
    },
    {
      "id": "nm1395680",
      "name": "Anuj Pandit",
      "character": "Manav Singh"
    },
    {
      "id": "nm4880315",
      "name": "Vic Waghorn",
      "character": "Pimp"
    },
    {
      "id": "nm3993401",
      "name": "Carol McFadden",
      "character": "Lena"
    },
    {
      "id": "nm5631302",
      "name": "Steve Keefe",
      "character": "Percy"
    },
    {
      "id": "nm5632269",
      "name": "Alyan Abbas",
      "character": "Scrawny Pakistani"
    },
    {
      "id": "nm0038169",
      "name": "Sagar Arya",
      "character": "Sanjay"
    },
    {
      "id": "nm1584129",
      "name": "Vishwa Mohan Badola",
      "character": "Dadu       (as Vishwa S. Badola)"
    },
    {
      "id": "nm5632696",
      "name": "Tim Barton",
      "character": "Bald Man"
    },
    {
      "id": "nm6646387",
      "name": "Kishore Bhatt",
      "character": "Passerby"
    },
    {
      "id": "nm5631326",
      "name": "Marco Chiu",
      "character": "Chinese Boy"
    },
    {
      "id": "nm5276849",
      "name": "Tom Christian",
      "character": "Pimp       (as Thomas Christian)"
    },
    {
      "id": "nm5632766",
      "name": "Brooke Dalby",
      "character": "Angela"
    },
    {
      "id": "nm5632177",
      "name": "Doug Devaney",
      "character": "James"
    },
    {
      "id": "nm5631258",
      "name": "Philip Higgs",
      "character": "Security Guard"
    },
    {
      "id": "nm5631764",
      "name": "Adnan Kapadia",
      "character": "Flower Vendor"
    },
    {
      "id": "nm5270502",
      "name": "Barrie Martin",
      "character": "Policeman"
    },
    {
      "id": "nm5631295",
      "name": "Anil Meisuria",
      "character": "Giant"
    },
    {
      "id": "nm5631286",
      "name": "Nabil Nejat",
      "character": "Pakistani Man"
    },
    {
      "id": "nm5632001",
      "name": "Max Newitt",
      "character": "James' Son"
    },
    {
      "id": "nm4884408",
      "name": "Emily Outred",
      "character": "Tall Woman"
    },
    {
      "id": "nm5632152",
      "name": "Jasbir Rishi",
      "character": "Bunty"
    },
    {
      "id": "nm4452726",
      "name": "Atul Sharma",
      "character": "Street Passerby"
    },
    {
      "id": "nm5631099",
      "name": "Kamal Singh",
      "character": "Babloo"
    },
    {
      "id": "nm5067614",
      "name": "Chloe Wade",
      "character": "Fe"
    }
  ],
  "overview": "Total Siyapaa is an upcoming Hindi romantic comedy film directed by Eshvar Niwas and written by Neeraj Pandey.",
  "storyline": "Settled in London, Aman hopes to marry Asha, an Indian woman also based in London. He visits her parents' house to seek their permission to marry her. However, his plans to impress the family start failing when they discover that he is a Pakistani.",
  "plot": "After being given responsibility by King Louis XIV of France for designing and building the Gardens of Versailles, André Le Nôtre interviews candidates for the project, one of whom is a woman with an unconventional sense of gardening, Sabine de Barra. When noticing her move a potted plant in his garden prior to her interview, André confirms Sabine is not a conformist in gardening. She tells him she wants to give them something uniquely French and not follow classical and renaissance models.\nBosquet de la Salle-de-Bal at Gardens of Versailles, laid out by André Le Nôtre between 1680 and 1683.\nOn the night after her interview, André surprises Sabine at her home and tasks her with responsibility for an outdoor ballroom surrounded by a fountain and landscaping. André's plans had called for a constant supply of water from a great distance at great expense. Sabine devises an alternate engineering solution based on a reservoir from which water can be continuously recycled through the fountains she has designed. She makes little progress at first because she uses workers recommended by those who lost the contract to her and hope to see her fail. One of them, however, Thierry Duras, intervenes and offers his crew's help.\n\nSabine is soon noticed by the elite at court and is befriended by the King's brother Duc Philippe d'Orleans and his wife Elizabeth Charlotte, Princess Palatine. At several points as the story develops, Sabine is haunted by brief glimpses of a young girl in white or a girl's voice she hears calling. She appears incapable of demonstrating her romantic feelings for André, who suffers from his marriage to the haughty Madame Françoise Le Nôtre, who insists on her right to take lovers and tells her husband he has only achieved professional success because of her influence at court. She has insisted on her sexual freedom, but when she challenges his interest in Sabine, he quotes her own speech of freedom back at her and becomes resolute in his intention to pursue a relationship with Sabine.\n\nQueen Maria Theresa dies suddenly. André informs his wife, who is shaken at the prospect that this will lessen her influence at court. The king is shocked at the loss of his wife and takes refuge in contemplating plants, one of his great sensual and aesthetic pleasures, in his gardener's work area. Sabine accidentally encounters the king there, first mistaking him for the gardener and then when he reveals his identity befriends him and offers him the consolations of nature. She finds great favour in the king's eyes, and he invites her to travel with him and his court to his palace and gardens at Fontainebleau.\n\nOn a stormy day, Louis XIV visits Sabine's work site and assesses the project skeptically but decided to allow it to proceed. After he leaves with his retinue, Sabine is visited by Françoise, who tells her that André's passionate intentions are only a whim and will prove short-lived. After she and Sabine each depart, Françoise's lover opens the sluice gates from the reservoir and floods the work site, destroying much of the earthworks and plants.\n\nIn the partly destroyed works site, André finds a glove that he recognizes as belonging to his wife Françoise. He returns the glove to her, indicating he is aware of her role in the destruction of Sabine's work guilt and ending their relationship.\n\nSabine goes to King's court and meets Duc de Lauzun, who introduces her to the king's mistress, the Marquise de Montespan, who in turn introduces her to the women of the court. They greet her warmly and invite her into their discussion of topics the king forbids at court, notably death, especially the death of their children. Sabine reveals her enduring pain at the loss of her husband and daughter. When the King and his male entourage arrives, the Marquise presents Sabine to him. Sabine offers him a four-seasons flower, which inspires a conversation between the King and Sabine on the metaphorical nature of the rose and its life cycle, a metaphor intended to warm him toward his mistress.\n\nAndré waits for Sabine outside her room that night, having fallen completely in love with her. Sabine lets go of her remorse for her husband's death years ago, and they finally make love. In the morning, André finds himself alone in bed. The scene jumps to Sabine years earlier during the events leading to the death of her daughter and adulterous husband. He admits his adultery and leaves to visit his mistress with his daughter along in the carriage. Sabine sees that the carriage has a faulty wheel and races after the carriage calling for it to stop. She rushes in front of the carriage, the coachman pulls on the reins, the wheel breaks and the carriage topples off the road and down a hill, killing both father and daughter. André finds Sabine in the grip of this memory and convinces her to stop blaming herself for their deaths.\n\nSabine's fountain-arena project is complete. The king and his court arrive to evaluate and inaugurate it. To the music of a hidden orchestra, the king and the court, including Sabine and André, enter and dance on the center ballroom surface, as the fountains send water coursing down the tiers surrounding the dancing surface.",
  "synopsis": null
}