{
  "imdb_id": "tt2764784",
  "tmdb_id": "254578",
  "douban_id": null,
  "title": "Phoenix (2014)",
  "genres": [
    "Drama",
    "History",
    "Music",
    "Romance"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "98 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm0678857",
      "name": "Christian Petzold"
    }
  ],
  "writer": [
    {
      "id": "nm0678857",
      "name": "Christian Petzold",
      "description": "screenplay and"
    },
    {
      "id": "nm0267943",
      "name": "Harun Farocki",
      "description": "co-writer and"
    },
    {
      "id": "nm0599170",
      "name": "Hubert Monteilhet",
      "description": "novel"
    }
  ],
  "cast": [
    {
      "id": "nm0396125",
      "name": "Nina Hoss",
      "character": "Nelly Lenz"
    },
    {
      "id": "nm1665537",
      "name": "Ronald Zehrfeld",
      "character": "Johnny Lenz"
    },
    {
      "id": "nm0475365",
      "name": "Nina Kunzendorf",
      "character": "Lene Winter"
    },
    {
      "id": "nm2012595",
      "name": "Trystan Pütter",
      "character": "Soldat an der Brücke"
    },
    {
      "id": "nm0535421",
      "name": "Michael Maertens",
      "character": "Arzt"
    },
    {
      "id": "nm0463130",
      "name": "Imogen Kogge",
      "character": "Elisabeth"
    },
    {
      "id": "nm0753947",
      "name": "Felix Römer",
      "character": "Geiger"
    },
    {
      "id": "nm0696614",
      "name": "Uwe Preuss",
      "character": "Clubbesitzer"
    },
    {
      "id": "nm0972490",
      "name": "Valerie Koch",
      "character": "Tänzerin"
    },
    {
      "id": "nm2976649",
      "name": "Eva Bay",
      "character": "Tänzerin"
    },
    {
      "id": "nm0123069",
      "name": "Jeff Burrell",
      "character": "Soldat im Club"
    },
    {
      "id": "nm0441003",
      "name": "Nikola Kastner",
      "character": "Junge Frau"
    },
    {
      "id": "nm0394335",
      "name": "Max Hopp",
      "character": "Der Mann"
    },
    {
      "id": "nm1639968",
      "name": "Megan Gay",
      "character": "Mitarbeiterin Zentralstelle Halensee"
    },
    {
      "id": "nm0088744",
      "name": "Kirsten Block",
      "character": "Wirtin"
    },
    {
      "id": "nm0784643",
      "name": "Frank Seppeler",
      "character": "Alfred Mohnhaupt"
    },
    {
      "id": "nm1526525",
      "name": "Daniela Holtz",
      "character": "Sigrid"
    },
    {
      "id": "nm3073812",
      "name": "Kathrin Wehlisch",
      "character": "Monika"
    },
    {
      "id": "nm0921078",
      "name": "Michael Wenninger",
      "character": "Walther"
    },
    {
      "id": "nm0312036",
      "name": "Claudia Geisler-Bading",
      "character": "Frederike       (as Claudia Geisler)"
    }
  ],
  "overview": "A disfigured concentration-camp survivor, unrecognizable after facial reconstruction surgery, searches ravaged postwar Berlin for the husband who might have betrayed her to the Nazis.",
  "storyline": "In the aftermath of WWII, Nelly, a Jewish survivor of the Auschwitz concentration camp, horribly disfigured from a bullet wound in her face, undergoes a series of facial reconstruction surgeries and decides to find her husband Johnny who works at the Phoenix club in Berlin. Undoubtedly, Nelly is stunning, yet, her new self is beyond recognition, so Johnny, the man who may have betrayed her to the Nazis, will never imagine that the woman in front of him who bears an uncomfortable and unsettling resemblance to his late wife, is indeed her. Without delay, and with the intention to collect the deceased's inheritance, Nelly will go along with Johnny's plot and she will impersonate the dead woman, giving the performance of a lifetime before friends and relatives in a complex game of deceit, duplicity, and ultimately, seduction. In the end, during this masquerade, as the fragile and broken Nelly tries to find out whether Johnny betrayed her or not, she will have to dig deep into her wounded ...",
  "plot": "The film follows Nelly Lenz, a Holocaust survivor and former cabaret singer, who returns to Berlin after undergoing facial reconstruction surgery for damage caused by a bullet wound. Following the end of World War II and the liberation of the concentration camps, Nelly returns to Germany with her friend Lene. Here, Lene takes Nelly to a reconstructive plastic surgeon. Although Nelly tells the surgeon that she would like to look exactly as she used to, he is unable to recreate her old face completely and Nelly is disappointed with the final result.\n\nLene finds an apartment for her and Nelly. Since Nelly's family members all died during the war, Nelly has inherited a considerable amount of money. Lene suggests to Nelly that she collect the money and that the two of them travel to Palestine. She believes they will be safe there and can help with the creation of an independent Jewish state.\n\nAlthough Lene warns Nelly that her husband Johnny may have been the one to betray her to the Nazis, Nelly denies this possibility. She leaves the apartment at night to find him. She finds Johnny working in a nightclub called Phoenix. Johnny fails to recognize her, yet says later that she bears an uncanny resemblance to his late wife, Nelly. In order to obtain his wife's inheritance, he asks Nelly to impersonate his wife.\n\nJohnny slowly transforms Nelly into an image and performer of her previous self before her arrest. Nelly goes along with Johnny's plan and keeps her true identity concealed, telling Johnny that her name is Esther. Although Lene continues to warn Nelly that Johnny was possibly complicit in her arrest, Nelly maintains a romantic view of the relationship. As Esther, she questions Johnny about his feelings for his wife and his behaviour at the time of her arrest. Johnny avoids answering most of Nelly's questions, wanting her to concentrate on learning to impersonate his wife. Johnny tells Nelly that he plans to stage her \"return\" from the camps within the week, and invites several of the couple's old friends to meet her with him at the train station.\n\nAfter spending several days with Johnny, Nelly returns to the apartment she shares with Lene. Here, the landlady informs her that Lene has killed herself, leaving behind a note for Nelly. In this note, Lene admits to Nelly that she knows that Johnny divorced Nelly the day before her arrest. She includes a copy of the divorce decree, which forces Nelly to accept Johnny's betrayal.\n\nNelly keeps this knowledge a secret, meeting Johnny and their old friends at the train station as planned. Later, at the home of one of the friends, Nelly invites the group to listen to her sing, accompanied by Johnny on piano. As Nelly sings, Johnny recognizes her voice and sees the number tattooed on her arm when she was a prisoner in the concentration camps. He stops playing the piano, recognizing Nelly as she finishes the song and walks away.",
  "synopsis": null
}