{
  "imdb_id": "tt2786780",
  "tmdb_id": "294334",
  "douban_id": null,
  "title": "House of the Witchdoctor (2013)",
  "genres": [
    "Crime",
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "87 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.3,
  "director": [
    {
      "id": "nm1077400",
      "name": "Devon Mikolas"
    }
  ],
  "writer": [
    {
      "id": "nm1077400",
      "name": "Devon Mikolas",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0608405",
      "name": "Bill Moseley",
      "character": "Peter Van Hooten"
    },
    {
      "id": "nm0247579",
      "name": "Leslie Easterbrook",
      "character": "Irene Van Hooten"
    },
    {
      "id": "nm0443478",
      "name": "Allan Kayser",
      "character": "Cliff Rifton"
    },
    {
      "id": "nm4077057",
      "name": "Emily Bennett",
      "character": "Regina"
    },
    {
      "id": "nm5059681",
      "name": "Callie Deering",
      "character": "Leslie       (as Callie Stephens)"
    },
    {
      "id": "nm4161198",
      "name": "David Andreiw",
      "character": "Sheriff Gooden"
    },
    {
      "id": "nm4760674",
      "name": "Nick Bastounes",
      "character": "John"
    },
    {
      "id": "nm5588933",
      "name": "Summer Bills",
      "character": "Patty"
    },
    {
      "id": "nm4185242",
      "name": "Greg Geffrard",
      "character": "James       (as Gregory Geffard)"
    },
    {
      "id": "nm2448633",
      "name": "Steffie Grote",
      "character": "Jossie       (as Stephanie Grote)"
    },
    {
      "id": "nm4978858",
      "name": "Jonathan Helvey",
      "character": "Thad"
    },
    {
      "id": "nm0561022",
      "name": "Howard Maurer",
      "character": "Emmett"
    },
    {
      "id": "nm5588978",
      "name": "Danny Miller",
      "character": "Tom"
    },
    {
      "id": "nm4378665",
      "name": "Susan Monts-Bologna",
      "character": "Margie"
    },
    {
      "id": "nm5598483",
      "name": "Kelly Owens",
      "character": "Helen"
    },
    {
      "id": "nm0246814",
      "name": "Dyanne Thorne",
      "character": "Rose"
    },
    {
      "id": "nm3931336",
      "name": "David Willis",
      "character": "Buzz"
    }
  ],
  "overview": "Evil wreaks pure havoc and bloody murder upon Leslie Van Hooten, a beautiful young girl, and her unsuspecting fellow grad students as they make their way to her family’s extravagant and yet isolated estate.",
  "storyline": "Evil wreaks pure havoc and bloody murder upon Leslie Van Hooten, a beautiful young girl, and her unsuspecting fellow grad students as they make their way to her family's extravagant and yet isolated estate. Peter (Bill Moseley- Texas Chainsaw Massacre 3D, House of 1000 Corpses) and Irene Van Hooten (Leslie Easterbrook- The Devil's Rejects, Police Academy), the young girl's mother and father, leave the group alone for the weekend, so that she may mourn the anniversary of her boyfriend's shocking murder. But the peaceful weekend soon turns to hell when they find themselves being savagely terrorized by Cliff Rifton (Allan Kayser- Night of the Creeps, TV's Mama's Family), a crazed and recently released career criminal, and Buzz Schenk, his drug addict side kick whom are hell bent on raging a torturous killing spree. But as the horrifying acts begin to unfold, the killers soon realize all is not as it seems in this house. And when some strange people from the neighborhood show up, Rose (...",
  "plot": null,
  "synopsis": "Evil wreaks pure havoc and bloody murder upon Leslie Van Hooten, a beautiful young girl, and her unsuspecting fellow grad students as they make their way to her familys extravagant and yet isolated estate.Peter (Bill Moseley- Texas Chainsaw Massacre 3D, House of 1000 Corpses) and Irene Van Hooten (Leslie Easterbrook- The Devils Rejects, Police Academy), the young girls mother and father, leave the group alone for the weekend, so that she may mourn the anniversary of her boyfriends shocking murder.But the peaceful weekend soon turns to hell when they find themselves being savagely terrorized by Cliff Rifton (Allan Kayser- Night of the Creeps, TVs Mamas Family), a crazed and recently released career criminal, and Buzz Schenk, his drug addict side kick whom are hell bent on raging a torturous killing spree.But as the horrifying acts begin to unfold, the killers soon realize all is not as it seems in this house. And when some strange people from the neighborhood show up, Rose (Dyanne Thorne- Ilsa She Wolf of the SS) and Emmett (Howard Maurer- Ilsa Harem Keeper of the Oil Sheiks), the tables are turned. Now everyone is trapped inside and as the unheard screams and the body count begins to rise, it seems that death is now the only real escape from the House of the Witch Doctor.By Chazz"
}