{
  "imdb_id": "tt2740710",
  "tmdb_id": "203351",
  "douban_id": null,
  "title": "From the Sea (Video 2013)",
  "genres": [
    "Action",
    "Adventure",
    "Sci-Fi",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": 1.7,
  "director": [
    {
      "id": "nm1714788",
      "name": "Jared Cohn"
    }
  ],
  "writer": [
    {
      "id": "nm5597768",
      "name": "Richard Lima",
      "description": "screenplay &"
    },
    {
      "id": "nm0505736",
      "name": "Thunder Levin",
      "description": "screenplay and"
    },
    {
      "id": "nm5397959",
      "name": "Hank Woon Jr.",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0001295",
      "name": "Graham Greene",
      "character": "General Hadley"
    },
    {
      "id": "nm0188025",
      "name": "Anthony 'Treach' Criss",
      "character": "Lieutenant Jim Rushing       (as Treach)"
    },
    {
      "id": "nm0002003",
      "name": "David Chokachi",
      "character": "Red"
    },
    {
      "id": "nm2624868",
      "name": "Jackie Moore",
      "character": "Tracey"
    },
    {
      "id": "nm4397494",
      "name": "Nicole Alexandra Shipley",
      "character": "Stone"
    },
    {
      "id": "nm0303908",
      "name": "Larry Gamell Jr.",
      "character": "Smith       (as Lawrence Gamell Jr.)"
    },
    {
      "id": "nm5584788",
      "name": "Steven Marlow",
      "character": "Sheldon"
    },
    {
      "id": "nm5599161",
      "name": "Jinhi Evans",
      "character": "Quinn"
    },
    {
      "id": "nm1957568",
      "name": "Sara Bond",
      "character": "Jennifer"
    },
    {
      "id": "nm5853623",
      "name": "Melissa Foster",
      "character": "Ensign"
    },
    {
      "id": "nm4453043",
      "name": "William Shannon Williams",
      "character": "Dagger       (as Shannon Williams)"
    },
    {
      "id": "nm5853624",
      "name": "Marquez Linder",
      "character": "MP       (as Marquez Kinder)"
    },
    {
      "id": "nm5853625",
      "name": "Conner Bryan",
      "character": "Joey"
    },
    {
      "id": "nm5574251",
      "name": "Nicole Dickson",
      "character": "Margaret"
    },
    {
      "id": "nm4778907",
      "name": "Demetrius Stear",
      "character": "Lieutenant Wexler"
    },
    {
      "id": "nm1714788",
      "name": "Jared Cohn",
      "character": "Spitfire"
    },
    {
      "id": "nm4497538",
      "name": "Kyndalle Sheigh Allen",
      "character": "Dead victim"
    },
    {
      "id": "nm6159922",
      "name": "Jojue Alvarado",
      "character": "Background person"
    },
    {
      "id": "nm6159923",
      "name": "Jennifer Alvare",
      "character": "Background person"
    },
    {
      "id": "nm5732627",
      "name": "Jessica Batista",
      "character": "Background person"
    },
    {
      "id": "nm6159925",
      "name": "Connor Bednar",
      "character": "Background person"
    },
    {
      "id": "nm6159924",
      "name": "Cameron 'Teddy' Bell",
      "character": "Background victim"
    },
    {
      "id": "nm6159926",
      "name": "Trista Bloula",
      "character": "Background dead person"
    },
    {
      "id": "nm6159927",
      "name": "Angela Bonner",
      "character": "Background person"
    },
    {
      "id": "nm6159928",
      "name": "Robert Bonner",
      "character": "Background person"
    },
    {
      "id": "nm6159929",
      "name": "Shirley E. Bridges",
      "character": "Background person"
    },
    {
      "id": "nm6159930",
      "name": "Brenda Brown",
      "character": "Background person"
    },
    {
      "id": "nm6159931",
      "name": "Rick Brown",
      "character": "Background person"
    },
    {
      "id": "nm4278402",
      "name": "Jaanika Kaarpalu",
      "character": "Pedestrian"
    },
    {
      "id": "nm5704493",
      "name": "Cecelia Kuhn",
      "character": "Victim"
    },
    {
      "id": "nm1413353",
      "name": "Eric C. Schmitz",
      "character": "Street musician"
    },
    {
      "id": "nm5777265",
      "name": "Savannah Sinor",
      "character": "Alexandra"
    }
  ],
  "overview": "When monsters suddenly appear from the bottom of the Atlantic Ocean, a special team pilots giant robots to combat the new threat.",
  "storyline": "When giant monsters crawl out of the Atlantic Ocean and attack the Eastern Seaboard the US Government is forced to trust a trio of mischievous soldiers, specialized in piloting gigantic robots, to defend America.",
  "plot": null,
  "synopsis": "Following the mysterious disappearance of an oil rig and a reconnaissance mini-submarine in the Gulf of Mexico, scientist Dr. Margaret Adams (Nicole Dickson) initiates the Armada Program, which consists of giant robots designed for deep sea rescue.The three robots - piloted by Red (David Chokachi), Tracy (Jackie Moore) and Jim (Treach) - dive nearly 800 fathoms to the sea bed, where they not only discover the mangled remains of the oil rig, but encounter the sea monster that brought it down. Red pursues the monster against orders from Admiral Hadley (Graham Greene), prompting the Admiral to order every naval fleet in the East Coast to converge to the oil rig's site. Red emerges on a beach to warn the bystanders to leave the premises for their safety when he is suddenly attacked from behind by the monster as their fight takes its toll on the city. An F-18 Hornet piloted by Spitfire (Jared Cohn) assists Red in taking the monster down. Red, however, is arrested for disobeying a direct order. He is locked in solitary confinement until he is briefly released by Adm. Hadley and later given a medal of honor for his heroic actions before serving the rest of his confinement.Later, Adm. Hadley is informed by Sheldon Geise (Steven Marlow) of a top-secret sonar program that discovered the monsters that are hundreds of millions of years old and lay their eggs on a mixture of crude oil and saltwater. Two eggs have been discovered; one of which hatched into the monster that Red and Spitfire killed. Adm. Hadley orders a search for the other egg, but he is too late, as it has already hatched, with the monster destroying a whole naval fleet before wreaking havoc on the city. As the monster attacks the naval base, Tracy and Jim scramble to spring Red out of solitary before they are picked up by Lt. Wexler (Demitrius Stear).Meanwhile, Geise informs Adm. Hadley that the President has authorized a nuclear strike on the monster, but Adm. Hadley refuses that decision and orders everyone to evacuate the base. The monster retreats after a Northrop Grumman B-2 Spirit drops a payload on it. Adm. Hadley is later informed that another egg has hatched off the Atlantic Coast.Dr. Adams gives the trio special \"halo\" headbands that neurally link them to their robots, increasing their reflexes by using their direct body movements instead of joysticks. The system's downside is the pilot feeling pain for every damage the robot takes. After a crash course on the new system, the trio fly their robots to New York City to battle the monster. Following numerous refusals by Adm. Hadley to launch a nuclear strike, Geise orders the USS Virginia to launch a warhead. Red intercepts the missile and jams its frequency, saving the city from a nuclear holocaust. In retaliation, Geise threatens Dr. Adams to shut down the robots, but is quickly subdued by Lt. Wexler, despite shooting the Admiral in the arm. During the battle, Tracy loses consciousness when her neural level goes critical. Jim takes Tracy to safety while Red grabs the warhead and the monster before flying them to the atmosphere. He then kicks the monster to deep space, detonating the warhead in the process and sending him crashing back on Earth.In the final scene, the trio and Adm. Hadley celebrate by heading to the local bar for some tequila shots."
}