{
  "imdb_id": "tt2726270",
  "tmdb_id": "298653",
  "douban_id": null,
  "title": "Tormented (2014)",
  "genres": [
    "Horror",
    "Thriller"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "83 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.7,
  "director": [
    {
      "id": "nm1918281",
      "name": "Audrey Cummings"
    }
  ],
  "writer": [
    {
      "id": "nm1860614",
      "name": "Chris Gamble",
      "description": "writer"
    },
    {
      "id": "nm1860614",
      "name": "Chris Gamble",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm5590139",
      "name": "Alysa King",
      "character": "Kylie Winters"
    },
    {
      "id": "nm5469410",
      "name": "Madison Ferguson",
      "character": "Phoebe Harrison"
    },
    {
      "id": "nm5591014",
      "name": "Cristophe Gallander",
      "character": "Sam Harrison"
    },
    {
      "id": "nm4105669",
      "name": "Samora Smallwood",
      "character": "Roberta"
    },
    {
      "id": "nm4286713",
      "name": "Bart Rochon",
      "character": "Swine"
    },
    {
      "id": "nm5669396",
      "name": "Aaron Chartrand",
      "character": "Marcus"
    },
    {
      "id": "nm5967379",
      "name": "Leo Pady",
      "character": "Piglet"
    },
    {
      "id": "nm3433851",
      "name": "Josee Young",
      "character": "Amy Winters"
    },
    {
      "id": "nm0634349",
      "name": "Robert Nolan",
      "character": "Glen Harrison"
    },
    {
      "id": "nm5618412",
      "name": "Daphne Moens",
      "character": "Chelsea Harrison"
    },
    {
      "id": "nm2627929",
      "name": "Daniel Stolfi",
      "character": "Officer Reilly"
    },
    {
      "id": "nm3980122",
      "name": "Marcus Tarnoy",
      "character": "Officer Stockton"
    },
    {
      "id": "nm5618430",
      "name": "Sofia Troop",
      "character": "Cammy"
    },
    {
      "id": "nm5619158",
      "name": "Chelsea Leaman",
      "character": "Charlotte"
    },
    {
      "id": "nm5597253",
      "name": "C.J. Dubé",
      "character": "Jonathan"
    },
    {
      "id": "nm4448535",
      "name": "Michael Lipka",
      "character": "Peter       (as Mikey Lipka)"
    },
    {
      "id": "nm4446901",
      "name": "Alys Crocker",
      "character": "Renee"
    },
    {
      "id": "nm5739596",
      "name": "Stephanie Domet",
      "character": "Felecia"
    },
    {
      "id": "nm5661084",
      "name": "Jessica Vano",
      "character": "Lisa"
    },
    {
      "id": "nm2049476",
      "name": "Cheryl Meyer",
      "character": "Karen"
    },
    {
      "id": "nm6491274",
      "name": "Hugh Meyer",
      "character": "Principal Morris"
    },
    {
      "id": "nm3950840",
      "name": "Josh Heisie",
      "character": "Child Care Worker"
    }
  ],
  "overview": "Kylie Winters, a bullied and self-loathing teen, reluctantly agrees to babysit at an isolated country mansion on Halloween night. When a small boy in a pig mask appears at the door trick-or-treating, Kylie's night transforms into a horrifying and violent cat-and-mouse game. She must go beyond what she ever thought possible if she and the children are to survive the night.",
  "storyline": "Kylie Winters, a bullied and self-loathing teen, reluctantly agrees to babysit at an isolated country mansion on Halloween night. When a small boy in a pig mask appears at the door trick-or-treating, Kylie's night transforms into a horrifying and violent cat-and-mouse game. She must go beyond what she ever thought possible if she and the children are to survive the night.",
  "plot": "Hearing noises outside their home during a family dinner, Jim Bronson orders his wife Maggie to go outside and take a look. Maggie finds their dog dead before being attacked and killed. The intruders sneak into the house and kill Jim before going upstairs and assaulting Jim and Maggie’s daughter Mary.\n\nCory Morgan drives his new wife Sarah and his seven-year-old son Liam to their secluded vacation house in a remote area. Still grieving over the death of his birth mother, Liam treats Sarah coldly. Cory tries speaking with his son about accepting Sarah as part of their family.\n\nThe Morgans find plates of rotten food and used linens in their home. Realizing that squatters were living there, they call Officer Hawkings to the scene. Hawkings explains that there is nothing he can do about a breaking and entering, but he provides his card to make Sarah feel safer about staying in the house.\n\nSarah and Cory hear strange noises during the night and discover that Liam is missing when they go to investigate. Sarah steps on a nail while searching outside and injures her foot. They find Officer Hawkings tied up in his patrol car before it suddenly explodes, with a mouse masked stranger watching the flames. Because she is injured, Cory is forced to leave Sarah at the house while he goes to the nearby Bronson home for help. Cory discovers the murder scene in the Bronson house before being attacked by the mouse masked and a rabbit masked stranger, and knocked unconscious.\n\nThe intruders wear masks cut from Liam’s large stuffed animals, which identify them as Mr. Mouse, Pig Lady, Little Rabbit, and Little Monkey. When Cory wakes, Mr. Mouse tortures him with a car battery. Mr. Mouse produces Liam and forces Cory to tell his son that he does not love him. Liam is emotionally devastated, screaming while Little Rabbit drags him away. Mr. Mouse exclaims \"He is part of our family now\". He then duct tapes a plastic bag over Cory’s head and leaves him to suffocate.\n\nBack at the Morgan house, Sarah is pursued by Pig Lady. Sarah eventually escapes and is able to drown Pig Lady in a forest creek following a struggle.\n\nCory manages to break free of his restraints. He finds Liam and reassures his son that he only said horrible things because of the torture. Little Monkey interrupts their reunion by confronting Cory with a pitchfork. Cory unmasks Little Monkey and discovers that she is actually a brainwashed Mary Bronson. He knocks her out and escapes into the forest with Liam.\n\nMr. Mouse captures Sarah. Cory hears her screams and tells Liam to wait while he returns to rescue his wife. Sarah electrocutes Mr. Mouse with the car battery and flees outside with Cory.\n\nLittle Rabbit emerges with a rifle and fatally shoots Cory. Sarah finds Liam and runs with him through the trees while Little Rabbit fires his gun in pursuit. Little Rabbit finds Liam and hesitates to shoot him. Sarah appears and tells the killer to pull the trigger on her instead, Little Rabbit does this but the gun is empty. Following another struggle, Sarah ultimately subdues Little Rabbit.\n\nAfter processing the crime scene, a police officer takes Mary Bronson away in a squad car while an ambulance takes Little Rabbit. When her windshield is damaged, the police officer stops her car and is beaten to death with a rock by Mr. Mouse. Mr. Mouse retrieves his mask from an evidence bag and gets behind the wheel as Mary expresses that she knew he would come for her, he replies with 'We must find you a new mother' (implying Pig Lady was going to be her \"new\" mother). Mary asks about the father. He replies with 'The father will be coming'. Meanwhile, Little Rabbit unshackles himself from the gurney, unmasks himself and grabs a scalpel as he prepares to murder the ambulance driver.",
  "synopsis": null
}