{
  "imdb_id": "tt2731970",
  "tmdb_id": "257954",
  "douban_id": null,
  "title": "2 Bedroom 1 Bath (2014)",
  "genres": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "91 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.1,
  "director": [
    {
      "id": "nm0950956",
      "name": "Stanley Yung"
    }
  ],
  "writer": [
    {
      "id": "nm0950956",
      "name": "Stanley Yung",
      "description": "writer"
    },
    {
      "id": "nm0950956",
      "name": "Stanley Yung",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0000616",
      "name": "Eric Roberts",
      "character": "Dr. Philip Tenenbaum"
    },
    {
      "id": "nm1027286",
      "name": "Andrew W. Walker",
      "character": "Kevin"
    },
    {
      "id": "nm2104193",
      "name": "Shoshana Bush",
      "character": "Leah"
    },
    {
      "id": "nm0908914",
      "name": "Dee Wallace",
      "character": "Rose"
    },
    {
      "id": "nm0541908",
      "name": "Costas Mandylor",
      "character": "Frank"
    },
    {
      "id": "nm2473806",
      "name": "Aaron Jay Rome",
      "character": "Vincent"
    },
    {
      "id": "nm0382920",
      "name": "Michele Hicks",
      "character": "Rachel"
    },
    {
      "id": "nm1648492",
      "name": "Shelby Young",
      "character": "Siena"
    },
    {
      "id": "nm4291210",
      "name": "Laura Flannery",
      "character": "TV Reporter"
    },
    {
      "id": "nm0232800",
      "name": "Jack Donner",
      "character": "Old Man Thompson"
    },
    {
      "id": "nm5583008",
      "name": "Aiden Flowers",
      "character": "Billy"
    },
    {
      "id": "nm1296459",
      "name": "Ivan Shaw",
      "character": "Peter"
    },
    {
      "id": "nm4627674",
      "name": "Cariella Smith",
      "character": "Tanya"
    },
    {
      "id": "nm5059429",
      "name": "Sarah Ellis Smith",
      "character": "Susan       (as Ruby Lou Smith)"
    },
    {
      "id": "nm2565812",
      "name": "Rachel Whitman Groves",
      "character": "Dr. Carlson"
    },
    {
      "id": "nm3856793",
      "name": "Heather Williams",
      "character": "Annika"
    },
    {
      "id": "nm4540861",
      "name": "Marcela Macias",
      "character": "Claudia Thorne /              Woman in Red"
    },
    {
      "id": "nm1141654",
      "name": "Jody Jaress",
      "character": "Agnes"
    },
    {
      "id": "nm5063909",
      "name": "Christine Tonry",
      "character": "Mother"
    },
    {
      "id": "nm5593149",
      "name": "Cullen Tonry",
      "character": "Tommy"
    },
    {
      "id": "nm3102674",
      "name": "Ellen Ho",
      "character": "Reporter Carmen Lee"
    },
    {
      "id": "nm1326778",
      "name": "Dino Dos Santos",
      "character": "Cop 2"
    },
    {
      "id": "nm5243909",
      "name": "Lucas Boffin",
      "character": "Tyler"
    },
    {
      "id": "nm5062602",
      "name": "Trav",
      "character": "Steve"
    },
    {
      "id": "nm5211128",
      "name": "Kara Kimmer",
      "character": "Dr. Bayati"
    },
    {
      "id": "nm4650037",
      "name": "Wanda Leigh",
      "character": "Sister Catherine"
    },
    {
      "id": "nm2738724",
      "name": "John Swider",
      "character": "Porn Star"
    },
    {
      "id": "nm5243044",
      "name": "Camden Flowers",
      "character": "Cynthia"
    },
    {
      "id": "nm5242830",
      "name": "Carsen Flowers",
      "character": "Cindy"
    },
    {
      "id": "nm5243287",
      "name": "Jessica Lemon Wilkinson",
      "character": "Dr. Torlakson"
    },
    {
      "id": "nm2316921",
      "name": "Al Bravo",
      "character": "Cop 1"
    },
    {
      "id": "nm5527541",
      "name": "Zachary Tryon",
      "character": "Tommy"
    }
  ],
  "overview": "A young couple moves into what appears to be the perfect home, but when they discover that they will soon become parents, things begin to fall apart. Rachel, the expectant mother, is haunted by a ghost in a red dress, while Kevin, the soon to be father, has frightening nightmares even while he’s awake. The once happy couple is torn apart by horrific events, which all seem to be centered around the birth of their unborn child.",
  "storyline": "2 Bedroom 1 Bath is the chilling tale of a young couple whose 'perfect' home turns out to be anything but sweet. When strange occurrences in the apartment invade Kevin's dreams and push Rachel over the edge, Kevin is forced to delve into the history of his new home and uncovers a terrifying past. The tormented spirit of a former tenant haunts the couple and threatens to tear their marriage apart by horrific events, which all seem to be centered around the birth of their unborn child. This ghostly tale shows that there is no turning back once the evil clutches of the supernatural grab hold of you. A frightening, psychological thriller turns a young couple's dream of 'happily-ever-after' into a horrifying nightmare.",
  "plot": "During a lunchtime tryst in Phoenix, Arizona, a real estate secretary named Marion Crane discusses with her boyfriend, Sam Loomis, how they cannot afford to get married because of Sam's debts. After lunch, Marion returns to work, where a client drops off a $40,000 ($323,824.52 when adjusted for inflation) cash payment on a property. Her boss asks her to deposit the money in the bank, and she asks if she can take the rest of the afternoon off. Returning home, she begins to pack for an unplanned trip, deciding to steal the money and give it to Sam in Fairvale, California. She is seen by her boss on her way out of town, which makes her nervous. During the trip, she pulls over on the side of the road and falls asleep, only to be awakened by a state patrol officer. He is suspicious about her nervous behavior but allows her to drive on. Shaken by the encounter, Marion stops at an automobile dealership and trades in her Ford Mainline, with its Arizona license plates, for a Ford Custom 300 that has California tags. Her transaction is all for naught—the highway patrolman sees her at the car dealership and witnesses her purchase of the newer car.\n\nDriving on, Marion encounters a sudden rainstorm and decides to stop for the night at the Bates Motel; the proprietor, Norman Bates, invites her to a light dinner after she checks in. She accepts, but then hears an argument between Norman and his mother about bringing a woman into her house. They eat in the motel parlor, where he tells her about his hobby of taxidermy and his life with his mother, who is mentally ill and forbids him to have a life outside of her. Returning to her room, Marion decides to go back to Phoenix to return the stolen money. She prepares to take a shower, unaware that Norman is spying on her. As she is showering, a shadowy female figure suddenly comes in and stabs her to death with a chef's knife. Norman discovers the murder and meticulously cleans up the crime scene, putting Marion's corpse and her possessions—including the embezzled money—into the trunk of her car and sinking it in the swamps near the motel.\n\nA week later, Marion's sister Lila arrives in Fairvale and confronts Sam about the whereabouts of her sister. A private investigator named Arbogast approaches them and confirms that Marion is wanted for stealing the $40,000 from her employer. He eventually comes across the Bates Motel, where Norman's behavior arouses his suspicions. After hearing that Marion had met with Norman's mother, he asks to speak with her, but Norman refuses. Arbogast calls Lila and Sam, informing them of what he has discovered and saying he intends to speak with Norman's mother. He goes to the Bates' home in search of her; as he reaches the top of the stairs, Mrs. Bates suddenly appears from the bedroom and murders him. When Lila and Sam do not hear from Arbogast, they go to the local sheriff, who informs them that Mrs. Bates has been dead for ten years; she had killed herself and her lover. Concerned, Lila and Sam make their way to the motel. Norman takes his unwilling mother from her room, telling her he needs to hide her for a while in the fruit cellar.\n\nAt the motel, Lila and Sam meet Norman. Sam distracts him by striking up a conversation while Lila sneaks up to the house. When Norman eventually realizes what they want, he knocks Sam out and rushes to the house. Lila sees Norman approaching and attempts to hide by going down steps that lead to a cellar. There she finds Mrs. Bates sitting in a chair. Lila turns her around and discovers that she is in fact a mummified corpse. Lila screams as a figure comes running into the cellar: Norman, holding a chef's knife and wearing his mother's clothes and a wig. Before Norman can attack Lila, Sam, having regained consciousness, subdues him.\n\nAt the local courthouse, a psychiatrist explains that Norman had murdered Mrs. Bates and her lover 10 years prior out of jealousy. Before, they had been living an isolated life together after his father's death, until she met this new man. Unable to bear the guilt, he exhumed her corpse and began to treat it as if she were still alive. In order to preserve that illusion, he recreated his mother in his own mind as an alternate personality, often dressing in her clothes and talking to himself in her voice. The \"Mother\" personality is as jealous and possessive as the real Mrs. Bates had been: Whenever Norman feels attracted to another woman, \"Mother\" flies into a rage and kills her. As \"Mother\", Norman had killed two missing girls prior to Marion, as well as Arbogast. The psychiatrist then says the \"Mother\" personality has taken permanent hold of Norman's mind. While Norman sits in a holding cell, Mrs. Bates' voice is heard protesting that the murders were Norman's doing and that she \"wouldn't even harm a fly.\" Meanwhile, Marion's car is pulled out of the swamp.",
  "synopsis": "A young couple moves into what appears to be the perfect home, but when they discovered that they will soon become parents, things begin to fall apart. Rachel, the expecting mother, is visited and tormented by a ghost in a red dress. At the same time, Kevin, the soon to be father, simultaneously begins to experience issues at work. What was once a happy couple, is torn apart by horrific events which all seem to be centered around the birth of their unborn child."
}