{
  "imdb_id": "tt2704752",
  "tmdb_id": "315839",
  "douban_id": null,
  "title": "Above and Beyond (2014)",
  "genres": [
    "Documentary",
    "Adventure",
    "History",
    "War"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.8,
  "director": [
    {
      "id": "nm0343706",
      "name": "Roberta Grossman"
    }
  ],
  "writer": [
    {
      "id": "nm2510874",
      "name": "Sophie Sartain",
      "description": null
    },
    {
      "id": "nm6343054",
      "name": "Sophie Sartain",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm7984282",
      "name": "Mina Alon",
      "character": "Herself"
    },
    {
      "id": "nm4292050",
      "name": "Richard J. Carson",
      "character": "Extra"
    },
    {
      "id": "nm7984241",
      "name": "Eddie Cohen",
      "character": "Himself       (archive footage)"
    },
    {
      "id": "nm7984242",
      "name": "Leon Frankel",
      "character": "Himself"
    },
    {
      "id": "nm7984243",
      "name": "Coleman Goldstein",
      "character": "Himself       (archive footage)"
    },
    {
      "id": "nm0501706",
      "name": "Lou Lenart",
      "character": "Himself"
    },
    {
      "id": "nm3799763",
      "name": "George Lichter",
      "character": "Himself       (archive footage)"
    },
    {
      "id": "nm7984244",
      "name": "Gideon Lichtman",
      "character": "Himself"
    },
    {
      "id": "nm0515245",
      "name": "Harold Livingston",
      "character": "Himself"
    },
    {
      "id": "nm0673364",
      "name": "Shimon Peres",
      "character": "Himself"
    },
    {
      "id": "nm0000607",
      "name": "Paul Reubens",
      "character": "Himself"
    },
    {
      "id": "nm6160211",
      "name": "Jd Roth-round",
      "character": "Machal fighter pilot"
    },
    {
      "id": "nm3473970",
      "name": "Al Schwimmer",
      "character": "Himself       (archive footage)"
    },
    {
      "id": "nm7468423",
      "name": "Dani Shapira",
      "character": "Himself"
    },
    {
      "id": "nm6011388",
      "name": "Smoky Simon",
      "character": "Himself"
    },
    {
      "id": "nm3846558",
      "name": "Mike van den Dobbelsteen",
      "character": "Israeli Ground Crew"
    },
    {
      "id": "nm7984240",
      "name": "Bob Vickman",
      "character": "(archive footage)"
    }
  ],
  "overview": "In 1948, a group of World War II pilots volunteered to fight for Israel in the War of Independence.",
  "storyline": "In 1948, a group of World War II pilots volunteered to fight for Israel in the War of Independence. As members of 'Machal' -- volunteers from abroad -- this ragtag band of brothers not only turned the tide of the war, preventing the possible annihilation of Israel at the very moment of its birth; they also laid the groundwork for the Israeli Air Force. ABOVE AND BEYOND is their story. The first major feature-length documentary about the foreign airmen in the War of Independence, ABOVE AND BEYOND brings together new interviews with pilots from the '48 War, as well as leading scholars and statesmen, including Shimon Peres, to present an extraordinary, little-known tale with reverberations up to the present day.",
  "plot": "In 1948, the new state of Israel is about to declare its independence after Palestine is partitioned. The surrounding Arab states are about to launch an invasion with overwhelming superiority in numbers and weaponry compared to the emergent Israeli defences. With no air force or aircraft, American and other foreign pilots are called upon to start a nascent military air force. The first aircraft are bought from the massive U.S. government surplus stocks and are former USAF Curtiss C-46 Commando transports, used in shipping war materiel back to Israel.\n\nFacing restrictions that precluded help to belligerent nations, the first volunteers who choose to help have to find ways to work around U.S. government regulations. Al Schwimmer, a U.S. citizen, later charged with violating U.S. neutrality, takes charge of a transport operation. He registered the C-46 transports in Panama as Lineas Aereas de Panama aircraft and flew them to Israel via a circuitous route that includes Natal, Brazil, Casablanca, Morocco and Rome, which becomes the headquarters of the volunteer fighter pilots. Chief among the group is Canadian \"Ace-of-aces\" George Beurling (\"Buzz\" Beurling} who dies in a mysterious crash while testing a Noorduyn Norseman light transport.\n\nWith the assistance of officials in Czechoslovakia, a number of Avia S-199 fighter aircraft, a variant of the Messerschmitt Bf 109, were obtained. The fighter pilots who trained in Czechoslovakia include Lou Lenart, Leon Frankel, Harold Livingston, Milton Rubenfeld, George Lichter and Gideon Lichtman. Universally, the trainees hated the Avia S-199, called the \"Messer-shitt\" by Lichtman. After transporting the fighter aircraft to Israel, the first four aircraft are deployed to attack an Egyptian armored column moving on Tel Aviv. With the attack taking the enemy by surprise, the Egyptians retreat. Other air attacks help to bring about a truce between the combatants. During the truce, Israeli volunteers in the United States, manage to purchase and smuggle two Boeing B-17 Flying Fortress bombers out of the country. When war is declared again, the B-17s are in the air, overflying the Middle East and divert to an attack on Cairo.\n\nAerial prowess proves to be a deciding factor in the coming battles, as a group of Supermarine Spitfire LF Mk IXE fighter aircraft is purchased from Czechoslovakia. Israeli fighter pilots flying a mix of Avia S-199s and Spitfires tangled with Egyptian Spitfires, with the first air-to-air combat ending with Gideon Lichtman bringing down an Egyptian Spitfire, albeit in his \"Messer-shitt\". As the volunteer-driven program becomes more organized, with leaders such as Modi Alon, \"Smoky\" Simon, Ezer Weizman and Dani Shapira taking charge, a strong defensive Israeli Air Force is created.",
  "synopsis": null
}