{
  "imdb_id": "tt2762970",
  "tmdb_id": "245473",
  "douban_id": null,
  "title": "Cloud 9 (TV Movie 2014)",
  "genres": [
    "Action",
    "Adventure",
    "Drama",
    "Family",
    "Sport"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm0388505",
      "name": "Paul Hoen"
    }
  ],
  "writer": [
    {
      "id": "nm1234853",
      "name": "Justin Ware",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0972851",
      "name": "Luke Benward",
      "character": "Will"
    },
    {
      "id": "nm4874651",
      "name": "Dove Cameron",
      "character": "Kayla"
    },
    {
      "id": "nm3374198",
      "name": "Mike C. Manning",
      "character": "Nick Swift"
    },
    {
      "id": "nm4169922",
      "name": "Kiersey Clemons",
      "character": "Skye Sailor"
    },
    {
      "id": "nm0268424",
      "name": "Amy Farrington",
      "character": "Andrea Cloud"
    },
    {
      "id": "nm0264579",
      "name": "Patrick Fabian",
      "character": "Richard Morgan"
    },
    {
      "id": "nm2455748",
      "name": "Carlon Jeffery",
      "character": "Dink"
    },
    {
      "id": "nm2255271",
      "name": "Andrew Caldwell",
      "character": "Sam"
    },
    {
      "id": "nm1722598",
      "name": "Dillon Lane",
      "character": "Burke"
    },
    {
      "id": "nm2466936",
      "name": "Colton Tran",
      "character": "Mike Lamb"
    },
    {
      "id": "nm3483537",
      "name": "Victoria Moroles",
      "character": "Pia"
    },
    {
      "id": "nm5804664",
      "name": "Tatum Chiniquy",
      "character": "Linds"
    },
    {
      "id": "nm0635139",
      "name": "Jeffrey Nordling",
      "character": "Sebastian Swift"
    },
    {
      "id": "nm6251784",
      "name": "Michelle Zeller",
      "character": "Sarah"
    },
    {
      "id": "nm1349770",
      "name": "Kenda Benward",
      "character": "Madeline"
    },
    {
      "id": "nm4162958",
      "name": "Bryan Dayley",
      "character": "Event Organizer       (as Bryan Daley)"
    },
    {
      "id": "nm6475805",
      "name": "Mason D. Davis",
      "character": "Random Dude       (as Mason Mac)"
    },
    {
      "id": "nm1476924",
      "name": "Trevor Snarr",
      "character": "Security Guard Bennie"
    },
    {
      "id": "nm0851276",
      "name": "Jason Tatom",
      "character": "Mr. Rourke"
    },
    {
      "id": "nm0452593",
      "name": "Paul Kiernan",
      "character": "Marshall"
    },
    {
      "id": "nm1658341",
      "name": "K. Danor Gerald",
      "character": "Camera Operator       (as Danor Gerald)"
    },
    {
      "id": "nm1460829",
      "name": "Allan Groves",
      "character": "Announcer"
    },
    {
      "id": "nm4197678",
      "name": "James Gaisford",
      "character": "Assistant"
    },
    {
      "id": "nm6251787",
      "name": "Ken Foody",
      "character": "Visiting Dad"
    }
  ],
  "overview": "Set high atop snow-capped mountains in the adrenaline-fueled world of competitive snowboarding, the Disney Channel Original Movie “Cloud 9″ tells the inspiring story of two snowboarders who must overcome self-doubt to learn that achieving their dreams is possible.",
  "storyline": "Follows Kayla, a prima donna snowboarder who was just unceremoniously dropped from her team and forced to train with Will, a former snowboarding champion who's struggling after a career-ending wipe-out. A video capturing it went viral, branding him an \"epic fail\" on the Internet. Now, as Kayla trains with Will to redeem her stature, Will creates a training regimen that tests whether she's really committed to rise to the challenge of professional competition. Meanwhile, Kayla must somehow maneuver to inspire Will to overcome his biggest obstacle - self-doubt.",
  "plot": "This article may contain an excessive amount of intricate detail that may only interest a specific audience. Please help by spinning off or relocating any relevant information, and removing excessive detail that may be against Wikipedia's inclusion policy. (September 2014) (Learn how and when to remove this template message)\nSnowboarder Kayla Morgan (Dove Cameron), the best girl shredder in Summit Valley, competes in a snowboarding challenge and wins for the girls' division. With her Swift snowboarding teammate/boyfriend, Nick Swift (Mike Manning), who is also the son of team coach Sebastian Swift (Jeffrey Nordling), she trains as a part of the Swift Team to win the \"Fire and Ice\" snowboarding competition. A year ago, a viral video branding the famous, legendary snowboarder Will Cloud (Luke Benward) as an \"epic failure\" caused Will to end his snowboarding career. He wiped out attempting a move he created in Fire and Ice, called the Cloud 9, and almost died, allowing the Swifts to take the win. Now, Will works at his family's dog-kennel with his mom, Andrea (Amy Farrington). During a pre-Fire and Ice party for the Swifts, Sebastian Swift tells Nick that he needs to do whatever it takes to win Fire and Ice. After the party, Kayla, Nick, and their two other teammates find Will's sled that he left behind while taking a customer's dog for a walk. Kayla and Nick get on and ride the sled, however, Nick is unable to control it and apologizes to Kayla before falling/throwing himself out of the sled. Still riding, Kayla crashes through the mountain lodge sign, demolishing it and breaking the sled in the process. A security guard finds her and takes her home, and Kayla was abandoned by her teammates to take the blame. Will is informed that his sled is broken.\n\nHer parents, Richard (Patrick Fabian) and Madeline, tell Kayla and Will that they will fix the sign, but Kayla has to work at the dog kennel every day after school to pay for Will's sled unless she told them who else was there at the incident. She refuses, and she and Will argue about her presence at the kennel. In the midst of their talk, Will blatantly tells Kayla that even though she has won many medals, her board technique is rusty and she was only on the Swift team because her dad owned the resort and supplied the team with money.\n\nAfter school, Kayla hurries into the kennel, hoping not to be spotted. While Will took a dog for a walk, Kayla fills the dogs' food bowls. She receives a voice mail from Sebastian that she is kicked off the team because of her misconduct. Furious, she marches up to Nick and they have a serious discussion. He and the others knew about her dismissal from the team but wouldn't do or say anything about it. When Kayla presses further, Nick comes straight out with the truth he's been trying to avoid and explains that she can't win Fire and Ice, due to her faulty riding. She and her father argue about how he doesn't think Kayla's good enough to try to reach for the stars.\n\nThe next day, Kayla is seen mopping the floor and has arrived at the kennel earlier than Will. When Will arrives, he is with his friends, Dink (Carlon Jeffery) and Sam (Andrew Caldwell). Sam had taken a nasty fall attempting a snowboarding move, and Will lectures Sam about following the exercises he recommended for him and figures out where Sam went wrong. Kayla realizes that Will truly does know what he is doing. Later, Will and his friends leave for some pizza, leaving Kayla in charge. After she locks one of the dogs, Donald, in his cage, Kayla gives another, Buford, a bath. Donald mischievously unlocks the cage and lets the other dogs out. She discovers their escape and chases them through town. Later, she talks to Nick again, and he decides that they should break-up, saying that she is distracting him from the competition. When Kayla returns to the kennel with the dogs, she pleads to be fired, but Andrea refuses. Back at home, her friends Pia and Lindsay try to comfort her and bring themselves to watch the viral video and see how Will got injured.\n\nKayla asks Will to train her for Fire and Ice so she can really know snowboarding and work on her technique. She also offers to remodel the kennel to bring in more customers. Will denies that he still loves snowboarding and refuses to coach her. Infuriated, Kayla keeps trying to talk reason into him. He blatantly replies that she does not have a team to compete with, and so there would be no point in teaching her anyways. Kayla sees his old teammates and decided that they could be a team together. Kayla then notices the really famous shredder, Skye Sailor (Kiersey Clemons), and realizes the Swifts have replaced her with Skye. She tries to reason with Will again, telling him not only have the Swifts replaced her, but they beat Will too and he hasn't snowboarded since. Will then agrees to train them.\n\nAt school, she tells her friends that Will is going to coach her and introduces them to Sam and Dink. She sees Nick and is incredulous when he silently 'what-upps' her. Spotting Skye, she points her out to her friends, who comfort her by reminding Kayla that Skye was wearing double studs, which was \"so last season.\"\n\nLater, Skye spots Kayla and offers to give her an autograph. Realizing this was the girl she replaced, she decides to make the autograph to 'Kayla, Everyone's favorite Daddy's girl.' Angrily, Kayla remarks that she will be the winner of Fire and Ice. Will frustratedly tells Kayla that she has to prove that, and they start serious training. Kayla isn't doing great at the start, but she is later showing steady improvement and also working on the makeover for the dog kennel. At one point, Nick sees Kayla and Will together and he doesn't seem happy about it.\n\nWill's mom is blown away at the makeover once it is finished. She notes that Will and Kayla made a great team and gives them the day off to relax and have fun. While Will is preoccupied, she thanks Kayla for bringing back \"the old Will.\" After getting fro-yo, Kayla notices Tyson's Peak and comments on its scary appearance. Will says that it is and Kayla wonders if anyone ever snowboarded down the mountain. Will then tells Kayla the story of Tyson's Peak: how Tyson attempted to ride the mountain and his body was never found, but he was joking around. Will concludes that riding down the mountain is impossible, while Kayla argues that nothing is impossible. Kayla asks what their chances of winning Fire and Ice were, and Will tells her that although it was shaky, they are starting to look like a real threat. Kayla ventures even further, voicing her thoughts that Will should join their team. Taking note of how unsure he looked, she makes him promise to at least think about it. Later, Kayla and Will view the viral video apart, but couldn't stand to watch it. The next morning, Kayla hears that her mother talked to Will's mom about her input at the kennel and her determination to become better at snowboarding, thus enlisting Will. She then hears her dad's comment that he doesn't want to see her fail and she had no chance against the Swifts. Sadly, she reminds herself that nothing is impossible.\n\nLater, Kayla asks Will to teach her the Cloud 9, but they argue when Will says she is not ready. Will uses the mountain as an example, saying you need to have no fear going down it. He ventures to say that Kayla is not yet at that point. Determined to prove a point, Kayla takes a helicopter ride to the top of Tyson's peak and bravely snowboards down the mountain, unaware that she is being recorded on TV from the helicopter and broadcast live on television. But on the way down, she falls off a drop when the snow ledge breaks, which causes an avalanche, which buries her under the snow though by then, she has boarded all the way down Tyson's Peak. Will and Donald run to find her and eventually rescue her. Kayla admits that she boarded down the peak just to impress Will, so he would be willing to teach her the Cloud 9.\n\nIn school, Kayla finds out that Skye is already Nick's \"sidechick\", and she tricks Will into holding her hand to even up the score. Later, Dink and Sam learn that Will has joined the team. After, a few test runs after his long year off, Will stumbles and falls. He purposely pretends to be unconscious and scares them. The Swift team saw him snowboarding and when he took the fall, Nick says 'once an epic failure, always an epic failure.' Will finally agrees to teach Kayla the Cloud 9 and shows Kayla how to do the first part. While she attempts the Cloud 9, Nick and Skye sees. Nick seems sympathetic when she falls and Skye notices. After a few failed attempts at the Cloud 9, Kayla leaves to refuel. Nick arrives and tells Will there's a strong chance Kayla will be injured doing the Cloud 9 just as Will was, and it would be Will's fault. Afterwards, Kayla makes a few more attempts. Now into the night, Skye is watching her when Sebastian sees her attempts. Panicked, he asks Skye what she was doing and Skye said the Cloud 9. He doesn't believe that she can pull it off but Skye counters him, saying not to count her out. Mad, he tells Skye that she told him she could beat Kayla. Skye counters commenting that he lied because he had said she was a pampered princess with no talent. She goes on about how much better Kayla's doing, saying \"That girl can ride\". When Kayla wants to do another attempt, Will says she was hesitating and that he can't risk her getting hurt. He accuses her that it is really just about winning Nick back. Kayla says she has had enough with people who don't believe in her. Will comes up and kisses her and he leaves. When Kayla heads home, Sebastian comes up and tells her that he wants her back on the team and she says yes, just because he saw her as a new improved weapon for the Swifts.\n\nAt the Fire and Ice competition, Kayla arrives wearing a Swift Team jacket, making the Hot Doggers (Kayla's team) think she gave up on them. Kayla reveals she was only pulling a trick and was only wearing it to return the equipment she was instructed to give back earlier, saying that teal was \"so last season\", making it clear that she has officially dumped the Swift team for what they did, and the Hot Doggers is where she belongs, despite warnings of regret from Sebastian. When Fire and Ice begins, Will starts out very well, with Nick close behind. In Run 2, Nick starts to show power and wins the Men's title, making Kayla the only chance the Hot Doggers have left against the Swift team. Kayla does very bad in Run 1, and so does Skye, but Kayla is behind. Skye pulled off a routine in Run 2 and Kayla can only beat her with at least an almost perfect score. Right before her round in Run 2, Richard apologizes to Kayla for not believing in her and hopes that she will win. Sebastian sees this and considers it a distraction from winning. Nick protests that a parent supporting their kid is not a bad thing. Nick then tells Kayla that he followed his father's orders to crash the sled in order to give his father an excuse to kick Kayla off the team as Sebastian before did not believe in her. Nick tells his father that this was his dream, not Nick's. Kayla and Will are both unsure if she will be able to perform the Cloud 9, but after what Nick told her, she is now furious at Sebastian and more determined than ever to beat the Swifts and decides she will do it. With an awesome performance, she successfully lands the Cloud 9, scoring a perfect 10 points from all the judges, winning her first \"real\" trophy, and making the Hot Doggers overall winners of Fire and Ice. Pia, Linds, Richard, Madeline, Nick, and even Skye applaud her, as well as Sebastian, who now regrets his decision to dump her from his team.",
  "synopsis": null
}