{
  "imdb_id": "tt2776412",
  "tmdb_id": "214845",
  "douban_id": null,
  "title": "Grean Fictions (2013)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "Thailand",
  "version": [
    {
      "runtime": "118 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm1840848",
      "name": "Chookiat Sakveerakul"
    }
  ],
  "writer": [
    {
      "id": "nm1840848",
      "name": "Chookiat Sakveerakul",
      "description": null
    },
    {
      "id": "nm6480755",
      "name": "Niwaruj Teekaphowan",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm6478239",
      "name": "Pattadon Jan-Ngern",
      "character": "Tee"
    },
    {
      "id": "nm6478240",
      "name": "Kritsanapoom Pibulsonggram",
      "character": "Oat"
    },
    {
      "id": "nm6478241",
      "name": "Purim Rattanaruangwattana",
      "character": "Mawn"
    },
    {
      "id": "nm5022535",
      "name": "Kittisak Patomburana",
      "character": "Mone"
    },
    {
      "id": "nm6478242",
      "name": "Laknara Piatha",
      "character": "Ploydao"
    },
    {
      "id": "nm2102650",
      "name": "Bawriboon Chanreuang",
      "character": "Aajaan Senh"
    },
    {
      "id": "nm2296432",
      "name": "Wanida Termthanaporn",
      "character": "Thip"
    },
    {
      "id": "nm5008332",
      "name": "Nitit Warayanon",
      "character": "Kett"
    }
  ],
  "overview": "A group of high-school boys in Chiang Mai enjoy the finals years of their adolescent lives and try to negotiate the unpredictable path of growing up. The story centers on Tee, a sensitive boy who lives with his wayward and lovesick sister. After a domestic complication, Tee runs away from the northern city and ends up in Pattaya. As his friends and teachers try to bring him back for the final exam, Tee learns his life lessons the unusual way.",
  "storyline": null,
  "plot": "The film opens with Tee narrating, speaking to his friends about the YouTube videos that they enjoy making under the moniker \"Grean Fictions\" and have become popular at school. He then tells that he is writing a story for a film, which is the story of his and his friends' school lives.\n\nAt school in Chiang Mai, in their matthayom&#160;4 (grade&#160;10) year, Tee and his friends Oat, Mon and Mone are asked to participate in the school drama club's play. Tee ends up playing the male leading role opposite Ploydao, the most popular girl in their year. However, Tee accidentally embarrasses her in front of the audience, disrupting the play and straining their relationship. Tee tries to come to terms with Ploydao, but is hindered when the club advisor teacher Daengtoi expels him from the club. Meanwhile, Tee finds out his elder sister Tip, whom he lives with, is dating a man named Ket, and isn't happy about it.\n\nIn their matthayom&#160;5 year, Tee and his friends have transferred to the film club (under advisor teacher Saneh). They win a prize for a short film they made, but Ploydao is still struggling to get over her embarrassment from the previous year. A senior schoolmate from the drama club then asks Tee to join another play, without Ploydao's knowledge, in order to help her overcome the experience. However, on the day of the play, Tip has a mental breakdown and harms herself, forcing Tee to leave the play and rush home. Ket arrives to aid Tip before Tee does, though, and Oat takes Tee's place in the play.\n\nIn their final school year, Saneh replaces Daengtoi as drama club advisor and assigns a joint project for the drama and film clubs. During a filming trip, the students engage in a question game (a Truth or Dare variant). While Tee refuses to admit he has a crush on her, Ploydao reveals that she and Oat have been secretly dating. Feeling betrayed, Tee leaves in the middle of the night. When a friend visits Tee's house to ask him to return, Tip walks in on them and gets in an argument with Tee. Losing her temper, Tip yells at him to leave the house.\n\nTee leaves, but instead of joining his friends, catches a train and ends up in Pattaya. His phone and money stolen, he befriends a stripper named Mone. They soon end up joining a local comedy act. Tee begins to feel accepted in Pattaya, and for several weeks made no attempt to contact his friends at home. He eventually uploads a video to their old YouTube channel, telling his friends not to worry about him. However, they find out from the video where he is. After failing to get Ket and Tip's help and arguing about whether they should be preparing for university examinations, Tee's friends decide to drive to Pattaya in search for him. Ket also separately convinces Tip to make the trip.\n\nIn Pattaya, Mone, who had previously been in trouble with a gangster, abruptly leaves, taking Tee's money. Tee is upset, but the group leader tells him to accept that life happens, and that people will always have to part. That evening Tip and Ket find Tee, and Tip apologises, asking him to come home. Tee asks Ket to marry Tip right away, saying that Tip fears rejection too much to ask herself. Ket agrees, but then leaves at the last minute.\n\nTee and Tip head home by train the next morning. During the trip, they discuss their lives, and it is revealed that Tip is actually Tee's mother. Ket calls tip to apologise, and she meets him at Lampang Station. Tee then calls his friends, who are currently lost in Pranburi, hundreds of kilometres from Pattaya, and they say they will come to pick him up. The film ends with Tee narrating that while the future is still unknown, the story he writes will reflect the best of their hopes and wishes.",
  "synopsis": null
}