{
  "imdb_id": "tt2752772",
  "tmdb_id": "283445",
  "douban_id": null,
  "title": "Sinister 2 (2015)",
  "genres": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.3,
  "director": [
    {
      "id": "nm1164602",
      "name": "Ciarán Foy"
    }
  ],
  "writer": [
    {
      "id": "nm0220600",
      "name": "Scott Derrickson",
      "description": "written by &"
    },
    {
      "id": "nm1803036",
      "name": "C. Robert Cargill",
      "description": "written by"
    },
    {
      "id": "nm0220600",
      "name": "Scott Derrickson",
      "description": "based on characters created by &"
    },
    {
      "id": "nm1803036",
      "name": "C. Robert Cargill",
      "description": "based on characters created by"
    }
  ],
  "cast": [
    {
      "id": "nm0710447",
      "name": "James Ransone",
      "character": "Ex-Deputy So & So"
    },
    {
      "id": "nm0815370",
      "name": "Shannyn Sossamon",
      "character": "Courtney Collins"
    },
    {
      "id": "nm3625321",
      "name": "Robert Daniel Sloan",
      "character": "Dylan Collins       (as Robert Sloan)"
    },
    {
      "id": "nm4524493",
      "name": "Dartanian Sloan",
      "character": "Zach Collins"
    },
    {
      "id": "nm0168398",
      "name": "Lea Coco",
      "character": "Clint Collins"
    },
    {
      "id": "nm1693588",
      "name": "Tate Ellington",
      "character": "Dr. Stomberg"
    },
    {
      "id": "nm0064040",
      "name": "John Beasley",
      "character": "Father Rodriguez"
    },
    {
      "id": "nm6722749",
      "name": "Lucas Jade Zumann",
      "character": "Milo"
    },
    {
      "id": "nm5106276",
      "name": "Jaden Klein",
      "character": "Ted"
    },
    {
      "id": "nm6722750",
      "name": "Laila Haley",
      "character": "Emma"
    },
    {
      "id": "nm6723013",
      "name": "Caden Marshall Fritz",
      "character": "Peter"
    },
    {
      "id": "nm6715611",
      "name": "Olivia Rainey",
      "character": "Catherine"
    },
    {
      "id": "nm1056509",
      "name": "Nicholas King",
      "character": "Bughuul       (as Nick King)"
    },
    {
      "id": "nm4556790",
      "name": "Michael B. Woods",
      "character": "The Creeper       (as Michael Woods)"
    },
    {
      "id": "nm2862191",
      "name": "Tory O. Davis",
      "character": "Security Guard"
    },
    {
      "id": "nm2042790",
      "name": "Howie Johnson",
      "character": "State Trooper Shermer"
    },
    {
      "id": "nm7479970",
      "name": "Grace Holuby",
      "character": "Stomberg's Daughter"
    },
    {
      "id": "nm2003951",
      "name": "John Francis Mountain",
      "character": "Christmas Father       (as John Mountain)"
    },
    {
      "id": "nm6824567",
      "name": "Nicole Santini",
      "character": "Christmas Mother"
    },
    {
      "id": "nm2006390",
      "name": "Stephen Varga",
      "character": "Christmas Son"
    },
    {
      "id": "nm6806812",
      "name": "Skylar McClure",
      "character": "Christmas Daughter"
    },
    {
      "id": "nm0000160",
      "name": "Ethan Hawke",
      "character": "Ellison Oswalt       (credit only)"
    },
    {
      "id": "nm1628115",
      "name": "Juliet Rylance",
      "character": "Tracy Oswalt       (credit only)"
    },
    {
      "id": "nm2579443",
      "name": "Michael Hall D'Addario",
      "character": "Trevor       (credit only)"
    },
    {
      "id": "nm2740002",
      "name": "Clare Foley",
      "character": "Ashley       (as Claire Foley) (credit only)"
    },
    {
      "id": "nm4676368",
      "name": "Victoria Leigh",
      "character": "Stephanie       (as Victoria Leigh Morales) (credit only)"
    }
  ],
  "overview": "A young mother and her twin sons move into a rural house that's marked for death.",
  "storyline": "Following the events from the first film, a different family; a mother and her 2 sons move into a rural house that's marked for death. When the deputy from the first film learns that this family is next in line to fall to the demon Bhughul, he races before time to stop it and save them from the same fate.",
  "plot": "The film opens in an identical style to the first movie: a snuff movie depicting a family being hung up like scarecrows in a corn field with sacks over their heads and burned alive when a lighter is thrown into a trail of petrol. It is revealed to be the nightmare of nine-year-old Dylan Collins, who is staying in a rural farmhouse next to a deconsecrated Lutheran church, with his twin brother Zach, and their mother Courtney (Shannyn Sossamon). He hears rustling in the open wardrobe and a spooky face appears. A ghost bearing a likeness to his twin brother appears.\n\nThe Deputy from the first film goes to Confession. He is independently researching the murders connected to Bughuul, and is burning down the homes where each murder took place before another family can move into them to prevent more murders, this included the house where Oswalt and his family was murdered in the first film. The priest recognises him from \"the Oswalt thing.\" Deputy explains he found something otherworldly and asks the priest for help, who tells him to stay out of it instead.\n\nCourtney works in the church, restoring antiques. Whilst shopping (and her sons are playing with toy guns), a man with sunken eyes seems to stare at Courtney and appears to follow her around the shop. She tells the boys to run (using Rutabaga as a safe word) and the man chases her as she leaves the shop, knocking over a stand. Courtney orders a security guard to stop him. As they drive away, the man is seen on a phone, saying \"That's her.\" to an unknown person, most likely Clint, Courtney's abusive ex husband who is also the father of her children.\n\nDylan is visited nightly by a group of ghostly children, led by a boy named Milo, who force him to watch \"home movies\" of families being murdered in various savage ways; eaten alive by alligators while being hung upside-down above a river (\"Fishing Trip\"), electrocuted in a puddle of water on a kitchen floor (\"Kitchen Remodel\"), buried alive in the snow on Christmas Day (\"Christmas Morning\") and strapped to chairs with their mouths forced open and having their teeth mutilated with drills (\"Dentist Appointment\").\n\nThe Deputy arrives at a farmhouse to destroy it, but is interrupted when he realizes Courtney and her sons are living there. Courtney tells him to leave because she thinks he is working with Clint. He convinces her otherwise and tells Courtney he is a private investigator, and she allows him to investigate the deconsecrated church on the property where a gruesome murder took place. She doesn't realize it, but her sons know what happened at the church.\n\nThe Deputy is then seen in a hotel room reading newspaper articles on a computer, when he stumbles across one which shows Courtney and Clint on their wedding day. Suddenly, articles about the murder in the church flood the screen, before Bughuul's symbol and a loud buzzing appear and the screen cuts out. When he leans down to collect his bag, the reflection of the screen shows Bughuul standing in the bathroom doorway behind the Deputy. When the Deputy sees it and looks behind him, there is nothing there. Bughuul then appears in the reflection again, before walking forward and putting his finger to his lips. The Deputy slams the laptop screen closed.\n\nClint shows up at the farmhouse with police to try and take the boys but leaves after the Deputy threatens them, warning them that they need a court order to proceed. In this scene, it is also revealed that he was arrested after releasing classified information (the names and addresses of the murders he gave to Ellison Oswalt in the first film.)\n\nCourtney wants to leave with the boys but the Deputy advises Courtney not to leave the farmhouse, knowing that each of the murders connected to Bughuul occurred only after the families had fled the homes where the previous murders had occurred. Courtney invites him to stay at the farmhouse on the condition that he doesn't tell anyone where they are, and the two develop a budding romance, talking outside the house while sitting on the swings, and passionately kissing once they return inside.\n\nDeputy meets with a professor who has come into possession of a ham radio that belonged to Professor Jonas from the previous film, who was in contact with Ellison Oswalt and has mysteriously disappeared. The professor said the ham radio first belonged to a Norwegian family who was mysteriously murdered in 1973. The professor plays a recording from the Norwegian family, and after reading out the coordinates of the house, the young girl's voice on the tape screams \"Bughuul can't hear me over your yelling, Mom!\" in Norwegian.\n\nDeputy deduces that Bughuul exclusively targets the children of the murdered families, and suddenly, the ham radio bursts to life with a loud buzz, repeating what the Deputy just said over and over again: \"It's the kids. He gets the kids.\" before suddenly cutting out. Deputy then orders the professor to destroy the ham radio.\n\nZach becomes jealous of the ghostly children who visit Dylan, and insists on having their attention. They show Dylan the video of the murders which took place in the same Lutheran church on their property: a family is nailed to the floor with bowls placed on their chests, encasing a live rat. When hot coals from a stove are placed on the bowls, the rats burrow through their abdomens to escape the heat, causing them to bleed to death (\"Sunday Service\"). After Dylan refuses to watch the last movie, the children turn their attention to Zach and abandon Dylan.\n\nClint arrives with the court ordered custody warrants he didn't have before and Courtney is forced to leave with Zach and Dylan. After finding the farmhouse empty, the Deputy drives to Clint's home to warn them about the danger, but Clint assaults him and threatens him with a gun, telling him if he ever comes back he will shoot. The next day, Zach, as directed by the ghost children, films Dylan learning how to play golf with Clint and Courtney. After realising he and his family have been poisoned, Dylan contacts the Deputy for help. The Deputy immediately leaves his house, and upon arriving at the family home, he sees fire and smoke in the distance. He drives into the cornfield.\n\nCourtney, Dylan, and Clint are drugged and hung on scarecrow posts with sacks over their heads in the cornfield. A possessed Zach lights Clint on fire first and films him as he burns to death. Just as Zach is about to light Courtney on fire, the Deputy arrives and hits Zach with his car. He frees Courtney and Dylan and they flee into the cornfield. However, Zach has survived being hit (thanks to demonic possession) and pursues them through the cornfield with the camera and cuts half the Deputy's fingers off with a swing of a sickle.\n\nInside the home, the ghost kids try to help Zach find Courtney and Dylan, tearing the house apart and knocking out the Deputy in the process. Just as Zach is about to kill Courtney and Dylan, the Deputy finally manages to break the camera by hitting it with a golf club, thwarting Zach's home movie and breaking the cycle. After a desperate Zach tries to search for another camera, he is shamed and disgraced by the ghost kids for failing to kill his family and is carried into Bughuul's realm, his face melting into a skull. The house then catches fire as the Deputy, Courtney, and Dylan escape. Courtney is left distraught.\n\nLater, when the Deputy is in his motel room packing his things, he turns and sees the ham radio. Children's voices are heard saying \"It's the kids, he gets the kids!\". As a young girl's voice whispers \"Deputy\", Bughuul appears and the scene cuts to black.",
  "synopsis": "Sinister 2, instead of using super 8 film the way the first Sinister movie did, uses other found footage mediums such as vinyl records, a ham radio and 16mm film. The film begins with a 16mm home movie of three people tied to crosses in a rural cornfield. One of the crosses suddenly catches fire, killing the person tied down to it.Deputy So & So from the first Sinister film visits a Catholic confession booth, and it is revealed to the audience that he is no longer a deputy because of his involvement with the Oswalt case. He is now a private investigator, and he spends his free time burning down the houses which he thinks that Bughuul visited. Meanwhile Courtney, a mother of two twin boys (Dylan and Zach), is shopping at the supermarket when suddenly a pervert begins following her, hired by her abusive ex-husband to locate his family. The pervert almost catches her, but she escapes with her sons and he is stopped by a security guard. She drives out to a decaying farmhouse where she and her sons have been in hiding for some time. Dylan has been having nightmares, and to stop them, his not-so-imaginary friend Milo (one of Bughuul's victims), shows him a number of 16mm snuff reels depicting families being murdered in various ways. One film shows a family eaten by alligators (Fishing Trip), one shows a family frozen to death in the snow (Christmas Morning), one shows a family being electrocuted violently (Kitchen Remodeling) and one shows a family being disemboweled by rats in a church (Sunday School). Zach becomes increasingly violent, calling his mom and brother nasty names, beating up his brother cruelly and displaying behavior akin to his abusive dad.Deputy comes to the house to burn it down, assuming that it is empty, but he's stopped by Courtney who threatens him and tries to chase him away. When she realizes that it's all a big misunderstanding, she invites him in for coffee. He explains that ever since his best friend Ellison Oswalt, was murdered, that he's been investigating similar cold cases. Courtney allows him to investigate the nearby church, where the rat murder happened, and while investigating, Deputy witnesses a number of odd and frightening paranormal things. Clint shows up without warning, along with a team of cops, demanding that the boys come out to see him, but Deputy chases them away, with the threat of telling the media about Clint's abuse. It is also revealed that Deputy was nearly arrested for the Oswalt family's murder but that the charges were dropped. Courtney invites him for supper and sees how nice he is to her and the boys, so she lets him spend the night on the living room couch before driving back to his motel. He wakes up in the night and goes over some crime scene photos, and Courtney comes downstairs. They start drinking out on the porch and she tells him about Clint. Deputy tells her that her abused son reminds him of himself when he was a kid (implying that he was abused by his own father in the past). He also tells her about his motives for obsessing with the Oswalt murders. Courtney tells him that she wishes he was the boys' father, and when they go back inside, they kiss briefly.The next morning, Deputy drives away to visit Dr. Stromberg, who reveals that Professor Jonas (from the first Sinister film) has gone missing, and that he discovered a disturbing recording on a HAM radio of a child speaking in Norwegian and then killing their family. The words translate back to \"I can't hear Bughuul over your yelling, mom!\" in English. The deputy requests that the radio be destroyed and it's revealed that Bughuul travels through art (books, film, music, drawings).At the same time, Courtney and her sons are taken from the house by Clint, and Zach watches the last film, Dental Work (a man having all his teeth pulled without anesthesia). Deputy shows up to rescue them, but Clint beats him up and threatens to murder him, so he leaves, and Clint starts the abuse all over again. The next day, Dylan texts Deputy with the words \"Help us!\" Zach becomes possessed and starts filming his family with the 16mm camera, drugging them, tying them to crosses and then lighting one cross on fire, with Clint on it. Clint is killed and he twitches violently in the flames, but before Zach can finish off his family, Deputy knocks him down with his car and unties Courtney and Dylan. Zach picks up the camera and a scythe and starts chasing them all through the cornfield, partially cutting off Deputy's hand, but they all make it back to the farmhouse. Zach searches for his family but Deputy hides them both, and Milo and the other dead children begin destroying the house room by room. They crush Deputy behind a desk and hit him with golf clubs, but before Zach can finish off Courtney and Dylan, Deputy smashes the camera, exposing the film to the light and destroying it instantly. Zach screams \"NO!\" repeatedly and runs to the basement, only to be cornered by the dead kids, who all worriedly tell him that Bughuul will get rid of their souls now. They disappear and Bughuul touches Zach's shoulder, turning him into ashes and killing him.Deputy, Courtney and Dylan drive away, back to Deputy's motel, but when he goes inside, he finds the HAM radio sitting on the nightstand. The voices of dead kids start drifting from the speakers, chanting \"It's the kids! It's the kids! It's the kids! ...DEPUTY!!!\" Bughuul's face suddenly pops up and it's implied that Deputy is killed."
}