{
  "imdb_id": "tt2786278",
  "tmdb_id": "180048",
  "douban_id": null,
  "title": "Amen (2013)",
  "genres": [
    "Drama",
    "Musical",
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "165 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.8,
  "director": [
    {
      "id": "nm3859342",
      "name": "Lijo Jose Pellissery"
    }
  ],
  "writer": [
    {
      "id": "nm5612167",
      "name": "P.S. Rafeeque",
      "description": "writer"
    },
    {
      "id": "nm5612167",
      "name": "P.S. Rafeeque",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1335704",
      "name": "Fahadh Faasil",
      "character": "Solomon"
    },
    {
      "id": "nm1011348",
      "name": "Indrajith Sukumaran",
      "character": "Fr Vincent Vattoli       (as Indrajith)"
    },
    {
      "id": "nm0542343",
      "name": "Kalabhavan Mani",
      "character": "Louie Paappan"
    },
    {
      "id": "nm3763970",
      "name": "Swathi Reddy",
      "character": "Sosanna"
    },
    {
      "id": "nm5577715",
      "name": "Rachana Narayanankutty",
      "character": "Clara"
    },
    {
      "id": "nm0558593",
      "name": "Joy Mathew",
      "character": "Fr Ottapplakkan"
    },
    {
      "id": "nm5578638",
      "name": "Sandra Thomas",
      "character": "Mariyamma"
    },
    {
      "id": "nm4584689",
      "name": "Sunil Sukhada",
      "character": "Ousepp       (as Suni Thrissur)"
    },
    {
      "id": "nm0221218",
      "name": "Makrand Deshpande",
      "character": "Chevalier Pothachan"
    },
    {
      "id": "nm4051131",
      "name": "Sasi Kalinga",
      "character": "Chachappan"
    },
    {
      "id": "nm8344748",
      "name": "Gokulan",
      "character": "Coconut Tree Climber"
    },
    {
      "id": "nm3438796",
      "name": "Rajesh Hebbar",
      "character": "Esthappan Aashan"
    },
    {
      "id": "nm7898733",
      "name": "Jayashankar",
      "character": "Pappi"
    },
    {
      "id": "nm5584853",
      "name": "Chemban Vinod Jose",
      "character": "Pailakkutty       (as Vinod Chemban)"
    },
    {
      "id": "nm3397660",
      "name": "Sudheer Karamana",
      "character": "Mathachan"
    },
    {
      "id": "nm6845864",
      "name": "Pradeep Kottayam",
      "character": "Police Officer"
    },
    {
      "id": "nm1728630",
      "name": "Kulappulli Leela",
      "character": "Therutha"
    },
    {
      "id": "nm1517903",
      "name": "Anil Murali",
      "character": "Davis"
    },
    {
      "id": "nm1459609",
      "name": "Nandu",
      "character": "Philipose"
    },
    {
      "id": "nm0149937",
      "name": "Chali Pala",
      "character": "Mathayi"
    },
    {
      "id": "nm5269807",
      "name": "S. Prabhakaran",
      "character": "Soshamma"
    },
    {
      "id": "nm6031807",
      "name": "Andrea Marian Renji",
      "character": "Angel"
    },
    {
      "id": "nm5241801",
      "name": "Natasha Sahgal",
      "character": "Michelle"
    },
    {
      "id": "nm4191651",
      "name": "Nisha Sarangh",
      "character": "Mathachan's Wife"
    },
    {
      "id": "nm5593270",
      "name": "Kainakary Thankaraj",
      "character": "Chali"
    }
  ],
  "overview": "Solomon, who belongs to a band, is in love with Soshanna, who hails from an upper class family. The story spells how Solomon manages to win over all the obstacles to marry Soshanna.",
  "storyline": "Amen tells the story of people around an ancient Nasrani Church. The plot is set in a village, Kumarankary, where its inhabitants are always garbed in white - a motif which the film deftly employs to meld the elements of fantasy and spirituality. A young, handsome cleric (Indrajith Sukumaran) arrives as the Kathanar (Syrian priest) of the church, whose senior Kathanar is Fr. Abraham (Joy Mathew), a grumpy fellow. The village has a mix of issues, which range from the love between Solomon (Fahadh Faasil) and Sosanna (Swati Reddy) to the fate of a band crushed by frequent failures in contests. The movie sets itself a lot of targets like the fate of Solomon's love, his dazzling self-discovery of a trait not known to him before and some sober spiritual and religious conflicts. Amen promises a luxuriant plot replete with music, faith, fantasy and romance and an amazingly varied set of characters. As the parish seriously discusses whether to retain the church's band that had lost to the ...",
  "plot": "The plot revolves around the lives of a few people around an ancient Syrian church in a Kuttanadan village called Kumarankari. Solomon (Fahadh Faasil) is in love with Shoshanna (Swathi Reddy) who is the daughter of a wealthy contractor. Solomon is the son of a band master who died after a show by drowning. Solomon is a failed band member however he is the son of the famous Estapan ashan, who was renowned in Kerala for his clarinet playing abilities. Fr. Vincent Vattoli (Indrajith) comes to the church as a new recruit to the parish. He learns about the relationship and tries to unite the couple. At this time, the marriage of Shoshanna gets fixed. Solomon attempts to elope, in vain. They are caught by Shoshana's parents and Solomon is mercilessly beaten up. The people of Kumanamkari and the neighboring town then place a bet in which the St. George's band has to win in order for Solomon's marriage to occur. It was said that Shoshanna would be married to Solomon if they win the competition with Solomon leading the band. The band takes intense practices and wins the bet. Solomon gets married to Shoshanna while Solomon's band master dies. At that night Shosana's father backs out of the bet. Him, the evil old parish priest and Solomons uncle are haunted at night by St. George at the time when they were destroying the church. They all came to the realisation that Solomon had divine powers on his side and they stood aside from Solomon's life as obstacles. The next day a call comes to the church informing that the new Priest Fr. Vincent Vattoli is taking charge. The Kumarangiri folks now come to know that Fr. Vincent Vattoli was actually the saint himself who appeared in front of them.",
  "synopsis": null
}