{
  "imdb_id": "tt2718442",
  "tmdb_id": "294483",
  "douban_id": null,
  "title": "The King's Surrender (2014)",
  "genres": [
    "Thriller"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "107 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm2854035",
      "name": "Philipp Leinemann"
    }
  ],
  "writer": [
    {
      "id": "nm2854035",
      "name": "Philipp Leinemann",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1665537",
      "name": "Ronald Zehrfeld",
      "character": "Kevin"
    },
    {
      "id": "nm0559052",
      "name": "Misel Maticevic",
      "character": "Mendes"
    },
    {
      "id": "nm0857998",
      "name": "Thomas Thieme",
      "character": "Harthmann"
    },
    {
      "id": "nm0778353",
      "name": "Bernhard Schütz",
      "character": "Willmund"
    },
    {
      "id": "nm0244456",
      "name": "Hendrik Duryn",
      "character": "Brandes"
    },
    {
      "id": "nm5110219",
      "name": "Tilman Strauss",
      "character": "Thorsten"
    },
    {
      "id": "nm1035643",
      "name": "Frederick Lau",
      "character": "Jacek"
    },
    {
      "id": "nm5548152",
      "name": "Marcel Bender",
      "character": "Klaus"
    },
    {
      "id": "nm5548144",
      "name": "Maximilian Brauer",
      "character": "Carsten"
    },
    {
      "id": "nm3119680",
      "name": "Samia Muriel Chancrin",
      "character": "Nadine"
    },
    {
      "id": "nm5548129",
      "name": "Felix Defér",
      "character": "Marco"
    },
    {
      "id": "nm2146564",
      "name": "Godehard Giese",
      "character": "Volker"
    },
    {
      "id": "nm1348028",
      "name": "Felix Goeser",
      "character": "Boris"
    },
    {
      "id": "nm5548102",
      "name": "Pablo Guaneme Pinilla",
      "character": "Azdim"
    },
    {
      "id": "nm2515050",
      "name": "Katharina Heyer",
      "character": "Sandra"
    },
    {
      "id": "nm5548097",
      "name": "André Hinderlich",
      "character": "Pohl"
    },
    {
      "id": "nm3635471",
      "name": "Hassan Issa",
      "character": "Mahir"
    },
    {
      "id": "nm4879352",
      "name": "Khader Issa",
      "character": "Hussein"
    },
    {
      "id": "nm5548107",
      "name": "Mohamed Issa",
      "character": "Nasim       (as Mohammed Issa)"
    },
    {
      "id": "nm3660532",
      "name": "Michael Klammer",
      "character": "Sille"
    },
    {
      "id": "nm5439194",
      "name": "Oliver Konietzny",
      "character": "Ioannis"
    },
    {
      "id": "nm3093370",
      "name": "Ferdinand Lehmann",
      "character": "Pedde"
    },
    {
      "id": "nm0006618",
      "name": "Torben Liebrecht",
      "character": "Lennard"
    },
    {
      "id": "nm0714455",
      "name": "Urs Rechn",
      "character": "Jenne"
    },
    {
      "id": "nm10763707",
      "name": "Wilhelm J. Reitzenstein",
      "character": "LKA Ermittler Ronny Hoffmann"
    },
    {
      "id": "nm1759484",
      "name": "Jorres Risse",
      "character": "David"
    },
    {
      "id": "nm5006417",
      "name": "Adrian Saidi",
      "character": "Hakan"
    },
    {
      "id": "nm4535228",
      "name": "Christian Sonnberger",
      "character": "Öskan"
    },
    {
      "id": "nm1102354",
      "name": "Simon Werner",
      "character": "Markus"
    },
    {
      "id": "nm5548229",
      "name": "Frowin Wolter",
      "character": "Traute"
    },
    {
      "id": "nm4920137",
      "name": "Patrick Wudtke",
      "character": "Sven"
    },
    {
      "id": "nm0946947",
      "name": "Ramin Yazdani",
      "character": "Nasims Vater"
    }
  ],
  "overview": "Violent youth gangs and a police force way out of its depth. When a police operation goes awry and two policemen die, the powder keg threatens to ignite as the SWAT team knows only one goal: revenge - irrespective of the law.",
  "storyline": "Violent youth gangs and a police force way out of its depth. When a police operation goes awry and two policemen die, the powder keg threatens to ignite as the SWAT team knows only one goal: revenge - irrespective of the law.",
  "plot": "In 1930s England, a bloody civil war ends with the Lancastrian King Henry VI and his son Prince Edward murdered by Richard, Duke of Gloucester of the rival House of York. Richard's elder brother Edward, Duke of York becomes King Edward IV, while the Lancastrian heir, Henry Tudor, Earl of Richmond, is exiled in France.\n\nHungry for power, Richard is determined to make himself King, and pits King Edward against his brother, the Duke of Clarence, who is imprisoned in the Tower of London. Meanwhile, Richard deceives and marries Prince Edward's widow Lady Anne Neville.\n\nQueen Elizabeth intercedes on Clarence's behalf and Edward IV spares his life. However, after sowing doubt and casting suspicion on the Queen and her brother Lord Rivers, Richard commissions James Tyrrell to execute Clarence, allegedly in compliance with the King's death warrant, under the pretext that the king's stay of execution was delivered too late.\n\nRichard informs Edward of Clarence's death at a meeting with Prime Minister Lord Hastings, and the King dies from a stroke. As Edward's sons are underage, Richard becomes Regent, taking the title of Lord Protector with the support of the ambitious and corrupt Duke of Buckingham.\n\nIn order to undermine his rivals for the throne, Richard has Rivers assassinated and uses his sordid death to damage the Queen's reputation while simultaneously casting doubt on the legitimacy of her sons. Reluctant to support Richard's claim to the crown, Hastings' opposition so enrages Richard that he accuses Hastings of treason, inciting his loyalists to summarily execute him by hanging. Having made an example of his only vocal opponent, Richard persuades the Lord Mayor of London and members of the House of Lords to acknowledge his claim and crown him King.\n\nFollowing his coronation Richard, now King Richard III, seeks to make his throne secure. He employs Tyrrell to murder the princes, after failing to convince Buckingham to do so. Aware that his rival claimant the Earl of Richmond intends to marry his niece Elizabeth, he instructs Sir William Catesby to spread rumours that Lady Anne is ill, intending to marry Elizabeth himself. Lady Anne is found dead sometime later from a drug overdose.\n\nImpatient for the promised reward for his loyalty, Buckingham demands the lands of the murdered Lord Rivers. Richard dismisses this in a high-handed manner, with the line \"I am not in a giving vein\". Buckingham, also disturbed by the murders of the princes and Hastings, flees to meet Richmond, but is later captured and executed by Tyrrell under Richard's orders.\n\nMeanwhile, the Earl of Richmond gathers supporters, among them the Archbishop of Canterbury and Richard's mother, the Duchess of York. They are joined by Air Force commander Lord Stanley, the only character among Richard's confidantes who resists donning the Lord Protector's fascist uniform. Richmond marries Elizabeth and unites both Houses.\n\nWith his hold on power slipping and the legitimacy of his claims to the crown weakened, Richard prepares for the final battle against the rebels, who plan a seaborne invasion and an advance on the capital. Richard's troops, assembling in a marshalling yard, are attacked from the air, revealing Lord Stanley's involvement in the rebel cause.\n\nThe two armies meet soon after at a ruined Battersea Power Station. Richard and Richmond seek each other out, but when his vehicle stalls Richard flees into the structure. Pursued by Richmond, Richard is forced to exit on to exposed metal beams, high above the burning battlefield. Cornered by Richmond and refusing to surrender, Richard falls into the fiery inferno with a triumphant grin.",
  "synopsis": null
}