{
  "imdb_id": "tt2749114",
  "tmdb_id": "287937",
  "douban_id": null,
  "title": "The Cuckoo in the Clock (2014)",
  "genres": [
    "Drama",
    "Horror",
    "Thriller"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "71 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm3531377",
      "name": "Paul Andrew Kimball"
    }
  ],
  "writer": [
    {
      "id": "nm3831909",
      "name": "Walter Bosley",
      "description": "original idea"
    },
    {
      "id": "nm3531377",
      "name": "Paul Andrew Kimball",
      "description": "writer as Paul Kimball"
    },
    {
      "id": "nm5554348",
      "name": "Michael Williamson",
      "description": "original idea"
    }
  ],
  "cast": [
    {
      "id": "nm4877183",
      "name": "Jacob James",
      "character": "Nick"
    },
    {
      "id": "nm4430410",
      "name": "Nicole Steeves",
      "character": "Lara"
    },
    {
      "id": "nm4754493",
      "name": "Brittney Jean Blake",
      "character": "Eve"
    }
  ],
  "overview": "Two desparate lovers, Eve and Lara, are on the run from the Mob and flee the city. They eventually take refuge in what appears to be an abandoned rural home. They soon discover that they’re not alone when they encounter Nick, the handsome and charming caretaker who offers them sanctuary. The situation quickly descends into a dangerous three-way dance of temptation and jealousy, until a terrifying secret is revealed that threatens to destroy Eve and Lara unless they can find a way to escape the hell that they have created for themselves.",
  "storyline": "Eve and Lara are two desperate lovers from Bangor, Maine, who are on the run after Lara killed Eve's abusive, drug-dealing boyfriend and stole his money. They eventually take refuge in what appears to be an abandoned home deep in the woods south of the city. They soon encounter Nick, the handsome and charming caretaker who offers them sanctuary. The situation quickly descends, however, into a dangerous three-way dance of temptation and jealousy until a terrifying secret is revealed that threatens to destroy Lara and Eve unless they can find a way to escape the hell that they have created for themselves.",
  "plot": null,
  "synopsis": "Eve and Lara are two desperate lovers from Bangor, Maine, who are on the run after Lara killed Eves abusive, drug-dealing boyfriend and stole his money. They eventually take refuge in what appears to be an abandoned home deep in the woods south of the city. They soon encounter Nick, the handsome and charming caretaker who offers them sanctuary. The situation quickly descends, however, into a dangerous three-way dance of temptation and jealousy until a terrifying secret is revealed that threatens to destroy Lara and Eve unless they can find a way to escape the hell that they have created for themselves."
}