{
  "imdb_id": "tt2717558",
  "tmdb_id": "190754",
  "douban_id": null,
  "title": "On the Job (2013)",
  "genres": [
    "Action",
    "Crime",
    "Drama",
    "Thriller"
  ],
  "country": "Philippines",
  "version": [
    {
      "runtime": "118 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.0,
  "director": [
    {
      "id": "nm0560277",
      "name": "Erik Matti"
    }
  ],
  "writer": [
    {
      "id": "nm0560277",
      "name": "Erik Matti",
      "description": null
    },
    {
      "id": "nm1340266",
      "name": "Michiko Yamamoto",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0664469",
      "name": "Piolo Pascual",
      "character": "Francis Coronel, Jr."
    },
    {
      "id": "nm2375377",
      "name": "Gerald Anderson",
      "character": "Daniel"
    },
    {
      "id": "nm0868381",
      "name": "Joel Torre",
      "character": "Tatang /              Mario Maghari"
    },
    {
      "id": "nm1285140",
      "name": "Joey Marquez",
      "character": "SPO1 Joaquin Acosta"
    },
    {
      "id": "nm0210295",
      "name": "Michael De Mesa",
      "character": "Congressman Manrique"
    },
    {
      "id": "nm0553604",
      "name": "Leo Martinez",
      "character": "General Pacheco"
    },
    {
      "id": "nm0032629",
      "name": "Angel Aquino",
      "character": "Lulette"
    },
    {
      "id": "nm0892480",
      "name": "Vivian Velez",
      "character": "Thelma"
    },
    {
      "id": "nm1283688",
      "name": "Shaina Magdayao",
      "character": "Nicky"
    },
    {
      "id": "nm0553747",
      "name": "William Martinez",
      "character": "Rex"
    },
    {
      "id": "nm1492443",
      "name": "Rayver Cruz",
      "character": "Bernabe"
    },
    {
      "id": "nm1315788",
      "name": "Empress Schuck",
      "character": "Tina"
    },
    {
      "id": "nm5105502",
      "name": "Dawn Jimenez",
      "character": "Diane"
    },
    {
      "id": "nm1169342",
      "name": "Lito Pimentel",
      "character": "Pol"
    },
    {
      "id": "nm1311959",
      "name": "Michael Flores",
      "character": "Freddie"
    },
    {
      "id": "nm1086695",
      "name": "Al Tantay",
      "character": "Chief of Police"
    },
    {
      "id": "nm0611644",
      "name": "Niño Muhlach",
      "character": "Ramon"
    },
    {
      "id": "nm1238309",
      "name": "Baldo Marro",
      "character": "Warden Esteban       (as Baldo Maro)"
    },
    {
      "id": "nm2807747",
      "name": "Joseph Marco",
      "character": "Ruel"
    },
    {
      "id": "nm0174566",
      "name": "Mon Confiado",
      "character": "Boy"
    },
    {
      "id": "nm6313929",
      "name": "Mark Andaya",
      "character": "Simeon"
    },
    {
      "id": "nm1257221",
      "name": "Jayvee Gayoso",
      "character": "NBI Chief"
    },
    {
      "id": "nm1996135",
      "name": "Irene Celebre",
      "character": "Daniel's Mother"
    },
    {
      "id": "nm0145151",
      "name": "Mike Castillo",
      "character": "Badong"
    },
    {
      "id": "nm6313930",
      "name": "Iking Rivera",
      "character": "Rex' Assistant"
    },
    {
      "id": "nm1163193",
      "name": "Japh Bahian",
      "character": "Prison Food Server       (as Jhappy Bahian)"
    },
    {
      "id": "nm6313931",
      "name": "Stephen Ku",
      "character": "Johnny Tiu"
    },
    {
      "id": "nm6313932",
      "name": "Joger Go",
      "character": "Charlie Tiu"
    },
    {
      "id": "nm6313933",
      "name": "Cristy Fulgar",
      "character": "Linda Carag"
    },
    {
      "id": "nm0764755",
      "name": "Joel Saracho",
      "character": "Driver"
    },
    {
      "id": "nm6313934",
      "name": "Ronald Santos",
      "character": "Janitor"
    },
    {
      "id": "nm6313935",
      "name": "Marites Guillen",
      "character": "Nurse at Hospital"
    },
    {
      "id": "nm3037207",
      "name": "Glenn Picazo",
      "character": "Gay Prisoner"
    },
    {
      "id": "nm2746349",
      "name": "John Balagot",
      "character": ""
    },
    {
      "id": "nm3477347",
      "name": "JM de Guzman",
      "character": "Boyet"
    },
    {
      "id": "nm0733726",
      "name": "Rosanna Roces",
      "character": ""
    }
  ],
  "overview": "On The Job is about the ambitions and passions of four men trying to make a living, for themselves and their families. It shows the parallels between two prison inmates who are contract killers, and the two agents of the law investigating the murders. As they get caught in a web of machination of corrupt government officials, their jobs lead them on a head-on collision against each other with their loved ones as collateral damage.",
  "storyline": "A gritty crime-thriller about four men struggling to survive and a make living for themselves and their respective loved ones. Two are former prison inmates, hired as contract killers, and the two other are law enforcers and investigators, caught in the loop of corrupt government officials. Mario intends to go straight when he gets parole, and Daniel a younger inmate and Mario's apprentice, is set to replace him as hired killer. Joaquin and Francis are the police officers tangled in a moral conflict. The two groups inevitably collide.",
  "plot": "In the Philippines, corrupt politicians and police cause abundant crime and poverty. Hitmen Mario and Daniel murder a man named Tiu. The two are prisoners who are regularly released from prison to perform hits for their boss Thelma in exchange for money. Mario uses his money to support his daughter's law school tuition and estranged wife Lolet. Daniel, the younger and more reckless partner, sends some of his money home and spends the rest on goods and privileges in prison. Daniel has come to see Mario as a mentor and father figure. After the hit of Tiu, they are sent back to prison. Tiu's murder case is assigned to NBI Agent Coronel through Congressman Manrique, who is Coronel's father-in-law. Coronel's father, also a policeman, died amid rumors of corruption. When Coronel and his partner, Bernabe, arrive at the local precinct, Sgt. Acosta, a 20-year veteran who feels the case was taken from him for political reasons, resists them.\n\nMario and Daniel are released and kill a woman named Linda. Upon hearing of his wife's murder, Linda's husband, Pol, immediately calls Acosta. Acosta reveals that Tiu's murder is just one of several murders ordered by General Pacheco, a high-ranking military officer who is running for the Senate, and a close friend of Manrique's. Pacheco runs a murder-for-hire operation using prisoners, killing anyone else involved to protect his campaign. Acosta agrees to protect Pol and heads to the station. While Coronel and Bernabe confront Acosta, Daniel shoots Pol, but his gun jams before he can deliver the fatal shot. The three officers converge on them, forcing Daniel and Mario to flee. At a hospital, Daniel creates a distraction and allows Mario to kill Pol. The two split up and flee. Coronel and Bernabe chase Daniel, and Acosta goes after Mario. As the two escape, Bernabe is shot and Mario sprains his ankle; Acosta relays Mario's face to the police, which unknowingly stuns Mario's family.\n\nWhen Coronel discovers Mario's identity, he visits Lolet, who is with her lover, Bhoy. Lolet does not talk, but Coronel relays the information about her affair to Acosta, who unsuccessfully attempts to use it as leverage against Mario during an interrogation in jail. Mario feels disillusioned and betrayed by his family's abandonment, and relays this to Daniel.\n\nCoronel confronts Manrique at a Reform Party presentation and explains that he intends to arrest Pacheco, but Manrique warns Coronel that they will both fall with Pacheco, as Manrique was one of Pacheco's clients. Coronel leaves in frustration and decides to continue working with Acosta. Acosta tells Coronel that his father was not corrupt and was killed while trying to expose corruption; Acosta himself was demoted for his part.\n\nCoronel and Acosta discover that Tiu's father can provide them with the evidence they need to arrest Pacheco. On the way, Coronel abandons Acosta to visit Pacheco, who admits that he killed Coronel's father. Coronel is secretly recording this conversation with Pacheco on his cell phone. After recording this conversation, Coronel goes home and informs his wife Nicky on his intention to take down Pacheco, incriminating Manrique in the process. She slaps him repeatedly. Pacheco's men kill Tiu's father.\n\nThe next day, Daniel murders Coronel in front of the police headquarters, although it is unclear why he was targeted. Enraged, Acosta assaults Manrique and Pacheco's security detail, which results in a brief shootout until Pacheco orders them to cease fire. On the day Mario is to be released, he realizes that he has nothing on the outside, as his family no longer wants anything to do with him. In order to stay in jail, he stabs Daniel to death. Coronel's death is mourned by many, including Nicky, and Acosta is discharged and investigated for Coronel's murder. Mario visits his home, kills Bhoy in front of his family, and returns to prison. A recovered Bernabe looks through Coronel's possessions and finds the cell phone that Coronel used to secretly record an incriminating conversation with Manrique and Pacheco. Bernabe requisitions the cell phone as evidence.",
  "synopsis": null
}