{
  "imdb_id": "tt2726552",
  "tmdb_id": "305943",
  "douban_id": null,
  "title": "A Kind of Murder (2016)",
  "genres": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.1,
  "director": [
    {
      "id": "nm0323758",
      "name": "Andy Goddard"
    }
  ],
  "writer": [
    {
      "id": "nm5608704",
      "name": "Susan Boyd",
      "description": "screenplay"
    },
    {
      "id": "nm0383604",
      "name": "Patricia Highsmith",
      "description": "novel"
    }
  ],
  "cast": [
    {
      "id": "nm0933940",
      "name": "Patrick Wilson",
      "character": "Walter Stackhouse"
    },
    {
      "id": "nm0004754",
      "name": "Jessica Biel",
      "character": "Clara Stackhouse"
    },
    {
      "id": "nm2247245",
      "name": "Haley Bennett",
      "character": "Ellie Briess"
    },
    {
      "id": "nm0550371",
      "name": "Eddie Marsan",
      "character": "Marty Kimmel"
    },
    {
      "id": "nm0440229",
      "name": "Vincent Kartheiser",
      "character": "Det. Laurence Corby"
    },
    {
      "id": "nm1055947",
      "name": "Jon Osbeck",
      "character": "Jon Carr"
    },
    {
      "id": "nm5652539",
      "name": "Radek Lord",
      "character": "Tony Ricco"
    },
    {
      "id": "nm6604374",
      "name": "Christine Dye",
      "character": "Claudia"
    },
    {
      "id": "nm2178728",
      "name": "Kelly Mengelkoch",
      "character": "Helen Kimmel"
    },
    {
      "id": "nm1348335",
      "name": "Corrie Danieley",
      "character": "Betty Ireton"
    },
    {
      "id": "nm2961809",
      "name": "Ian Short",
      "character": "Bill Ireton"
    },
    {
      "id": "nm0835349",
      "name": "Ken Strunk",
      "character": "Mr. Philpott"
    },
    {
      "id": "nm1287157",
      "name": "Jennifer Enskat",
      "character": "Mrs. Philpott"
    },
    {
      "id": "nm3509351",
      "name": "Buz Davis",
      "character": "Detective Harvey"
    },
    {
      "id": "nm4893495",
      "name": "Barry Mulholland",
      "character": "Captain Millard"
    },
    {
      "id": "nm6496157",
      "name": "Richard Hagerman",
      "character": "Bus Driver"
    },
    {
      "id": "nm5210522",
      "name": "Michael Douglas Hall",
      "character": "Mr. De Vries       (as Michael Hall)"
    },
    {
      "id": "nm8297196",
      "name": "Chris Bortz",
      "character": "Barman"
    },
    {
      "id": "nm1134434",
      "name": "Michael Joseph Thomas Ward",
      "character": "Doctor Prowler"
    },
    {
      "id": "nm5498326",
      "name": "Emily Ann Scott",
      "character": "Martha       (as Emily Scott)"
    },
    {
      "id": "nm2345460",
      "name": "Lucas Bentley",
      "character": "Det. Jackson"
    },
    {
      "id": "nm8840019",
      "name": "Jeff",
      "character": "Clara's Dog"
    }
  ],
  "overview": "In 1960s New York, Walter Stackhouse is a successful architect married to the beautiful Clara who leads a seemingly perfect life. But his fascination with an unsolved murder leads him into a spiral of chaos as he is forced to play cat-and-mouse with a clever killer and an overambitious detective, while at the same time lusting after another woman.",
  "storyline": "A psychological noir thriller set in 1960's New York based on Patricia Highsmith's novel, 'The Blunderer'. Walter Stackhouse is rich, successful and unhappily married to the beautiful but damaged Clara. His desire to be free of her feeds his obsession with Kimmel, a man suspected of brutally murdering his own wife. But when Clara is found dead in suspicious circumstances, Walter's string of lies and his own guilty thoughts seem enough to condemn him. As his life becomes dangerously entwined with Kimmel's, a ruthless cop is increasingly convinced he has found a copycat killer in Walter and aims to nail both murderers.",
  "plot": "The story follows Simran (Mallika Sherawat), a young woman married to Sudhir (Ashmit Patel), a workaholic and ex-husband of her dead sister, Sonia. Simran married Sudhir in order to give motherly love to Sudhir and Sonia's son. Due to her lonely, passionless married life, she begins an affair with her college love, Sunny (Emraan Hashmi), whom she accidentally meets. Sunny came in Simran's life after many years. She starts telling lies to Sudhir so as to meet Sunny daily. She gets so engrossed in their affair that she forgets all her commitments as a wife and mother, and she realizes that it is grossly wrong. She decides to end the affair but, to her surprise, she finds another woman named Radhika with him. Simran then realizes her mistake of sleeping with Sunny just because of an unhappy marital life. She laments her unfaithful act.\n\nMeanwhile, Sudhir starts to have doubts about his wife, and hires a detective to trace Simran's whereabouts. His doubts are confirmed when the detective provides him photographs of the two together. He also finds out that Sunny is a womanizer, with many girlfriends. The next day, Sunny suddenly goes missing. The police come to their house and inquire about him on a report registered by his girlfriend. Simran sees the photographs of her and Sunny in Sudhir's pants, and realizes that Sudhir has something to do with Sunny being missing. It is revealed that when Sudhir goes to Sunny's apartment asking him to end the affair, he fatally beats him and buries his body, in the heat of the moment. Simran accepts her mistake, supports Sudhir, and then tries to take the blame of Sunny's murder on herself. This develops and strengthens their love and faith. With Sunny murdered, she is arrested by the police and pleads guilty. On the other hand, Sudhir claims that it is he who killed Sunny. This confuses the police. Moreover, the body is missing from the burial spot.\n\nThe story takes a u-turn when it is found that this \"murder\" never took place; rather it was a plot planned by Sunny with the aid of Radhika to separate Simran and Sudhir, so that he could continue his love affair with Simran. Only Simran comes to realize this, and she is trapped by Sunny. Sunny chases Simran into a jungle, where Sudhir arrives and has another fight with Sunny. He manages to beat him, and Sunny leaves as he sees the two together, seemingly realizing their love for each other. However, Sunny then runs up behind Sudhir with a shovel but is then shot in the back by a police officer, who arrives just in time. The couple reunites with the love developed on the strong foundations of the test of mutual support and understanding to lead a happily married life.",
  "synopsis": null
}