{
  "imdb_id": "tt2778266",
  "tmdb_id": "253318",
  "douban_id": null,
  "title": "American Interior (2014)",
  "genres": [
    "Documentary"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "92 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.2,
  "director": [
    {
      "id": "nm3260665",
      "name": "Dylan Goch"
    },
    {
      "id": "nm1797636",
      "name": "Gruff Rhys"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm6380221",
      "name": "Matthew Batten",
      "character": "Himself - River Dweller"
    },
    {
      "id": "nm6380215",
      "name": "Cory Spotted Bear",
      "character": "Himself - Warrior"
    },
    {
      "id": "nm0063848",
      "name": "Keith Bear",
      "character": "Himself - Musician"
    },
    {
      "id": "nm4665593",
      "name": "Edwin Benson",
      "character": "Himself - Mandan Teacher"
    },
    {
      "id": "nm6380219",
      "name": "Virginia Carlson",
      "character": "Herself - Librarian"
    },
    {
      "id": "nm6380225",
      "name": "Kelley Todd Edmiston",
      "character": "Herself - Tour Guide"
    },
    {
      "id": "nm6380217",
      "name": "Ceri Gwynfryn Evans",
      "character": "Himself - Consultant Psychiatrist"
    },
    {
      "id": "nm6380220",
      "name": "Carolyn Gilman",
      "character": "Herself - Historian"
    },
    {
      "id": "nm6380223",
      "name": "Calvin Grinnell",
      "character": "Himself - Historic Preservation Officer"
    },
    {
      "id": "nm6380222",
      "name": "Marilyn Hudson",
      "character": "Herself - Tribal Historian"
    },
    {
      "id": "nm6380218",
      "name": "Martha Hunter",
      "character": "Herself - Librarian"
    },
    {
      "id": "nm6380216",
      "name": "Ffion Mair Jones",
      "character": "Academic       (as Dr. Ffion Mair Jones)"
    },
    {
      "id": "nm0587121",
      "name": "Gareth Miles",
      "character": "Himself - Dramatist"
    },
    {
      "id": "nm6380226",
      "name": "George Miles",
      "character": "Himself - Curator, Yale Collection of Western Americana"
    },
    {
      "id": "nm6380224",
      "name": "John Moeykens",
      "character": "Himself - Chief Park Ranger"
    },
    {
      "id": "nm6380228",
      "name": "Dafydd Rhys",
      "character": "Himself - Academic"
    },
    {
      "id": "nm1797636",
      "name": "Gruff Rhys",
      "character": "Himself"
    },
    {
      "id": "nm2442857",
      "name": "Kliph Scurlock",
      "character": "Himself - Musician"
    },
    {
      "id": "nm5959623",
      "name": "Gwyn Alf Williams",
      "character": "Himself - Historian       (archive footage)"
    },
    {
      "id": "nm6380227",
      "name": "W. Raymond Wood",
      "character": "Anthropologist       (as Dr. W. Raymond Wood)"
    }
  ],
  "overview": "Two men. Two quests. Two centuries apart. Four ways to experience the search for a lost tribe. Film. Book. Album. App.",
  "storyline": "In 1792, John Evans, a farmhand from Snowdonia travelled to America to discover whether there was a Welsh-speaking Native American tribe walking the Great Plains. Over 200 years later, distant relative Gruff Rhys (Super Furry Animals) retraces the explorer's route through the continent by means of an investigative concert tour. A unique project that blurs the boundaries of music, literature and film and investigates what really happened in the heart of the new world.",
  "plot": "In 2065, Earth is infested by alien life forms known as Phantoms. By physical contact Phantoms consume the Gaia spirit of living beings, killing them instantly, though a minor contact may only result in an infection. The surviving humans live in \"barrier cities\", areas protected by an energy shield that prevents Phantoms from entering, and are engaged in an ongoing struggle to free the planet. After being infected by a Phantom during one of her experiments, Aki Ross (Ming-Na) and her mentor, Doctor Sid (Donald Sutherland), uncover a means of defeating the Phantoms by gathering eight spirit signatures that, when joined, can negate the Phantoms. Aki is searching for the sixth spirit in the ruins of New York City when she is cornered by Phantoms but is rescued by Gray Edwards (Alec Baldwin) and his squad \"Deep Eyes\", consisting of Ryan Whittaker (Ving Rhames), Neil Fleming (Steve Buscemi) and Jane Proudfoot (Peri Gilpin). It is revealed that Gray was once romantically involved with Aki.\n\nUpon returning to her barrier city, Aki joins Sid and appears before the leadership council along with General Hein (James Woods), who is determined to use the powerful Zeus space cannon to destroy the Phantoms. Aki is concerned the cannon will damage Earth's Gaia (a spirit representing its ecosystem) and delays the use of it by revealing that she has been infected and the collected spirit signatures are keeping her infection stable, convincing the council that there may be another way to defeat the Phantoms. However, this revelation leads Hein to incorrectly conclude that she is being controlled by the Phantoms. Aki and the Deep Eyes squad succeed in finding the seventh spirit as Aki's infection begins to worsen and she slips into unconsciousness. Her dream reveals to her that the Phantoms are the spirits of dead aliens brought to Earth on a fragment of their destroyed planet. Sid uses the seventh spirit to bring Aki's infection back under control, reviving her.\n\nTo scare the council into giving him clearance to fire the Zeus cannon, Hein lowers part of the barrier shield protecting the city. Though Hein intended that only a few Phantoms enter, his plan goes awry and legions of Phantoms invade the entire city. Aki, Sid and the Deep Eyes attempt to reach Aki's spaceship, their means of escape, but Ryan, Neil and Jane are killed by Phantoms. Hein escapes and boards the Zeus space-station where he finally receives authorisation to fire the cannon.\n\nSid finds the eighth spirit at the crater site of the alien asteroid's impact on Earth. He lowers a shielded vehicle, with Aki and Gray aboard, into the crater to locate the final spirit. Just before they can reach it, Hein fires the Zeus cannon into the crater, not only destroying the eighth spirit but also revealing the Phantom Gaia. Aki has a vision of the Phantom home planet, where she is able to receive the eighth spirit from the alien particles in herself. When Aki awakens, she and Gray combine it with the other seven. Hein continues to fire the Zeus cannon despite overheating warnings and unintentionally destroys the cannon and himself. Gray sacrifices himself as a medium needed to physically transmit the completed spirit into the alien Gaia. The Earth's Gaia is returned to normal as the Phantoms ascend into space, finally at peace. Aki is pulled from the crater holding Gray's body, and is seen looking into the newly liberated world.",
  "synopsis": null
}