{
  "imdb_id": "tt2711256",
  "tmdb_id": "364327",
  "douban_id": null,
  "title": "Jonah (2015)",
  "genres": [
    "Drama",
    "Romance",
    "Thriller"
  ],
  "country": "Brazil",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.4,
  "director": [
    {
      "id": "nm4746436",
      "name": "Lô Politi"
    }
  ],
  "writer": [
    {
      "id": "nm4746436",
      "name": "Lô Politi",
      "description": "written by"
    },
    {
      "id": "nm5528506",
      "name": "Élcio Verçosa",
      "description": "written by as Élcio Verçosa Filho"
    }
  ],
  "cast": [
    {
      "id": "nm4916455",
      "name": "Jesuíta Barbosa",
      "character": "Jonas"
    },
    {
      "id": "nm2981006",
      "name": "Laura Neiva",
      "character": "Branca"
    },
    {
      "id": "nm4333253",
      "name": "Criolo",
      "character": "Dandão"
    },
    {
      "id": "nm2565479",
      "name": "Paulo Américo",
      "character": "Moisés"
    },
    {
      "id": "nm5376271",
      "name": "Ariclenes Barroso",
      "character": "Berro"
    },
    {
      "id": "nm0083531",
      "name": "Roberto Birindelli",
      "character": "Marcos"
    },
    {
      "id": "nm7639828",
      "name": "João Fábio Cabral",
      "character": "Derval"
    },
    {
      "id": "nm4737287",
      "name": "Karol Conka",
      "character": "Miriam"
    },
    {
      "id": "nm0145485",
      "name": "Ana Cecília Costa",
      "character": "Janice"
    },
    {
      "id": "nm0182229",
      "name": "Luciana Costa",
      "character": ""
    },
    {
      "id": "nm0184231",
      "name": "Chris Couto",
      "character": "Rita"
    },
    {
      "id": "nm7632902",
      "name": "Luan Marques",
      "character": "Jander"
    },
    {
      "id": "nm3773075",
      "name": "Tomas Rezende",
      "character": "Nestor"
    },
    {
      "id": "nm7631736",
      "name": "Rincon Sapiência",
      "character": "Cesinha"
    },
    {
      "id": "nm7639871",
      "name": "Julio Silveira",
      "character": ""
    },
    {
      "id": "nm8359236",
      "name": "José Silvério",
      "character": "Tião"
    },
    {
      "id": "nm2573277",
      "name": "Luciana Souza",
      "character": "Antônia"
    },
    {
      "id": "nm4502336",
      "name": "Chay Suede",
      "character": "Fê"
    }
  ],
  "overview": "During Carnival in San Paulo, a young man and young woman who knew each other as children meet again after many years and social barriers have kept them apart. On the day of the festival, Jonah commits a crime and kidnaps Branca in order to keep them both safe from his boss. Hiding in the whale, the main float for this years Carnival, the two reconnect and must make choices that will affect their lives forever.",
  "storyline": "During Carnival in San Paulo, a young man and young woman who knew each other as children meet again after many years and social barriers have kept them apart. On the day of the festival, Jonah commits a crime and kidnaps Branca in order to keep them both safe from his boss. Hiding in the whale, the main float for this years Carnival, the two reconnect and must make choices that will affect their lives forever.",
  "plot": "During the American Civil War, Jonah Hex (Josh Brolin) served as a Confederate cavalryman until his commanding officer, Quentin Turnbull (John Malkovich) ordered him to burn down a hospital. Hex refused, and was forced to kill his best friend, Turnbull's son Jeb. After the war, a vengeful Turnbull and his right-hand man, Burke (Michael Fassbender), tie up Hex and force him to watch as his house is burned down with his wife and son inside. Turnbull then brands Hex's face with his initials and leaves him to die. Days later, American Indians revive Jonah with their mystical powers. As a result of his resurrection, Jonah acquires the ability to temporarily resurrect the dead. When Turnbull apparently dies in a hotel fire, Hex satisfies his hunger for vengeance by turning to bounty hunting. He also sears the branded side of his face with a hatchet blade, preferring a mass of scar tissue to Turnbull's initials.\n\nIn 1876, Turnbull, alive and well, hijacks a train carrying components of an experimental \"superweapon\", slaughtering its military guards and civilian passengers alike. When informed of the theft, President Grant (Aidan Quinn) surmises that Turnbull is planning a terrorist attack for July 4, during the celebration of the American centennial. Grant instructs Army Lieutenant Grass (Will Arnett) to find Hex and hire him to stop Turnbull.\n\nJonah spends the night in a brothel with Lilah (Megan Fox), a prostitute attracted to the disfigured man for more than just professional reasons. As he prepares to leave the next morning, Grass' men burst in and tell him that Turnbull is still alive. They show him a captured thug from the train hijacking who told them Turnbull is headed northwest, before dying during interrogation. Jonah briefly resurrects the man, who knows only that he was recruited by ex-Confederal Colonel Slocum (Tom Wopat), who is running an illegal deathmatch pavilion in South Carolina.\n\nWith the help of a corrupt Washington aristocrat, Adleman Lusk (Wes Bentley), Turnbull tracks down and steals the remaining components of the weapon, invented by Eli Whitney.\n\nWhen Hex confronts Slocum in South Carolina, Slocum refuses to talk, sarcastically telling Hex to ask Turnbull's dead son, Jeb, where his father is. Jonah says that is a good idea, then overpowers Slocum's men and throws Slocum himself into the ring, to be killed by his own fighters. After setting fire to the ring, he frees a dog being tormented by Slocum's handlers, which starts to follow him around.\n\nIn a cemetery in Gettysburg, Jonah digs up and resurrects Jeb (an uncredited Jeffrey Dean Morgan). Jonah apologizes for killing Jeb, and says that his father has to be stopped before he murders more people. Jeb reveals that his father is at Fort Resurrection, and then returns to the afterlife.\n\nAfter entering the fort, Jonah confronts Turnbull, killing several of his men, but Turnbull escapes and Hex receives a near-fatal wounding from Burke, but is able to escape. He collapses in a field, hovering near death for several days. Turnbull, anticipating that Hex will return, sends Burke to bring him \"something Hex loves,\" so Burke kidnaps Lilah from the brothel. Turnbull test-fires the \"superweapon\" on a small town in Georgia, which is leveled to the ground, killing hundreds of civilians. When President Grant receives the news, his aide reports that they have no idea where in the country Turnbull will strike, and that they do not have enough military manpower to guard every centennial celebration.\n\nHex is found by his Native American allies, who perform a ceremony that heals him. Back on his feet, he relays a message to Lt. Grass that Turnbull plans to attack Washington, D.C., then rides to Independence Harbor alone to stop him. When Jonah attempts to infiltrate the harbor where Turnbull's ironclad warship is anchored, Burke spots him and attacks him. Hex overpowers and kills him, then resurrects him just so Hex can incinerate his body completely. Turnbull holds Lilah at gunpoint and forces Jonah to surrender. With Jonah and Lilah captive in the hold of his ship, Turnbull steams toward Washington, D.C. A monitor commanded by Lt. Grass intercepts Turnbull, but is quickly destroyed with the weapon, which has been mounted on the bow.\n\nIn the hold, Lilah picks her handcuffs and frees herself and Jonah. She holds off the guards while Jonah rushes up to the deck to stop Turnbull. Turnbull gains the upper hand and orders the weapon to fire. The weapon blankets Washington with a volley of delay-action bomb shells, and Turnbull gives the order for the trigger shell to be launched. But Hex and Turnbull's fight takes them down into the engine room, where Hex throws his tomahawk into the weapon's belt feeder, trapping the trigger shell. He then brutally beats Turnbull and traps his neck in a gear, before saving Lilah. The pair jump into the water just as the trigger shell ignites in the engine room, killing Turnbull and all his men. The next day, President Grant rewards Jonah with a large sum of money, a full pardon, and offers him a job as Sheriff of the entire United States. Jonah declines, but assures the president that if they need him, they'll be able to find him. Lilah is waiting for him outside the White House, and they leave the city together.\n\nIn the last scene, Jonah visits Jeb's grave to apologize for having to kill his father, then rides out of the cemetery with his dog.",
  "synopsis": null
}