{
  "imdb_id": "tt2728286",
  "tmdb_id": "214144",
  "douban_id": null,
  "title": "This Is Sanlitun (2013)",
  "genres": [
    "Comedy"
  ],
  "country": "China",
  "version": [
    {
      "runtime": "93 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm0235238",
      "name": "Róbert I. Douglas"
    }
  ],
  "writer": [
    {
      "id": "nm0235238",
      "name": "Róbert I. Douglas",
      "description": "screenplay and"
    },
    {
      "id": "nm5540391",
      "name": "Carlos Ottery",
      "description": "screenplay &"
    },
    {
      "id": "nm5541309",
      "name": "Christopher Loton",
      "description": "screenplay"
    },
    {
      "id": "nm0235238",
      "name": "Róbert I. Douglas",
      "description": "story"
    }
  ],
  "cast": [
    {
      "id": "nm5540391",
      "name": "Carlos Ottery",
      "character": "Gary"
    },
    {
      "id": "nm5541309",
      "name": "Christopher Loton",
      "character": "Frank"
    },
    {
      "id": "nm0910692",
      "name": "Ai Wan",
      "character": "Lin"
    },
    {
      "id": "nm5546763",
      "name": "Cromwell Cheung",
      "character": "Wang Ke"
    },
    {
      "id": "nm5551927",
      "name": "David Kenneth Vaughan",
      "character": "Jonathan Taylor-Sharpe"
    },
    {
      "id": "nm5760168",
      "name": "Hugo Catonné",
      "character": "Nico"
    },
    {
      "id": "nm5551458",
      "name": "Daniel Douglas-Li",
      "character": "Johnnie"
    },
    {
      "id": "nm5546805",
      "name": "Hu Gaoxiang",
      "character": "Momo"
    },
    {
      "id": "nm5601692",
      "name": "Hui Ting Kang",
      "character": "Bikini Model"
    },
    {
      "id": "nm5551640",
      "name": "Yi Xin Kuang",
      "character": "Co Co"
    },
    {
      "id": "nm5551850",
      "name": "Leonardo Lee",
      "character": "Feng Wei"
    },
    {
      "id": "nm5568841",
      "name": "Greg Lepkoff",
      "character": "Chuck"
    },
    {
      "id": "nm5575170",
      "name": "Gerry Mattios",
      "character": "Stavros"
    },
    {
      "id": "nm5551568",
      "name": "Anastasia Nobobranova",
      "character": "The Icelandic Wife"
    },
    {
      "id": "nm5568837",
      "name": "Efraim Smits",
      "character": "Claude"
    },
    {
      "id": "nm5551811",
      "name": "Kitty Xu",
      "character": "Mary"
    },
    {
      "id": "nm5551924",
      "name": "Jiang Zheng",
      "character": "The Pawnbroker"
    }
  ],
  "overview": "British sad sack Gary is a failed entrepreneur who has just arrived in Beijing's stylish Sanlitun district, allegedly to start a business. There are other reasons why he has uprooted himself — he's followed his ex-wife and young son, for one — but he soon finds out that China isn't the easiest place to succeed. Blissfully untouched by self-awareness, and only fitfully in tune with reality, Gary sallies forth to make money, armed with faith in himself and little to no knowledge of Chinese culture. He soon hooks up with Frank, a trust-fund kid from Australia who offers to mentor Gary in Eastern ways, although Frank's pedagogical method is restricted to yelling at Gary for being a Westerner and not being as \"Chinese\" as him.",
  "storyline": "Gary is in Beijing to make it big, after failing to impress his Chinese investors he soon takes up English teaching and gets life lessons from Frank, an incompetent mentor. Gary's real reasons for staying become apparent when his son and Chinese ex-wife enter.",
  "plot": "The film is a mockumentary about Gary, a British man, arriving in Beijing to set up a business and reconnect with his ex-wife.",
  "synopsis": "Hapless Gary arrives in Beijing chasing the Chinese dream desperate to make it big in business and win back his ex-wife and son. In a country of limitless GDP growth Garys sure his natural talent will see him good.\nEnter Frank, a long-time expat and delusional China know-it-all, promising to take Gary under his wing and be his mentor in all things China (for a small fee of course)!Forming an idiotic tag-team they try to take China by storm. Trapped in their own fantasy worlds and more interested in the etiquette of beer drinking and beer mat collecting than anything else, inevitable failure ensues.\nWhen no-one is interested in Garys North Korean miracle hair growth product Frank swings Gary a job in English teaching, but with Garys insane approach to teaching and his accidentally picking up a student girlfriend the job proves short lived.A chance meeting with a bald beggar gives Gary a shot at the big time. Fleeting success goes to his head and he immediately alienates Frank while destroying any hope of winning back his family (again). Gary comes crashing back to earth with Chinas most famous foreigner swindling him of his business. Left with nothing Garys begs for Franks forgiveness and is grudgingly taken back into not quite open arms.\nAll thats left is for Frank and Gary to conjure up one final stupid plan to win back the family. They fail of course but it doesn't matter as at least they have found the real China and what it really means- just keep drinking!"
}