{
  "imdb_id": "tt2708764",
  "tmdb_id": "204342",
  "douban_id": null,
  "title": "HK: Forbidden Super Hero (2013)",
  "genres": [
    "Comedy"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "106 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm2279646",
      "name": "Yûichi Fukuda"
    }
  ],
  "writer": [
    {
      "id": "nm5522127",
      "name": "Keishû Andô",
      "description": "manga"
    },
    {
      "id": "nm2279646",
      "name": "Yûichi Fukuda",
      "description": "screenplay &"
    },
    {
      "id": "nm1040419",
      "name": "Shun Oguri",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0840660",
      "name": "Ryôhei Suzuki",
      "character": "Kyosuke Shikijo"
    },
    {
      "id": "nm4392634",
      "name": "Fumika Shimizu",
      "character": "Aiko Himeno"
    },
    {
      "id": "nm2112748",
      "name": "Tsuyoshi Muro",
      "character": "Tamao Ogane       (as Murotsuyoshi)"
    },
    {
      "id": "nm1904410",
      "name": "Ken Yasuda",
      "character": "Towatari"
    },
    {
      "id": "nm1187057",
      "name": "Jirô Satô",
      "character": "Very Serious Mask"
    },
    {
      "id": "nm1553639",
      "name": "Narushi Ikeda",
      "character": "Hario Shikijo"
    },
    {
      "id": "nm0875356",
      "name": "Takashi Tsukamoto",
      "character": "Detective"
    },
    {
      "id": "nm0645445",
      "name": "Yoshinori Okada",
      "character": ""
    },
    {
      "id": "nm2757579",
      "name": "Shunsuke Daitô",
      "character": "Cool Guy Mask"
    },
    {
      "id": "nm1024933",
      "name": "Nana Katase",
      "character": "Maki Shikijo"
    },
    {
      "id": "nm8120299",
      "name": "Kentez Asaka",
      "character": "Man 1"
    },
    {
      "id": "nm3103719",
      "name": "Shôta Chiyo",
      "character": "Trainer"
    },
    {
      "id": "nm1040419",
      "name": "Shun Oguri",
      "character": ""
    },
    {
      "id": "nm5115326",
      "name": "Yôsuke Ohmizu",
      "character": "Skinny Macho Mask"
    }
  ],
  "overview": "High school student Kyosuke Shikijo is the most talented member of the school's martial arts of the fist club. His late father was detective and Kyosuke share his father's strong sense of justice. Kyosuke also has a secret. Kyosuke likes to wear female underwear and transforms himself into the alter ego \"Hentai Kamen,\" wearing female underwear and gaining superhuman powers. This unusual interest also comes from his parents, with his father a masochist and his mother a sadist. By chance, Kyosuke gets the underwear of female high school student Aiko Himeno. With her underwear, he gains various pervert techniques and attempts to protect Aiko from a dirty and heinous teacher.",
  "storyline": "High school student Kyosuke Shikijo (Ryohei Suzuki) is the most talented member of the school's martial arts of the fist club. His late father was detective and Kyosuke share his father's strong sense of justice. Kyosuke also has a secret. Kyosuke likes to wear female underwear and transforms himself into the alter ego \"Pervert Mask,\" wearing female underwear and gaining superhuman powers. This unusual interest also comes from his parents, with his father a masochist and his mother a sadist. By chance, Kyosuke gets the underwear of female high school student Aiko Himeno's (Fumika Shimizu). With her underwear, he gains various pervert techniques and attempts to protect Aiko from a dirty and heinous teacher (Ken Yasuda).",
  "plot": null,
  "synopsis": "The son of a dominatrix and a detective, Kyosuke Shikijo (Ryohei Suzuki) is a wimp with a soft spot for justice. He joins the martial arts club to become tougher. The new girl in his class, Aiko Himeno (Fumika Shimizu), is also the new manager of the club. Kyosuke falls for Aiko instantly.When Aiko is stuck in a hostage situation, Kyosuke sneaks into the bank and tries to stop the robbers by wearing a mask and pretending to be one of them. But instead of a mask, he accidentally puts a pair of women's panties on his face with turns him into the superhero Hentai Kamen (translated several ways, but I prefer Masked Pervert). He thwarts criminals and wins the admiration of the city and Aiko.It is then that a group of thugs from a nearby school try to take over. Their leader, Ogane Tamao (Tsuyoshi Muro), believes that there is treasure under the campus and has bought the school grounds. But after a mortifying defeat at the hands of Hentai Kamen, the thugs send in several assassins to take care of Hentai Kamen, including a school code of conduct enforcing robot (Jiro Sato). Their last assassin is Bizarro Hentai Kamen (Ken Yasuda) who poses as the new school teacher. He wreaks havoc on the city and ruins Hentai Kamen's reputation.After Kyosuke discovers Bizarro HK's perversity surpasses his own, he begins to doubt his powers. Tamao is able to take over the martial arts club where he captures Kyosuke and tries to shoot him. Kyosuke gains a second wind thinking about his late father and transforms once again. He defeats Tamao and the final battle between Hentai Kamen and Bizarro HK ensues. Hentai Kamen defeats his Bizarro self but his mask is too damaged to hide his face, so Aiko finds out that he is Hentai Kamen.Kyosuke and Aiko are about to have a romantic moment when Tamao bursts out of the school in a giant robot. Kyosuke does not have his panties with him and asks to borrow Aiko's who reluctantly lets him. Hentai Kamen kicks the robot in the crotch and makes it explode."
}