{
  "imdb_id": "tt2707540",
  "tmdb_id": "332269",
  "douban_id": null,
  "title": "The Age of Love (2014)",
  "genres": [
    "Documentary",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "79 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.2,
  "director": [
    {
      "id": "nm0521026",
      "name": "Steven Loring"
    }
  ],
  "writer": [
    {
      "id": "nm0521026",
      "name": "Steven Loring",
      "description": "writer"
    }
  ],
  "cast": null,
  "overview": "A first-of-its-kind speed dating event for 70- to 90-year-olds sets up this comic and poignant look at the search for love among the booming senior set. Over one summer, we intimately follow as ten speed daters – fearlessly candid about their lives and desires – prepare for the big day, endure a rush of encounters, and anxiously receive their results. Then, as they head out on first dates, we discover how worries over physical appearance, intimacy and rejection, loss and new beginnings change – or don't change – from first love to the far reaches of life. Α funny and bittersweet story about the universality of love and desire, regardless of age.",
  "storyline": "The announcement of a first-of-its-kind Speed Dating event exclusively for 70- to 90-year-olds spurs a diverse group of seniors to take stock of aging bodies and still-hopeful hearts. Over one summer, we intimately follow as ten speed daters -- recently widowed, long-divorced or never-married -- prepare for the big day, endure a rush of encounters then anxiously receive their results. Along the way, windows open revealing hidden emotions of this often stereotyped population. As they head out on dates that result, comic, poignant and bittersweet moments reveal how worries over physical appearance, romance and rejection, loss and new beginnings are universal, changing little from first love to the far reaches of life.",
  "plot": "Nikki (Bening) is a recent widow whose husband, Garret (Ed Harris), died in a drowning accident and has not yet gotten over it. Objects, people and situations that remind Nikki of the love of her life still haunt her. Resigned to life alone, Nikki visits an art gallery she often frequented with Garret and sees a man (Harris in a dual role) whose resemblance to her husband stuns her. She returns to the gallery several more times, hoping to see him. Eventually, Nikki identifies him as a professor at a small local college. She finds \"Tom\" on the internet and visits an art class he is teaching; but she is emotionally overwhelmed and flees. Eventually, Nikki calms down and invites Tom to give her private, at home, tutoring in painting. She doesn't disclose to him his physical resemblance to her late husband.\n\nNikki and Tom become lovers, to the emotional distress of her neighbor (Robin Williams), who has hoped to attract her interest romantically since the death of Garret, his friend. The strain of keeping Tom a secret from her friends and family, who would immediately recognize the uncanny resemblance, begins to wear on Nikki, Tom, and the relationship. Nikki is not alone in keeping secrets in the relationship. Tom, who is divorced for 10 years from his ex-wife yet still maintains a close friendship with her, does not tell Nikki he suffers from a severe heart ailment. When Nikki’s adult daughter Summer visits unexpectedly, finding Tom at the house, she flies into a rage repulsed by Tom’s appearance. Tom believes her outrage is triggered simply by his presence. Tom, puzzled by the daughter's reaction, accepts when Nikki asks him to fly off to Mexico with her. At a resort often visited by Garret and Nikki when they were married, Tom discovers a photo of Nikki and her husband by the bar, notices the resemblance and also realizes that a psychologically imbalanced Nikki has brought him to the very place her husband died. Tom confronts her with the resemblance and Nikki runs off into the raging surf, perhaps to commit suicide. She is rescued by Tom and they later hold one another in bed with the knowledge the relationship isn't based in anything more than his physical similarities to Garret and is doomed.\n\nA year later, Summer finds an art gallery card in Nikki's mail that turns out to be an invitation to a memorial display of Tom's art. Tom has died of his heart condition but produced an outpouring of art in his last year. Nikki attends the reception hosted by Tom's ex-wife and tearfully sees Tom's painting of the two of them titled \"The Face of Love\".",
  "synopsis": null
}