{
  "imdb_id": "tt2763304",
  "tmdb_id": "180863",
  "douban_id": null,
  "title": "T2 Trainspotting (2017)",
  "genres": [
    "Drama"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "117 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm0000965",
      "name": "Danny Boyle"
    }
  ],
  "writer": [
    {
      "id": "nm0920543",
      "name": "Irvine Welsh",
      "description": "novel"
    }
  ],
  "cast": [
    {
      "id": "nm0000191",
      "name": "Ewan McGregor",
      "character": "Renton"
    },
    {
      "id": "nm8732540",
      "name": "Logan Gillies",
      "character": "Simon (aged 9)"
    },
    {
      "id": "nm8732541",
      "name": "Ben Skelton",
      "character": "Renton (aged 9)"
    },
    {
      "id": "nm8732542",
      "name": "Aiden Haggarty",
      "character": "Spud (aged 9)"
    },
    {
      "id": "nm8732543",
      "name": "Daniel Smith",
      "character": "Begbie (aged 9)"
    },
    {
      "id": "nm7530096",
      "name": "Elijah Wolf",
      "character": "Tommy (aged 9)"
    },
    {
      "id": "nm0001015",
      "name": "Robert Carlyle",
      "character": "Begbie /              Begbie's Father"
    },
    {
      "id": "nm1017414",
      "name": "Steven Robertson",
      "character": "Stoddart"
    },
    {
      "id": "nm0001971",
      "name": "Ewen Bremner",
      "character": "Spud"
    },
    {
      "id": "nm0443642",
      "name": "John Kazek",
      "character": "Tom (Rehab Group)"
    },
    {
      "id": "nm0376602",
      "name": "Shirley Henderson",
      "character": "Gail"
    },
    {
      "id": "nm8732544",
      "name": "Charlie Hardie",
      "character": "Fergus (aged 9)"
    },
    {
      "id": "nm8732545",
      "name": "Scott Aitken",
      "character": "Farmer"
    },
    {
      "id": "nm0448053",
      "name": "Gordon Kennedy",
      "character": "Tulloch"
    },
    {
      "id": "nm0001538",
      "name": "Jonny Lee Miller",
      "character": "Simon"
    },
    {
      "id": "nm3919984",
      "name": "Anjela Nedyalkova",
      "character": "Veronika"
    },
    {
      "id": "nm8307138",
      "name": "Tereza Duskova",
      "character": "Tourism Girl"
    },
    {
      "id": "nm1972589",
      "name": "Elek Kish",
      "character": "Dozo"
    },
    {
      "id": "nm8313494",
      "name": "Lewis Gribben",
      "character": "Dealer"
    },
    {
      "id": "nm8732546",
      "name": "Dominic Maccoll",
      "character": "Dealer"
    },
    {
      "id": "nm8732547",
      "name": "Calum Verrecchia",
      "character": "Dealer"
    },
    {
      "id": "nm0918631",
      "name": "Simon Weir",
      "character": "Jailhouse"
    },
    {
      "id": "nm4978225",
      "name": "Bradley Welsh",
      "character": "Doyle"
    },
    {
      "id": "nm0181920",
      "name": "James Cosmo",
      "character": "Renton's Father"
    },
    {
      "id": "nm1648520",
      "name": "Katie Leung",
      "character": "Nurse"
    },
    {
      "id": "nm8699252",
      "name": "Thierry Mabonga",
      "character": "Security Officer Wilson"
    },
    {
      "id": "nm1460618",
      "name": "Atta Yaqub",
      "character": "Medical Student"
    },
    {
      "id": "nm2569439",
      "name": "Christopher Douglas",
      "character": "Chris the Oracle"
    },
    {
      "id": "nm0877796",
      "name": "Pauline Turner",
      "character": "June"
    },
    {
      "id": "nm7373417",
      "name": "Scot Greenan",
      "character": "Frank Junior"
    },
    {
      "id": "nm8732548",
      "name": "James McElvar",
      "character": "Simon (aged 20)"
    },
    {
      "id": "nm8243136",
      "name": "Connor McIndoe",
      "character": "Renton (aged 20)"
    },
    {
      "id": "nm3467013",
      "name": "Bryan Quinn",
      "character": "Man in Music Video"
    },
    {
      "id": "nm0920543",
      "name": "Irvine Welsh",
      "character": "Mikey Forrester"
    },
    {
      "id": "nm8732549",
      "name": "Ged Hanley",
      "character": "Social Club Band"
    },
    {
      "id": "nm8732550",
      "name": "Neil Thomson",
      "character": "Social Club Band"
    },
    {
      "id": "nm8732551",
      "name": "Margaret Davies",
      "character": "Social Club Singer"
    },
    {
      "id": "nm8732552",
      "name": "Alex Jackson",
      "character": "Social Club Singer"
    },
    {
      "id": "nm1146882",
      "name": "Tom Urie",
      "character": "Big Bear"
    },
    {
      "id": "nm1692785",
      "name": "Phil Coppola",
      "character": "Boxing Instructor"
    },
    {
      "id": "nm2686004",
      "name": "John Bell",
      "character": "Spud (aged 20)"
    },
    {
      "id": "nm7365512",
      "name": "Kyle Fitzpatrick",
      "character": "Fergus"
    },
    {
      "id": "nm0531808",
      "name": "Kelly Macdonald",
      "character": "Diane"
    },
    {
      "id": "nm0629374",
      "name": "Eileen Nicholas",
      "character": "Renton's Mother"
    },
    {
      "id": "nm8732554",
      "name": "Michael Shaw",
      "character": "Tommy (aged 20)"
    },
    {
      "id": "nm0571727",
      "name": "Kevin McKidd",
      "character": "Tommy       (archive footage)"
    },
    {
      "id": "nm7078365",
      "name": "Lauren Lamb",
      "character": "Baby Dawn"
    },
    {
      "id": "nm8732555",
      "name": "Devon Lamb",
      "character": "Baby Dawn"
    },
    {
      "id": "nm2240061",
      "name": "Amy Manson",
      "character": "Woman in Club"
    },
    {
      "id": "nm3737309",
      "name": "Russell Dunsmore",
      "character": "Hard Guy Driver"
    },
    {
      "id": "nm6868068",
      "name": "Nebli Basani",
      "character": "Hardman"
    },
    {
      "id": "nm8732556",
      "name": "Edyta Szewczyk",
      "character": "Girl in Sauna"
    },
    {
      "id": "nm8732557",
      "name": "Fiori Miari",
      "character": "Girl in Sauna"
    },
    {
      "id": "nm0528422",
      "name": "Pauline Lynch",
      "character": "Lizzy"
    },
    {
      "id": "nm8732558",
      "name": "Christopher Mullen",
      "character": "Begbie (aged 20)"
    },
    {
      "id": "nm8732559",
      "name": "Hamish Haggerty",
      "character": "Young Renton"
    },
    {
      "id": "nm8732560",
      "name": "Daniel Jackson",
      "character": "Young Begbie"
    },
    {
      "id": "nm0945901",
      "name": "Svetlana Yancheva",
      "character": "Veronika's Mother"
    },
    {
      "id": "nm8732561",
      "name": "Emil Bonev",
      "character": "Veronika's Son"
    }
  ],
  "overview": "First there was an opportunity......then there was a betrayal. Twenty years have gone by. Much has changed but just as much remains the same. Mark Renton returns to the only place he can ever call home. They are waiting for him: Spud, Sick Boy and Begbie. Other old friends are waiting too: sorrow, loss, joy, vengeance, hatred, friendship, love, longing, fear, regret, diamorphine, self-destruction and mortal danger, they are all lined up to welcome him, ready to join the dance.",
  "storyline": "First there was an opportunity......then there was a betrayal. Twenty years have gone by. Much has changed but just as much remains the same. Mark Renton (Ewan McGregor) returns to the only place he can ever call home. They are waiting for him: Spud (Ewen Bremner), Sick Boy (Jonny Lee Miller), and Begbie (Robert Carlyle). Other old friends are waiting too: sorrow, loss, joy, vengeance, hatred, friendship, love, longing, fear, regret, diamorphine, self-destruction and mortal danger, they are all lined up to welcome him, ready to join the dance.",
  "plot": "After twenty years of estrangement, Mark Renton returns home to Edinburgh from Amsterdam, where he lives with his wife. His father lives alone since the death of Mark's mother. Daniel \"Spud\" Murphy struggles with his heroin addiction and its legacy, which impacts on his long-suffering partner Gail and their son Fergus. Simon \"Sick Boy\" Williamson continues to live a life of crime and dodgy-dealing, working as landlord of a pub in Leith called Port Sunshine bequeathed to him by his aunt, while pursuing a sideline in blackmail and growing cannabis plants in the basement. Francis \"Franco\" Begbie is serving a 25-year prison sentence and has just been denied parole due to his violent temper. After visiting his father and stopping by his old bedroom, Mark goes to visit Spud at his flat, finding him in a desperate condition; Spud is trying to commit suicide by taping a plastic bag around his head in an attempt at self-asphyxiation. Mark breaks the door down and saves Spud, who initially does not welcome the intervention, but Mark wants to help him out of his heroin addiction and to reconcile with Simon, who remains angry with Mark for betraying them (though according to Mark, Simon would have done the same).\n\nMark visits Simon at Port Sunshine. Though initially Simon greets Mark warmly, inquiring about his life in Amsterdam, the meeting soon develops into a full-scale fight, with both using weapons such as beer glasses and pool cues on the other. Mark has a vision of a girl holding his head while lying unconscious on the pool table, and wakes up to find Simon taking cocaine. Mark gives Simon a package containing £4000, Simon's share of the drug deal proceeds that Mark stole 20 years earlier. Begbie purposefully hospitalises himself and subsequently escapes, taking advantage of the low security. He briefly reunites with his wife and son, and visits Simon. Simon feigns friendship with Mark as his ulterior motive, pretending to collaborate with Begbie, who is still out for revenge against Mark. Mark takes Spud running up Arthur's Seat, and while looking over Edinburgh explains to Spud that he is an addict, but that he just needs to swap his drug addiction for something else, such as exercise.\n\nMark decides to stay in Edinburgh and visits Simon at his flat in Leith, where he explains that while he is married, the marriage is ending and Mark would only be returning to Amsterdam to move his stuff out of the flat he shares with his wife, who owns it. Mark also explains that three months prior, he suffered a heart condition which caused him to undergo an operation to insert a stent. Simon, Mark and Simon's 'partner' Veronika travel to Glasgow, and enter a packed Orange Lodge, where they pick the pockets of the assembled clientele, stealing every bank card they find. However, the landlord refuses to let them leave without singing a song, and Mark and Simon (singing and playing piano respectively), make up a song featuring the Battle Of The Boyne in 1690, every verse ending with the line, \"there were no more Catholics left!\". The three head back to Edinburgh, and assuming that the year of the battle will be the PIN of each of the bank cards, steal money from every account they can access. Simon and Mark also make a presentation at the Scottish Parliament building in an effort to secure European development funds to establish a leisure club upstairs at Simon's pub, to be run by the mystery girl from Mark's pool-table vision, who turns out to be Simon's \"girlfriend\", Veronika, who was also involved in Sick Boy's blackmailing schemes.\n\nWhile on the run, Begbie begins burgling houses, taking along his son Frank Jr, who he sees as a chip off the old block, while Frank Jr's aspirations lie in attending college. Begbie sells his stolen goods to his old friend Mikey Forrester, who is now a successful \"businessman\". While in Forrester's warehouse, Begbie opens a fridge to find bags containing thousands of Viagra tablets, and boxes of the same. He takes some of the tablets and goes to a nightclub. While in the toilets, Begbie and Renton accidentally meet but Renton escapes, by jumping on the roof of a car leaving a parking garage and riding it into the street, where he falls off and runs off.\n\nBegbie then visits Spud to find out where Mark is hiding, and discovers that Spud (who is working for Simon, renovating the top floor of Port Sunshine which is to be used as Veronika's \"leisure club\") is writing down pages of reminiscences of events from years prior featuring Mark, Simon and the others. Veronika coincidentally visits Spud at the same time. Using Veronika’s mobile phone, Begbie deceives both Simon and Mark, texting both independently and requesting they meet at Simon's pub. Veronika and Spud, using Spud’s forgery skills which he discovered whilst in jail, move the funding money to Veronika’s bank account. Veronika asks Spud to go away with her. Spud refuses. Veronika offers Spud half of the money, and Spud refuses this, saying that he is a junkie and would only spend it on drugs, and instead bequeaths it to Gail and Fergus. Simon and Mark meet at the specified time just as Spud arrives to warn them of Begbie’s trap. Before they can escape, Begbie arrives and a fight breaks out, knocking Simon unconscious and chasing Mark upstairs, where he reveals that he once murdered a man whilst thinking about Mark and his betrayal 20 years earlier, explaining the 20-year prison sentence. Mark escapes into the roof space, Begbie follows and pushes him off, resulting in Mark getting his neck caught in cables, and he begins choking to death as Begbie watches. Simon and Spud both save Mark after attacking Begbie, who then pulls out a shotgun and prepares to shoot Mark and Simon, but Spud knocks him unconscious with a toilet bowl.\n\nMark, Simon and Spud, finally fed up with Begbie, deposit him back to the doors of the prison in a car boot. Veronika keeps the money she stole off Simon and Mark, returning to Bulgaria to reunite with her son. Spud begins a new career as a writer, and his writings form the basis of a book. Mark reconciles his friendship with Simon and moves back into his parent’s home, embracing his father before going into his bedroom and playing \"Lust for Life\" on his record player.",
  "synopsis": "The film opens with Mark Renton (Ewan McGregor) running on a treadmill at the gym. He sees flashes of himself in his younger days, and as he's distracted, he slips off the treadmill and goes unconscious.We see a clip of Mark as a child with his best friends Simon \"Sick Boy\" Williamson (Jonny Lee Miller), Daniel \"Spud\" Murphy (Ewen Bremner), and Francis \"Franco\" Begbie (Robert Carlyle) as they play football on the streets with other kids from their neighborhood.In the present day, Franco meets with his lawyer, Stoddart (Steven Robertson), who tells him that his parole has been denied due to his violent nature. Franco insults Stoddart for bringing him bad news. The lawyer is ready to push the yellow buzzer button under the table for the guards outside the room to come in to restrain him, which Franco can see. He then lunges at Stoddart.Meanwhile, Spud is in a group meeting for drug addicts, as he is still unable to kick his heroin addiction. He tells everyone how because he didn't realize it was daylight savings time, he was an hour late for work and was fired, then an hour late to everything else in the day, including a custody hearing between him and his former partner Gail (Shirley Henderson). Spud cares deeply about their son, \"Wee\" Fergus, but Gail won't let Spud stay in their lives due to his habits.Elsewhere, Simon approaches a businessman named Tulloch (Gordon Kennedy) in his car. He shows Tulloch a flash drive containing a video of Tulloch getting penetrated by a prostitute, who is really Simon's Bulgarian girlfriend Veronika (Anjela Nedyalkova). Simon blackmails Tulloch for money or else he will show the video to Tulloch's wife. Simon has also developed a serious cocaine habit.Mark returns home to Edinburgh, Scotland for the first time in 20 years since he stole money from Franco and left £4,000 to Spud. Mark visits his father (James Cosmo), who tells Mark that his mother had passed away in his absence. She had always hoped Mark would return.Spud writes a letter to Gail and Fergus to apologize for his screw-ups and say he only wants to see them smile again. Mark goes by his apartment and breaks part of the door off to see Spud attempting to suffocate himself with a plastic bag over his head. Mark kicks the door down and helps Spud as he pukes inside the bag. Mark rips the bag open and saves Spud. However, Spud isn't happy to see Mark after the last time they saw each other. Even after Mark left Spud with the money, Spud wasted a lot of it on smack. He's angry with Mark for ruining his life, and now his death.Franco is in the hospital after getting an inmate to stab him in the abdomen. When he is left alone in his room, Franco leaves and knocks out a doctor to escape the hospital undetected.Mark goes to the Port Sunshine pub that Simon runs. There is only one other patron there. Mark wants to make amends with Simon, but he is also not very pleased to see Mark again. The two start fighting violently around the pub until they're both hurt and tired. Simon later talks to Veronika about running into Mark again. He plans to bring him into their venture to create a \"sauna\" (brothel), but Simon is only using Mark under the pretense of friendship.Franco returns to his old home to find his wife June (Pauline Turner) startled to see him again. He then sees his son, Frank Jr (Scot Greenan), older than the last time Franco saw him. He embraces his son and learns he has applied to go to university. Franco later tries to have sex with June but he cannot maintain his endurance.Mark takes Spud running up Arthur's Seat in an effort to help his friend kick his addiction. He later goes to Simon's house as he's watching a bizarre music video. Mark admits he previously lied about having two kids, although he is going through a divorce and is losing his job. Mark also mentions having a metal plate in his chest after suffering an episode, and after doctors told him it would last him 30 years, he had a crisis about what he would do with another 30 years of life.Franco takes Frank Jr. with him to burgle houses and then bring some of the stolen goods to Franco's old mate Mikey Forrester (Irvine Welsh), who has moved up in the world since he last saw Franco and the other guys.Mark, Simon, and Veronika drive out to Glasgow to the 1690, a unionist pub. Veronika stays in the car while Mark and Simon go around picking peoples' cards out of their coats. They try to leave, but the pub owner tells them they can't leave without singing a song. The two awkwardly go up as Simon sits to play the piano. Mark makes up lyrics about the Battle of the Boyne, which gets the crowd cheering and uproarious as Mark sings about \"there were no more Catholics left\". He and Simon then leave feeling victorious. They and Veronika then continue to bond over their business venture and shared interests. Veronika jokes that Mark and Simon should just fuck each other, but also notes that they are stuck living in the past.Franco learns that Frank Jr. wants nothing to do with his criminal activities and would prefer to go to uni. Franco insults his son and tries to egg him on to hit him, but Frank Jr. never makes a move, leading Franco to continue insulting him.Simon gets arrested when one of his blackmailing victims comes forward to the police. He calls Mark for help getting a lawyer. Mark and Veronika visit Mark's old girlfriend Diane Coulston (Kelly MacDonald) to get Simon out. Diane asks Mark if he and Simon are still doing heroin. When they finish the meeting, Diane privately tells Mark that Veronika is too young for him.After Simon gets out, he is visited at the pub by Franco. They discuss Mark and getting back at him while doing lines of cocaine.Mark spends time with Veronika on his own as he is attracted to her, and she prefers his company over Simon's, even though she says she may like Simon more than he likes himself. Veronika asks Mark over dinner about his \"Choose Life\" shirt. He then goes into an updated \"Choose Life\" monologue that becomes very passionate. Veronika says she likes Mark, and they later go home and have sex.Meanwhile, Spud is making active efforts to better himself. He takes up boxing lessons, cleans out his belongings, and has even written down stories based on his experiences with his friends.Mark, Simon, and Spud go by a location their late friend Tommy MacKenzie took them to in their younger days. Simon blames Mark for Tommy's death as it was he that introduced Tommy to heroin. Mark fires back by reminding Simon of how his addiction led to the death of his baby Dawn, and how she would have been a woman now. Simon is left silent.Mark and Simon go to the European Union to pitch their Port Sunshine venture for a loan of 100,000 pounds. They succeed in getting the money. They later do heroin for the first time in years.The guys go to a nightclub. Mark goes to use the toilet, and doesn't know Franco is in the stall next to him. Franco drops his viagra pills into Mark's stall, and they exchange banter as they slowly realize they are speaking to each other. Mark runs like hell out of the club as Franco gives chase. He follows Mark to a parking garage. Mark hops on top of a van as it is driving away. Franco slashes Mark's arm as the van passes, but Mark still manages to escape him.Mark and Simon are approached on the streets by a rival sauna owner in the area. He takes the two to the woods and forces them to strip naked and abandon their sauna venture so as to not have competition. Mark and Simon must go home nude until they pass a barn and take wrapping to cover themselves.Franco visits Spud to learn of Mark's whereabouts. He discovers Spud's memoirs, including the incident in the first film where Franco chucked a glass at a woman's face and pretended it wasn't him. Franco also learns about the money that Mark left Spud. Veronika then visits Spud as she has been helping him out as well. Franco threatens them both but lets Veronika leave once she gives him her phone. Franco texts Mark and Simon to make it look like Veronika is asking to meet them both at the pub. Franco later visits June and Frank Jr. one last time, knowing they probably won't see him for a long time after this.Mark and Simon go ahead to the pub, not knowing they were both called there. Spud runs in to try and warn them of Franco, but it's too late. Franco fights his old friends and knocks Simon out before he chases Mark upstairs. Mark tries to appeal to Franco by reminding him of when they met as children. Mark tries to escape over the open ceiling, only for Franco to push him through and cause him to get his neck wrapped in wires, leaving him hanging. Franco goes to finish Mark off, only for Simon to spray something in Franco's face, and finally having Spud knock Franco out with a toilet. They help Mark down and put Franco's body in the trunk of their car so they can return him to prison.Veronika tries to convince Spud to go away with her and to take the money from Mark and Simon. Spud says he'd only use his money on drugs, but he wants to leave his money to Gail and Fergus. Using his forgery skills, he has their money transferred to another account, so Veronika can return to Bulgaria to reunite with her son and mother.In the final scenes, Spud decides to write his memoirs into a book, which he has Gail read first. Mark and Simon, meanwhile, have repaired their friendship. Mark goes back home to be with his father. He goes into his old bedroom and plays \"Lust For Life\" on his record player."
}