{
  "imdb_id": "tt2752758",
  "tmdb_id": "79316",
  "douban_id": null,
  "title": "Devil's Due (2014)",
  "genres": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "89 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.1,
  "director": [
    {
      "id": "nm2366012",
      "name": "Matt Bettinelli-Olpin"
    },
    {
      "id": "nm2419470",
      "name": "Tyler Gillett"
    }
  ],
  "writer": [
    {
      "id": "nm2303288",
      "name": "Lindsay Devlin",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm1935292",
      "name": "Allison Miller",
      "character": "Samantha McCall"
    },
    {
      "id": "nm1472917",
      "name": "Zach Gilford",
      "character": "Zach McCall"
    },
    {
      "id": "nm0027402",
      "name": "Sam Anderson",
      "character": "Father Thomas"
    },
    {
      "id": "nm2244640",
      "name": "Roger Payano",
      "character": "Cab Driver"
    },
    {
      "id": "nm2326075",
      "name": "Vanessa Ray",
      "character": "Suzie"
    },
    {
      "id": "nm0930061",
      "name": "Bill Martin Williams",
      "character": "Ken"
    },
    {
      "id": "nm1046808",
      "name": "Geraldine Singer",
      "character": "Sally"
    },
    {
      "id": "nm1632542",
      "name": "Julia Denton",
      "character": "Natalie"
    },
    {
      "id": "nm1240176",
      "name": "Colin Walker",
      "character": "Stanley"
    },
    {
      "id": "nm4068901",
      "name": "Madison Wolfe",
      "character": "Brittany"
    },
    {
      "id": "nm6215331",
      "name": "Joshua Shane Brooks",
      "character": "Braedon"
    },
    {
      "id": "nm2948025",
      "name": "Aimee Carrero",
      "character": "Emily"
    },
    {
      "id": "nm0069699",
      "name": "Robert Belushi",
      "character": "Mason"
    },
    {
      "id": "nm6215332",
      "name": "DeMaris Gordon",
      "character": "Psychic"
    },
    {
      "id": "nm1251245",
      "name": "Donna Duplantier",
      "character": "Dr. J. Ludka"
    },
    {
      "id": "nm0008622",
      "name": "Robert Aberdeen",
      "character": "Dr. Dylan"
    },
    {
      "id": "nm1579913",
      "name": "Catherine Kresge",
      "character": "Tina"
    },
    {
      "id": "nm4852204",
      "name": "Kurt Krause",
      "character": "Jay"
    },
    {
      "id": "nm4731168",
      "name": "Tyler Forrest",
      "character": "Steve"
    },
    {
      "id": "nm5538404",
      "name": "Sloane Coe",
      "character": "Ashley"
    },
    {
      "id": "nm0660244",
      "name": "Michael Papajohn",
      "character": "Officer Miska"
    },
    {
      "id": "nm0341174",
      "name": "Douglas M. Griffin",
      "character": "Detective Zeman"
    },
    {
      "id": "nm0835820",
      "name": "Nicole Stuart",
      "character": "Lamaze Instructor"
    },
    {
      "id": "nm2791723",
      "name": "Yohance Myles",
      "character": "Jim"
    },
    {
      "id": "nm0205488",
      "name": "Stacie Davis",
      "character": "Karen"
    },
    {
      "id": "nm2264576",
      "name": "Annie Gaia",
      "character": "Club Girl"
    },
    {
      "id": "nm3812343",
      "name": "Sylvia Grace Crim",
      "character": "Nurse"
    },
    {
      "id": "nm1827574",
      "name": "Jennifer Schemke",
      "character": "Mother in Market"
    },
    {
      "id": "nm6215333",
      "name": "Hunter Lobre",
      "character": "Boy in Market"
    },
    {
      "id": "nm2431775",
      "name": "Candi Brooks",
      "character": "Wedding Guest"
    },
    {
      "id": "nm4615827",
      "name": "Derek Hall",
      "character": "Wedding Guest"
    },
    {
      "id": "nm5648209",
      "name": "Katherine Grace Yeaton",
      "character": "Communion Girl       (as Katherine Yeaton)"
    },
    {
      "id": "nm6198257",
      "name": "Justyna Kelley",
      "character": "Paris Wife"
    },
    {
      "id": "nm3822235",
      "name": "Shane Woodward",
      "character": "Paris Husband"
    },
    {
      "id": "nm6215334",
      "name": "Maverick",
      "character": "Maverick"
    }
  ],
  "overview": "An unexpected pregnancy takes a terrifying turn for newlyweds Zach and Samantha McCall.",
  "storyline": "After a mysterious, lost night on their honeymoon, a newlywed couple finds themselves dealing with an earlier-than-planned pregnancy. While recording everything for posterity, the husband begins to notice odd behavior in his wife that they initially write off to nerves, but, as the months pass, it becomes evident that the dark changes to her body and mind have a much more sinister origin.",
  "plot": "A young couple, Zach and Samantha McCall, have recently married and have gone to the Dominican Republic for their honeymoon. During Carnival, the couple meet a fortune teller (DeMaris Gordon), who repeats to Sam \"they've been waiting\", to which they quickly leave. As they leave, they see the character who leads the cult that will ensnare them. They find themselves lost on an unknown street they do not remember seeing and are offered a lift from a pushy cab driver (Roger Payano), who offers to take them to a local bar dotted with strange symbols. The couple reluctantly accepts and after taking various shots, they fall unconscious. Sam is seemingly taken to an underground chamber in the nightclub. There the leader of the cult is seen talking to the cab driver before Sam and Zach are drugged and subjected to a demonic ritual by an unseen force.\n\nThe next morning, Zach and Sam wake in their hotel with no memory of the previous night.\n\nA couple of weeks after the honeymoon, Sam discovers she's pregnant despite claiming to have taken birth control pills \"religiously\" ever since the wedding. Though shocked, Zach and Samantha are overjoyed and tell their family and friends the news. The couple later attend their first ultrasound scan where the doctor says that the baby looks healthy and Sam is due by the end of March. At that moment, the ultrasound screen goes static but recovers after a moment. Throughout the course of her pregnancy, Sam begins to experience nosebleeds, stomach bruising, cravings for raw meat (despite being a vegetarian) superhuman strength, telekinetic abilities and unexplained feelings of rage whenever she or the baby appear to be threatened. Also, Zach and Sam keep seeing odd-looking people watching them from afar. Sam becomes convinced something is seriously wrong with the baby and that they are being watched. After a second visit to the doctor, a new doctor (Robert Aberdeen) appears and performs an amnio after Sam appears nauseous. He has no answer as to the whereabouts of their original doctor.\n\nBefore the couple return home, masked men who are part of the cult set up hidden cameras to monitor her progress and make sure she doesn't hurt the baby.\n\nWhen Sam is eight months pregnant, the couple attend a holy communion at their church. Their usually friendly niece (Madison Wolfe) is oddly scared of Sam now and the priest (Sam Anderson) who officiated Zach and Sam's wedding looks at Sam during the service and violently coughs up blood. Later at home, when Zach is reviewing the communion footage he filmed, he sees the mysterious cab driver sitting in a pew. He visits the priest in the hospital, who explains the symbol is related to summoning the Antichrist. Zach decides to investigate the symbol further and asks his sister, Suzie to stay with Sam. He breaks in to an apparently abandoned house at the end of his street where he finds the CCTV footage of his house and the missing ultrasound. He is almost caught by the house's inhabitants who appear to be performing a ritual. Zach barely manages to escape.\n\nWhen he does, he sees their second doctor, the man who was watching their house, the cult leader and the cab driver who picked him up among the worshipers performing the ritual.\n\nUpon returning home, Zach finds the house surrounded by the masked men who have been watching them all along. Inside, he finds Suzie dead and hears Sam scream as the house is being destroyed by some unseen force. He finds Sam in the baby's nursery standing in a trance-like state with a knife to her stomach. Zach screams for her to stop, but she presses the knife to her stomach anyway and there is a violent blast of light. When Zach recovers, he finds Sam lying in her own blood with her stomach cut. She cries and wonders if the baby is all right before dying. Zach breaks down in grief before the cab driver and the second doctor appear. Zach begs the intruders to leave them alone, but the doctor takes the baby regardless. Zach is then arrested and is being interrogated by the police about the death of his wife and sister and disappearance of his child.\n\nThe ending shows another young couple, on their honeymoon in Paris, where the same cab driver offers a lift.",
  "synopsis": null
}