{
  "imdb_id": "tt2736254",
  "tmdb_id": "195389",
  "douban_id": null,
  "title": "Absence (2013)",
  "genres": [
    "Horror",
    "Sci-Fi",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.1,
  "director": [
    {
      "id": "nm5383493",
      "name": "Jimmy Loweree"
    }
  ],
  "writer": [
    {
      "id": "nm2206576",
      "name": "Jake Moreno",
      "description": "screenplay"
    },
    {
      "id": "nm5383493",
      "name": "Jimmy Loweree",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm2338525",
      "name": "Erin Way",
      "character": "Liz"
    },
    {
      "id": "nm0558426",
      "name": "Eric Matheny",
      "character": "Rick"
    },
    {
      "id": "nm3494534",
      "name": "Ryan Smale",
      "character": "Evan"
    },
    {
      "id": "nm5102659",
      "name": "Stephanie Scholz",
      "character": "Megan"
    },
    {
      "id": "nm1887575",
      "name": "Tamra Meskimen",
      "character": "Dr. Young"
    },
    {
      "id": "nm0657314",
      "name": "David Paladino",
      "character": "Sergeant Wilson"
    },
    {
      "id": "nm0122759",
      "name": "Lee Burns",
      "character": "Sergeant Langley"
    },
    {
      "id": "nm2882751",
      "name": "Linda Paice",
      "character": "Nurse Moreno"
    },
    {
      "id": "nm3511834",
      "name": "Michael Angelo Covino",
      "character": "Randy Kessler"
    },
    {
      "id": "nm5546072",
      "name": "Don Moss",
      "character": "Frank"
    }
  ],
  "overview": "Doctors are baffled when an expectant mother wakes to find her nearly-to-term pregnancy apparently disappear overnight. Police investigate the situation as a missing child, and only her husband and brother trust her version of events.",
  "storyline": "Doctors are baffled when a young expectant mother wakes to find her nearly-to-term pregnancy apparently disappear overnight. The police are investigating the situation as a missing child, and only her husband and brother trust her version of events.",
  "plot": null,
  "synopsis": "Expectant mother Liz (Erin Way) wakes to find her nearly-to-term pregnancy has disappeared overnight. When doctors can find no medical explanation for the loss, police treat Liz and her husband Rick (Eric Matheny) as prime suspects in what has now become a missing child case or an inconceivale late stage abortion. Only Rick and Lizs brother, Evan (Ryan Smale) trust her version of events. As word spreads, the young couple is subjected to the unwanted attention of the police and prying neighbors. Evan feels for his sister and, as a film student, begins documenting her story. Even though he cant prove Lizs innocence, he sets out to tell her side of what happened and to set the record straight. To relieve some of Lizs grief, Rick and Evan take her on a vacation to the mountains. Evan meets a local girl named Megan (Stephanie Scholz) and the two hit it off. Things begin to settle down and Lizs spirits even start to improve. But as Evan continues documenting their vacation, unusual patterns arise. Liz still has no real answers for the disappearance of her baby despite his interviews and questions. Evan and Rick are horrified when her condition visibly declines. No one can ignore the fact that something is very wrong with Liz. When the trip spins out of control they realize that whatever happened with Liz and her baby isnt over. None of them are safe."
}