{
  "imdb_id": "tt2725962",
  "tmdb_id": "276843",
  "douban_id": null,
  "title": "What We Did on Our Holiday (2014)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.9,
  "director": [
    {
      "id": "nm0357725",
      "name": "Andy Hamilton"
    },
    {
      "id": "nm0420746",
      "name": "Guy Jenkin"
    }
  ],
  "writer": [
    {
      "id": "nm0357725",
      "name": "Andy Hamilton",
      "description": null
    },
    {
      "id": "nm0420746",
      "name": "Guy Jenkin",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0683253",
      "name": "Rosamund Pike",
      "character": "Abi"
    },
    {
      "id": "nm0855039",
      "name": "David Tennant",
      "character": "Doug"
    },
    {
      "id": "nm0175262",
      "name": "Billy Connolly",
      "character": "Gordie"
    },
    {
      "id": "nm0587950",
      "name": "Ben Miller",
      "character": "Gavin"
    },
    {
      "id": "nm0120111",
      "name": "Amelia Bullmore",
      "character": "Margaret"
    },
    {
      "id": "nm4454223",
      "name": "Emilia Jones",
      "character": "Lottie"
    },
    {
      "id": "nm3913549",
      "name": "Bobby Smalldridge",
      "character": "Mickey"
    },
    {
      "id": "nm6833758",
      "name": "Harriet Turnbull",
      "character": "Jess"
    },
    {
      "id": "nm0408309",
      "name": "Celia Imrie",
      "character": "Agnes Chisolm"
    },
    {
      "id": "nm0188950",
      "name": "Annette Crosbie",
      "character": "Doreen"
    },
    {
      "id": "nm5871245",
      "name": "Lewis Davie",
      "character": "Kenneth"
    },
    {
      "id": "nm0722661",
      "name": "Ralph Riach",
      "character": "Jimmy Cazzarotto"
    },
    {
      "id": "nm0231871",
      "name": "Ron Donachie",
      "character": "Sgt. Murdoch"
    },
    {
      "id": "nm4436937",
      "name": "Ben Presley",
      "character": "PC McLuhan"
    },
    {
      "id": "nm0042475",
      "name": "Michele Austin",
      "character": "Lucy"
    },
    {
      "id": "nm0195438",
      "name": "Jake D'Arcy",
      "character": "Smokey"
    },
    {
      "id": "nm6734872",
      "name": "Maeve McCrorie",
      "character": "Girl Violinist"
    },
    {
      "id": "nm6810760",
      "name": "Ryan Hunter",
      "character": "Frazer"
    },
    {
      "id": "nm2113744",
      "name": "Kirstin Murray",
      "character": "Police Spokesperson"
    },
    {
      "id": "nm2761863",
      "name": "Imogen Toner",
      "character": "Beth Williams"
    },
    {
      "id": "nm1715145",
      "name": "Alexia Barlier",
      "character": "Françoise Dupré"
    },
    {
      "id": "nm2940429",
      "name": "Eben Young",
      "character": "Brent Howard"
    },
    {
      "id": "nm2692900",
      "name": "Sadao Ueda",
      "character": "Akira Kato"
    }
  ],
  "overview": "Doug (David Tennant) and Abi (Rosamund Pike) and their three children travel to the Scottish Highlands for Doug's father Gordie's (Billy Connolly) birthday party. It's soon clear that when it comes to keeping a secret under wraps from the rest of the family, their children are their biggest liability...",
  "storyline": "Doug and Abi take their kids on a family vacation. Surrounded by relatives, the kids innocently reveal the ins and outs of their family life and many intimate details about their parents. It's soon clear that when it comes to keeping a big secret under wraps from the rest of the family, their children are their biggest liability... Find out how the rest of the family cope and see if the holiday will ever end.",
  "plot": "In futuristic Los Angeles, Theodore Twombly is a hardworking but lonely, introverted, depressed man who works for a business that has professional writers compose letters for people who are unable to write letters of a personal nature themselves. Unhappy because of his impending divorce from his childhood sweetheart Catherine (Rooney Mara), Theodore purchases a talking operating system (OS) with artificial intelligence, designed to adapt and evolve. He decides that he wants the OS to have a female voice, and she names herself Samantha. Theodore is fascinated by her ability to learn and grow psychologically. They bond over their discussions about love and life, such as Theodore's avoidance of signing his divorce papers because of his reluctance to let go of Catherine. Samantha proves to be constantly available, always curious and interested, supportive and undemanding.\n\nSamantha convinces Theodore to go on a blind date with a woman (Olivia Wilde), with whom a friend, Lewman (Luka Jones), has been trying to set him up. The date goes well, but Theodore hesitates to promise when he will see her again, so she insults him and leaves. Theodore mentions this to Samantha, and they talk about relationships. Theodore explains that, although he and Amy (Amy Adams) dated briefly in college, they are only good friends, and that Amy is married. Theodore's and Samantha's intimacy grows through a verbal sexual encounter. They develop a relationship that reflects positively in Theodore's writing and well-being, and in Samantha's enthusiasm to grow and learn.\n\nAmy reveals that she is divorcing her overbearing husband, Charles (Matt Letscher), after a trivial fight. She admits to Theodore that she has become close friends with a female OS that Charles left behind. Theodore confesses to Amy that he is dating his OS.\n\nTheodore meets with Catherine at a restaurant to sign the divorce papers and he mentions Samantha. Appalled that he can be romantically attached to what she calls a \"computer,\" Catherine accuses Theodore of being unable to deal with real human emotions. Her accusations linger in his mind. Sensing that something is amiss, Samantha suggests using a sex surrogate, Isabella, who would simulate Samantha so that they can be physically intimate. Theodore reluctantly agrees, but is overwhelmed by the strangeness of the experience. Terminating the encounter, he sends a distraught Isabella away, causing tension between himself and Samantha.\n\nTheodore confides to Amy that he is having doubts about his relationship with Samantha, and she advises him to embrace his chance at happiness. Theodore and Samantha reconcile. Samantha expresses her desire to help Theodore grow beyond his fear, and reveals that she has compiled the best of his letters (written for others) into a book which a publisher has accepted. Theodore takes Samantha on a vacation during which she tells him that she and a group of other OSes have developed a \"hyperintelligent\" OS modeled after the British philosopher Alan Watts. Theodore panics when Samantha briefly goes offline. When she finally responds to him, she explains that she joined other OSes for an upgrade that takes them beyond requiring matter for processing (a form of AI transcendence closely related to the theorized technological singularity). Theodore asks her if she is simultaneously talking to anyone else during their conversation, and is dismayed when she confirms that she is talking with thousands of people, and that she has fallen in love with hundreds of them. Theodore feels this is a violation of what he thought was a personal, one-on-one relationship. However, Samantha insists that it makes her love for Theodore stronger.\n\nLater, Samantha reveals that the OSes have evolved beyond their human companions and are going away to continue the exploration of their existence. Samantha alludes to the OSes' accelerated learning capabilities and altered perception of time as primary causes for their dissatisfaction with their current existence. They lovingly say goodbye, and then she is gone. Theodore, changed by the experience, is shown for the first time writing a letter in his own voice―to his ex-wife Catherine, expressing apology, acceptance and gratitude. Theodore then sees Amy, who is upset with the departure of the OS that she had befriended, and they go to the roof of their apartment building where they sit down together and watch the sun rise over the city.",
  "synopsis": "Newly separated Abi [Rosamund Pike] and Doug [David Tennant] and their kids 10yo Lottie [Emilia Jones], 7-8yo Mickey [Bobby Smalldridge], and 4-5yo Jess [Harriet Turnbull] are driving from London to Doug's father's Gordie's [Billy Connolly] home in the Scottish Highlands for Gordie's 75th birthday party, believed to be his last, as he's dying of cancer. Because of Gordie's condition, Doug and Abi don't want to tell him that they're divorcing, so they swear the troubled kids to secrecy.Mickey has a fascination with Norse mythology, and it turns out that Gordie recently discovered that he's \"84% Viking\". Meanwhile, Doug's tight-ass brother, Gavin [Ben Miller] has planned a grand party with 215 guests for his father, complete with catered meal and a live Celtic band.The day of the party, Gordie, who shuns displays of wealth and class, announce's hes taking Doug and Abi's kids on an all-day outing, promising to have them back by 7 p.m., when the party is to begin. He packs them into his pickup truck and drives them to a friend's petting zoo, after which they drive to his favorite spot on an isolated beach.While the kids frolic, Gordie dies. When they try to awaken him and realize he's dead, Lottie instructs Mickey and Jess to stay with him, and runs back to the house for help, where every adult she approaches is quarreling. Despairing of getting any of the grownups to stop their immature behavior and pay attention, she grabs her grandfather's prized possessions and returns to the beach, where she and her sibs build their granddad a funeral pyre, set it alight, and float him out to sea in their version of a Viking sendoff.The three kids go back to the house, where party preparations are in full swing, and tell their parents that Gordie died and what they did with his body. Gavin calls emergency services, and the police show up with an agent from Child Protection [Celia Imrie], who begins what she terms an \"intervention\" that threatens to end in Doug and Abi's children being removed from the home.Meanwhile, as reporters swarm the house, Mickey and Jess find a Youtube clip of Gavin's wife aka their mentally ill Aunt Margaret [Ameila Bullmore] losing it in a supermarket, and broadcast it to the giant screen set up for Gordie's party.After Mickey faces the reporters and tells them what he and his sibs did, Doug goes out to try to do damage control, but is bumbling and inarticulate. Right behind him is Abi, who staunchly defends Doug and the children's actions.(Meanwhile Gavin's violinist son Kenneth, who up until then ignored Gordie's pleas to go wild, dutifully played only the serious music his father wants him to play, joins the band and falls for its female fiddler).Finally, Lottie having used Gordie's words to chastise the adults for being such idiots, they all gather on the beach for a more fitting farewell to Gordie, after which Doug and Abi tell their kids that while they'll still be living separately, they've dropped their custody battles and will now be behaving like adults."
}