{
  "imdb_id": "tt2748546",
  "tmdb_id": "227974",
  "douban_id": null,
  "title": "Bushido Man (2013)",
  "genres": [
    "Action"
  ],
  "country": "Japan",
  "version": [],
  "imdb_rating": 5.5,
  "director": [
    {
      "id": "nm2764304",
      "name": "Takanori Tsujimoto"
    }
  ],
  "writer": [
    {
      "id": "nm2764304",
      "name": "Takanori Tsujimoto",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1891620",
      "name": "Mickey Koga",
      "character": "Toramaru       (as Mitsuki Koga)"
    },
    {
      "id": "nm0945368",
      "name": "Yoshiyuki Yamaguchi",
      "character": "Gensai"
    },
    {
      "id": "nm2266683",
      "name": "Masanori Mimoto",
      "character": "Eiji Mimoto 'Yakuza'"
    },
    {
      "id": "nm2416221",
      "name": "Kentarô Shimazu",
      "character": "Billy Shimabukuro 'Gun Master'"
    },
    {
      "id": "nm1491241",
      "name": "Kazuki Tsujimoto",
      "character": "Muso 'Blind Samurai'"
    },
    {
      "id": "nm3510869",
      "name": "Ema",
      "character": "Denko"
    },
    {
      "id": "nm2338317",
      "name": "Kensuke Sonomura",
      "character": "Yuan Jian 'Kung Fu Master'"
    },
    {
      "id": "nm2337569",
      "name": "Masaki Suzumura",
      "character": "Rinryu 'Nunchaku Master'"
    },
    {
      "id": "nm2337651",
      "name": "Naohiro Kawamoto",
      "character": "Mokunen 'Bojutsu Master'"
    },
    {
      "id": "nm2504122",
      "name": "Marc Walkow",
      "character": "Boss 'Bounty Hunter'"
    },
    {
      "id": "nm2643798",
      "name": "Yasutaka Yûki",
      "character": "Yu 'Bounty Hunter'"
    },
    {
      "id": "nm4911186",
      "name": "Takashi Tanimoto",
      "character": "Tani 'Bounty Hunter'"
    },
    {
      "id": "nm5077668",
      "name": "Taiju Nemoto",
      "character": "Nemo 'Bounty Hunter'"
    },
    {
      "id": "nm2764304",
      "name": "Takanori Tsujimoto",
      "character": "Yakuza Brother"
    },
    {
      "id": "nm0594684",
      "name": "Miki Mizuno",
      "character": "M"
    }
  ],
  "overview": "Toramaru, lord of integrated martial arts Mugen-ga-ryu, ends his training journey and visits his master, Gensai. \"You have to duel with every martial arts master and win, in order to obtain their esoteric books of martial secrets.\" Receiving such an order from Gensai, Toramaru makes a pilgrimage around Japan and spends a year fighting. Through his fights with genuine masters in every martial arts such as kung-fu, stick fighting, sword fighting, and nunchaku, this film passionately tells what \"Budo\" is and what Bushido is. Full of fierce and diverse action! The original fighting movie is finally born here!",
  "storyline": "Toramaru, lord of integrated martial arts Mugen-ga-ryu, ends his training journey and visits his master, Gensai. \"You have to duel with every martial arts master and win, in order to obtain their esoteric books of martial secrets.\" Receiving such an order from Gensai, Toramaru makes a pilgrimage around Japan and spends a year fighting. Through his fights with genuine masters in every martial arts such as kung-fu, stick fighting, sword fighting, and nunchaku, this film passionately tells what \"Budo\" is and what Bushido is. Full of fierce and diverse action! The original fighting movie is finally born here!",
  "plot": "This section's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (August 2016) (Learn how and when to remove this template message)\nIn late medieval Japan, Kai is a half-Japanese, half-English outcast who lives in the Akō Domain, which is ruled by the benevolent Lord Asano Naganori. When Kai was young, Asano found him lost in the forest and accepted him into his household. Kai and Asano's daughter, Mika, eventually fall in love despite Kai being scorned by her father's samurai due to his lowborn status and mixed ancestry.\n\nBefore a planned visit from Shogun Tokugawa Tsunayoshi, Asano is visited by the Shogun's master of ceremonies, Lord Kira, who wants to take Akō for himself. Kira enlists the help of a shapeshifting Kitsune named Witch who sends a Kirin to kill Asano in the forest of Ako. Asano's samurai struggle in their battle with the monster so Kai joins in riding an abandoned horse. As the monster charges him, Kai recovers a lost sword that he uses to slay it. Shortly thereafter he spots a white fox with different coloured eyes watching from the underbrush—Witch in her fox form. Later during the Shogun's visit, Kai sees that one of the Shogun's concubines has the same multi-colored eyes, leading him to assume that she is the fox from the forest. He tries to warn Asano's principal counselor and samurai, Oishi, that she is a witch but Oishi doesn't believe him.\n\nLater, Kira arranges a duel for the entertainment of the Shogun: Kira's best warrior, the giant Golem Samurai, will battle a warrior of Asano's choosing. However, before the duel begins, Witch uses her magic to incapacitate Asano's combatant. Kai secretly dons his armor and fights in his stead, but his disguise is revealed and the Shogun orders him severely beaten as punishment. Later that night, Witch uses her magic to make Asano believe that Kira is raping Mika, causing him to attack an unarmed Kira in his delirium. Asano is sentenced to death for attacking a Shogunate official (which is a capital offense), though the Shogun allows him to die with honor through seppuku. The Shogun then gives Kira both the Akō domain and Mika, although he grants Mika one year to mourn the death of her father before marrying Kira. The Shogun also brands Oishi and his men ronin and forbids them from seeking vengeance for Asano's death. To ensure that the ronin do not interfere with his takeover plans, Kira imprisons Oishi in an outdoor pit to break his spirit.\n\nNearly a year later, Oishi is released by Kira's men. He now knows that Kira is guilty of treachery for using Witch's sorcery to cause Asano's downfall. Oishi reunites with his family and asks his son Chikara to aid him in reuniting the scattered ronin. They learn that Kai has been sold into slavery and Oishi rescues him from the fighting pits of the Dutch colony of Dejima. Kai leads them to the Tengu Forest, a mystical place he escaped from as a child, so that they can find swords for themselves. Kai instructs Oishi to never draw his sword while in the Tengu temple and continues alone to another room to face the Tengu Master, who once trained Kai in their fighting ways. While Kai confronts the Tengu Master in a battle of wills, Oishi watches an illusion of his men being slaughtered by the Tengu, during which he fights the urge to draw his own sword. With Kai and Oishi both successful in their Tengu challenges, the ronin are given Tengu swords.\n\nArmed with their new weapons, the ronin plan to attack Kira on his pilgrimage to a shrine where he seeks blessings for his wedding to Mika. However, Kira's procession is a trap and the ronin are ambushed by Kira's forces, led by Witch and the Lovecraftian Samurai[further explanation needed]. Several of the ronin are killed, and Witch, thinking they are all dead, takes Oishi's sword and presents it to Kira as a trophy. Witch later taunts Mika with their deaths and attempts to manipulate her into committing suicide from despair.\n\nOishi and Kai (having actually survived the attack) rally the surviving ronin. Oishi, Kai, and half of the ronin infiltrate Kira's castle by disguising themselves as a band of traveling wedding performers loyal to the memory of Lord Asano. With Kira's men distracted during the performance, the remaining ronin scale the castle walls, and the reunited groups start to battle with Kira's men. While Oishi fights Kira, Kai and Mika are attacked by the Witch, who shape-shifts into a dragon. Kai uses his sword and draws on the mystical powers of the Tengu to finally kill her. After gutting him, Oishi emerges with Kira's severed head and Kira's men surrender.\n\nAfter winning the battle, the ronin (including Kai) surrender themselves to Shogunate authority and are sentenced to death as they explicitly violated the Shogun's prohibition on avenging Asano. However, the Shogun finds that they followed the principles of Bushido in their actions and, therefore, restores their honor as samurai. Thus, instead of being executed as criminals, the ronin are allowed to perform seppuku. They are also given the honor of burial with their master, Lord Asano. The Shogun gives Akō[further explanation needed] back to Mika, and at the seppuku ceremony, he pardons Oishi's son Chikara so that he may serve Akō[further explanation needed] and preserve Oishi's bloodline for the country.\n\nClosing notes tell us that the tradition of paying respect at the graves of the 47 Ronin continues every year on December 14.",
  "synopsis": null
}