{
  "imdb_id": "tt2847438",
  "tmdb_id": "324440",
  "douban_id": null,
  "title": "Der Bunker (2015)",
  "genres": [
    "Comedy",
    "Drama",
    "Horror"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.3,
  "director": [
    {
      "id": "nm1247940",
      "name": "Nikias Chryssos"
    }
  ],
  "writer": [
    {
      "id": "nm1247940",
      "name": "Nikias Chryssos",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm1460749",
      "name": "Pit Bukowski",
      "character": "Student"
    },
    {
      "id": "nm0295797",
      "name": "Daniel Fripan",
      "character": "Klaus"
    },
    {
      "id": "nm2564365",
      "name": "Oona von Maydell",
      "character": "Mother"
    },
    {
      "id": "nm0770773",
      "name": "David Scheller",
      "character": "Father"
    }
  ],
  "overview": "A student moves in with a family that lives in an underground house in the middle of the forest, far from civilization. His hopes of peace and quiet are soon shattered, when it becomes apparent that both the parents and their son have a screw loose.",
  "storyline": "A young student seeks quiet and solitude to focus on an important work but ends up as the teacher of a peculiar boy who is home-schooled by his parents in an isolated bunker mansion. THE BUNKER is a dark, twisted, and funny tale about childhood, growing up and education.",
  "plot": "The film centers upon a nameless student (Pit Bukowski) who has rented a room at a lake-side home with the expectation that he will find peace and quiet. However, when he arrives, he finds that the room was far from what he was expecting, as the home is actually a bunker, but he chooses to stay despite this. Soon after, his bizarre landlords (Oona von Maydell and David Scheller) begin to insist that he tutor their son Klaus (Daniel Fripan), who they believe will become President of the United States, despite being born in Germany. Stranger still is their insistence that an alien lives within the mother's leg and that Klaus is only 8 years old, despite looking far older.",
  "synopsis": null
}