{
  "imdb_id": "tt2855648",
  "tmdb_id": "215776",
  "douban_id": null,
  "title": "Madras Cafe (2013)",
  "genres": [
    "Action",
    "Drama",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "130 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.8,
  "director": [
    {
      "id": "nm1999473",
      "name": "Shoojit Sircar"
    }
  ],
  "writer": [
    {
      "id": "nm2009626",
      "name": "Shubhendu Bhattacharya",
      "description": "story and screenplay"
    },
    {
      "id": "nm4962323",
      "name": "Juhi Chaturvedi",
      "description": "dialogue"
    },
    {
      "id": "nm5812265",
      "name": "Somnath Dey",
      "description": "story and screenplay"
    },
    {
      "id": "nm1847980",
      "name": "Dusan Tolmac",
      "description": "additional screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm1303433",
      "name": "John Abraham",
      "character": "Vikram Singh"
    },
    {
      "id": "nm3668216",
      "name": "Nargis Fakhri",
      "character": "Jaya Sahni"
    },
    {
      "id": "nm5637317",
      "name": "Raashi Khanna",
      "character": "Ruby       (as Rashi Khanna)"
    },
    {
      "id": "nm5787869",
      "name": "Prakash Belawadi",
      "character": "Bala Krishnan"
    },
    {
      "id": "nm0244865",
      "name": "Avijit Dutt",
      "character": "Swarup"
    },
    {
      "id": "nm5897302",
      "name": "Sanjay Gurbaxani",
      "character": "Former Prime Minister"
    },
    {
      "id": "nm3440031",
      "name": "Dinesh Nair",
      "character": "Rajshekaran"
    },
    {
      "id": "nm5897304",
      "name": "Leena Maria Paul",
      "character": "Tamil rebel"
    },
    {
      "id": "nm3126747",
      "name": "Aayam Mehta",
      "character": "Vasu"
    },
    {
      "id": "nm5897303",
      "name": "Kannan Arunachalam",
      "character": "Shri"
    },
    {
      "id": "nm5787872",
      "name": "Dibang",
      "character": "Informer, bangkok"
    },
    {
      "id": "nm8850112",
      "name": "Vishnu Govindhan",
      "character": "Kidnapper"
    },
    {
      "id": "nm1559782",
      "name": "Ajay Ratnam",
      "character": "Anna Bhaskaran"
    },
    {
      "id": "nm4380888",
      "name": "Tarun Bali",
      "character": "Rishi"
    },
    {
      "id": "nm1504630",
      "name": "Siddartha Basu",
      "character": "Robin Dutt"
    },
    {
      "id": "nm9139831",
      "name": "Rajeev Rajan",
      "character": "LTF Terrorist"
    },
    {
      "id": "nm7753751",
      "name": "K.R. Parmeshwar",
      "character": "Narayan"
    },
    {
      "id": "nm3806318",
      "name": "Steve Fahl",
      "character": "Reed"
    },
    {
      "id": "nm1629074",
      "name": "Alok Jain",
      "character": "Ajit"
    },
    {
      "id": "nm3557638",
      "name": "Vinod Kumar",
      "character": "Informer"
    },
    {
      "id": "nm5897305",
      "name": "Piyush Pandey",
      "character": "Cabinet Secretary of India"
    },
    {
      "id": "nm5787871",
      "name": "Agnello Dias",
      "character": "Sri Lankan minister"
    }
  ],
  "overview": "An Indian Intelligence agent journeys into a war torn coastal island, to break a resolute rebel group. He deftly maneuvers his resources to make significant breakthroughs, amidst a scenario where the enemy has no face and the only counsel is 'Don't get caught.' At various junctions, he meets a charismatic and passionate journalist who is following her will to reflect the truth behind the civil war. The story unfolds as their quest for the truth reveals a deeper conspiracy, by a faceless enemy, united to seize a common nemesis - India.",
  "storyline": "An Indian Intelligence agent (portrayed by John Abraham)[9] journeys into a war torn coastal island, to break a resolute rebel group. He deftly maneuvers his resources to make significant breakthroughs, amidst a scenario where the enemy has no face and the only counsel is 'Don't get caught.' At various junctions, he meets a charismatic and passionate journalist (portrayed by Nargis Fakhri) who is following her will to reflect the truth behind the civil war. The story unfolds as their quest for the truth reveals a deeper conspiracy, by a faceless enemy, united to seize a common nemesis - India.",
  "plot": "The plot opens in Jaffna, where a bus full of passengers is stopped by armed men. They take all of them out and kill them mercilessly. A little girl tries to escape, but is shot and killed immediately.\n\nThe movie then moves to Kasauli, where a bearded man, later revealed to be Vikram Singh (John Abraham) wakes up after having visions of men getting killed. He then finds on TV that the Sri Lankan Prime Minister is killed by a human bomb. He purchases a bottle of liquor and goes to a nearby church. The priest of that church, who seems to know him for the past three years, asks him about his \"conspiracy\" when he says that \"Our Prime Minister could have been saved from the conspiracy\". The bearded man then starts narrating his story.\n\nThe film then goes five years back, when the man tells that the continuous battle between the majority in Sri Lanka Sinhalese and minorities Tamils had reached a dangerous level. In that battle thousands of Tamils lost their lives, causing their youths to take weapons in their hands and join the LTF leader Anna Bhaskaran (a character based on the real-life LTTE leader Velupillai Prabhakaran). Due to the plight of Tamils there, the Indian Prime Minister (Sanjay Gurubaxani) decided to sign a peace accord with Sri Lankan Government and said that the elections should happen there peacefully before Diwali. However, Anna refused to accept the accord and the Indian Peace Keeping Forces were forced to withdraw from the island. A heated meeting in New Delhi between the Indian officials leads Robin Dutt aka RD (Siddharth Basu), the R&amp;AW chief, to call upon his best man, Maj. Vikram Singh to find out the solution.\n\nAfter meeting and discussing the strategy with RD and his deputy, Swaroop (Avijit Dutt) Vikram travels to Sri Lanka and meets a war correspondent Jaya Sahni (Nargis Fakhri) and tries to find out a way to stop the rebels. After reporting to his senior Bala (Prakash Belwadi) he tries to find some that may help to find Shri, the only man who can withstand and oppose Anna. After meeting with an informer called Narayanan, Vikram manages to visit Shri. Vikram promises Shri to help him rise against Anna by providing him with arms. The arms deal date is decided at 6 July. However, the deal goes terribly wrong and one of Vikram's associates is killed in a surprise attack by LTF. Bala scolds Vikram of his working style and tells him to go to Colombo Safehouse. Vikram meets Jaya to seek her help. Jaya tells him that they know his next step even before he implement it. However, she tells him that \"a foreign agency guy met with an Indian official\" before her arrival in the island. Next day, Vasu, Bala's associate, meets a man, gives him a photo of Vikram, telling him \"to keep him alive\".\n\nMeanwhile, RD and his team is shocked to learn on TV that Vikram is kidnapped by LTF. However, he is left alive by LTF, but badly wounded. Bala visits him in the hospital and tells him to leave Sri Lanka as he is on the hit-list of both the camps. Vikram feels suspicious about Bala. He calls SP, one of his associates, and tells him to report all activities of Bala to him. Vikram, posing as a war correspondent, manages to reach Malaya, second in-command of Anna and persuades him to meet RD in Colombo. RD tells him that the only way this war could be won is by a political solution. He instigates Malaya to stand up as the only champion of his people, thus dividing the LTF in two. Vikram and Indian forces then launch a massive attack on the LTF base camp where Anna and his men (minus Malaya) were discussing strategy. A devastating gunbattle begins, and Vikram escapes from the island after being told by RD. Everyone believes Anna got killed in the fight. However, Anna survives and later kills Malaya and Shri. In the light of the resurfaced violence, the Indian Prime Minister resigns. Some months later, SP later tracks some discussion of Anna over the phone and tells Bala about this, but Bala tells him to ignore them, causing SP to believe that Bala might be a mole. He escapes with the intercepts and files of the case. Bala finds about it and burns the remaining papers, later telling someone over the phone that SP and Vikram are in Kochi and he should send some men there. Vikram later receives a call from SP who tells him to meet him. After meeting with SP, Vikram comes home to find Ruby (Rashi Khanna), his wife, murdered. Vikram's associate in Kochi, Kush tells him that Vasu has been tracked. He nabs Vasu from a theatre and asks him what he knows. Vasu tells him that indeed Bala was a leak and he was helping him along with a person named Reed from Singapore. Vikram calls Jaya and requests her to use her sources. She agrees to help and later consoles Vikram about his wife.\n\nAs told by Jaya, Vikram reaches Bangkok where a source of Jaya (Dibang) tells him that he has a tape. Vikram is shocked to see that Bala was honeytrapped, forcing him to divulge all the information about their movements. Bala later commits suicide by shooting himself. Back in Delhi, R&amp;AW had decoded the intercepts and had also found out about Bala's fake passports and unknown bank accounts. RD realises that this might be a Code Red, to assassinate the ex Prime Minister. He asks Vikram to take care of this and tells his team to seal the coastline. A massive manhunt begins and hundreds of LTF associates are nabbed by Indian security forces and local cops. In the Madras R&amp;AW office, Arjun, an officer tracks down the conversation of Vijayan Joseph, a bombmaker and Anna and tells this to Rishi (Tarun Bali). Rishi tells this to Vikram and further says that Kannan Kanan, an associate of Anna's man Kanda, is in Madurai Jail and might be helpful. Kannan reveals that some suspicious refugees came from the island to Tamil Nadu. After a short but important meeting with Jaya, Vikram sees X on a clock at the Airport and deduces that the LTF is going to assassinate the ex PM on the same day at X PM (10 PM). RD then calls the ex PM to cancel his rally, but he replies that he'll be alright. Vikram then manages to catch Vijayan from his hideout who tells that the refugees are going to assassinate the ex PM by plastic explosives which are untraceable to metal detectors.\n\nVikram rushes to the place where the ex PM is taking part in the rally. He reaches there nearly on time, but the suicide bomber manages to put the wreath on the neck of the ex PM and while bowing down, she pulls the trigger and kills him along with herself and many others. Vikram manages to recover but sits there dejected and defeated. Later, Vikram submits his report on the assassination to the investigation committee who considers his report. A few days later, RD too resigns, and Vikram, after taking a voluntary retirement, comes in Kasauli.\n\nThe movie comes to present where the priest asks Vikram who won the battle. Vikram says he doesn't know, but in this battle, Indians lost their Prime Minister and Lankan lost their future. He later walks away, reciting the lines of \"Where the mind is without fear\". He completes another report and sends it to Jaya in Singapore who starts her work on that report. In Kasauli, Vikram moves out of the house he was living in.\n\nAn epilogue tells that the civil war continued for 27 years, killing more than 40 thousand Sri Lankan subjects, 30 thousand Tamil rebels, 21 Sri Lankan forces and 1200 Indian forces, and still thousands of Lankan Tamils are homeless. In 2009, Sri Lankan forces launched a brutal aerial and land attack, finishing the rebels along with their leader.",
  "synopsis": "From time to time there comes a product that you have to sit up and take notice just because somebody even attempted it. Madras Café, with all its flaws, is one such movie. Ours has been a nation obsessed with Gods and saviors. Even more than the Jews, we Indians have always been looking for a savior to rescue us from the mire that is our lives. Our mythological stories are full of Gods to took human form to save mankind and our recent history is filled with people who are considered demi-Gods by their supporters. From Gandhi to Mamata, our leaders always evoke one of two reactions - total and unquestioned loyalty or complete and utter dismissal. In such an environment, Madras Café tries to tell the story of, arguably, the most important political event of our times. The assassination of Rajiv Gandhi, without a doubt, changed the face of Indian politics. Shoojit Sarkar and John Abraham, producer, have to be commended for trying to tell an unbiased story on how Rajiv Gandhi came to be assassinated in a most gruesome manner.The movie traces the story from the point of view of Bikram Singh, a RAW agent, who works undercover in Sri Lanka to undermine LTTE chief Prabhakaran and help get the peace process on track. Along the way, he is double crossed, kidnapped, lied to and loses the most cherished parts of his life. Unfortunately, John Abraham the actor does not live up to John Abraham the producer. Johns limited acting abilities mean that we are left feeling cold and unattached to the main protagonist. This is not the first time John has essayed a promising role in the most lifeless manner possible (check out No Smoking or Shootout at Wadala). The movie is filled with bad actors essaying promising roles or good actors essaying one-dimensional roles. For all the effort, Shoojit Sarkar fails to recreate the magic of Vicky Donor. He is let down by the script and the acting skills at his disposal. But it is not all gloomy. Instead there is a lot to recommend about the movie. For one, the photography is top-class. Shot mostly in Kerala and Tamil Nadu, Kamaljeet Negi does a fine job of capturing the beauty and horror that must have been Sri Lanka in the Prabhakaran era. The music by Shantanu Moitra is complementary without being intrusive to the storytelling. Then there is the fact that this movie was actually made. This is a moment when you have to put aside your demand for the perfect movie and watch Madras Café just so you can tell Bollywood that youd prefer this brand of cinema to the Khans brand. What John Abraham needs is to build a team of good technicians and actors. If he can continue to support and make money from the kind of cinema he believes in, it would be a turning point for Bollywood. Verdict: Must watch"
}