{
  "imdb_id": "tt2885450",
  "tmdb_id": "186139",
  "douban_id": null,
  "title": "DPRK: The Land of Whispers (2013)",
  "genres": [
    "Documentary"
  ],
  "country": "Vietnam",
  "version": [
    {
      "runtime": "59 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm2119228",
      "name": "Matt Dworzanczyk"
    }
  ],
  "writer": [
    {
      "id": "nm2119228",
      "name": "Matt Dworzanczyk",
      "description": "as Chrystian Cohen"
    }
  ],
  "cast": [
    {
      "id": "nm2119228",
      "name": "Matt Dworzanczyk",
      "character": "Chrystian Cohen       (as Chrystian Cohen)"
    }
  ],
  "overview": "\"Land of Whispers\" invites you to visit arguably the most unique and isolated travel destination in the world - not to criticize, but to observe and listen. Aside from usual highlights such as Pyongyang or Arirang, this unique one-man documentary brings you to areas such as Chongjin or Wonson, still virtually unknown to even google or wikipedia. There, I attempt to pierce through the ever-present 'national mythology' and as much as possible, I try to connect with people - such as the waitress mesmerized by tablet computers, or a tour guide cautiously fascinated by modern pop culture.",
  "storyline": "North Korea lies somewhere between a 1930s Soviet Union frozen in time and a dark, futuristic vision of society... as imagined back in the 70s. 'Land of Whispers' invites you to visit arguably the most unique and isolated travel destination in the world - not to criticize, but to observe and listen. Aside from usual highlights such as Pyongyang or Arirang, this unique one-man documentary brings you to areas such as Chongjin or Wonson, still virtually unknown to even Google or Wikipedia. There, the director attempts to pierce through the ever-present 'national mythology' and as much as possible, he tries to connect with people - such as the waitress mesmerized by tablet computers, or a tour guide cautiously fascinated by modern pop culture.",
  "plot": null,
  "synopsis": null
}