{
  "imdb_id": "tt2841572",
  "tmdb_id": "282502",
  "douban_id": null,
  "title": "Dancing Arabs (2014)",
  "genres": [
    "Drama"
  ],
  "country": "Israel",
  "version": [
    {
      "runtime": "104 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm0726954",
      "name": "Eran Riklis"
    }
  ],
  "writer": [
    {
      "id": "nm1709339",
      "name": "Sayed Kashua",
      "description": "screenplay"
    },
    {
      "id": "nm1709339",
      "name": "Sayed Kashua",
      "description": "novel"
    }
  ],
  "cast": [
    {
      "id": "nm5601350",
      "name": "Tawfeek Barhom",
      "character": "Eyad"
    },
    {
      "id": "nm5643449",
      "name": "Razi Gabareen",
      "character": "Young Eyad"
    },
    {
      "id": "nm0008404",
      "name": "Yaël Abecassis",
      "character": "Edna"
    },
    {
      "id": "nm0615688",
      "name": "Michael Moshonov",
      "character": "Yonatan"
    },
    {
      "id": "nm1846124",
      "name": "Ali Suliman",
      "character": "Salah"
    },
    {
      "id": "nm2151408",
      "name": "Danielle Kitsis",
      "character": "Naomi       (as Daniel Kitsis)"
    },
    {
      "id": "nm0048006",
      "name": "Marlene Bajali",
      "character": "Aisha"
    },
    {
      "id": "nm3128226",
      "name": "Laëtitia Eïdo",
      "character": "Fahima"
    },
    {
      "id": "nm0411521",
      "name": "Norman Issa",
      "character": "Jamal"
    },
    {
      "id": "nm0622384",
      "name": "Khalifa Natour",
      "character": "Bassem"
    },
    {
      "id": "nm7267931",
      "name": "Kais Natour",
      "character": "Wassim"
    },
    {
      "id": "nm2991045",
      "name": "Loai Nofi",
      "character": "Wajdi"
    },
    {
      "id": "nm2991024",
      "name": "Rona Lipaz-Michael",
      "character": "Headmistress in Jerusalem"
    },
    {
      "id": "nm0221192",
      "name": "Shirili Deshe",
      "character": "Literature Teacher"
    },
    {
      "id": "nm7267932",
      "name": "Keren Tzur",
      "character": "History Teacher"
    },
    {
      "id": "nm6449075",
      "name": "Shani Klein",
      "character": "Nurse"
    },
    {
      "id": "nm5046553",
      "name": "Adham Abu Aqel",
      "character": "Young Nidal"
    },
    {
      "id": "nm6462031",
      "name": "Danny Berman",
      "character": "Nadal"
    },
    {
      "id": "nm6291628",
      "name": "Robby Berman",
      "character": "Jacob Newman"
    },
    {
      "id": "nm3272216",
      "name": "Noa Biron",
      "character": "Bank Clerk"
    },
    {
      "id": "nm3750415",
      "name": "Nitay Dagan",
      "character": "Student"
    },
    {
      "id": "nm8634644",
      "name": "Naomi Fromovich",
      "character": "Naomi's Mother"
    },
    {
      "id": "nm5674223",
      "name": "Shadi Mar'i",
      "character": "Jamil"
    },
    {
      "id": "nm8153477",
      "name": "Pauline Wiesweg",
      "character": "Jerusalem Street Musician"
    }
  ],
  "overview": "A young Arab is caught between cultures as he is sent to a prestigious Jewish boarding school in Israel in the 1980s.",
  "storyline": "A Palestinian-Israeli boy named Eyad is sent to a prestigious boarding school in Jerusalem, where he struggles with issues of language, culture, and identity.",
  "plot": "Eyad (Tawfeek Barhom) is a gifted Palestinian teenager who is accepted into an elite Israeli school. His father (Ali Suliman) drives to Jerusalem and drops the 16 year old Eyad at the new school. Before entering the school, Eyads Father tells him that the Palestinian people once longed to defeat their Jewish enemies, but will now settle for being able to live side by side with dignity. In school, he struggles to adapt, his Israeli peers refer to him as \"Iyad\" and is looked down upon by the others. Things change once he meets Naomi (Daniel Kitsis), he helps her with her chemistry schoolwork and the two start to meet at a cafe.\n\nYonatan (Michael Moshonov) is a disabled Israeli teen whom Eyad is assigned by the school to visit. Eyad and Jonatan get close and the two develop a strong bond since they are both considered outsiders. Back in school, Eyad and Naomi fall in love and meet up constantly,however, things begin to get complicated. Eyad excels in the classroom and begins to earn the trust and respect of his Israeli peers. He begins to sell falafel and bagels and starts to finally feel comfortable at the school. One day as Eyad and Naomi are walking in the streets, Naomi asks to Eyad to tell her he loves her in Arabic, an Israeli soldier hears Eyad and asks to see his ID card and aggressively questions him.\n\nIn English class, Eyad and Naomi declare their love to the others and want to tell the world about their relationship. Once Naomi tells her parents about her Palestinian boyfriend she is no longer allowed to go back to school. Eyad also drops out of school and asks the principal to inform Naomi's parents that she can now go back to school since he is no longer there. The decision angers Eyad's father and he is no longer welcome at home, he moves to a flat in East Jerusalem and begins to seek work as a waiter. After many unsuccessful attempts he lands a job as a dish washer. By this point, Jonathan's health has deteriorated significantly and he is no longer able to move. Joanatans mother aks Eyad to move in with them since she trusts him and cannot take care of Jonatan by herself.\n\nEyad realizes that him and Jonatan look alike, takes his Israeli ID and becomes a waiter. Jonatan's mother (Yael Abecassis) finds out but allows Eyad to continue as long as no one ever finds out. Using Jonatans ID, Iyad takes Jonatan's final exams and scores highly for the both of them. Naomi serves in the Israeli Army and tells Eyad that she is sick of lying and chooses to break things off. After a while, Jonatan passes away while, Eyad (posing as Jonatan) informs the Muslim authorities that the Muslim Iyad has died. Eyad and Jonatan's mother attend the funeral and the screen goes white.",
  "synopsis": null
}