{
  "imdb_id": "tt2880472",
  "tmdb_id": "328601",
  "douban_id": null,
  "title": "Out of Nothing (2014)",
  "genres": [
    "Documentary",
    "Biography",
    "Family",
    "Sport"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.9,
  "director": [
    {
      "id": "nm5651601",
      "name": "Chad DeRosa"
    }
  ],
  "writer": [
    {
      "id": "nm1834158",
      "name": "Colin Dalvit",
      "description": "story"
    }
  ],
  "cast": [
    {
      "id": "nm5652016",
      "name": "Mark Bjorklund",
      "character": "Himself"
    },
    {
      "id": "nm5651620",
      "name": "Carl Bjorklund",
      "character": "Himself"
    },
    {
      "id": "nm5652840",
      "name": "Jason Omer",
      "character": "Himself"
    },
    {
      "id": "nm5652888",
      "name": "Bill Woods",
      "character": "Himself"
    },
    {
      "id": "nm7668402",
      "name": "Lucas Reber",
      "character": "Himself"
    },
    {
      "id": "nm7668405",
      "name": "Jose Mateu",
      "character": "Himself"
    },
    {
      "id": "nm7668406",
      "name": "Denis Manning",
      "character": "Himself"
    },
    {
      "id": "nm7668403",
      "name": "Andy Sills",
      "character": "Himself"
    },
    {
      "id": "nm7668404",
      "name": "Erin Hunter-Sills",
      "character": "Herself"
    }
  ],
  "overview": "From the Pacific Northwest to the Bonneville Salt Flats in Utah, this is the inspiring true story of four tenacious men who risk everything to conquer the world records of motorcycle land speed racing. Their extraordinary journey will remind you how perseverance against all odds can send the most unlikely men roaring into glory.",
  "storyline": "From the Pacific Northwest to the Bonneville Salt Flats in Utah, this is the inspiring true story of four tenacious men who risk everything to conquer the world records of motorcycle land speed racing. Their extraordinary journey will remind you how perseverance against all odds can send the most unlikely men roaring into glory.",
  "plot": "Set in the urban cacophony of New York, the story begins with the mild-mannered but confused George (Gere) being thrown out from an apartment by Art (Buscemi). Later viewers find out this apartment was not his, but rented to an evicted acquaintance, whom he calls \"Sheila\" (Sedgwick). From the start, George is indigent; he claims that someone has stolen his wallet. One can only guess he'd been living on the edge for a while. Several attempted telephone calls yield no help, and George is forced to sleep on the streets.\n\nAt one point, seeking warmth, he sits at a public hospital emergency room where he is approached by staff nurse Maire (Hughes) who treats him with compassion. Up until shortly before the end of the film, he is denying to others and himself that he is homeless, George pawns his belongings to buy liquor, later only beer. He eventually gets a bed at a homeless shelter, where he befriends the mentally unstable but friendly Dixon (Vereen).\n\nDixon keeps George company as the latter goes through the trials of applying for public benefits. His eventual meeting with the advocate Laura (Datz) leads to more self-realizations about the help he needs. Seeking reconciliation with his estranged daughter Maggie (Malone), his vulnerability is palpable. He appears \"guiltily obsessed with somehow reconnecting with her.\" Throughout the story, as George's character and background become more evident, he also becomes increasingly anhedonic; the only moments of joy seem to be when he enjoys an occasional six-pack. The story ends with George reaching out to Maggie in hopes for forgiveness and support.",
  "synopsis": null
}