{
  "imdb_id": "tt2860716",
  "tmdb_id": "174573",
  "douban_id": null,
  "title": "We Are Modeselektor (2013)",
  "genres": [
    "Documentary"
  ],
  "country": "Germany",
  "version": [],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm5638051",
      "name": "Romi Agel"
    },
    {
      "id": "nm4000873",
      "name": "Holger Wick"
    }
  ],
  "writer": [
    {
      "id": "nm5638051",
      "name": "Romi Agel",
      "description": null
    },
    {
      "id": "nm4000873",
      "name": "Holger Wick",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3836044",
      "name": "Gernot Bronsert",
      "character": "Gernot Bronsert"
    },
    {
      "id": "nm3836477",
      "name": "Sebastian Szary",
      "character": "Sebastian Szary"
    }
  ],
  "overview": "What’s the “Seilscheibenpfeiler”? What is the origin of the first Modeselektor tracks? Where is Monkeytown? Why is riding a coach more fun than flying? These and many more questions will be answered with the documentary film We Are Modeselektor.  In 72 minutes, filmmakers Romi Agel and Holger Wick tell the story of Modeselektor as a post-German reunification movie, a travel report, and a portrait of the special friendship between Gernot Bronsert and Sebastian Szary all in one. We Are Modeselektor is the story of two men, possessed by techno, who took their massive beats from their small hometown village to the world. And it’s a story that has only just begun.",
  "storyline": "\"An odd duo that raises international mass hysteria and has been creating a credible sound for years now - Modeselektor seems to be a phenomenon in itself. The search for the origin of this phenomenon leads us into the depths of the biographies of two kids born and raised in East Germany, whose creativity, enthusiasm and idea of a collective brought them from the Berlin suburbs to the city itself and the stages of the world. To consistently retrace this path the documentary offers a rich variety of archive material, extensive behind the scenes tour footage and the travels to important places of the past and present. As a result there are very private insights into Sebastian Szary's and Gernot Bronsert's life as subversive artists who are - despite their broad success - authentic and who over the years stayed true to where they came from.\"",
  "plot": null,
  "synopsis": null
}