{
  "imdb_id": "tt2884206",
  "tmdb_id": "244267",
  "douban_id": "24696982",
  "title": "I Origins (2014)",
  "genres": [
    "Drama",
    "Romance",
    "Sci-Fi"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "106 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm2648685",
      "name": "Mike Cahill"
    }
  ],
  "writer": [
    {
      "id": "nm2648685",
      "name": "Mike Cahill",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0685856",
      "name": "Michael Pitt",
      "character": "Ian"
    },
    {
      "id": "nm3081796",
      "name": "Steven Yeun",
      "character": "Kenny"
    },
    {
      "id": "nm2793591",
      "name": "Astrid Bergès-Frisbey",
      "character": "Sofi"
    },
    {
      "id": "nm1779870",
      "name": "Brit Marling",
      "character": "Karen"
    },
    {
      "id": "nm3793523",
      "name": "Dorien Makhloghi",
      "character": "7-Eleven Attendant"
    },
    {
      "id": "nm0336517",
      "name": "Charles Woods Gray",
      "character": "Marriage Clerk       (as Charles W. Gray)"
    },
    {
      "id": "nm5656984",
      "name": "John Schiumo",
      "character": "TV Anchor"
    },
    {
      "id": "nm5656959",
      "name": "Farasha Baylock",
      "character": "Posh Waitress"
    },
    {
      "id": "nm0015488",
      "name": "Ako",
      "character": "Nurse"
    },
    {
      "id": "nm6636608",
      "name": "Christopher Santamaria",
      "character": "Baby Tobias"
    },
    {
      "id": "nm6636609",
      "name": "Sebastian Santamaria",
      "character": "Baby Tobias"
    },
    {
      "id": "nm0786806",
      "name": "Cara Seymour",
      "character": "Dr. Simmons"
    },
    {
      "id": "nm1489630",
      "name": "Rhonda Ayers",
      "character": "Waitress"
    },
    {
      "id": "nm3088965",
      "name": "Crystal Anne Dickinson",
      "character": "Julie Dairy"
    },
    {
      "id": "nm0263287",
      "name": "Venida Evans",
      "character": "Margaret Dairy"
    },
    {
      "id": "nm0544611",
      "name": "William Mapother",
      "character": "Darryl Mackenzie"
    },
    {
      "id": "nm0659544",
      "name": "Archie Panjabi",
      "character": "Priya Varma"
    },
    {
      "id": "nm5671648",
      "name": "Kashish",
      "character": "Salomina"
    },
    {
      "id": "nm0890075",
      "name": "Victor Varnado",
      "character": "Lab Assistant"
    }
  ],
  "overview": "I Origins follows a molecular biologist studying the evolution of the human eye.  He finds his work permeating his life after a brief encounter with an exotic young woman who slips away from him.  As his research continues years later with his lab partner, they make a stunning scientific discovery that has far reaching implications and complicates both his scientific and and spiritual beliefs.  Traveling half way around the world, he risks everything he has ever known to validate his theory.",
  "storyline": "I Origins begins when graduate student, Ian Gray, is researching the evolution of human eyes with Karen and Kenny, in order to prove that eyes have evolved instead of \"appeared\" as creationists claim. His fascination with eyes takes him into areas that have profound personal and cultural consequences.",
  "plot": "Maleficent is a powerful fairy who lives in the Moors, a magical forest realm bordering a corrupt human kingdom. As a young girl, she meets and falls in love with a human peasant boy named Stefan, whose love for Maleficent (including giving her \"a true love's kiss\" at age sixteen) is overshadowed by his ambition to become king. As they become older, the two grow apart, and Maleficent becomes protector of the Moors. When King Henry tries to conquer the Moors, a grown Maleficent forces him to retreat. Fatally wounded in battle, he declares that whoever kills Maleficent will be named his successor and marry his only daughter, Princess Leila. Stefan visits Maleficent in the Moors, where he drugs her but cannot bring himself to kill her. Instead, he cuts off her wings and presents them to the king as evidence of her death. Maleficent awakens to find herself wingless. Overwhelmed by Stefan's betrayal, she declares herself Queen of the Moors, forming a dark kingdom with Diaval, a raven to whom she gives human form. He acts as her wings, her spy and confidant.\n\nAfter some time, Diaval informs Maleficent that Stefan, now king, is hosting a christening for his newborn daughter, Princess Aurora, with his wife, Queen Leila. Bent on revenge, Maleficent arrives uninvited and curses the infant princess: on her sixteenth birthday, she will prick her finger on the spindle of a spinning wheel and succumb to a deathlike sleep, from which she will never awaken. When Stefan begs for mercy, Maleficent mocks him by offering an antidote: the curse can only be broken by true love's kiss. Stefan sends Aurora to live with three pixies - Knotgrass, Thistlewit, and Flittle - until the day after her sixteenth birthday, while he destroys all the spinning wheels in the kingdom and hides their remnants in the castle dungeon. He sends his armies to find and kill Maleficent, but she surrounds the Moors with an impenetrable wall of thorns. King Stefan slips into madness and paranoia trying to prevent the curse, even neglecting to see his wife on her deathbed.\n\nDespite her initial dislike for Aurora, Maleficent begins to have motherly feelings for the girl. After a brief meeting with the young Aurora, Maleficent watches over her from afar. When Aurora is fifteen, she encounters Maleficent. Knowing that she is being watched over, she refers to Maleficent as her \"fairy godmother.\" Realizing she has grown fond of the princess, Maleficent attempts to revoke the curse but she recalls saying to the king that no power on earth can revoke it and realizes that restriction applies to even herself. In the forest, Aurora meets Prince Philip, and the two are instantly smitten with one another. On the day before Aurora's sixteenth birthday, Maleficent invites her to live with her in the Moors. The pixies inadvertently tell Aurora of her past and reveal Maleficent's true identity, and a distraught Aurora runs away to her father's castle.\n\nAfter a brief reunion with his daughter, Stefan locks her away in her room for her own safety. However, the power of the curse draws Aurora to the dungeon, where remnants of a spinning wheel pricks her finger. She falls into a deep sleep, fulfilling the curse. Maleficent, intent on saving her, abducts Phillip and infiltrates Stefan's castle, but Phillip's kiss fails to awaken Aurora. At her bedside, Maleficent apologizes to Aurora and kisses her forehead. Aurora awakens, as the motherly tenderness proves powerful enough to break the spell. However, as they attempt to leave the castle, Stefan's guards spring an ambush. As her attackers close in, Maleficent transforms Diaval into a dragon, but they are driven back by the guards. Stefan beats and taunts Maleficent, but before he can deliver a killing blow, her wings are freed by Aurora and fly back to Maleficent, reattaching themselves. Fully empowered, Maleficent carries Stefan to the top of the castle's highest tower. At the precipice, she cannot bring herself to kill him. Stefan attempts to kill her, however, and both plummet from the tower. Maleficent is able to break away, and Stefan falls to his death. Soon after, Princess Aurora is crowned queen by Maleficent, unifying the two kingdoms in peace.",
  "synopsis": "A young scientist and his lab partner set out to dis/prove, once and for all, the origins of mankind by studying eyes and the chromosome for sight in various species. Over several years they collect data that they feel ends up proving Evolution is the correct theory, and gain some notoriety. After their son is born and his eyes are mapped, another person's name comes up in the database as the person those eyes belong to. Another doctor calls and hints that their son has some autism markers and needs to be tested, but all they do is show the baby pictures and try to map which picture his eyes are drawn to and what his reactions are.This confuses the parents and they begin their own investigation. They start by visiting the person whose eyes match their son's, and they find the person died shortly before their son's conception. They also find that the people in that person's life were in the pictures shown by the other doctor to their baby. As they delve further into the mystery, they start to see data that challenges the known fact that everyone's eyes are unique. They stumble onto a match for the father's ex-girlfriend - a young girl born shortly after his girlfriend's death, who is living in India.He begins a search for the little girl and when he finds her, administers his own test of photographs. The girl's scores are consistent with random choice and he begins to feel foolish that he ever questioned his own previous research. Yet as they leave and head to the elevator, the little girl explodes into hysterics and does not want to enter the elevator. As he realizes the reason for her hysteria, his conclusions are once again challenged as he remembers his ex-girlfriend, the match to this little girl's eyes, died in an elevator accident."
}