{
  "imdb_id": "tt2877108",
  "tmdb_id": "189227",
  "douban_id": null,
  "title": "Soodhu Kavvum (2013)",
  "genres": [
    "Comedy",
    "Crime",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "135 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.5,
  "director": [
    {
      "id": "nm5650589",
      "name": "Nalan Kumarasamy"
    }
  ],
  "writer": [
    {
      "id": "nm7255526",
      "name": "Srinivas Kavinayam",
      "description": null
    },
    {
      "id": "nm5653271",
      "name": "Srinivasa Kavineyam",
      "description": "writer"
    },
    {
      "id": "nm5653271",
      "name": "Srinivasa Kavineyam",
      "description": null
    },
    {
      "id": "nm5650589",
      "name": "Nalan Kumarasamy",
      "description": "writer"
    },
    {
      "id": "nm5650589",
      "name": "Nalan Kumarasamy",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm4043111",
      "name": "Vijay Sethupathi",
      "character": "Das"
    },
    {
      "id": "nm4195102",
      "name": "Sanchita Shetty",
      "character": "Shalu"
    },
    {
      "id": "nm1099597",
      "name": "Radha Ravi",
      "character": "Chief Minister"
    },
    {
      "id": "nm2132667",
      "name": "M.S. Bhaskar",
      "character": "Gnanodhayam"
    },
    {
      "id": "nm5654277",
      "name": "Bobby Simha",
      "character": "Pagalavan       (as Simhaa)"
    },
    {
      "id": "nm5654463",
      "name": "Ashok Selvan",
      "character": "Kesavan"
    },
    {
      "id": "nm5654687",
      "name": "Ramesh Thilak",
      "character": "Sekhar       (as RJ Ramesh Thilak)"
    },
    {
      "id": "nm5369429",
      "name": "Karunakaran",
      "character": "Arumai Pragasam"
    },
    {
      "id": "nm2909348",
      "name": "Yog Japee",
      "character": "Brahmma"
    },
    {
      "id": "nm4725798",
      "name": "Aruldoss",
      "character": "Rowdy Director       (as Aruldass)"
    },
    {
      "id": "nm5611465",
      "name": "Boys Rajan",
      "character": "AC Manikandan"
    },
    {
      "id": "nm6662187",
      "name": "Radha",
      "character": "Arumaipragasam's Mother"
    },
    {
      "id": "nm6662188",
      "name": "Kannayiram",
      "character": ""
    },
    {
      "id": "nm6662210",
      "name": "Mippu",
      "character": ""
    },
    {
      "id": "nm5431037",
      "name": "Gaana Bala",
      "character": "Special Appearance"
    },
    {
      "id": "nm6489058",
      "name": "Yogi Babu",
      "character": ""
    },
    {
      "id": "nm6046822",
      "name": "Gajaraj",
      "character": ""
    },
    {
      "id": "nm6106368",
      "name": "Munishkanth",
      "character": ""
    },
    {
      "id": "nm9638669",
      "name": "Anjali Rao",
      "character": "Kesavan's Colleague"
    }
  ],
  "overview": "Dass specialises in small time kidnapping and has his own set of rules. The primary and most important among them is not to get involved with influential people. Three jobless youngsters meet Dass and the four take up an assignment for a hefty sum that throws away this primary rule and end up being chased by a dreaded policeman.",
  "storyline": "Pagalavan, Kesavan and Sekar are three friends, who lose their jobs in Chennai due to certain circumstances. Then they come across Das (Vijay Sethupathy), who runs a smart kidnap for ransom scam. Naturally his crime flourishes, and the three friends team up with him. Their path crosses with that of Arumai Prakasam, son of the state finance minister. Denied capital by his very strict father to start his business Arumai Prakasam stages his own kidnap, but ends up in the hands of Das and co. The comedy of errors takes a turn when the finance minister wants to catch the culprits, and gives the task to a very strict, encounter specialist cop, Brahmma. How Das and co try to stay ahead of the cop and how he nabs them, and what happens forms the rest of the story.",
  "plot": "Friends Kesavan, Sekar and Pagalavan meet Das, a middle-aged man with an imaginary (revealed towards the end) girlfriend Shalu who does low-profile kidnappings for a living. Because they are broke, the trio decide to become his assistants. Das follows five rules of kidnapping (which he spells and writes as \"kednaping\"), the first of which is to avoid kidnapping people from political backgrounds. One day, they kidnap a young boy and successfully obtain ransom money from his father Nambikkai Kannan. Nambikkai's contractor brother has been arrested for attempted bribery by State Minister Gnanodayam, a disciplined politician who plays by the book. Impressed with Das' kidnapping skills, Nambikkai asks him to kidnap Gnanodayam's son Arumai Pragasam as revenge and offers to pay Das up to ₹2 crore (equivalent to ₹2.4&#160;crore or US$350,000 in 2016).\n\nThe next day, the four men set out to kidnap Arumai, but are astonished to see him be kidnapped by another group. They kidnap Arumai from the other kidnappers and discover that the first kidnapping was staged by Arumai himself to extort money from his father. Arumai manages to convince Das and his men to collude with him to obtain ransom money from his father. The group demand ₹2 crore from the minister and receive the money.\n\nAn argument over splitting the cash arises between Arumai and the rest during which their van loses control and falls from a bridge. Arumai runs away with all the money. The minister seeks the assistance of encounter specialist Bramma, a brutal and merciless policeman to hunt down the kidnappers. Arumai returns to his house and hides the money in his room. Das devices a plan to kidnap Arumai again to retrieve the money. They accidentally meet Arumai and successfully kidnap him again. But Das lets Arumai go free, after making him promise that he should not tell anything about them to the police. Arumai also promises to return their share of the money. Bramma learns that Arumai staged his own kidnapping and uses this information to threaten Arumai into testifying against the Das gang.\n\nArumai tells the court that the Das gang did not kidnap him and they are acquitted. Enraged, Bramma takes the gang to a remote location and brutally beats them and raises his department gun to kill them. Instead of shooting them with the officially issued gun, he goes out and retrieves from his police jeep an illegal homemade gun that he had previously seized from a crook. When he inserts that gun behind his back in his pants, the rusty gun misfires into Bramma's buttocks, allowing Das and others to escape. Arumai's father breaks in and takes the money bag to the Chief Minister, who provided the ransom money. When he opens the bag, the minister is shocked to find it filled with newspapers instead of cash. Arumai had transferred the cash to another bag and gives the Das gang their share.\n\nThe Chief Minister calls Arumai to his office and asks him to stand as a candidate in the upcoming elections in lieu of his father, who never brought much income to the party due to his refusal to be corrupt. The Chief Minister praises Arumai's shrewdness and believes he can rake in substantial income for the party. Arumai wins the election and appoints Sekar and Kesavan as his personal advisers, while Pagalavan becomes an actor. Das continues his kidnapping business with a new band of young men. They kidnap a woman who looks exactly like Shalu, belatedly realising that she Shalini Gupta, a minister's daughter; Das has broken his first rule of kidnapping again.",
  "synopsis": null
}