{
  "imdb_id": "tt2801746",
  "tmdb_id": "199851",
  "douban_id": null,
  "title": "Hawaii (2013)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "Argentina",
  "version": [
    {
      "runtime": "102 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm3014420",
      "name": "Marco Berger"
    }
  ],
  "writer": [
    {
      "id": "nm3014420",
      "name": "Marco Berger",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3199366",
      "name": "Manuel Vignau",
      "character": "Eugenio"
    },
    {
      "id": "nm4980387",
      "name": "Mateo Chiarino",
      "character": "Martín"
    },
    {
      "id": "nm2072870",
      "name": "Luz Palazón",
      "character": "Señora"
    },
    {
      "id": "nm3861562",
      "name": "Antonia De Michelis",
      "character": "Vecina"
    },
    {
      "id": "nm5139839",
      "name": "Manuel Martínez Sobrado",
      "character": "Hermano de Eugenio"
    }
  ],
  "overview": "Eugenio offers his childhood friend Martin a work for the summer. With a game of power and desire a relationship starts to grow that goes beyond their friendship.",
  "storyline": "Martin seeks for a temporary job at Eugenio's house. When they recognize to be childhood friends, Eugenio offers him work for the summer. A power and desire game starts and their relationship grows beyond their friendship.",
  "plot": "Martín (Mateo Chiarino), an orphan, arrives at his former hometown hoping to stay with his aunt after his grandmother had died. He finds out that his aunt had moved without leaving a forwarding address. With no place to stay and little money, he beds down behind the ruins of an abandoned building. He looks around for odd jobs and is eventually hired by the writer Eugenio (Manuel Vignau), a former childhood playmate. Martín does not want to admit that he is homeless, and lies to Eugenio that he is staying with his aunt. Eugenio eventually finds out about Martín's situation and convinces Martín to stay at his house for the summer.\n\nAt first Eugenio does not seemingly remember much about Martín, but little by little they start to recall their shared memories as children. Eugenio realizes his growing attraction to Martín but is reluctant to pursue it, as he does not want to seem to be taking advantage of Martín's current financial situation. He is also afraid that even if the soft-spoken Martín might reciprocate his feelings, it might only be because Martín feels indebted to him. Martín himself is attracted to Eugenio, but he does not know if Eugenio is gay. And given his impoverished background, he does not want to presume on Eugenio's kindness.\n\nNonetheless, Eugenio and Martín slowly grow closer together, and Eugenio finds it becoming increasingly difficult to hide his attraction. One day while moving some furniture, Eugenio accidentally knocks over some drawings of naked men from his desk. Martín sees the drawings, but Eugenio pointedly avoids talking about it. It dawns on Martín that Eugenio might be attracted to him. Martín confirms his suspicions when he sees Eugenio's flustered reaction after he deliberately strips in front of Eugenio one night with the excuse of doing laundry.\n\nMartín kisses Eugenio the next morning, confident that Eugenio is also attracted to him. But Eugenio unexpectedly rebuffs him, and Martín leaves confused. That afternoon, Eugenio discovers that Martín had packed up and left. He searches for him for several days but is unable to find him. Eugenio remembers Martín reminiscing about \"dos ananás\" (\"two pineapples\"). He realizes that Martín was talking about a picture from a Hawaii reel that they used to look at on a View-Master as children. He looks for the reel and the old View-Master and leaves them behind the abandoned building that Martín used to stay at. A few days later, Martín comes back, carrying the View-Master with him. They smile at each other and kiss.",
  "synopsis": null
}