{
  "imdb_id": "tt2861320",
  "tmdb_id": "206301",
  "douban_id": null,
  "title": "Policegiri (2013)",
  "genres": [
    "Action",
    "Comedy"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "141 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.1,
  "director": [
    {
      "id": "nm0433893",
      "name": "K.S. Ravikumar"
    }
  ],
  "writer": [
    {
      "id": "nm1419055",
      "name": "Hari",
      "description": "original story"
    },
    {
      "id": "nm0433893",
      "name": "K.S. Ravikumar",
      "description": "screenplay"
    },
    {
      "id": "nm2678319",
      "name": "Sajid",
      "description": "dialogue"
    },
    {
      "id": "nm2260872",
      "name": "Farhad Samji",
      "description": "dialogue as Farhad"
    }
  ],
  "cast": [
    {
      "id": "nm0004569",
      "name": "Sanjay Dutt",
      "character": "DCP Rudra Adityadevraj"
    },
    {
      "id": "nm2278458",
      "name": "Prachi Desai",
      "character": "Sehar"
    },
    {
      "id": "nm0695177",
      "name": "Prakash Raj",
      "character": "Nagori Subramaniyam"
    },
    {
      "id": "nm0700875",
      "name": "Om Puri",
      "character": "Comissioner"
    },
    {
      "id": "nm1056425",
      "name": "Rajpal Yadav",
      "character": "Tutu"
    },
    {
      "id": "nm6042695",
      "name": "Rajat Rawall",
      "character": "Toto"
    },
    {
      "id": "nm1259084",
      "name": "Manoj Joshi",
      "character": "Inspector Javed"
    },
    {
      "id": "nm0864608",
      "name": "Mukesh Tiwari",
      "character": "Padam"
    },
    {
      "id": "nm0050187",
      "name": "Arun Bali",
      "character": "Minister"
    },
    {
      "id": "nm1513622",
      "name": "Manoj Chaturvedi",
      "character": "Prakashraj Friend"
    },
    {
      "id": "nm1259094",
      "name": "Ehsan Khan",
      "character": "Sehar's Father"
    },
    {
      "id": "nm0437781",
      "name": "Ramesh Khanna",
      "character": "Wine Shop Owner"
    },
    {
      "id": "nm0561360",
      "name": "Raju Mavani",
      "character": "MLA 2"
    },
    {
      "id": "nm7025587",
      "name": "Besant Ravi",
      "character": ""
    },
    {
      "id": "nm0712542",
      "name": "Rajat Rawail",
      "character": "Toto"
    },
    {
      "id": "nm1133214",
      "name": "Kishori Shahane",
      "character": "Sehar's Mother"
    },
    {
      "id": "nm10345748",
      "name": "Sadat Shamsi",
      "character": "Gopi       (as Sadat Sharma)"
    },
    {
      "id": "nm5130500",
      "name": "Gauri Shankar",
      "character": ""
    },
    {
      "id": "nm1302330",
      "name": "Murli Sharma",
      "character": "MLA 1"
    },
    {
      "id": "nm3166049",
      "name": "Kavitta Verma",
      "character": "Item Girl"
    },
    {
      "id": "nm1302959",
      "name": "Vasu Vikram",
      "character": "Police Inspector"
    }
  ],
  "overview": "A cop named DCP Rudra is transferred to a new police station. As the city is riddled with crime and corruption, he decides to bring law and order back for which he has to go against Nagori Subramaniyam, the local mafia. He does not believe in the system of going by the book and instead fights fire with fire.",
  "storyline": "Policegiri movie is the remake of Tamil movie Sammy.Sanjay Dutt (Rudra) is playing the role of a rough neck cop with a bit of both the bad cop-good cop act which also gives comic touch in his character, whereas Prachi Desai (Sehar) will wear the image of a girl next door and is a software engineer who falls in love with Dutt and marries him.Rudra is a tough and charismatic Deputy Commissioner of police of a small town called Amalapur in Hyderabad.His mission statement is to, clean up the city of the scum of the earth and make sure that the public live in peace undisturbed.Seeing his macho looks, brave heart and honest nature, Sehar an unconventional beauty falls in love with him. But off the record, Rudra adapts a new policy of adjusting with the local goons so that he can serve the people in an effective way.Nagori Subramaniyam (Prakash Raj), is an underworld don(Kingmaker) who has the total control of Southern states, both in politics as well as Rowdyism.",
  "plot": "The movie begins with a man (Sanjay Dutt) drinking beer early in the morning and then following up with having beer and idli. He later steals a bike and goes to the police station to get commission from the police inspector. He then meets a man who takes him to a place where they sell guns and bombs. Finally, he meets a local gangster who hires him to kill a minister. He then kills the gangster and his henchmen and reveals himself as DCP Rudra, the new cop in town, near the Andhra Pradesh-Maharashtra border.\n\nThe city is riddled with crime and corruption and his controlled by Nagori Subramaniam (Prakash Raj) the local mafia. Initially, Rudra closes down a lot of businesses of Nagori. But when Rudra meets Nagori, he reveals that he is also corrupt cop like others and even takes bribe on a condition that Nagori accepts certain points. Nagori accepts and there is truce between the two.\n\nConflict starts when residents complain about a petrol bunk selling less petrol to the public and a lady beaten up when she complained. The bunk is owned by Nagori. Rudra beats up the employees of the bunk as well as Nagori's henchmen. A war emerges between the two.\n\nNagori then calls for a bandh of the market place. But on the day of bandh, Rudra and his team are prepared and drive away all the protestors. Rudra becomes a hero for the people of the city. But Nagori exacts his revenge by causing a riot in the market place and also blowing up a bomb killing many people on the very same day Rudra is marrying Seher (Prachi Desai). Nagori then tries to kidnap Seher but Rudra saves her life in time. Rudra's activities invites the wrath of the Police commissioner who tries to control Rudra but in vain.\n\nRudra then receives his transfer orders and has seven days left in the town. He challenges Nagori that seven days is enough to finish him. The next day, Nagori's men take out a procession with the aim to kill Rudra. But Rudra and his team are prepared and he along with his men kill many of Nagori's men including a MLA and blames the crowd for the mishaps.\n\nRudra then kidnaps Nagori's close accomplice who confess for his and Nagori's involvement in the bomb blast and gets a warrant to arrest Nagori. Rudra is then called to a meeting by the commissioner where MLAs, MPs, Senior Police Officers and Ministers threaten him. He smartly controls them by claiming that his pen has a camera and a voice recorder and he'll release the footage to media. Nagori goes into hiding after knowing that Rudra can't be stopped.\n\nA couple of days later, Rudra catches Nagori who is dressed as a beggar near the temple. He takes Nagori to secluded spot after beating all his henchmen. He then kills Nagori by burning him to death ensuring that Nagori is never found and is declared as a wanted criminal.",
  "synopsis": "A cop named DCP Rudra is transferred to a new police station. As the city is riddled with crime and corruption, he decides to bring law and order back for which he has to go against Nagori Subramaniam the local mafia. He does not believe in the system of going by the book and instead fights fire with fire.The movie was rumoured to be called Thanedaar - Part 2, referring to a previous hit movie of Sanjay Dutt did during his younger days. However Dutt did not feel comfortable with the movie backing on the success of Thanedaar, considering the fact that the story was not written keeping in mind the original Thanedaar. Furthermore the directors and producers of the original Thanedaar were different. Subsequently Sanjay Dutt suggested to brainstorm for another name. He suggested Policegiri and the unit was happy to call this movie Policegiri. Policegiri was actually not a word in use but something Sanjay Dutt created.[1]"
}