{
  "imdb_id": "tt2883352",
  "tmdb_id": "279968",
  "douban_id": null,
  "title": "The Blood Lands (2014)",
  "genres": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "79 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.7,
  "director": [
    {
      "id": "nm1122457",
      "name": "Simeon Halligan"
    }
  ],
  "writer": [
    {
      "id": "nm2207742",
      "name": "Ian Fenton",
      "description": "writer"
    },
    {
      "id": "nm2207742",
      "name": "Ian Fenton",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1717573",
      "name": "Pollyanna McIntosh",
      "character": "Sarah"
    },
    {
      "id": "nm0593449",
      "name": "Joanne Mitchell",
      "character": "Flo"
    },
    {
      "id": "nm0931146",
      "name": "Lee Williams",
      "character": "Ed"
    },
    {
      "id": "nm2058760",
      "name": "Garth Maunders",
      "character": "Local"
    },
    {
      "id": "nm1090590",
      "name": "James McCreadie",
      "character": "Local"
    },
    {
      "id": "nm2732056",
      "name": "Dominic Kay",
      "character": "Local"
    },
    {
      "id": "nm6504291",
      "name": "Faisal Muhammad",
      "character": "Crowd"
    }
  ],
  "overview": "Young urban couple Ed and Sarah are set to begin a new life when they move from London into an isolated borders Scottish farmhouse. After falling in love with the 19th century Castle Farm and seeing its potential as a fixer-upper they are anxious to get started on the renovations. In bed on their first night Sarah thinks she can hear noises in the darkness but Ed is disbelieving saying it’s her imagination playing tricks. Persisting in her fear they are not alone in the house, she forces Ed to investigate. When he doesn’t return after a scarily long period, she goes downstairs to investigate only to be confronted by a welcoming committee of masked intruders. As she desperately searches for Ed, a terrifying game of cat and mouse ensues with the mysterious assailants. But what do they want and what horrors do they have planned for the two newcomers?",
  "storyline": "It's Ed and Sarah's first night at their new home - an isolated farmhouse on the Scottish borders. This should be a new beginning away from their stressful London lives. And at first it is; come sunset they fall in love all over again on a wander in the woods. But as darkness falls, Sarah suspects they're not alone, Ed goes to investigate and quickly, the evening becomes a nightmare. It suddenly dawns on them; they do not belong here. And they certainly aren't welcome either....",
  "plot": "In 2002, Ava, a 14 year old girl from Bridgeport, Connecticut, is woken up in the middle of the night and sees her drug lord father murdered by two masked intruders, before grabbing a shotgun and gunning down the two assailants. Twelve years later, after a rough life and recovering from drug and alcohol addiction, Ava marries the affluent Derek Grant in Arlington, the two having met while attending Narcotics Anonymous gatherings. After the ceremony, the newlyweds fly off for their honeymoon to a Caribbean island where Derek's family owns a summer home. One evening, the couple befriends a young local named Manny who invites them to a nightclub where Ava gets into a violent fight with several patrons following an encounter with local criminal Big Biz. The next morning, Manny invites Ava and Derek to ride \"El Vuidador\" (\"The Widowmaker\") a mile-long zip-line in the rainforest. Once there, Ava, who's afraid of heights, declines to go down the line, but Derek does and his harness snaps while descending, making him fall to the ground. Ava finds him in the forest, unconscious and severely injured, but alive. Unable to ride in the ambulance with her husband, she eventually reaches the hospital, where staff deny that Derek was brought in. After realizing that none of the island's other clinics and medical facilities have admitted her husband, Ava goes to the police to declare him missing. Stranded in a foreign land, faced with inaction from the local authorities and suspicion from her father-in-law, Ava tries to piece together what happened and find her husband, whatever it takes.",
  "synopsis": null
}