{
  "imdb_id": "tt2822578",
  "tmdb_id": "262169",
  "douban_id": null,
  "title": "Gravy (2015)",
  "genres": [
    "Comedy",
    "Horror"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.5,
  "director": [
    {
      "id": "nm0734442",
      "name": "James Roday"
    }
  ],
  "writer": [
    {
      "id": "nm0734442",
      "name": "James Roday",
      "description": null
    },
    {
      "id": "nm2090107",
      "name": "Todd Harthan",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0922995",
      "name": "Michael Weston",
      "character": "Anson"
    },
    {
      "id": "nm0801051",
      "name": "Jimmi Simpson",
      "character": "Stef"
    },
    {
      "id": "nm1900397",
      "name": "Sutton Foster",
      "character": "Kerry"
    },
    {
      "id": "nm2178959",
      "name": "Lily Cole",
      "character": "Mimi"
    },
    {
      "id": "nm1454378",
      "name": "Molly Ephraim",
      "character": "Cricket"
    },
    {
      "id": "nm0735467",
      "name": "Paul Rodriguez",
      "character": "Chuy"
    },
    {
      "id": "nm0089937",
      "name": "Lothaire Bluteau",
      "character": "Yannick"
    },
    {
      "id": "nm0761969",
      "name": "Ethan Sandler",
      "character": "Bert"
    },
    {
      "id": "nm1890981",
      "name": "Gabriel Luna",
      "character": "Hector"
    },
    {
      "id": "nm2829737",
      "name": "Gabourey Sidibe",
      "character": "Winketta"
    },
    {
      "id": "nm0798971",
      "name": "Sarah Silverman",
      "character": "Bethany"
    },
    {
      "id": "nm2687684",
      "name": "Stefanie E. Frame",
      "character": "Laundrette"
    },
    {
      "id": "nm0136441",
      "name": "Kate Rogal",
      "character": "Jez"
    },
    {
      "id": "nm0384211",
      "name": "Dulé Hill",
      "character": "Delroy"
    },
    {
      "id": "nm0734442",
      "name": "James Roday",
      "character": "Marty"
    }
  ],
  "overview": "It's All Hallow's Eve. A trio of costumed misfits with very special dietary requirements seizes a Mexican cantina and force the staff to engage in a late night of gaming, food and libations. The only caveat is what's on the menu.",
  "storyline": "It's All Hallow's Eve. A trio of costumed misfits with very special dietary requirements seizes a Mexican cantina and force the staff to engage in a late night of gaming, food and libations. The only caveat is what's on the menu.",
  "plot": "It's All Hallow's Eve. Anson (Michael Weston) enters a convenience store where he buys sorbet and flirts with the cashier, Bethany (Sarah Silverman). Nearby the employees of a Mexican Cantina &amp; Bar, waitress Cricket (Molly Ephraim), bartender Kerry (Sutton Foster), cook Yannick (Lothaire Bluteau), busboy Hector (Gabriel Luna), manager Chuy (Paul Rodriguez), and security guard Winketta (Gabourey Sidibe) close up the Cantina &amp; have a small party celebrating Kerry, who is leaving to become a paramedic. As the party wraps up the employees discover the doors have been welded shut and the phone lines are cut. Anson, his brother Stef (Jimmi Simpson), and Stef's girlfriend Mimi (Lily Cole) (the latter two having been at a table making out earlier) then appear and quickly take the employees hostage, tying them to chairs. Apparently uninterested in money, their true intentions soon become clear - they are sadists and cannibals, who plan to torture and eat the various employees.\n\nStef soon chains up Yannick in the kitchen to cook the various employees as they are dispatched in different sick and sadistic games. After the trio eat Chuy, Kerry pretends to be romantically interested in Anson to gain his trust, and comes onto him while retrieving a list of items from the pantry for Yannick to cook with.\n\nHowever while eating Winketta's corpse Stef starts to experience anaphylactic shock, and realizes Yannick has snuck basil into his food, which he had forbid earlier as he is highly allergic. Examining the list of items he realizes that Yannick used the Army of Portugal cipher to tell Kerry to bring him basil. While Stef and Yannick start fighting each other, in the other room Hector has managed to free himself and Cricket. Anson and Hector square off upstairs while Cricket and Kerry fight Mimi. Back in the kitchen, after a long battle with both parties sustaining horrible wounds, Stef manages to kill Yannick. Mimi kills Cricket, but Kerry manages to kill her, and just as it appears Hector will kill Anson, Anson kills Hector instead.\n\nAnson and Kerry reunite and head into the kitchen, where Anson sees his brothers condition and learns from Stef that Kerry betrayed him and brought Yannick the basil (Which Kerry confirms, and further tells him her apparent romantic interest in him was a ruse). While Anson holds his brother as he succumbs to his wounds and anaphylaxis, Kerry frees Bert, a random patron who was being kept hostage in the kitchen by Mimi. Together they head upstairs to escape through an opening for an air conditioner. When Anson suddenly runs out of the kitchen attempts to attack Kerry after Stef dies, she manages to shoot him with arrow. Thinking she is safe Kerry crawls out the opening, only for a revived Anson to appear &amp; take a bite out of her leg; however Kerry still manages to escape. Though the fall from the opening kills Bert, Kerry lives and is riding away on a Vespa when she is hit by an ambulance, whose driver happens to be someone she completed paramedic training with. As she is loaded into the ambulance, Kerry panics and notes that Anson (Who had been watching from the opening) has disappeared.\n\nSeveral months later, we see Anson consulting with his brother (who is now a pickled head impaled on a stick) before heading into the convenience store he went to in the beginning of the movie. He visits with Bethany (The clerk) and gives her a single red rose while proposing a romance between them, which Bethany agrees to. As Bethany and Anson share ice cream &amp; flirt, the camera pulls back to reveal Kerry across the street, scarred but alive, taking photos of them. She smiles slyly into the camera before the screen cuts to black.",
  "synopsis": null
}