{
  "imdb_id": "tt2866360",
  "tmdb_id": "220289",
  "douban_id": null,
  "title": "Coherence (2013)",
  "genres": [
    "Horror",
    "Mystery",
    "Sci-Fi",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "89 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm0126096",
      "name": "James Ward Byrkit"
    }
  ],
  "writer": [
    {
      "id": "nm0126096",
      "name": "James Ward Byrkit",
      "description": "screenplay"
    },
    {
      "id": "nm0126096",
      "name": "James Ward Byrkit",
      "description": "story by &"
    },
    {
      "id": "nm1178832",
      "name": "Alex Manugian",
      "description": "story by"
    }
  ],
  "cast": [
    {
      "id": "nm2032150",
      "name": "Emily Baldoni",
      "character": "Em       (as Emily Foxler)"
    },
    {
      "id": "nm0827561",
      "name": "Maury Sterling",
      "character": "Kevin"
    },
    {
      "id": "nm0107183",
      "name": "Nicholas Brendon",
      "character": "Mike"
    },
    {
      "id": "nm1032521",
      "name": "Lorene Scafaria",
      "character": "Lee"
    },
    {
      "id": "nm0001286",
      "name": "Elizabeth Gracen",
      "character": "Beth"
    },
    {
      "id": "nm0035730",
      "name": "Hugo Armstrong",
      "character": "Hugh"
    },
    {
      "id": "nm1178832",
      "name": "Alex Manugian",
      "character": "Amir"
    },
    {
      "id": "nm1266413",
      "name": "Lauren Maher",
      "character": "Laurie"
    },
    {
      "id": "nm5032019",
      "name": "Aqueela Zoll",
      "character": "Extra"
    },
    {
      "id": "nm9326130",
      "name": "Carrie Patterson",
      "character": "Extra"
    },
    {
      "id": "nm0233010",
      "name": "Kelly Donovan",
      "character": "Extra"
    },
    {
      "id": "nm1925806",
      "name": "Alexis Boozer Sterling",
      "character": "Extra       (as Alexis Boozer)"
    },
    {
      "id": "nm0050924",
      "name": "Mark Ballou",
      "character": "Extra"
    }
  ],
  "overview": "On the night of an astronomical anomaly, eight friends at a dinner party experience a troubling chain of reality bending events. Part cerebral sci-fi and part relationship drama, Coherence is a tightly focused, intimately shot film that quickly ratchets up with tension and mystery.",
  "storyline": "On the night of an astronomical anomaly, eight friends at a dinner party experience a troubling chain of reality bending events.",
  "plot": "The film involves six people at a dinner party. During their dinner, there is a comet that is passing over them. This causes their house and the occupants to intertwine with multiple such houses and occupants from other realities(Note that it is not just two realities that have come together but infinite realities that get tangled). There is a dark zone in between the realities. When someone passes through the dark zone, they leave their reality and enter another reality at random. The one person which the movie constantly follows is Emily(referred as Emily Prime here after).\n\nA powercut occurs initially and this marks the start of the intertwined realities. At a distance, outside, they see a house with lights on. They don’t know it’s the same house from another reality. At first, two of the guys exit the house to go make a phone call from the “other house” and cross over into another reality. Their doubles come in from another reality. No one realizes this switch As the story unfolds, they begin to realize that the other house is actually another version of theirs. But the group initially assumes that there are only two houses (from two realities). Later they realize that there are multiple realities and that once the comet passes, each reality will be stuck permanently with whoever stays in it.\n\nAs time passes, different groups of people leave the house and cross over the dark zone. This results in everyone getting jumbled across different realities. Due to past events between people in the group, there are various fights that break out. Emily Prime is frustrated and leaves on her own. She wanders from one reality to another. Each of the realities have gotten into fights of their own. In each reality, people have gotten mixed up from different realities and there is chaos. Finally, she stumbles upon one reality where no one is fighting. In this reality, they have never had a powercut(the event that kick-starts the happenings of the Prime Reality).The group is intact and hence are having a normal evening.\n\nEmily Prime wants to replace the Emily from this reality and take on her life and be happy. Emily Prime sneaks up on her double and drugs her. First, she throws her in the trunk and later attacks her in the bathroom and puts her in the bathtub. Emily Prime then heads to the living room and faints. She wakes up the next morning on the sofa and does not see her double anywhere around. Emily Prime leaves the house and meets Kevin outside. His phone rings and he looks at his cell phone and states the call is from Emily. Upon answering the call, he gives a suspicious look towards Emily Prime and she stares back with guilt. The reality that Emily Prime is in now permanently has 2 Emilys in it.",
  "synopsis": null
}