{
  "imdb_id": "tt2828840",
  "tmdb_id": "180651",
  "douban_id": null,
  "title": "Fists of Legend (2013)",
  "genres": [
    "Action"
  ],
  "country": "South Korea",
  "version": [],
  "imdb_rating": 6.9,
  "director": [
    {
      "id": "nm0437652",
      "name": "Woo-Suk Kang"
    }
  ],
  "writer": [
    {
      "id": "nm1393925",
      "name": "Min-seok Jang",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm3673399",
      "name": "Cheol-woo Han",
      "character": ""
    },
    {
      "id": "nm1058565",
      "name": "Jung-min Hwang",
      "character": "Im Deok-gyu       (as Jeong-min Hwang)"
    },
    {
      "id": "nm1081518",
      "name": "Woong-in Jeong",
      "character": "(as Woong-in Jung)"
    },
    {
      "id": "nm1035593",
      "name": "Seong-jin Kang",
      "character": "Announcer"
    },
    {
      "id": "nm1030827",
      "name": "Yo-won Lee",
      "character": ""
    },
    {
      "id": "nm3683989",
      "name": "Jung-min Park",
      "character": "Young Im Deok-gyoo"
    },
    {
      "id": "nm1741007",
      "name": "Joe Thomas",
      "character": "Various       (voice)"
    },
    {
      "id": "nm5565766",
      "name": "Ji Woo",
      "character": "Lim Soo-bin"
    },
    {
      "id": "nm0950510",
      "name": "Joon-Sang Yoo",
      "character": ""
    },
    {
      "id": "nm2175143",
      "name": "Je-mun Yun",
      "character": ""
    }
  ],
  "overview": "On a television show billed as “the greatest fight show on Earth,” eager amateurs with lots to prove boldly step into the ring and expect to leave bloody but victorious. The ratings hungry producers seek out “legendary” but largely forgotten streetfighters and mine their desperation for recaptured glory and redemption into ratings gold.",
  "storyline": "On a television show billed as \"the greatest fight show on Earth,\" eager amateurs with lots to prove boldly step into the ring and expect to leave bloody but victorious. The ratings hungry producers seek out \"legendary\" but largely forgotten streetfighters and mine their desperation for recaptured glory and redemption into ratings gold. Three old friends and rivals from high school days who get their invitation to the big fight for the chance to win $200,000 and much more. 25 years later - Deok-kyu, whose Olympic dreams were dashed, now runs a struggling noodle shop. Jae-seok who always wanted to be number one but still finds himself in a third-rate gang. And Sang-hoon, a thug turned corporate executive who must go back and find his bloodlust one last time.",
  "plot": "A moment of bad luck derailed Deok-kyu's Olympic dreams and led him and his friends to jail. Jin-ho got out of jail quickly because of his rich parents, but Deok-kyu, Jae-seok, and Sang-hoon were not so lucky.\n\nYears later, while running a noodle shop to earn extra money following an accident involving his daughter, Deok-kyu accepts an invitation to join a televised mixed martial arts tournament, Fists of Legend. A group of middle-aged men who used to be called \"legends\" during their teenage high school days take part in the \"real action fighting\" reality show, and the winner gets a prize of ₩20 million every round, for a total of ₩200 million (US$183,823). Among the contestants are Deok-kyu's old friends Sang-hoon, currently a manager at a large company who lacks in self-respect after getting passed over for a promotion, and Jae-seok, now a good-for-nothing guy who dreams of becoming a somebody.",
  "synopsis": null
}