{
  "imdb_id": "tt2821832",
  "tmdb_id": "220514",
  "douban_id": null,
  "title": "HazMat (2013)",
  "genres": [
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "80 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.8,
  "director": [
    {
      "id": "nm4840973",
      "name": "Lou Simon"
    }
  ],
  "writer": [
    {
      "id": "nm4840973",
      "name": "Lou Simon",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4533579",
      "name": "Norbert Velez",
      "character": "Jacob /              Hazmat"
    },
    {
      "id": "nm4484899",
      "name": "Aniela McGuinness",
      "character": "Brenda"
    },
    {
      "id": "nm4673595",
      "name": "Todd Bruno",
      "character": "David"
    },
    {
      "id": "nm5611803",
      "name": "GiGi Calero",
      "character": "Melanie       (as Gema Calero)"
    },
    {
      "id": "nm3896964",
      "name": "Giordan Diaz",
      "character": "Gary"
    },
    {
      "id": "nm2067192",
      "name": "Tom Stedham",
      "character": "Steven"
    },
    {
      "id": "nm5611209",
      "name": "Daniela Larez",
      "character": "Carla"
    },
    {
      "id": "nm4568847",
      "name": "Reggie Peters",
      "character": "Adam"
    },
    {
      "id": "nm5150820",
      "name": "Mario Nalini",
      "character": "Tim"
    },
    {
      "id": "nm4049510",
      "name": "Dennis Spain",
      "character": "Ed"
    },
    {
      "id": "nm4007658",
      "name": "Brandi Rudicil",
      "character": "Regina"
    },
    {
      "id": "nm5613764",
      "name": "Massiel Checo",
      "character": "Stacy"
    }
  ],
  "overview": "The television crew of the \"Scary Antics\" hidden camera show sets up a disturbed young man for a practical joke, but the joke is on them when heads roll.",
  "storyline": "Jacob is a troubled soul and when his friends pull a prank on him in the very place his father was killed, he snaps, grabs an ax and hunts them down like animals. Trapped inside, they must fight for their lives from this disturbed ax-wielding maniac.",
  "plot": "Scary Antics, a struggling reality show about pranking people, finds its next \"chump\" in the form of Jacob, an awkward young man who is convinced that the abandoned chemical plant where his father died is haunted. Jacob was brought to the attention of the show by his friend Adam, who believes that pranking Jacob might scare him enough to make him move past his father's death, and his obsession with the plant.\n\nAdam, his girlfriend Carla, and her friend Melanie are to take Jacob to the plant, and explore it with him as the host of Scary Antics and three members of the show's crew watch them through cameras while situated in a sealed office. Jacob finds and puts on an incomplete hazmat suit before an actor, who is wearing a full hazmat suit, jumps out to frighten him. Panicking, Jacob kills the man with an old fire axe, and seemingly has a psychotic break due to realizing what he has done, and that he is the butt of an elaborate joke. Jacob dons the actor's mask, murders Adam and Carla, and chases Melanie to the office, which he is unable to break into. Melanie and the others are trapped without sustenance, no way to contact help, and with no one knowing where they are due to the host going ahead with filming without informing the network, which required permits and documents that he could not afford.\n\nAfter Jacob kills a technician who stops by, the host and one of the crew use their only map to locate the back exit, which Jacob locks after catching and murdering the two. Brenda, one of the remaining two crew members, goes out and reclaims the map, but is followed back to the office by Jacob, who forces his way in before the door can be resealed. Melanie and Brenda make a run for it while Jacob axes the other crew member, and they try to use the map to find another way out.\n\nJacob finds the two, kills Melanie, and fights Brenda. During the struggle, Brenda pulls off Jacob's mask to reveal that his face and head have become disfigured and corpse-like, implying that he is possessed, and that the plant really is haunted. Brenda incapacitates Jacob, and reaches the other exit she and Melanie were looking for, but before she can escape the recovered Jacob pulls her back inside, and hacks her to pieces.",
  "synopsis": null
}