{
  "imdb_id": "tt2825806",
  "tmdb_id": "417739",
  "douban_id": null,
  "title": "The Other Side of the Mountain (2012)",
  "genres": [
    "Drama",
    "Romance",
    "War"
  ],
  "country": "North Korea",
  "version": [
    {
      "runtime": "103 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.0,
  "director": [
    {
      "id": "nm0417531",
      "name": "In Hak Jang"
    }
  ],
  "writer": [
    {
      "id": "nm5612433",
      "name": "Joon Bai",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm5612463",
      "name": "Hyang Suk Kim",
      "character": "Son Ah Song"
    },
    {
      "id": "nm5612478",
      "name": "Ryung Min Kim",
      "character": "Il Gyu Ri"
    },
    {
      "id": "nm5612432",
      "name": "Jung Taik Park",
      "character": "Su Jin"
    }
  ],
  "overview": "During the Korean War, a young nurse in the small town of Chunamri, North Korea, saves a wounded South Korean soldier who has been left behind during battle. Brought together by the unfortunate circumstance of war, theirs is a fateful meeting. His identity is unknown to her until he must return to South Korea. With the promise to return, the nurse waits a lifetime for him. Separated by war and countries between them, the young man tries everything to get back to the North but diplomatic relations between countries make it impossible for their reunion. As the years go by and their youth slips away from them, he finally gets an unexpected opportunity to fulfill his wish and return to her. But reunions are not easy and after years apart, they are met with more tragedy.",
  "storyline": "During the Korean War, a young local nurse in the small town of Chunamri, North Korea saves a wounded Southern soldier who has been left behind during battle. Brought together by their unfortunate circumstance of war, theirs is a fateful meeting. His identity is unknown to her until he must return to South Korea. With the promise to return, the nurse waits a lifetime for him. Separated by war and countries between them, the young man tries everything to get back to the North but diplomatic relations between countries made it impossible for their reunion. As the years go by and their youth along with the memories of their happiest times slip away from them, he finally gets an unexpected chance to fulfill his wish and return to her. But reunions are not easy and after years apart, they are met with more tragic news.",
  "plot": null,
  "synopsis": null
}