{
  "imdb_id": "tt2814502",
  "tmdb_id": "375733",
  "douban_id": null,
  "title": "The Record Man (2015)",
  "genres": [
    "Documentary",
    "Biography",
    "History",
    "Music"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "107 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.8,
  "director": [
    {
      "id": "nm0602128",
      "name": "Mark Moormann"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm0015830",
      "name": "Steve Alaimo",
      "character": "Himself"
    },
    {
      "id": "nm6952358",
      "name": "Kyle Becker",
      "character": "Young Henry Stone"
    },
    {
      "id": "nm0114434",
      "name": "Peter H. Brown",
      "character": ""
    },
    {
      "id": "nm0129683",
      "name": "Bobby Caldwell",
      "character": "Himself"
    },
    {
      "id": "nm1241044",
      "name": "Harry Wayne Casey",
      "character": "Himself"
    },
    {
      "id": "nm6406364",
      "name": "Ray Caviano",
      "character": "Himself"
    },
    {
      "id": "nm1291649",
      "name": "Willie Clarke",
      "character": "Himself"
    },
    {
      "id": "nm1214864",
      "name": "Richard Finch",
      "character": "Himself"
    },
    {
      "id": "nm0344327",
      "name": "Alan Grubman",
      "character": "Himself"
    },
    {
      "id": "nm2033496",
      "name": "Jimmy 'Bo' Horne",
      "character": "Himself"
    },
    {
      "id": "nm6406362",
      "name": "Terry Kane",
      "character": "Himself"
    },
    {
      "id": "nm0490223",
      "name": "Benny Latimore",
      "character": "Himself       (as Benny Lattimore)"
    },
    {
      "id": "nm1649854",
      "name": "George McCrae",
      "character": "Himself"
    },
    {
      "id": "nm0601844",
      "name": "Sam Moore",
      "character": "Himself"
    },
    {
      "id": "nm3404647",
      "name": "Raphael Munnings",
      "character": "Himself"
    },
    {
      "id": "nm1709007",
      "name": "Janet Oseroff",
      "character": "Herself"
    },
    {
      "id": "nm1294489",
      "name": "Clarence Reid",
      "character": "Himself"
    },
    {
      "id": "nm6406363",
      "name": "King Sporty",
      "character": "Himself"
    },
    {
      "id": "nm5606731",
      "name": "Henry Stone",
      "character": "Himself"
    },
    {
      "id": "nm2034617",
      "name": "Joe L. Stone",
      "character": "Himself"
    },
    {
      "id": "nm1601824",
      "name": "Timmy Thomas",
      "character": "Himself"
    },
    {
      "id": "nm1312854",
      "name": "Anita Ward",
      "character": "Herself"
    },
    {
      "id": "nm1678013",
      "name": "Betty Wright",
      "character": "Herself"
    }
  ],
  "overview": "THE RECORD MAN is a uniquely American story of how a group of musical underdogs with raw talent and diverse backgrounds, led by the indefatigable determination of one man, Henry Stone, exported the music of Miami to the world.  Before there was a “music business” there was Henry Stone, “The Record Man”. From distributing records out of his '48 Packard to establishing TK Records as the largest independent label of the 1970s, Henry had an ear for hits. His funky eight-track studio and chart topping family of artists including KC and the Sunshine Band, led to the original Miami Sound and birth of Disco. When his empire collapsed on a baseball field in Chicago in 1979, Henry didn’t miss a beat launching Miami Freestyle. Turning personal tragedy into an opportunity to empower others, through Henry Stone we witness the dramatic arc of the record business from inception through the digital age. With photographs unearthed after 40 years, THE RECORD MAN captures a forgotten musical history.",
  "storyline": "Before there was a \"music business\" there was Henry Stone, \"The Record Man\". From distributing records out of his '48 Packard to establishing TK Records as the largest independent label of the 1970s, Henry had an ear for hits. His funky eight-track studio and chart topping family of artists including KC and the Sunshine Band, led to the original Miami Sound and birth of Disco. When his empire collapsed on a baseball field in Chicago in 1979, Henry didn't miss a beat launching Miami Freestyle. Turning personal tragedy into an opportunity to empower others, through Henry Stone we witness the dramatic arc of the record business from inception through the digital age. With photographs unearthed after 40 years, THE RECORD MAN captures forgotten musical history.",
  "plot": "Lee Kang-hee, an editor at an influential conservative newspaper, raises congressman Jang Pil-woo to the position of leading Presidential candidate using the power of the press; behind this is his secret deal with the paper's biggest sponsor.\n\nAhn Sang-goo, a political henchman who supported Lee and Jang, gets caught pocketing the record of the sponsor's slush fund, resulting in a dismembered hand. Woo Jang-hoon, an ambitious prosecutor, starts to investigate the relationship between Jang and the sponsor, believing that it's his only chance to make it to the top. While getting down to the brass tacks of the case, Woo meets Ahn, who has been methodically planning his revenge. Now the war between the one blinded with power, the one hell-bent on vengeance, and the one eager for success begins.",
  "synopsis": null
}