{
  "imdb_id": "tt2884018",
  "tmdb_id": "225728",
  "douban_id": null,
  "title": "Macbeth (2015)",
  "genres": [
    "Drama",
    "History",
    "War"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "113 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.7,
  "director": [
    {
      "id": "nm2355933",
      "name": "Justin Kurzel"
    }
  ],
  "writer": [
    {
      "id": "nm0521974",
      "name": "Todd Louiso",
      "description": "screenplay &"
    },
    {
      "id": "nm1105617",
      "name": "Jacob Koskoff",
      "description": "screenplay and"
    },
    {
      "id": "nm2078681",
      "name": "Michael Lesslie",
      "description": "screenplay"
    },
    {
      "id": "nm0000636",
      "name": "William Shakespeare",
      "description": "play"
    }
  ],
  "cast": [
    {
      "id": "nm7752797",
      "name": "Jack Madigan",
      "character": "Macbeth Child"
    },
    {
      "id": "nm7752798",
      "name": "Frank Madigan",
      "character": "Macbeth Child"
    },
    {
      "id": "nm1055413",
      "name": "Michael Fassbender",
      "character": "Macbeth"
    },
    {
      "id": "nm0182839",
      "name": "Marion Cotillard",
      "character": "Lady Macbeth"
    },
    {
      "id": "nm0175916",
      "name": "Paddy Considine",
      "character": "Banquo"
    },
    {
      "id": "nm7752799",
      "name": "Lochlann Harris",
      "character": "Fleance"
    },
    {
      "id": "nm7549368",
      "name": "Kayla Fallon",
      "character": "Young Witch"
    },
    {
      "id": "nm6628950",
      "name": "Lynn Kennedy",
      "character": "Middle-Aged Witch"
    },
    {
      "id": "nm6359236",
      "name": "Seylan Baxter",
      "character": "Older Witch"
    },
    {
      "id": "nm7391867",
      "name": "Amber Rissmann",
      "character": "Child Witch"
    },
    {
      "id": "nm7373417",
      "name": "Scot Greenan",
      "character": "Young Boy Soldier"
    },
    {
      "id": "nm0574436",
      "name": "Hilton McRae",
      "character": "Macdonwald"
    },
    {
      "id": "nm0000667",
      "name": "David Thewlis",
      "character": "Duncan"
    },
    {
      "id": "nm0371342",
      "name": "David Hayman",
      "character": "Lennox"
    },
    {
      "id": "nm2930503",
      "name": "Jack Reynor",
      "character": "Malcolm"
    },
    {
      "id": "nm0630003",
      "name": "Brian Nickels",
      "character": "Thane of Cawdor"
    },
    {
      "id": "nm5901379",
      "name": "James Harkness",
      "character": "Angus"
    },
    {
      "id": "nm5105119",
      "name": "Ross Anderson",
      "character": "Rosse"
    },
    {
      "id": "nm0365317",
      "name": "Sean Harris",
      "character": "Macduff"
    },
    {
      "id": "nm1273657",
      "name": "Scott Dymond",
      "character": "Seyton"
    },
    {
      "id": "nm0747687",
      "name": "Maurice Roëves",
      "character": "Menteith"
    },
    {
      "id": "nm4456120",
      "name": "Elizabeth Debicki",
      "character": "Lady Macduff"
    },
    {
      "id": "nm6875905",
      "name": "Andrew Gourlay",
      "character": "Ghost Soldier"
    },
    {
      "id": "nm5663632",
      "name": "Eleanor Stagg",
      "character": "Macduff Child 1"
    },
    {
      "id": "nm6813974",
      "name": "William Stagg",
      "character": "Macduff Child 2"
    },
    {
      "id": "nm5662973",
      "name": "Matthew Stagg",
      "character": "Macduff Child 3"
    },
    {
      "id": "nm5039410",
      "name": "Rebecca Benson",
      "character": "Maidservant"
    },
    {
      "id": "nm6745863",
      "name": "Gerard Miller",
      "character": "Messenger"
    },
    {
      "id": "nm0760207",
      "name": "Roy Sampson",
      "character": "Doctor"
    },
    {
      "id": "nm0518843",
      "name": "Phil Lonergan",
      "character": "Masked Attacker       (as Phil Longergan)"
    }
  ],
  "overview": "Feature film adaptation of Shakespeare's Scottish play about General Macbeth whose ambitious wife urges him to use wicked means in order to gain power of the throne over the sitting king, Duncan.",
  "storyline": "Macbeth, the Thane of Glamis, receives a prophecy from a trio of witches that one day he will become King of Scotland. Consumed by ambition and spurred to action by his wife, Macbeth murders his king and takes the throne for himself.",
  "plot": "Act I\n\nThe film starts with the funeral of Macbeth and Lady Macbeth's child, with both parents grieving for their loss. The funeral is not in Shakespeare's play, nor does the play directly mention the death of a child, but in Act 1, Scene 7, Lady Macbeth says \"I have given suck, and know how tender 't is to love the babe that milks me,\" so the loss of a child can fairly be inferred.\n\nMacbeth, who supports King Duncan in the civil war, is leading royal troops into a final battle. Macbeth emerges victorious, but there are heavy losses, including many boy soldiers. The battle is observed by three women with a small girl and an infant. They approach Macbeth and Banquo, hailing Macbeth as Thane of Cawdor and future King, and Banquo as a father of Kings, before disappearing in the mist.\nAct II\n\nElsewhere, Duncan hears about Macbeth's victory and is brought the Thane of Cawdor who, deemed to be a traitor because he has allied himself with the Norse invaders, is stripped of his title and executed. The King orders his servants to take the title of Thane of Cawdor to Macbeth, who reacts uncertainly. Macbeth sends a message ahead to his wife, Lady Macbeth, telling her about the witches' prophecies. Lady Macbeth then prays to the dark spirits in the village church, asking them for guidance. When Macbeth and his soldiers return, and her husband tells Lady Macbeth that Duncan will stay one night as their guest, she urges Macbeth to kill the King to fulfill the prophecy made by the witches. Duncan arrives at the village and a feast is being held, where the King pronounces Malcolm as his heir. Macbeth still hesitates and Lady Macbeth persuades him to commit the deed, while she slips a sleeping potion to the King's servants. After the feast ends, Macbeth sees a ghost of one of the boy soldiers who had been killed during the battle who gives him a dagger and leads him towards Duncan's tent. Macbeth brutally slays Duncan. Malcolm enters the tent and, seeing what Macbeth has done, flees in fear. Shaken, Macbeth goes to his wife and gives her the dagger he has used to kill the King. Lady Macbeth rebukes him, saying that he should have left them in the tent and she goes herself to place the dagger in the hands of the sleeping chamberlains. Later she meets Macbeth in the church where they both wash the blood from their hands and she tells him that the water has washed their deed away.\nAct III\n\nIn the morning, Macduff enters the tent to wake Duncan, only to discover that he is dead. Macbeth summarily executes the sleeping servants to prevent their denial of the murder. Macduff and Lennox, a Scottish noble, discuss that as Malcolm has fled to England that puts him under suspicion of being involved in the murder. They also admire Macbeth's justice on the supposedly-treacherous servants in the rightful fit of anger. With Malcolm gone, Macbeth is asked to become King of Scotland. After the coronation he sits in a sour mood in his chamber where Lady Macbeth comes to him. He complains that killing Duncan was for nothing as Macbeth has no heirs to inherit the crown which will pass to Banquo and his son, Fleance, according to the prophecy. He invites Banquo with his son to a banquet and finds out that they both plan to leave. As Banquo is becoming suspicious, Macbeth sends three assassins to murder him. Banquo is killed, but Fleance escapes to the woods.\n\nDuring the evening, Macbeth makes a comment about Banquo not keeping his promise to be at the feast. When the assassins arrive, Macbeth asks if they have succeeded and is enraged when he finds out that Fleance has escaped. Then Macbeth sees Banquo's ghost in his armour standing among other guests next to the table. Macbeth is afraid and starts to talk to the ghost which is unseen by anyone else present. Lady Macbeth tries to calm everyone by claiming that her husband is unwell, but Macbeth continues to rave, which prompts Macduff and his wife to leave the feast despite the King ordering them to stay. Lady Macbeth dismisses all the guests and takes Macbeth back to their chamber.\nAct IV\n\nMacbeth travels by night to talk to the three witches. Once he finds them, they show him a vision of slain soldiers who tell him to beware of Macduff, and that Macbeth shall be King until Great Birnam Wood comes to Dunsinane Hill, where the royal castle is built. Finally, the ghost of the slain boy soldier who gave him the dagger tells Macbeth that he won't be slain by any man born of a woman. The King is found wandering the hills by Lennox who tells him that Macduff has fled to England. Anxious at this, in a fit of rage, Macbeth orders Macduff's family and servants to be killed. Lady Macduff and her children are captured and burned at the stake, while a distraught Lady Macbeth watches the execution. After the burning she takes out the dagger that was used to kill Duncan and repeatedly washes it.\n\nMeanwhile, Macduff meets up with Malcolm, who is gathering troops in England to march on Scotland. Ross and Angus inform Macduff about the murder of his family and servants. Stricken with grief and anger, Macduff swears revenge and both he and Malcolm (who supports Macduff) join forces to challenge Macbeth.\nAct V\n\nHaunted by guilt, Lady Macbeth returns to the church in her village, which is now abandoned, and laments the terrible deeds that have been done, and how her hands are covered in blood. She then sees the ghost of her dead child, which she urges to go to bed. Then she wanders in the hills and sees the three witches as she walks towards them.\n\nIn the castle, rumours spread that Macbeth has gone mad and his subjects fear his anger and tyrannical behaviour. Macbeth is told that his wife is dead. Saying \"tomorrow and tomorrow and tomorrow\", he then lifts her body and carries it around the chamber in despair. Seyton then brings him news that Malcolm is leading an army against him and Macbeth orders his armour to be brought to him.\n\nMacduff sets Birnam Wood on fire, with the smoke and ashes blowing towards the castle, seemingly making the witches' prophecy come true. Macbeth leaves the castle to face the attacking army and engages in a duel with Macduff. Macbeth is confident that he will win as \"no man born of woman\" can kill him. Macduff then tells him that he was untimely ripped from his mother's womb and, using Macbeth's distraction, he stabs him. Macbeth starts to regret the mistakes he has made through his tyranny, despite knowing all too well that it's too late to redeem himself. Rather than surrendering, Macbeth refuses to accept defeat and to bow down before Malcolm. As soon as he finishes making his final speech to Macduff, Macbeth allows himself to be fatally stabbed by his nemesis. The three witches, who were observing the battle, leave when Macbeth dies on the battlefield. Immediately after Macbeth's death, Malcolm is hailed King of Scotland and he, Macduff and their forces abandon Macbeth's corpse and make their way to his castle.\n\nMalcolm leaves the throne room while Fleance takes Macbeth's sword and charges through the empty battlefield, disappearing into the smoke.",
  "synopsis": null
}