{
  "imdb_id": "tt2883512",
  "tmdb_id": "212778",
  "douban_id": null,
  "title": "Chef (2014)",
  "genres": [
    "Adventure",
    "Comedy",
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "114 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm0269463",
      "name": "Jon Favreau"
    }
  ],
  "writer": [
    {
      "id": "nm0269463",
      "name": "Jon Favreau",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0269463",
      "name": "Jon Favreau",
      "character": "Carl Casper"
    },
    {
      "id": "nm0000491",
      "name": "John Leguizamo",
      "character": "Martin"
    },
    {
      "id": "nm0134072",
      "name": "Bobby Cannavale",
      "character": "Tony"
    },
    {
      "id": "nm3492402",
      "name": "Emjay Anthony",
      "character": "Percy"
    },
    {
      "id": "nm0424060",
      "name": "Scarlett Johansson",
      "character": "Molly"
    },
    {
      "id": "nm0000163",
      "name": "Dustin Hoffman",
      "character": "Riva"
    },
    {
      "id": "nm0005527",
      "name": "Sofía Vergara",
      "character": "Inez"
    },
    {
      "id": "nm0001624",
      "name": "Oliver Platt",
      "character": "Ramsey Michel"
    },
    {
      "id": "nm0781238",
      "name": "Amy Sedaris",
      "character": "Jen"
    },
    {
      "id": "nm0000375",
      "name": "Robert Downey Jr.",
      "character": "Marvin"
    },
    {
      "id": "nm0992289",
      "name": "Russell Peters",
      "character": "Miami Cop"
    },
    {
      "id": "nm6418381",
      "name": "Chase Grimm",
      "character": "Vendor"
    },
    {
      "id": "nm3561592",
      "name": "Will Schutze",
      "character": "Mr. Bonetangles"
    },
    {
      "id": "nm0762121",
      "name": "Gloria Sandoval",
      "character": "Flora"
    },
    {
      "id": "nm6418382",
      "name": "Jose C. Hernandez",
      "character": "Abuelito       (as Jose C. Hernandez 'Perico')"
    },
    {
      "id": "nm6418383",
      "name": "Alberto Salas",
      "character": "Band Member"
    },
    {
      "id": "nm2189904",
      "name": "Alfredo Ortiz",
      "character": "Band Member"
    },
    {
      "id": "nm6418384",
      "name": "Daniel Palacio",
      "character": "Band Member"
    },
    {
      "id": "nm6418385",
      "name": "Mauricio Del Monte",
      "character": "Band Member"
    },
    {
      "id": "nm6418386",
      "name": "Leonardo Da Nilo",
      "character": "Versailles Host"
    },
    {
      "id": "nm3103935",
      "name": "Nili Fuller",
      "character": "Marvin's Assistant"
    },
    {
      "id": "nm6418387",
      "name": "Charles Lao",
      "character": "Kitchen Supply Clerk"
    },
    {
      "id": "nm6418388",
      "name": "Benjamin Jacob",
      "character": "Himself"
    },
    {
      "id": "nm5079121",
      "name": "Aaron Franklin",
      "character": "Himself"
    },
    {
      "id": "nm2237175",
      "name": "Gary Clark Jr.",
      "character": "Himself"
    },
    {
      "id": "nm3467605",
      "name": "Roy Choi",
      "character": "Himself"
    },
    {
      "id": "nm2811689",
      "name": "Christina Cha",
      "character": "Shocked Restaurant Patron"
    },
    {
      "id": "nm1109559",
      "name": "Miguel Izaguirre",
      "character": "Food Truck Customer"
    }
  ],
  "overview": "A chef who loses his restaurant job starts up a food truck in an effort to reclaim his creative promise, while piecing back together his estranged family.",
  "storyline": "Carl Casper is an acclaimed chef with a family life that seems as decaying as his artistic freedom. Those frustrations boil over into a raucous viral-videoed public confrontation against a restaurant critic who panned his cooking of food that his boss ordered him to make against his instincts. Now with his career ruined, Carl's ex-wife offers an unorthodox solution in Miami: refit an old food truck to offer quality cooking on his own terms. Now with his young son, Percy, and old colleague, Martin, helping, Carl takes a working trip across America with that truck to rediscover his gastronomic passion. With Percy's tech savvy and Martin's enthusiasm, Carl finds that he is creating a traveling sensation on the way home. In doing so, Carl discovers he is serving up more than simply food, but also a deeper connection with his life and his family that is truly delicious in its own way.",
  "plot": null,
  "synopsis": "Miami-born Carl Casper is the head chef of Gauloise in Brentwood, California. While popular with his kitchen staff and hostess Molly, the restaurant owner Riva wants Carl to stick to tired \"classics\" rather than innovative dishes. Carl has a strained relationship with his tech-savvy preteen son Percy and rich ex-wife Inez.When Carl has a chance to prove his creative talents during a visit from prestigious critic and blogger Ramsey Michel, Riva demands that he stick with old favorites at the last minute, causing Carl to concede, leading to a scathing review. On Twitter, Carl insults Ramsey for the review, not realizing that his reply is public, and gains a large Twitter following. Carl comes up with an inspirational new menu that his staff loves and invites Ramsey to a \"rematch\". Carl walks out, quitting after confronting Riva as the owner wants the same old menu again. At home, he prepares the menu he wanted to serve to Ramsey. Carl's assistant becomes the interim chef and even the regular dishes become a disaster. Ramsey again starts to tweet bad about Carl quitting, leading Carl to go to the restaurant, where he angrily and publicly berates Ramsey.Videos featuring Carl's meltdown go viral, and his professional credibility evaporates. Molly and Inez encourage him to run a food truck. He accepts Inez's invitation to Miami, where he spends some quality time with Percy and rediscovers his love for Cuban cuisine. Inez's ex-husband Marvin offers him a dilapidated food truck, and Carl reluctantly accepts. He also finds out that Marvin and Inez spent some time together after his divorce from Inez, which made him a little angry. He and Percy bond while restoring the truck and buying groceries and Carl buys him a chef's knife. Martin, his friend from Gauloise, turns down his restaurant promotion to work with Carl, who has become an exuberant and passionate chef again.The three drive the food truck across the country back to Los Angeles, serving top-quality Cuban sandwiches and yuca fries. Percy finds ways to promote the food truck on social media websites, and the truck becomes successful in New Orleans and Austin, Texas, where the daily specials include items made with local ingredients such as po' boys and barbecued brisket.Back in Los Angeles, Carl realizes the importance of his relationship with his son and accepts Percy's enthusiastic offer to help out on weekends and holidays. Ramsey visits the truck to explain that he wrote the bad review as he knew Carl's creativity did not suit a restaurant which had been serving the same menu for years. He leaves with an offer to bankroll a new restaurant where Carl will have full control of the menu. Flash forward six months later, the new restaurant is successful and closed for a private event: Carl and Inez's remarriage ceremony."
}