{
  "imdb_id": "tt2891774",
  "tmdb_id": "286223",
  "douban_id": null,
  "title": "Shadow Zombie (2013)",
  "genres": [
    "Documentary",
    "Drama",
    "Fantasy",
    "Horror"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "73 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm3773771",
      "name": "Jorge Torres-Torres"
    }
  ],
  "writer": [
    {
      "id": "nm3773771",
      "name": "Jorge Torres-Torres",
      "description": "story"
    },
    {
      "id": "nm3773771",
      "name": "Jorge Torres-Torres",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm2219951",
      "name": "Shane Cormier",
      "character": "Himself /              Kims best friend"
    },
    {
      "id": "nm0234068",
      "name": "Eva Dorrepaal",
      "character": "Brandi's Mother"
    },
    {
      "id": "nm5767944",
      "name": "Kim Filth",
      "character": "Kim Spell /              Shadow Zombie"
    }
  ],
  "overview": "Kim lives with his dad, sells weed to skaters, writes poetry, and snorts painkillers to get through the day. One evening, while strolling through the subdivision painted up as his alter ego Shadow Zombie, Kim catches the eye of a registered nurse and part-time clown Brandi. What follows is a brief romance marked by destruction by the very real phantoms emanating from Kim's dead-end present and Brandi's traumatic past. Shooting under near-documentary conditions in and around Lafayette, Louisiana, Jorge Torres-Torres operates peopling his film with a coterie of genuine Acadiana misfits. The merciless and at times unexpectedly poignant observation of Kim's world dares to see through to the human core of a drug addict or clinically depressed clown.",
  "storyline": "A southern tale of love and death set deep in Louisiana country. A lonely drug dealer (Kim Filth) finds peace when he transforms into his alter ego, Shadow Zombie, by merely painting his face and snorting painkillers.",
  "plot": "Two families must survive a zombie attack.",
  "synopsis": null
}