{
  "imdb_id": "tt2873250",
  "tmdb_id": "226109",
  "douban_id": null,
  "title": "Il était une forêt (2013)",
  "genres": [
    "Documentary"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "78 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.7,
  "director": [
    {
      "id": "nm0415207",
      "name": "Luc Jacquet"
    }
  ],
  "writer": [
    {
      "id": "nm0415207",
      "name": "Luc Jacquet",
      "description": "written by"
    },
    {
      "id": "nm5646210",
      "name": "Francis Hallé",
      "description": "original idea"
    }
  ],
  "cast": [
    {
      "id": "nm5646210",
      "name": "Francis Hallé",
      "character": "Himself"
    },
    {
      "id": "nm1327811",
      "name": "Michel Papineschi",
      "character": "Narrator       (voice)"
    }
  ],
  "overview": "With Once Upon a Forest, Luc Jacquet invites the spectator into a never-before-seen world of natural wonder and staggering beauty. “For the first time, we will be able to watch a rain forest growing before our eyes…Only cinema can offer this unique voyage into a completely untamed universe, a world of perfect balance in which each living thing – from the smallest to the largest – plays an essential role. The film will deliver a complete sensory immersion in the primaeval splendor of one of nature’s richest mysteries, inviting the audience to enter, discover and marvel at a universe of untold treasures while joining its voice to the ever-growing awareness of the need to preserve our world.”",
  "storyline": "From the creators of March of the Penguins and The Fox and the Child. Written and directed by Luc Jaquet, Once Upon a Forest invites the spectator into a never-before-seen world of natural wonder and staggering beauty. For the first time, we will be able to watch a rainforest growing before our eyes. Drawing on a vast fund of research and knowledge, Once Upon a Forest will lead viewers on a journey into the depths of the tropical jungle, into the very heart of life on earth. For years, Luc Jacquet has spellbound audiences worldwide with his intimate yet spectacular stories of the natural world. His encounter with pioneering botanist and ecologist Francis Hallé was to give birth to this extraordinary exploration of the prehistoric rainforests, the great green lungs of our planet. Once Upon a Forest offers this unique voyage into a completely untamed universe, a world of perfect balance in which each living thing - from the smallest to the largest - plays an essential role. The film ...",
  "plot": null,
  "synopsis": null
}