{
  "imdb_id": "tt2825120",
  "tmdb_id": "253451",
  "douban_id": null,
  "title": "Crows Explode (2014)",
  "genres": [
    "Action"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "129 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm0870313",
      "name": "Toshiaki Toyoda"
    }
  ],
  "writer": [
    {
      "id": "nm2626759",
      "name": "Hiroshi Takahashi",
      "description": "manga"
    }
  ],
  "cast": [
    {
      "id": "nm5404844",
      "name": "Elly",
      "character": "Yamashita"
    },
    {
      "id": "nm1966361",
      "name": "Motoki Fukami",
      "character": "Megumi Hayashida"
    },
    {
      "id": "nm4818678",
      "name": "Masahiro Higashide",
      "character": "Kaburagi"
    },
    {
      "id": "nm5620173",
      "name": "Suzu Hirose",
      "character": "Mie Uchida"
    },
    {
      "id": "nm6768002",
      "name": "Wataru Ichinose",
      "character": "Shuji Taira"
    },
    {
      "id": "nm4997486",
      "name": "Ryusuke Ito",
      "character": ""
    },
    {
      "id": "nm5404830",
      "name": "Takanori Iwata",
      "character": "Hiroki Shibata"
    },
    {
      "id": "nm1327267",
      "name": "Ryô Katsuji",
      "character": "Kenichi Ogisu"
    },
    {
      "id": "nm2289108",
      "name": "Kenzô",
      "character": "Tetsuji Takagi       (as Kenzo)"
    },
    {
      "id": "nm3587427",
      "name": "Shûichirô Masuda",
      "character": "(as Shuichiro Masuda)"
    },
    {
      "id": "nm2990652",
      "name": "Kento Nagayama",
      "character": "Fujiwara"
    },
    {
      "id": "nm1671749",
      "name": "Taichi Saotome",
      "character": "Ryohei Kagami"
    },
    {
      "id": "nm3050429",
      "name": "Tsutomu Takahashi",
      "character": "Takashi Makise"
    },
    {
      "id": "nm10570415",
      "name": "Joey Tee",
      "character": "Maru-ken"
    },
    {
      "id": "nm1092477",
      "name": "Kyôsuke Yabe",
      "character": "Katagiri, Ken"
    },
    {
      "id": "nm1625874",
      "name": "Yûya Yagira",
      "character": "Toru Goura"
    }
  ],
  "overview": "A month after Genji Takiya graduates, a new battle for supremacy at Suzuran All-Boys High School begins. Transfer student Kaburagi Kazeo combats Kagami Ryohei for the coveted top spot, amidst a brewing inter-school conflict with Kurosaki Industrial High.",
  "storyline": "A month later. Genji Takiya has graduated. New fights begin to see who will climb to the top at Suzuran High School. Meanwhile, a battle against nearby Kurosaki Industrial High School begins.",
  "plot": "Kaburagi Kazeo is a new transfer student at Suzuran All-Boys High School. While walking to school, he witnesses a group of students get clipped by a passing town car. He arrives just in time for the “opening ceremony”, a showdown between Goura Toru, the school's number one fighter, and another student. The fracas is interrupted by the arrival of Kagami Ryohei, another transfer student, whose arrogance immediately draws the ire of the crowd. Recognizing his vehicle as the town car from earlier, Kazeo confronts Ryohei, who ignores him and walks away. Before he can follow, Kazeo is attacked by another student, Wajima, whom he promptly knocks out with a single punch.\n\nAt the Doberman Bar, former mob enforcer Katagiri Ken enjoys a drink while trying to keep a low profile. He encounters Makise Takashi, whom he implores to forget they saw each other. Makise instead ropes Ken into coming to work with him at a local auto dealer. Back at Suzuran, Kazeo is approached by Ogisu Kenichi, who explains that since beating Wajima at the opening ceremony, Kazeo has been ranked as the school's number five fighter. He goes on to suggest that Kazeo might be a contender to take on Goura for the top spot, and that they should join forces. Kazeo rejects the idea, asserting that he has no interest in conquering Suzuran. Meanwhile, Ryohei begins taking on challengers, and proves to be a skilled fighter himself.\n\nLater, at the bar, Kazeo and Kenichi get into a scrap with Shibata Hiroki, the top fighter from neighboring Kurosaki Industrial High. Back at the Nakata dealership, Ken is adjusting well to his new life as a salesman, and has become smitten with the owner, Aya. However, he soon discovers that the local mob is trying to force the shop out in order to redevelop the land. To protect Aya and the business, Ken goes to see the mob boss, Mr. Nara, who refuses to stop pursuing the Nakata property. During the meeting, Ken encounters Fujiwara, a former Kurosaki student turned mob recruit, as well Ryohei. Having known Ryohei's father from his former profession, Ken is disheartened to learn that Ryohei is now being groomed as Nara's successor.\n\nKazeo visits the cemetery accompanied by his mother, with whom he has a strained relationship. It is revealed that his father was a professional boxer who died due to injuries sustained during a match, and that his mother subsequently developed problems with drinking and gambling. The next day, Ken comes to Suzuran to find Ryohei but runs into Kazeo, with whom he shares stories of his youth at the school. Fujiwara is sent on behalf of the Nara Gang to harass the Nakata shop. He also begins stirring up conflict between Kurosaki and Suzuran as revenge against Shibata, with whom he holds a grudge following an incident which landed Fujiwara in prison. His plan pays off, as an enraged Goura begins attacking Kurosaki students in retaliation. Goura soon learns that Ryohei and Fujiwara are acquainted, but is stabbed by a Kurosaki student.\n\nShibata confronts Fujiwara, but is defeated and left with a broken arm. Ryohei and his gang begin relentless assaults at Suzuran, resulting in Kenichi being hospitalized. The injured Goura challenges Ryohei, but is also defeated, and Ryohei is named Suzuran's top fighter. Later, Fujiwara and Ryohei return to the Nakata shop to shut it down once and for all, setting fire to the building. Escaping the blaze, Ken seeks out Kazeo and begs him to stop Ryohei, for his own good. Spurred on by the escalating violence, Kazeo assembles his own force to take back the school.\n\nKazeo leads his gang, joined by Goura, to confront Ryohei and Fujiwara. Despite his injury, Goura singlehandedly dispatches many opponents before taking on Fujiwara himself, where he quickly loses the upper hand. As Fujiwara prepares to finish Goura, Shibata arrives. Noticing burns on Shibata’s chest that he caused, Fujiwara admits that he had deserved to have been punished for his actions; he apologizes to Shibata and retreats. Kazeo finally clashes with Ryohei, and after an intense and lengthy battle, he emerges victorious. Ken arrives soon after and whisks the battered Ryohei off for treatment, and away from the influence of the Nara Gang.\n\nSometime later, the Nakata auto shop has been renovated and is a thriving business again. Kazeo, having become the number one fighter and united the school, faces down the final obstacle on his path to completely conquering Suzuran - the indomitable Rindaman. The film ends as their battle begins.",
  "synopsis": null
}