{
  "imdb_id": "tt2872894",
  "tmdb_id": "186270",
  "douban_id": null,
  "title": "Wherever You Go (2012)",
  "genres": [
    "Short",
    "Drama",
    "Thriller"
  ],
  "country": "Israel",
  "version": [
    {
      "runtime": "38 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm2205246",
      "name": "Rony Sasson"
    }
  ],
  "writer": [
    {
      "id": "nm3558859",
      "name": "Gal Greenspan",
      "description": "writer"
    },
    {
      "id": "nm2205246",
      "name": "Rony Sasson",
      "description": "writer as Rony Sasson Angel"
    }
  ],
  "cast": [
    {
      "id": "nm3949541",
      "name": "Maisa Abd Elhadi",
      "character": ""
    },
    {
      "id": "nm6030693",
      "name": "Shahir Cabha",
      "character": ""
    },
    {
      "id": "nm1364748",
      "name": "Hilla Vidor",
      "character": ""
    }
  ],
  "overview": "One of the strongest examples of Israeli cinematic storytelling in recent years. Zuhara is on her way to her younger sister’s wedding, when she picks up Neriman, a young Bedouin hitchhiker escaping from an arranged marriage. As she unintentionally becomes an accomplice in Neriman’s struggle, Zuhara must confront her conflicted feelings toward her estrangement from her own family. Director Rony Sasson Angel sensitively evokes moving drama through the characters’ quiet exchanges, while building to a powerful climax. Stars Hila Vidor and Maisa Abed Elhadi make the tension and camaraderie between these two strangers palpable and touching. A deeply-poignant and visually-striking road movie.",
  "storyline": "A young woman, Zohara, has escaped the religious world of her famlily to live a secluded life in the desert. As she returns to see her family to participate in her sister's wedding, she encounters a young Bedouin Woman who is fleeing from an arranged marriage with her cousin. The two young women's paths cross and as they encounter each other, each individuals struggle with self definition is reflected as each one fights to express them self in a predetermined world.",
  "plot": "In 1996, treasure hunter Brock Lovett and his team aboard the research vessel Akademik Mstislav Keldysh search the wreck of RMS Titanic for a necklace with a rare diamond, the Heart of the Ocean. They recover a safe containing a drawing of a young woman wearing only the necklace dated April 14, 1912, the day the ship struck the iceberg.[Note 1] Rose Dawson Calvert, the woman in the drawing, is brought aboard Keldysh and tells Lovett of her experiences aboard Titanic.\n\nIn 1912 Southampton,Titanic prepares to set sail on her maiden voyage. Jack Dawson, a penniless artist, and his friend Fabrizio, an Italian, win passage on the Titanic in a poker game while a 17-year-old first-class passenger Rose DeWitt Bukater, her fiancé Cal Hockley, and her mother Ruth board the luxurious Titanic. Ruth emphasizes that Rose's marriage will resolve their family's financial problems and retain their high-class persona. Distraught over the engagement, Rose considers jumping from the stern of the ship to commit suicide; Jack intervenes and discourages her. Discovered with Jack, Rose tells a concerned Cal that she was peering over the edge and Jack saved her from falling. When Cal becomes indifferent, she suggests to him that Jack deserves a reward. He invites Jack to dine with them in first class the following night. Jack and Rose develop a tentative friendship, despite Cal and Ruth being wary of him. Following dinner, Rose secretly joins Jack at a party in third class.\n\nAware of Cal and Ruth's disapproval, Rose rebuffs Jack's advances, but realizes she prefers him over Cal. After rendezvousing on the bow at sunset, Rose takes Jack to her state room; at her request, Jack sketches Rose posing nude wearing Cal's engagement present, the Heart of the Ocean necklace. They evade Cal's bodyguard and they sleep together in an automobile inside the cargo hold. On the forward deck, they witness a collision with an iceberg and overhear the officers and designer discussing its seriousness.\n\nCal discovers Jack's sketch of Rose and an insulting note from her in his safe along with the necklace. When Jack and Rose attempt to inform Cal of the collision, he has his bodyguard slip the necklace into Jack's pocket and accuses him of theft. Jack is arrested, taken to the master-at-arms' office, and handcuffed to a pipe. Cal puts the necklace in his own coat pocket.\n\nWith the ship sinking, the crew said that the lifeboats are for women and children only but if men disobeyed, they will be shot (One of the ship crew committed suicide because he killed one of Fabrizio and Jack's friend). Rose flees Cal and her mother, who has boarded a lifeboat, and frees Jack. On the boat deck, Cal and Jack encourage her to board a lifeboat; Cal claims he can get himself and Jack off safely. After Rose boards one, Cal tells Jack the arrangement is only for himself. As her boat lowers, Rose decides that she cannot leave Jack and jumps back on board. Cal takes his bodyguard's pistol and chases Rose and Jack into the flooding first-class dining saloon. After using up his ammunition, Cal realizes he gave his coat and consequently the necklace to Rose. He later boards a collapsible lifeboat by carrying a lost child. The first funnel gets its bottom submerged causing it to collapse to the left side of the ship crushing and killing panicking passengers including Fabrizio who screams when he saw the falling funnel.\n\nAfter braving several obstacles, Jack and Rose return to the boat deck. The lifeboats have departed and passengers are falling to their deaths as the stern rises out of the water. The ship breaks in half, lifting the stern into the air. Jack and Rose ride it into the ocean and he helps her onto a wooden panel only buoyant enough for one person. He assures her that she will die an old woman, warm in her bed. Jack dies of hypothermia but Rose is saved.\n\nWith Rose hiding from Cal en route, the RMS Carpathia takes the survivors to New York City where Rose gives her name as Rose Dawson. She later finds out Cal committed suicide after losing all his money in the 1929 Wall Street crash.\n\nBack in the present, Lovett decides to abandon his search after hearing Rose's story. Alone on the stern of Keldysh, Rose takes out the Heart of the Ocean — in her possession all along — and drops it into the sea over the wreck site. While she is seemingly asleep or has died in her bed, photos on her dresser depict a life of freedom and adventure inspired by the life she wanted to live with Jack. A young Rose reunites with Jack at the Titanic's Grand Staircase, applauded by those who died in the disaster.",
  "synopsis": null
}