{
  "imdb_id": "tt2870756",
  "tmdb_id": "229297",
  "douban_id": null,
  "title": "Magic in the Moonlight (2014)",
  "genres": [
    "Comedy",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm0000095",
      "name": "Woody Allen"
    }
  ],
  "writer": [
    {
      "id": "nm0000095",
      "name": "Woody Allen",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0000147",
      "name": "Colin Firth",
      "character": "Stanley"
    },
    {
      "id": "nm4390920",
      "name": "Antonia Clarke",
      "character": "Wei Ling Soo's Assistant"
    },
    {
      "id": "nm1860270",
      "name": "Natasha Andrews",
      "character": "Wei Ling Soo's Assistant"
    },
    {
      "id": "nm2992087",
      "name": "Valérie Beaulieu",
      "character": "Wei Ling Soo's Assistant"
    },
    {
      "id": "nm0938542",
      "name": "Peter Wollasch",
      "character": "Stage Manager"
    },
    {
      "id": "nm0959067",
      "name": "Jürgen Zwingel",
      "character": "Backstage Fan"
    },
    {
      "id": "nm0685543",
      "name": "Wolfgang Pissors",
      "character": "Backstage Fan"
    },
    {
      "id": "nm1775622",
      "name": "Sébastien Siroux",
      "character": "Backstage Fan"
    },
    {
      "id": "nm0564402",
      "name": "Simon McBurney",
      "character": "Howard Burkan"
    },
    {
      "id": "nm0501602",
      "name": "Ute Lemper",
      "character": "Cabaret Singer"
    },
    {
      "id": "nm0001517",
      "name": "Catherine McCormack",
      "character": "Olivia"
    },
    {
      "id": "nm0040586",
      "name": "Eileen Atkins",
      "character": "Aunt Vanessa"
    },
    {
      "id": "nm0498713",
      "name": "Erica Leerhsen",
      "character": "Caroline"
    },
    {
      "id": "nm0787892",
      "name": "Jeremy Shamos",
      "character": "George"
    },
    {
      "id": "nm0512934",
      "name": "Hamish Linklater",
      "character": "Brice Catledge"
    },
    {
      "id": "nm6655739",
      "name": "Didier Muller",
      "character": "Butler"
    },
    {
      "id": "nm1297015",
      "name": "Emma Stone",
      "character": "Sophie"
    },
    {
      "id": "nm0001315",
      "name": "Marcia Gay Harden",
      "character": "Mrs. Baker"
    },
    {
      "id": "nm0915865",
      "name": "Jacki Weaver",
      "character": "Grace Catledge"
    },
    {
      "id": "nm6655740",
      "name": "Ronald Alphonse",
      "character": "Jazz Musician"
    },
    {
      "id": "nm6655741",
      "name": "Ronald Baker",
      "character": "Jazz Musician"
    },
    {
      "id": "nm6655742",
      "name": "Kelly Keto",
      "character": "Jazz Musician"
    },
    {
      "id": "nm6655743",
      "name": "Olivier Marchevet",
      "character": "Jazz Musician"
    },
    {
      "id": "nm6655744",
      "name": "Geroges Edouard Nouel",
      "character": "Jazz Musician       (as Geroges Édouard Nouel)"
    },
    {
      "id": "nm6655745",
      "name": "Mark Sims",
      "character": "Jazz Musician"
    },
    {
      "id": "nm0470253",
      "name": "Rudolf Krause",
      "character": "Reporter"
    },
    {
      "id": "nm0953407",
      "name": "Patrick Zard",
      "character": "Reporter"
    },
    {
      "id": "nm6655746",
      "name": "Pedro Chomnalez",
      "character": "Reporter"
    },
    {
      "id": "nm0285953",
      "name": "Jessica Forde",
      "character": "Reporter"
    },
    {
      "id": "nm0051720",
      "name": "Paul Bandey",
      "character": "Reporter"
    },
    {
      "id": "nm0008506",
      "name": "Lionel Abelanski",
      "character": "Doctor"
    },
    {
      "id": "nm7271485",
      "name": "Baby Bauer",
      "character": "The Elephant"
    }
  ],
  "overview": "Set in the 1920s French Riviera, a master magician is commissioned to try and expose a psychic as a fraud.",
  "storyline": "Stanley is a magician who has dedicated his life to revealing fraudulent spiritualists. He plans to quickly uncover the truth behind celebrated spiritualist Sophie and her scheming mother. However, the more time he spends with her, he starts thinking that she might actually be able to communicate with the other world, but even worse, he might be falling in love with her.",
  "plot": "In 1928, a globally famous illusionist, Wei Ling Soo, performs in front of a crowd in Berlin with his world-class magic act. As he walks off stage the film audience sees that he is actually a British man named Stanley (Colin Firth). He berates his employees and is generally curmudgeonly towards his well-wishers. In his dressing-room, he is greeted by old friend and fellow illusionist Howard Burkan (Simon McBurney). Howard enlists Stanley to go with him to the Côte d'Azur where a rich American family, the Catledges, has apparently been taken in by a clairvoyant and mystic, Sophie (Emma Stone). In fact, the son of the family, Brice (Hamish Linklater), is smitten with Sophie, and his sister Caroline (Erica Leerhsen) and brother-in-law George (Jeremy Shamos) are concerned Brice is considering proposing marriage. Howard says that he has been unable to uncover the secrets behind her tricks and he admits that the more he watched her the more he believed she really has supernatural powers. So he would like Stanley, who has debunked charlatan mystics in the past, to help him prove she is a fraud.\n\nHoward and Stanley travel to the French Riviera, but Stanley is soon astonished by Sophie's ability to go into a fugue state and apparently pull out highly personal details about him and his family. Stanley witnesses a seance in which Sophie communicates with the deceased patriarch of the American family. A candle floats up from the table and Howard grabs it to try to discern what trickery is at play, but is astounded to find no apparent subterfuge. Stanley begins spending time with Sophie. He takes her to visit his aunt and they drive a convertible along the picturesque rocky corniches.\n\nWhen Stanley and Sophie visit his aunt Vanessa (Eileen Atkins), Sophie is seemingly able, after holding aunt Vanessa's pearls, to somehow relate secret details of Vanessa's one great love affair. This finally convinces Stanley of Sophie's authenticity and he has an emotional epiphany, feeling that his lifelong rationalism and cynicism have been misguided. When caught in a rain storm, they end up at an observatory that Stanley had visited as a child. After the rain subsides, they open the roof up and view the stars.\n\nAt a Gatsby-esque party, Stanley and Sophie dance. As they walk together later that night, Sophie asks him if he has felt any feelings for her \"as a woman\". Stanley, who has admired her talents as a mystic and is grateful to her for opening his eyes to a new worldview, is taken aback and admits that he has not thought of her that way. She leaves upset. The next day Stanley holds a press conference to tell the world that he, who spent his life debunking charlatan mystics, has finally come to find one who is the real deal. The reporters drill him with questions, but the grilling is interrupted when he receives news his aunt Vanessa has been in a car accident.\n\nStanley rushes to the hospital, and in an emotional scene in a waiting room considers turning to prayer for solace. That is, if he now has come to believe in divination and mysticism, perhaps he should believe in God and prayer. He begins to pray for a miracle to save his aunt, but is unable to go through with it. The rationality that has been his whole life comes back and he rejects prayer, the supernatural and by extension, Sophie and her powers. He decides once more to prove she is a fraud.\n\nUsing a trick seen earlier in his stage act, Stanley appears to leave the room but stays to overhear Sophie and Howard discuss their collusion in what has been an elaborate ruse. He discovers that Sophie was able to know so much about him and his aunt because she and Howard collaborated to fool Stanley. Sophie was indeed a charlatan tricking the rich American family and was quickly discovered by Howard. Rather than unmask her and stop the ruse, he enlisted Sophie to help him one-up his best friend and rival, Stanley.\n\nStanley is initially angry at Howard and Sophie but decides to forgive them. In a conversation with his aunt Vanessa, who by then has recovered from her car accident, Stanley comes to the self-realization that he is in love with Sophie. He finds her and asks her not to marry Brice, but marry him instead. Sophie is taken aback and finds his haughty, awkward proposal unsuitable. She tells him she still plans to marry the wealthy Brice. Returning dejected to his aunt Vanessa's, Stanley is surprised when Sophie follows him there and he proposes. They kiss as the film ends.",
  "synopsis": "Berlin, Germany. 1928Stanley Crawford (Colin Firth) is a British illusionist/magical debunker performing a show under the guise of Wei Ling Soo, a Chinese magician. He does such tricks as making an elephant disappear, sawing a woman in half, and entering a sarcophagus and re-emerging in a chair, to the delight of audiences. Backstage, Stanley is rude and snobbish towards his assistants and a fan seeking an autograph. He is approached by his old friend and fellow illusionist Howard Burkan (Simon McBurney). Over a drink, Howard asks Stanley to travel with him to the French Riviera to see a wealthy family that have been enchanted by a young woman claiming to be a medium. Stanley's task is to reveal her as a fraud. He informs his fiance Olivia (Catherine McCormack) of his trip, as she is also a skeptic.The two friends drive to Côte d'Azur to meet the Catledge family. Stanley first meets Caroline Catledge (Erica Leershen) and her husband George (Jeremy Shamos), who both show concern over Caroline's brother Brice (Hamish Linklater), who is smitten with this so-called medium. He is heard practicing serenading her. Stanley and Howard meet Brice, who expresses his awe of this woman, as she has apparently seen things about himself that she couldn't have known, giving him a more introspective look on himself. This woman, Sophie Baker (Emma Stone), arrives with her mother (Marcia Gay Harden). Upon meeting Stanley, she gets a \"mental vibration\" of him being from the Orient, specifically China, and also deduces that he's done business in Germany. Not quite impressed, Stanley admits that he was recently in Berlin on business. Throughout the rest of the afternoon, Stanley displays his sarcasm and skepticism to Sophie and her mother. Mrs. Baker thinks he's obnoxious, and while Sophie agrees, she adds that he's not entirely unappealing.Brice strums his ukulele and sings to Sophie. He tells her he is very much in love with her and wants to marry her. She neither expresses interest nor disdain for him.That night, the Catledges gather for a seance in which Sophie attempts to communicate with the deceased husband of Brice and Caroline's mother, Grace (Jacki Weaver). Grace is eager to see if she can really speak to her husband. The family connects hands with each other and Sophie as she attempts to make contact. She beckons the spirit to knock once for \"yes\" and twice for \"no\". A knock is heard, and Stanley keeps his eyes peeled for anything. Suddenly, a candle begins floating in the air. Everyone, even Stanley, is baffled. Howard reaches to grab it, but sees no evidence of a wire or anything.Stanley still doesn't believe Sophie has any gift, but she is able to shake him a bit when he mentions his uncle and she gets another mental vibration of a \"death by water\". Stanley admits to Howard that his uncle drowned a few years back. Later, Sophie mentions seeing Wei Ling Soo as a child and enjoying the performance. She knows Stanley is the magician and tells him not to doubt what she can do. It's obvious Sophie has a hold on him as Stanley can barely sleep at night.The family holds another seance where Grace asks her deceased husband if she was always his only woman. One knock for yes. She then hesitantly asks if he ever had an affair with a specific woman she names. Two knocks for no. Grace is overjoyed.Sophie goes for a swim in the Catledges' pool. Brice continues to serenade her and then has the butler bring in a bunch of dresses that Sophie had been checking out in town.Stanley invites Sophie with him to go out on the town. She enjoys eating a lot, to Stanley's surprise. She even mentions information about Olivia and an older flame of Stanley's, Jenny. Stanley takes Sophie to the home of his Aunt Vanessa (Eileen Atkins), something of a mother to Stanley. Sophie asks Vanessa to hand her some type of jewelry, and she gives Sophie her pearl necklace. From holding it, Sophie determines a love affair of Vanessa's, as the necklace was given to her by a man that could not be with her because he was still married. This cracks Stanley, causing him to believe in Sophie's gifts and acknowledge her as the real deal.On their trip home, his car breaks down. He spends hours taking the engine apart and putting it back, but to no avail. A thunderstorm starts happening, scaring Sophie and making her think they'll die. She and Stanley run for shelter and find a nearby observatory. Stanley recognizes it from his youth. They go inside where he keeps Sophie close so she stays warm. He then takes her near the telescope and opens the roof, where they see the moon and stars up above.Everyone attends a fancy and lavish party. Stanley is dancing with Vanessa while Sophie cuts a rug with Brice. They switch partners, giving Stanley and Sophie a chance to walk together. She asks him if he has thought anything of her lately as a woman. He awkwardly responds that he hasn't seen her in that way, specifically as a woman, but he has become pleasantly surprised by what he's seen from her, regarding her gifts. Sophie leaves disappointed.Stanley, Sophie, and her mother gather with reporters for a press conference. Everyone asks Stanley about his new feelings regarding this type of magic or how he feels now as a skeptic. Moments later, George comes in to tell Stanley that his aunt has been in a car accident. He immediately steps out.At the hospital, Stanley is told that Vanessa is being treated by doctors. He sits down and starts to pray. For a moment, it appears that he really believes what he's saying, until he comes to a realization. He quickly dismisses all his beliefs and goes back to thinking Sophie is a fraud.Stanley returns to the Catledge home to confront Sophie. He asks her how she did not predict the car accident and warn him about it. He leaves the room with Sophie and Howard alone. It is then that we learn that the two of them conspired to trick Stanley. Howard knew Sophie was a fraud, but he wanted to really get Stanley after years of being second best to his more successful friend. Stanley then turns around in his chair to show that he has been listening the whole time. Sophie is ashamed and wants Stanley to forgive her, especially since she knows that his time spent with her has let him believe in new possibilities and have a new lease on life. Despite this, Stanley refuses to forgive her.Vanessa makes a full recovery, and Stanley picks her up and takes her home. When they get back, Stanley slowly begins to express his true feelings toward Sophie. He realizes he doesn't love Olivia as much as he thought, and he has fallen in love with Sophie.Stanley finds Sophie sitting on a swing. By now, she has already accepted Brice's marriage proposal. Stanley makes an uneasy proposal, saying she should marry him instead. Sophie says he already had his chance, and it's gone. She walks away while he tries to take the offer off the table.Stanley forgives Howard for trying to trick him. He also mentions that he broke it off with Olivia, who happened to be calm about it, as they both realized they weren't right for each other.Stanley returns to Vanessa's home one more time after being rejected. He sits in the living room talking aloud and expressing his regret over not expressing his love for Sophie earlier. He then hears a knock. He knows Sophie is near. He then asks if she'll marry him. Another knock for yes. Stanley turns around to see Sophie standing in the doorway. He goes up to her and they kiss."
}