{
  "imdb_id": "tt2885364",
  "tmdb_id": "185460",
  "douban_id": null,
  "title": "Willow Creek (2013)",
  "genres": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "80 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.1,
  "director": [
    {
      "id": "nm0001281",
      "name": "Bobcat Goldthwait"
    }
  ],
  "writer": [
    {
      "id": "nm0001281",
      "name": "Bobcat Goldthwait",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1773268",
      "name": "Alexie Gilmore",
      "character": "Kelly"
    },
    {
      "id": "nm0424684",
      "name": "Bryce Johnson",
      "character": "Jim"
    },
    {
      "id": "nm6156090",
      "name": "Laura Montagna",
      "character": "Missing Woman"
    },
    {
      "id": "nm0802425",
      "name": "Bucky Sinister",
      "character": "Angry Man at Road"
    },
    {
      "id": "nm0419273",
      "name": "Peter Jason",
      "character": "Ranger Troy Andrews"
    },
    {
      "id": "nm2512619",
      "name": "Timmy Red",
      "character": "Ukulele Singer"
    },
    {
      "id": "nm6649418",
      "name": "Steven Streufert",
      "character": "Himself"
    },
    {
      "id": "nm6685432",
      "name": "Shaun L. White Guy Sr.",
      "character": "Herself"
    },
    {
      "id": "nm6685430",
      "name": "Nita Rowley",
      "character": "Herself"
    },
    {
      "id": "nm4613103",
      "name": "Tom Yamarone",
      "character": "Himself"
    }
  ],
  "overview": "A young couple ventures into the woods to capture footage of the elusive Bigfoot in the latest film from Bobcat Goldthwait.",
  "storyline": "Jim and his girlfriend Kelly are visiting the infamous Willow Creek, the alleged home of the original Bigfoot legend - the tale of huge ape like creatures that roam the forests of North America. It was there that in 1967, the legendary beast was captured on film and has terrified and mystified generations since. Keen to explore more than 50 years of truth, folklore, misidentifications and hoaxes, Kelly goes along for the ride to keep Jim happy, whilst he is determined to prove the story is real by capturing the beast on camera. Deep in the dark and silent woods, isolated and hours from human contact, neither Kelly or Jim are prepared for what is hidden between the trees, and what happens when the cameras start rolling...",
  "plot": "Set in Humboldt County, California, Jim is a Bigfoot believer whose idea of a romantic getaway is to head deep into Six Rivers National Forest in Northern California, video camera in tow, trying to shoot his own Bigfoot footage at the site of the Patterson–Gimlin film. That 1967 fragment of footage purporting to show a Sasquatch striding along a dry sandbar beside Bluff Creek became a key artifact in the cryptozoology community, and Jim dreams of nothing more than setting foot on the actual location where it was shot. His long-suffering girlfriend, Kelly, agrees to tag along for the ride, despite the fact that she thinks Bigfoot has about as much chance of being real as leprechauns.\n\nThe two stop off first in Willow Creek, the Bigfoot capital of the world and home to an annual Bigfoot festival, where various locals talk to Jim's camera, warning them to keep out of the woods, singing ballads about Bigfoot, and generally enjoying their 15 minutes in the spotlight while Jim and Kelly have a blast, cracking wise amidst all the touristy Bigfoot kitsch on display. At a store they notice a missing woman on a milk carton but dismiss it as an everyday occurrence. When they strap on packs and head into the forest via a two-hour drive down a dirt road, they start to feel like they might be in over their heads. Well, Kelly does, at least. Jim, as he approaches what he considers hallowed ground, is in heaven.\n\nThat night they are awakened by mysterious sounds echoing through the woods, and whooping vocalizations that might be Bigfoot, but that might also be locals pranking them. The noises grow closer and less human-like and their imagination begins to wander when the noises become surreal and hits their tent. They become spooked and decide to leave the site at dawn. Jim discovers a gray, bloody strand of hair he believes may be evidence of Bigfoot's existence. They wander in circles through the thick California woods whilst hearing the same noises they heard the night before. They become frustrated and get lost by a river bank very similar to the river bank in the Patterson-Gimlin footage they sought to find the whole trip. A whooping, angry noise rustles the bushes behind Kelly scaring her into running. As night grows in they are confused and lost in the dark at the end of the movie, Jim and Kelly encounter an overweight, naked woman, bearing strong resemblance to the missing woman on the carton and an unseen creature attacks them, killing Jim and moving on to Kelly, whose cries for help are heard in the distance. Her fate is ultimately unknown but implied she is taken as a \"forest bride\" like the other missing woman used by Sasquatch to procreate. The movie ends with three whooping vocalizations also heard in the distance.",
  "synopsis": null
}