{
  "imdb_id": "tt2836166",
  "tmdb_id": "194188",
  "douban_id": null,
  "title": "Punk's Dead: SLC Punk 2 (2016)",
  "genres": [
    "Comedy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "75 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.2,
  "director": [
    {
      "id": "nm0580669",
      "name": "James Merendino"
    }
  ],
  "writer": [
    {
      "id": "nm0580669",
      "name": "James Merendino",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3115493",
      "name": "Ben Schnetzer",
      "character": "Ross"
    },
    {
      "id": "nm2000954",
      "name": "Hannah Marks",
      "character": "Penny"
    },
    {
      "id": "nm0446622",
      "name": "Machine Gun Kelly",
      "character": "Crash       (as Colson 'MGK' Baker)"
    },
    {
      "id": "nm1020124",
      "name": "Sarah Clarke",
      "character": "Trish"
    },
    {
      "id": "nm0001701",
      "name": "Devon Sawa",
      "character": "Sean"
    },
    {
      "id": "nm0329640",
      "name": "Michael A. Goorjian",
      "character": "Bob       (as Michael Goorjian)"
    },
    {
      "id": "nm0664238",
      "name": "Adam Pascal",
      "character": "Eddie"
    },
    {
      "id": "nm6614438",
      "name": "Emma Pace",
      "character": "Lillith"
    },
    {
      "id": "nm3069496",
      "name": "Jenny Jaffe",
      "character": "Shelly"
    },
    {
      "id": "nm2358125",
      "name": "Levi Wilson",
      "character": "Dorgon"
    },
    {
      "id": "nm7092626",
      "name": "Errol Grant",
      "character": "William"
    },
    {
      "id": "nm2326393",
      "name": "Jarrod Phillips",
      "character": "Penny's Dad"
    },
    {
      "id": "nm4093816",
      "name": "Braxton McAllister",
      "character": "Cop"
    },
    {
      "id": "nm6712056",
      "name": "Canyon Canary",
      "character": "Ross Age 5"
    },
    {
      "id": "nm7092627",
      "name": "Patrick Delvar",
      "character": "Jerry"
    },
    {
      "id": "nm7570861",
      "name": "Brad Van Dam",
      "character": "Store Owner"
    },
    {
      "id": "nm7092618",
      "name": "Joe Damico",
      "character": "Onlooker"
    },
    {
      "id": "nm7092628",
      "name": "Shaye Peck",
      "character": "Burlesque Club Dancer"
    },
    {
      "id": "nm7071146",
      "name": "Cy Cushenberry",
      "character": "Club Patron"
    },
    {
      "id": "nm7071150",
      "name": "Russell Coker",
      "character": "Club Patron"
    },
    {
      "id": "nm7092630",
      "name": "Mike Balken",
      "character": "Lover Boy"
    },
    {
      "id": "nm7071142",
      "name": "Alex Diamond",
      "character": "Punk       (as Alexander Diamond)"
    },
    {
      "id": "nm5193830",
      "name": "Brian Oakley",
      "character": "Bouncer"
    },
    {
      "id": "nm5246782",
      "name": "Christian Thüringer",
      "character": "Austrian Punk       (as Christian Thueringer)"
    },
    {
      "id": "nm7071147",
      "name": "Jamie Miller",
      "character": "Punk Rock Girl"
    },
    {
      "id": "nm7071149",
      "name": "Nick Stiso",
      "character": "Punk"
    },
    {
      "id": "nm3099132",
      "name": "Ricky Egan",
      "character": "Crutch Punk"
    },
    {
      "id": "nm0001166",
      "name": "James Duval",
      "character": "John The Mod"
    }
  ],
  "overview": "Punk's Dead, the sequel to 1999 cult hit SLC Punk, is a punk romp through the Utah hinterlands. Ross, Penny and Crash, young outsiders from different tribes, embark on a road trip to a huge punk show. Ross, 19, is the love child of Trish and Heroin Bob, who died before Ross was born. During their odyssey, and with the help of a healthy dose of drugs, alcohol and punk music, Ross shreds his darkly Gothic outlook and embraces life. His mother Trish, who raised Ross alone in her steam punk shop, discovers that he is in a crisis. She recruits his 'uncles,' Bob's old SLC gang, to help find him. When all collide at the concert, they are forced to deal with their unresolved relationships with Bob.",
  "storyline": "Ross, Penny and Crash, young... outsiders from different tribes, embark on a road trip to a huge punk show. Ross, 19, is the love child of Trish and Heroin Bob, who died before Ross was born. During their odyssey, and with the help of a healthy dose of drugs, alcohol and punk music, Ross shreds his darkly Gothic outlook and embraces life. His mother Trish, who raised Ross alone in her steam punk shop, discovers that he is in a crisis. She recruits his 'uncles,' Bob's old SLC gang, to help find him. When all collide at the concert, they are forced to deal with their unresolved relationships with Bob.",
  "plot": "The film outlines the daily lives of two punks in Salt Lake City, Utah in the fall of 1985: Stevo and his best friend, \"Heroin\" Bob; Stevo narrates the film. The nickname \"Heroin\" is ironic, as Bob is afraid of needles and actually believes that any drug (with the notable exception of alcohol and cigarettes) is inherently dangerous.\n\nStevo and Bob go from party to party while living in a dilapidated apartment. They spend much of their time fighting with members of other subcultures, particularly rednecks. Stevo has a casual relationship with a girl named Sandy, while Heroin Bob is in love with Trish, the manager of a head shop, but reluctant to ask her to become his girlfriend.\n\nThe two of them are shaped by their experiences with their parents. Stevo's parents, now divorced, are former hippies who are proud of their youthful endeavors; however, Stevo is revolted by what he perceives as their \"selling out\" by becoming affluent Reagan Republicans, which they lamely try to justify. Stevo's grades are excellent, and when his father—a lawyer with a Porsche and a penchant for younger women—sends an application to Harvard Law School and Stevo is accepted, he nevertheless rejects it because of his beliefs. By contrast, Bob's father is a paranoid, drunken wreck who mistakes his son and his friend for Central Intelligence Agency operatives, and chases them away with a shotgun when they visit him on his birthday.\n\nStevo begins to see the drawbacks of living the punk life. Sean, a fellow punk, is a drug dealer who once attempts to stab his mother while under the influence of an entire 100-dose sheet of acid, before being taken away by the police; Stevo later finds him panhandling on the streets with some obvious mental issues.\n\nWhile Stevo understands that his relationship with Sandy is casual, he's still enraged when he discovers her having sex with another man, and savagely beats him, later loathing himself because his action contradicts his own belief in anarchism. His social circle begins to drift away, as Mike leaves Salt Lake City to attend the University of Notre Dame. Stevo falls in love with a young rich girl named Brandy (Summer Phoenix), who points out that his anarchistic clothing and attitude are more of a fashion choice than an actual political philosophy. Rather than being offended, Stevo takes the criticism thoughtfully and they passionately kiss.\n\nAt the same party, Heroin Bob complains of a headache (induced by Spandau Ballet's \"She Loved Like Diamond\" playing on a stereo), and is given Percodan, which he consumes after being told the pills are simply \"vitamins\" that will help his headache. The accidental drug overdose kills him in his sleep, seemingly justifying the aversion to chemicals he previously espoused in a diatribe delivered to Stevo. When Stevo discovers that his best friend is dead, he breaks down completely. At the funeral, he appears with a shaved head and changed clothing, and decides that he's done with his punk lifestyle. He decides to go to Harvard, and suggests in the narration that he marries Brandy and she will be the mother of his children. He notes in his closing narration that his youthful self would probably kick his future self's ass, wryly describing himself as ultimately just another poseur.\nThe \"Tribes\"\n\nThe film features several cliques presented as \"tribes.\" The film focuses primarily on the punk tribe, but includes several others as well:\nPunks: Stevo, Bob, Sean, Megan, and Mike belong to this tribe, although Mike doesn't dress the part. The punks are rivals of the mods, Nazis and rednecks.Mods: Mods wear suits and ties, and they ride scooters. They're generally the rivals of the punks, but the character John the Mod acts as a diplomat who freely moves between the tribes. In the beginning of the movie, the mods are trying to buy acid from Sean.Rednecks: Rednecks are rural Utah folk who wear trucker caps and flannel, and drive around in big trucks. Punks hate them for their conservative views.Neo-Nazis: Neo-Nazis are white power skinheads who wear pseudo-military fatigues and Nazi armbands. Punks and mods are shown to be predatory towards the Nazis.The Heavy metal Guys: They have long hair and flannel. Not much else is known about them, except that Stevo explains that they are predatory toward the New Wavers.New wavers: They are people who dress like New Romantics and are said to be the least threatening of the tribes. They are described as being \"the new hippies.\" Every Tribe is predatory to the New Wavers.The Teddy Boys: Though it is not mentioned in the film itself, Eddy belongs to the Teddy Boy scene.",
  "synopsis": null
}