{
  "imdb_id": "tt2883218",
  "tmdb_id": "285752",
  "douban_id": null,
  "title": "I Am the Keeper (2014)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "Switzerland",
  "version": [
    {
      "runtime": "88 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm0098086",
      "name": "Sabine Boss"
    }
  ],
  "writer": [
    {
      "id": "nm0098086",
      "name": "Sabine Boss",
      "description": "writer"
    },
    {
      "id": "nm4671393",
      "name": "Jasmine Hoch",
      "description": "writer"
    },
    {
      "id": "nm6207185",
      "name": "Pedro Lenz",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0626865",
      "name": "Michael Neuenschwander",
      "character": "Pesche"
    },
    {
      "id": "nm5653135",
      "name": "Sonja Riesen",
      "character": "Regula"
    },
    {
      "id": "nm0797507",
      "name": "Marcus Signer",
      "character": "Goalie"
    },
    {
      "id": "nm0880482",
      "name": "Pascal Ulli",
      "character": "Ueli"
    }
  ],
  "overview": "Goalie has just been released from prison after spending a year inside for keeping his mouth shut for his best buddy Ueli. He heads for his hometown of Schummertal, a small town where everyone knows you. He's going to start over, without drugs. Meanwhile, Ueli has gotten ever deeper into drugs, can't understand why Goalie suddenly wants to be a square. Although they've been friends since childhood, everything is different now. Goalie wants a new life but finds his past.",
  "storyline": "Goalie has just been released from prison after spending a year inside for keeping his mouth shut for his best buddy Ueli. He heads for his hometown of Schummertal, a small town where everyone knows you. He's going to start over, without drugs. Meanwhile, Ueli has gotten ever deeper into drugs, can't understand why Goalie suddenly wants to be a square. Although they've been friends since childhood, everything is different now. Goalie wants a new life but finds his past.",
  "plot": "When national hero Robert Forrest is killed in an riding accident, the entire United States goes into deep mourning. Admirer and renowned journalist Stephen O'Malley (Spencer Tracy) returns from Europe to write a biography of the great man. Among the throngs covering the funeral, he finds his old friends and fellow reporters, Jane Harding (Audrey Christie) and Freddie Ridges (Stephen McNally). They remain after the rest of the press leave.\n\nForrest's widow, Christine (Katharine Hepburn), refuses to speak to reporters throughout the proceedings. However, O'Malley befriends youngster Jeb (Darryl Hickman), son of the gatekeeper of the Forrest estate, Jason Rickards (Howard Da Silva). The grief-stricken boy shows him a way into the mansion, where he meets Christine. Though she is cordial enough, she refuses any cooperation with his biography. After O'Malley leaves, Forrest's private secretary, Clive Kerndon (Richard Whorf), fearful of how the reporter will react to the brushoff, convinces Christine to offer her help so that they can steer him in the direction they want.\n\nAs time goes on, O'Malley gains the widow's trust. Christine is the \"keeper of the flame\", protecting her husband's memory and reputation. O'Malley's instincts tell him that some secret is being kept from him. He discovers that Forrest's elderly, mentally ill mother (Margaret Wycherly) is living in a separate house on the vast estate. Despite her servants' attempts to keep them apart, he manages to speak with her and obtains more clues from her ramblings.\n\nO'Malley notices \"the arsenal,\" a stone building near the Forrest mansion which served as Robert Forrest's office and library. One afternoon, O'Malley observes smoke rising from the arsenal's chimney. When he asks Kerndon about the building's purpose, Kerndon (who cannot see the smoke) tells him it is only a storehouse. O'Malley slips away to investigate. He discovers Christine burning what she claims are love letters, but he suspects otherwise. Later, Kerndon telephones somebody and assures the unnamed party that he will take care of the situation. As O'Malley learns more, he begins to wonder if Christine and her cousin Geoffrey Midford (Forrest Tucker) are lovers and murderers. However, Geoffrey's announcement of his engagement to Rickard's daughter, and Christine's reaction, discounts that theory.\n\nWhen O'Malley admits he has fallen in love with her, Christine finally breaks down and reveals the ugly truth. Her husband was corrupted by the power and adulation he received. He became a fascist, plotting to gain control of the United States and use his enormous influence to turn Americans to fascist ideals. She shows O'Malley papers stored in the arsenal which reveal how Forrest (backed by secretive, ultra-wealthy, power-hungry individuals) planned to use racism, anti-union feeling, and antisemitism to divide the country, turning one group against another if it became too powerful to control, in order to create the chaos that would let him seize power. Christine discovered the plot the day before her husband's death. She went riding the next morning and came upon the washed-out bridge. She could have warned her husband, but decided that a \"clean death in the rain was the best thing that could happen to Robert Forrest.\" O'Malley convinces her to help him write a book detailing Forrest's scheme.\n\nKerndon eavesdrops, then locks the sole arsenal door and sets the building ablaze. Through an opening, he fatally shoots Christine with a pistol. He attempts to kill O'Malley, too, but misses. When an automobile rushes to the scene, Kerndon shoots at the passengers and is struck by the vehicle.\n\nO'Malley ultimately writes a book titled Christine Forrest: Her Life, which exposes the plot.",
  "synopsis": null
}