{
  "imdb_id": "tt2910508",
  "tmdb_id": "306969",
  "douban_id": null,
  "title": "Dark Summer (2015)",
  "genres": [
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "81 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.2,
  "director": [
    {
      "id": "nm2099491",
      "name": "Paul Solet"
    }
  ],
  "writer": [
    {
      "id": "nm2047864",
      "name": "Mike Le",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm1507857",
      "name": "Keir Gilchrist",
      "character": "Daniel"
    },
    {
      "id": "nm1886524",
      "name": "Stella Maeve",
      "character": "Abby"
    },
    {
      "id": "nm0364110",
      "name": "Maestro Harrell",
      "character": "Kevin"
    },
    {
      "id": "nm3966682",
      "name": "Gracie Gillam",
      "character": "Mona Wilson       (as Grace Phipps)"
    },
    {
      "id": "nm0001780",
      "name": "Peter Stormare",
      "character": "Stokes"
    },
    {
      "id": "nm2677217",
      "name": "Dinora Walcott",
      "character": "Principal Nakota       (voice)"
    }
  ],
  "overview": "Follows the tale of a 17-year-old on house arrest for the summer. When his mother is away on business, a horrifying incident occurs, followed by an even more terrifying presence in the house.",
  "storyline": "A 17-year-old is on house arrest for the summer while his mother is away on business. A horrifying incident occurs leaving an ominous presence in the house.",
  "plot": "Daniel (Keir Gilchrist) is a young man who has been placed under house arrest for harassing a young woman, Mona Wilson (Grace Phipps). Under the terms of his house arrest, he is not allowed visits from unaccompanied minors nor is he allowed access to his computer (which has been confiscated by the authorities) or the internet. As his mother is away on business, he is alone in the house. Daniel's parole officer, Stokes (Peter Stormare), explains that Daniel's monitoring tag will go off if he goes past the edge of the front lawn. If he does not retreat within five seconds, he will be arrested. Daniel mentions hearing of someone under house arrest who cut off their foot to get the monitoring tag off so they could flee to Mexico.\n\nDespite the restrictions placed on Daniel, his friends Abby and Kevin come around and bring him a tablet so that he can access a neighbor's internet connection and Skype his mother. When he is about to Skype his mother, Abby contacts him instead. After a brief conversation, he receives an incoming Skype call from Mona Wilson, who kills herself on camera.\n\nFollowing this incident, Daniel becomes more and more paranoid and keeps seeing Mona in the house. Daniel and his friends attempt a seance to contact the spirit of Mona. The idea is that by each holding pens, Mona will communicate with them. Instead, Daniel and Kevin stab Abby through the hand with their pens. She is then lifted up and dragged across the wall. Afterwards, we see the blood from her injured hand spells out 'Daniel' on the wall.\n\nAfter more supernatural events, Abby and Kevin head over to the dead girl's house. They are looking for a personal item of Mona's they can use as part of a ritual to help her move on to the afterlife. When they arrive at the house, they find it empty. They break in and, guided by Daniel who has a blueprint of the house, they head to Mona's room which is bare apart from a blood-stained mattress (from Mona shooting herself). They realize, with Daniel's help, that there is a false wall at the back of a closet which leads to a secret room which contains a number of strange artifacts and a large number of photos of Daniel; Mona was stalking Daniel, not the other way around. One of the items they find has a strange symbol embossed on it. Daniel finds out what it is and uses the name of the symbol as the password to Mona's cloud account. There he finds a folder called 'Daniel' which contains a spell.\n\nIt turns out that Mona put a spell on Daniel to make him fall in love with her. It worked, but he was too shy to contact her, so Mona used a second spell so that her spirit could enter into Daniel's body alongside his own spirit so they would be together. There are five steps to the spell, the first of which was Mona's suicide. They realize that if all the steps are not completed by Daniel, the spell will fail. Abby therefore takes the last step, hoping that this will break the spell. However, Abby has already unwittingly carried out the previous steps of the spell so performing the last step brings Mona's spirit into her body. While they are cleaning up after the failed seance, Abby kills Kevin and then cuts off Daniel's leg so she can remove his house arrest monitor and abduct him without notice. When Stokes visits, he sees the severed leg on the floor and just thinks Daniel has absconded, as he described when he was first fitted with the tag.\n\nIn a post-credits scene, Abby, still possessed by Mona's spirit, is seen driving Daniel out of town while he lets out muffled screams.",
  "synopsis": null
}