{
  "imdb_id": "tt2988546",
  "tmdb_id": "221569",
  "douban_id": null,
  "title": "Felix (2013)",
  "genres": [
    "Comedy",
    "Drama",
    "Family",
    "Music"
  ],
  "country": "South Africa",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm0244344",
      "name": "Roberta Durrant"
    }
  ],
  "writer": [
    {
      "id": "nm0426844",
      "name": "Shirley Johnston",
      "description": "writer as Shirley Johnson"
    }
  ],
  "cast": [
    {
      "id": "nm5912018",
      "name": "Hlayani Junior Mabasa",
      "character": "Felix Xaba       (as Hlayani Jr. Mabasa)"
    },
    {
      "id": "nm3473374",
      "name": "Linda Sokhulu",
      "character": "Lindiwe Xaba"
    },
    {
      "id": "nm0595683",
      "name": "Thapelo Mofokeng",
      "character": "Bra Joe"
    },
    {
      "id": "nm0831104",
      "name": "Royston Stoffels",
      "character": "Fingers Fortuin"
    },
    {
      "id": "nm4966079",
      "name": "Elvis Mahomba",
      "character": "Wiseman Xaba"
    },
    {
      "id": "nm5912019",
      "name": "Okwethu Banisi",
      "character": "Zanele Xaba"
    },
    {
      "id": "nm0414325",
      "name": "Andre Jacobs",
      "character": "Mr. Angus Murray"
    },
    {
      "id": "nm0840531",
      "name": "Janet Suzman",
      "character": "Mrs. Cartwright"
    },
    {
      "id": "nm5912021",
      "name": "Joshua Wyngaard",
      "character": "Ricardo January"
    },
    {
      "id": "nm5912022",
      "name": "Wonga Fasi",
      "character": "Marshall Dondolo"
    },
    {
      "id": "nm7202136",
      "name": "Joshua Samson",
      "character": "Junior Junior"
    },
    {
      "id": "nm4443243",
      "name": "Wesley Lerwill",
      "character": "Rocky Peasbody"
    },
    {
      "id": "nm7202137",
      "name": "Siphesihle Nkonyana",
      "character": "Stompie"
    },
    {
      "id": "nm0456810",
      "name": "Langley Kirkwood",
      "character": "Jeff Junior"
    },
    {
      "id": "nm2371795",
      "name": "Jeanne Neilson",
      "character": "Jane Junior"
    },
    {
      "id": "nm1802111",
      "name": "Nicholas Ellenbogen",
      "character": "Mr. Felix Soames"
    },
    {
      "id": "nm0302819",
      "name": "Adrian Galley",
      "character": "Mr. Stuart"
    },
    {
      "id": "nm5912033",
      "name": "Mlamli Lalapantsi",
      "character": "Minister Dondolo"
    },
    {
      "id": "nm5381295",
      "name": "Amanda Quwe",
      "character": "Mrs. Dondolo"
    },
    {
      "id": "nm0421252",
      "name": "Stephen Jennings",
      "character": "Mr. Pepys"
    },
    {
      "id": "nm0636299",
      "name": "Terry Norton",
      "character": "Mrs. Pepys"
    },
    {
      "id": "nm3023058",
      "name": "Joseph Mitchell",
      "character": "Mr. January"
    },
    {
      "id": "nm5345260",
      "name": "Euodia Sampson",
      "character": "Mrs. January       (as Euodia Samson)"
    },
    {
      "id": "nm2032205",
      "name": "Andrea Dondolo",
      "character": "Sis Pretty"
    },
    {
      "id": "nm1339941",
      "name": "Waldemar Schultz",
      "character": "Mr. du Toit"
    },
    {
      "id": "nm2615447",
      "name": "Sandile Kamle",
      "character": "Father Zonke"
    },
    {
      "id": "nm1689364",
      "name": "Vicki Bawcombe",
      "character": "Mrs. Stuart"
    },
    {
      "id": "nm0032509",
      "name": "Chris April",
      "character": "Toothless drunk"
    },
    {
      "id": "nm4479052",
      "name": "Sibongile Mlambo",
      "character": "Dancer       (as Sibo Mlambo)"
    }
  ],
  "overview": "13-year-old Felix Xaba dreams of becoming a saxophonist like his late father, but his mother Lindiwe thinks jazz is the devil's music. When Felix leaves his township friends to take up a scholarship for grade eight at an elitist private school, he defies his mother and turns to two aging members of his father's old band to help him prepare for the school jazz concert.",
  "storyline": "'Billy Elliot with sax meets Buena Vista Social Club in Cape Town, South Africa.' 13-Year-old Felix dreams of becoming a saxophonist like his late father, Zweli, of the famous Bozza Boys Band. His mother, Lindiwe, hates jazz, which she blames for Zweli's death. Because of alcohol, he died before her youngest son was born. Felix's world is turned upside down when he wins a scholarship to a prestigious school. Wanting to prove himself, he auditions for the school concert, but he can't read music. Two aging ex-Bozza Boys give Felix a cash course on the saxophone and teach him about his musical roots and his father's past. Through Felix's determination, his mother Lindiwe is able to forgive her late husband and celebrate Felix's musical talent.",
  "plot": null,
  "synopsis": "13-year-old Felix Xaba dreams of becoming a jazzman like his late father, Zweli, a famous saxophonist in his day. His mother Lindiwe fears her son will indeed end up like his dad: a drunk who squandered his days and money in the taverns before drinking himself to death. Lindiwes ambitions for her son exclude jazz, which she bans from her home as the devils music. Felix continues to play his pennywhistle in secret. His world is turned upside down when he wins a scholarship to a private school. Felix leaves the comfort of the township, where his siblings and friends regard him as king of their world, to enter an elitist domain where hes regarded as a pitiful nobody and where a gang of bullies, led by Junior Junior, makes his life a misery. Battling humiliation at school and his mothers fierce ban on music at home, Felix finds comfort in the company of a drunken old busker, Bra Joe, who plays sax outside the local tavern. He learns that Joe used to play in his dads band, The Bozza Boys, once the hottest jazz group in the Cape. An audition notice for the school jazz concert is the spur Felix needs to overcome his loss of status, but he fails the first audition because he cant read music or play the sax. Mrs. Cartwright, Felixs English teacher, persuades the music teacher, Mr. Murray, to let him try for the second audition. Armed with his dads old sax, Felix rushes off to seek help from Joe, who ropes in Fingers Fortuin, another aging ex-Bozza Boy. Together they embark on a crash saxophone course for Zwelis son, who learns not only how to play the sax, but also about his musical roots and his fathers past. When Lindiwe discovers that the drunken busker is coaching Felix on her late husbands sax, she explodes. In a fury, she pawns the sax and forbids Felix any contact with Joe or jazz. Behind his mothers back, Felix tracks down all the surviving musicians of the Bozza Boys. With Joes help, he persuades them to reunite and give a jazz fundraiser in the tavern so he can reclaim his dads sax from the pawnshop. The gig is a wild success. Felix buys back his sax and surprises Mr. Murray at the audition. He is in the school concert and on top of the world, until he makes his proud announcement to Lindiwe, who is appalled by his duplicity and refuses to attend, tearing up her invite. Lindiwe has a change of heart on the night of the concert. During the finale, Felix is overcome when he sees his siblings dragging his mother into the auditorium. He announces that there will be a surprise encore dedicated to his late father, Tata Zweli, and his mother Lindiwe, who is only a little bit late. A trumpet sounds offstage. Felix leads the Bozza Boys onstage and they do a foot-stomping, show-stopping number, which even gets Mr. Murray and Mrs. Cartwright dancing in the aisle. When Felix does a star turn, Lindiwe ululates in the front row. She is at last a happy mama, and, like his father before him, Felix has become king of the sax."
}