{
  "imdb_id": "tt2957680",
  "tmdb_id": "244339",
  "douban_id": null,
  "title": "Out of Inferno (2013)",
  "genres": [
    "Action",
    "Adventure",
    "Drama",
    "Thriller"
  ],
  "country": "China",
  "version": [
    {
      "runtime": "107 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm0659380",
      "name": "Danny Pang"
    },
    {
      "id": "nm0161152",
      "name": "Oxide Chun Pang"
    }
  ],
  "writer": [
    {
      "id": "nm5972018",
      "name": "Tang Nicholl",
      "description": null
    },
    {
      "id": "nm0659380",
      "name": "Danny Pang",
      "description": null
    },
    {
      "id": "nm0161152",
      "name": "Oxide Chun Pang",
      "description": null
    },
    {
      "id": "nm0844032",
      "name": "Kam-Yuen Szeto",
      "description": "screenplay"
    },
    {
      "id": "nm2058587",
      "name": "Lik-Kei Tang",
      "description": "as Nicholl Tang"
    },
    {
      "id": "nm5972019",
      "name": "MengZhang Wu",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0490513",
      "name": "Ching Wan Lau",
      "character": "Dai Kwan"
    },
    {
      "id": "nm0465503",
      "name": "Louis Koo",
      "character": "Keung"
    },
    {
      "id": "nm0496806",
      "name": "Angelica Lee",
      "character": "Si Lok"
    },
    {
      "id": "nm2268805",
      "name": "Sicheng Chen",
      "character": "Lee Kin Lok"
    },
    {
      "id": "nm2005363",
      "name": "Natalie Tong",
      "character": "Bin Bin"
    },
    {
      "id": "nm0156567",
      "name": "Siu-Fai Cheung",
      "character": "Shun       (as Eddie Cheung)"
    },
    {
      "id": "nm4779836",
      "name": "QiaoQiao Jin",
      "character": "May May"
    },
    {
      "id": "nm5958775",
      "name": "Crystal Lee",
      "character": "Lam Lam"
    },
    {
      "id": "nm5958776",
      "name": "Marc Ma",
      "character": "Ah Ho (Gem worker)"
    },
    {
      "id": "nm0401208",
      "name": "Shiu Hung Hui",
      "character": "Boss Suen"
    },
    {
      "id": "nm2237119",
      "name": "Jinsheng Zang",
      "character": "Gao Sheng (Head of Security Guard)"
    },
    {
      "id": "nm0530865",
      "name": "Joe Ma",
      "character": "Lau Ting"
    },
    {
      "id": "nm5969707",
      "name": "Tian Zhenwei",
      "character": "Dong"
    },
    {
      "id": "nm5958779",
      "name": "Siu Fay",
      "character": "Bo Keung"
    },
    {
      "id": "nm4547684",
      "name": "Jia-qi Xu",
      "character": "Mandy       (as Jackie Xu)"
    },
    {
      "id": "nm2779922",
      "name": "Chi Zhang",
      "character": ""
    },
    {
      "id": "nm5958780",
      "name": "Zhenwei Tian",
      "character": ""
    },
    {
      "id": "nm1336132",
      "name": "Hin-Wai Au",
      "character": "CEO Tsang"
    },
    {
      "id": "nm0156600",
      "name": "Yiu Fai Cheung",
      "character": "Victim"
    },
    {
      "id": "nm1708543",
      "name": "Chi-Wai Lai",
      "character": "Huo /              Fok"
    },
    {
      "id": "nm6092181",
      "name": "Leon Lee",
      "character": "Hulk"
    }
  ],
  "overview": "On the hottest day in 50 years, a serious fire incident happened to a busy commercial tower, a gaggle of fire fighters with an indestructible enthusiasm are going to save lives.",
  "storyline": "On the hottest day in 50 years, a serious fire incident happened to a busy commercial tower, a gaggle of fire fighters with an indestructible enthusiasm are going to save lives.",
  "plot": "This article's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (September 2016) (Learn how and when to remove this template message)\nHarvard professor Robert Langdon wakes up in a hospital with a head wound and no memory of the last few days. He last remembers walking on the Harvard campus, but he quickly realizes that he is now in Florence, Italy. Dr. Sienna Brooks, one of the doctors tending to him, reveals that he is suffering from amnesia. When Vayentha, a female assassin, shows up in the hospital, Sienna helps Langdon escape, and they flee to her apartment.\n\nAfter Sienna recounts the details of his admission to the hospital, Robert finds a cylinder with a biohazard sign in his jacket and decides to call the U.S. consulate. He is told that they are searching for him and want his location. Per Sienna's guidance, Robert gives them a location across the street from Sienna's apartment to avoid getting Sienna more involved in his mysterious situation than she already is. Soon, Robert sees Vayentha pull up to the location Robert gave the consulate. At this point, Sienna and Robert believe the U.S. government wants to kill him.\n\nRobert decides to open the container and finds a small medieval bone cylinder fitted with a hi-tech projector that displays a modified version of Botticelli's Map of Hell, which is based on Dante's Inferno. At the bottom of the illumination are the words, \"The truth can be glimpsed only through the eyes of death.\" Suddenly, soldiers raid Sienna's building.\nThe Palazzo Vecchio in Florence\nRobert and Sienna head toward the Old City, believing the cylinder must have something to do with Dante. However, they find that Florentine police and Carabinieri officers have sealed the bridges and are searching for them. They run into a construction site near the Boboli Gardens where Robert illuminates the modified \"Map of Hell\" again, notices that individual letters, which collectively spell \"CATROVACER,\" have been added to each of the ten layers of the Malebolge and that the layers have been rearranged. Moving them back to the order in the original Botticelli \"Map of Hell\" yields the words \"CERCA TROVA.\" Robert recognizes these are the same words on the painting The Battle of Marciano by Vasari, located in the Palazzo Vecchio. Robert and Sienna manage to evade the soldiers and get into the Old City using the Vasari Corridor.\n\nRobert stands in front of The Battle of Marciano trying to figure out where to go next by connecting the \"eyes of death\" phrase in the modified \"Map of Hell\" with his location. A custodian sees Robert snooping around and gets the director of the museum in the Palazzo Vecchio, Marta Alvarez. Marta recognizes Robert, having met him and Ignazio Busoni, the director of Il Duomo, the previous night. She leads Robert and Sienna up a set of stairs by The Battle of Marciano, and Robert realizes the top of the stairs is on the same level as the words \"cerca trova\" in the The Battle of Marciano painting. Marta tells Robert that she showed them Dante's death mask the previous night, which sits in a room down the hall from the Battle of Marciano painting. Robert realizes he is retracing his own steps from the previous night. Marta takes Robert and Sienna to the mask and find that it's gone. They look at security footage and see Robert himself and Ignazio stealing the mask. The museum guards turn on Robert and Sienna. At this moment, Marta calls Ignazio's office to question him but is greeted by his secretary, who informs Marta that Ignazio died of a heart attack the other night but left a message for Robert moments before he died. Ignazio's secretary asks to speak with Robert and plays Ignazio's message to him. In it, Ignazio esoterically tells Robert where the mask is hidden, referring to \"Paradise 25.\"\nGates of Paradise at Florence Baptistry\nRobert and Sienna escape the guards, but the soldiers arrive. They cross the attic over the Apotheosis of Cosimo I, where Sienna pushes Vayentha to her death. Robert connects the phrase \"Paradise 25\" to the Florence Baptistry, where he and Sienna find the Dante mask along with a riddle from its current owner, a billionaire geneticist named Bertrand Zobrist. Sienna explains that Zobrist was a geneticist who advocated the halting of humanity's growth, due to its out of control population and that he was rumored to be working on a means to do so using an engineered disease. A man named Jonathan Ferris, with a large bruise on his chest which he hides from the two, and a severe rash on his face, claiming to be from the World Health Organization (WHO), comes and helps them escape the soldiers. They follow the riddle to Venice, where Ferris suddenly falls unconscious, with Sienna claiming he is suffering from massive internal bleeding, causing Langdon to suspect Ferris has been infected with Zobrist's plague. Robert is captured by a group of black-clad soldiers while Sienna escapes.\n\nRobert is taken to Elizabeth Sinskey, the director-general of the WHO, and is given an explanation of what is going on: Zobrist, who committed suicide the week before, was a brilliant geneticist and Dante fanatic who had supposedly developed a new biological plague that will kill off a large portion of the world's population in order to quickly solve the problem of the world's impending overpopulation, citing the Doomsday Argument. Elizabeth raided Zobrist's safe deposit box, found the cylinder and flew Robert to Florence to follow the clues. However, Robert stopped communicating with Elizabeth after meeting with Marta and Ignazio and the WHO feared he betrayed them and was working with Zobrist to unleash the plague. The soldiers were the WHO's emergency response team and never meant to kill Robert.\n\nZobrist had paid a shadowy consulting group called The Consortium to protect the cylinder until a certain date. He also left a disturbing video filled with Dante imagery, which also showed a picture of the plague itself, kept in a hidden underwater location, within a slowly dissolving bag. The video claims that the world will be changed the following morning. When Elizabeth took it away, they were obligated to protect whatever the bone cylinder pointed to. They kidnapped Robert after the meeting with Marta and Ignazio, but Robert hadn't yet solved the whole riddle. They gave Robert benzodiazepine drugs to erase his short-term memory, created a fake head wound and staged every event up to this point so that Robert would be motivated to solve it. Sienna, Vayentha and Ferris are all actors working for The Consortium; the call to the U.S. consulate was also staged. The leader of The Consortium, having become aware of the bioterrorism plot, agrees to cooperate with the WHO. Ferris's rash was due to an allergic reaction to the spirit gum he used as part of the disguise as the doctor Vayentha \"murdered.\" His bruises were because the squib used to simulate him being shot in the chest misfired and broke his ribs. He collapsed in Venice because he had been ordered to detain Sienna, as the Provost (Consortium head) had allied with Sinskey, with Sienna realizing and punching him in his damaged ribs.\nTomb of Enrico Dandolo, at the Hagia Sophia\nSienna goes rogue and The Consortium realizes she was a secret supporter and lover of Zobrist. She learned where the plague was being kept after Robert solved the riddle and acquires a private jet to get to it before everyone else. Robert, the WHO and The Consortium team up to stop her. After watching Zobrist's video, they conclude that the bag containing the plague will be fully dissolved by the date the video specifies and that Zobrist's clues point to its location: the Hagia Sophia in Istanbul, where Enrico Dandolo is buried. Robert and the others find the plague is in the Cistern but discover that Sienna is already there. The bag that held the plague had already been broken, presumably spreading through the outer world via visiting tourists. Sienna runs out of the Cistern yelling something in Turkish, which causes panic among the tourists who stampede out into the city while Langdon gives chase.\nInside Basilica Cistern, with water below and tourists above\nIt is discovered Sienna didn't puncture the bag; it was water-soluble and had dissolved one week earlier in the cistern waters, meaning that the whole world has already been infected. The date specified in Zobrist's video was the mathematical calculation of when the entire world would be infected. It is also discovered that Sienna was trying to stop the virus herself, but didn't trust the WHO because samples of the virus would certainly find their way into the hands of governments performing weapons research. The leader of The Consortium tries to escape WHO custody with help from disguised underlings, but is caught later by Turkish police. It is implied that The Consortium will be investigated and ruined. Sienna receives amnesty in exchange for working with the WHO to address the crisis, since she is a medical doctor and has extensive knowledge of Zobrist's research and work.\n\nThe plague that Zobrist created is revealed to be a vector virus that randomly activates to employ DNA modification to cause sterility in one third of humans, thereby reducing population growth to a more stable level. Sienna and Elizabeth decide not to try to reverse Zobrist's actions, Sienna pointing out that doing so would be difficult and hazardous even for someone like Zobrist and Elizabeth acknowledging that Zobrist had a point about the dangers of overpopulation.",
  "synopsis": null
}