{
  "imdb_id": "tt2980648",
  "tmdb_id": "228194",
  "douban_id": null,
  "title": "The Hundred",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "122 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm0002120",
      "name": "Lasse Hallström"
    }
  ],
  "writer": [
    {
      "id": "nm1140275",
      "name": "Steven Knight",
      "description": "screenplay"
    },
    {
      "id": "nm5728000",
      "name": "Richard C. Morais",
      "description": "novel"
    }
  ],
  "cast": [
    {
      "id": "nm0000545",
      "name": "Helen Mirren",
      "character": "Madame Mallory"
    },
    {
      "id": "nm0700875",
      "name": "Om Puri",
      "character": "Papa"
    },
    {
      "id": "nm2110485",
      "name": "Manish Dayal",
      "character": "Hassan"
    },
    {
      "id": "nm3114649",
      "name": "Charlotte Le Bon",
      "character": "Marguerite"
    },
    {
      "id": "nm1904716",
      "name": "Amit Shah",
      "character": "Mansur"
    },
    {
      "id": "nm2186704",
      "name": "Farzana Dua Elahe",
      "character": "Mahira"
    },
    {
      "id": "nm5935626",
      "name": "Dillon Mitra",
      "character": "Mukthar"
    },
    {
      "id": "nm6318530",
      "name": "Aria Pandya",
      "character": "Aisha"
    },
    {
      "id": "nm0003508",
      "name": "Michel Blanc",
      "character": "Mayor"
    },
    {
      "id": "nm0796316",
      "name": "Clément Sibony",
      "character": "Jean-Pierre"
    },
    {
      "id": "nm0252979",
      "name": "Vincent Elbaz",
      "character": "Paul"
    },
    {
      "id": "nm0004487",
      "name": "Juhi Chawla",
      "character": "Mama"
    },
    {
      "id": "nm1117382",
      "name": "Alban Aumard",
      "character": "Marcel"
    },
    {
      "id": "nm6668708",
      "name": "Shuna Lemoine",
      "character": "Mayor's Wife"
    },
    {
      "id": "nm0087604",
      "name": "Antoine Blanquefort",
      "character": "Thomas"
    },
    {
      "id": "nm5165256",
      "name": "Malcolm Granath",
      "character": "Swedish Chef"
    },
    {
      "id": "nm6668709",
      "name": "Abhijit Buddhisagar",
      "character": "Baleine Grise Porter"
    },
    {
      "id": "nm4575116",
      "name": "Rohan Chand",
      "character": "Hassan (7 years old)"
    },
    {
      "id": "nm0015289",
      "name": "Masood Akhtar",
      "character": "Anwar"
    },
    {
      "id": "nm0563254",
      "name": "Arthur Mazet",
      "character": "Waiter"
    },
    {
      "id": "nm0208402",
      "name": "Laetitia de Fombelle",
      "character": "Female Officer"
    },
    {
      "id": "nm1325161",
      "name": "Cédric Weber",
      "character": "Officer"
    },
    {
      "id": "nm3330347",
      "name": "Piero Filippi",
      "character": "Dog Walker"
    },
    {
      "id": "nm6668710",
      "name": "Robert Gailhard",
      "character": "Mushroom Stall Holder"
    },
    {
      "id": "nm0316702",
      "name": "Matyelok Gibbs",
      "character": "Lady Shepherd"
    },
    {
      "id": "nm6668711",
      "name": "Paul Daubeze",
      "character": "Poultry Man"
    },
    {
      "id": "nm6668712",
      "name": "Didier Joy",
      "character": "Monsieur Itan"
    },
    {
      "id": "nm1913866",
      "name": "Max Rangotte",
      "character": "Angry Man"
    },
    {
      "id": "nm6668713",
      "name": "Saachi Parekh",
      "character": "Young Aisha"
    },
    {
      "id": "nm6668714",
      "name": "Shaunak Parekh",
      "character": "Young Mukhtar"
    },
    {
      "id": "nm1760451",
      "name": "Stéphanie Renouvin",
      "character": "Newsreader"
    },
    {
      "id": "nm6387898",
      "name": "Audrey Meschi",
      "character": "Baleine Grise Cook"
    },
    {
      "id": "nm6668715",
      "name": "Christian Allieres",
      "character": "Cafe Server"
    },
    {
      "id": "nm6668716",
      "name": "Patrick Blatger",
      "character": "Mechanic"
    },
    {
      "id": "nm6668717",
      "name": "Frederic Violante",
      "character": "Bike Rider"
    },
    {
      "id": "nm6668718",
      "name": "Chantal Filippi",
      "character": "Dog Walker's Wife"
    },
    {
      "id": "nm0788915",
      "name": "Sanjay Sharma",
      "character": "Mob Leader"
    },
    {
      "id": "nm0673580",
      "name": "Morgan Perez",
      "character": "Guard"
    }
  ],
  "overview": "A story centered around an Indian family who moves to France and opens a restaurant across the street from a Michelin-starred French restaurant.",
  "storyline": "The family of talented cook, Hassan Kadam, has a life filled with both culinary delights and profound loss. Drifting through Europe after fleeing political violence in India that killed the family restaurant business and their mother, the Kadams arrive in France. Once there, a chance auto accident and the kindness of a young woman, Marguerite, in the village of Saint-Antonin-Noble-Val inspires Papa Kadam to set up a Indian restaurant there. Unfortunately, this puts the Kadams in direct competition with the snobbish Madame Mallory's acclaimed haute cuisine establishment across the street where Marguerite also works as a sous-chef. The resulting rivalry eventually escalates in personal intensity until it goes too far. In response, there is a bridging of sides initiated by Hassan, Marguerite and Madame Mallory herself, both professional and personal, that encourages an understanding that will change both sides forever..",
  "plot": "The Kadam family ran a restaurant in Mumbai. The second-oldest son, Hassan (Manish Dayal), was being groomed to replace his mother (Juhi Chawla) as the restaurant's main cook. However, a mob attacks and firebombs the restaurant over an election dispute. Papa Kadam (Om Puri) and his family evacuate the guests, but Mama is killed. Seeking asylum in Europe, the family first settles in London, where their residence proves ill-suited for a restaurant. They depart for mainland Europe.\n\nShortly after entering France, the brakes on Papa's van fail near Saint-Antonin-Noble-Val in the Midi-Pyrénées. Marguerite (Charlotte Le Bon), a sous chef at an upscale French restaurant named \"Le Saule Pleureur\" (\"The Weeping Willow\"), passes by and offers to help the Kadams find an auto repair shop and a guest house. She brings the Kadams to her apartment and treats them to cold food. Papa is amazed at the quality of the food in the village and its availability and discovers that Marguerite made the food herself.\n\nPapa learns of an abandoned restaurant building available for purchase. It is located directly across the street — only 30&#160;m — from Le Saule Pleureur. Madame Mallory (Helen Mirren), caretaker for the owners, asks the Kadams to leave because it is \"private property\". Papa buys the property, even though the rest of his family is against it, and names the restaurant \"Maison Mumbai\".\n\nMallory comes over to Maison Mumbai to ask for a menu and then buys all the locally available ingredients needed to cook their dishes on opening night. A cold war erupts between Papa and Mallory. The war peaks on Bastille Day when one of Mallory's chefs, Jean-Pierre, and two others vandalize the Kadams' restaurant by spray-painting words which translate to \"France for the French\" on the outer wall and firebombing the interior. Hassan catches the arsonists in the act and scares them off, but his hands and legs are burned. The following morning Mallory, who knew nothing of the arson and vandalism, dismisses Jean-Pierre and personally cleans the graffiti from Maison Mumbai.\n\nHassan, having heard from Marguerite that Mallory hires potential chefs by taste-testing an omelette and deciding whether the person is indeed a great chef, asks if he may cook an omelette for her to his recipe. Due to his injured hands, Mallory helps under Hassan's supervision. After tasting the omelette, Mallory recognizes Hassan's potential and invites him to work for her. Papa is initially against the move, but ultimately strikes a deal with her as to Hassan's pay.\n\nHassan's cooking, which gradually evolves into a fusion of Indian cuisine and French cuisine, results in Mallory's restaurant receiving its second Michelin star. The award draws national attention to Hassan's cooking, and he is offered and accepts a job in Paris. Papa and Mallory make amends and begin seeing each other.\n\nHassan's cooking in Paris quickly receives critical acclaim, fueling speculation of a third Michelin Star for the Paris restaurant, but his work is increasingly bogged down by thoughts of his family and Marguerite (with whom he had an ongoing romance). Hassan returns home and reunites with Marguerite. He invites Marguerite to join him in a business venture—buying a stake in Mallory's restaurant, along with operational control. Hassan believes this will help the restaurant earn its third star. That evening, Hassan and Marguerite prepare dinner at Mallory's restaurant and bring the dishes across the road to the courtyard of Maison Mumbai for all to enjoy.",
  "synopsis": "In the opening scene, at a customs office, Hassan Kadam (Manish Dayal) explains to French Immigration why he and his family want to live in France: his family had owned a restaurant in Mumbai, but on an election night, there was a riot and their restaurant was set on fire, killing his mother who was the chef. He learned everything about cooking from her and has been trying to teach himself as his Papa moves the family about Europe. He fondly remembers buying sea urchins, the seller exclaiming that he gets cooking. Admitting he doesn't have any proof that he knows how to cook, except to offer a homemade samosa and saying that English produce isnt good enough, the Kadam family is allowed in.Papa (Om Puri) is driving the family throughout the French countryside, trying out random vegetable gardens, when their old van finally gives out in the hills above Saint-Antonin-Noble-Val, a small village. A young woman passes by, offering to take them to the local mechanic. The family (also brothers Mansur and Mukthar and sisters Mahira and Aisha) push the van into town. Marguerite (Charlotte Le Bon), the woman, brings them to her apartment and offers a snack- a huge platter of radishes, butter and salt; home baked bread; large, fresh tomatoes; olives she picked and cured herself and little pastries. Delighted, Papa eagerly looks forward to bargaining with the hotel in town, much to Mansurs dismay.In the morning, Papa discovers an abandoned restaurant. As he and Hassan are exploring, Madame Mallory (Helen Mirren) announces they are trespassing. She admits she is not the owner either, but keeping an eye on the property for the owner who is in Paris. Again, Papa wants to bargain with the owner and soon we see the family cleaning up the restaurant to turn it into Maison Mumbai. The family finds out the reason why Madame is so hostile- she owns the restaurant just across the street: Le Saule Pleureur, a one star Michelin restaurant.Hassan finds mildewed French cookbooks in the kitchen as they prepare for the opening and strikes up a friendship with Marguerite, who he discovers is the sous chef at Madame's. Madame runs a tight ship, scolding employees for serving limp asparagus, saying food should be passionate. She visits her competition, demanding they turn down their Indian music and studies a menu which she takes with her. On opening day, Papa and Hassan travel to market only to discover Madame has snatched up all the crawfish, mushrooms and everything else in town on their opening night menu. Scrambling to save the day, the family forages the river and forest for the needed ingredients and manages to snag customers with native costumes, Mahira's smile and forceful behavior.Madame appeals to the mayor to close Maison Mumbai for various citations, but he appreciates the food too much. Papa turns the tables on Madame and purchases all the ingredients in town for pigeon truffle, one of the restaurant's renowned dishes. Marguerite tells Hassan that Madame doesn't interview job applicants, but asks them to prepare an omelet, knowing from one bite whether or not they have it. Hassan cooks a dish of pigeon with truffle sauce, (the recipe stolen with a bribe from Papa from one of the cooks), which he presents to Madame, and she then dumps in the trash. This is now war (cue the angry chopping).Madame tells her head chef, Jean-Pierre that he is a soldier, which he takes too seriously and has friends torch Maison Mumbai. Horrified, she personally scrubs their wall free of graffiti, fires Jean-Pierre and accepts when Hassan asks to make her an omelet, although he has to direct her since he severely burned his hands in the attack. His omelet includes Indian spices, onions, cilantro and spicy peppers. She raves after one bite and humbly admits that chefs must study for years for what he instinctively knows and admits that his pigeon was wonderful too.After a brief haggle with Papa over salary, Hassan moves across the street (one hundred feet), leaving behind his disappointed younger sister and hesitant older brother (who now has to cook) to polish off his cooking skills with Madame and Marguerite. At the end of one year, Hassan and Le Saule Pleureur have received the much coveted second Michelin star and Marguerite's controlled anger for she has been working for years to be head chef and also because Hassan will now be courted by many Parisian restaurants. The widowed Madame has clearly warmed to the Kadam family, calling Mahira a beauty, cooing to the younger children and feeding Papa a truffle.Another year later and Hassan is burnt out. He is much applauded, but he has taken up drinking (wine is considered strange in Indian culture). One night before Michelin stars are announced, he scolds a sous chef for ruining a sea urchin dish and finds a fellow Indian co-worker enjoying food sent from home. Soon he is taking a train back to Saint-Antonin-Noble-Val, where he tells Marguerite that he has a business proposition for her. Secretly cooking sea urchin for Bastille Day, they consummate their relationship before Madame (who is now Papa's \"almost\" girlfriend) introduces them as the new partners of her restaurant to her guests and the Kadam family, who didn't even know that Hassan was back in town. When Hassan's phone rings, Papa sees that the call was from Michelin and implores him to call them back, but Hassan insists that he and Marguerite will get a third star next year at Le Saule Pleureur."
}