{
  "imdb_id": "tt2922382",
  "tmdb_id": "190742",
  "douban_id": null,
  "title": "Neram (2013)",
  "genres": [
    "Action",
    "Drama",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "117 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.5,
  "director": [
    {
      "id": "nm4737195",
      "name": "Alphonse Puthren"
    }
  ],
  "writer": [
    {
      "id": "nm4737195",
      "name": "Alphonse Puthren",
      "description": "story"
    },
    {
      "id": "nm4737195",
      "name": "Alphonse Puthren",
      "description": "writer"
    },
    {
      "id": "nm4737195",
      "name": "Alphonse Puthren",
      "description": null
    },
    {
      "id": "nm4733887",
      "name": "Alphonse Puthren.M",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4028885",
      "name": "Nivin Pauly",
      "character": "Mathew (Malayalam) /              Vetri (Tamil)"
    },
    {
      "id": "nm2601111",
      "name": "Nazriya Nazim",
      "character": "Jeena (Malayalam) /              Veni (Tamil)"
    },
    {
      "id": "nm0018203",
      "name": "Lalu Alex",
      "character": "Johnykutty"
    },
    {
      "id": "nm5654277",
      "name": "Bobby Simha",
      "character": "Vatti Raja       (as Simhaa)"
    },
    {
      "id": "nm4446366",
      "name": "Thambi Ramayya",
      "character": "Saravannar"
    },
    {
      "id": "nm1432578",
      "name": "Shammi Thilakan",
      "character": "SI Ukken Tintu"
    },
    {
      "id": "nm0621937",
      "name": "Nassar",
      "character": "Dhandapaani M       (as Nasser)"
    },
    {
      "id": "nm0419677",
      "name": "Manoj K. Jayan",
      "character": "Rayban"
    },
    {
      "id": "nm3682633",
      "name": "John Vijay",
      "character": "Katta Kunju"
    },
    {
      "id": "nm1706602",
      "name": "Charlie",
      "character": ""
    },
    {
      "id": "nm5654687",
      "name": "Ramesh Thilak",
      "character": "(as RJ Ramesh Thilak)"
    },
    {
      "id": "nm0619047",
      "name": "Anant Nag",
      "character": ""
    },
    {
      "id": "nm5682173",
      "name": "Shabareesh Varma",
      "character": ""
    },
    {
      "id": "nm5631806",
      "name": "Crane Manohar",
      "character": "Auto Driver"
    },
    {
      "id": "nm1007581",
      "name": "Manobala",
      "character": "Doctor"
    },
    {
      "id": "nm2936907",
      "name": "Siju Wilson",
      "character": "(as Wilson Joseph)"
    },
    {
      "id": "nm5682221",
      "name": "Deepak Nathan",
      "character": "White Villain"
    },
    {
      "id": "nm5852449",
      "name": "Joju George",
      "character": "Mathew's Brother-in-law"
    },
    {
      "id": "nm6106368",
      "name": "Munishkanth",
      "character": ""
    },
    {
      "id": "nm5682160",
      "name": "S.V. Krishna Shankar",
      "character": "Manick       (as Krishnasankar)"
    }
  ],
  "overview": "Mathew (Nivin Pauly) is a graduate in software engineering, but is now jobless. He is waiting for his good time to get a good job. Mathew has borrowed some money as loan. Now he cannot give it back as he has no job.  Mathew's childhood friend Jeena Johnykkutty (Nazriya) is ready to help him as she could. She has a job. Her father Johnykkutty (Lalu Alex) does not like Mathew and he always tries to trouble Mathew whenever he gets a chance.  At this time Mathew's good time arrives; but along with it many problems too. The gripping events that follow plot the rest of 'Neram'.",
  "storyline": "The lead character Vettri (Nivin) is a nomad in search of a job after being fired from a bankrupt multinational. He borrows some money from a local goon Vattiraja (Simhaa) for some family commitments and he is not able to repay it back on time. To pile up his troubles, his girlfriend Veni (Nazriya) runs away from home as her father does not acknowledge their love. To add fuel to the flare, his sister's husband demands the pending dowry to start over his new found business. All of these need to happen by 5pm in a single day and of course with little time left. If you think that's the end to all of Vettri's woes, no! There are plenty more which keep mounting his head, so will he successfully repay Vattiraja to escape his wrath? What happens to his love? How does he escape the police?",
  "plot": "Neram is all about the life of Mathew (Vetri in Tamil version; played by Nivin Pauly) and Jeena (Veni in Tamil; played by Nazriya Nazim).\n\nMathew is a computer engineering graduate but lost his job. His life is a little complicated now, because he has taken a loan from a private moneylender Vatti Raja (Bobby Simha) and is not able to repay the amount. Jeena's dad Johnykutty (Lalu Alex) (Saravanar in Tamil; played by Thambi Ramaiah) denies her marriage with Mathew as he is jobless.\n\nJeena decides to elope with Mathew and Mathew's friend John gives him the money for paying off his debt to Vatti Raja. On their way, Jeena's chain is snatched and Mathew's money is stolen. VattiRaja calls him and asks him to settle the money within 5 in the evening.\n\nJohnykutty lodges a complaint with SI Ukken Tintu (Shammi Thilakan) (Katta kunju in Tamil; played by John Vijay) against Mathew on charges of kidnapping Jeena and gives his number. The sub-inspector calls him and tells him that he should come along with Jeena to the police station within 5 in the evening. But problems are yet to come; Mathew's brother-in-law asks some amount of money from him to start a business (even that is scheduled for five in the evening). On the other hand, Jeena is kidnapped by Vatti Raja's men assuming her to be other guy's girlfriend who also has to return money to Raja.\n\nMathew comes across the same guy and decides to snatch his chain. But unfortunately at the moment he tries to snatch the chain, the guy meets with an accident and Mathew takes him to a hospital. The guy's brother RayBan (Manoj K. Jayan) (Dhandapani in Tamil; played by Nassar), who has influence assures Mathew of a job in his company. Suddenly, SI Ukken Tintu arrives there and says that Vatti Raja died in an accident and a flashback reveals that Lighthouse (RJ Ramesh Thilak), the guy who stole Jeena's chain and Mathew's money had borrowed some money from Raja too. He plots with two other in having the money for themselves and to steal Vatti Raja's car. While, the plans works out perfectly Vatti Raja's men went behind the car and Raja goes behind the other guy. In the chase Raja is hit by an auto and dies. Coincidentally, the auto driver was the driver who hit RayBan's brother Manik with his vehicle too.\n\nLast of all, Mathew meets the guys who stole his money and involves in a brawl with them. He finds his money and a chain inside the car and also finds Jeena in the car's rear (Vatti Raja hid her in his car). Mathew gives the money to his brother-in-law and the movie ends with a happy note.",
  "synopsis": null
}