{
  "imdb_id": "tt2946542",
  "tmdb_id": "375656",
  "douban_id": null,
  "title": "Las Vegas Story (2015)",
  "genres": [
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.4,
  "director": [
    {
      "id": "nm3336371",
      "name": "Byron Q."
    }
  ],
  "writer": [
    {
      "id": "nm3336371",
      "name": "Byron Q.",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm5740642",
      "name": "Christina Bocanegra",
      "character": "Maria"
    },
    {
      "id": "nm0019860",
      "name": "Wade Allain-Marcus",
      "character": "Doug"
    },
    {
      "id": "nm0266908",
      "name": "Francesca Fanti",
      "character": "Izzy"
    },
    {
      "id": "nm0000616",
      "name": "Eric Roberts",
      "character": "Walter"
    },
    {
      "id": "nm3719458",
      "name": "Bianca Sia",
      "character": "Val       (as Bianca Siavoshy)"
    },
    {
      "id": "nm1092107",
      "name": "David Huynh",
      "character": "Jonathan"
    },
    {
      "id": "nm9545765",
      "name": "Chyla Bocanegra",
      "character": "Justina"
    },
    {
      "id": "nm9545766",
      "name": "Zaid Bocanegra",
      "character": "Zaid"
    },
    {
      "id": "nm1783289",
      "name": "Matt Bradford",
      "character": "Frat Boy #2"
    },
    {
      "id": "nm3245226",
      "name": "Chris Trouble Delfosse",
      "character": "Trouble       (as Chris 'Trouble' Delfosse)"
    },
    {
      "id": "nm6350249",
      "name": "Radames E. Fernandez",
      "character": "Other Frat Guy       (as Radames Fernandez)"
    },
    {
      "id": "nm3519687",
      "name": "Patrick Flanagan",
      "character": "Wilson Coke Head"
    },
    {
      "id": "nm0127970",
      "name": "Jayne Krashin",
      "character": "Woman at Bar"
    },
    {
      "id": "nm6757795",
      "name": "G. Scott Spence",
      "character": "Baldy"
    },
    {
      "id": "nm2158278",
      "name": "Brian J. Watson",
      "character": "Frat Boy #1"
    },
    {
      "id": "nm1600248",
      "name": "Shawn Wilson",
      "character": "Drug Fiend"
    }
  ],
  "overview": "An escort, a stripper, and a drug dealer come together in Las Vegas in this tale of gangsters, second chances, and finding love in Sin City.",
  "storyline": "Maria is an Escort working in the city of Las Vegas to support her 4 kids. When 2 friends from her past come back into her life, it pushes her to re-evaluate the choices she made and what the future holds.",
  "plot": "Happy (Hoagy Carmichael), as the piano player at the Last Chance casino in Las Vegas, wonders what split up Linda Rollins (Jane Russell) and Dave Andrews (Victor Mature). Dave went off to fight in the South Pacific, but when he returned, Linda was gone. Happy soon finds out.\n\nLinda reluctantly returns to Las Vegas by train when her husband Lloyd (Vincent Price) insists on vacationing there. Fellow passenger Tom Hubler (Brad Dexter) hurriedly gets off as well when the Rollins do. Linda discovers that her husband is in some kind of financial trouble, possibly criminal as well, and suspects he is trying to raise money by gambling. The first night, Lloyd insists she wear her necklace, appraised at $150,000, when they go out. She encounters Dave, now a lieutenant with the Sheriff's Department, who is initially none too pleased to see her again.\n\nThe next day, Hubler tries to become friendly with Linda at the hotel pool, but she brushes him off. He later informs Lloyd that he has been assigned by his insurance company to watch him and the necklace.\n\nLloyd obtains $10,000 credit with Clayton, owner of the appropriately named Last Chance casino, by putting up Linda's necklace, but inevitably loses it all gambling. He tries to get Clayton to advance him more credit, but is turned down. Early the next morning, Clayton is found stabbed to death, and the necklace is missing.\n\nDave arrests Lloyd. Lloyd tries to get his wife to provide him an alibi, but as she was with Dave at his home at the time, she cannot lie for him.\n\nDave, however, figures out the real killer's identity when Hubler slips up and reveals the location of the stabbing. After the murderer left, Clayton managed to try to reach the telephone before dying. Dave phones Linda to warn her, but Hubler finds out and kidnaps Linda. With roadblocks set up on all major highways and a description of his rented car, he steals another car, killing the owner when he objects. Dave takes a helicopter and spots the speeding vehicle. He and the pilot manage to force Hubler to leave the car at an abandoned base. Hubler wounds the pilot and forces Dave to throw out his gun by threatening to kill Linda, but after a chase and a fight, Dave is able to retrieve a gun and shoot Hubler dead.\n\nBack in Las Vegas, Linda decides to break up with her husband and remain in Las Vegas. Lloyd is arrested for embezzlement and other charges.",
  "synopsis": null
}