{
  "imdb_id": "tt2949196",
  "tmdb_id": "342896",
  "douban_id": null,
  "title": "I Lived (2015)",
  "genres": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.5,
  "director": [
    {
      "id": "nm0451076",
      "name": "Franck Khalfoun"
    }
  ],
  "writer": [
    {
      "id": "nm0451076",
      "name": "Franck Khalfoun",
      "description": "written by"
    },
    {
      "id": "nm0451076",
      "name": "Franck Khalfoun",
      "description": "idea and"
    },
    {
      "id": "nm4694096",
      "name": "Brian Breiter",
      "description": "idea"
    }
  ],
  "cast": [
    {
      "id": "nm4818601",
      "name": "Jeremiah Watkins",
      "character": "Josh"
    },
    {
      "id": "nm1686536",
      "name": "Sarah Power",
      "character": "Greta"
    },
    {
      "id": "nm3419187",
      "name": "Christopher Mena",
      "character": "Bobby Yen       (as Chris Mena)"
    },
    {
      "id": "nm0664005",
      "name": "Elaine Partnow",
      "character": "Mrs. Lee"
    },
    {
      "id": "nm0306967",
      "name": "Jan Broberg",
      "character": "Josh's Mom"
    },
    {
      "id": "nm0195590",
      "name": "Nic D'Avirro",
      "character": "Josh's Dad"
    },
    {
      "id": "nm1507804",
      "name": "Luis Fernandez-Gil",
      "character": "Roberto Luis"
    },
    {
      "id": "nm2412129",
      "name": "Maja Miletich",
      "character": "Genny"
    },
    {
      "id": "nm4694096",
      "name": "Brian Breiter",
      "character": "The Man"
    },
    {
      "id": "nm1711948",
      "name": "Shannon Collis",
      "character": "Drunk Girl"
    },
    {
      "id": "nm3912910",
      "name": "Josh Cowdery",
      "character": "Executive #2"
    },
    {
      "id": "nm2453520",
      "name": "Jonathan M. Howard",
      "character": "Café Patron"
    },
    {
      "id": "nm0451076",
      "name": "Franck Khalfoun",
      "character": "Detective McQuee       (voice)"
    },
    {
      "id": "nm4564865",
      "name": "Koral Michaels",
      "character": "Kidnap Girl"
    },
    {
      "id": "nm4110758",
      "name": "Thomas Payton",
      "character": "Zach"
    },
    {
      "id": "nm2644665",
      "name": "Ron Reznik",
      "character": "Executive #1"
    },
    {
      "id": "nm1599589",
      "name": "Greg Taieb",
      "character": "Jeremy Otto"
    },
    {
      "id": "nm6174832",
      "name": "Anthony Vitali",
      "character": "Café Patron"
    },
    {
      "id": "nm4869032",
      "name": "Tim Paul Vordtriede",
      "character": "The Man in Black"
    }
  ],
  "overview": "Josh Fosse is a 20something guy whose life is going nowhere. His girl left, his rent is late, and he lacks a real job. He is trying to make it as an app reviewer online and decides to review a self help app called i-Lived for fun. He's signs on and immediately his life turns around. He meets the girl of his dreams and he gets a job offer he can't refuse. Convinced it's him and not the app, he signs out... and loses everything. He signs on again but this time the terms are different, the app is asking him to do things that are out of his moral comfort zone... but essential to becoming the success the app tells him he can be.",
  "storyline": "Josh Fosse is a 20something guy whose life is going nowhere. His girl left, his rent is late, and he lacks a real job. He is trying to make it as an app reviewer online and decides to review a self help app called i-Lived for fun. He's signs on and immediately his life turns around. He meets the girl of his dreams and he gets a job offer he can't refuse. Convinced it's him and not the app, he signs out... and loses everything. He signs on again but this time the terms are different, the app is asking him to do things that are out of his moral comfort zone... but essential to becoming the success the app tells him he can be.",
  "plot": "This article's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (March 2016) (Learn how and when to remove this template message)\nElla is born to loving parents on a beautiful estate in a peaceful kingdom. Since childhood, she is taught by her mother to believe in magic, allowing her to befriend the animals on the estate, especially the mice. Everything is perfect until Ella's mother falls terminally ill. On her deathbed, she asks Ella to always face life's difficulties with courage and kindness. Some years later, seeking to recapture happier times, Ella's father remarries Lady Tremaine, the widow of an old acquaintance, who has two daughters of her own: Drisella and Anastasia. Ella welcomes her new stepfamily, despite the stepsisters' unpleasant attitudes.\n\nWhen Ella's father goes abroad for business, Lady Tremaine slowly reveals her cruel and jealous nature, as she pushes Ella to give up her bedroom to the stepsisters for the attic. Ella's life takes a turn for the worst when her father dies during the trip, causing Lady Tremaine to dismiss the household to save money and forcing all the chores on Ella. One morning, when her stepfamily see Ella's face covered in cinders due to Ella sleeping by the fireplace for warmth, they mock Ella as \"Cinderella\" and forbid her from eating with them.\n\nCrushed by their cruelty, Ella rides off into the woods, where she meets Kit, who is part of a hunting party chasing a stag, and mistakes Kit for an apprentice from the palace. Not knowing Kit is actually the crown prince to the kingdom, Ella admonishes him for hunting the stag, and pleads for the stag's freedom, to which Kit agrees. Touched by his kindness, Ella takes a liking of Kit. Kit is likewise enchanted by Ella's charm, kindness, and unique outlook to life. The two part without Kit learning Ella's name, but not before both express the wish to see each other again. The King, upon learning he has little time left, insists Kit take a bride, who should be a princess for the advantage of the kingdom, at the upcoming royal ball. Kit persuades his father to invite every eligible maiden in the land to the ball, in hope of seeing Ella.\n\nWhen the ball is announced, the Tremaines are ecstatic at the prospect of marrying into royalty. Ella is also excited to attend the ball for the chance to see Kit, and fixes up her mother's old pink dress when Lady Tremaine refuses to buy her a new one. On the night of the ball, Ella tries to join her step-family on the way out, but Lady Tremaine, together with her daughters, ridicule and tear up Ella's dress, then leave without her. Losing courage, Ella runs into the garden in tears and meets an old beggar woman, who reveals herself to be Ella's fairy godmother. To help Ella attending the ball, the fairy godmother magically transform a pumpkin into a magnificent carriage, four mice into white horses, two lizards into footmen, a goose into a coachman, and finally Ella's ripped dress into a gorgeous blue gown, complete with a pair of magical glass slippers. Before sending Ella on her way, the fairy godmother warns the magic will be broken at the last stroke of midnight.\n\nAt the ball, the entire court is entranced by Ella, especially Kit. Nervous but happy to see each other, Ella and Kit have a perfect first dance, as if the two have been partners their entire lives. This irritates the Grand Duke, as he has promised Kit to Princess Chelina of Zaragoza, which Lady Tremaine overhears.\n\nWhile surprised at Kit's true identity, Ella nonetheless has a marvelous time with Kit, touring the palace grounds and Kit's secret garden. As Ella about to tell Kit her name, the clock begins striking as midnight approaches, forcing Ella to flee and accidentally drop one of her glass slippers, which is picked up by Kit. Ella manages to get away at the final stroke of midnight as the spell wears off, which causes the animals and Ella's dress to return to their original state. Ella hides the one glass slipper she has under the floorboards of her room as a keepsake, reasonably content that her one night will become a beautiful memory.\n\nThe King dies soon after, but not before giving his son permission to marry Ella, having changed his mind due to his brief meeting with Ella at the ball. Once becoming king, Kit sends out declaration of his love and intention to marry the \"mystery princess who wears glass slippers\" to the ball. Excited that Kit feels the same way about her as she does him, Ella hurries to retrieve the glass slipper to prove her identity, only to find her stepmother holding it. Having deduced that Ella is the mystery princess, Lady Tremaine demands to be made head of the royal household and respectable husbands for the stepsisters, as a condition of giving Ella's hand in marriage to Kit. When Ella refuses, Lady Tremaine smashes the slipper and locks Ella in the attic. Lady Tremaine then takes the shattered slipper to the Grand Duke, and has him agreeing to make her a countess and advantageous marriages for her daughters, in exchange for keeping Ella hidden. The Grand Duke tries to convince Kit to give up looking for the mystery princess with the shattered slipper, but this only makes Kit suspicious that the Grand Duke may know Ella's whereabouts.\n\nThe Grand Duke and the Captain of the Guards lead the mission to find the mystery princess by trying the remaining slipper on all of the maidens in the land, but the magical slipper refuses to fit. When they arrive at Ella's estate, the shoe fits neither of the stepsisters. As they turn to leave, Ella's singing of \"Lavender's Blue\" is heard through a window that the mice opened. The Grand Duke tries to ignore this, but one of the guards is actually Kit in disguise, who then asks the Captain to investigate the source of the singing. Once Ella is found, Lady Tremaine forbids her from trying on the shoe on the grounds that she is Ella's mother. Ella tells Lady Tremaine that she never has been, and never will be, her mother, then leaves the attic for the living room, where Kit is waiting.\n\nElla and Kit are thereby reunited. Kit recognizes Ella even before Ella trying on the slipper, which fits her perfectly. Promising to take each other as they are, Ella and Kit leave the house as Ella offers forgiveness to her stepmother. Afterward, Ella's stepfamily, along with the Grand Duke, leave the kingdom, never to return, as their actions become public knowledge.\n\nAt last, Ella and Kit are married. The Fairy Godmother narrates that they became the land's most beloved monarchs, ruling with the same courage and kindness that Ella has promised her mother, and that they lived happily ever after.",
  "synopsis": null
}