{
  "imdb_id": "tt2907640",
  "tmdb_id": "297755",
  "douban_id": null,
  "title": "L.DK (2014)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "Japan",
  "version": [],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm2346369",
      "name": "Taisuke Kawamura"
    }
  ],
  "writer": [
    {
      "id": "nm5669421",
      "name": "Ayu Watanabe",
      "description": "manga"
    },
    {
      "id": "nm1883488",
      "name": "Yûko Matsuda",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm4081467",
      "name": "Kento Yamazaki",
      "character": "Kugayama Syusei"
    },
    {
      "id": "nm3897573",
      "name": "Ayame Gôriki",
      "character": "Aoi Nishimori"
    },
    {
      "id": "nm1885802",
      "name": "Akiyoshi Nakao",
      "character": "Ryosuke Kato"
    },
    {
      "id": "nm1029524",
      "name": "Takashi Fujii",
      "character": "Teacher Onda"
    },
    {
      "id": "nm2955232",
      "name": "Ren Kiriyama",
      "character": "Wataru Sanjo"
    },
    {
      "id": "nm0847395",
      "name": "Reiko Takashima",
      "character": "Sayoko"
    },
    {
      "id": "nm3087358",
      "name": "Anna Ishibashi",
      "character": "Satsuki Mizuno"
    },
    {
      "id": "nm1764306",
      "name": "Miho Shiraishi",
      "character": "Kazumi Hoshino"
    },
    {
      "id": "nm2449574",
      "name": "Rei Okamoto",
      "character": "Moe Shibuya"
    },
    {
      "id": "nm7440633",
      "name": "Kokoro Terada",
      "character": "Kota Hoshino"
    },
    {
      "id": "nm6738990",
      "name": "Wataru Kuriyama",
      "character": "Takagi"
    },
    {
      "id": "nm1963141",
      "name": "Seiji Fukushi",
      "character": "Soju Kugayama"
    },
    {
      "id": "nm4071896",
      "name": "Shôhei Abe",
      "character": "Traffic Control Police Officer"
    },
    {
      "id": "nm5845869",
      "name": "Takeshi James Yamada",
      "character": ""
    },
    {
      "id": "nm7214064",
      "name": "Chiharu Tomita",
      "character": "Ryoko"
    }
  ],
  "overview": "Aoi Nishimori's parents moved to another city for work, but Aoi didn't want to transfer to a new high school. She stays behind and lives in an apartment by herself. Shusei Kugayama moves in next to Aoi's apartment. Shusei is a very popular student at their high school. Due to a mistake, Aoi makes the sprinkler go off in his room. Until Shusei's room is fixed, he stays with Aoi.",
  "storyline": "Aoi Nishimori's parents moved to another city for work, but Aoi didn't want to transfer to a new high school. She stays behind and lives in an apartment by herself. Shusei Kugayama moves in next to Aoi's apartment. Shusei is a very popular student at their high school. Due to a mistake, Aoi makes the sprinkler go off in his room. Until Shusei's room is fixed, he stays with Aoi.",
  "plot": "Shūsei Kugayama, the \"Prince\" of his high school, has a reputation of turning down confessions from admiring girls; Aoi Nishimori takes offense after he turns down her best friend, Moe Shibuya. Later that day, Aoi is greeted by her new apartment neighbor which turns out to be Shūsei. After a kitchen fire accident ruins Shūsei's apartment, Shūsei decides to move into Aoi's flat, but becomes more casual and friendly towards her at school. After getting to know him better, Aoi falls in love with him, although he does not initially return that feeling. Meanwhile, they must keep their cohabitation a secret. Aoi tries to divert the girls who are interested in Shūsei, the guys who are interested in her, and family members who reveal hints about Shūsei's past. The two eventually come to fall in love with one another.\nCharacters\nAoi Nishimori\n\nAoi Nishimori (西森 葵（にしもり あおい）, Nishimori Aoi?) is a 16-year-old high school girl who lives in her own apartment after refusing to move away with her parents. She is described as impulsive, but is inexperienced with love. She has no reservations in confronting the school prince Shūsei Kugayama over her best friend Moe's confession rejection, but is surprised when Shūsei becomes her new next-door neighbor. She is a capable cook, however, because of Shūsei's presence, she becomes careless and a fire erupts in his kitchen. After Shūsei moves in with her,Ch. 1 Aoi is shocked that he is so casual and friendly towards her at home and at school,Ch. 2 but soon develops feelings for him,Ch. 3 and becomes sensitive to other girls who express interest in him.Ch. 4 In the live-action film she is portrayed by Ayame Gouriki.\nShūsei Kugayama\n\n Shūsei Kugayama (久我山 柊聖（くがやま しゅうせい）, Kugayama Shūsei?) is regarded highly as the school prince, even though he has a habit of rudely turning down the girls' confessions.Ch. 1 He becomes Aoi's next-door neighbor in the apartments, but after a kitchen fire causes the sprinklers to drench his place, he moves into Aoi's apartment.Ch. 1 He likes to tease Aoi by acting very casual at home, by visiting her class,Ch. 2 by making randomly inappropriate remarks about Aoi's undergarmentsCh. 6 and by pulling practical jokes.Ch. 13 Despite that, he is protective of Aoi.Ch. 4 His past relationship with Satsuki Mizuno has affected how he behaves towards women, but he warms up to Aoi and eventually reciprocates her love.Ch. 30 Media articles from Animate.tv and Animeanime.jp describe him as being tsundere. In the live-action film, Shūsei is portrayed by Kento Yamazaki.\nSupporting characters\nMoe Shibuya (渋谷 萌（しぶや もえ）, Shibuya Moe?) is Aoi's best friend.Ch. 1 A week prior to the start of the story, she confesses to Shūsei but is turned down.Ch. 1 She easily reads that Aoi has fallen in love with Shūsei, even though Aoi has denied it.Ch. 2-3 Moe is portrayed by Rei Okamoto in the film.The landlady of Aoi and Shūsei's apartment is a widowed mother with her son Kouta.Ch. 4 She takes a liking to Wataru Sanjo. She is later revealed to be a former delinquent and had ridden a Harley with her husband.Ch. 19-20 Her name is not given in the manga, but in the live-action film she is named Kazumi Hoshino (星野カズミ, Hoshino Kazumi?) and she is portrayed by Miho Shiraishi.,Eri Kugayama (久我山 絵里（くがやま えり）, Kugayama Eri?) is Shūsei's older sister; she is suspicious of Shūsei and Aoi's living situation as they have not acted like a couple and insists that Shūsei stay with her, but later lets them be.Ch. 4-5Shōta Komine (小嶺 翔太（こみね しょうた）, Komine Shōta?) is a class-year younger than Aoi and Shūsei. Aoi describes him as a pretty boy.Ch. 7 He shows an interest in Aoi after having a friendly encounter with her in the cultural festival the previous year, and tries to woo her after seeing her again, which makes Aoi uncomfortable and Shūsei jealous.Ch. 7-8 He and Shūsei were on the basketball team together in middle school.Ch. 7Sōju Kugayama (久我山 草樹（くがやま そうじゅ）, Kugayama Sōju?) is Shūsei’s older brother who works as a photojournalist. He talks to Aoi about her relationship with Shūsei and gives her some advice. After Aoi fails to kiss Shūsei, Sōju demonstrates with his own kiss on her,Ch. 11 and then gets Aoi to act affectionate with him in order to make Shūsei jealous when he visits.Ch. 12 He is engaged to Satsuki,Ch. 8 but their marriage registration is later called off.Ch. 27-28 Sōju is portrayed by Seiji Fukushi.Satsuki Mizuno (水野桜月, Mizuno Satsuki?) is Shūsei's childhood friend in middle school and was part of the basketball club. She dated Shūsei, but they broke up.Ch. 5-8 She appears in the story as the fiancée to Shūsei's older brother, Sōju.Ch. 8 After the marriage registration is called off, she gets her own apartment and tries to cling onto Shūsei.Ch. 27-29 She is portrayed by Anna Ishibashi in the live-action film.Wataru Sanjo (三條亙, Sanjō Wataru?) enters the story as a new tenant in the apartments.Ch. 18 He is a senior student at Aoi's school. Both he and Aoi enjoy cooking. He likes Aoi because of her smile at the sports festival last year.Ch. 18 After Aoi gets upset that Shūsei revealed the cohabitation secret to him so casually, he comforts Aoi, and promises to keep it secret unless Shūsei makes her unhappy.Ch. 19 After Shusei leaves, he confesses to Aoi and offers to support her emotionally.Ch. 22-23 After realizing that Aoi is always going to put Shūsei first in her heart, he lets go.Ch. 29 He has three older sisters and his parents are overseas in China.Ch. 19, 28 In the live-action film, he works at a nearby food accessories store. He is portrayed by Ren Kiriyama.Ryosuke Sato (佐藤亮介, Satō Ryōsuke?) is Shūsei's close friend, a high school senior and a character exclusive to the live-action film. He ends up dating Moe. He is portrayed by Akiyoshi Nakao, who is usually associated with teacher roles instead of student roles because of his age (25 years old). In an interview, Nakao said that he promises to do his best to play the character without any awkwardness.Aoi's father (葵の父, Aoi no chichi?) visits and learns of Aoi and Shusei's cohabitation. He tries to pull Aoi out of school.Ch. 32-33 He is a former bodybuilder that Aoi calls a \"muscle narcissist\".Ch. 32-34 When Aoi gets into trouble at the park, he tries to save her but has gotten too old to handle the delinquents.Ch. 35 After Aoi is rescued by Shūsei and she declares her desire to protect Shūsei as he protected her, he agrees to let them live together under the condition they stay together but not have sex.Ch. 35",
  "synopsis": null
}