{
  "imdb_id": "tt2952692",
  "tmdb_id": "220262",
  "douban_id": null,
  "title": "State of Play (2013)",
  "genres": [
    "Documentary",
    "Drama",
    "Sport"
  ],
  "country": "Belgium",
  "version": [
    {
      "runtime": "87 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm1743306",
      "name": "Steven Dhoedt"
    }
  ],
  "writer": [
    {
      "id": "nm1743306",
      "name": "Steven Dhoedt",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm3148280",
      "name": "Adam Chaffin",
      "character": ""
    }
  ],
  "overview": "A feature documentary about the world of South-Korean professional gamers.  Every year thousands of South-Koreans flock to the game stadiums in Seoul to watch the Pro League, a live sports event where professional gamers compete to be the best at one single video game: Starcraft.  It’s a title many young South Koreans dream of. The game itself is more than a decade old, almost ancient in the fast developing world of video games, but in South Korea it has become a national past-time. Like most specator sports, this world of eSports rapidly evolved in a multi-million dollar business.  In this story, we follow 3 boys in different stages of their career as a Pro-Gamer in South Korea. For some it will be a struggle to stay on top of their game, for others it might be the turning point of their lives",
  "storyline": "In Seoul, hundreds of young boys compete to be the best at one single video game: StarCraft. As top players earn hundreds of thousands of euros, being a professional gamer isn't only a wise career move, it is also the path to respect and credibility in the highly competitive society of South Korea. The stars of the StarCraft league are national celebrities, participating on all levels of popular culture. But what happens when play becomes work? For some it will be a struggle to stay on top of their game, for others it might be the turning point of their lives.",
  "plot": null,
  "synopsis": null
}