{
  "imdb_id": "tt2966280",
  "tmdb_id": "168170",
  "douban_id": null,
  "title": "Klein Karoo (2013)",
  "genres": [
    "Comedy",
    "Romance"
  ],
  "country": "South Africa",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm0074566",
      "name": "Regardt van den Bergh"
    }
  ],
  "writer": [
    {
      "id": "nm4861048",
      "name": "Etienne Fourie",
      "description": "screenplay and"
    },
    {
      "id": "nm5721038",
      "name": "Tim Theron",
      "description": "story &"
    },
    {
      "id": "nm4442686",
      "name": "Stefan Enslin",
      "description": "script editor"
    }
  ],
  "cast": [
    {
      "id": "nm5721038",
      "name": "Tim Theron",
      "character": "Frans Coetzee"
    },
    {
      "id": "nm5724097",
      "name": "DonnaLee Roberts",
      "character": "Cybil Ferreira"
    },
    {
      "id": "nm2157323",
      "name": "Hykie Berg",
      "character": "Meyer Labuschagne"
    },
    {
      "id": "nm1549573",
      "name": "Sisanda Henna",
      "character": "Bongi"
    },
    {
      "id": "nm1936540",
      "name": "Anel Alexander",
      "character": "Sophie Ferreira"
    },
    {
      "id": "nm3508884",
      "name": "Pierre Breytenbach",
      "character": "Karel Kiempie"
    },
    {
      "id": "nm1433138",
      "name": "Hélène Truter",
      "character": "Hermientjie       (as Helene Truter)"
    },
    {
      "id": "nm3246004",
      "name": "Amalia Uys",
      "character": "Magriet"
    },
    {
      "id": "nm5720861",
      "name": "Bouwer Bosch",
      "character": "Brian"
    },
    {
      "id": "nm3647542",
      "name": "Leandie du Randt",
      "character": "Jackie"
    },
    {
      "id": "nm4986112",
      "name": "Ilse Oppelt",
      "character": "Mrs. Bruinders"
    },
    {
      "id": "nm5907820",
      "name": "Cobus van den Berg",
      "character": "Mr. Gilbert"
    },
    {
      "id": "nm6013004",
      "name": "Llewellyn van den Berg",
      "character": "Llewellyn"
    },
    {
      "id": "nm0074566",
      "name": "Regardt van den Bergh",
      "character": "Estate agent"
    },
    {
      "id": "nm7532221",
      "name": "Damien Staz",
      "character": "Taxi driver"
    }
  ],
  "overview": "A young teacher from Oudtshoorn, Cybil Ferreira, will do anything in her power to ensure the success of her project at the small farm school, Kalfieskraal. Cybil dreams about establishing a centre at the school that will provide a safe haven for the local children.  The problem is, Cybil’s dream is in danger of collapsing before it even gets off the ground. The land Kalfieskraal is situated on is for sale, and none of the possible buyers are interested in her project. Not even her wealthy fiancée, ostrich farmer Meyer Labuschagne, could be bothered about her project or the fate of the children.  Then Frans Coetzee comes into the story. A filmmaker with a broken heart, he is in the Klein Karoo with his team to make a documentary about social upliftment work in the area - and in the process hopefully forget about women, love, and all the baggage that comes with it.",
  "storyline": "A young teacher from Oudtshoorn, Cybil Ferreira, will do anything in her power to ensure the success of her project at the small farm school, Kalfieskraal. Cybil dreams about establishing a centre at the school that will provide a safe haven for the local children, who are struggling under the influence of alcoholism in the Swartberg Valley, especially over weekends. The problem is, Cybil's dream is in danger of collapsing before it even gets off the ground. The land Kalfieskraal is situated on is for sale, and none of the possible buyers are interested in her project. Not even her wealthy fiancée, ostrich farmer Meyer Labuschagne, could be bothered about her project or the fate of the children. Cybil's last chance is to convince the director of the Global Upliftment Fund, currently visiting the Klein Karoo to look for projects to support, to fund her project. Then Frans Coetzee comes into our story. A filmmaker with a broken heart, he is in the Klein Karoo with his team to make a ...",
  "plot": null,
  "synopsis": "A young teacher from Oudtshoorn, Cybil Ferreira, will do anything in her power to ensure the success of her project at the small farm school, Kalfieskraal. Cybil dreams about establishing a centre at the school that will provide a safe haven for the local children, who are struggling under the influence of alcoholism in the Swartberg Valley, especially over weekends.The problem is, Cybils dream is in danger of collapsing before it even gets off the ground. The land Kalfieskraal is situated on is for sale, and none of the possible buyers are interested in her project. Not even her wealthy fiancée, ostrich farmer Meyer Labuschagne, could be bothered about her project or the fate of the children.Cybils last chance is to convince the director of the Global Upliftment Fund, currently visiting the Klein Karoo to look for projects to support, to fund her project.Then Frans Coetzee comes into our story. A filmmaker with a broken heart, he is in the Klein Karoo with his team to make a documentary about social upliftment work in the area - and in the process hopefully forget about women, love, and all the baggage that comes with it.Then Cybil and Frans meet, and their worlds are turned completely upside down.If Cybil decides to follow her heart, will she have to give up her dreams, or is it true love that will make her dreams come true?And is Frans willing to take another chance on love?"
}