{
  "imdb_id": "tt2908344",
  "tmdb_id": "209578",
  "douban_id": null,
  "title": "The Days God Slept (2013)",
  "genres": [
    "Short",
    "Drama",
    "Mystery",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "11 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm0456031",
      "name": "Jeremiah Kipp"
    }
  ],
  "writer": [
    {
      "id": "nm5403421",
      "name": "Joseph Fiorillo",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm3908210",
      "name": "Bradley Creanzo",
      "character": "Strip Club Patron"
    },
    {
      "id": "nm0289113",
      "name": "Lauren Fox",
      "character": "Kristy"
    },
    {
      "id": "nm1225439",
      "name": "Lukas Hassel",
      "character": "Carl"
    },
    {
      "id": "nm1679332",
      "name": "Malcolm Madera",
      "character": "John"
    },
    {
      "id": "nm4908103",
      "name": "Genoveva Rossi",
      "character": "Strip club patron"
    },
    {
      "id": "nm3035900",
      "name": "Greg Skura",
      "character": "Frank"
    },
    {
      "id": "nm2483315",
      "name": "Bob Socci",
      "character": "Patron"
    }
  ],
  "overview": "“The Days God Slept” is a cinematic prayer which uses surrealistic images and non-literal elements to reveal the emotions of its characters. We are introduced to a mysterious Gentleman’s Club where John (played by Malcolm Madera) enters looking for Kristy (Lauren Fox), one of the dancers. He sees her with another patron and when they come together, she says “I have something I need to tell you”. In a series of private exchanges, we begin to understand a sense of the connection between the two. Kristy begins a story that she “needs to tell” John and their blossoming intimacy is harshly derailed. As Kristy struggles to tell her tale, the fantasy realm of the club yields itself to a different reality – the less fanciful daylight of a park. The shifting between locations conveys the shifting realities in the characters’ minds. Ultimately, THE DAYS GOD SLEPT is the story of a man trying to discover the secrets of a woman, which begs the question, “How much do you really want to know?”",
  "storyline": "'The Days God Slept' is a cinematic prayer that deals with love and secrets; with faith and acceptance. Kristy has a secret to tell John and when she does - will their burgeoning ties of affection be strengthened or severed? Or will they find that the hardest thing to accept might be oneself?",
  "plot": "Setting and characters\n\nSleeping Dogs is set in a contemporary Hong Kong, which is split into four districts named after regions of the city. The game reveals the story of Wei Shen (Will Yun Lee), a former San Francisco police officer who was transferred to the Hong Kong Police Force and assigned the task to infiltrate and destroy a Triad organization known as the Sun On Yee (based on the Sun Yee On). The main storyline features two sub-plots: Shen's balance between completing his police mission whilst committing crimes to prove himself to the Triads, and missions assigned by a Triad lieutenant, including assassination of Triad members loyal to other lieutenants.\n\nShen's mission is coordinated by Police Superintendent Thomas Pendrew (Tom Wilkinson), and progress made by Shen is reported to his handler, Raymond Mak (Byron Mann). Shen infiltrates the Sun On Yee via his childhood friend Jackie Ma (Edison Chen), a low-level Triad member; and his loyalty is tested by the Triad boss \"Red Pole\" Winston Chu (Parry Shen). Other characters in the game include the head of the Sun On Yee, David Wai-Lin \"Uncle\" Po (James Hong); Shen's love interest Amanda Cartwright (Emma Stone); Winston's right-hand man, Conroy Wu (Robin Shou); singer Vivienne Lu (Lucy Liu); and Shen's girlfriend Not Ping (Celina Jade).\nEmma Stone voiced Shen's love interest, Amanda Cartwright.Synopsis\n\nThe game begins in Victoria Harbour, where Wei Shen is arrested after a drug deal goes wrong. In jail, Shen meets an old friend, Jackie Ma, who offers to introduce Shen to the members of a Triad gang once they are released. It is later revealed that Shen's arrest was part of a police operation, headed by Superintendent Thomas Pendrew and Raymond Mak, to infiltrate the Water Street branch of a criminal organization, the 'Sun On Yee' Triad gang. Shen joins the gang and is sent on various assignments by the leader, Winston Chu, against a rival branch known as the Jade Gang led by Sam \"Dogeyes\" Lin.\n\nRetaliatory attacks on each other's properties culminate in the killing of Winston and his fiancée at their wedding by 18K gang members. The group leader of the Sun On Yee Triads, David Wai-Lin \"Uncle\" Po, is also critically wounded in the attack but is saved by Shen. As a reward, Shen is promoted to leader of the Water Street branch and hunts down Winston's killer who reveals that Dogeyes was the instigator of the attack. Shen then captures Dogeyes who is killed by Winston's mother. Po later dies in the hospital.\n\nAs a branch leader, Shen becomes embroiled in a power struggle over the leadership of Sun On Yee, siding with \"Broken Nose\" Jiang (Elizabeth Sung) against another branch leader, Henry \"Big Smile\" Lee (Tzi Ma). Shen also refuses Pendrew's order to get off the case out of fear of Lee taking over the leadership. Pendrew then leaks Shen's identity to Lee, who attempts to use this information to disgrace Jiang prior to the upcoming election. After Jackie is killed at the hands of Lee's gang and used as bait to draw out Shen, he's kidnapped by 18k and tortured by Lee's torturer Mr. Tong. Shen then escapes his captors and kills Lee. With the deaths of many senior ranking gang members, Shen is commended on his work but is informed by Mak that Pendrew has since been reassigned and is out of his reach. Shen later receives video evidence from Jiang that Pendrew was responsible for the death of Uncle Po. Pendrew is imprisoned for his crime while Shen returns to the police force.",
  "synopsis": null
}