{
  "imdb_id": "tt2967006",
  "tmdb_id": "242088",
  "douban_id": null,
  "title": "The Trip to Italy (2014)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "108 min",
      "description": ""
    },
    {
      "runtime": "175 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm0935863",
      "name": "Michael Winterbottom"
    }
  ],
  "writer": [
    {
      "id": "nm0935863",
      "name": "Michael Winterbottom",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0176869",
      "name": "Steve Coogan",
      "character": "Steve"
    },
    {
      "id": "nm0117339",
      "name": "Rob Brydon",
      "character": "Rob"
    },
    {
      "id": "nm1024311",
      "name": "Rosie Fellner",
      "character": "Lucy"
    },
    {
      "id": "nm1721217",
      "name": "Claire Keelan",
      "character": "Emma"
    },
    {
      "id": "nm2093873",
      "name": "Marta Barrio",
      "character": "Yolanda"
    },
    {
      "id": "nm6344198",
      "name": "Tim Leach",
      "character": "Joe (Steve's Son)       (as Timothy Leach)"
    },
    {
      "id": "nm0025852",
      "name": "Ronni Ancona",
      "character": "Donna"
    },
    {
      "id": "nm0426038",
      "name": "Rebecca Johnson",
      "character": "Sally (Rob's Wife)"
    },
    {
      "id": "nm6414725",
      "name": "Alba Foncuberta Bufill",
      "character": "La Suvera Receptionist"
    },
    {
      "id": "nm6444553",
      "name": "Flora Villani",
      "character": "Villa Cimbrone Receptionist"
    },
    {
      "id": "nm5500706",
      "name": "Alessandro Cuomo",
      "character": "Mario"
    }
  ],
  "overview": "Two men, six meals in six different places on a road trip around Italy. Liguria, Tuscany, Rome, Amalfi and ending in Capri.",
  "storyline": "Years after their successful restaurant review tour of Northern Britain, Steve Coogan and Rob Brydon are commissioned for a new tour in Italy. Once again, the two comedy buddies/rivals take the landscape as well as the cuisine of that country in a trip filled with witty repartee and personal insecurities. Along the way, their own professional and personal lives comes in as these slightly older men's friendship comes through.",
  "plot": "Series one\n\nIn an effort to impress his gourmet girlfriend, Mischa, actor Steve Coogan has accepted a commission from The Observer newspaper to go on a restaurant tour of the north of England. However, when Mischa insists they take a break from their relationship, Steve is forced to invite colleague and friend-of-sorts Rob Brydon. Coogan has a number of one-night stands, but is miserable both professionally and personally, despite being the bigger star; Brydon, with his young family, is more happy and affable. The two constantly argue and attempt to outdo and humiliate each other with their impersonations of Michael Caine and Sean Connery, for example, especially in the presence of attractive women. The competitive atmosphere is occasionally broken by conversations consisting of friendly and light-hearted improvised banter.\nSeries two\n\nRob and Steve are commissioned to do another restaurant tour, this time in Italy from Piedmont to Capri, following in the footsteps of the great Romantic poets. While on the tour, Rob wins a part in an American Michael Mann film.",
  "synopsis": null
}