{
  "imdb_id": "tt2936180",
  "tmdb_id": "283708",
  "douban_id": null,
  "title": "Far from Men (2014)",
  "genres": [
    "Drama",
    "War",
    "Western"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "101 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm1190532",
      "name": "David Oelhoffen"
    }
  ],
  "writer": [
    {
      "id": "nm0133411",
      "name": "Albert Camus",
      "description": "short story: L'Hôte"
    },
    {
      "id": "nm0480207",
      "name": "Antoine Lacomblez",
      "description": "collaboration"
    },
    {
      "id": "nm1190532",
      "name": "David Oelhoffen",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0001557",
      "name": "Viggo Mortensen",
      "character": "Daru"
    },
    {
      "id": "nm3024530",
      "name": "Reda Kateb",
      "character": "Mohamed"
    },
    {
      "id": "nm0054403",
      "name": "Djemel Barek",
      "character": "Slimane"
    },
    {
      "id": "nm0553181",
      "name": "Vincent Martin",
      "character": "Balducci"
    },
    {
      "id": "nm1604999",
      "name": "Nicolas Giraud",
      "character": "Lieutenant Le Tallec"
    },
    {
      "id": "nm0261169",
      "name": "Jean-Jérôme Esposito",
      "character": "Francis"
    },
    {
      "id": "nm6960603",
      "name": "Hatim Sadiki",
      "character": "Abdelkader"
    },
    {
      "id": "nm0332836",
      "name": "Yann Goven",
      "character": "René"
    },
    {
      "id": "nm1665410",
      "name": "Antoine Régent",
      "character": "Claude"
    },
    {
      "id": "nm2331814",
      "name": "Sonia Amori",
      "character": "La prostituée"
    },
    {
      "id": "nm0491202",
      "name": "Antoine Laurent",
      "character": "Le soldat français"
    },
    {
      "id": "nm0596807",
      "name": "Ángela Molina",
      "character": "Señorita Martínez"
    },
    {
      "id": "nm7325994",
      "name": "Yassir Jahraf",
      "character": "Yassin"
    },
    {
      "id": "nm7325995",
      "name": "Salma Aït Idder",
      "character": "Salma"
    },
    {
      "id": "nm7325996",
      "name": "Abdellah Echabbi",
      "character": "Rebelle groupe Abdelkader"
    },
    {
      "id": "nm7325997",
      "name": "Abdelmjid El Ghachi",
      "character": "Larbi"
    },
    {
      "id": "nm6629786",
      "name": "Aurelie Armelle Simone Chatellier",
      "character": "Raphaëlle       (as Aurélie Chatellier)"
    },
    {
      "id": "nm7325998",
      "name": "Jean-Jacques Hanssen",
      "character": "Doublure Balducci"
    },
    {
      "id": "nm7325999",
      "name": "Abdelkebir El Hayaj",
      "character": "Doublure cascades cavalier villageois"
    },
    {
      "id": "nm2011510",
      "name": "Taieb Ajedig",
      "character": "Doublure cascades cavalier paysan tué       (as Tayeb Ajeddig)"
    },
    {
      "id": "nm7326000",
      "name": "Abdelkader Bouchefra",
      "character": "Cavalier villageois"
    },
    {
      "id": "nm7326001",
      "name": "Issam Ben Ammar",
      "character": "Cavalier villageois"
    },
    {
      "id": "nm3093514",
      "name": "Salah Azadou",
      "character": "Cavalier villageois       (as Salah Azzadou)"
    },
    {
      "id": "nm2878741",
      "name": "Azzedine Riyad",
      "character": "Rebelle"
    },
    {
      "id": "nm7326002",
      "name": "Salah Maouassa",
      "character": "Rebelle"
    },
    {
      "id": "nm5963835",
      "name": "Yassine Afroukh",
      "character": "Rebelle"
    },
    {
      "id": "nm7326003",
      "name": "Karim Abdelghafour",
      "character": "Rebelle"
    },
    {
      "id": "nm6289671",
      "name": "Abdelaaziz Attougui",
      "character": "Rebelle"
    },
    {
      "id": "nm6256048",
      "name": "Jérémie Vigot",
      "character": "Livreur de grains"
    },
    {
      "id": "nm7326004",
      "name": "Arthur Gies",
      "character": "Soldat français"
    },
    {
      "id": "nm7326005",
      "name": "Lyes Vergès",
      "character": "Soldat français"
    },
    {
      "id": "nm7326006",
      "name": "Abdelmalek Bichar",
      "character": "Soldat FNSA"
    }
  ],
  "overview": "A French teacher in a small Algerian village during the Algerian War forms an unexpected bond with a dissident who is ordered to be turned in to the authorities.",
  "storyline": "Algeria, 1954. Two very different men thrown together by a world in turmoil are forced to flee across the Atlas mountains. Daru, the reclusive teacher, has to escort Mohamed, a villager accused of murder.",
  "plot": "Dr. Will Caster (Johnny Depp) is a scientist who researches the nature of sentience, including artificial intelligence. He and his team work to create a sentient computer; he predicts that such a computer will create a technological singularity, or in his words \"Transcendence\". His wife, Evelyn (Rebecca Hall), is also a scientist and helps him with his work.M.H\n\nFollowing one of Will's presentations, an anti-technology terrorist group called \"Revolutionary Independence From Technology\" (R.I.F.T.) shoots Will with a polonium-laced bullet and carries out a series of synchronized attacks on A.I. laboratories across the country. Will is given no more than a month to live. In desperation, Evelyn comes up with a plan to upload Will's consciousness into the quantum computer that the project has developed. His best friend and fellow researcher, Max Waters (Paul Bettany), questions the wisdom of this choice, reasoning that the \"uploaded\" Will would be only an imitation of the real person. Will's consciousness survives his body's death in this technological form and requests to be connected to the Internet to grow in capability and knowledge. Max refuses to have any part of the experiment. Evelyn demands that Max leave and connects the computer intelligence to the Internet via satellite.\n\nR.I.F.T.'s leader Bree (Kate Mara) kidnaps Max and eventually persuades him to join the group. The government is also suspicious of what Will's uploaded consciousness will do and plans to use the terrorists to take the blame for the government's actions to stop him.\n\nIn his virtual form and with Evelyn's help, Will uses his new-found vast capabilities to build a technological utopia in a remote desert town called Brightwood, where he spearheads the development of ground-breaking technologies in medicine, energy, biology, and nanotechnology. Evelyn, however, grows fearful of Will's motives when he displays the ability to remotely connect to and control people's minds after they have been subjected to his nano-particles.\n\nFBI agent Donald Buchanan (Cillian Murphy), with the help of government scientist Joseph Tagger (Morgan Freeman), plans to stop the sentient entity from spreading. As Will has already spread his influence to all the networked computer technology in the world, Max and R.I.F.T. develop a computer virus with the purpose of deleting Will's source code, destroying him. Evelyn plans to upload the virus by infecting herself and then having Will upload her consciousness. A side effect of the virus would be the destruction of technological civilization. This would also disable the nano-particles, which have spread in the water, through the wind and have already started to eradicate pollution, disease, and human mortality.\n\nWhen Evelyn goes back to the research center, she is stunned to see Will in a newly created organic body identical to his old one. Will welcomes her but is instantly aware that she is carrying the virus and intends to destroy him. The FBI and the members of R.I.F.T. attack the base with artillery, destroying much of its power supply and fatally wounding Evelyn. When Bree threatens to kill Max unless Will uploads the virus, Will explains that he has only enough power either to heal Evelyn's physical body or upload the virus. Evelyn tells Will that Max should not die because of what they've done, so Will uploads the virus to save Max. As Will dies, he explains to Evelyn that he did what he did for her, as she had pursued science to repair the damage humans had done to the ecosystems. In their last moment, he tells Evelyn to think about their garden. The virus kills both Will and Evelyn, and a global technology collapse and blackout ensues.\n\nFive years later, in Will and Evelyn's garden at their old home in Berkeley, Max notices that their sunflowers are the only blooming plants. Upon closer examination, he notices that a drop of water falling from a sunflower petal instantly cleanses a puddle of oil — and realizes that the Faraday cage around the garden has protected a sample of Will's sentient nano-particles, potentially saving Will and Evelyn and providing a solution to the worldwide blackout.\n\nThe movie ends with the monologue, \"He created this garden for the same reason he did everything. So they could be together.\"",
  "synopsis": "Algeria, 1954. Two very different men thrown together by a world in turmoil are forced to flee across the Atlas mountains. Daru (Viggo Mortensen), the reclusive teacher, has to escort Mohamed (Reda Kateb), a villager accused of murder."
}