{
  "imdb_id": "tt2948790",
  "tmdb_id": "333381",
  "douban_id": null,
  "title": "Return to Sender (2015)",
  "genres": [
    "Drama",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "92 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.0,
  "director": [
    {
      "id": "nm3087552",
      "name": "Fouad Mikati"
    }
  ],
  "writer": [
    {
      "id": "nm1729470",
      "name": "Patricia Beauchamp",
      "description": null
    },
    {
      "id": "nm5280688",
      "name": "Joe Gossett",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0683253",
      "name": "Rosamund Pike",
      "character": "Miranda Wells"
    },
    {
      "id": "nm2057036",
      "name": "Shiloh Fernandez",
      "character": "William Finn"
    },
    {
      "id": "nm0000560",
      "name": "Nick Nolte",
      "character": "Mitchell Wells"
    },
    {
      "id": "nm0005179",
      "name": "Camryn Manheim",
      "character": "Nancy"
    },
    {
      "id": "nm1597498",
      "name": "Alexi Wasser",
      "character": "April"
    },
    {
      "id": "nm0932454",
      "name": "Rumer Willis",
      "character": "Darlene"
    },
    {
      "id": "nm0001152",
      "name": "Illeana Douglas",
      "character": "Judy"
    },
    {
      "id": "nm2992448",
      "name": "Stephen Louis Grush",
      "character": "Randy"
    },
    {
      "id": "nm1251245",
      "name": "Donna Duplantier",
      "character": "Karen"
    },
    {
      "id": "nm0054513",
      "name": "Ian Barford",
      "character": "Gary Harland"
    },
    {
      "id": "nm1551999",
      "name": "Billy Slaughter",
      "character": "Kevin"
    },
    {
      "id": "nm0174021",
      "name": "Scout Taylor-Compton",
      "character": "Crystal"
    },
    {
      "id": "nm2142326",
      "name": "Jeff Pope",
      "character": "Sweet Guard"
    },
    {
      "id": "nm0000202",
      "name": "Ryan Phillippe",
      "character": "UPS Delivery Guy"
    },
    {
      "id": "nm0666517",
      "name": "Liann Pattison",
      "character": "Edith Brown"
    },
    {
      "id": "nm1591232",
      "name": "Tony Bentley",
      "character": "Creepy Customer"
    },
    {
      "id": "nm0820660",
      "name": "Marco St. John",
      "character": "Older Man"
    },
    {
      "id": "nm3182681",
      "name": "Ian Casselberry",
      "character": "Line Cook"
    },
    {
      "id": "nm4731168",
      "name": "Tyler Forrest",
      "character": "Flower Delivery Guy"
    },
    {
      "id": "nm5243909",
      "name": "Lucas Boffin",
      "character": "Josh"
    },
    {
      "id": "nm1218757",
      "name": "Keir O'Donnell",
      "character": "Tony Desantos"
    },
    {
      "id": "nm1902362",
      "name": "Cherrae L. Stuart",
      "character": "Nurse"
    },
    {
      "id": "nm0566279",
      "name": "John McConnell",
      "character": "Choking Man"
    },
    {
      "id": "nm1881080",
      "name": "Samantha Beaulieu",
      "character": "Female Doctor"
    }
  ],
  "overview": "A nurse living in small town goes on a blind date with a man who is not the person he says he is.",
  "storyline": "An attractive but lonely nurse accepts a blind date setup by a co-worker and arranges for them to meet at her home. A stranger arrives on her porch before the arranged time and she mistakes him for her blind date. The stranger rapes her and leaves her seriously traumatized. Her life falls apart and she enters depression. She learns much later he is in a prison an hour away and begins visiting him, first to confront him and her fears. Then she starts to flirt and her spirits improve dramatically in the rest of her life.",
  "plot": "Miranda Wells is a nurse living in a small town. She is about to become a surgical nurse and is buying a new house. She's single and her friend sets her up on a blind date with a man named Kevin. On the day of the date, while she's still getting ready, Miranda hears someone outside on the porch. She opens the door and finds someone, who she assumes is Kevin, standing there and invites him in. She offers him lemonade and goes into her bedroom to finish dressing. While she is changing, he notices packing boxes in the house and asks her if she is moving. She replies that she is, and when she comes out of her room she sees he is blocking the door. She starts to feel uneasy and asks him to leave and come back later for their date. He refuses, but she insists that he leave so she can finish getting ready. He walks to the door and locks it. He then attacks and rapes her. Later he is seen running away from the house as someone else comes to the door and knocks. The door is ajar and the man, Kevin, comes in calling out for Miranda. He finds her in the kitchen and calls the police. Miranda is next seen in the hospital, beaten, and having a rape kit and photos taken by the police. The police ask if she had ever seen the man before, and she says that, actually, she had. They quickly promptly go and arrest the rapist, William Finn.\n\nMiranda tries to carry on as normal. Her real estate agent tells her that they can't sell her house now as no one wants to buy a house where someone was just raped. While icing a cake at home she notices a tremor in her right hand and realizes that she can't work in surgery because of it. She decides to write a letter to William in prison, and on mailing the letter she smiles.\n\nShe starts making changes in her life and home, trying to move on. She has shutters fitted on her windows and her father, Mitchell, tries to fix a swing that her dead mother was fond of. Miranda objects, as she only wants new things in her house, and they fight.\n\nMiranda's letter to William keeps being returned to sender. She continues to resend the letter and finally receives a response and goes to visit William. He apologizes repeatedly for what he did to her and she begins to visit him regularly. They become friendly and flirt with each other during her visits. While in prison, William has also been abusing his cell mate without the knowledge of the officers and is eventually released on parole.\n\nMeanwhile, Miranda also befriends her father's aggressive dog by feeding him treats. The dog gets sick, stops eating, and eventually dies.\n\nWhen he is released, William sends Miranda flowers and makes plans to visit her. When he arrives at her home she puts him to work fixing up the porch of her house. They continue to flirt but she never allows him into her house. When William goes to the hardware store where Mitchell works, Mitchell realizes who he is and charges over to Miranda's house to warn her he is out of prison. When he realises William has been to the house, they fight again.\n\nOne day after working on the porch, William says he is not feeling well and begs to be allowed in to use the bathroom. Miranda reluctantly agrees and upon entering the house he collapses. When he wakes up he finds himself strapped to a bed in the basement. She admits to poisoning him with antifreeze in his lemonade. Miranda tells him that she also poisoned her father's dog and allowed her mother to die. He then passes out again as she rolls over a surgical tray. Over the next few hours she amputates his left hand, taunting him with it and saying that she knows what is most important to him.\n\nThe viewer is left to guess if she also amputated his penis. The film ends with Miranda visiting her father, stating that William will not be coming around any more.",
  "synopsis": "A small town nurse agrees to a blind date, but the man who shows up is not who he seems. After a brutal assault she must find a way to regain her sanity."
}