{
  "imdb_id": "tt2972362",
  "tmdb_id": "214910",
  "douban_id": "20399278",
  "title": "Hwayi: A Monster Boy (2013)",
  "genres": [
    "Action",
    "Thriller"
  ],
  "country": "South Korea",
  "version": [
    {
      "runtime": "126 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm2287741",
      "name": "Joon-Hwan Jang"
    }
  ],
  "writer": [
    {
      "id": "nm2287741",
      "name": "Joon-Hwan Jang",
      "description": "co-writer"
    },
    {
      "id": "nm6711056",
      "name": "Joo-Suk Park",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm2412823",
      "name": "Yoon-Seok Kim",
      "character": "Seok-tae"
    },
    {
      "id": "nm2437361",
      "name": "Jin-Woong Cho",
      "character": "Ki-tae"
    },
    {
      "id": "nm1486994",
      "name": "Hyun-Sung Jang",
      "character": "Jin-seong"
    },
    {
      "id": "nm5470717",
      "name": "Seong-gyoon Kim",
      "character": "Dong-beom"
    },
    {
      "id": "nm6262665",
      "name": "Hae-Joon Park",
      "character": "Beom-soo"
    },
    {
      "id": "nm0510546",
      "name": "Ji-Eun Lim",
      "character": "Yeong-joo"
    },
    {
      "id": "nm2305471",
      "name": "Ji-Hyun Nam",
      "character": "Yoo-kyung"
    },
    {
      "id": "nm3673399",
      "name": "Cheol-woo Han",
      "character": ""
    },
    {
      "id": "nm7591922",
      "name": "Jang In-sub",
      "character": "Detective Chang-Ho"
    },
    {
      "id": "nm7611366",
      "name": "Yoon-Seok Jung",
      "character": "Hwayi (child)"
    },
    {
      "id": "nm1018275",
      "name": "Young-min Kim",
      "character": "Detective Jung-min"
    },
    {
      "id": "nm0497710",
      "name": "Kyeong-yeong Lee",
      "character": "Im Hyung-taek"
    },
    {
      "id": "nm5651810",
      "name": "Bok-gi Min",
      "character": "Middle Aged Ex-Prosecutor"
    },
    {
      "id": "nm0600673",
      "name": "Seong-kun Mun",
      "character": "CEO Jin"
    },
    {
      "id": "nm1041148",
      "name": "Yong-woo Park",
      "character": "Detective Chang-ho"
    },
    {
      "id": "nm1296981",
      "name": "Young-hwa Seo",
      "character": "Im Hyung-taek's Wife"
    },
    {
      "id": "nm2494402",
      "name": "Jung-kook Woo",
      "character": "Blind Masseur"
    },
    {
      "id": "nm2082531",
      "name": "Jin-gu Yeo",
      "character": "Hwayi"
    },
    {
      "id": "nm1881661",
      "name": "Yeon-Seok Yoo",
      "character": "Park Ji-won"
    }
  ],
  "overview": "A 5 member gang, led by Seok-Tae (Kim Yun-Seok), kidnaps a baby boy named Hwa-Yi and raises the baby like their own son. The baby boy is now 17 years old (Yeo Jin-Goo) and has turned into a lethal killer. Taking part in his father's gang, Hwa-Yi learns about his own past. Hwa-Yi pulls out his gun to find out who he really is.",
  "storyline": "Hwayi is a boy living in a farm village, who was raised by 5 fathers who were famous criminals. One day, the group is commissioned to kill a man named Lim and his wife. While the rest of the group feel something odd about this particular contact, Suk-tae is adamant to carry out this job with Hwayi in tow. During the job Hwayi discovers a photograph of a child in Lim's house. Eventually, Suk-tae hands his gun to Hwayi and he is forced to pull the trigger. He becomes ill after committing his first kill and realizes that the boy in the photograph looks uncannily familiar.",
  "plot": "In the middle of a forest, a notorious five-member crime organization lives together on a deserted farm. One day, following a plan that didn't go as expected, an infant whom they had kidnapped in a blackmailing scheme is left with them. 14 years later, this boy, who is now named Hwa-yi, lives as the son of his five criminal fathers: Seok-tae, the cold but charismatic leader, Ki-tae, a stammering driving expert, Jin-seong, an ideal planner, Beom-soo, a guns expert, and Dong-beom a cold martial artist. Hwa-yi has been brought up in a unique way, learning skills from his five fathers instead of going to school. Though he has adapted to this life, sometimes he longs for the ordinary life of other boys, which seems impossible for him.\n\nThe gang plans another crime, which will see Hwa-yi participate for the first time. During a fight, Hwa-yi fires a gun to kill someone. At first, his fingers tremble and the gun shakes but after one shot, he keeps pulling the trigger as though possessed. He finds a picture of a child on the man he shot and soon Hwa-yi starts to uncover a huge secret and his tragic destiny. His life is turned upside down when he learns that the man he killed was his real father. From that moment on, Hwa-yi vows revenge on his gangster fathers, using the devious skills he picked up from a life in crime.",
  "synopsis": null
}