{
  "imdb_id": "tt2994832",
  "tmdb_id": "310568",
  "douban_id": null,
  "title": "The Summer of Sangaile (2015)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "Lithuania",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm1626079",
      "name": "Alante Kavaite"
    }
  ],
  "writer": [
    {
      "id": "nm1626079",
      "name": "Alante Kavaite",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm1743180",
      "name": "Julija Steponaityte",
      "character": "Sangaile"
    },
    {
      "id": "nm6356341",
      "name": "Aiste Dirziute",
      "character": "Auste"
    },
    {
      "id": "nm7449762",
      "name": "Jurate Sodyte",
      "character": "Sangaile's Mother"
    },
    {
      "id": "nm7449763",
      "name": "Martynas Budraitis",
      "character": "Sangaile's Father"
    },
    {
      "id": "nm2171923",
      "name": "Laurynas Jurgelis",
      "character": "Saulius"
    },
    {
      "id": "nm0459522",
      "name": "Nele Savicenko",
      "character": "Sangaile's Mother's Friend"
    },
    {
      "id": "nm2073158",
      "name": "Inga Salkauskaite",
      "character": "Auste's Mother"
    },
    {
      "id": "nm7449764",
      "name": "Gaile Butvilaite",
      "character": "Auste's Friend       (as Gaile Butvilayte)"
    },
    {
      "id": "nm8013641",
      "name": "Anupras Jucius",
      "character": "Auste's Friend"
    },
    {
      "id": "nm8013642",
      "name": "Ignas Guzauskas",
      "character": "Auste's Friend"
    },
    {
      "id": "nm6914264",
      "name": "Severina Spakovska",
      "character": "Auste's Friend"
    },
    {
      "id": "nm7499019",
      "name": "Kestutis Cicenas",
      "character": "Auste's Friend"
    },
    {
      "id": "nm8013640",
      "name": "Kamile Petruskeviciute",
      "character": "Auste's Friend"
    },
    {
      "id": "nm7132691",
      "name": "Egle Grigaliunaite",
      "character": "Auste's Friend"
    },
    {
      "id": "nm5358220",
      "name": "Romualdas Gudas",
      "character": "Aeroclub President"
    },
    {
      "id": "nm1874879",
      "name": "Gintaras Tubelis",
      "character": "Padavejas"
    },
    {
      "id": "nm8013643",
      "name": "Ina Rosenaite",
      "character": "Sangaile's Mother's Friend"
    },
    {
      "id": "nm8013644",
      "name": "Judita Stundzyte",
      "character": "Dancer"
    }
  ],
  "overview": "Seventeen-year-old Sangaile is fascinated by stunt planes. She meets a girl her age at the summer aeronautical show, nearby her parents' lakeside villa. Sangaile allows Auste to discover her most intimate secret and in the process finds in her teenage love, the only person that truly encourages her to fly.",
  "storyline": "17 years old Sangaile is fascinated by stunt planes. She meets a girl her age at a summer aeronautical show. Sangaile allows Auste to discover her most intimate secret and in the process finds the only person that truly encourages her to fly.",
  "plot": null,
  "synopsis": "Sangail is a simple teenage girl who dreams of becoming a stunt pilot but her lack of self-confidence and vertigo are preventing her from getting into a cockpit. In the opening scene, Sangail meets another teenage girl, named Aust, at an air show. Sangaile is currently staying with her parents at their lakeside villa for the summer as Sangaile is preparing to enter her senior year in high school. Auste has already graduated from high school and works as a waitress in the cafeteria at the local power plant.As the two girls spend more time together Aust finds ways to get alone time with Sangail as the two teen girls are clearly attracted to each other as Auste brings Sangaile along to party with her outgoing friends. Auste returns home to her divorced mother's apartment which is located on the top floor of a 20-story high rise, as Sangaile returns to her villa to her parents.Throughout the film Sanagil is shown cutting herself in her bathroom. Aust uses photography and fashion to highlight Sangailes inner and outer beauty. The two girls become romantically involved and they enjoy their summer days together revealing their passions and secrets. Aust tries to help Sangail stop cutting herself by becoming her support system and listening to her.There are scenes between Sangail and her parents that show a strained relationship between Sangaile and her mother. Eventually Aust convinces Sangail to go on a stunt plane ride but Sangails vertigo kicks in causing her to feel sick and blame Aust. Sangail eventually apologizes to Aust for yelling and ignoring her. With the support of Aust, Sangail decides to train herself to get over her vertigo so she can ride in a plane again.In the final scene, the film jumps forward with two years having passed since Aust and Sangail last seen each other and both are living their dreams. They are no longer together, but Aust got into fashion school and Sangail is flying planes for the air show."
}