{
  "imdb_id": "tt2910904",
  "tmdb_id": "298382",
  "douban_id": null,
  "title": "The Dressmaker (2015)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "Australia",
  "version": [
    {
      "runtime": "119 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm0602104",
      "name": "Jocelyn Moorhouse"
    }
  ],
  "writer": [
    {
      "id": "nm5672426",
      "name": "Rosalie Ham",
      "description": "novel"
    },
    {
      "id": "nm0389591",
      "name": "P.J. Hogan",
      "description": null
    },
    {
      "id": "nm0602104",
      "name": "Jocelyn Moorhouse",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0000701",
      "name": "Kate Winslet",
      "character": "Tilly Dunnage"
    },
    {
      "id": "nm0001114",
      "name": "Judy Davis",
      "character": "Molly Dunnage"
    },
    {
      "id": "nm2955013",
      "name": "Liam Hemsworth",
      "character": "Teddy McSwiney"
    },
    {
      "id": "nm0915989",
      "name": "Hugo Weaving",
      "character": "Sergeant Farrat"
    },
    {
      "id": "nm0086611",
      "name": "Julia Blake",
      "character": "Irma Almanac"
    },
    {
      "id": "nm0100091",
      "name": "Shane Bourne",
      "character": "Evan Pettyman"
    },
    {
      "id": "nm0289098",
      "name": "Kerry Fox",
      "character": "Beulah Harridiene"
    },
    {
      "id": "nm0316805",
      "name": "Rebecca Gibney",
      "character": "Muriel Pratt"
    },
    {
      "id": "nm0328751",
      "name": "Caroline Goodall",
      "character": "Elsbeth Beaumont"
    },
    {
      "id": "nm1189489",
      "name": "Gyton Grantley",
      "character": "Barney McSwiney"
    },
    {
      "id": "nm0367741",
      "name": "Tracy Harvey",
      "character": "Lois Pickett"
    },
    {
      "id": "nm0394759",
      "name": "Sacha Horler",
      "character": "Una Pleasance"
    },
    {
      "id": "nm2037879",
      "name": "Shane Jacobson",
      "character": "Alvin Pratt"
    },
    {
      "id": "nm0501501",
      "name": "Geneviève Lemon",
      "character": "Mae McSwiney"
    },
    {
      "id": "nm3572924",
      "name": "James Mackay",
      "character": "William Beaumont"
    },
    {
      "id": "nm3851308",
      "name": "Hayley Magnus",
      "character": "Prudence Harridene"
    },
    {
      "id": "nm1074308",
      "name": "Simon Maiden",
      "character": "Photographer"
    },
    {
      "id": "nm0635909",
      "name": "Terry Norris",
      "character": "Septimus"
    },
    {
      "id": "nm0653222",
      "name": "Barry Otto",
      "character": "Mr. Almanac"
    },
    {
      "id": "nm6622874",
      "name": "Rory Potter",
      "character": "Stewart Pettyman"
    },
    {
      "id": "nm3512758",
      "name": "Sarah Snook",
      "character": "Gertrude Pratt"
    },
    {
      "id": "nm0926661",
      "name": "Alison Whyte",
      "character": "Marigold Pettyman"
    },
    {
      "id": "nm6400251",
      "name": "Darcey Wilson",
      "character": "Young Tilly"
    },
    {
      "id": "nm2413529",
      "name": "Mark Leonard Winter",
      "character": "Reginald Blood"
    },
    {
      "id": "nm3375981",
      "name": "Amanda Woodhams",
      "character": "Nancy Pickett"
    },
    {
      "id": "nm1181745",
      "name": "Stan Leman",
      "character": "Ed McSwiney"
    },
    {
      "id": "nm5195126",
      "name": "Madeleine Hogan",
      "character": "Elizabeth McSwiney"
    },
    {
      "id": "nm6977762",
      "name": "Sage Barreda",
      "character": "Margaret McSwiney"
    },
    {
      "id": "nm8563586",
      "name": "Eric Beach",
      "character": "Ancient Drover"
    },
    {
      "id": "nm0496949",
      "name": "Caroline Lee",
      "character": "Fashionable Relative"
    },
    {
      "id": "nm6334248",
      "name": "Gregory Quinn",
      "character": "Detective"
    },
    {
      "id": "nm0682021",
      "name": "Geneviève Picot",
      "character": "Mrs. Tobin"
    },
    {
      "id": "nm0461006",
      "name": "Margot Knight",
      "character": "Mrs. Wood"
    },
    {
      "id": "nm2322820",
      "name": "Francesca Waters",
      "character": "Mrs. Enright"
    },
    {
      "id": "nm0402102",
      "name": "Fletcher Humphrys",
      "character": "Ticket Collector"
    },
    {
      "id": "nm7148103",
      "name": "Lucy Moir",
      "character": "Young Molly"
    },
    {
      "id": "nm4905826",
      "name": "Grace Rosebirch",
      "character": "Young Nancy"
    },
    {
      "id": "nm6204449",
      "name": "Olivia Sprague",
      "character": "Young Gertrude"
    },
    {
      "id": "nm5430221",
      "name": "Alex de Vos",
      "character": "Young Barney"
    },
    {
      "id": "nm0118621",
      "name": "Jason Buckley",
      "character": "Theatre Manager"
    },
    {
      "id": "nm4330722",
      "name": "Katia Nizic",
      "character": "Theatre Patron"
    },
    {
      "id": "nm1503508",
      "name": "Spike Hogan",
      "character": "Theatre Patron"
    },
    {
      "id": "nm4317896",
      "name": "Roy Barker",
      "character": "Doctor"
    },
    {
      "id": "nm8563589",
      "name": "Judah Hobbs",
      "character": "Boy in Wheat"
    },
    {
      "id": "nm4890159",
      "name": "Lanie Lane",
      "character": "Singer"
    },
    {
      "id": "nm8563590",
      "name": "Sandra Talty",
      "character": "Drummer"
    },
    {
      "id": "nm8563591",
      "name": "Howard Cairns",
      "character": "Saxophone Player"
    },
    {
      "id": "nm8563592",
      "name": "Steve Grant",
      "character": "Keyboardist"
    },
    {
      "id": "nm8563593",
      "name": "Malcolm Cole",
      "character": "Piano Player & Organist"
    },
    {
      "id": "nm2933599",
      "name": "Simon Farrow",
      "character": "Winyerp Footballer"
    },
    {
      "id": "nm3205371",
      "name": "Richard Anastasios",
      "character": "Winyerp Footballer"
    },
    {
      "id": "nm5363161",
      "name": "Mike Snow",
      "character": "Dungatar Footballer"
    },
    {
      "id": "nm5576473",
      "name": "Adrian Pickering",
      "character": "Dungatar Footballer"
    },
    {
      "id": "nm8563595",
      "name": "Charlotte Friels",
      "character": "Football Fan"
    }
  ],
  "overview": "In 1950s Australia, beautiful, talented dressmaker Tilly returns to her tiny hometown to right wrongs from her past. As she tries to reconcile with her mother, she starts to fall in love while transforming the fashion of the town.",
  "storyline": "Based on Rosalie Ham's best selling novel, The Dressmaker is the story of femme fatale Tilly Dunnage who returns to her small home town in the country to right the wrongs of the past. A stylish drama with comic undertones about love, revenge and haute couture.",
  "plot": "In 1926 in the Australian outback town of Dungatar, schoolboy Stewart Pettyman dies in unknown circumstances. The only witness to his death, schoolgirl Myrtle Dunnage, is branded a murderer and exiled from the town by Stewart's father and town councillor, Evan Pettyman (Shane Bourne).\n\n25 years later in 1951, Myrtle, now an accomplished dressmaker and going by the name Tilly (Kate Winslet), returns to her hometown to take care of her ill mother Molly (Judy Davis). Upon arrival, she is greeted by local police sergeant Horatio Farrat (Hugo Weaving), who is secretly a cross-dresser. Tilly returns home to find the house squalid and her mother plainly mentally ill which has earned Tilly's mother the nickname \"Mad Molly\" throughout town. Unable to remember the events of 1926, Tilly asks her mother about Stewart Pettyman's death, as she believes that day left her cursed. Molly claims to know nothing about the incident.\n\nThe entire town is quickly alerted to Tilly's return, as well as that of William Beaumont (James Mackay), son of the wealthy and snobbish Elsbeth Beaumont (Caroline Goodall). Gertrude Pratt (Sarah Snook), the daughter of the owners of the town's general store, possesses feelings for William, but lacks the confidence to tell him.\n\nThe town gathers for the local football final game, and everyone is shocked when Tilly turns up to the match in a bright red couture gown that distracts the Dungatar players. During the interval, the handsome Teddy McSwiney (Liam Hemsworth) confronts Tilly about her distracting dress, and Tilly agrees to change. After changing into a black but equally alluring outfit, Tilly gives her business card to Gertrude, offering to make her a dress for the upcoming footballers dance. The last quarter of the game begins, with the teams having swapped ends of the field. Due to this, the opposing team from the nearby town of Winyerp are distracted by Tilly's dress, and Dungatar emerges as the winner. Later, Gertrude arrives at Molly's house to take up Tilly's offer. Tilly agrees to make the dress in exchange for the truth about Stewart Pettyman's death. Gertrude reveals that Tilly had hidden from Stewart Pettyman who had been bullying her mercilessly, but that she revealed Tilly's location in self-defence. Subsequently, Stewart died, but in circumstances unknown to her. Despite feeling betrayed by Gertrude, Tilly agrees to make the dress for her.\n\nAt the footballers dance, Gertrude's dress is a huge success, and she successfully uses it to capture the attention of William. They later become engaged.\n\nSoon, all of the townspeople begin asking Tilly for extravagant dresses. Simultaneously, Teddy pursues a romantic relationship with Tilly. Tilly and Sergeant Farrat also bond over their shared passion for designer clothing, and they form a friendship. Noticing that Tilly is beginning to regain the favour of the townspeople, Councillor Pettyman recruits dressmaker Una Pleasance (Sacha Horler) to start a rival dressmaking service to steal Tilly's business. This is initially successful, but when Gertrude hires Tilly to create her wedding dress, the rest of the townspeople return to Tilly, ruining Una.\n\nTilly uses a feather boa to bribe Sergeant Farrat into letting her read her former schoolteacher Beulah Harridiene's (Kerry Fox) witness statement from the day Stewart Pettyman died. Upon reading it, Tilly discovers that Beulah's statement is false. On the day of Gertrude and William's wedding, Tilly confronts Beulah, and she admits to lying in her witness statement. Tilly rushes to the wedding reception, where she tells Sergeant Farrat about Beulah's lies. Tilly claims that Pettyman had no right to send her away, but Farrat reveals that Pettyman is Tilly's father, and that he had a right as a parent. Meanwhile, Beulah approaches Pettyman's anxious wife Marigold (Alison Whyte), who became a recluse after the death of her son. Marigold is the only townsperson unaware of the rumour that Tilly murdered her son, but Beulah reveals this information to her. Marigold breaks down and starts yelling at Tilly, labelling her a murderer. Tilly runs from the reception, but Teddy chases after her.\n\nTeddy takes Tilly to the schoolhouse, where Tilly begins to remember the events surrounding Stewart Pettyman's death, Stewart subdued her against a wall, threatening to come at night to murder her mother and assault her if she moved. He charged head-down at her, intending to injure her. Instead, she stood aside at the last moment, and Stewart hit his head on the wall and broke his neck. Teddy reveals that the only witness was his brother Barney (Gyton Grantley), who had been sitting on the town silo at the time and saw the whole thing, but due to being developmentally disabled, no-one thought to ask him. Tilly and Teddy then go to his caravan and consummate their relationship, after which Tilly begins to believe that she may no longer be cursed. Later, she and Teddy sit on top of the town silo. Teddy shows off by jumping into the silo, despite Tilly's warning cries. Unbeknownst to them the silo holds sorghum, and Teddy suffocates as he sinks into the grain.\n\nTilly becomes depressed after Teddy's death until her mother encourages her to continue dressmaking. While out in town, Molly suffers a stroke, and later dies. Only Tilly and Sergeant Farrat attend the funeral. Molly's death sets off a chain of disturbing and macabre events. While Tilly and Farrat are holding a wake for Molly, Beulah snoops around the house. Tilly drunkenly objects to the music on the portable record player, and throws it off the verandah, where it hits Beulah and injures her. Beulah is last seen being helped onto the train to Melbourne, ostensibly for treatment but really to be placed in an asylum.\n\nPercival Almanac (Barry Otto), the cruel town chemist who mistreated Tilly as a child, accidentally drowns in a pond at the back of his house. It is discovered that Almanac's wife Irma (Julia Blake) was unable to save her husband due to being under the influence of hash brownies, which had been baked by Molly. In order to prevent Tilly's arrest, Sergeant Farrat takes the blame. He is then removed from the town by his superiors, something which greatly upsets Tilly.\n\nTilly visits Marigold and reveals that her husband has been conducting numerous extramarital affairs, including with Una. Marigold confronts her husband about his unfaithfulness, and subsequently hamstrings him and leaves him to bleed to death.\n\nThe remaining townspeople travel to the neighboring town of Winyerp to perform in a competitive Eisteddfod. Once there, they are shocked to discover that Tilly has designed and sewn all of the costumes for Winyerp's performance. While the townspeople are away, Tilly sets fire to her house and to a bolt of fabric soaked in kerosene that is rolled out down the hill towards the town. Tilly states that she is no longer cursed, and leaves the town by train, her sewing machine her only luggage. The townspeople, seemingly having lost the Eisteddfod, return to the town to find that it has burned down.",
  "synopsis": null
}