{
  "imdb_id": "tt2923316",
  "tmdb_id": "250066",
  "douban_id": "24856648",
  "title": "American Heist (2014)",
  "genres": [
    "Action",
    "Crime",
    "Drama",
    "Thriller"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.2,
  "director": [
    {
      "id": "nm3550361",
      "name": "Sarik Andreasyan"
    }
  ],
  "writer": [
    {
      "id": "nm0408885",
      "name": "Raul Inglis",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0159789",
      "name": "Hayden Christensen",
      "character": "James Kelly"
    },
    {
      "id": "nm0004778",
      "name": "Adrien Brody",
      "character": "Frankie Kelly"
    },
    {
      "id": "nm0108287",
      "name": "Jordana Brewster",
      "character": "Emily"
    },
    {
      "id": "nm1868102",
      "name": "Akon",
      "character": "Sugar"
    },
    {
      "id": "nm0457796",
      "name": "Tory Kittles",
      "character": "Ray"
    },
    {
      "id": "nm1534888",
      "name": "Luis Da Silva Jr.",
      "character": "Spoonie"
    },
    {
      "id": "nm0629634",
      "name": "Lance E. Nichols",
      "character": "Auto Shop Boss"
    },
    {
      "id": "nm7417236",
      "name": "John McConnell",
      "character": "Bank Manager"
    },
    {
      "id": "nm0159609",
      "name": "Joe Chrest",
      "character": "(Police) Captain Sullivan"
    },
    {
      "id": "nm5025209",
      "name": "Aaron V. Williamson",
      "character": "House"
    },
    {
      "id": "nm1377375",
      "name": "Rachel Bilson",
      "character": "Eyewitness"
    },
    {
      "id": "nm0147312",
      "name": "Laura Cayouette",
      "character": "Loan Officer"
    },
    {
      "id": "nm0840285",
      "name": "Carol Sutton",
      "character": "Hostage Woman"
    },
    {
      "id": "nm3877886",
      "name": "Elena Sanchez",
      "character": "Katie"
    },
    {
      "id": "nm6925845",
      "name": "Belinda Delgado",
      "character": "Stripper"
    },
    {
      "id": "nm1885015",
      "name": "Judd Lormand",
      "character": "Paramedic"
    },
    {
      "id": "nm5779376",
      "name": "Stefan Solea",
      "character": "Fellow Inmate"
    },
    {
      "id": "nm5817734",
      "name": "Kaden Washington Lewis",
      "character": "Kid #1"
    },
    {
      "id": "nm4810052",
      "name": "Tyler Humphrey",
      "character": "Kid #2"
    },
    {
      "id": "nm5491068",
      "name": "Christopher Ramage",
      "character": "Co-Worker"
    },
    {
      "id": "nm1682406",
      "name": "Rod Maiorano",
      "character": "Cop"
    },
    {
      "id": "nm5269249",
      "name": "Kyla O'Deay",
      "character": "Flower Girl"
    }
  ],
  "overview": "Two brothers, both with troubled paths, find themselves in the middle of one last bank job.",
  "storyline": "James (Hayden Christensen) owes his life to his older brother, Frankie (Adrien Brody) after taking the rap for a crime they committed together. While Frankie served time, James worked to turn his life around, got a steady job and began courting his former girlfriend Emily (Jordana Brewster). Now, Frankie is released and back on the streets with no money and no place to go. He turns to his underworld connections (Akon) and convinces James to join him in hopes that one last job will be the solution to change both their lives.",
  "plot": "In 1978, con artists Irving Rosenfeld (Christian Bale) and Sydney Prosser (Amy Adams) have started a relationship and are working together. Sydney has improved Rosenfeld's scams, posing as English aristocrat \"Lady Edith Greensly.\" Irving loves Sydney, though is hesitant to leave his unstable and histrionic wife Rosalyn (Jennifer Lawrence), fearing he will lose contact with her son Danny, whom Irving has adopted. Rosalyn has also threatened to report Irving to the police if he leaves her. FBI agent Richie DiMaso (Bradley Cooper) catches Irving and Sydney in a loan scam, but offers to release them if Irving can line up four additional arrests. Richie believes Sydney is English but has proof that her claim of aristocracy is fraudulent. Sydney tells Irving she will manipulate Richie, distancing herself from Irving.\n\nIrving has a friend pretending to be a wealthy Arab sheikh looking for potential investments in America. An associate of Irving's suggests the sheikh do business with Mayor Carmine Polito (Jeremy Renner) of Camden, New Jersey, who is campaigning to revitalize gambling in Atlantic City, New Jersey, but has struggled in fundraising. Carmine seems to have a genuine desire to help the area's economy and his constituents. Richie devises a plan to make mayor Polito the target of a sting operation, despite the objections of Irving and of Richie's boss, Stoddard Thorsen (Louis C.K.). Sydney helps Richie manipulate an FBI secretary into making an unauthorized wire transfer of $2,000,000. When Stoddard's boss, Anthony Amado (Alessandro Nivola), hears of the operation, he praises Richie's initiative, pressuring Stoddard to continue.\n\nCarmine leaves their meeting when Richie presses him to accept a cash bribe. Irving convinces Carmine the sheikh is legitimate, expressing his dislike of Richie, and the two become friends. Richie arranges for Carmine to meet the sheikh, and without consulting the others, has Mexican-American FBI agent Paco Hernandez (Michael Peña) play the sheikh, which displeases Irving. Carmine brings the sheikh to a casino party, explaining mobsters are there and it is a necessary part of doing business. Irving is surprised to hear that Mafia overlord Victor Tellegio (Robert De Niro), right-hand man to Meyer Lansky, is present, and that he wants to meet the sheikh. Mafia man Tellegio explains that the business needs the sheikh to become an American citizen and that Carmine will need to expedite the process. Tellegio also requires a $10,000,000 wire transfer to prove the sheikh's legitimacy.\n\nRichie confesses his strong attraction to Sydney but becomes confused and aggressive when she drops her English accent and admits to being from Albuquerque, New Mexico. Rosalyn starts an affair with a mobster Pete Musane (Jack Huston), whom she met at the party. She mentions her belief that Irving is working with the Internal Revenue Service, causing Pete to threaten Irving, who promises to prove the sheikh's investment is real. Irving later confronts Rosalyn, who admits she told Pete and agrees to keep quiet but wants a divorce. With Carmine's help, Richie and Irving videotape members of Congress receiving bribes. Richie assaults Stoddard in a fight over the money and later convinces Amado that he needs the US$10,000,000 to get Tellegio, but gets only US$2,000,000. A meeting is arranged at the offices of Tellegio's lawyer, Alfonse Simone (Paul Herman), but Tellegio does not appear.\n\nIrving visits Carmine and admits to the scam, but says he has a plan to help him. Carmine throws Irving out and the loss of their friendship hits Irving hard. The feds inform Irving that their US$2,000,000 is missing, and that they have received an anonymous offer to return the money in exchange for Irving and Sydney's immunity and a reduced sentence for Carmine. Amado accepts the deal and Stoddard removes Richie from the case, which effectively ends his career, dropping him back into obscurity. Irving and Sydney move in together and open a legitimate art gallery, while Rosalyn lives with Pete and shares custody of Danny with Irving.",
  "synopsis": null
}