{
  "imdb_id": "tt2910814",
  "tmdb_id": "242095",
  "douban_id": null,
  "title": "The Signal (2014)",
  "genres": [
    "Drama",
    "Mystery",
    "Sci-Fi",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.1,
  "director": [
    {
      "id": "nm1827931",
      "name": "William Eubank"
    }
  ],
  "writer": [
    {
      "id": "nm5673221",
      "name": "Carlyle Eubank",
      "description": "written by"
    },
    {
      "id": "nm1827931",
      "name": "William Eubank",
      "description": "written by"
    },
    {
      "id": "nm0295701",
      "name": "David Frigerio",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm6548076",
      "name": "Patrick Davidson",
      "character": "Boy Playing Claw Game"
    },
    {
      "id": "nm4154798",
      "name": "Brenton Thwaites",
      "character": "Nic"
    },
    {
      "id": "nm4972453",
      "name": "Olivia Cooke",
      "character": "Haley"
    },
    {
      "id": "nm3354041",
      "name": "Beau Knapp",
      "character": "Jonah"
    },
    {
      "id": "nm1443385",
      "name": "Jeffrey Grover",
      "character": "Gas Station Clerk"
    },
    {
      "id": "nm0000401",
      "name": "Laurence Fishburne",
      "character": "Damon"
    },
    {
      "id": "nm6548077",
      "name": "Roy Kenny",
      "character": "Hazmat 1"
    },
    {
      "id": "nm6548078",
      "name": "Timothy Holmes",
      "character": "Hazmat 2"
    },
    {
      "id": "nm6548079",
      "name": "Ricardo Campos",
      "character": "Hazmat 3"
    },
    {
      "id": "nm5349180",
      "name": "Drew Sykes",
      "character": "Hazmat 4"
    },
    {
      "id": "nm0005417",
      "name": "Lin Shaye",
      "character": "Mirabelle"
    },
    {
      "id": "nm0519486",
      "name": "Robert Longstreet",
      "character": "James"
    }
  ],
  "overview": "Three college students on a road trip across the Southwest experience a detour – the tracking of a computer genius who has already hacked into MIT and exposed security faults. When the trio find themselves drawn to an eerily isolated area, suddenly everything goes dark. When one of the students regains consciousness, he finds himself in a waking nightmare.",
  "storyline": "On a road trip, Nic and two friends are drawn to an isolated area by a computer genius. When everything suddenly goes dark, Nic regains consciousness - only to find himself in a waking nightmare.",
  "plot": "Three MIT students – Jonah, Nic, and Haley – are on a road trip to move Haley to California, a decision that stresses Nic's relationship with her. Haley feels Nic is distancing himself from her and Nic explains he doesn't want his disability to hold her back (Nic walks with forearm crutches, and the possibility of muscular dystrophy, multiple sclerosis, or some other degenerative disease is implied but never specified). During their stay in a hotel, Nic and Jonah discover that a hacker named NOMAD, who nearly got them expelled for breaking into MIT servers, has found their location and is taunting them with strange and ominous emails. They track NOMAD to an abandoned house in the middle of Nevada and decide to go after him. After finding nothing in the house, Nic and Jonah hear Haley scream and run outside, only to see her pulled into the sky before disappearing into a white light themselves.\n\nNic, now with the number 2.3.5.41 tattooed on his arm, wakes up in a strange and sterile underground research facility where he is questioned by Dr. Wallace Damon, the head of the \"transition group\" in charge of helping Nic to cope with his strange situation. Damon tells Nic what they encountered near the house was an EBE: an extraterrestrial biological entity. Nic remains in a state of disbelief. Dr. Damon then shows him footage from Nic's own video camera and pauses where an alien face can be seen peering from behind a tree. Nic is taken to his room where he hears Jonah talking to him through a small vent in the wall, saying \"(his) body feels weird.\" Nic also notices that his legs, previously weak but functional, are now completely numb. When Dr. Damon questions him again, Nic tries to get answers about Haley's condition (she is in a coma at the time), but is unsuccessful. Following an unexplained experiment on a cow in another part of the facility, a security alarm goes off and Nic, along with other personnel, finds large dents with scorch marks running across the walls and no sign of Jonah. Nic asks Damon where Jonah went but Damon tells him that Jonah was never recovered from the house. Increasingly agitated, Nic tries to break Haley out but is intercepted. After being restrained, he's shocked to discover that his legs have been amputated and replaced by prostheses made from alien technology. Nic then uses these super-powered limbs to break Haley and himself out of the facility, only to discover they're in the middle of a vast barren desert.\n\nAfter hitching a ride with an old lady who seems sweet yet oddly troubled, Nic and Haley hijack an 18-wheeler truck to try to find a way around the seemingly endless canyon that extends around the facility and surrounding area. At a visitor's center, they come across Jonah disguised as one of the facility workers dressed in a white HAZMAT suit. Jonah reveals that he too had limbs taken from him, as his forearms and hands have been replaced with the same alien technology as Nic's legs. Jonah speculates that they're all in Area 51 and that this is all a test. After Nic discovers indications of alien technology also implanted in Haley's spine, the trio drive up to a military checkpoint where Jonah tries to hack into their systems, only to be stopped by a hail of gunfire from the facility personnel. Nic and Jonah hug as the fatally wounded Jonah prepares for his final stand that will allow Nic and Haley to escape. Jonah uses his remaining strength and prosthetic alien arms to subdue the group of soldiers. However, Nic and Haley's escape is short-lived; as they approach the only bridge that would take them over the canyon to the outside world, they run into Damon and his military men, who blow out the truck's tires. Haley is evacuated by helicopter beyond the canyon and, knowing that Nic has mastered use of his legs, Damon tells Nic \"you can't reach her.\" After hearing a loud horn coming from the sky, Nic realizes Damon is NOMAD. Damon then explains that it was Nic who came looking for him, that this was his fault, and adding that Nic is \"the perfect integration of human will and alien technology. Our finest achievement.\" Agitated and emotionally compromised, Nic's bionic legs enable him to sprint at supersonic speed across the bridge in the direction of Haley's chopper where he hits an invisible barrier and breaks through.\n\nNic finds himself inside what appears to be a different facility behind a projected image of the outside world beyond the canyon. Turning back toward the bridge, he sees Damon remove his helmet to reveal he's actually a robotic alien. Nic walks towards a window and realizes he isn't in a facility, but is on an immense alien spacecraft numbered 2.3.5.41 (matching the numerical tattoo on his arm) that is about to dock at their home-world (signaled by the horn).",
  "synopsis": "Three MIT students Jonah, Nic, and Haley are on a road trip to take Haley to California, a decision that's stressing Nic and Haley's relationship. Haley feels Nic is distancing himself from her and Nic explains he doesn't want his muscular dystrophy to hold her back. During their stay in a hotel, Nic and Jonah discover that the hacker NOMAD (who nearly got Jonah and Nic expelled for breaking into MIT servers), has found their location and is taunting them with strange and ominous emails. They track NOMAD to an abandoned house in the middle of Nevada near their path and decide to go after him. After finding nothing in the house, Nic and Jonah hear Haley scream, and run outside to see her be pulled into the sky, before disappearing into a white light themselves.Nic, now with the number 2.3.5.41 tattooed on his arm, wakes up in a strange and sterile underground research facility, where he is questioned by Dr. Wallace Damon, the head of the \"transition group\" in helping with his strange situation. He tells Nic what they encountered near the house was an EBE: an extraterrestrial biological entity. Nic remains in disbelief. Dr. Damon then shows him footage from his own video camera, and pauses where an EBE can be seen hiding behind a tree looking at him. He is taken to his room where he hears Jonah talking to him through a small vent in the wall, saying his \"body feels weird.\" Nic also notices that his legs, previously weak but functional, are now completely numb. When Dr. Damon questions Nic again, Nic tries to get answers about Haley's condition (she is in a coma at the time), but to no avail. After another night, a security alarm goes off and Jonah disappears. Nic and other personnel in the facility find large scorch marks running across the walls. Nic asks Damon where Jonah went, but Damon says Jonah was \"never recovered\" from the house. Nic tries to break Haley out but is intercepted. After Nic is restrained he's shocked to discover that his legs have been amputated and replaced by prosthetic legs made from alien technology. Nic then uses these super-powered limbs to break himself and Haley out of the facility, only to discover they're in the middle of a vast barren desert area.After hijacking an 18-wheeler tractor truck, Nic and Haley try to find a way around a seemingly endless canyon that extends around the facility and surrounding area. At a visitor's center, they soon come across Jonah disguised as one of the facility's men dressed in a white HAZMAT suit. Jonah reveals that he too had limbs taken from him, as his forearms and hands have been replaced with the same alien technology. Jonah speculates that they're all in Area 51 and that this is all a test. After Nic discovers indications of alien technology also implanted in Haley's spine, the trio drive up to a military checkpoint where Jonah tries to hack into their systems only to be fatally shot. Nic and Jonah hug as Jonah prepares for his final stand to enable Nic and Haley's escape. He uses his remaining strength and prosthetic alien arms to subdue the group of soldiers. However, Nic and Haley's escape is short-lived; as they approach the only bridge that would take them over the canyon to the outside world, they soon run into Damon and his military men who blow out the truck's tires. Haley is evacuated by helicopter beyond the canyon and, knowing that Nic has mastered use of his legs, Damon tells Nic \"you can't reach her.\" After hearing a loud horn coming from the sky, Nic realizes Damon is NOMAD. Damon then explains that it was Nic who came looking for him, that this was his fault, and adding that Nic is \"the perfect integration of human will and alien technology. Our finest achievement.\" Agitated and emotionally compromised, Nic's bionic legs enable him to sprint at supersonic speed across the bridge in the direction of Haley's chopper where he hits an invisible barrier and breaks through.Nic finds himself inside what appears to be a different facility that is behind the image of the outside world beyond the canyon. Turning back toward the bridge, he sees Damon remove his helmet to reveal he's actually a robotic alien. Nic walks towards a window and realizes he isn't in a facility, but is on an alien space habitat numbered 2.3.5.41 that is about to dock at their home-world (signaled by the horn)."
}