{
  "imdb_id": "tt2990122",
  "tmdb_id": "202847",
  "douban_id": null,
  "title": "To The Horizon (2013)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "71 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm5738183",
      "name": "Ryan Lee Taylor"
    }
  ],
  "writer": [
    {
      "id": "nm5738192",
      "name": "Alexander T. Damle",
      "description": "as Alex Damle"
    }
  ],
  "cast": [
    {
      "id": "nm5738184",
      "name": "Charis Beth Swartley",
      "character": "Charlie       (as Charis Swartley)"
    },
    {
      "id": "nm5738185",
      "name": "Aj Jaques",
      "character": "Ash"
    },
    {
      "id": "nm5738186",
      "name": "Maggie Mather",
      "character": "Mia"
    },
    {
      "id": "nm5738187",
      "name": "Brendon King",
      "character": "Gordon"
    },
    {
      "id": "nm5738188",
      "name": "Thomas Van de Pas",
      "character": "Dexter"
    },
    {
      "id": "nm5738189",
      "name": "Ryan Brennan",
      "character": "Scott"
    },
    {
      "id": "nm5738183",
      "name": "Ryan Lee Taylor",
      "character": "John       (as Ryan Taylor)"
    },
    {
      "id": "nm2241134",
      "name": "Jeremy Goldson",
      "character": "Teacher"
    },
    {
      "id": "nm5738190",
      "name": "Jake Laughlin",
      "character": "Friend #1"
    },
    {
      "id": "nm5738191",
      "name": "Koby Adams",
      "character": "Friend #2"
    }
  ],
  "overview": "When a suicidal boy meets a purposeless girl.... something changes. To The Horizon is an offbeat High School Romance about how two people can effect each other in miraculous ways. How the bond between one misguided boy and girl can change everything about them and the people they know. From director Ryan Taylor and writer Alex Damle comes a tale of depression, escape, hope, and the power of love.",
  "storyline": "When Ash meets Charlie on the top of a parking structure, he knows something is different. He was there to jump, she was there to smoke, neither were there by chance. To The Horizon follows the story of Ash, a depressed high school teen who can't seem to find his purpose in life, and Charlie, a high school girl who doesn't need one, who only wants to escape. Their two best friends Gordon and Mia watch as their relationship grows into something bigger than themselves. To The Horizon is the story of how two people can effect not only each other, but the lives of those around them in miraculous ways.",
  "plot": "It is 1935. Before returning to England to become the new Foreign Secretary, writer, soldier, and diplomat Robert Conway (Ronald Colman) has one last task in China: to rescue 90 white Westerners in the city of Baskul. He flies out with the last few evacuees, just ahead of armed revolutionaries.\n\nUnbeknownst to the passengers, the pilot has been replaced and their aircraft hijacked. It eventually runs out of fuel and crashes deep in the Himalayan Mountains, killing their abductor. The group is rescued by Chang (H.B. Warner) and his men and taken to Shangri-La, an idyllic valley sheltered from the bitter cold. The contented inhabitants are led by the mysterious High Lama (Sam Jaffe).\n\nInitially anxious to return to civilization, most of the newcomers grow to love Shangri-La, including paleontologist Alexander Lovett (Edward Everett Horton), swindler Henry Barnard (Thomas Mitchell), and bitter, terminally-ill Gloria Stone (Isabel Jewell), who miraculously seems to be recovering. Conway is particularly enchanted, especially when he meets Sondra (Jane Wyatt), who has grown up in Shangri-La. However, Conway's younger brother George (John Howard), and Maria (Margo), another beautiful young woman they find there, are determined to leave.\n\nConway eventually has an audience with the High Lama and learns that his arrival was no accident. The founder of Shangri-La is said to be hundreds of years old, preserved, like the other residents, by the magical properties of the paradise he has created, but is finally dying and needs someone wise and knowledgeable in the ways of the modern world to keep it safe. Having read Conway's writings, Sondra believed he was the one; the Lama had agreed with her and arranged for Conway's abduction. The old man names Conway as his successor and then peacefully passes away.\n\nGeorge refuses to believe the Lama's fantastic story and is supported by Maria. Uncertain and torn between love and loyalty, Conway reluctantly gives in to his brother and they leave, taking Maria with them, despite being warned that she is much older than she appears. After several days of grueling travel, she becomes exhausted and falls face down in the snow. When they turn Maria over, they discover that she had become extremely old and died, as her departure from Shangri-La had restored her to her true age. Horrified, George loses his sanity and jumps to his death. The Sherpa porters accompanying them were earlier swept away by an avalanche, triggered by one of them who carelessly fires a handgun.\n\nConway continues on and eventually meets up with a search party sent to find him, although the ordeal has caused him to lose his memory of Shangri-La. On the voyage back to England, he remembers everything; he tells his story and then jumps ship. The searchers track him back to the Himalayas, but are unable to follow him any further. Conway manages to return to Shangri-La.",
  "synopsis": null
}