{
  "imdb_id": "tt2924472",
  "tmdb_id": "190945",
  "douban_id": null,
  "title": "Mumbai Police (2013)",
  "genres": [
    "Mystery",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "145 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.0,
  "director": [
    {
      "id": "nm1754432",
      "name": "Roshan Andrews"
    }
  ],
  "writer": [
    {
      "id": "nm1547713",
      "name": "Bobby",
      "description": "writer"
    },
    {
      "id": "nm1332681",
      "name": "Sanjay",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm1335387",
      "name": "Prithviraj Sukumaran",
      "character": "ACP Antony Moses"
    },
    {
      "id": "nm1334389",
      "name": "Jayasurya",
      "character": "ACP Aaryan John Jacob"
    },
    {
      "id": "nm0706721",
      "name": "Rahman",
      "character": "CP Farhan Aman"
    },
    {
      "id": "nm1459571",
      "name": "Mukundan",
      "character": "Caption Srinivas"
    },
    {
      "id": "nm4442444",
      "name": "Aparna Nair",
      "character": ""
    },
    {
      "id": "nm7075534",
      "name": "Nihal Pillai",
      "character": "Gay Friend"
    },
    {
      "id": "nm3731201",
      "name": "Mariya Roy",
      "character": "Srinivas' sister"
    }
  ],
  "overview": "Mumbai Police tells the friendship of 3 police officers, on of them is the Commissioner (Rahman) and other two are Asst. Commissioners (Prithviraj &amp; Jayasurya ) who rules the city of Cochin efficiently without any fear.",
  "storyline": "ACP Antony is the only one who knows the truth behind ACP Aaryan's murder. Antony meets with an accident, losing his memory and is unable to reveal the killer. He is forced to investigate the murder again hoping that he remembers something.",
  "plot": "The movie opens with ACP Antony Moses aka Rascal Moses (Prithviraj) involved in an accident which causes him, a partial memory loss. Before the accident, he was on a call with his brother-in-law Farhan Ashraf (Rahman),Commissioner of police. He informs Farhan that he has solved the murder case of his friend, Assistant Commissioner Aaryan John Jacob (Jayasurya), who was killed during a gallantry awards ceremony at police/parade grounds.But, before disclosing the name of the murderer, accident occurs. Farhan tells Antony, about his past and the tragedy occurred to their friend, Aaryan. He reassigns Antony Moses, back to the case &amp; the whole movie is about how he gets to the eventual murderer even with the disability of memory loss.\n\nAntony Moses at first struggles with the day to day happenings of his increasingly confusing life he lived which he has no memory of and confronts many problems such as assaults by thugs at his residence, complaints of other residents of his flat and a history as an alcoholic and womaniser. He has no clue on how to lead his life and is irritated as he feels like a puppet. He slowly regains confidence and gets back on duty partly due to the encouragement given by Farhan. He understands Farhan,Aaryan and himself were called the \"Mumbai Police\" by the media because of their reckless attitude &amp; ability to get into trouble often.Antony's investigation goes in a completely different way as compared to his investigation before the accident thereby irking &amp; confusing his subordinates. As the murder weapon is suggested to be a most modern sniper rifle, he uses the assistance of a professional sharpshooter (Riyaz Khan) in identifying the modus operandi of the criminal, where the sharpshooter suggests the possibility of the rifle capable of being remote controlled and thereby an absence of a real shooter is suggested.\n\nAntony Moses meets with Aaryan's fiancee who informs him of a personal video of Aryan recorded by her but hesitates to show it to Antony. There are ample twists and turns in this crafty, delicate storyline that keeps catching us unaware. More disclosures lie in store as the film progresses steadily towards a compelling climax.",
  "synopsis": null
}