{
  "imdb_id": "tt2994190",
  "tmdb_id": "244506",
  "douban_id": null,
  "title": "Camp X",
  "genres": [
    "Drama",
    "War"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "117 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.0,
  "director": [
    {
      "id": "nm0972104",
      "name": "Peter Sattler"
    }
  ],
  "writer": [
    {
      "id": "nm0972104",
      "name": "Peter Sattler",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm4553019",
      "name": "Nawal Bengholam",
      "character": "Newscaster"
    },
    {
      "id": "nm1818216",
      "name": "Payman Maadi",
      "character": "Ali"
    },
    {
      "id": "nm1460812",
      "name": "Lane Garrison",
      "character": "Ransdell"
    },
    {
      "id": "nm1928515",
      "name": "Joseph Julian Soria",
      "character": "Rico"
    },
    {
      "id": "nm3542722",
      "name": "Marwan Naji",
      "character": "Detainee #1       (as Mark Naji)"
    },
    {
      "id": "nm5424765",
      "name": "Anoop Simon",
      "character": "Detainee #2"
    },
    {
      "id": "nm0829576",
      "name": "Kristen Stewart",
      "character": "Cole"
    },
    {
      "id": "nm5754425",
      "name": "Cory Michael Smith",
      "character": "Bergen"
    },
    {
      "id": "nm3843144",
      "name": "Ser'Darius Blain",
      "character": "Jackson"
    },
    {
      "id": "nm2849965",
      "name": "Tara Holt",
      "character": "Mary"
    },
    {
      "id": "nm2803536",
      "name": "LaDell Preston",
      "character": "IRF #1"
    },
    {
      "id": "nm2513187",
      "name": "Daniel Leavitt",
      "character": "IRF #2"
    },
    {
      "id": "nm0434879",
      "name": "Marco Khan",
      "character": "Mahmoud"
    },
    {
      "id": "nm0240564",
      "name": "Julia Duffy",
      "character": "Cole's Mother"
    },
    {
      "id": "nm4730243",
      "name": "Robert Tarpinian",
      "character": "Detainee #3"
    },
    {
      "id": "nm0002253",
      "name": "John Carroll Lynch",
      "character": "Colonel Drummond"
    },
    {
      "id": "nm1531180",
      "name": "Kyle Bornheimer",
      "character": "Night Shift C.O."
    },
    {
      "id": "nm0796325",
      "name": "Yousuf Azami",
      "character": "Ehan"
    },
    {
      "id": "nm3531193",
      "name": "Brandon Seider",
      "character": "New Guard       (as Brandon Lee Seider)"
    }
  ],
  "overview": "A young woman joins the military to be part of something bigger than herself and her small-town roots. Instead, she ends up as a new guard at Guantanamo Bay, where her mission is far from black and white. Surrounded by hostile jihadists and aggressive squadmates, she strikes up an unusual friendship with one of the detainees.",
  "storyline": "A young soldier escapes her suffocating small town by joining the military, only to find that she isn't going for a tour of duty in Iraq as she hoped. Instead, she's sent to Guantanamo. Met with hatred and abuse from the men in her charge, she forges an odd friendship with a young man who has been imprisoned at Gitmo for eight years.",
  "plot": "The film begins with the September 11 attacks shown on television when Ali Amir (Peyman Moaadi), a Tunisian living in Bremen, Germany arrives home and begins to perform salah when he is kidnapped and taken to Guantanamo Bay detention camp, specifically Camp Delta.\n\nEight years later, Army Private first-class Amy Cole (Kristen Stewart) is placed as a guard at Guantanamo. Upon arrival, she volunteers to the IRF and is cold towards the detainees, despite her contempt for the facility's handling of detainees. During her stay in the camp, Ali immediately notices Amy. Amy is annoyed by his questioning and ignores his advances, for which he angrily throws his feces at her one day. One night, Amy almost has sex with Corporal Randy Ransdell, who also takes an interest to Amy, but leaves after he is too aggressive.\n\nThe next day, Amy notices pamphlets to prevent suicide in Ali's cell while he is disciplined for his previous actions. She finds Ali's file and discovers that he has a history of self-harm and discipline, becoming more and more violent as time passed. She begins to interact more with Ali and a relationship forms.\n\nEight months later, Ransdell lies to Amy and orders her to watch Ali shower, violating SOP and Arabic social norms. Upon discovering that Ransdell lied, Amy files a report to her commanding officer, Colonel James Drummond. Drummond talks to Ransdell who makes (unspecified) counter-accusations and both enlisted must attend boards of inquiry (not shown nor later referred to). One night, near the end of Amy's tour at Guantanamo, Ali takes a blade hidden in his Quran and tries to commit suicide, but is talked down by Amy, who tells him her name and where she's from (violations of SOP). At this point, it is clear that her feelings towards the detainee have softened as she is distressed by the possibility of him dying. As Amy leaves Guantanamo teary-eyed, Ali discovers the Harry Potter book he had been hoping for over two years, finding she had written a note inside.",
  "synopsis": "Camp X-Ray centers on female soldier   (Kristen Stewart), who joins the military so that she can escape her suffocating small town. Although she hopes for a tour of duty in Iraq, she is instead shipped off to the outpost known as Guantanamo, a temporary detention facility at the Guantanamo Bay detention camp of Joint Task Force Guantanamo on the U.S. Naval Base in Guantánamo Bay, Cuba. Cole is met with hatred and abuse from the Muslim men in her charge, and finds herself forging an odd friendship with  (), who has been imprisoned at Gitmo for eight years. While serving her country to the best of her abilities at Bravo Block, she is also subject to the attempted affections of her superior officer, Sergeant Randy without any action or sympathy from Commanding Officer Colonel Drummond at Gitmo.\nA female soldier Cole is transferred to Camp Xray Gitmo base, Guantanamo Bay, Cuba. where the US government detains terror suspects, mainly from Arab countries. One day, detainee 471 Ali, who has been there eight years, tries to start a talk with Cole but her colleague denies him the time. The next time Cole gets suicide watch duty on 471s block B, again he talks to her. She keeps avoiding those talks due to the commanders advice to limit their interaction and that the guards shouldnt let the detainees get into their head. Ali tricks her into opening his cells mailbox door and then he slams feces on her. 471 gets the frequent flyer treatment as a punishment where the guards move him cell to cell every two hours, depriving him of sleep. Meanwhile, Cpl. Ransdell approaches Cole for an intimate relationship, but she denies him. On their next meet, after another argument, 471 apologizes to Cole for asking to much from her, and she tells him that the last Harry Potter book hes looking for isnt in the library. Eight months later, Ransdell assigns her to showers duty due to the other male soldiers are engaged on an incident in block D. It is very humiliating to 471 and forbidden in Islamic law. Later that night Coles friends tell her there was no incident in block D that day. Cole emails their captain about it. The captain dismisses Coles objection stating that Ransdell is her superior and that she must execute his commands. Soon Ransdell confronts her. Cole than retreats to being passive after she realizes that no one is supporting her. She gets reassigned to night shift. After some talk, 471 is kind of upset at Cole. Suddenly he reveals a hidden blade and threatens to kill himself as Cole finds out about it and tries to radio for back up.She opens up to him, as her means of keeping him from suicide. As she tells him her childhood memory of going to the zoo, she realizes that she instead has to let Ali choose. She then deliberately continue her watch, providing a window for Ali to commit suicide unchecked. She comes back and finds Ali sobbing and refrained from suicide. At last Coles retransfer time comes and she moves from the base. As a new male guard comes and offers books to Ali, Ali notices a big yellow book on the cart. He asks for it and finds that its the last Harry Potter book with a message from Cole."
}