{
  "imdb_id": "tt2901396",
  "tmdb_id": "375882",
  "douban_id": null,
  "title": "Orange People (2013)",
  "genres": [
    "Drama"
  ],
  "country": "Israel",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm0044384",
      "name": "Hanna Azoulay Hasfari"
    }
  ],
  "writer": [
    {
      "id": "nm0044384",
      "name": "Hanna Azoulay Hasfari",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0794784",
      "name": "Rita Shukrun",
      "character": "Zohara"
    },
    {
      "id": "nm0947685",
      "name": "Esti Yerushalmi",
      "character": "Simone"
    },
    {
      "id": "nm0044384",
      "name": "Hanna Azoulay Hasfari",
      "character": "Fanny"
    },
    {
      "id": "nm1840265",
      "name": "Yoram Toledano",
      "character": "Jackie"
    },
    {
      "id": "nm2275480",
      "name": "Meytal Gal",
      "character": "Zohar"
    },
    {
      "id": "nm0040531",
      "name": "Nataly Attiya",
      "character": "Nora Mantzur"
    },
    {
      "id": "nm2813201",
      "name": "Shimon Buskila",
      "character": "Mahlouf"
    },
    {
      "id": "nm1707813",
      "name": "Itamar Cohen",
      "character": "Guy"
    },
    {
      "id": "nm10109140",
      "name": "Daniela Halfon",
      "character": "Shiri"
    },
    {
      "id": "nm0539789",
      "name": "Sharon Malki-Shemesh",
      "character": "Hlmana"
    },
    {
      "id": "nm10109118",
      "name": "Zainab Mansour",
      "character": "Young Zohara"
    },
    {
      "id": "nm0590819",
      "name": "Shimon Mimran",
      "character": "Biology Teacher"
    },
    {
      "id": "nm3037600",
      "name": "Hani Peretz",
      "character": "Riki"
    },
    {
      "id": "nm2747731",
      "name": "Janet Sabag",
      "character": "Masuda"
    },
    {
      "id": "nm2509271",
      "name": "Pnina Tornai",
      "character": "Customer"
    },
    {
      "id": "nm1596798",
      "name": "Haim Zanati",
      "character": "Customer"
    }
  ],
  "overview": "Grandma Zohara occupies a special role within the Moroccan community within Israel. By cradling an object brought to her by her clients, Grandma Zohara gains access to the family's past through her dreams. This allows her to advise families on future decisions. Lately, however, Grandma Zohara is tiring and begins searching for someone to take over this role. She discovers that the only other person endowed with the power of dreaming is her daughter, Simone, who has different plans for her future. With support of Simone's sister, Fanny, who arrives unexpectedly from Paris, Simon gathers the strength to resist her mother's pressure and to pursue her own desire. Together the sisters wage battle for Simone's independence and creativity.",
  "storyline": "Grandma Zohara occupies a special role within the Moroccan community within Israel. By cradling an object brought to her by her clients, Grandma Zohara gains access to the family's past through her dreams. This allows her to advise families on future decisions. Lately, however, Grandma Zohara is tiring and begins searching for someone to take over this role. She discovers that the only other person endowed with the power of dreaming is her daughter, Simone, who has different plans for her future. With support of Simone's sister, Fanny, who arrives unexpectedly from Paris, Simon gathers the strength to resist her mother's pressure and to pursue her own desire. Together the sisters wage battle for Simone's independence and creativity.",
  "plot": "Set on the backdrop of Australia, the film opens with an angry Ram (Ram Charan), who just broke up with his girlfriend, narrating the story of his love life to a police officer, Abhishek Verma (Prakash Raj) as he defaces a graffiti of his lover while her father (Prabhu Ganesan) listens. Ram is introduced to be an youngster who loves graffiti and doesn’t believe in everlasting love. He has gone through 9 loves in his life, and thinks that love between two people eventually dies out. As a person with strong morals, he is honest and wants to love life and live with open mind, open thought and open action with his lover. Jaanu (Genelia D'Souza) studies in the same college as Ram. He falls in love with her at first sight and goes onto wooing her. She eventually ends up falling for him, but wants him to promise to love her forever. Ram, of course, nonchalantly dismisses this and explains how he cannot love her forever. This leads to a clash of their ideologies. Ram shows Jaanu how even true love stales after a while and true love cannot stay forever, while Jaanu shows him examples of everlasting love, like her friends and her parents. However he makes it clear that love between two people is never the same as it first is. Abhishek makes Ram tell him why he feels like this, and Ram explains another love in his life, Rooba (Shazahn Padamsee). He falls in love with her as she visits Hyderabad when Ram is on a foreign exchange project. He follows her to Mumbai and they both fall in love. However, as time passes, the couple faces problems and Ram feels himself lying more and more just to make Rooba happy. Unable to take it anymore, he tells her that he cannot continue loving her if he has to lie and sacrifice so much for her. They break up, and through the experience Ram becomes the man he is.",
  "synopsis": null
}