{
  "imdb_id": "tt2973506",
  "tmdb_id": "403599",
  "douban_id": null,
  "title": "Dolly Deadly (2016)",
  "genres": [
    "Comedy",
    "Drama",
    "Horror"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "82 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.7,
  "director": [
    {
      "id": "nm5035395",
      "name": "Heidi Moore"
    }
  ],
  "writer": [
    {
      "id": "nm5035395",
      "name": "Heidi Moore",
      "description": "co-writer"
    },
    {
      "id": "nm5035395",
      "name": "Heidi Moore",
      "description": "story"
    },
    {
      "id": "nm5035395",
      "name": "Heidi Moore",
      "description": null
    },
    {
      "id": "nm4143195",
      "name": "Cassandra Sechler",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm6265415",
      "name": "Justin Moore",
      "character": "Benji"
    },
    {
      "id": "nm6334459",
      "name": "Kimberly West-Carroll",
      "character": "Grandma Mitzi"
    },
    {
      "id": "nm0815352",
      "name": "Jay Sosnicki",
      "character": "Donald"
    },
    {
      "id": "nm5198286",
      "name": "Dana Nelson",
      "character": "Tina Lyn"
    },
    {
      "id": "nm5198082",
      "name": "Lawrence Moore",
      "character": "Kenny"
    },
    {
      "id": "nm6265391",
      "name": "Christopher Calvano",
      "character": "Homeless guy"
    },
    {
      "id": "nm6334460",
      "name": "Margaret Elysia Garcia",
      "character": "Client 1"
    },
    {
      "id": "nm4143195",
      "name": "Cassandra Sechler",
      "character": "Client 2"
    },
    {
      "id": "nm4180242",
      "name": "Bo! Campbell",
      "character": "Tom Okerlund"
    },
    {
      "id": "nm8091335",
      "name": "Paloma Couoh",
      "character": "Crystal"
    },
    {
      "id": "nm6296610",
      "name": "Donny Gonzalez",
      "character": "Rock Bottom"
    },
    {
      "id": "nm8398068",
      "name": "Joel Minden",
      "character": "News Anchor 1"
    },
    {
      "id": "nm5035395",
      "name": "Heidi Moore",
      "character": "Laundromat Girl"
    },
    {
      "id": "nm5807018",
      "name": "Gora Chand Saha",
      "character": "Tv Guy"
    },
    {
      "id": "nm8514089",
      "name": "Christopher Shafer",
      "character": "Dolly Krueger"
    },
    {
      "id": "nm8499310",
      "name": "Ryann Elizabeth Wright",
      "character": "Bunny Blogger"
    }
  ],
  "overview": "A young boy from the trailer park can't take another moment of ridicule from his family and peers. With support from his beloved dollies, he sets out for blood.",
  "storyline": "Dolly Deadly is a feature film of the psychological horror/revenge genre written by Heidi Moore and Cassandra Sechler. Heidi Moore, the director of Dolly Deadly, is a Chico based filmmaker who is well known for her short \"Boyfriend\" and work for Wretched productions. She came across the work of Cassandra Sechler, director of \"Wireboy\" and leader of Dreams For Dead Cats productions, and thought it would be fun to combine forces for a feature film. Though both have a distinct style, Heidi and Cassandra both love 70's and 80's horror films, trash & cult cinema, low budget filmmaking, and practical fx, so it comes as no surprise that a collaborative effort is in the works for them. Dolly Deadly is sure to be a little creepy, a bit silly, and a lot of fun (think Troma meets John Waters). The story of Dolly Deadly revolves around the warped psychology of a tormented young boy who can only relate to his doll collection, and the only relief from the pain in his life comes with slaughtering ...",
  "plot": null,
  "synopsis": "Dolly Deadly is a feature film of the psychological horror/revenge genre written by Heidi Moore and Cassandra Sechler.Heidi Moore, the director of Dolly Deadly, is a Chico based filmmaker who is well known for her short Boyfriend and work for Wretched productions. She came across the work of Cassandra Sechler, director of Wireboy and leader of Dreams For Dead Cats productions, and thought it would be fun to combine forces for a feature film.Though both have a distinct style, Heidi and Cassandra both love 70s and 80s horror films, trash & cult cinema, low budget filmmaking, and practical fx, so it comes as no surprise that a collaborative effort is in the works for them.Dolly Deadly is sure to be a little creepy, a bit silly, and a lot of fun (think Troma meets John Waters).The story of Dolly Deadly revolves around the warped psychology of a tormented young boy who can only relate to his doll collection, and the only relief from the pain in his life comes with slaughtering those he has learned to hate the most. Everyone in his trailer park!The film is to be a whirlwind of vengeful deaths, elaborate dream sequences, and crazy characters. In the production, there will not be any cgi, so all effects will involve handmade prosthetics and blood for all of the head wounds, chainsaw deaths, jaw cracking action, skinned faces, spurting blood, stab wounds, rotting corpse makeup, fire stunts, and explosions! For one dream sequence claymation and puppetry will be used! Thats right, old school effects!"
}