{
  "imdb_id": "tt2911674",
  "tmdb_id": "341077",
  "douban_id": null,
  "title": "Tiger House (2015)",
  "genres": [
    "Action",
    "Crime",
    "Drama",
    "Thriller"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "80 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.1,
  "director": [
    {
      "id": "nm3552673",
      "name": "Thomas Daley"
    }
  ],
  "writer": [
    {
      "id": "nm2954322",
      "name": "Simon Lewis",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm2546012",
      "name": "Kaya Scodelario",
      "character": "Kelly"
    },
    {
      "id": "nm4534098",
      "name": "Ed Skrein",
      "character": "Callum"
    },
    {
      "id": "nm0779084",
      "name": "Dougray Scott",
      "character": "Shane"
    },
    {
      "id": "nm4511908",
      "name": "Daniel Boyd",
      "character": "Mark"
    },
    {
      "id": "nm2466222",
      "name": "Julie Summers",
      "character": "Lynn"
    },
    {
      "id": "nm0456810",
      "name": "Langley Kirkwood",
      "character": "Sveta"
    },
    {
      "id": "nm1409827",
      "name": "Brandon Auret",
      "character": "Reg"
    },
    {
      "id": "nm0107555",
      "name": "Andrew Brent",
      "character": "Doug"
    },
    {
      "id": "nm0198044",
      "name": "Nicholas Dallas",
      "character": "Ferdinand"
    },
    {
      "id": "nm8104034",
      "name": "Nicholas Fortuin",
      "character": "CCTV Robber"
    },
    {
      "id": "nm8104035",
      "name": "Luc Ramsden",
      "character": "CCTV Robber"
    },
    {
      "id": "nm8104036",
      "name": "Manoli Kalligiannis",
      "character": "CCTV Robber"
    }
  ],
  "overview": "A young gymnast battles a group of bank robbers at the home of her boyfriend.",
  "storyline": "Kelly sneaks into her boyfriend's house but tonight, she's not the only unwelcome visitor. Now, she must draw on her reserves of strength and skills of dexterity to escape. As the situation spirals out of control, the suburban house becomes a terrifying arena for violence.",
  "plot": "Mark, who comes from a well-off family, meets his gymnast girlfriend Kelly after school. She becomes uncomfortable when he shows her a crossbow that he has brought along with her. While demonstrating it, he accidentally shoots her in the leg. An unspecified time later, Kelly sneaks into Mark's house through his second-story window and confront him on why he has not contacted her lately. Mark reveals that his parents have grounded him and taken away his mobile phone after finding a condom and drugs among his possessions. Lynn, Mark's mother, interrupts them. As Kelly hides, she overhears Lynn insult her, calling her low class and unworthy of Mark.\n\nAfter Lynn leaves, Kelly tells Mark she is pregnant. Upset, Mark complains his life plans could be ruined. Before they can discuss it further, Mark hears a loud thump. Unknown to Mark, home invaders have killed his dog and taken his parents hostage. He leaves his room to investigate, and Kelly hears further noises. Panicking, she hides under Mark's bed. The bedroom door bursts open, and robbers Shane, Callum, Sveta, and Reg enter. Shane has a glass shard embedded in his side, and they set him down on the bed. He instructs the others to stick to their plan: Reg and Sveta are to take Mark's father, Doug, to his bank and rob it while Callum and Shane watch the hostages.\n\nAs Callum researches how to make a tourniquet on Mark's computer, Kelly desperately reaches for a cell phone, only to find its battery is dead. Mark becomes excited when he learns Lynn is a doctor, and he temporarily frees her so she can look at Shane. Suspicious Mark may have invited her over, Lynn intentionally drops an item so she can glance under the bed. After stabilizing Shane, she is taken back to her bedroom and tied up with Mark. As Callum is distracted and Shane rests, Kelly escapes the bedroom. She sneaks around the house barefoot and manages to avoid getting caught. She is about to leave the house when Ferdinand, a man with whom Lynn is having an affair arrives. When Ferdinand sees Callum's unmasked face, Callum kills him.\n\nAs Callum menaces Mark and Lynn, Kelly sneaks up on him and stabs him with a scissors. Callum chases her back the bedroom, and she flees to the attack, stacking heavy objects on the trapdoor. In the attack, Kelly finds Mark's crossbow, though it is not loaded. As Callum enters the attic, she slips by him and traps him there. Shane stops her with a pistol. He confesses to her that he knows he is dying and has become scared. After they have a tense conversation, in which he learns about Ferdinand's murder, Shane allows Kelly to go. She frees Mark and Lynn, and they race downstairs. Mark and Lynn and immediately recaptured by Reg and Sveta, who have return from the successful heist.\n\nReg and Sveta free Callum. After grabbing a bolt, Kelly returns to the attic and retrieves the crossbow. When Reg refuses to kill the hostages, Callum takes his shotgun and says he will do it himself. As Callum leaves to look for her, Kelly shoots Reg with the crossbow, killing him, though he starts a fire before he dies. As the house burns, jumps out a window and surprises Sveta, killing him with the same bolt used to kill Reg. Kelly puts on Sveta's mask, tricking Callum into believing he needs assistance. Before she can kill him, Doug knocks her unconscious. As Callum prepares to kill Kelly, Shane recovers long enough to shoot and kill him.\n\nDoug says he only wanted to escape his unhappy marriage and retire wealthy. Blaming him for the entire ordeal, Lynn shoots and kills him with a Reg's shotgun. With all the robbers dead, Mark, Kelly, and Lynn leave the burning house. As Mark helps Kelly load up her car with the stolen money, he offers to leave with her. Kelly stops him, telling him that he has his whole life ahead of him. Mark and Lynn practice their story, in which they say Kelly was never there and infighting caused the deaths of the robbers, and Kelly drives off.",
  "synopsis": null
}