{
  "imdb_id": "tt2937696",
  "tmdb_id": "295699",
  "douban_id": null,
  "title": "Everybody Wants Some!! (2016)",
  "genres": [
    "Comedy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "117 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm0000500",
      "name": "Richard Linklater"
    }
  ],
  "writer": [
    {
      "id": "nm0000500",
      "name": "Richard Linklater",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm4296357",
      "name": "Blake Jenner",
      "character": "Jake"
    },
    {
      "id": "nm5319167",
      "name": "Juston Street",
      "character": "Jay"
    },
    {
      "id": "nm4554428",
      "name": "Ryan Guzman",
      "character": "Roper"
    },
    {
      "id": "nm0388382",
      "name": "Tyler Hoechlin",
      "character": "McReynolds"
    },
    {
      "id": "nm0751518",
      "name": "Wyatt Russell",
      "character": "Willoughby"
    },
    {
      "id": "nm1412974",
      "name": "Glen Powell",
      "character": "Finnegan"
    },
    {
      "id": "nm6792155",
      "name": "Temple Baker",
      "character": "Plummer"
    },
    {
      "id": "nm7604558",
      "name": "J. Quinton Johnson",
      "character": "Dale"
    },
    {
      "id": "nm4311291",
      "name": "Will Brittain",
      "character": "Beuter"
    },
    {
      "id": "nm6857017",
      "name": "Courtney Tailor",
      "character": "Sorority Girl #1"
    },
    {
      "id": "nm4139368",
      "name": "Taylor Murphy",
      "character": "Sorority Girl #2"
    },
    {
      "id": "nm2964950",
      "name": "Christina Burdette",
      "character": "Cute Coed #1"
    },
    {
      "id": "nm3614913",
      "name": "Zoey Deutch",
      "character": "Beverly"
    },
    {
      "id": "nm1496115",
      "name": "Sophia Ali",
      "character": "Beverly's Roommate"
    },
    {
      "id": "nm3994184",
      "name": "Austin Amelio",
      "character": "Nesbit"
    },
    {
      "id": "nm6640814",
      "name": "Tanner Kalina",
      "character": "Brumley"
    },
    {
      "id": "nm5642571",
      "name": "Forrest Vickery",
      "character": "Coma"
    },
    {
      "id": "nm0106534",
      "name": "Jonathan Breck",
      "character": "Coach Gordan"
    },
    {
      "id": "nm3666990",
      "name": "Ernest James",
      "character": "Sound Machine Doorman"
    },
    {
      "id": "nm0509523",
      "name": "Jason Liebrecht",
      "character": "Sound Machine Manager       (as E. Jason Liebrecht)"
    },
    {
      "id": "nm5734182",
      "name": "Justin Alexio",
      "character": "Sound Machine Bartender"
    },
    {
      "id": "nm5679932",
      "name": "Celina Chapin",
      "character": "Angie"
    },
    {
      "id": "nm4169010",
      "name": "Shailaun Manning",
      "character": "Elaine       (as Shailaundra Manning)"
    },
    {
      "id": "nm7055113",
      "name": "Lynden Orr",
      "character": "Suzi"
    },
    {
      "id": "nm5505742",
      "name": "Laura Ritz",
      "character": "McReynolds' Girl"
    },
    {
      "id": "nm5943527",
      "name": "Zoey Brooks",
      "character": "Cathy"
    },
    {
      "id": "nm3764562",
      "name": "Asjha Cooper",
      "character": "Sharon"
    },
    {
      "id": "nm6402656",
      "name": "Olivia Jordan",
      "character": "Leeann       (as Olivia Griswald)"
    },
    {
      "id": "nm2267725",
      "name": "Dora Madison",
      "character": "Val"
    },
    {
      "id": "nm7064000",
      "name": "Anna Vanston",
      "character": "Michelle"
    },
    {
      "id": "nm6908744",
      "name": "Tess Cline",
      "character": "Country Girl #1"
    },
    {
      "id": "nm2395048",
      "name": "Adriene Mishler",
      "character": "Country Girl #2"
    },
    {
      "id": "nm3188275",
      "name": "Beau Smith",
      "character": "Guaranteed Wholesome DJ"
    },
    {
      "id": "nm1923788",
      "name": "Michael Monsour",
      "character": "Justin"
    },
    {
      "id": "nm4571670",
      "name": "Mike Wiebe",
      "character": "Punk Band Member #1"
    },
    {
      "id": "nm8033910",
      "name": "Fadi El-Assad",
      "character": "Punk Band Member #2"
    },
    {
      "id": "nm8033911",
      "name": "Ian Walling",
      "character": "Punk Band Member #3"
    },
    {
      "id": "nm4083366",
      "name": "Robert Marchant",
      "character": "Punk Band Member #4"
    },
    {
      "id": "nm2411386",
      "name": "Ian MacDougall",
      "character": "Punk Band Member #5"
    },
    {
      "id": "nm6080909",
      "name": "Jenna Saab",
      "character": "Mud Wrestling Champ       (as Jenna Marie Saab)"
    },
    {
      "id": "nm5012206",
      "name": "Lauren Hale",
      "character": "Mud Wrestling Opponent"
    },
    {
      "id": "nm5246329",
      "name": "Kay Epperson",
      "character": "Wigwam Server"
    },
    {
      "id": "nm3485724",
      "name": "Tory Taranova",
      "character": "Debra Kadabra"
    },
    {
      "id": "nm3878243",
      "name": "Jessi Mechler",
      "character": "Astrology Girl"
    },
    {
      "id": "nm8033912",
      "name": "Katharine Sutton",
      "character": "Oz Party Girl       (as Katherine Sutton)"
    },
    {
      "id": "nm7043401",
      "name": "Blaire Clause",
      "character": "Oz Party Girl #2"
    },
    {
      "id": "nm4035989",
      "name": "Devin Bonnée",
      "character": "The Mad Hatter       (as Devine Bonnee)"
    },
    {
      "id": "nm4763704",
      "name": "Kaleb King",
      "character": "The Queen of Hearts"
    },
    {
      "id": "nm8033913",
      "name": "Charlie",
      "character": "Cat in Refridgerator"
    }
  ],
  "overview": "A comedy that follows a group of friends as they navigate their way through the freedoms and responsibilities of unsupervised adulthood.",
  "storyline": "In Texas in the fall of 1980, college freshman Jake Bradford, a hotshot pitcher in high school, moves into an off-campus house with other members of the college baseball team. He meets several teammates, including his roommate Billy, who has been nicknamed \"Beuter\" because of his Deep Southern accent. He joins Finnegan, Roper, Dale, and Plummer cruising the campus by car, looking for women..",
  "plot": "In Texas in the fall of 1980, college freshman Jake (Blake Jenner) – a hotshot pitcher in high school – moves into the house he will be sharing with other members of the fictional Southeast Texas Cherokees college baseball team, and meets several of his new teammates, including his roommate Billy (Will Brittain) who has been nicknamed \"Beuter\" because of his White Southern accent. He joins Finnegan (Glen Powell), Roper (Ryan Guzman), Dale (Quinton Johnson), and Plummer (Temple Baker) cruising the campus by car, looking to meet female students. Stopping to chat with two women moving into their apartment, upperclassmen Roper – an unapologetic hound-dog – and Finnegan – adopting a false feminist tone – both \"strike out\" with them, but one of them – Beverly (Zoey Deutch) – comments that she likes Jake (\"the quiet guy in the back seat\"); he makes a note of her apartment number.\n\nAt a team meeting at the house, the baseball coach introduces the new players, which include Jake, Plummer, Beuter, Brumley (Tanner Kalina) – all freshmen – and two transfer students: Jay (Juston Street), recruited for his professional-level pitching, and Willoughby (Wyatt Russell), a bearded philosopher-stoner. The coach cites two rules: no alcohol in the house, and no women upstairs, but the team disregards them, later hosting a drunken party, with several team members taking women up to their bedrooms. Jake tries to take a woman he's met to the downstairs room they'd set aside for sex, but it's occupied, and Beuter refuses to leave their room so Jake can't use it. The next morning, Beuter leaves temporarily for home, concerned that his girlfriend is pregnant.\n\nLater, the team go out drinking and \"cruising chicks\" together, first to the local disco. Finnegan's patter about his \"average penis\", intended to impress women with his lack of ego, is interrupted when Jay's arrogant and racist remarks provoke a fist fight with one of the bartenders, and they are all ejected. Sending Jay home, they change their clothes and instead go to a western-themed bar to end their night on a high note. The next day, at the house, Willoughby shares his marijuana, music, and philosophy with the freshmen, professing his love for Pink Floyd while stating his extreme distaste for Van Halen. That afternoon while walking around with several of his teammates, Jake happens upon Justin (Michael Monsour), a former teammate from high school who has embraced punk subculture. He invites them to a punk concert, and with Jake's encouragement they go, briefly putting on yet another identity. Jake leaves flowers and a note on Beverly's apartment door that night before he and the rest of the team have a massive frat party at their house.\n\nThe next morning, Beverly calls him and they quickly agree to meet. She explains that she's a performing-arts major; Jake answers only that he's a baseball player, based on advice given to him by Finnegan. At the team's first unofficial practice session, Jay upsets the rest of the team by pitching to them aggressively. McReynolds (Tyler Hoechlin), the team's captain and best player, puts Jay in his place when he hits a home run off of him, which causes Jay to throw a tantrum. The coach unexpectedly shows up and calls Willoughby off the pitcher's mound. It is later revealed that Willoughby is 30 years old, and has been fraudulently transferring to new colleges so he can continue playing ball and enjoying the student lifestyle.\n\nBeverly invites him to come to \"Oz\", a costume party thrown by performing-arts students every Fall. Jake mentions the party to his teammates and tries to tell them they wouldn't enjoy it, but they cajole him into taking them. Although they initially don't fit in well with the \"artsy\" atmosphere and activities, they do their best to hit on the women there and eventually warm up to their surroundings. Finnegan is ridiculed by his friends for adapting his patter to pretend to be into astrology, and Jake takes part in an improvised Alice in Wonderland-themed take on The Dating Game. Jake continues to get close to Beverly and they end up spending the rest of the night together.\n\nThe next morning the semester begins, and Jake and Beverly walk together from her apartment, parting to go to their separate classes. Two of the team – who know that Jake didn't return home the night before – razz him for it. He runs into Plummer in his classroom, and they settle in for their first lecture. Their history professor enters and writes the phrase \"Frontiers are where you find them\" on the chalkboard. As their first ever college class officially begins, Plummer and Jake fall asleep.",
  "synopsis": "Thursday, August 28, 1980Jake Bradford (Blake Jenner) arrives at his college three days before the start of classes. He enters the baseball house to the members of the team. He first meets McReynolds (Tyler Hoechlin) and Roper (Ryan Guzman), who both razz Jake for being a pitcher. He goes upstairs and meets Jay (Juston Street), Finnegan (Glen Powell), stoner Willoughby (Wyatt Russell), Dale (J. Quinton Johnson), fellow freshman Plummer (Temple Baker), and his roommate Billy, aka Beuter (Will Brittain). He's called that by the other guys to have the most \"country bumpkin\" name they could think of.Jake joins McReynolds, Plum, Finn, and Dale as they go around campus inviting girls to a party at their house. The guys drive by a girl named Beverly (Zoey Deutch) and her roommate (Sophia Taylor Ali). Although neither are taken by the guys' attempts to hit on them, Beverly comments that she likes \"the quiet one in the back\" (Jake).The guys then go to the nearby bar, The Fox, where they meet other players on the team, Nesbit (Austin Amelio), Brumley (Tanner Kalina), and Coma (Forrest Vickery). They all drink and exchange banter.The team meets with the coach to discuss the rules of the house. That is mainly no drinking and no girls allowed in the rooms, which all the guys find lame.The guys go out to the nightclub 'Sound Machine' and dance with some girls. Dale points out that Finn has a move where he tells girls that he has an average penis size to seem humble, as opposed to guys that love to brag about their size. They end up taking the girls back to the house for a party. McReynolds, Roper, Jay, and Finn all go to their rooms to hook up with girls. Jake wants to bring his girl up to his room, but Beuter and his buddies don't wanna leave, so Jake takes her to his car.On Friday morning, Beuter heads back home for a couple of days because he worries his girlfriend might be pregnant. Later, the guys hang out around town, such as at the arcade where Jake shows Dale the trick to winning at Space Invaders, which is to get the aliens when they reach the last row since they won't shoot at the player.The guys go back to Sound Machine that night, but they're forced to leave when Jay gets drunk and rowdy, attempting to pick a fight with a bartender. The team heads to a country music club without Jay, for fear that he'll scare away the ladies. At the country club, Jake feels out of place, but Willoughby tells him that he has to embrace his inner weirdness, and not be the person that the others want him to be.Come Saturday, Jake joins Willoughby, Dale, and Plum in Willoughby's room as they take hits from his bong and discuss \"The Twilight Zone\" and Van Halen, among other things. They try some \"telepathic stuff\", with the guys trying to guess what Willoughby is thinking of.Jake plays ping-pong with McReynolds with some of the other guys watching. Jake beats McReynolds, who gets angry and chucks his paddle at the wall, breaking it. The other guys start to chant Jake's name.Jake, Plum, Finn, and Brumley walk around the neighborhood and run into Jake's high school buddy Justin (Michael Monsour). He invites the guys inside his home for some beers, and he later brings them to a punk rock club where the guys watch Justin's band play a punk rock version of the \"Gilligan's Island\" theme song.The guys throw another party at the house that night, wherein some girls participate in a mud-wrestling event, with Finn joining in and getting slammed into the mud by one of the girls. Meanwhile, Jake leaves some flowers and a note on Beverly's door.On Sunday morning, Jake receives a phone call from Beverly, and the two are now properly acquainted. She is surprised to learn that he is on the baseball team, as she originally believed that athletes were dumb, but she sees him differently. The two arrange a meeting for that day. Jake takes Beverly out for ice cream, and he learns that she is studying performing arts and has experience at an acting school.In the afternoon, the team gathers for baseball practice. Jay once again goes overboard with his behavior, such as throwing the ball into the parking lot and just acting like a jerk toward the other guys. After practice, the older teammates tape Jake, Plum, Brumley, and Nesbit to the wall as a freshman hazing ritual where they throw baseballs at the guys, one of which hits Plum in the nuts. After that, the team heads down to the lake for a swim.The guys go to the cafeteria for some grub. Dale comments to the freshmen that the older guys like McReynolds and Roper don't really care about the freshman and would love to see them fail. Plum and Nesbit then come in to tell the guys that Willoughby got kicked out of school after it was learned that he is really a 30-year-old guy that frequently transfers to different colleges to play baseball, and that his name isn't even Willoughby. The only thing they found in his room was a Pink Floyd album with a big joint on top of it (which Plum and Nesbit smoked). The guys figure that \"Willoughby\" was just a guy that didn't have what it took to go pro, but loved baseball so much that he wanted to play however he could.That night, the guys go to a party at another house, which happens to be a costume party. Jake finds Beverly dressed as Alice (in Wonderland). Finn tries his \"average penis\" bit on one girl but gets cock-blocked by the other guys. Later, the guys watch Beverly act out a \"Dating Game\" improv show as Alice, with two other guys as The Mad Hatter and The Queen of Hearts. Jake steps in as The Cheshire Cat. Afterward, he and Beverly hang out into the early hours of Monday by the lake and have their first kiss.As classes are about to begin, Jake sleeps in Beverly's room for a bit as she gets ready. They walk to their classes together before separating and kissing again. Dale and Finn see this and tease him. Jake then heads to his first class and sits next to Plum. The two are confident about what college will bring them. As class starts, Jake puts his head down on his desk to sleep and he smiles."
}