{
  "imdb_id": "tt2948652",
  "tmdb_id": "292512",
  "douban_id": null,
  "title": "Wayward: The Prodigal Son (2014)",
  "genres": [
    "Action",
    "Drama",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "93 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.4,
  "director": [
    {
      "id": "nm1070766",
      "name": "Rob Diamond"
    }
  ],
  "writer": [
    {
      "id": "nm1070766",
      "name": "Rob Diamond",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm5700979",
      "name": "Landon Henneman",
      "character": "Tyler McMillan"
    },
    {
      "id": "nm5100354",
      "name": "Blake Webb",
      "character": "Will McMillan"
    },
    {
      "id": "nm1070766",
      "name": "Rob Diamond",
      "character": "Robert McMillan"
    },
    {
      "id": "nm3025366",
      "name": "Pam Eichner",
      "character": "Madeline McMillan"
    },
    {
      "id": "nm1937888",
      "name": "Kristen Marie Jensen",
      "character": "Meg McMillan"
    },
    {
      "id": "nm5699440",
      "name": "Crystal Harris",
      "character": "Annabelle       (as Crystal Udy)"
    },
    {
      "id": "nm1912811",
      "name": "Mark Webb",
      "character": "Frank"
    },
    {
      "id": "nm3705478",
      "name": "Keith Hottinger",
      "character": "Sebastian"
    },
    {
      "id": "nm2255417",
      "name": "Patrick Bogdanich",
      "character": "Jerry"
    },
    {
      "id": "nm3977371",
      "name": "Keith Phelps",
      "character": "Skully"
    },
    {
      "id": "nm1651213",
      "name": "Walter Platz",
      "character": "Farley"
    },
    {
      "id": "nm5699503",
      "name": "Shawn Fludd",
      "character": "Rodeo"
    },
    {
      "id": "nm2482481",
      "name": "James C. Morris",
      "character": "Shady"
    },
    {
      "id": "nm3745953",
      "name": "Steven Simmons",
      "character": "Dr. Johnson"
    },
    {
      "id": "nm5722432",
      "name": "Marco Avalos",
      "character": "Malcolm"
    },
    {
      "id": "nm5701111",
      "name": "Janelle Rush",
      "character": "Hot Girl #1"
    },
    {
      "id": "nm4677422",
      "name": "Scott Smith",
      "character": "Chaz"
    },
    {
      "id": "nm4551878",
      "name": "Travis Fannin",
      "character": "Stank"
    },
    {
      "id": "nm5102425",
      "name": "Jamielee Eldridge",
      "character": "Amy"
    },
    {
      "id": "nm4216681",
      "name": "Dustin Miller",
      "character": "Nickolas"
    },
    {
      "id": "nm5416081",
      "name": "David Webb",
      "character": "Bouncer"
    },
    {
      "id": "nm2150828",
      "name": "Cal Nguyen",
      "character": "Terrance"
    },
    {
      "id": "nm5696137",
      "name": "Todd Noker",
      "character": "Johnny 7"
    },
    {
      "id": "nm3280028",
      "name": "Marlys Miller-Fladeland",
      "character": "Miss Mable       (as Marlys Fladeland)"
    },
    {
      "id": "nm3628313",
      "name": "Sandra Stevens",
      "character": "Wilma"
    },
    {
      "id": "nm5654272",
      "name": "Boofy Noker",
      "character": "Blondie"
    },
    {
      "id": "nm2466990",
      "name": "Loren Lambert",
      "character": "Mr. Smitts"
    },
    {
      "id": "nm5654075",
      "name": "Meesh Kelby",
      "character": "Betty 6"
    },
    {
      "id": "nm3679176",
      "name": "David Layne",
      "character": "Casino Doctor"
    },
    {
      "id": "nm5707660",
      "name": "Elric Birchette",
      "character": "Sam The Bartender"
    },
    {
      "id": "nm1405328",
      "name": "Pat Donahue",
      "character": "Flanigan"
    },
    {
      "id": "nm5708546",
      "name": "Jenny Evans",
      "character": "Hot Girl #2"
    },
    {
      "id": "nm6242618",
      "name": "Robert Gudgell",
      "character": "Suit #1"
    },
    {
      "id": "nm5427222",
      "name": "Warren Helbach",
      "character": "Preacher"
    },
    {
      "id": "nm5272690",
      "name": "Brogan Kelby",
      "character": "Rock Star"
    },
    {
      "id": "nm6127948",
      "name": "Alexa Lawrence",
      "character": "Hot Girl #3"
    },
    {
      "id": "nm6127949",
      "name": "Bill Lawrence",
      "character": "Delivery Doctor"
    },
    {
      "id": "nm6242619",
      "name": "David McKinney",
      "character": "Suit #2"
    },
    {
      "id": "nm6402228",
      "name": "Joshua Provost",
      "character": "Agent 5"
    },
    {
      "id": "nm6186945",
      "name": "Maggie Smith",
      "character": "Baby"
    },
    {
      "id": "nm5416024",
      "name": "Victor Soto",
      "character": "Agent 3"
    },
    {
      "id": "nm6402227",
      "name": "Lynn Swenson",
      "character": "Agent 4"
    },
    {
      "id": "nm6402226",
      "name": "Mark Viau",
      "character": "Agent 2"
    },
    {
      "id": "nm6127936",
      "name": "Parker Webb",
      "character": "Agent 1"
    },
    {
      "id": "nm6127950",
      "name": "Brenda Woodhouse",
      "character": "Delivery Nurse"
    }
  ],
  "overview": "Prone to wander, Tyler McMillan has it all but doesn't appreciate living in the shadow of his over-achieving brother. With an early inheritance in hand from his trusting father, Tyler heads to Vegas indulging in gambling, parties and riotous living. His addictions lead him into a den of thieves and the prospect of losing everything, including his own life.His father's only wish is that Tyler will return safely home. Can a child stray so far, a father's love can't save him?",
  "storyline": "Prone to wander, Tyler McMillan gets it all. Indulgence, waste, and rebellion lead Tyler into a den of thieves and the prospect of losing everything, including his life. Tyler's father tries to keep tabs on Tyler while concealing his own battle with cancer. With the help of a woman with her own checkered past, Tyler gets back on his feet. Fatherly love, repentance and mercy combine to save Tyler's life even if they cannot save the life of his father.",
  "plot": "Leung Chang (Yuen Biao) is a young man in a wealthy family living in Foshan in the mid-19th century. He is a martial artist trained by two instructors in his father's employ. He has fought over three hundred times in Foshan and won every fight, but unbeknownst to him, his father has arranged for his servant Yee Tung-choi (Chan Lung) to bribe Chang's opponents to lose to him in order to protect him. This has caused Chang to believe that he is a world-class fighter, but in truth he hasn't even mastered the basics of kung fu and any real fighter could easily defeat him. Everyone knows this but him, giving him the nickname \"The Prodigal Son\" behind his back, because of the money he is costing his parents who pay to keep him from getting injured.\n\nOne night, three of Chang's friends attend a performance by the Lok Fung Lin Chinese Opera troupe. One of Chang's friends is attracted to the lead actress and asks her out on a date after the performance. She refuses, but he insists and even harasses her. She reveals herself to be a man, Leung Yee-tai (Lam Ching-ying), a master of Wing Chun. He beats up and humiliates Chang's friends. Chang challenges Yee-tai to a fight to avenge the insults to his friends. As usual, Yee Tung-choi tries to bribe Yee-tai to lose, but Yee-tai refuses, easily defeats Chang, and reveals the truth about his martial arts ineptitude to him.\n\nChang, desiring to learn real kung fu, asks Yee-tai to teach him Wing Chun. Yee-tai refuses because he thinks Chang would probably misuse it, but Chang has his father buy the Lok Fung Lin troupe and gives himself a job as Yee-tai's personal assistant, insisting on following Yee-tai everywhere until Yee-tai agrees to teach him Wing Chun. This continues for six months. The Lok Fung Lin troupe travels to Canton. There, Yee-tai's Wing Chun skills are witnessed by Lord Ngai Fei (Frankie Chan), the son of a Manchu duke, who is also a martial arts master and is hunting for a worthy opponent.\n\nNgai forces Yee-tai to fight him. Ngai and Yee-tai are evenly matched until Yee-tai has an asthma attack. Ngai stops the fight and postpones it until Yee-tai is healthy and fit for it. It is revealed that Ngai is also a \"prodigal son\"; unbeknownst to him, his father has ordered his bodyguards to protect him from anyone who might beat him in a fight. However, their methods are more ruthless and brutal than the bribery employed by Chang's parents; they resort to assassination.\n\nDuring the night, Ngai's bodyguards and a team of assassins infiltrate the Lok Fung Lin theater, massacre the troupe, and burn down the theater. Yee-tai is having trouble sleeping because of his asthma, and he sees light reflected off an assassin's blade through his eyelids and reacts in time to escape along with Chang. The assassins think they died in the fire, as does everyone else. Yee-tai takes Chang to the home of his martial brother Wong Wah-bo (Sammo Hung). With Wah-bo's help, Chang finally convinces Yee-tai to teach him Wing Chun. Chang trains under both Yee-tai and Wah-bo; Yee-tai trains him in Wing Chun and Wah-bo trains him in freestyle fighting.\n\nOver time, Chang achieves proficiency in martial arts, but Yee-tai's asthma is worsening. Chang takes Yee-tai back to Foshan to see a doctor. There, Ngai learns that Yee-tai is still alive, and he visits him. Yee-tai reveals that Ngai's bodyguards have been assassinating everyone who might beat Ngai. The bodyguards murder Yee-tai. Ngai, horrified, has his bodyguards executed. Chang challenges Ngai to a fight. Using everything that Yee-tai and Wah-bo taught him, he manages to beat Ngai.",
  "synopsis": null
}