{
  "imdb_id": "tt2911666",
  "tmdb_id": "245891",
  "douban_id": "25798131",
  "title": "John Wick (2014)",
  "genres": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "country": "China",
  "version": [
    {
      "runtime": "101 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm0821432",
      "name": "Chad Stahelski"
    },
    {
      "id": "nm0500610",
      "name": "David Leitch"
    }
  ],
  "writer": [
    {
      "id": "nm4401003",
      "name": "Derek Kolstad",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0000206",
      "name": "Keanu Reeves",
      "character": "John Wick"
    },
    {
      "id": "nm0638824",
      "name": "Michael Nyqvist",
      "character": "Viggo Tarasov"
    },
    {
      "id": "nm0654295",
      "name": "Alfie Allen",
      "character": "Iosef Tarasov"
    },
    {
      "id": "nm0000353",
      "name": "Willem Dafoe",
      "character": "Marcus"
    },
    {
      "id": "nm0935921",
      "name": "Dean Winters",
      "character": "Avi"
    },
    {
      "id": "nm1597316",
      "name": "Adrianne Palicki",
      "character": "Ms. Perkins"
    },
    {
      "id": "nm0055455",
      "name": "Omer Barnea",
      "character": "Gregori"
    },
    {
      "id": "nm2584861",
      "name": "Toby Leonard Moore",
      "character": "Victor"
    },
    {
      "id": "nm0076780",
      "name": "Daniel Bernhardt",
      "character": "Kirill"
    },
    {
      "id": "nm0005256",
      "name": "Bridget Moynahan",
      "character": "Helen"
    },
    {
      "id": "nm0000491",
      "name": "John Leguizamo",
      "character": "Aurelio"
    },
    {
      "id": "nm0574534",
      "name": "Ian McShane",
      "character": "Winston"
    },
    {
      "id": "nm2125623",
      "name": "Bridget Regan",
      "character": "Addy"
    },
    {
      "id": "nm0714698",
      "name": "Lance Reddick",
      "character": "Hotel Manager"
    },
    {
      "id": "nm2077124",
      "name": "Keith Jardine",
      "character": "Kuzma"
    },
    {
      "id": "nm1324884",
      "name": "Tait Fletcher",
      "character": "Nicholai"
    },
    {
      "id": "nm3522652",
      "name": "Kazy Tauginas",
      "character": "Ivan       (as Kazimieras Tauginas)"
    },
    {
      "id": "nm6223216",
      "name": "Alexander Frekey",
      "character": "Alexander"
    },
    {
      "id": "nm0755603",
      "name": "Thomas Sadoski",
      "character": "Jimmy"
    },
    {
      "id": "nm0453641",
      "name": "Randall Duk Kim",
      "character": "Continental Doctor"
    },
    {
      "id": "nm0446314",
      "name": "David Patrick Kelly",
      "character": "Charlie"
    },
    {
      "id": "nm0676370",
      "name": "Clarke Peters",
      "character": "Harry"
    },
    {
      "id": "nm0621760",
      "name": "Kevin Nash",
      "character": "Francis"
    },
    {
      "id": "nm1347813",
      "name": "Gameela Wright",
      "character": "Delivery Woman"
    },
    {
      "id": "nm3964311",
      "name": "Vladislav Koulikov",
      "character": "Pavel"
    },
    {
      "id": "nm1627707",
      "name": "Munro M. Bonnell",
      "character": "Priest"
    },
    {
      "id": "nm4779905",
      "name": "Patricia Squire",
      "character": "Elderly Woman       (as Pat Squire)"
    },
    {
      "id": "nm3964463",
      "name": "Vladimir Troitsky",
      "character": "Team Leader"
    }
  ],
  "overview": "After the sudden death of his beloved wife, John Wick receives one last gift from her, a beagle puppy named Daisy, and a note imploring him not to forget how to love. But John's mourning is interrupted when his 1969 Boss Mustang catches the eye of sadistic thug Iosef Tarasov who breaks into his house and steals it, beating John unconscious in the process. Unwittingly, he has just reawakened one of the most brutal assassins the underworld has ever known.",
  "storyline": "With the untimely death of his beloved wife still bitter in his mouth, John Wick, the expert former assassin, receives one final gift from her--a precious keepsake to help John find a new meaning in life now that she is gone. But when the arrogant Russian mob prince, Iosef Tarasov, and his men pay Wick a rather unwelcome visit to rob him of his prized 1969 Mustang and his wife's present, the legendary hitman will be forced to unearth his meticulously concealed identity. Blind with revenge, John will immediately unleash a carefully orchestrated maelstrom of destruction against the sophisticated kingpin, Viggo Tarasov, and his family, who are fully aware of his lethal capacity. Now, only blood can quench the boogeyman's thirst for retribution.",
  "plot": "After John Wick (Keanu Reeves) loses his wife Helen to a terminal illness, he receives a puppy named Daisy, per Helen's instructions, to help him cope with her death. He connects with the puppy and they spend their day driving around in his vintage 1969 Ford Mustang Mach 1. At a gas station, he encounters a trio of Russian gangsters whose leader, Iosef Tarasov (Alfie Allen), insists on buying his car, but John refuses to sell it. The mobsters follow John to his home that night, knock him unconscious, steal his car, and kill Daisy.\n\nIosef takes the Mustang to a chop shop run by Aurelio (John Leguizamo) to have the VIN changed. Aurelio recognizes the car and, upon learning that Iosef stole it from John, punches him before throwing him out of his shop. John visits Aurelio, who tells him Iosef is the son of Viggo Tarasov (Michael Nyqvist), the head of the Russian crime syndicate in New York City. Viggo, informed by Aurelio of Iosef's actions, beats and berates Iosef, explaining to him that John Wick was his best assassin, nicknamed \"the Boogeyman.\" When John wanted to retire and marry Helen, Viggo gave him an \"impossible task\": killing all of his competitors in a single night. John succeeded, establishing the Tarasov syndicate.\n\nViggo tries to talk John out of seeking retribution, but John silently refuses. Viggo then sends a twelve-man hit squad to John's house, but John kills them all and has the bodies professionally removed. An unsurprised Viggo places a $2 million bounty on John's head and personally offers the contract to Marcus (Willem Dafoe), John's mentor. John seeks refuge at the Continental Hotel, which caters exclusively to the criminal underworld and permits no \"business\" on its premises. Viggo doubles the bounty for those willing to break the rules to kill John at the Continental.\n\nJohn learns from Winston (Ian McShane), the Continental's owner, that Viggo has Iosef protected at his nightclub, the Red Circle. John enters the Red Circle and kills his way to Iosef, but Iosef escapes. John retreats to the Continental to treat his wounds. Ms. Perkins (Adrianne Palicki), an assassin and former acquaintance of John's, sneaks into John's room to kill him, but Marcus warns John. John subdues Perkins after a brutal hand-to-hand fight and forces her to reveal the location of Viggo's front. John knocks Perkins unconscious and leaves her with fellow assassin Harry (Clarke Peters) to await punishment. However, Perkins frees herself and kills Harry.\n\nJohn travels to the Little Russia church which serves as Viggo's front and destroys Viggo's cache of money and blackmail material. When Viggo and his team arrive, John ambushes them, but he is subsequently captured. Viggo taunts John for thinking he could leave his old life behind. Marcus intervenes, allowing John to free himself and accost Viggo. At gunpoint, John forces Viggo to reveal Iosef's location. John then travels to Iosef's \"safe house\" and kills him.\n\nPerkins sees that John and Marcus have been in contact and tells Viggo, who has Marcus tortured and killed in his home. Viggo calls John to report the killing, planning to have Perkins ambush John. Perkins, however, is called to a meeting with Winston, who has her executed for breaking the Continental's rules.\n\nWinston calls John to inform him that Viggo is planning to escape by helicopter, and John races to the harbor, killing Viggo's remaining henchmen before engaging Viggo in a fistfight on the dock. Viggo pulls a knife and John allows himself to be stabbed, stunning Viggo. John then disarms and fatally wounds Viggo. Wounded himself, John stops at a waterfront animal clinic to treat his wound and takes with him a pitbull puppy which was scheduled to be euthanized. John and the dog walk home on the boardwalk where he had his last date with Helen.",
  "synopsis": "John Wick (Keanu Reeves) crashes an SUV into a wall. He staggers out of the vehicle, bloody and wounded. He puts pressure on a wound in his gut. As he crawls to the side, he takes out his phone and watches a video of his wife Helen (Briget Moynahan) on the beach. John slumps over and shuts his eyes.Several days earlier....John wakes up on a cloudy day. He has flashbacks of him being with Helen, up until recently when she collapsed in his arms. She had an illness that eventually claimed her life. It is the day of her funeral. After the service, John's old friend Marcus (Willem Dafoe) approaches him to offer his condolences.That night, a delivery arrives for John. It's a small beagle. John finds a note from Helen. She wrote to him that she has made peace with her death, and now she wants John to find his. John weeps. He takes the dog out and looks at its collar, which has a flower on it, leading John to figure out Helen named the dog Daisy.Daisy follows John on his day as he takes his Mustang out. He stops to get gas at the same time as three Russian mobsters, including Iosef Tarasov (Alfie Allen), son of mob boss Viggo Tarasov (Michael Nyqvist). Iosef comes up to John's car and compliments it, and then asks how much he wants for it. John says it's not for sale. Iosef then insults John in Russian, believing John won't understand, however John proves him wrong. Iosef then pets Daisy, but John scares him away. One of Iosef's buddies peeks his head into the car and wishes John a good day.As John is getting into bed, Daisy needs to use the bathroom. When they get downstairs, there are two men in shadows standing before John, while a third takes a bat and whacks John in the head. He starts beating on John while Daisy whines. One of the men goes over to the dog and breaks her neck. The man pulls off his mask to reveal Iosef, who knocks John out. John later wakes up and goes over to Daisy, stroking her head.Iosef takes John's car to a shop run by Aurelio (John Leguizamo). Aurelio immediately recognizes the car and demands to know where Iosef got it. Iosef brags about who he stole the car from and that he killed this person's dog. Aurelio slugs Iosef in the face. Later, John comes by the shop and asks if Iosef came by, and Aurelio gives John his name to confirm that's who took his car and killed his dog. Even later that night, Viggo calls Aurelio to ask why he struck Iosef. Aurelio says because he stole John Wick's car and killed his dog. Viggo simply replies, \"Oh.\"Meanwhile, John takes a sledgehammer into the basement and begins smashing the floor open. He uncovers a stash of weapons and gold coins.Viggo meets with Iosef in his home to discuss the situation. He hits his son twice in the solar plexus to reprimand him, reminding him who he just committed a crime against. Viggo tells Iosef that John Wick was associated with him once, until he met Helen and decided to leave. John apparently had a reputation as \"The Boogeyman\", or rather, the guy they called to kill the Boogeyman. Viggo calls John up to try and resolve the matter, but John hangs up on him.Viggo sends a team of 12 hitmen to John's home that night to kill him. John dispatches all of them with relative ease, fighting with the last few before stabbing the last guy through the heart. A police officer knocks on the front door. John greets him by name and asks him if there's been a noise complaint, and the cop says yes. He asks if John is back in the business, referring to the body visible behind John. John says he's just sorting some things out. The cop wishes him well and leaves.John summons a clean-up crew that he is done business with in the past to clean up the scene and dispose of the bodies. They have done business with John before and they know it won't be the last.Viggo meets with Wick's friend Marcus and asks him to kill Wick, offering a contract worth $2 million. He also instructs his assistant Avi (Dean Winters) to call for others to take the job. Marcus readily accepts.John arrives at the Continental Hotel where he stays while he conducts business. He recognizes Perkins (Adrianne Palicki). John meets another old friend, Winston (Ian McShane)- the manager and owner of the Continental. John asks and Winston tells him that Ioseph is at a club called Red Circle.John goes into the club where Iosef and his buddies are. As soon as they spot John, he begins shooting at them while Iosef runs away. John kills every hitman in his path, but he loses Iosef as he flees in a getaway car.At night, Marcus gets to the roof of the building across the street and sets his sights on John in his bed. From the mirror, he sees someone entering. He fires a shot to warn John. It's Perkins. She starts shooting at John while he dodges her. She tells him that Viggo has doubled the contract to $4 million if she breaks the rules of the hotel and kills him. He fights Perkins with difficulty until he gets her in a headlock and offers her mercy for information. She tells John that Viggo keeps most of his assets (cash and blackmail evidence) in the basement of a church. John knocks Perkins out and leaves her with Harry (Clarke Peters), a business acquaintance.Harry keeps Perkins cuffed to a chair, unaware that she has dislocated her thumb to slip out. She gets out and puts a pillow over Harry's face before shooting him.John goes to the church where Viggo keeps his secret stash of money. After shooting the other guards in the church, John forces the priest to guide him to where the money is. He lights it all on fire.Viggo learns of the fire moments before he is caught in a hail of gunfire courtesy of John. Although he kills most of Viggo's men, he is knocked out when an SUV rams into another, knocking John to the ground. Viggo captures him and wonders why he's gone to such great lengths for revenge over a car and a dog.John tells him that the dog was a gift from his dying wife, and that Iosef took that from him. Viggo leaves him with his henchmen for them to suffocate him with a plastic bag. However, Marcus is watching from the next building, and he shoots one hitman in the head to let John take out the other. John gets his gun and shoots at Viggo's getaway car, leaving only him alive. Viggo is forced to tell John that Iosef is hiding in a safe house in Brooklyn.The safe house is guarded by armed men, but none of that stops John from killing them and storming the place. Iosef once again tries to make a run for it, but John catches him and finishes him off.In retaliation for Iosef's death, Viggo has his goons find Marcus at his home. There, they beat him until Viggo and Perkins shoot him to death. Viggo calls John to tell him this, just before leaving for a helicopter to get out of the city.While waiting for John to come to Marcus's home, Perkins is called to a meeting with Winston, the owner of the Continental Hotel. She is meets Winston and four men at the Bethesda Arcade in Central Park. Winston tells her she's broken the rules of the Continental and her membership has been terminated. The four men execute her. As Winston walks away he meets the same cleaner that helped John remove the assassins' bodies from his home, giving him several coins. John finds Marcus's body and sets off to take down Viggo. He finds the villains heading to the chopper and tries ramming into them with his car. Viggo makes Avi go out and kill John, only for John to ram into him with his car. Viggo tries to push John's car over the edge, but John gets out safely. The two then fight hand-to-hand in the rain. Viggo tries to stab John, but John pushes the blade into himself (to gain leverage to break Viggo's arm) before grabbing the knife (from his stomach) and sticking it in Viggo's neck. He leaves him to die.We go back to the first scene where John is still bleeding. After watching the video with Helen, he is inspired to keep on going. He goes into a dog shelter and tends to his stab wound. He then takes a pit bull puppy with him, and they go home together."
}