{
  "imdb_id": "tt2916324",
  "tmdb_id": "283327",
  "douban_id": null,
  "title": "Seed 2 (2014)",
  "genres": [
    "Horror"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "78 min",
      "description": ""
    }
  ],
  "imdb_rating": 2.1,
  "director": [
    {
      "id": "nm3231736",
      "name": "Marcel Walz"
    }
  ],
  "writer": [
    {
      "id": "nm3231736",
      "name": "Marcel Walz",
      "description": null
    },
    {
      "id": "nm3594598",
      "name": "Annika Strauss",
      "description": "translation"
    },
    {
      "id": "nm0093051",
      "name": "Uwe Boll",
      "description": "based on characters created by"
    }
  ],
  "cast": [
    {
      "id": "nm3449071",
      "name": "Natalie Scheetz",
      "character": "Christine"
    },
    {
      "id": "nm0132300",
      "name": "Christa Campbell",
      "character": "Olivia"
    },
    {
      "id": "nm0930226",
      "name": "Caroline Williams",
      "character": "Mother"
    },
    {
      "id": "nm1891137",
      "name": "Nick Principe",
      "character": "Max Seed"
    },
    {
      "id": "nm3594598",
      "name": "Annika Strauss",
      "character": "Claire"
    },
    {
      "id": "nm1720082",
      "name": "Manoush",
      "character": "The Officer"
    },
    {
      "id": "nm5806510",
      "name": "Sarah Hayden",
      "character": "Barbara"
    },
    {
      "id": "nm5677180",
      "name": "Jared Demetri Luciano",
      "character": "Glen"
    },
    {
      "id": "nm0334106",
      "name": "Jeff Dylan Graham",
      "character": "Joe"
    },
    {
      "id": "nm0629913",
      "name": "Ryan Nicholson",
      "character": "Man in Truck"
    },
    {
      "id": "nm3018268",
      "name": "Micaela Schäfer",
      "character": "Victim"
    },
    {
      "id": "nm6833142",
      "name": "Wonkles",
      "character": "Green Frog"
    },
    {
      "id": "nm2776253",
      "name": "Wolfgang Meyer",
      "character": "Husband"
    }
  ],
  "overview": "Coming back from her bachelor party in Las Vegas, Christine and her friends are driving through the hot desert of Nevada. But they are not alone - serial killer Max Seed is back and he brought the whole family.",
  "storyline": "Coming back from her bachelor party in Las Vegas, Christine and her friends are driving through the hot desert of Nevada. But they are not alone - serial killer Max Seed is back and he brought the whole family.",
  "plot": null,
  "synopsis": "Christine McDonagh (Natalie Scheetz), a 30-something woman who is about to marry Steven, decides to hold her bachelorette party in Las Vegas with her friends Olivia (Christa Campbell), Claire (Annika Strauss), and Barbara (Sarah Hayden). Christine's foster mother (Caroline Williams) bids farewell to her daughter, then bludgeons a bound and gagged man with a hammer.After the party, Christine's group begins driving back to Chicago in an RV, and it is revealed that Christine has a troubled past and an unspecified mental illness, which has caused her to carve inverted crosses into her abdomen. During the trip, the quartet pick up a hitchhiker named Joe (Jeff Dylan Graham), who they quickly eject from the vehicle due to his strange behavior. A short time later, the RV is flagged down by a religious female police officer (Manoush), who claims that her squad car has just broken down off the road and that she needs a lift to the nearest town.When the RV fails to start, the officer has Christine and Barbara stay behind while she, Olivia, and Claire go in search of aid. Once they are a considerable distance from the others, the officer begins acting deranged; she stabs Claire, and shoots Olivia in the knee. The deranged female policeman then calls her son, Glen (Jared Demetri Luciano), help her move Claire.Nearby, serial killer Max Seed (Nick Principe) chases and murders a woman (Micaela Schäfer), and makes his way to the RV, where he incapacitates Christine and Barbara. After taking the wounded Olivia to the RV, Seed meets with the officer and Glen, who are his wife and son, respectively. Seed orders his family away, and nails Claire to the ground.After the Seed clan leaves, Claire is found by Joe, who releases and tries to rape her, prompting Claire to stab him in the neck with one of the spikes she was crucified with. At the RV, Seed restrains Glen while the officer recites passages from the Bible, and stabs him. Seed reaches into Glen's wound, rips out his intestines, and strangles him to death with them.Reentering the RV, Seed makes Barbara watch as he rapes and shoots Olivia with a handgun. When Seed leaves her alone, Barbara crawls out a window and tries to run away, but is shot to death by Christine, who refers to Seed's wife as \"Mom\". It is here that the deranged female policewoman, (who has the name tag of Officer Seed) is revealed to be Emily Bishop, the young child Seed abducted at the end of the previous film back in 1979, whom he has now raised, to be a serial killer like him.When Claire reaches the RV, Seed attacks her, but is stopped by Christine, who tells him, \"No! With her I still have plans\". As he and his family head home with the unconscious Claire, Seed snaps Emily's neck, and continues on with Christine and the captive Claire.In the final scene during the end credits, a motorist stops when he sees a bloodied Claire lying on the side of the road, and begins trying to call for help, only to have his throat slit by Claire. Seed walks up to Claire, and gives her his mask, which Claire puts on, now having been brainwashed and joined the murderous Seed family as their latest killer."
}