{
  "imdb_id": "tt2980554",
  "tmdb_id": "339145",
  "douban_id": null,
  "title": "The Girl in the Book (2015)",
  "genres": [
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "86 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm0169926",
      "name": "Marya Cohn"
    }
  ],
  "writer": [
    {
      "id": "nm0169926",
      "name": "Marya Cohn",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0885840",
      "name": "Emily VanCamp",
      "character": "Alice"
    },
    {
      "id": "nm4091900",
      "name": "Courtney Daniels",
      "character": "Lynn"
    },
    {
      "id": "nm0481180",
      "name": "Jordan Lage",
      "character": "Jack"
    },
    {
      "id": "nm3016197",
      "name": "Ana Mulvoy Ten",
      "character": "Young Alice       (as Ana Mulvoy-Ten)"
    },
    {
      "id": "nm0188165",
      "name": "Michael Cristofer",
      "character": "Dad"
    },
    {
      "id": "nm0638824",
      "name": "Michael Nyqvist",
      "character": "Milan"
    },
    {
      "id": "nm2356266",
      "name": "Mark Elliot Wilson",
      "character": "Guest"
    },
    {
      "id": "nm0051104",
      "name": "Talia Balsam",
      "character": "Mom"
    },
    {
      "id": "nm1541805",
      "name": "Joel Van Liew",
      "character": "Writing Teacher"
    },
    {
      "id": "nm2068649",
      "name": "Jon Norman Schneider",
      "character": "Josh"
    },
    {
      "id": "nm0653821",
      "name": "Kellie Overbey",
      "character": "Helene"
    },
    {
      "id": "nm2847079",
      "name": "Mark Tallman",
      "character": "Guy 2"
    },
    {
      "id": "nm2416847",
      "name": "Ali Ahn",
      "character": "Sadie"
    },
    {
      "id": "nm5768705",
      "name": "Mason Yam",
      "character": "Tyler"
    },
    {
      "id": "nm1964247",
      "name": "David Call",
      "character": "Emmet"
    },
    {
      "id": "nm5450646",
      "name": "Kaneza Schaal",
      "character": "Corine"
    },
    {
      "id": "nm2638009",
      "name": "Hollis Witherspoon",
      "character": "Karen"
    },
    {
      "id": "nm5257748",
      "name": "Josh Green",
      "character": "Keith"
    },
    {
      "id": "nm1130496",
      "name": "Alysia Reiner",
      "character": "Interviewer"
    },
    {
      "id": "nm5897418",
      "name": "Eric Tabach",
      "character": "Boy"
    },
    {
      "id": "nm1400216",
      "name": "Lisa Masters",
      "character": "Alana"
    },
    {
      "id": "nm1011835",
      "name": "Kelly Nyks",
      "character": "Guy 3"
    },
    {
      "id": "nm0893174",
      "name": "John C. Vennema",
      "character": "Senior Editor"
    }
  ],
  "overview": "The story of a young writer's transformation when her past invades her present.",
  "storyline": "The Girl in the Book charts the journey of young woman's transformation. At the outset, Alice Harvey is a lost and self-destructive 29 year old girl unable to write, too damaged for love. When her past invades her present and forces her to confront painful memories, she shatters. Helped by her friend and a new love interest, she slowly rediscovers her creative voice.",
  "plot": "Alice Harvey, a 28-year-old assistant book editor and aspiring writer, is tasked with handling the re-release of Milan Daneker's book Waking Eyes. Alice, the daughter of two successful, but neglectful, agents first met Milan as a teenager at one of her parents' parties. As she is forced to interact with him again she repeatedly flashes back to their interactions when she was a child when he forged a relationship with her under the guise of reading her work. When he later incorporated both her writing and intimate moments from their sexual relationship into his book she told her mother what had happened. Both her parents confronted Milan and chose to believe that she had an over-active imagination and a crush on Milan after Milan denied anything ever happened.\n\nIn the present Alice finds herself feeling jarred and out of control as Milan keeps inserting himself in her life. At her birthday party she meets Emmett, a community organizer, and the two begin dating. However, when her best friend's baby sitter makes an off-handed comment about how Waking Eyes doesn't interest him she has sex with him and is quickly caught by her best friend. Emmett also finds out and dumps Alice. In order to convince Emmett to give their relationship another shot Alice creates a blog listing 100 reasons why Emmett should take her back. In the meantime she confronts Milan about what he did though he continues to insist that the relationship was what she wanted. She later skips Milan's book re-launch party to talk to Emmett who finally agrees to take her back. Afterwards he figures out that she is \"the girl in the book\" and Alice tells him that she isn't any more. Newly inspired she begins to write again for the first time since Milan betrayed her and titles her work, The Girl in the Book.",
  "synopsis": null
}