{
  "imdb_id": "tt2997766",
  "tmdb_id": "217014",
  "douban_id": null,
  "title": "De nieuwe wildernis (2013)",
  "genres": [
    "Documentary"
  ],
  "country": "Netherlands",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    },
    {
      "runtime": "150 min",
      "description": "TV"
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm4710540",
      "name": "Ruben Smit"
    },
    {
      "id": "nm2329795",
      "name": "Mark Verkerk"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm0682168",
      "name": "Harry Piekema",
      "character": "Narrator       (voice)"
    }
  ],
  "overview": "The movie De Nieuwe Wildernis is set in the Oostvaardersplassen, a nature reserve of high standard in the Netherlands. The reserve has been developed in a location that 40 years ago was under sea level in one of the most densely populated countries in the world. Nowadays, its the stage for a unique nature show: the nature determines the rhythm.  EMS Films was the first with exclusive rights to shoot footage during all four seasons in the Oostvaardersplassen. The team of \"De Nieuwe Wildernis\" filmed in the Oostvaardersplassen over a period of two years. The result is a nature film never seen in The Netherlands before. It is a nature spectacle! The film features Konik horses, Red Deer, Foxes and Heck cattle, just to name a few, battling for new territories and survival.",
  "storyline": "Animal life in the nature reserve Oostvaardersplassen in the Netherlands during four seasons.",
  "plot": null,
  "synopsis": "The movie De Nieuwe Wildernis is set in the Oostvaardersplassen, a nature reserve of high standard in the Netherlands. The reserve has been developed in a location that 40 years ago was under sea level in one of the most densely populated countries in the world. Nowadays, its the stage for a unique nature show: the nature determines the rhythm. EMS Films was the first with exclusive rights to shoot footage during all four seasons in the Oostvaardersplassen. The team of \"De Nieuwe Wildernis\" filmed in the Oostvaardersplassen over a period of two years. The result is a nature film never seen in The Netherlands before. It is a nature spectacle! The film features Konik horses, Red Deer, Foxes and Heck cattle, just to name a few, battling for new territories and survival. A new wilderness has started. It is a paradise in the spring and summer times, but in the winter it transforms into a grim landscape. The food is scarce and the inhabitants of the new wilderness have to make vital life decisions. Only the strongest survive. De Nieuwe Wildernis captures the circle of life in this unique landscape."
}