{
  "imdb_id": "tt2946942",
  "tmdb_id": "407701",
  "douban_id": null,
  "title": "Ma folie (2015)",
  "genres": [
    "Drama",
    "Romance",
    "Thriller"
  ],
  "country": "Austria",
  "version": [
    {
      "runtime": "99 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm5484412",
      "name": "Andrina Mracnikar"
    }
  ],
  "writer": [
    {
      "id": "nm5484412",
      "name": "Andrina Mracnikar",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0214280",
      "name": "Alice Dwyer",
      "character": "Hanna"
    },
    {
      "id": "nm3437701",
      "name": "Sabin Tambrea",
      "character": "Yann"
    },
    {
      "id": "nm2067139",
      "name": "Oliver Rosskopf",
      "character": "Goran"
    },
    {
      "id": "nm1096341",
      "name": "Gerti Drassl",
      "character": "Marie"
    },
    {
      "id": "nm0744689",
      "name": "Anna Rot",
      "character": "Evi"
    },
    {
      "id": "nm7355263",
      "name": "Rayana Sidieva",
      "character": "Sarema"
    },
    {
      "id": "nm1934648",
      "name": "Gisela Salcher",
      "character": "Doris"
    }
  ],
  "overview": "HANNA loves YANN and the lettres filmees that he sends her, short, poetic films recorded with an iPhone. Yann loves Hanna, but mistrusts her. He leaves her, but does not leave her alone. ...",
  "storyline": "HANNA loves YANN and the lettres filmees that he sends her, short, poetic films recorded with an iPhone. Yann loves Hanna, but mistrusts her. He leaves her, but does not leave her alone. His video-letters become a threat and Hanna does not know whom to trust or whether she can still trust herself. MA FOLIE starts as a romantic love-story but gradually turns out to be a complex psychological thriller.",
  "plot": "Differences from Shakespeare's plot include that the nature of the lovers' deaths is different, depending on the production. New characters such as Death (French, Belgian, Japanese, Netherlands, and Moscow productions only) and the Poet (French production only) appear for dramatic effect. Lady Capulet has a greatly increased role and in the case of the Hungarian version, has an affair with her servant. The role of Tybalt has changed slightly from being purely dark to a more pitiful character because of his growing up with the hate and a dark childhood, as well as an unrequited attraction to Juliet.\nSynopsis\nAct 1\nA long-standing feud between the two leading families of the city of Verona, the Montagues and the Capulets, regularly erupts into violence on the city's streets. Irritated, the Prince of Verona decrees, on pain of death, the absolute prohibition on fighting in the city (Vérone). While Lady Capulet and Lady Montague denounce the violence of the two clans (La haine), Romeo (the sole heir of the Montagues) and Juliet (the daughter of the Capulets) are hopelessly in search for love (Un jour).\n\nAt the Capulets, a ball is being held so that Juliet can meet Count Paris, who asked Lord Capulet for her hand (La demande en mariage, Tu dois te marier). In Verona, Romeo and his friends, Benvolio and Mercutio, hang about the streets (Les rois du monde, La folie). Romeo is afraid of... he doesn't really know, but he's afraid (J'ai peur). In the hope of distracting him, Benvolio and Mercutio, persuade him to accompany them, in disguise, to a ball being held at the house of the Capulets (Le bal). At his first sight of Juliet, the daughter of the Capulets, Romeo instantly falls in love with her, without knowing who she is (L'amour heureux). Tybalt recognize Romeo and informs Juliet's parents. Romeo and Juliet learn from the Nurse who they are (Le bal 2). Tybalt, broken (he loves Juliet in secret), acknowledges that he is the son of hate and contempt (C'est pas ma faute).\n\nAfter the ball, Juliet takes refuge in her room and dreams of Romeo (Le poète), who woos her at great personal risk in the Capulets' garden. They exchange lovers' vows and plan to marry in secret as soon as possible (Le balcon). Knowing that their families will never agree to their marriage, Romeo meets Friar Lawrence and asks him to marry them. He accepts hoping that this union will reconcile the two families (Par amour).\n\nIn the morning, Romeo meets his friends and tells the Nurse, whom everyone makes fun of (Les beaux, les laids), that Friar Lawrence will marry them the following afternoon. The Nurse, who deeply loves Juliet as her own daughter, announces the good news to Juliet (Et voilà qu'elle aime). Finally, Romeo and Juliet are married (Aimer).\nAct 2\nThe next day, Benvolio and Mercutio meet Romeo: they accuse him of betrayal (On dit dans la rue). Out on the streets of Verona, Tybalt - unaware of his new blood tie to Romeo - searches for Romeo (C'est le jour) and when he finds him, challenges him to a fight, which Romeo refuses (Le duel). Mercutio takes up the challenge and is mortally wounded. Driven by guilt, vengeance and youthful-hotheadedness, Romeo kills Tybalt (Mort de Mercutio). The two families, plunged into mourning, ask the Prince for revenge (La vengeance). Finally, he banishes Romeo from Verona and thinks about the political power (Le pouvoir). In her bedroom, Juliet learns the bad news from the Nurse. She is torn between the love for her cousin and for her husband. Romeo goes to Friar Lawrence's. He thinks banishment is worse than death (Duo du désespoir).\n\nRomeo and Juliet spend their wedding night together and Romeo makes his escape to Mantua (Le chant de l'alouette). Shortly after her husband has left, Juliet is informed by her parents that she is to be married to Paris. She refuses and they threaten to disown her (Demain). Upset, Lord Capulet sings about the love he has for his daughter (Avoir une fille). In her room, Juliet asks why she has to obey (Pourquoi). In Mantua, Romeo thinks of Juliet. In desperation, she turns to Friar Lawrence, who devises an ingenious plan, which he hopes will ultimately bring a happy ending for both the lovers and their two families (Sans elle).\n\nJuliet appears to go along with the marriage plans but, in the night before the wedding, she takes the drug prepared by Friar Lawrence which makes her appear dead (Le poison). Juliet is duly laid in the family vault, hoping to wake up to find Romeo waiting for her. Unfortunately, The Friar's message telling Romeo of the plan somehow goes astray, and instead he hears only from Benvolio that his wife Juliet is dead (Comment lui dire).\n\nGrief-stricken, he breaks into the Capulet vault, finds what he believes to be the mortal remains of his beloved, and takes poison to be reunited with her in death (Mort de Roméo). Soon afterwards, Juliet awakes to find her husband dead and she stabs herself with Romeo's dagger (La mort de Juliette). Friar Lawrence enters the vault and finds the two lovers dead. He complains to God (J'sais plus). When the whole story is told, the two devastated families agree henceforward to live in peace (Coupables).",
  "synopsis": null
}