{
  "imdb_id": "tt2933474",
  "tmdb_id": "325358",
  "douban_id": null,
  "title": "Superfast! (2015)",
  "genres": [
    "Comedy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "99 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.0,
  "director": [
    {
      "id": "nm0294997",
      "name": "Jason Friedberg"
    },
    {
      "id": "nm0783536",
      "name": "Aaron Seltzer"
    }
  ],
  "writer": [
    {
      "id": "nm0294997",
      "name": "Jason Friedberg",
      "description": null
    },
    {
      "id": "nm0783536",
      "name": "Aaron Seltzer",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4091175",
      "name": "Alex Ashbaugh",
      "character": "Lucas White"
    },
    {
      "id": "nm3107498",
      "name": "Dale Pavinski",
      "character": "Vin Serento"
    },
    {
      "id": "nm2055623",
      "name": "Lili Mirojnick",
      "character": "Jordana"
    },
    {
      "id": "nm0623085",
      "name": "Andrea Navedo",
      "character": "Michelle"
    },
    {
      "id": "nm1731694",
      "name": "Daniel Booko",
      "character": "Curtis"
    },
    {
      "id": "nm1117946",
      "name": "Rogelio Douglas Jr.",
      "character": "Rapper Cameo"
    },
    {
      "id": "nm3616779",
      "name": "Chris Pang",
      "character": "Cool Asian Guy"
    },
    {
      "id": "nm1410318",
      "name": "Omar Chaparro",
      "character": "Juan Carlos de la Sol"
    },
    {
      "id": "nm1928515",
      "name": "Joseph Julian Soria",
      "character": "Cesar Veracruz"
    },
    {
      "id": "nm4415654",
      "name": "Dio Johnson",
      "character": "Detective Johnson"
    },
    {
      "id": "nm1514763",
      "name": "Amin Joseph",
      "character": "Dre"
    },
    {
      "id": "nm2757601",
      "name": "Cuete Yeska",
      "character": "Jose"
    },
    {
      "id": "nm0579460",
      "name": "Gonzalo Menendez",
      "character": "Detective Hanover"
    },
    {
      "id": "nm3119455",
      "name": "Shantel Wislawski",
      "character": "Julie Canaro"
    },
    {
      "id": "nm0161670",
      "name": "Luis Chávez",
      "character": "Low Life Hector"
    },
    {
      "id": "nm1542537",
      "name": "DaJuan Johnson",
      "character": "Officer Brooks"
    },
    {
      "id": "nm6581330",
      "name": "Alexis Lopez",
      "character": "Hot Girl"
    },
    {
      "id": "nm4932587",
      "name": "William Barney",
      "character": "Jamaican Guy"
    },
    {
      "id": "nm3122771",
      "name": "Shakira Barrera",
      "character": "Sofia"
    },
    {
      "id": "nm7814490",
      "name": "Eric Mccoy",
      "character": "Maurice"
    },
    {
      "id": "nm3373387",
      "name": "Dres Reid",
      "character": "Diego"
    },
    {
      "id": "nm1045049",
      "name": "Christine Clayburg",
      "character": "Female Newscaster"
    },
    {
      "id": "nm4539269",
      "name": "Chanel Celaya",
      "character": "Ivana the Model Turned Actress"
    },
    {
      "id": "nm7814491",
      "name": "Mickey Friedberg",
      "character": "Young Vin"
    }
  ],
  "overview": "Undercover cop Lucas White joins Vin Serento's LA gang of illegal street racers. They are fast and they are furious and they plan to double cross LA crime kingpin Juan Carlos de la Sol who hides his cash in a downtown Taco Bell. The gang's outrageous plan is as daring as it is ridiculous and will see them towing the whole damn restaurant, at crazy speeds.",
  "storyline": "Undercover cop Lucas White joins Vin Serento's LA gang of illegal street racers. They are fast and they are furious and they plan to double cross LA crime kingpin Juan Carlos de la Sol who hides his cash in a downtown Taco Bell. The gang's outrageous plan is as daring as it is ridiculous and will see them towing the whole damn restaurant, at crazy speeds.",
  "plot": "Dim witted Undercover police officer Lucas White enters a local street race hosted by LA racing boss, Vin Serentto and his crew; involving his girlfriend, Michelle; his sister, Jordana and best friend, Curtis. Despite looking out of place among the racers, he puts up his car (A light green Toyota Corolla with a unicorn on the side) as collateral and enters a race between Vin and two others; he nearly wins but his engine overheats and Vin ends up winning. Soon, against Vin and two other racers. After the race, which Lucas loses after his engine overheats, he is stopped by the cops as the others flee.\n\nHe is met by his superior, Detective Hanover, who wants him to join Vin's gang as he believes Vin's gang to be connected to LA Crime Boss, Juan Carlos de la sol; Lucas is still reluctant as he believes himself too white and weird, but Hanover claims that due to his lack of connections and his tight test score on his criminal aptitude test, he'll do good. Lucas goes to Vin's garage the next morning with a wrecked Smart Car, (a ten second car) as collateral for losing the race and lands a job as a mechanic, despite objections from Curtis and Michelle. He also develops a relationship with Jordana.\n\nThe next day, Vin takes Lucas with him to a secluded area near a power plant with Hanover tracking them through Lucas's phone; they win a dance audition for de la Sol and as their prize, They are to drive de la Sol's supercar to a warehouse to meet up with a gang and exchange it for a briefcase of cash, they make the delivery only to discover a bomb inside the briefcase . They play catch with the gang until the bomb explodes on Vin's face before a shootout ensues. Vin chases after the gang leader while Lucas accidentally guns down Hanover, the only one aware of his identity as an undercover cop. After the duo flee from the scene, Detective Rock Johnson and Officer Julie Canaro arrive to investigate the shootout. Canary tries to ID Lucas but she is unable to, thanks to Hanover destroying his database file. Meanwhile, de la Sol orders a hit on Vin following the double-cross. Back at Serento Garage, Vin and the gang discover a list of de la Sol's illegal activities through a computer in the supercar, one of which is his secret stash of $100 million; they Decide to steal the cash and flee the city.. For this heist, Vin employs the services of Rapper Cameo, Cool Asian Guy, and Model Turned Actress. At the same time, Jordana reveals to Lucas that she is pregnant with their child. Later, Vin, Lucas, Rapper Cameo and Cool Asian Guy go to stake out the place but end up on the wrong street and mistakenly mug a pastor and a nun delivering bingo night money. They regroup and deduce that the secret stash is inside a downtown taqueria called Big Ass Tacos, owned by Del la sol; They hatch a plan to break into the vault, steal the cash, and flee to an extradition-free country with no casualties involved, except for Curtis.\n\nCurtis finishes fixing the smart car and Vin fixes Lucas's own car; he then shows Lucas his dad's car; a 1978 Dodge Charger. The next morning, Johnson and his squad raid the garage; the facility is empty, but Canaro discovers the gang's plans, which are heavily ignored by Johnson.\n\nAt the Big Ass Taco Restaurant, the gang realize they have been double-crossed by Curtis (who was promised One Direction concert tickets) and engage in a shootout with de la Sol's thugs. At the last minute, Curtis is shot dead by de la Sol's Bodyguard, Cesar, while protecting Vin. Using the restored Smart Car and Lucas' Toyota Corolla, Vin and Lucas attempt to pull down the back wall and end up towing the whole restaurant away. De la Sol and Cesar chase after them with the gang and Johnson and his squad in pursuit. The gang manages to fend off the squad but Canaro shoots the gas tank on Jordana's car, causing her to lose gas. Michelle hands herself over to Canaro to help Jordana get away, Meanwhile, de la Sol kicks Cesar out of his SUV after an argument over the climate control. Johnson kills Cesar in a shootout and stops de la Sol, but the kingpin flees after bribing the detective with a male enhancement kit. Upon hearing an explosion, Johnson heads to the abandoned restaurant and chases after the gang. He nabs Jordana and reveals to her and Vin that Lucas is an undercover cop. Lucas, instead, handcuffs Johnson to the spoiler of Jordana's Scion tC and walks away with Vin and Jordana while Johnson struggles to grab his bottle of baby oil on the ground. With the cash stowed in the trunks, Lucas and Vin agree to one more race, with Jordana's unborn baby at stake. However, de la Sol arrives, demanding the return of his money, but is run over by a squad car with Michelle and Canaro making out. Lucas, Vin, and Jordana then race off, with Vin arguing with the GPS device after it directs him to a wig shop.",
  "synopsis": null
}