{
  "imdb_id": "tt2926172",
  "tmdb_id": "269146",
  "douban_id": null,
  "title": "La Palmira: Ul film (2013)",
  "genres": [
    "Comedy"
  ],
  "country": "Switzerland",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.9,
  "director": [
    {
      "id": "nm2511518",
      "name": "Alberto Meroni"
    }
  ],
  "writer": [
    {
      "id": "nm5698495",
      "name": "Diego Bernasconi",
      "description": null
    },
    {
      "id": "nm2511518",
      "name": "Alberto Meroni",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm5698495",
      "name": "Diego Bernasconi",
      "character": "Peter"
    },
    {
      "id": "nm5700933",
      "name": "Francesca Bernasconi",
      "character": "Ersilia"
    },
    {
      "id": "nm5702277",
      "name": "Rodolfo Bernasconi",
      "character": "Palmira"
    },
    {
      "id": "nm5698208",
      "name": "Simona Bernasconi",
      "character": "Elisabetta"
    },
    {
      "id": "nm4902554",
      "name": "Michael Betti",
      "character": "Tony il Clown"
    },
    {
      "id": "nm0135599",
      "name": "Federico Caprara",
      "character": "Don Giovanni"
    },
    {
      "id": "nm5700591",
      "name": "Germano Porta",
      "character": "Miglieta"
    },
    {
      "id": "nm2050981",
      "name": "Flavio Sala",
      "character": "Direttor Beck"
    },
    {
      "id": "nm5697854",
      "name": "Valerio Sulmoni",
      "character": "Ul Geni"
    }
  ],
  "overview": null,
  "storyline": "La semplice vita nel borgo di Mendrisio prosegue come sempre: la Palmira (Rodolfo Bernasconi) tiene sotto controllo tutto quanto accade in paese; il marito Eugenio (Valerio Sulmoni) non si sforza più del necessario se non per bere un bicchiere di vino in più; e sua sorella Miglieta (Germano Porta), unarzilla novantenne caratterizzata da una leggera sordità, rincorre il sogno di poter leggere le sacre scritture in chiesa. A porle questo veto è Don Mirko (Federico Caprara), il parroco di origini venete arrivato in paese un paio di anni fa che nonostante abbia perso il suo accento si è ben integrato nella comunità, ed è assistito da Ersilia (Francesca Bernasconi), la perpetua pettegola e appassionata di televisione e film gialli. Questa simpatica routine viene interrotta quando in città arriva il Circus Beck e il suo esilarante Direttore (Flavio Sala) che promette uno spettacolo indimenticabile. E così sarà, perché ben presto gli equilibri che tengono unita la famiglia della Palmira si ...",
  "plot": null,
  "synopsis": "La semplice vita nel borgo di Mendrisio prosegue come sempre: la Palmira (Rodolfo Bernasconi) tiene sotto controllo tutto quanto accade in paese; il marito Eugenio (Valerio Sulmoni) non si sforza più del necessario se non per bere un bicchiere di vino in più; e sua sorella Miglieta (Germano Porta), unarzilla novantenne caratterizzata da una leggera sordità, rincorre il sogno di poter leggere le sacre scritture in chiesa. A porle questo veto è Don Mirko (Federico Caprara), il parroco di origini venete arrivato in paese un paio di anni fa che nonostante abbia perso il suo accento si è ben integrato nella comunità, ed è assistito da Ersilia (Francesca Bernasconi), la perpetua pettegola e appassionata di televisione e film gialli.\nQuesta simpatica routine viene interrotta quando in città arriva il Circus Beck e il suo esilarante Direttore (Flavio Sala) che promette uno spettacolo indimenticabile. E così sarà, perché ben presto gli equilibri che tengono unita la famiglia della Palmira si spezzano cambiando il destino di ognuno di loro. Al centro del vortice la scoperta di un tesoro inestimabile che può spingere chiunque a gesti folli per ottenerlo.\nCosì le vie del borgo diventano il crocevia di chi caccia il tesoro, di chi lascia la propria casa per orgoglio, di chi finisce allospizio e di chi decide di lasciare tutto per far parte dello show del Circus Beck.\nE alla fine lo spettacolo termina nel migliore dei modi, ma prima che tutto torni come prima, i nostri protagonisti dovranno smascherare larchitetto del piano che gliene ha fatte passare di tutti i colori.\nIl film è dialetto ticinese (lombardo)."
}