{
  "imdb_id": "tt2911996",
  "tmdb_id": "329247",
  "douban_id": null,
  "title": "Garbage, the City and Death (2012)",
  "genres": [
    "Drama"
  ],
  "country": "Czech Republic",
  "version": [
    {
      "runtime": "74 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm0398575",
      "name": "Jan Hrebejk"
    }
  ],
  "writer": [
    {
      "id": "nm0001202",
      "name": "Rainer Werner Fassbinder",
      "description": "play"
    },
    {
      "id": "nm5558234",
      "name": "Dusan David Parízek",
      "description": "stage adaptation"
    }
  ],
  "cast": [
    {
      "id": "nm1939497",
      "name": "Jirí Cerný",
      "character": "Oskar"
    },
    {
      "id": "nm3345494",
      "name": "Stefan Chovanec",
      "character": ""
    },
    {
      "id": "nm1898925",
      "name": "Martin Finger",
      "character": "Wealthy Jew"
    },
    {
      "id": "nm2001941",
      "name": "Stanislav Majer",
      "character": "Franz"
    },
    {
      "id": "nm5589456",
      "name": "Gabriela Mícová",
      "character": "Romi"
    },
    {
      "id": "nm1416606",
      "name": "Martin Pechlát",
      "character": "Mr. Müller"
    },
    {
      "id": "nm1595131",
      "name": "Dana Poláková",
      "character": "Mrs. Müller"
    }
  ],
  "overview": "Romi (Gabriela Mícová), a prostitute, is anything but successful at her job: she is of far too gentle a nature for her clients. The more obstinately she is pushed to the streets by her pimp Franz (Stanislav Majer), the closer she is to a complete breakdown. One day Romi is addressed by a property speculator referring to himself as a \"wealthy Jew\" (Martin Finger). He does not demand any sexual services of her. He satisfies himself with Romi telling him stories, for which he lavishly rewards her. However, no one shares the sudden happiness with Romi. Her work-mates and current clients turn their backs on her, as does Franz, with whom Romi is in love. The whole story takes place in the setting of a dilapidated city, during the clean-up of which politicians openly split their profit with speculators and lobbyists, all under protection from the police.",
  "storyline": "The screenplay (Der Müll, die Stadt und der Tod) by Rainer Werner Fassbinder inspired a theatre production by Dusan David Parízek. The screenplay and the production in turn inspired the film ODPAD MESTO SMRT (Waste, City, and Death) by Jan Hrebejk. Romi (Gabriela Mícová), a prostitute, is anything but successful at her job: she is of far too gentle a nature for her clients. The more obstinately she is pushed to the streets by her pimp Franz (Stanislav Majer), the closer she is to a complete breakdown. One day Romi is addressed by a property speculator referring to himself as a \"wealthy Jew\" (Martin Finger). He does not demand any sexual services of her. He satisfies himself with Romi telling him stories, for which he lavishly rewards her. However, no one shares the sudden happiness with Romi. Her work-mates and current clients turn their backs on her, as does Franz, with whom Romi is in love. The whole story takes place in the setting of a dilapidated city, during the clean-up of ...",
  "plot": null,
  "synopsis": null
}