{
  "imdb_id": "tt2911668",
  "tmdb_id": "284289",
  "douban_id": null,
  "title": "Beyond the Reach (2014)",
  "genres": [
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "91 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm1515266",
      "name": "Jean-Baptiste Léonetti"
    }
  ],
  "writer": [
    {
      "id": "nm0839812",
      "name": "Stephen Susco",
      "description": "screenplay"
    },
    {
      "id": "nm0925380",
      "name": "Robb White",
      "description": "based on the book: \"Deathwatch\""
    }
  ],
  "cast": [
    {
      "id": "nm0000140",
      "name": "Michael Douglas",
      "character": "Madec"
    },
    {
      "id": "nm3528539",
      "name": "Jeremy Irvine",
      "character": "Ben"
    },
    {
      "id": "nm2267063",
      "name": "Hanna Mangan Lawrence",
      "character": "Laina"
    },
    {
      "id": "nm0001074",
      "name": "Ronny Cox",
      "character": "Sheriff Robb"
    },
    {
      "id": "nm0404656",
      "name": "Patricia Bethune",
      "character": "Secretary"
    },
    {
      "id": "nm8065762",
      "name": "Jadelyn Dawn Wilkins",
      "character": "Dead Girl w /              Lipstick"
    },
    {
      "id": "nm8065761",
      "name": "Eddy Glenn Patterson",
      "character": "Helicopter Pilot"
    }
  ],
  "overview": "A high-rolling corporate shark and his impoverished young guide play the most dangerous game during a hunting trip in the Mojave Desert.",
  "storyline": "Madec, an international and unscrupulous entrepreneur, hires the skilled young tracker Ben to guide him through the fearful and barren Mojave Desert during a hunting trip. Unfortunately, however, things will take a turn for the worse, when prideful Madec shoots unintentionally the wrong target, and in a cynical attempt to wash his hands of the irrevocable deed, Madec will try to bribe himself out of this predicament by offering Ben a hefty compensation in exchange for his silence. But as this is against Ben's principles, before long, the unfortunate tracker will run for his life under the fierce and merciless sun. Undoubtedly, the desert is limitless, but on the other hand, so is the desire to survive.",
  "plot": "Ruthless tycoon and trophy collector John Madec flaunts his $500,000 all-terrain vehicle in a small New Mexico town and buys off the local sheriff to bag an endangered desert bighorn sheep. The sheriff solicits the young but experienced tracker Ben to guide the malevolent Madec an hour outside town into the canyon country of Shiprock. Madec taunts Ben over his love interest, who has gone away to Colorado for a college swimming scholarship and gifted a gun that Ben taught her to shoot. When Ben asks to see the permit to hunt the endangered bighorn, Madec offers a wad of cash, which the stunned Ben begrudgingly accepts after Madec supplements his initial offer even further. Madec of shoot-first-and-ask-questions-later philosophy accidentally shoots an old prospector, and Ben insists that they must report it as an accident. Madec, on the other hand, puts another bullet from Ben's gun into the corpse, and after explaining how he can now blackmail Ben with questions of who was the actual killer, offers Ben a deal: Madec will put him through college with a finance major and give him a $300,000/year job in return for his complicity in covering up the crime.\n\nWhen Ben picks up his emergency transponder, Madec destroys it and berates Ben for breaking the deal. Madec then threatens Ben with his high-powered rifle, and orders him to strip all of his clothes and shoes, and forces him to wander out in the desert to die of dehydration and exposure.\n\nMadec plans to report that Ben went mad, shot the prospector, and wandered off into the barren horizon alone. Madec is certain Ben cannot survive, as they are in a hot desert 45 miles from the nearest town, but just to make sure, he watches Ben from a distance, using the scope on his rifle. Ben finds enough water to survive until Madec shoots the barrel containing it. Trekking on, Ben hides in the semi-subterranean lair of the shot prospector Charlie whom he'd befriended in life, but Madec blows it up with the prospector's dynamite stash, although Ben manages to escape before it explodes with the 'treasure map' of Charlie, whom Ben vows will not die without justice.\n\nBy sunset, Ben uses the map to find a wrist-brace slingshot and some marbles among a buried box of Charlie's personal effects. He goes for a hidden grotto of water that he and his girlfriend had swum in, only to find it dried up as his sun-burned body now freezes in the desert night. Madec keeps watch with his vehicle's high-powered floodlights as Ben eventually outsmarts Madec to overcome him with the slingshot like David felled Goliath.\n\nBack in town, Madec escapes from police custody during a bathroom break to board a helicopter that he solicited using his one phonecall. Ben goes to his girlfriend and promises not to leave her side again. Armed Madec sneaks into their house as they sleep together and confronts Ben, but his girlfriend shoots Madec using the gun Ben gave her. Ben picks up the weapon, and finishes Madec off as the screen fades to black and the credits roll.",
  "synopsis": null
}