{
  "imdb_id": "tt2949308",
  "tmdb_id": "382604",
  "douban_id": null,
  "title": "Money & Life (2013)",
  "genres": [
    "Documentary",
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "86 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm5450236",
      "name": "Katie Teague"
    }
  ],
  "writer": [
    {
      "id": "nm5450236",
      "name": "Katie Teague",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm5695970",
      "name": "Marga Laube",
      "character": "Narrator       (voice)"
    },
    {
      "id": "nm3796421",
      "name": "Lynne Twist",
      "character": "Herself"
    },
    {
      "id": "nm0794476",
      "name": "Vandana Shiva",
      "character": "Herself"
    },
    {
      "id": "nm3509864",
      "name": "Orland Bishop",
      "character": "Himself"
    },
    {
      "id": "nm5698807",
      "name": "Joy Hosey",
      "character": "Herself"
    },
    {
      "id": "nm5700782",
      "name": "James Quilligan",
      "character": "Himself"
    },
    {
      "id": "nm5698175",
      "name": "Mark Bozzuti-Jones",
      "character": "Himself       (as Rev. Mark Bozzuti-Jones)"
    },
    {
      "id": "nm5697172",
      "name": "Jacob Needleman",
      "character": "Himself"
    },
    {
      "id": "nm3246393",
      "name": "Thomas H. Greco",
      "character": "Himself       (as Thomas Greco)"
    },
    {
      "id": "nm2482290",
      "name": "William Greider",
      "character": "Himself"
    },
    {
      "id": "nm2004001",
      "name": "Vicki Robin",
      "character": "Herself"
    },
    {
      "id": "nm3972002",
      "name": "Steven Z. Leder",
      "character": "Himself       (as Rabbi Steven Leder)"
    },
    {
      "id": "nm2306512",
      "name": "Aaron Kipnis",
      "character": "Himself"
    },
    {
      "id": "nm0396822",
      "name": "Jean Houston",
      "character": "Herself"
    },
    {
      "id": "nm5696009",
      "name": "Robin Gottfried",
      "character": "Himself"
    },
    {
      "id": "nm5628017",
      "name": "Charles Eisenstein",
      "character": "Himself"
    },
    {
      "id": "nm5701629",
      "name": "Janice Stieber-Rous",
      "character": "Herself"
    },
    {
      "id": "nm3015644",
      "name": "Bernard A. Lietaer",
      "character": "Himself       (as Bernard Lietaer)"
    },
    {
      "id": "nm5697332",
      "name": "Scott Morris",
      "character": "Himself"
    },
    {
      "id": "nm2677694",
      "name": "David Korten",
      "character": "Himself"
    },
    {
      "id": "nm5163350",
      "name": "Ellen Brown",
      "character": "Herself"
    },
    {
      "id": "nm5701335",
      "name": "Graciela Chichilnisky",
      "character": "Herself       (as Graciela Chichilnsky)"
    },
    {
      "id": "nm5700830",
      "name": "Stuart Valentine",
      "character": "Himself"
    },
    {
      "id": "nm5696677",
      "name": "John Fullerton",
      "character": "Himself"
    },
    {
      "id": "nm5700545",
      "name": "Rahul Brown",
      "character": "Himself"
    },
    {
      "id": "nm5697977",
      "name": "Rebecca Adamson",
      "character": "Herself"
    },
    {
      "id": "nm5697998",
      "name": "John Bloom",
      "character": "Himself"
    },
    {
      "id": "nm2588438",
      "name": "John Perkins",
      "character": "Himself"
    },
    {
      "id": "nm5697774",
      "name": "Jill Warren",
      "character": "Herself"
    },
    {
      "id": "nm5699586",
      "name": "Hazel Henderson",
      "character": "Herself"
    },
    {
      "id": "nm3232878",
      "name": "Juliet Schor",
      "character": "Herself"
    },
    {
      "id": "nm5696420",
      "name": "Edgar Cahn",
      "character": "Himself"
    },
    {
      "id": "nm5695843",
      "name": "Graham Torpey",
      "character": "Himself"
    },
    {
      "id": "nm1731391",
      "name": "Elisabet Sahtouris",
      "character": "Herself"
    },
    {
      "id": "nm3563679",
      "name": "Judy Wicks",
      "character": "Herself"
    },
    {
      "id": "nm2129083",
      "name": "Riane Eisler",
      "character": "Herself"
    }
  ],
  "overview": "Money &amp; Life is an inspirational essay-style  documentary that asks a provocative question:  can we see the economic crisis not as a disaster,  but as a tremendous opportunity?  This cinematic odyssey connects the dots on our current economic pains and offers a new story of money based on an emerging paradigm of planetary well-being that understands all of life as profoundly interconnected.",
  "storyline": "MONEY and LIFE is a passionate and inspirational essay-style documentary that makes a provocative proposition: can we see the economic crisis not as a disaster, but as a tremendous opportunity? An optimistic film steeped in appreciation for human ingenuity, MONEY and LIFE is a respectful invitation to consider questions critical to all our well-being: How can we move beyond being merely consumers, debtors and creditors, and put money in service to what we really care about as citizens, as human beings? Can we design a monetary circulation system that fosters democratic equality? What does it really mean to make a living? MONEY and LIFE empowers each of us to respond to the fundamental issues of our time and participate in the emerging new economy.",
  "plot": null,
  "synopsis": "MONEY & LIFE is a passionate and inspirational essay-style documentary that that asks a provocative question: can we see the economic crisis not as a disaster, but as a tremendous opportunity? This cinematic odyssey connects the dots on our current economic pains and offers a new story of money based on an emerging paradigm of planetary well-being that understands all of life as profoundly interconnected.\nThis cinematic odyssey takes us on a journey, from the origins of money to connecting the systemic dots on the current global financial crisis and how we got here. Most importantly, MONEY & LIFE says that we owe it to ourselves to understand the fundamentals of this technology called money in order to be effective participants in the economic transformation that is happening around us, a shift more rapid and as profound as the Industrial Revolution.\nThe film is a tapestry of beautifully shot expert interviews woven with compelling vignettes of individuals and businesses consciously transforming their relationship with money. Together with dynamic animation, an original music score and an elegant voice of narration, the film tells a new story of money, but more broadly it tells a new story of humanity. MONEY & LIFE aspires to be a part of bringing a new consciousness to our understanding and practices in the world of money, bringing a touch of humor and a lot of heart to a matter that concerns us all.\nAn optimistic film steeped in appreciation for human ingenuity, MONEY & LIFE does not dictate answers. It is a respectful invitation to consider questions critical to all our well-being: How can we move beyond being merely consumers, debtors and creditors, and put money in service to what we really care about as citizens, as human beings? Can we design a monetary circulation system that fosters democratic equality? What responsibilities should a corporate charter convey? What does it really mean to make a living? The film itself demonstrates how to approach these questions with both clarity and compassion. MONEY & LIFE empowers each of us to respond to the fundamental issues of our time and participate in the emerging new economy."
}