{
  "imdb_id": "tt2968804",
  "tmdb_id": "256092",
  "douban_id": null,
  "title": "Drive Hard (2014)",
  "genres": [
    "Action",
    "Comedy",
    "Crime"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "92 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.3,
  "director": [
    {
      "id": "nm0872062",
      "name": "Brian Trenchard-Smith"
    }
  ],
  "writer": [
    {
      "id": "nm1720703",
      "name": "Chad Law",
      "description": "written by and"
    },
    {
      "id": "nm1823479",
      "name": "Evan Law",
      "description": "written by"
    },
    {
      "id": "nm4340402",
      "name": "Brigitte Jean Allen",
      "description": "screenplay and"
    },
    {
      "id": "nm0872062",
      "name": "Brian Trenchard-Smith",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0000131",
      "name": "John Cusack",
      "character": "Simon Keller"
    },
    {
      "id": "nm0005048",
      "name": "Thomas Jane",
      "character": "Peter Roberts"
    },
    {
      "id": "nm2191570",
      "name": "Zoe Ventoura",
      "character": "Agent Walker"
    },
    {
      "id": "nm0606442",
      "name": "Christopher Morris",
      "character": "Rossi"
    },
    {
      "id": "nm1452579",
      "name": "Yesse Spence",
      "character": "Tessa Roberts"
    },
    {
      "id": "nm0251210",
      "name": "Jerome Ehlers",
      "character": "Bank Chairman"
    },
    {
      "id": "nm0122609",
      "name": "Carol Burns",
      "character": "Granny"
    },
    {
      "id": "nm6675678",
      "name": "Robert Newman",
      "character": "Grandpa"
    },
    {
      "id": "nm1555145",
      "name": "Christopher Sommers",
      "character": "Gas Station Attendant"
    },
    {
      "id": "nm0117970",
      "name": "Andrew Buchanan",
      "character": "Detective Blanchard"
    },
    {
      "id": "nm0960946",
      "name": "Damien Garvey",
      "character": "Detective Chief Inspector Smith"
    },
    {
      "id": "nm4693227",
      "name": "Jason Wilder",
      "character": "Agent Brown"
    },
    {
      "id": "nm2069714",
      "name": "Adrian Auld",
      "character": "Guild"
    },
    {
      "id": "nm2262964",
      "name": "Sam Cotton",
      "character": "Tabloid Reporter"
    },
    {
      "id": "nm4256225",
      "name": "Francesca Bianchi",
      "character": "Stacy"
    },
    {
      "id": "nm2977434",
      "name": "Anthony Standish",
      "character": "Detective"
    },
    {
      "id": "nm2792721",
      "name": "Matthew Scully",
      "character": "Cop #2"
    },
    {
      "id": "nm3610285",
      "name": "Adrian Pudlyk",
      "character": "Cop #4"
    },
    {
      "id": "nm6675680",
      "name": "Lloyd Johnson",
      "character": "Jefferies"
    },
    {
      "id": "nm2966866",
      "name": "Kellyn Morris",
      "character": "Newsreader"
    },
    {
      "id": "nm1777041",
      "name": "Ron Kelly",
      "character": "Tessa's Client"
    },
    {
      "id": "nm6160492",
      "name": "Meg Lucas",
      "character": "Teenager"
    },
    {
      "id": "nm0180992",
      "name": "Mick Corrigan",
      "character": "Biker"
    },
    {
      "id": "nm0802397",
      "name": "Yasca Sinigaglia",
      "character": "Security Agent #1"
    },
    {
      "id": "nm0476736",
      "name": "Alex Kuzelicki",
      "character": "Security Thug #4"
    },
    {
      "id": "nm0118575",
      "name": "Bradd Buckley",
      "character": "Cop #1 /              Driveby Driver"
    },
    {
      "id": "nm0103009",
      "name": "Damian Bradford",
      "character": "Policeman /              Driveby Driver"
    },
    {
      "id": "nm2555569",
      "name": "Karl Van Moorsel",
      "character": "Policeman"
    },
    {
      "id": "nm7993795",
      "name": "Joshua Leon Bryant",
      "character": "Boardroom Executive"
    },
    {
      "id": "nm2170752",
      "name": "Caroline Dunphy",
      "character": "Lawyer"
    },
    {
      "id": "nm6859019",
      "name": "Rachel Fountain",
      "character": "TV Reporter /              Media Personnel"
    },
    {
      "id": "nm9179150",
      "name": "Aaron M Watson",
      "character": "Office Worker"
    },
    {
      "id": "nm5796465",
      "name": "Christopher J. Woods",
      "character": "Media       (as Christopher Woods)"
    },
    {
      "id": "nm6859020",
      "name": "Bernadette Young",
      "character": "TV Reporter /              Media Personnel"
    }
  ],
  "overview": "A former race car driver is abducted by a mysterious thief and forced to be the wheel-man for a crime that puts them both in the sights of the cops and the mob.",
  "storyline": "A former race car driver turned driver's training instructor (Jane) is abducted by a mysterious thief (Cusack) and forced to be the wheel-man for a crime that puts both in the sights of the cops and the mob and leads them all on a chase across Australia's Gold Coast.",
  "plot": "Former race car driver and American expatriate Peter Roberts has retired at the urging of his lawyer wife, though he resists getting an office job. Instead, he becomes an instructor at a driving school, while waiting for an investment opportunity to open a racing school. After he drops his daughter off to school and learns that he can no longer afford her private school tuition, he takes a fellow American as his first client. The man, Simon Keller, reveals that he has investigated Roberts' finances and personal life. Disturbed, Roberts insists on ending the lesson and returning to the school. Keller agrees but requests that they stop at a bank first, so that he can pay Roberts.\n\nAs Keller exits the bank, he opens fire on the guards, drops a bag into the car, and demands that Roberts serve as his getaway driver. Roberts protests in disbelief and attempts to surrender to the police, who open fire on him, too. Roberts reluctantly drives off and evades the police. Keller offers to share a percentage of his loot, but the panicked Roberts insists that he is now going to end up in jail. Keller assures him that the police will not pursue them, as the bank is owned and managed by a criminal syndicate with connections to the local police. Rossi, Keller's former associate, had previously betrayed him in the United States and then joined the Australian syndicate.\n\nRossi calls off the police and hires mercenaries to kill them. However, Agent Walker of the Australian Federal Police takes charge of the investigation over the objections of the corrupt Detective Chief Inspector Smith. Walker immediately threatens Rossi and Smith, both of whom she suspects to be part of the syndicate. Meanwhile, Keller and Roberts argue over Roberts' disappointment in his life, which Keller states is the result of giving up on his dreams. Upset, Roberts refuses to drive any further, and Keller shoots him with a rubber bullet. The two change cars, and Roberts once again becomes the reluctant driver.\n\nAfter they evade Rossi's assassins, the car fails, and they pull into a reception hall. The owners recognize them, and an elderly woman viciously attacks Roberts after accidentally shooting her husband. Roberts and Keller escape in the husband's sports car and stop for gas. There, they are again recognized and attacked, though the cashier accidentally kills himself with his own shotgun. At Keller's urging, Roberts phones the police and his wife, telling both that he has been taken hostage, though neither believe him at first. In order to heighten Roberts' fear and make him more believable, Keller puts a gun to Roberts' head and threatens to kill him. In response, Roberts briefly holds Keller at gunpoint with the elderly woman's pistol, but he surrenders it when he realizes that it is empty.\n\nResigned to his fate as the getaway driver, Roberts offers to drive Keller to his final destination, a marina. On the way, the two reconcile their differences when both admit that the other has made good points about their respective lifestyles. When Roberts antagonizes a motorcycle gang, they become hostile and threaten to kill him. Keller saves his life, and, during the confrontation, the gang reveal themselves to be mercenaries in Rossi's pay. Roberts and Keller fight them off, only to be beset by Rossi himself and more mercenaries at the marina. Meanwhile, DCI Smith confronts Agent Walker, and Walker kills Smith in self-defense.\n\nAt the marina, Roberts and Keller defeat the mercenaries, and Roberts declines a share in Keller's stolen loot. Shot and left chained by Keller, Rossi is arrested. Keller handcuffs Roberts to the car and the two argue over whether Keller should punch him to make the situation look more believable; Roberts eventually agrees. Finding him ragged, wounded, and beaten, the police finally believe Roberts' story, and he returns to his family, who now respect him. Though she disapproves, Roberts' wife acquiesces to his return to professional racing.",
  "synopsis": null
}