{
  "imdb_id": "tt2992652",
  "tmdb_id": "235425",
  "douban_id": null,
  "title": "Koan of Spring (2013)",
  "genres": [
    "Drama"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "75 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.4,
  "director": [
    {
      "id": "nm0522177",
      "name": "Marc-Olivier Louveau"
    }
  ],
  "writer": [
    {
      "id": "nm0522177",
      "name": "Marc-Olivier Louveau",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0011965",
      "name": "Jim Adhi Limas",
      "character": "Master Truong"
    },
    {
      "id": "nm5741808",
      "name": "Fang-Hsuan Chiu",
      "character": "Lan"
    },
    {
      "id": "nm0837142",
      "name": "Tapa Sudana",
      "character": "Master Wing"
    },
    {
      "id": "nm0068788",
      "name": "Châu Belle Dinh",
      "character": "Tan       (as Chau Belle)"
    },
    {
      "id": "nm0970302",
      "name": "Santi Sudaros",
      "character": "Tin"
    },
    {
      "id": "nm5741806",
      "name": "Michel Chapuis",
      "character": "Man in Black"
    },
    {
      "id": "nm4038065",
      "name": "Tenzin Kunchap",
      "character": "Idiot Man"
    },
    {
      "id": "nm2792445",
      "name": "Suzanne Lee",
      "character": "Master Wing's Wife       (as Isooji)"
    },
    {
      "id": "nm0870862",
      "name": "Jean-Claude Tran",
      "character": "Master Song"
    },
    {
      "id": "nm1560027",
      "name": "Patrick Vo",
      "character": "Gangster"
    }
  ],
  "overview": "Vietnam 1791. Old Truong, the Emperor’s Master of Arms, feels the end of his life coming. But he has yet to find a successor. The country has to be prepared for war and the Emperor is furiously impatient. He gives Master Truong two weeks to find the one. Truong sets off to visit Master Wing, a famous former General who is now living as a simple fisherman on the shores of a lake. He has three children. Truong wants to test the two sons as his potential successors and asks to see a demonstration of their fighting skill.",
  "storyline": "Love in its purest form is the mother of wisdom.",
  "plot": null,
  "synopsis": "Master Truong, the old Fearless of the emperor, is nearing the end of his life and he has not yet found his successor. The country has to be prepared for war and the Emperor is furiously impatient. He gives him two weeks to find it. Master Truong goes to visit a famous General (Master Wing) who had disappeared to become a simple fisherman. He lives with his two son (Tin and Tan) and her daughter\n(Lan, with a disfigured face) on the shores of the Lake Ba Bê. Master Truong knows very well the legend of the lake but this time he will really understand its meaning. Master Truong tells to master Wing he wants to test his two sons. People talked him a lot about their quality. Disappointed by their results, he tests also Lan. She has not a priori a high level of practice but Master Truong will choose her.\nHe has finally found the person who has all the qualities to succeed him. Unhappy, one more time, things are not so simple. MasterTruong will return to the palace without a successor but with something more precious."
}