{
  "imdb_id": "tt2937186",
  "tmdb_id": "419708",
  "douban_id": null,
  "title": "Volkswagen Joe (2013)",
  "genres": [
    "Short",
    "Drama"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "29 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.5,
  "director": [
    {
      "id": "nm3690538",
      "name": "Brian Deane"
    }
  ],
  "writer": [
    {
      "id": "nm2091308",
      "name": "Matthew Roche",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0334324",
      "name": "Stuart Graham",
      "character": "Joe"
    },
    {
      "id": "nm0602873",
      "name": "Janet Moran",
      "character": "Madge"
    },
    {
      "id": "nm5692270",
      "name": "Matthew O'Brien",
      "character": "Fitch"
    },
    {
      "id": "nm0734304",
      "name": "Paddy Rocks",
      "character": "Mac       (as Patrick Rocks)"
    },
    {
      "id": "nm4787758",
      "name": "John Delaney",
      "character": "Sam Johnson"
    },
    {
      "id": "nm0730069",
      "name": "Helen Roche",
      "character": "Joe's mother Maura"
    },
    {
      "id": "nm5464253",
      "name": "Joanne Brennan",
      "character": "Mrs. Johnson"
    },
    {
      "id": "nm10968876",
      "name": "Anne Duffy",
      "character": "Nurse"
    },
    {
      "id": "nm10968877",
      "name": "Shane O'Connor",
      "character": "UDR Soldier 1"
    },
    {
      "id": "nm9963694",
      "name": "Stuart Cullen",
      "character": "UDR Soldier 2"
    },
    {
      "id": "nm10968878",
      "name": "Matthew Lucania",
      "character": "UDR Soldier 3"
    },
    {
      "id": "nm10968879",
      "name": "Bill Manahan",
      "character": "UDR Soldier 4"
    },
    {
      "id": "nm10968880",
      "name": "Fergal McAloon",
      "character": "UDR Soldier 5       (as Fergal Mc Aloon)"
    },
    {
      "id": "nm10968881",
      "name": "Eileen McArdle",
      "character": "Distressed Mother"
    },
    {
      "id": "nm10968882",
      "name": "Peter Sexton",
      "character": "Distressed Father"
    },
    {
      "id": "nm10968883",
      "name": "Caoimhe Sexton",
      "character": "Distressed Child"
    },
    {
      "id": "nm10968884",
      "name": "Aiveen Sexton",
      "character": "Distressed Child"
    },
    {
      "id": "nm10968885",
      "name": "Vanessa Connolly",
      "character": "Distressed Child"
    },
    {
      "id": "nm10968886",
      "name": "Austin Quinn",
      "character": "Friendly Father"
    },
    {
      "id": "nm10968887",
      "name": "Iona McGoldrick",
      "character": "Friendly Mother       (as Iona Mc Goldrick)"
    },
    {
      "id": "nm10968888",
      "name": "Aiden Hanna",
      "character": "Friendly Kid"
    },
    {
      "id": "nm10968889",
      "name": "Mairead Donnell",
      "character": "Friendly Kid"
    },
    {
      "id": "nm10968890",
      "name": "Teagan Dorman",
      "character": "Friendly Kid"
    },
    {
      "id": "nm10968891",
      "name": "Jonathan Binchy",
      "character": "Tom"
    },
    {
      "id": "nm10968892",
      "name": "Emer Henry",
      "character": "Weather Woman"
    },
    {
      "id": "nm10968893",
      "name": "Dawn Steadman",
      "character": "Joan"
    },
    {
      "id": "nm4881482",
      "name": "Ray Fitzsimons",
      "character": "Bar Local 1"
    },
    {
      "id": "nm10968894",
      "name": "Noel Murphy",
      "character": "Bar Local 2"
    },
    {
      "id": "nm2557457",
      "name": "Brian McDermitt",
      "character": "Bar Local 3"
    },
    {
      "id": "nm10968895",
      "name": "Damien O'Brien",
      "character": "Bar Local 4"
    },
    {
      "id": "nm10968896",
      "name": "Ann O'Donoghue",
      "character": "Hospital Patient"
    },
    {
      "id": "nm10968897",
      "name": "Angela McNulty",
      "character": "Nurse"
    },
    {
      "id": "nm2697506",
      "name": "Geraldine McAlinden",
      "character": "Hospital Administrator"
    },
    {
      "id": "nm2694504",
      "name": "Brian O'Donovan",
      "character": "News Reporter"
    },
    {
      "id": "nm10968898",
      "name": "Benjamin Barry",
      "character": "News Anchor"
    }
  ],
  "overview": "Northern Ireland 1981 - Faced with an impossible decision, a conflicted border-town mechanic is forced to make a choice that will change his life forever.",
  "storyline": "Northern Ireland 1981 - Faced with an impossible decision, a conflicted border-town mechanic is forced to make a choice that will change his life forever.",
  "plot": "One thousand years have passed since the Seven Days of Fire, an apocalyptic war that destroyed civilization and created the vast Toxic Jungle,[Note 1] a poisonous forest swarming with giant mutant insects. In the kingdom of the Valley of the Wind, a prophecy predicts a saviour \"clothed in blue robes, descending onto a golden field, to join bonds with the great Earth and guide the people to the pure lands at last\". Nausicaä, the princess of the Valley of the Wind, explores the jungle and communicates with its creatures, including the gigantic, armored trilobite-like creatures called Ohm.[Note 2] She hopes to understand the jungle and find a way for it and humans to co-exist.\n\nOne night, during a visit by the Valley's swordsmaster Lord Yupa, a cargo aircraft from the kingdom of Tolmekia crashes in the Valley. Nausicaä tries to rescue a passenger, the wounded Princess Lastelle of Pejite, who pleads with Nausicaä to destroy the cargo before dying. The cargo is an embryo of a Giant Warrior, one of the lethal bioweapons that caused the Seven Days of Fire. The Tolmekians, a military state, seized the embryo and Lastelle from Pejite, but their plane was attacked by mutant insects and crashed. One of the insects emerges wounded from the wreckage and seems poised to attack the frightened villagers, but Nausicaä uses a small bullroarer to calm it and guides it away from the Village on her jet-powered glider.\n\nThe next morning, Tolmekian troops, led by Princess Kushana and Officer Kurotowa, kill Nausicaä's father and take the Giant Warrior embryo. Kushana plans to mature the Giant Warrior and use it to burn the Toxic Jungle. Nausicaä kills several Tolmekian soldiers before Yupa intervenes. Kushana announces her decision to leave for the Tolmekian capital with Nausicaä and five hostages from the Valley. Before they leave, Yupa discovers a secret garden of jungle plants reared by Nausicaä; according to Nausicaä's findings, plants that grow in clean soil and water are not toxic, but the jungle's soil has been tainted by humankind.\n\nAn agile Pejite interceptor shoots down the Tolmekian ship carrying Kushana and her detachment. It crash-lands in the jungle, disturbing several Ohm, which Nausicaä soothes. She leaves to rescue Asbel, the Pejite pilot and twin brother of Lastelle, but both are swallowed by quicksand and arrive in a non-toxic area below the jungle. Nausicaä realizes that the jungle plants purify the polluted topsoil, producing clean water and soil underground.\n\nNausicaä and Asbel return to Pejite but find the capital ravaged by insects. A band of surviving Pejites reveal that they lured the creatures to eradicate the Tolmekians, and are doing the same in the Valley to recapture the Giant Warrior. They capture Nausicaä, but with the help of Asbel and his mother, Nausicaä escapes on a glider. While flying home, she finds a team of Pejite soldiers using a wounded baby Ohm to lead a furious herd of thousands of Ohm into the Valley. The Tolmekians deploy tanks and later the Giant Warrior against the herd, but their tanks' firepower cannot stop the Ohm, and the Giant Warrior, hatched prematurely, disintegrates.\n\nNausicaä liberates the baby Ohm and gains its trust. Her dress stained by its blue blood, she and the baby Ohm stand before the raging herd and are both run over, seemingly killing Nausicaä. The herd calms, and the Ohm use their golden tentacles to resuscitate her. She walks atop the hundreds of golden Ohm tentacles as through golden fields, revealing Nausicaä to be the saviour from the prophecy. The Ohm and Tolmekians leave the Valley and the Pejites remain with the Valley people, helping them to rebuild. Meanwhile, deep underneath the Toxic Jungle, a new non-toxic tree sprouts next to Nausicaä's lost aviation goggles.",
  "synopsis": null
}