{
  "imdb_id": "tt2937898",
  "tmdb_id": "241239",
  "douban_id": null,
  "title": "A Most Violent Year (2014)",
  "genres": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "country": "United Arab Emirates",
  "version": [
    {
      "runtime": "125 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.0,
  "director": [
    {
      "id": "nm1170855",
      "name": "J.C. Chandor"
    }
  ],
  "writer": [
    {
      "id": "nm1170855",
      "name": "J.C. Chandor",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm1209966",
      "name": "Oscar Isaac",
      "character": "Abel Morales"
    },
    {
      "id": "nm1175468",
      "name": "Elyes Gabel",
      "character": "Julian"
    },
    {
      "id": "nm1567113",
      "name": "Jessica Chastain",
      "character": "Anna Morales"
    },
    {
      "id": "nm2990001",
      "name": "Lorna Pruce",
      "character": "Toll Booth Attendant"
    },
    {
      "id": "nm3571592",
      "name": "Christopher Abbott",
      "character": "Louis Servidio"
    },
    {
      "id": "nm0536866",
      "name": "Matthew Maher",
      "character": "John Dominczyk"
    },
    {
      "id": "nm0000983",
      "name": "Albert Brooks",
      "character": "Andrew Walsh"
    },
    {
      "id": "nm0012178",
      "name": "Jerry Adler",
      "character": "Joseph Mendelsohn"
    },
    {
      "id": "nm0583609",
      "name": "Quinn Meyers",
      "character": "Moishe Mendelsohn"
    },
    {
      "id": "nm1734779",
      "name": "Chester Jones III",
      "character": "Beat Cop       (as Chester Jones)"
    },
    {
      "id": "nm0654648",
      "name": "David Oyelowo",
      "character": "D.A. Lawrence"
    },
    {
      "id": "nm0930053",
      "name": "Ashley Williams",
      "character": "Deputy Lange"
    },
    {
      "id": "nm0281909",
      "name": "Glenn Fleshler",
      "character": "Arnold Kline"
    },
    {
      "id": "nm0658861",
      "name": "Jimmy Palumbo",
      "character": "Barber Jimmy O."
    },
    {
      "id": "nm2394093",
      "name": "Daisy Tahan",
      "character": "Annie Morales"
    },
    {
      "id": "nm5765254",
      "name": "Taylor Richardson",
      "character": "Elizabeth Morales"
    },
    {
      "id": "nm5338034",
      "name": "Giselle Eisenberg",
      "character": "Catherine Morales"
    },
    {
      "id": "nm7163943",
      "name": "Tanner",
      "character": "Muffin"
    },
    {
      "id": "nm4471175",
      "name": "Phillip Chi",
      "character": "Burglar"
    },
    {
      "id": "nm0106755",
      "name": "Patrick Breen",
      "character": "Instructor"
    },
    {
      "id": "nm4101208",
      "name": "Ben Rosenfield",
      "character": "Sales Student Alex"
    },
    {
      "id": "nm6228820",
      "name": "Nick Bailey",
      "character": "Sales Recruit #2"
    },
    {
      "id": "nm4039160",
      "name": "Jenilyn Rodriguez",
      "character": "Sales Recruit #3"
    },
    {
      "id": "nm1073204",
      "name": "Linda Marie Larson",
      "character": "Abel's Secretary Debbie"
    },
    {
      "id": "nm0314253",
      "name": "Peter Gerety",
      "character": "Bill O'Leary"
    },
    {
      "id": "nm0005273",
      "name": "Alessandro Nivola",
      "character": "Peter Forente"
    },
    {
      "id": "nm0698275",
      "name": "John Procaccino",
      "character": "Arnold Lewis"
    },
    {
      "id": "nm4170268",
      "name": "Jason Ralph",
      "character": "Ian Thompson"
    },
    {
      "id": "nm1495320",
      "name": "Stephen Reich",
      "character": "Waiter"
    },
    {
      "id": "nm0127582",
      "name": "Myrna Cabello",
      "character": "Nanny Maria"
    },
    {
      "id": "nm0429196",
      "name": "Russell G. Jones",
      "character": "Cop #1       (as Russell G. Jones)"
    },
    {
      "id": "nm0223249",
      "name": "Nat DeWolf",
      "character": "Officer"
    },
    {
      "id": "nm0555500",
      "name": "Elizabeth Marvel",
      "character": "Mrs. Rose"
    },
    {
      "id": "nm0167024",
      "name": "Robert Clohessy",
      "character": "Mr. Rose"
    },
    {
      "id": "nm1503432",
      "name": "Catalina Sandino Moreno",
      "character": "Luisa"
    },
    {
      "id": "nm0546868",
      "name": "David Margulies",
      "character": "Saul Lefkowitz"
    },
    {
      "id": "nm6217203",
      "name": "Annie Funke",
      "character": "Lorraine Lefkowitz"
    },
    {
      "id": "nm0236410",
      "name": "Kathleen Doyle",
      "character": "Lefkowitz Receptionist"
    },
    {
      "id": "nm3754278",
      "name": "Pico Alexander",
      "character": "Elias Morales"
    },
    {
      "id": "nm0384771",
      "name": "William Hill",
      "character": "Eddy Driver"
    },
    {
      "id": "nm2044308",
      "name": "Suzanne Cerreta",
      "character": "Dispatcher Kathy"
    },
    {
      "id": "nm0136555",
      "name": "Chris Cardona",
      "character": "Driver 1"
    },
    {
      "id": "nm5574459",
      "name": "John Dinello",
      "character": "Driver 2"
    },
    {
      "id": "nm0173335",
      "name": "Teddy Coluca",
      "character": "Driver 3"
    },
    {
      "id": "nm0085959",
      "name": "Susan Blackwell",
      "character": "Female Radio Reporter"
    },
    {
      "id": "nm1479034",
      "name": "John Douglas Thompson",
      "character": "Male Radio Reporter"
    },
    {
      "id": "nm1563373",
      "name": "Teddy Cañez",
      "character": "Contractor       (scenes deleted)"
    },
    {
      "id": "nm6949743",
      "name": "Tommy Florio",
      "character": "Football Player"
    }
  ],
  "overview": "A thriller set in New York City during the winter of 1981, statistically one of the most violent years in the city's history, and centered on a the lives of an immigrant and his family trying to expand their business and capitalize on opportunities as the rampant violence, decay, and corruption of the day drag them in and threaten to destroy all they have built.",
  "storyline": "A crime drama set in New York City during the winter of 1981, statistically one of the most violent years in the city's history, and centered on the lives of an immigrant and his family trying to expand their business and capitalize on opportunities as the rampant violence, decay, and corruption of the day drag them in and threaten to destroy all they have built.",
  "plot": "In 1981 New York, Abel Morales (Oscar Isaac) is the owner of an up-and-coming company which has suffered the hijacking of several trucks, each carrying heating-oil worth thousands of dollars. One driver, Julian (Elyes Gabel), is severely beaten when his oil truck is hijacked by two unknown assailants. Abel's wife, Anna Morales (Jessica Chastain), beseeches Abel to fight violence with violence, but Abel refuses. Morales and his company are under investigation by Assistant District Attorney Lawrence (David Oyelowo), who seems determined to expose price fixing, tax evasion, and various other illegalities committed by Morales and his competitors in the heating oil business.\n\nAs a way to secure financial independence for himself and trump his competitors, Abel, with the help of his attorney, Andrew Walsh (Albert Brooks), brokers a deal with a group of Jewish Chassidim, led by Josef Mendellsohn (Jerry Adler), to purchase a fuel oil terminal on the East River. This will allow Morales' company to directly import fuel oil from barges and to store far more oil in the summertime when fuel oil prices are lower. He places a large down payment of 40% on the property with the agreement that he will close in 30 days—if he fails to do so, the Chassidim will sell the terminal to one of Morales' competitors and keep the down payment.\n\nAfter moving into a new home, Morales prevents what appears to be an attempted burglary, but the next day one of his daughters finds a loaded handgun dropped in the bushes by the perpetrator. Suspecting this intimidation is coming from his competitors, he begins to confront them one by one; each one denies any intimidation and theft to drive him out of business. The head of the Teamsters encourages Morales to arm his drivers with handguns and fake permits that he can secure for him. Morales refuses, believing that such a move could bring down even more heat on his operation from the authorities and potentially ruin his legitimate business connections with a bank financing his business.\n\nReturning to work after weeks of rehabilitation, Julian is again accosted by criminals, this time on the Queensboro Bridge in broad daylight. Carrying a firearm without Abel's knowledge or permission, he engages in a shootout with the hijackers, which results in the police arriving and chasing Julian and the other assailants, who all escape. This incident once again shifts Morales and his company into the spotlight of not only ADA Lawrence, but also the bank, which informs him that due to the impending criminal indictments and this unfortunate public incident, it can no longer finance his purchase of the terminal.\n\nDesperate, and needing $1.5 million to close on the property, he approaches his competition, Saul Leftkowitz and his granddaughter, who agree to give him a $500,000 loan for 20% interest and equity in the company for the term of the agreement. He manages to scrounge up another $200,000 by taking out a mortgage loan against an apartment building that he and his younger brother own together. With time winding down quickly, he intercepts a radio call for help from one of his drivers, who states his truck is being hijacked. Being nearby, he pursues the stolen truck. Eventually catching up to and attacking one of the hijackers, Morales demands to know who the mastermind is. The hijacker denies he was hired by anyone but reveals that he sold his last stolen shipment in Far Rockaway. Morales confronts one of his competitors, who has facilities in Far Rockaway, threatening to alert the federal authorities as the stolen fuel is marked. The competitor agrees to pay Morales more than $200,000 for stolen fuel oil.\n\nAs Morales is getting closer to his $1.5 million goal, he visits mafia-affiliated Peter Forente (Alessandro Nivola) to ask for another $600,000. Forente agrees to give Morales the loan, but on very unfavorable terms. Dismayed by having to leverage his company to such a high degree in order to secure the loan, Morales begins to inform his wife, only to learn she has been \"skimming\" from the company for years and has been hiding the money, which is sufficient to cover the amount of money that Forente had agreed to lend, in a secret account.\n\nHaving the money he now needs, Morales and Walsh pay off his creditors and secure the terminal. As Abel, Anna, and Walsh are looking over the property, they are approached by an angry Julian carrying a gun, who blames Morales for his problems, believing that he should also be entitled to some of Morales' good fortune. Despondent by his being a wanted man, Julian commits suicide in front of Abel, Anna, and Walsh. As the police show up with ADA Lawrence to investigate the suicide, Morales expresses that the broader investigations into his firm are hurting his business, and that they should find a conclusion at some point. Lawrence agrees in general terms and suggests that this new fuel oil terminal will propel Morales' business and give him \"political influence.\" Lawrence then suggests that Morales might be able to help him with his higher aspirations. Morales claims that he has always done \"the most right thing\".",
  "synopsis": "Abel Morales is a businessman who tries to do everything honestly. He has been building his business of fuel distribution to quite a big position. He now lands a deal to purchase a bay-front storage facility that will increase the business greatly. But this deal has a risky clause which states that if Abel fails to pay the rest of the due payment, the facility and the deposit will be gone. His trucks have been targeted by robbers from the last few months, which scared his drivers. He even gets an intimidation visit by burglars. Additionally, the DA wants to charges the business with felony counts. His wife suddenly reveals a gun she purchases for her protection, of which he strongly disagrees. Despite his disapproval, Abels drivers arm themselves with guns but lack the permit for them. When another heist occurs and one of his driver fires shots, Abel has to go himself and find the missing driver to turn him to the police. The driver Julian is found, but he ran away when hes about to be turned in. Abel goes every where to get loans as the closure time nears.From one of his competitors the Lefkowicz, Abel gets a deal for 500 thousand dollars or the 1.5 millions he needs. The facility owner grants him an extra three day time, in which he uses to see his brother to ask him to mortgage his apartment to help Abel. He also convenes all his other surrounding competitors saying that he knows at least one of them is in league with his trucks hijackers. On his way home he accidentally finds one of his trucks being hijacked. He follows the truck through a chase. After capturing the robber he finds that one of his competitors has been buying the stolen fuel. When the money needed is only 600 thousand more, he runs out of time. But his wife suddenly pulls out a bank account with enough cash in it. To his surprise, his wife has been skimming money from the company all this time. Finally he decides to use the money and completes the deal. Julian comes to the facility; angry thinking that he gets nothing while Abel gets everything. Abel convinces him theres a second chance, but he commit suicide then and there. Abel then asks for a deal with the visiting DA for his business."
}