{
  "imdb_id": "tt3083006",
  "tmdb_id": "232078",
  "douban_id": null,
  "title": "Triple Crossed (2013)",
  "genres": [
    "Mystery",
    "Romance",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "99 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm1851320",
      "name": "Sean Paul Lockhart"
    }
  ],
  "writer": [
    {
      "id": "nm2316658",
      "name": "Linda Andersson",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm5823200",
      "name": "Jack Brockett",
      "character": "Chris"
    },
    {
      "id": "nm1851320",
      "name": "Sean Paul Lockhart",
      "character": "Andrew"
    },
    {
      "id": "nm2336466",
      "name": "Laura Reilly",
      "character": "Jackie Townsend"
    },
    {
      "id": "nm2421475",
      "name": "Tellier Killaby",
      "character": "Kendra"
    },
    {
      "id": "nm4059812",
      "name": "Addison Graham",
      "character": "Tyler"
    },
    {
      "id": "nm4847743",
      "name": "Ashley Ahn",
      "character": "Bartender"
    },
    {
      "id": "nm5490721",
      "name": "Ward Bodner",
      "character": "Man Hitting Car Window"
    },
    {
      "id": "nm2238797",
      "name": "Matthew Campbell",
      "character": "Tanner"
    },
    {
      "id": "nm2332434",
      "name": "Joshua Dinner",
      "character": "Bar Patron"
    },
    {
      "id": "nm1616869",
      "name": "Jude B. Lanston",
      "character": "MP Officer       (as Jude Lanston)"
    },
    {
      "id": "nm5850793",
      "name": "Ryan Massey",
      "character": "Derek"
    },
    {
      "id": "nm4209685",
      "name": "Steven Tylor O'Connor",
      "character": "Drug Dealer"
    },
    {
      "id": "nm3757015",
      "name": "Chad Siwik",
      "character": "Himself"
    },
    {
      "id": "nm5884184",
      "name": "Tammy Tolene",
      "character": "Girlfriend in car"
    },
    {
      "id": "nm5850795",
      "name": "Cory Tyndall",
      "character": "Bar Patron"
    },
    {
      "id": "nm1432654",
      "name": "Steven Vasquez",
      "character": "Bar Patron"
    },
    {
      "id": "nm3385079",
      "name": "Jill Zimmer",
      "character": "Waitress"
    }
  ],
  "overview": "With a tour in Afghanistan behind him, war-torn Chris Jensen struggles to assimilate back to life in California. Drifting and living out of his car, he soon discovers that few are willing to deal with the remnants of a damaged career military man. Chris is self medicating; desperate to silence the echoes from the front lines. When an opportunity finally presents itself, he makes the hard decision to employ his most coveted talents honed in special ops. A job is a job and Chris knows civilian life can be just as cut-throat as time on active duty. But just how close does he have to get to Andrew Warner to secure the kill?",
  "storyline": "A man is out to kill a person he swore on his best friend's death bed to protect. CHRIS JENSEN is torn between his allegiance to his fallen friend, TYLER TOWNSEND, who died in Afghanistan and Tyler's half sister who hires Chris to kill her late brother's gay lover. The lover, ANDREW WARNER, stands to inherit half of the families multi- million dollar company left to him by Tyler. Tyler's half sister JACKIE TONWSEND has other plans for the young and unassuming Andrew. All goes to plan even though Chris has fallen in love with the young Andrew. Andrew grows suspicious, the plan is reveled and it's every man and woman for themselves. A fortune will go to the last one standing.",
  "plot": "A man is out to kill a person he swore on his best friend's death bed to protect. Chris Jensen (Jack Brockett) is torn between his allegiance to his fallen friend, Tyler Townsend (Addison Graham), who died in Afghanistan and Tyler's half sister who hires Chris to kill her late brother's gay lover. The lover, Andrew Warner (Sean Paul Lockhart), stands to inherit half of the family's multi-million dollar company left to him by Tyler. Tyler's half sister Jackie Townsend (Laura Reilly) has other plans for the young and unassuming Andrew. All goes to plan even though Chris has fallen in love with the young Andrew. Andrew grows suspicious, the plan is revealed and it's every man and woman for themselves. A fortune will go to the last one standing.",
  "synopsis": "A man is out to kill a person he swore on his best friend's death bed to protect. CHRIS JENSEN is torn between his allegiance to his fallen friend, TYLER TOWNSEND, who died in Afghanistan and Tyler's half sister who hires Chris to kill her late brother's gay lover. The lover, ANDREW WARNER, stands to inherit half of the family's multi-million dollar company left to him by Tyler. Tyler's half sister JACKIE TOWNSEND has other plans for the young and unassuming Andrew. All goes to plan even though Chris has fallen in love with the young Andrew. Andrew grows suspicious, the plan is revealed and it's every man and woman for themselves. A fortune will go to the last one standing"
}