{
  "imdb_id": "tt3063996",
  "tmdb_id": "264905",
  "douban_id": null,
  "title": "Judge! (2014)",
  "genres": [
    "Comedy"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "105 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm0619073",
      "name": "Akira Nagai"
    }
  ],
  "writer": [
    {
      "id": "nm3533750",
      "name": "Yoshimitsu Sawamoto",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm1070494",
      "name": "Satoshi Tsumabuki",
      "character": "Kiichiro Ota"
    },
    {
      "id": "nm1487136",
      "name": "Keiko Kitagawa",
      "character": "Hikari Ota"
    },
    {
      "id": "nm0870317",
      "name": "Etsushi Toyokawa",
      "character": "Ichiro Otaki"
    },
    {
      "id": "nm0840624",
      "name": "Kyôka Suzuki",
      "character": "Haruka Kizawa"
    },
    {
      "id": "nm1410940",
      "name": "Lily Franky",
      "character": "Kagami       (as Lily Frankie)"
    },
    {
      "id": "nm3309563",
      "name": "Chad Mullane",
      "character": "Alex Moylan"
    },
    {
      "id": "nm1188493",
      "name": "Yoshiyoshi Arakawa",
      "character": ""
    },
    {
      "id": "nm2320634",
      "name": "Tokio Emoto",
      "character": ""
    },
    {
      "id": "nm0411683",
      "name": "Ayumi Itô",
      "character": "Mariko"
    },
    {
      "id": "nm0847562",
      "name": "Naoto Takenaka",
      "character": ""
    },
    {
      "id": "nm0012886",
      "name": "Morio Agata",
      "character": ""
    },
    {
      "id": "nm8658321",
      "name": "Erik Brown",
      "character": "MC Announcer"
    },
    {
      "id": "nm0122703",
      "name": "James C. Burns",
      "character": "Chairman Jack"
    },
    {
      "id": "nm0218942",
      "name": "Denden",
      "character": ""
    },
    {
      "id": "nm0298020",
      "name": "Seizô Fukumoto",
      "character": ""
    },
    {
      "id": "nm8506125",
      "name": "Russell Goodall",
      "character": "Gaijin Ad agent"
    },
    {
      "id": "nm2323311",
      "name": "Kenta Hamano",
      "character": ""
    },
    {
      "id": "nm4114764",
      "name": "Hyunri",
      "character": "Harada"
    },
    {
      "id": "nm1076976",
      "name": "Ryo Kase",
      "character": "(as Ryô Kase)"
    },
    {
      "id": "nm0443559",
      "name": "Morio Kazama",
      "character": ""
    },
    {
      "id": "nm1221055",
      "name": "Yûichi Kimura",
      "character": ""
    },
    {
      "id": "nm1443758",
      "name": "Iyo Matsumoto",
      "character": ""
    },
    {
      "id": "nm3456462",
      "name": "Eiko Ohtani",
      "character": ""
    },
    {
      "id": "nm2296228",
      "name": "Ana Tuazon Parsons",
      "character": "Ichiban commercial girl       (as Ana Parsons)"
    },
    {
      "id": "nm0793329",
      "name": "Kôtarô Shiga",
      "character": ""
    },
    {
      "id": "nm3810205",
      "name": "Stuart-O.",
      "character": ""
    },
    {
      "id": "nm7215045",
      "name": "Camilla Ståhl",
      "character": "Camilla Olsen"
    },
    {
      "id": "nm1025366",
      "name": "Tetsuji Tamayama",
      "character": ""
    },
    {
      "id": "nm0849093",
      "name": "Yôji Tanaka",
      "character": ""
    },
    {
      "id": "nm4489338",
      "name": "Paul Tripcony",
      "character": "Sleeping Man"
    }
  ],
  "overview": "A major advertising festival is held each year to determine the best television commercial in the world. A rookie ad man at a big advertising company named Otan is selected as a judge on the festival jury. Meanwhile, a coworker also named Ota (although the Japanese characters are slightly different) poses as his wife so that he can attend an open party which is held nightly. Knowing that he’ll get fired if his company doesn’t win the Grand Prix, he’s forced to resort to a variety of desperate tactics.",
  "storyline": "After taking the blame for another disastrous advertising campaign, Ota Kiichiro is asked by his arrogant boss Otaki Ichiro to take his place as a judge at the world's biggest advertising competition in Los Angeles.",
  "plot": "Hank Palmer (Robert Downey Jr.) is a successful defense attorney in Chicago who has been estranged from his family in a small town in Indiana for some time. While in court, he receives a call telling him his mother has died. As he leaves to fly to his hometown of Carlinville, it is revealed that Hank is going through a divorce and custody battle for his young daughter.\n\nIn Carlinville, Hank reunites with his older brother Glen (Vincent D'Onofrio), owner of a tire shop, and his younger brother Dale (Jeremy Strong), an autistic aspiring filmmaker who carries an old 8mm film camera everywhere he goes. Hank then stops by the small county courthouse, softly enters a courtroom, and sits in the back where he observes a case in progress. The judge is Joseph Palmer (Robert Duvall), Hank's father. When Joseph sees Hank for the first time in many years, at the funeral, he is treating guests with kindness but acknowledges his son coldly.\n\nThe next morning, Hank notices damage to his father's Cadillac Coupe DeVille as he is preparing to leave. Upon seeing the damage, Joseph denies knowing how it happened; but Hank believes his father was drinking and driving and damaged his own car. After a heated exchange, Hank leaves, promising never to return. But after boarding his plane, Hank learns that Joseph is being questioned by police with regard to a fatal hit and run. The victim is identified as Mark Blackwell (Mark Kiely), a recently released convicted murderer whose crimes, before the killing, Joseph had treated with leniency.\n\nAfter Blackwell's blood is found on the car, Joseph is soon indicted, with prosecutor Dwight Dickham (Billy Bob Thornton) seeking a conviction for first-degree murder. Hank agrees to defend Joseph and learns that his father was undergoing chemotherapy. This explains Joseph's inability to remember the accident and provides a potential diminished capacity defense, but Joseph rejects any such defense because of the potential damage it would do to his legacy. During the trial Hank and Joseph confront their bitterness with each other, dating back to a teenage drunk driving accident in which Hank was driving and Glen was injured – ending the latter's potential for a career in professional baseball. Joseph saw to it that Hank was sent to a youth detention center, and Hank left Carlinville after never receiving acknowledgement from Joseph for turning his life around.\n\nHank also reconnects with his old girlfriend Sam (Vera Farmiga), whom he abandoned after going to a Metallica concert more than 20 years ago. He discovers that Sam has a daughter, Carla (Leighton Meester), born nine months after he left, and deals with his concern that he is Carla's father.\n\nAt trial, Hank believes he has established enough reasonable doubt in the case to result in an acquittal. But Joseph sabotages the case by testifying that although he still cannot remember the accident, he has come to believe that he probably did kill Blackwell intentionally. Joseph confesses on the stand that he was personally haunted by Blackwell's case, having seen Hank in Blackwell, and wanting to help him like he would his son. Having misread Blackwell, Joseph afterward saw him in Hank.\n\nJoseph is acquitted of murder but convicted of voluntary manslaughter and sentenced to four years in prison, though he is released on compassionate parole after seven months, his cancer being terminal. He and Hank go fishing. After acknowledging Hank as the best lawyer he knows, Joseph dies peacefully in the boat. Hank, having made peace with his father, returns to the courtroom Joseph once reigned over, and spins the judges chair, where it ominously stops, pointed at him.",
  "synopsis": null
}