{
  "imdb_id": "tt3039362",
  "tmdb_id": "275300",
  "douban_id": null,
  "title": "Manja Pai (2014)",
  "genres": [
    "Action",
    "Comedy",
    "Drama"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "130 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm5787580",
      "name": "Raghavan"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm2156989",
      "name": "Vimal",
      "character": "Tamil"
    },
    {
      "id": "nm5068044",
      "name": "Lakshmi Menon",
      "character": "Karthika Menon"
    },
    {
      "id": "nm4363856",
      "name": "Raj Kiran",
      "character": "Venkatasamy"
    },
    {
      "id": "nm5180821",
      "name": "Ashwin Raja",
      "character": ""
    },
    {
      "id": "nm6648618",
      "name": "Kadhal Saravanan",
      "character": "Plumber"
    },
    {
      "id": "nm6648619",
      "name": "L.M.M. Swaminathan",
      "character": ""
    },
    {
      "id": "nm6541857",
      "name": "Yuvina",
      "character": "Little Girl"
    },
    {
      "id": "nm6648620",
      "name": "Kanthasamy",
      "character": ""
    },
    {
      "id": "nm6648621",
      "name": "Ravi",
      "character": ""
    },
    {
      "id": "nm6648622",
      "name": "Soori",
      "character": ""
    },
    {
      "id": "nm6648623",
      "name": "Srithar",
      "character": ""
    },
    {
      "id": "nm6648624",
      "name": "Ramesh",
      "character": ""
    },
    {
      "id": "nm6648625",
      "name": "Master Mohit",
      "character": ""
    },
    {
      "id": "nm6648626",
      "name": "Vinitha",
      "character": ""
    },
    {
      "id": "nm6648627",
      "name": "Lakshmi",
      "character": ""
    },
    {
      "id": "nm6648628",
      "name": "Anju",
      "character": ""
    },
    {
      "id": "nm6648629",
      "name": "Viji",
      "character": ""
    },
    {
      "id": "nm6648630",
      "name": "Asha",
      "character": ""
    },
    {
      "id": "nm6648631",
      "name": "Kumaravel",
      "character": ""
    },
    {
      "id": "nm6648632",
      "name": "Karthik",
      "character": ""
    },
    {
      "id": "nm6648633",
      "name": "Julie Bhaskar",
      "character": ""
    },
    {
      "id": "nm6648634",
      "name": "Yogesh",
      "character": ""
    },
    {
      "id": "nm6648635",
      "name": "Surekha",
      "character": ""
    },
    {
      "id": "nm6648636",
      "name": "Swetha Krishnan",
      "character": ""
    },
    {
      "id": "nm3383362",
      "name": "Priya",
      "character": ""
    },
    {
      "id": "nm6648638",
      "name": "Jeenath",
      "character": ""
    },
    {
      "id": "nm6648639",
      "name": "Shanthi",
      "character": ""
    },
    {
      "id": "nm6648640",
      "name": "Vijaya",
      "character": ""
    },
    {
      "id": "nm6648641",
      "name": "Lalitha",
      "character": ""
    },
    {
      "id": "nm6648642",
      "name": "Thangadurai",
      "character": ""
    },
    {
      "id": "nm6648643",
      "name": "Sekhar",
      "character": ""
    },
    {
      "id": "nm6648644",
      "name": "Raghavendra",
      "character": ""
    },
    {
      "id": "nm6648645",
      "name": "Suresh",
      "character": ""
    },
    {
      "id": "nm6648646",
      "name": "Aravind",
      "character": ""
    },
    {
      "id": "nm6648647",
      "name": "Neil Anand",
      "character": ""
    },
    {
      "id": "nm6648648",
      "name": "L. Sathya",
      "character": ""
    },
    {
      "id": "nm6648649",
      "name": "Auto Ramesh",
      "character": ""
    },
    {
      "id": "nm6648650",
      "name": "S. Nagaraj",
      "character": ""
    },
    {
      "id": "nm6648651",
      "name": "A.R. Mohan",
      "character": ""
    },
    {
      "id": "nm6648652",
      "name": "Anand",
      "character": ""
    },
    {
      "id": "nm6648653",
      "name": "Raju",
      "character": ""
    },
    {
      "id": "nm6648654",
      "name": "Pamani",
      "character": ""
    },
    {
      "id": "nm6648655",
      "name": "V. Karthik",
      "character": ""
    },
    {
      "id": "nm6648656",
      "name": "Pandiyan",
      "character": ""
    },
    {
      "id": "nm6648657",
      "name": "Mahalingam",
      "character": ""
    },
    {
      "id": "nm6648658",
      "name": "Ajay",
      "character": ""
    },
    {
      "id": "nm6648659",
      "name": "Ravichandran",
      "character": ""
    },
    {
      "id": "nm6648660",
      "name": "R. Karthik",
      "character": ""
    },
    {
      "id": "nm6648661",
      "name": "P.S. Vinothraj",
      "character": ""
    },
    {
      "id": "nm6648662",
      "name": "S.S.B. Saravanan",
      "character": ""
    },
    {
      "id": "nm6648663",
      "name": "Prathap Rajan",
      "character": ""
    }
  ],
  "overview": "Venkatasamy (Raj Kiran), a helpful villager, comes to the city to spend time with his grandson Tamizh (Vimal), an IT professional whose dream is to settle in the US. Venkatasamy's straight talk and rural practices initially earn him the enmity of Tamizh's neighbors and girlfriend, Karthika (Lakshmi Menon). Eventually, things begin to change and he begins to win hearts. But by the time the city folks realize his value, tragedy strikes...",
  "storyline": "Tamil (Vimal) was raised by his grandfather (Raj Kiran) single handedly in a village and 25 years later the boy is working in an IT company, Chennai staying in an upmarket posh apartment. Tamil meets Karthika( Lakshmi Menon) a medical student at a traffic signal and it is love-at-first-sight for him. He follows her and in no time she reciprocates. Tamil is now selected to go to US in three months and he brings his grandfather to the city to spend quality time before he leaves. The rest of the film is how the old man with a heart of gold creates havoc and nuisance in the life of Tamil, residents of the residential apartment and even in the American consulate!",
  "plot": "The film starts with Tamil (Vimal) who is raised single-handedly by his grandfather, Venkatasamy(Raj Kiran) in a village, as his parents had committed suicide after eloping and giving birth to him. 25 years later the boy is working in a Chennai-based IT company, staying in a modern upmarket apartment. Tamil meets Karthika (Lakshmi Menon) a medical student using tricks to get to the front of the traffic signal. They fall in love at first sight, and end up being so engrossed in each other that they don't realise that the signal had gone green. The way Karthika tricks the police officer and gets away with it endears Tamil to Karthika. He follows her and in no time she reciprocates.\n\nMeanwhile, at work, Tamil is selected to go to US in three-month project and he brings Venkatasamy to the city to spend quality time before he leaves for US. Venkatasamy, coming from a rustic background, is unfamiliar with the urban lifestyle of people in a modern city.\n\nHe even bathes and washes his clothes at a fountain causing much embarrassment to Tamil which he does not share with Venkatasamy. He causes further hardship by disturbing Tamil during his date with Karthika, causing a breakup between them. Venkatasamy infuriates Tamil further by slapping Karthika's father, an Inspector of Police, for allowing his daughter wear short clothes in public. Tamil pleads with Karthika and finally she forgives him.\n\nTamil spends many a sleepless night working on a project on his laptop. Venkatasamy assumes the laptop to be a sandwich grill and without knowing how to use it, he puts it on the stove causing the laptop to explode into pieces, thus destroying the project work. Tamil gets fired from his job resultantly but he hides his anger and frustration from Venkatasamy.\n\nKarthika motivates Tamil to complete the project on her computer. The old man feels really guilty of destroying the laptop, and buys him a new one by selling his ancestral and invaluable wedding ring. Tamil thanks his grandfather and starts working on the project. He successfully finishes the project and gets his job back.\n\nMeanwhile, the old man helps a couple elope and get them married the same way he did with Tamil's parents. While Tamil is leaving to attend an interview to go to the US, Venkatasamy mocks the US flag at the US consulate and thinks that the whites are conquering India again. He creates nuisance and both of them are arrested. When they come out of the station, Tamil goes for a second interview but his Visa gets rejected and scolds his grandfather amidst a large crowd in public.\n\nPooja (Darshini) a girl thinks that a piece of sweet laced with rat poison is the sweet that the old man gave her and faints after eating it. She was brought to the hospital and the old man was scolded in public for the second time by the girl's parents. However, they discover that the girl is cured thanks to the mixture of salt and tamarind water Venkatasamy gave Pooja before she was taken to the hospital, helping her to nauseate and get rid of ingested poison in the body.\n\nWhen everyone wants to apologise and thank the old man, he goes missing and everyone starts to search for him. The old man is finally located but in a mentally challenged state. The film ends with Tamil regretting scolding his grandfather and crying while hugging him tightly.",
  "synopsis": null
}