{
  "imdb_id": "tt3070922",
  "tmdb_id": "394048",
  "douban_id": null,
  "title": "The Rally",
  "genres": [
    "Drama"
  ],
  "country": "USA",
  "version": [],
  "imdb_rating": 8.4,
  "director": [
    {
      "id": "nm4041410",
      "name": "Rick Reyna"
    }
  ],
  "writer": [
    {
      "id": "nm4041410",
      "name": "Rick Reyna",
      "description": null
    },
    {
      "id": "nm4041617",
      "name": "Eddie Richard",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0178627",
      "name": "Kenneth Copeland",
      "character": "Sarka"
    },
    {
      "id": "nm0000616",
      "name": "Eric Roberts",
      "character": "Santiago"
    },
    {
      "id": "nm0379714",
      "name": "Sophia Adella Luke",
      "character": "Sally"
    },
    {
      "id": "nm4041410",
      "name": "Rick Reyna",
      "character": "Rick"
    },
    {
      "id": "nm3561217",
      "name": "Todd James Jackson",
      "character": "Marcos"
    },
    {
      "id": "nm4169563",
      "name": "Destanie Reyna",
      "character": "Kris /              Christina"
    },
    {
      "id": "nm2905414",
      "name": "Sharon Garrison",
      "character": "Miss Betty"
    },
    {
      "id": "nm3169162",
      "name": "George Pearsons",
      "character": "Pastor Mike"
    },
    {
      "id": "nm2654198",
      "name": "Hayden Blane",
      "character": "April       (as Hayden Wyatt)"
    },
    {
      "id": "nm5255866",
      "name": "Jon-Paul Vertuccio",
      "character": "Franky"
    },
    {
      "id": "nm0852180",
      "name": "Curtis Taylor",
      "character": "Paul Mitchell"
    },
    {
      "id": "nm3093760",
      "name": "Ed Morrone",
      "character": "Luis"
    },
    {
      "id": "nm5401929",
      "name": "Lauren Elyse Buckley",
      "character": "Leti"
    },
    {
      "id": "nm3922068",
      "name": "Alexis Codding",
      "character": "Kate"
    },
    {
      "id": "nm4684116",
      "name": "Cathy Lynn Yonek",
      "character": "City Worker"
    },
    {
      "id": "nm5379945",
      "name": "Wayne K. Woods",
      "character": "Robert"
    },
    {
      "id": "nm1391796",
      "name": "Nick Stellate",
      "character": "Shrewd Official"
    },
    {
      "id": "nm0304483",
      "name": "Peter Gannon",
      "character": "Heavy Official"
    },
    {
      "id": "nm0804035",
      "name": "Stewart Skelton",
      "character": "Jack"
    },
    {
      "id": "nm4170558",
      "name": "Nettie Reyna",
      "character": "Nettie"
    },
    {
      "id": "nm4199683",
      "name": "Liz Randall",
      "character": "Mrs. Parks"
    },
    {
      "id": "nm5818514",
      "name": "Branden Brim",
      "character": "Jake"
    },
    {
      "id": "nm0675076",
      "name": "Gavin Perry",
      "character": "Mr. Phillips"
    },
    {
      "id": "nm4873859",
      "name": "Lloren Zeigler",
      "character": "Sarah"
    },
    {
      "id": "nm4713031",
      "name": "Cassandra Nuss",
      "character": "Hotel Operator"
    },
    {
      "id": "nm1272862",
      "name": "Reba Toney",
      "character": "Waitress"
    },
    {
      "id": "nm1247364",
      "name": "Dan Hewitt Owens",
      "character": "Foreman Joe"
    },
    {
      "id": "nm5626522",
      "name": "Tommy Spaulding",
      "character": "Young Boy"
    },
    {
      "id": "nm4377242",
      "name": "Charla Bocchicchio",
      "character": "Mom       (as Charla Cochran)"
    },
    {
      "id": "nm3801086",
      "name": "Mantha Balourdou",
      "character": "Prostitute"
    },
    {
      "id": "nm3770771",
      "name": "Alison Walter",
      "character": "Prostitute"
    },
    {
      "id": "nm4894972",
      "name": "Jacob Peacock",
      "character": "Flyer Passer"
    },
    {
      "id": "nm4135126",
      "name": "Lorenzo Phillips",
      "character": "Business Man"
    },
    {
      "id": "nm1438375",
      "name": "J.R. Craig",
      "character": "Business Man"
    },
    {
      "id": "nm5720172",
      "name": "David Johnston",
      "character": "Homeless Man"
    },
    {
      "id": "nm5929040",
      "name": "David 'Blak' Plascencia",
      "character": "Flyer Passer       (as David Plascencia)"
    },
    {
      "id": "nm5957560",
      "name": "Frankie Sims",
      "character": "Flyer Passer"
    },
    {
      "id": "nm5341238",
      "name": "Victoria stansbury",
      "character": "Prostitute"
    },
    {
      "id": "nm4117299",
      "name": "Emmanuel Afuwape",
      "character": "Flyer Passer"
    },
    {
      "id": "nm5962970",
      "name": "Justin Andrews",
      "character": "Contemplating Man"
    },
    {
      "id": "nm3171967",
      "name": "Damon Johnson",
      "character": "Homeless Man"
    },
    {
      "id": "nm5459268",
      "name": "Tim Troia",
      "character": "Flyer Passer"
    },
    {
      "id": "nm3409107",
      "name": "Jeanette Shelton",
      "character": "Lady in Hotel"
    },
    {
      "id": "nm5735267",
      "name": "Charlie Battaglia",
      "character": "Student"
    },
    {
      "id": "nm2576328",
      "name": "Tiffany Daniels",
      "character": "Flyer Passer"
    },
    {
      "id": "nm4455817",
      "name": "Nathan Truong",
      "character": "Business Man"
    }
  ],
  "overview": "Santiago Sarka is the ruthless head of his own criminal empire in Los Angeles, and he doesn't feel the same way as his brother, Antonio. He owns the mayor, other city officials and high ranking police officers, controls the drug cartels and holds the city and its people captive. He senses an ominous shift is coming, and he'll put everything on the line to keep his brother out of the way.",
  "storyline": "Antonio Sarka (Kenneth Copeland), the traditional patriarch of a powerful crime family, had suddenly decided to give up his control of the family business and return to the old country for a while. He also wants his brother, Santiago (Eric Roberts), to give it up, leave that place with him and its memories to start a new life, but Santiago has no intention of giving up his birthright...",
  "plot": null,
  "synopsis": "Several years earlier in \"The Rally: A Change is Coming,\" Sarka Sr. (Kenneth Copeland), the traditional patriarch of a powerful crime family suddenly decides to give up his control of the family business and return to the old country for a while. He also wants his son, Junior (T-Bone), to give it up, to leave with him and to start a new life. But Junior has no intention of giving up his birthright. He bitterly rejects his fathers offer. With Sarka gone, Junior steps into his role as head of the family and begins a new era terrorizing their city in a brutal wave of drug trafficking and ruthless violence. In the meantime, Rick (Rick Reyna), with Rallys for Christ, is determined to organize a local rally to bring hope to the devastated community. Junior sends his thugs to threaten the rally team because he knows that hope will eventually break the hold he has over the people.Rick turns to Sarka for help to ensure that the rally will go on as planned. The day of the rally Junior orders a young associate, Gilbert (Danny Martinez) to take the shot at Rick as he leads the rally. But after hearing his uncle Mr. Lopez (Peter Vasquez) and Rick speaking about the love of God, he has a sudden change of heart and tells Junior he cant take the shot. In a fit of anger, Junior takes out his gun and pushes through the crowd aiming to gun down Gilberts uncle. As he pulls the trigger Gilbert throws himself in the path of the bullet, takes the shot in the chest and dies in his uncles place. Junior is wrestled to the ground by police and he is eventually sentenced to prison where he is greatly humbled by his horrific sins.\"The Rally LA: Breaking the Curse.\" Can a man ever be satisfied with money, cars, houses, airplanes and the fullness of this world? The answer is no! Antonio Miguel Sarka Sr. (Kenneth Copeland) is that man. Even though it seems like Sarka finds all that he needs in \"The Rally,\" his heart is telling him that he needs more from life. In \"The Rally LA\" we will see that love will cause a man to lay down his riches, his pride and even his life in order to reach the most precious thing in the world to him, his family. Now on the move to the big city of Los Angeles, Sarka is being called to the City of Angels for a date with destiny.Santiago (Eric Roberts) is the ruthless head of his own criminal empire in Los Angeles and he doesnt feel the same way as his brother, Sarka. Santiago owns the mayor, Paul Mitchell (Curtis Taylor), other city officials and high ranking police officers. He controls the drug cartels, the city and its people. He senses an ominous shift is coming. Santiago is a man willing to do whatever it takes. He'll put everything on the line to keep his brother out of his way. Sarka is also on the hunt to find his daughter, Sally (Sophia Adella Luke) whom he shipped away to be raised by her aunt after her mother died 20 years earlier to keep her away from his sorted life of crime. And he has a teenage granddaughter, Cristina (Destanie Reyna Brim) whom hes never met. With a broken heart and 20 years of hurt, can Sally find a place to forgive her father for the mistakes of his past?What can Sarka do to reach his family and tame this drive in his heart? In \"The Rally,\" Rick Reyna needed Sarkas help to conduct a rally to bring hope to his city. Now Sarka reaches out to Rick and his team with Rallys for Christ to come to Los Angeles to hold the biggest outdoor rally that the city of L.A. has ever seen. A rally that will pour out love into the streets. Sarka is hoping his brother Santiago, his daughter Sally and granddaughter Cristina will come to the rally and receive the life changing power of Gods love. Get ready to be moved by this powerful story of one mans desires as he lays it all on the line to break the curse that is gripping him, his family and the city caught in the middle in \"The Rally LA: Breaking the Curse.\""
}