{
  "imdb_id": "tt3013160",
  "tmdb_id": "360799",
  "douban_id": null,
  "title": "Alien Arrival (2016)",
  "genres": [
    "Action",
    "Adventure",
    "Sci-Fi"
  ],
  "country": "Australia",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.5,
  "director": [
    {
      "id": "nm3369437",
      "name": "Jesse O'Brien"
    }
  ],
  "writer": [
    {
      "id": "nm3369437",
      "name": "Jesse O'Brien",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm3448542",
      "name": "Dan Mor",
      "character": "Kye Cortland"
    },
    {
      "id": "nm4904455",
      "name": "Aleisha Rose",
      "character": "Tarren Hollis"
    },
    {
      "id": "nm0584017",
      "name": "Shaun Micallef",
      "character": "RE3F       (voice)"
    },
    {
      "id": "nm1023238",
      "name": "Mark Redpath",
      "character": "Tobias Hatch"
    },
    {
      "id": "nm0456130",
      "name": "Christopher Kirby",
      "character": "Norman Oleander"
    },
    {
      "id": "nm5062058",
      "name": "Jamie Foster",
      "character": "Carl Sanders"
    },
    {
      "id": "nm2271576",
      "name": "Jak Wyld",
      "character": "Prison Commander"
    },
    {
      "id": "nm5622107",
      "name": "Akira Matsumoto",
      "character": "Mechanic Guard       (as Akira Bradley)"
    },
    {
      "id": "nm0043387",
      "name": "Robert Awad",
      "character": "Chain Guard"
    },
    {
      "id": "nm8259732",
      "name": "Adam Bokos",
      "character": "Snipered Guard"
    },
    {
      "id": "nm4343531",
      "name": "Adam Tuohy",
      "character": "Burly Prisoner"
    },
    {
      "id": "nm6633768",
      "name": "Lloyd Price",
      "character": "Long Haired Prisoner"
    },
    {
      "id": "nm4956693",
      "name": "Morris Pontinelli",
      "character": "Wheelbarrow Prisoner"
    },
    {
      "id": "nm8259733",
      "name": "Luke Vranes",
      "character": "Kid Prisoner"
    },
    {
      "id": "nm7370959",
      "name": "Caton Vance",
      "character": "Interrogator       (voice)"
    },
    {
      "id": "nm8259734",
      "name": "Valerie Sasso",
      "character": "Arrowhead AI       (voice)"
    },
    {
      "id": "nm8259735",
      "name": "Vance Jeffrey Jay",
      "character": "Arrowhead Captain       (voice)"
    }
  ],
  "overview": "Arrowhead is a tale of survival set amongst the distant stars. Kye is a prisoner of war caught between two armies that he doesn't believe in. When offered an opportunity for freedom, Kye sets out on one last rescue mission, only to become stranded on a desert moon when his ship - the Arrowhead - crash lands. Kye has to learn to survive when we discovers a new life form that will challenge his very body and soul.",
  "storyline": "Kye's a prisoner of war caught between 2 armies; neither side of which he believes. When offered an opportunity for freedom, he sets out on one last rescue mission, only to become stranded on a desert moon, when his ship - the Arrowhead - crash lands. Kye has to learn to survive when a new life is discovered, which will challenge his beliefs.",
  "plot": null,
  "synopsis": "Arrowhead tells the story of Kye Cortland (Dan Mor), a prisoner of war caught between two large-scale ideological warring factions that he doesn't believe in. The opening action sequence, depicts a bloody prison break, were Kye escapes.In doing so he impresses Commander Tobias Hatch (Mark Redpath), and is offered an opportunity for freedom. Maimed and unconscious, Kye awakens in the presence of enigmatic rebel leader Tobias Hatch, who promises safe passage for Kyes imprisoned father, if Kye flies one last op to board the Arrowhead space craft, and steal information.Kye agrees to the rescue mission, only to become stranded on a desert moon when his ship - the Arrowhead - crash lands.Marooned, Kye engages with the downed ships advanced operating system, known as REEF (Shaun Micallef - voice) and begins to recce the alien landscape. Kye instantly adapts to the atmosphere; time and space defy scientific notions; the presence of a potentially dangerous alpha life form becomes apparent.Kye is joined by fellow displaced astronaut Tarren (Aleisha Rose). Only soon to lose her her as well. As time becomes increasingly fractured, so to does Kyes grip on his human state-of-mind.Kye has to learn to survive when we discovers a new life form that will challenge his very body and soul."
}