{
  "imdb_id": "tt3012818",
  "tmdb_id": "206375",
  "douban_id": null,
  "title": "Miracle (2013)",
  "genres": [
    "Drama"
  ],
  "country": "Slovakia",
  "version": [
    {
      "runtime": "78 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.1,
  "director": [
    {
      "id": "nm2996966",
      "name": "Juraj Lehotsky"
    }
  ],
  "writer": [
    {
      "id": "nm2996966",
      "name": "Juraj Lehotsky",
      "description": "writer"
    },
    {
      "id": "nm0503931",
      "name": "Marek Lescák",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm5763566",
      "name": "Michaela Bendulová",
      "character": "Ela"
    },
    {
      "id": "nm5763567",
      "name": "Katarína Feldeková",
      "character": "Mother"
    },
    {
      "id": "nm1085921",
      "name": "Ela Lehotská",
      "character": "Warden"
    },
    {
      "id": "nm3634540",
      "name": "Martin Petrenko",
      "character": ""
    },
    {
      "id": "nm1873041",
      "name": "Robert Roth",
      "character": ""
    }
  ],
  "overview": "Ela, 15, has a love affair, which results in her being sent to a re-education center.",
  "storyline": "The story of a fifteen-year old girl who finds herself referred to a re-education centre as a result of her love affair. She is desperate to love but this is denied her. Despite all the restrictions imposed on her, she is determined to live her life to the full.",
  "plot": "Tae Gong-shil (Son Na-eun) gets the request from ghosts to find a way to warm the hearts of everyone in the world. With the help of Kang Woo (Seo In-guk), who introduces her to Kim Tan (Taemin), Tae Gong-shil is able get the help of Cha Eun-sang (Minah). Cha Eun-sang asks the question \"When do people's hearts become warm?\" on her social network account. This question spreads online and various characters and idols answer in different ways that music warms their hearts. Kim Tan, Cha Eun-sang, Joo Joong-won (Jang Wooyoung), and Tae Gong-shil recruit the help of famous composer Kim Hyung-suk, as well as Yoon Chan-young (Kang Min-hyuk) and Lee Bo-na (Krystal) to form the \"You Make Miracle-2013 Friendship Project\".",
  "synopsis": null
}