{
  "imdb_id": "tt3037582",
  "tmdb_id": "293122",
  "douban_id": null,
  "title": "The Guide (2014)",
  "genres": [
    "Drama",
    "History"
  ],
  "country": "Ukraine",
  "version": [
    {
      "runtime": "122 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.3,
  "director": [
    {
      "id": "nm0762781",
      "name": "Oles Sanin"
    }
  ],
  "writer": [
    {
      "id": "nm5785646",
      "name": "Olexandr Irvanets",
      "description": null
    },
    {
      "id": "nm3434748",
      "name": "Iren Razdobudko",
      "description": null
    },
    {
      "id": "nm0762781",
      "name": "Oles Sanin",
      "description": null
    },
    {
      "id": "nm0937569",
      "name": "Paul Wolansky",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0049182",
      "name": "Stanislav Boklan",
      "character": "Ivan Kocherga"
    },
    {
      "id": "nm0123069",
      "name": "Jeff Burrell",
      "character": "Michael Shamrock"
    },
    {
      "id": "nm5785644",
      "name": "Anton Sviatoslav Greene",
      "character": "Peter Shamrock"
    },
    {
      "id": "nm6536376",
      "name": "Andriy Haddad",
      "character": "Vasya"
    },
    {
      "id": "nm5785645",
      "name": "Jamala",
      "character": "Olga"
    },
    {
      "id": "nm0462218",
      "name": "Aleksandr Kobzar",
      "character": "Comrade Vladimir"
    },
    {
      "id": "nm3558648",
      "name": "Oleg Primogenov",
      "character": "Sytnyk"
    },
    {
      "id": "nm5013994",
      "name": "Irina Sanina",
      "character": "Orysia"
    },
    {
      "id": "nm7510929",
      "name": "Serhiy Zhadan",
      "character": "Mikhaylo Semenko       (as Sergiy Zhadan)"
    }
  ],
  "overview": "American boy Peter and blind minstrel Ivan are thrown together by fate amidst the turbulent mid-30s Soviet Ukraine.",
  "storyline": "Early 1930s. Peter is a ten-year-old boy in the midst of turbulent Soviet Ukraine. His father, an American engineer, is killed for obtaining secret documents about the repressions, which now are hidden in Peter's book. The boy flees from the police with a blind kobzar (Ukrainian folk minstrel), Ivan Kocherga. Ivan does everything to help his young guide to grow up and survive with a kind and clear soul that will not be hardened by what his eyes have seen. He tells his young guide elaborate stories that make him believe there can be a different reality from what he sees around him. We are challenged to admit the blind kobzar may see the world with greater clarity than those with perfect eyes.",
  "plot": "In 1918, a young Jiro Horikoshi longs to become a pilot, but his nearsightedness prevents it. He reads about the famous Italian aircraft designer Giovanni Battista Caproni, and dreams about him that night. In the dream, Caproni tells him that he has never flown a plane in his life, and that building planes is better than flying them.\n\nFive years later, Jiro is traveling by train to study aeronautical engineering at Tokyo Imperial University and meets a young girl, Naoko, traveling with her maid. When an earthquake hits, Naoko's maid's leg is broken and Jiro carries her to Naoko's family, leaving without giving his name.\n\nIn 1927, Jiro graduates with his friend Kiro Honjo (who later designs the Mitsubishi G3M), and both are employed at aircraft manufacturer Mitsubishi and are assigned to design a fighter plane, the Falcon, for the Imperial Army. During tests, the Falcon breaks apart in mid-air and the Army rejects it. Dispirited about the seeming backwardness of Japanese technology, Jiro and Honjo are sent to Germany in 1929 to carry out technical research and obtain a production license for a Junkers G.38 aircraft. Jiro sees Hugo Junkers, argues with German guards and encounters thugs. He dreams again of Caproni, who tells him that the world is better for the beauty of planes, even if humankind might put them to ugly purposes.\n\nIn the spring of 1932, Jiro is promoted to chief designer for a fighter plane competition sponsored by the Imperial Navy, but his design, the Mitsubishi 1MF10, fails testing in 1933 and is rejected. Disappointed, Jiro goes to a summer resort in Karuizawa to rest, where he meets Naoko again. They become engaged, but Naoko has tuberculosis and refuses to marry until she recovers. Castorp, a German visitor privately critical of the Nazi regime, assists in the romance before fleeing arrest by the Japanese secret police.\n\nWanted in connection with Castorp, Jiro hides at his supervisor's home while he works on a new navy project. Following a lung hemorrhage, Naoko recuperates in an alpine sanatorium but cannot bear being apart from Jiro, and returns to marry him. Jiro's sister Kayo, a doctor, warns Jiro that his marriage to Naoko will end badly as tuberculosis is incurable. Though Naoko's health deteriorates, she and Jiro enjoy their time together.\n\nJiro leaves for the test flight of his new prototype aircraft, the Mitsubishi A5M. Knowing that she will die soon, Naoko secretly leaves letters for Jiro, her family, and friends and returns to the sanatorium. At the test site, Jiro is distracted from his success by a gust of wind, sensing Naoko's death.\n\nIn the summer of 1945, Japan has lost World War II and has been devastated by air raids. Jiro again dreams of meeting Caproni, telling him he regrets his aircraft were used for war. A group of Zeros fly past and their pilots salute Jiro. Caproni comforts him, saying Jiro's dream of building beautiful aircraft was nonetheless realized. Naoko appears, exhorting her husband to live his life to the fullest.",
  "synopsis": null
}