{
  "imdb_id": "tt3074732",
  "tmdb_id": "217708",
  "douban_id": null,
  "title": "Of Horses and Men (2013)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "Iceland",
  "version": [
    {
      "runtime": "81 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.9,
  "director": [
    {
      "id": "nm0259574",
      "name": "Benedikt Erlingsson"
    }
  ],
  "writer": [
    {
      "id": "nm0259574",
      "name": "Benedikt Erlingsson",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0797614",
      "name": "Ingvar Sigurdsson",
      "character": "Kolbeinn       (as Ingvar E. Sigurðsson)"
    },
    {
      "id": "nm0100628",
      "name": "Charlotte Bøving",
      "character": "Solveig"
    },
    {
      "id": "nm7242421",
      "name": "Johann Pall Oddson",
      "character": "Jon"
    },
    {
      "id": "nm0457999",
      "name": "Kristbjörg Kjeld",
      "character": "Hildur"
    },
    {
      "id": "nm0536425",
      "name": "Steinn Ármann Magnússon",
      "character": "Vernhardur"
    },
    {
      "id": "nm0311995",
      "name": "Halldóra Geirharðsdóttir",
      "character": "Ása"
    },
    {
      "id": "nm0084875",
      "name": "Helgi Björnsson",
      "character": "Egill"
    },
    {
      "id": "nm1539379",
      "name": "Vilborg Halldórsdóttir",
      "character": "Thorgardur"
    },
    {
      "id": "nm6971202",
      "name": "Kash Erden Baater",
      "character": "Gengis"
    },
    {
      "id": "nm7242422",
      "name": "Juris Zablockis",
      "character": "Russian #1"
    },
    {
      "id": "nm7242423",
      "name": "Ikor Lezhenko",
      "character": "Russian #2"
    },
    {
      "id": "nm0797583",
      "name": "Atli Rafn Sigurðsson",
      "character": "Óli"
    },
    {
      "id": "nm1945021",
      "name": "Kjartan Ragnarsson",
      "character": "Grimur"
    },
    {
      "id": "nm5823635",
      "name": "Sigríður María Egilsdóttir",
      "character": "Jóhanna s&ælig;nska"
    },
    {
      "id": "nm5823636",
      "name": "Juan Camillo Roman Estrada",
      "character": "Juan Camillo"
    },
    {
      "id": "nm7242424",
      "name": "Ólafur Flosason",
      "character": "Bjossi"
    },
    {
      "id": "nm0350835",
      "name": "Erlingur Gíslason",
      "character": "Prestur"
    },
    {
      "id": "nm3455079",
      "name": "Hallmar Sigurðsson",
      "character": "Leifur á Læk"
    },
    {
      "id": "nm0084739",
      "name": "Kjartan Bjargmundsson",
      "character": "Alli fulli"
    },
    {
      "id": "nm0254142",
      "name": "Maria Ellingsen",
      "character": "Dýralæknir"
    },
    {
      "id": "nm3982585",
      "name": "Svandis Dora Einarsdottir",
      "character": "Signie"
    }
  ],
  "overview": "A country romance about the human streak in the horse and the horse in the human. Love and death become interlaced and with terrible consequences.The fortunes of the people in the country through the horses' perception.",
  "storyline": "Kolbeinn loves Solveig and Solveig loves Kolbeinn but Kolbeinn is in love with his prized possession and darling, the mare Grána and Grána is obsessed with the stallion Brúnn. Spring is coming and the whole community is following the story. This cannot end well. Vernhardur is in love with vodka and the horse Jarpur loves Vernhardur, his master. Aboard a Russian trawler is a mate by the name of Gengis who doesn't have vodka but loves horses like Jarpur. This not going to end well. Grimur has a passion for ancient horse roads but Egill admires barbed wire fences. Grimur owns a horse and a pair of pincers and Egill owns a tractor. This cannot end well. Johanna loves Raudka, her mare, but Raudka is in love with freedom. On the heath by an old summer cottage lies an injured old man. This could have a happy ending. Juan Camillo loves life and nature and is seeking God in the Icelandic highlands but the horse Old Piebald is tired and longs for rest. How will this end? Well, it all ends in ...",
  "plot": "In the remote Icelandic valley, there is not much to do other than observe the horses, the neighbors, and the neighbors' horses with binoculars. Undisturbed, the stallions and mares do what nobody else in the valley dares to even talk about: love. However, there is still a feeling of love among some of the valley dwellers. Kolbeinn (Ingvar Eggert Sigurðsson) and Solveig's (Charlotte Bøving) attempts at love are the subject of much interest for the valley dwellers.\n\nMeanwhile, Vernhardur (Steinn Ármann Magnússon), who has a weakness for liquor, makes a name for himself on a Russian fishing vessel with the sailor Gengis (Kash Erden Baater). There is often disagreement about the riding routes between Grimur (Kjartan Ragnarsson) and Egill (Helgi Björnsson); Grimur generally prefers the classic routes on horseback, whereas Egill prefers riding through rough terrain on his tractor. Jóhanna (Sigríður María Egilsdóttir), on the other hand, has nothing to say concerning her mare Raudka. One day, she encounters an injured old man. The religious Juan Camillo (himself) is seeking God on a high spiritual level.\n\nAbove all, all the people in the valley share a love of their horses, and eventually come to understand one another.",
  "synopsis": null
}