{
  "imdb_id": "tt3079016",
  "tmdb_id": "253287",
  "douban_id": null,
  "title": "We'll Never Have Paris (2014)",
  "genres": [
    "Comedy",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "92 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.6,
  "director": [
    {
      "id": "nm0374865",
      "name": "Simon Helberg"
    },
    {
      "id": "nm0870006",
      "name": "Jocelyn Towne"
    }
  ],
  "writer": [
    {
      "id": "nm0374865",
      "name": "Simon Helberg",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0374865",
      "name": "Simon Helberg",
      "character": "Quinn"
    },
    {
      "id": "nm0001491",
      "name": "Melanie Lynskey",
      "character": "Devon"
    },
    {
      "id": "nm0704270",
      "name": "Zachary Quinto",
      "character": "Jameson"
    },
    {
      "id": "nm0509937",
      "name": "Judith Light",
      "character": "Jean"
    },
    {
      "id": "nm1192254",
      "name": "Maggie Grace",
      "character": "Kelsey"
    },
    {
      "id": "nm0000547",
      "name": "Alfred Molina",
      "character": "Terry"
    },
    {
      "id": "nm0728762",
      "name": "Jason Ritter",
      "character": "Kurt"
    },
    {
      "id": "nm2993517",
      "name": "Meredith Hagner",
      "character": "Leah"
    },
    {
      "id": "nm0134666",
      "name": "Geoffrey Cantor",
      "character": "Neighbor"
    },
    {
      "id": "nm0412374",
      "name": "Dana Ivey",
      "character": "Francoise"
    },
    {
      "id": "nm2342283",
      "name": "Jamil Mena",
      "character": "Isaac"
    },
    {
      "id": "nm0593541",
      "name": "Lizan Mitchell",
      "character": "Nurse"
    },
    {
      "id": "nm0609114",
      "name": "Ebon Moss-Bachrach",
      "character": "Guillaume"
    },
    {
      "id": "nm0915851",
      "name": "Fritz Weaver",
      "character": "Phillipe"
    },
    {
      "id": "nm2738138",
      "name": "Dennis Carter Jr.",
      "character": "Villager"
    },
    {
      "id": "nm6033899",
      "name": "Jiana Casazza",
      "character": "Villager"
    },
    {
      "id": "nm8817993",
      "name": "Lauren DelGiudice",
      "character": "The Sweaty Nanny"
    },
    {
      "id": "nm9353068",
      "name": "Dante DiGiorgio",
      "character": "Park Goer"
    },
    {
      "id": "nm6032937",
      "name": "Gioianna DiGiorgio",
      "character": "Park Goer"
    },
    {
      "id": "nm5888375",
      "name": "Karen Goeller",
      "character": "Tourist"
    },
    {
      "id": "nm5518607",
      "name": "Stan Vidal",
      "character": "Camp Counselor"
    }
  ],
  "overview": "We'll Never Have Paris is a clumsy and at once human account of screwing up on a transcontinental level in a noble effort to win back \"the one.\"",
  "storyline": "WE'LL NEVER HAVE PARIS is a hilarious, clumsy and at once human account of screwing up on a transcontinental level in a noble effort to win back 'the one.' A romantic comedy.",
  "plot": "Quinn (Simon Helberg) and Devon (Melanie Lynskey) are a couple since highschool. Quinn works in a flower shop with Kelsey (Maggie Grace) and Devon teaches in local university. Kelsey tells Quinn she is in love with him and starts flirting with him. Quinn tells Devon he wants to take a step back in the relationship, she understands it's about Kelsey, storms out and stays at her parents. Quinn goes to Kelsey's, they kiss and she gives him a handjob which ends too soon and they go to sleep. In the morning Quinn feels guilty and decides to visit Devon at her parents and propose to her. He ends up confessing what happened with Kelsey and though it's over he still works with her. Devon gets angry, says they need time separately to figure things out and maybe he should be with other girls, so it won't plague him that he only slept with her. He finds on Facebook a single schoolmate, they have a date and sleep together. He understands he wants to be with Devon and quits his job. He goes to Devon's parents only to find out she left to Paris, where they have relatives. He asks for her address to send her flowers, and shows up at her door. She tells Quinn she started dating Guillaume (Ebon Moss-Bachrach), and she doesn't want to be back with him. Quinn surprises her at her grandparents, but to his surprise Guillaume is also there. After eating, both Guillaume and Quinn play short recitals. As Quinn finishes, his left eye is very red due to a medical problem he has (Pingueculitis). Ignoring the situation he takes out the ring and gets ready to propose. Devon enters the room, but surprisingly she is accompanied by Kelsey, coming to win Quinn back. This causes Quinn to accidentally step on Guillaume's heirloom violin and he crushes it, which causes a slap fight between the two. Ashamed, Quinn leaves and returns to his home alone. Devon surprises him at his new work and he proposes in his car. Right after she says yes he tells her about the one-night stand he had. After some tense talk, and groveling on Quinn's part, Devon takes off the ring and asks Quinn to propose again.",
  "synopsis": null
}