{
  "imdb_id": "tt3086442",
  "tmdb_id": "284303",
  "douban_id": null,
  "title": "Goodnight Mommy (2014)",
  "genres": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "Austria",
  "version": [
    {
      "runtime": "99 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.7,
  "director": [
    {
      "id": "nm3868633",
      "name": "Severin Fiala"
    },
    {
      "id": "nm1072411",
      "name": "Veronika Franz"
    }
  ],
  "writer": [
    {
      "id": "nm1072411",
      "name": "Veronika Franz",
      "description": "screenplay &"
    },
    {
      "id": "nm3868633",
      "name": "Severin Fiala",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm5835039",
      "name": "Lukas Schwarz",
      "character": "Lukas"
    },
    {
      "id": "nm5835038",
      "name": "Elias Schwarz",
      "character": "Elias"
    },
    {
      "id": "nm1218360",
      "name": "Susanne Wuest",
      "character": "Mutter"
    },
    {
      "id": "nm3041988",
      "name": "Hans Escher",
      "character": "Priester"
    },
    {
      "id": "nm3868696",
      "name": "Elfriede Schatz",
      "character": "Rotkreuz Sammlerin"
    },
    {
      "id": "nm7363213",
      "name": "Karl Purker",
      "character": "Rotkreuz Sammler"
    },
    {
      "id": "nm7363214",
      "name": "Georg Deliovsky",
      "character": "Pizzalieferant"
    },
    {
      "id": "nm7363215",
      "name": "Christian Steindl",
      "character": "Mesner"
    },
    {
      "id": "nm7363216",
      "name": "Christian Schatz",
      "character": "Bauer"
    },
    {
      "id": "nm7363217",
      "name": "Erwin Schmalzbauer",
      "character": "Akkordeongott"
    }
  ],
  "overview": "In the heat of the summer lays a lonesome house in the countryside where nine year old twin brothers await their mother’s return.  When she comes home, bandaged after cosmetic surgery, nothing is like before and the children start to doubt whether this woman is actually who she says she is.",
  "storyline": "In the heat of the summer, a lonesome house in the countryside between woods and corn fields, lives nine-year-old twin brothers who are waiting for their mother. When she comes home, bandaged after cosmetic surgery, nothing is like before. The children start to doubt that this woman is actually their mother. It emerges an existential struggle for identity and fundamental trust.",
  "plot": "After undergoing a cosmetic facial surgery, a woman (Susanne Wuest) comes back home to her modern, isolated lakeside house and to her ten-year-old twin sons, Elias and Lukas (Elias and Lukas Schwarz). Her head is swathed in bandages, with only her eyes and mouth visible. The twins are unnerved by their mother's appearance and are further taken aback when she begins to exhibit strange behavior. She pointedly ignores Lukas and appears to only acknowledge Elias in conversation. Though it is the middle of summer, the mother orders the twins to keep the blinds closed during the day, imposes a strict rule of silence inside the house, and allows them to only play outdoors. The mother also acts cruelly and lashes out at Elias physically when he is mischievous or disobedient. The boys comment that this is something their mother would never do.\n\nThe twins begin to suspect that beneath her bandages, their mother may not be the same person. These doubts are confirmed when they find an old picture that shows the mother with another unknown woman who is wearing identical clothes and shares similar physical traits. With the suspicion that the woman residing in their house is an impostor, the twins tie the woman to the bed and refuse to let her go until she tells them where their real mother is. The woman insists that she is their mother, and the twins ultimately seal her mouth with tape to keep her from screaming for help.\n\nIn the meantime, two employees of the Red Cross appear to collect donations. Although they initially await the return of the mother, they finally leave the house after receiving a large cash amount from Elias, which he discreetly stole from his mother's purse. Meanwhile, the woman breaks free from the adhesive tape around her mouth and yells for help, but is too late to attract the attention of the Red Cross employees. The twins seal her lips with super glue, only to realize that she is unable to eat. The twins cut open her lips with a small pair of scissors.\n\nAs the woman is still bound and trapped, she wets her bed. The twins briefly set her free from her shackles, allowing her to subdue the boys and escape. The twins, however, have set up a booby trap that causes her to fall and hit her head, knocking her unconscious. The woman wakes glued to the living room floor. Elias starts to burn down the house to pressure her into telling them the truth about their mother. The woman firmly insists that she is the twins' real mother.\n\nThe woman tells Elias that Lukas has died in an accident prior to her return home. She tearfully explains to Elias that Lukas's death was not his fault and she begs her son to set her free so they can both move on from the tragedy. Elias challenges her to prove that she is their mother by telling them what Lukas is doing. As she cannot see Elias' hallucination of Lukas threatening to set fire to a curtain, she cannot answer the question. So Elias — believing that his real mother could see Lukas — grabs his arm and lights the curtain. The woman subsequently burns to death before firefighters arrive.\n\nThe final shot of the film shows Elias walking through the cornfield and emerging to be with Lukas and his mother, the three of them smiling and embracing. This indicates that perhaps Elias now will see both of them forevermore or that perhaps he died in the fire as well and they are all now reunited.",
  "synopsis": "After undergoing cosmetic facial surgery, a mother (Susanne Wuest) comes back home to her modern, isolated lakeside house and her ten-year-old twins, Elias and Lukas (Elias and Lukas Schwarz). Her head is swathed in bandages, with only her eyes and mouth visible. The twins are unnerved with their mother's appearance and are further taken aback when she begins to exhibit strange behavior. She pointedly ignores Lukas and appears to only acknowledge Elias in conversation. Though it is the middle of summer, the mother orders the twins to keep the blinds closed during the day, imposes a strict rule of silence inside the house, and allows them to only play outdoors. The mother also acts cruel and lashes out at Elias physically when he displays mischievous or disobedient acts; something that the boys comment that their mother would never do.The twins begin to suspect that beneath her bandages, their mother may not be the same person. These doubts are confirmed when they find an old picture that shows the mother together with another unknown woman who is wearing identical clothes and shares similar physical traits. With the suspicion that the woman residing in their house is an impostor, the twins tie the woman to the bed and refuse to let her go until she tells them where their real mother is. The woman insists that she is their mother, and the twins finally seal her mouth with tape to keep her from screaming for help.In the meantime, two employees of the Red Cross appear to collect donations. Although they initially await the return of the mother, they finally leave the house after receiving a large cash amount from Elias, which he discreetly stole from his mother's purse. Meanwhile, the woman breaks free from the adhesive tape around her mouth and yells for help, but is too late to attract the attention of the Red Cross employees. The twins seal her lips with Super Glue, only to realize that she is unable to eat. The twins cut open her lips with a small pair of scissors.As the woman is still bound and trapped, she wets her bed. The twins briefly set her free from her shackles, allowing her to subdue the boys and escape. The twins, however, have set up a booby trap that causes her to fall and hit her head, knocking her unconscious. The woman wakes glued to the living room floor. Elias starts to burn down the house to pressure her into telling them the truth about their mother. The woman firmly insists that she is the twins' real mother.It is revealed by the mother that Lukas has died in an accident prior to the events of the movie. She tearfully explains to Elias that Lukas's death was not his fault and she begs her son to set her free so they can both move on from the tragedy. Elias challenges her to prove that she is their mother by telling them what Lukas is doing. As she cannot see the hallucinated Lukas threatening to set fire to a curtain, she cannot answer the question. So Elias - believing that his real mother could see Lukas - grabs his arm and lights up the curtain. The mother subsequently burns to death before the firefighters arrive. The film ends with a ghostly shot of the mother reunited with her twin sons at a cornfield near their home."
}