{
  "imdb_id": "tt3078752",
  "tmdb_id": "327894",
  "douban_id": null,
  "title": "Story of Eva (2015)",
  "genres": [
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.0,
  "director": [
    {
      "id": "nm5827896",
      "name": "Tom Woodbeck"
    }
  ],
  "writer": [
    {
      "id": "nm5827896",
      "name": "Tom Woodbeck",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0727810",
      "name": "Nicole Rio",
      "character": "Eva"
    },
    {
      "id": "nm0743768",
      "name": "Ricco Ross",
      "character": "Detective Grind"
    },
    {
      "id": "nm4007514",
      "name": "Steve Cozart",
      "character": "Bill"
    },
    {
      "id": "nm0000616",
      "name": "Eric Roberts",
      "character": "Detective Wood"
    },
    {
      "id": "nm0703809",
      "name": "Daniel Quinn",
      "character": "Dr. Cornelius"
    },
    {
      "id": "nm0694336",
      "name": "Tim Powell",
      "character": "Captain White"
    },
    {
      "id": "nm4672409",
      "name": "Sheri Kresnicka",
      "character": "Rose"
    },
    {
      "id": "nm2065199",
      "name": "Johnny Gilligan",
      "character": "Coroner       (as John Gilligan)"
    },
    {
      "id": "nm0177977",
      "name": "Debbie Cooper",
      "character": "Peggy"
    },
    {
      "id": "nm5863846",
      "name": "Laurie Cozart",
      "character": "Colleen       (scenes deleted)"
    },
    {
      "id": "nm3493941",
      "name": "Shawna Craig",
      "character": "Evil Eva"
    },
    {
      "id": "nm3111614",
      "name": "Kale Flowers",
      "character": "Car Salesman"
    },
    {
      "id": "nm5587020",
      "name": "Douglas Gawoski",
      "character": "Art"
    },
    {
      "id": "nm5226882",
      "name": "Nicole R'Shae Holiday",
      "character": "Rhonda       (as Nicole R. Hughes)"
    },
    {
      "id": "nm4610150",
      "name": "Gev Kalian",
      "character": "Officer Davis       (as Gev Khal)"
    },
    {
      "id": "nm5899569",
      "name": "Tabitha Kit",
      "character": "Julia       (as Kalista Duvey)"
    },
    {
      "id": "nm5632410",
      "name": "Bethany Line",
      "character": "Sarah"
    },
    {
      "id": "nm5061035",
      "name": "Chelsea London Lloyd",
      "character": "Amber"
    },
    {
      "id": "nm5393290",
      "name": "Ke'Shay Love",
      "character": "Mom"
    },
    {
      "id": "nm7906253",
      "name": "John Nickerson",
      "character": "John"
    },
    {
      "id": "nm4820741",
      "name": "Mark Nickerson",
      "character": "Mark"
    },
    {
      "id": "nm5476061",
      "name": "Molly Ratermann",
      "character": "Bully"
    },
    {
      "id": "nm6067539",
      "name": "Billy Ray Chubbs",
      "character": "Kong"
    },
    {
      "id": "nm0731067",
      "name": "Eliza Roberts",
      "character": "Mrs. Markiewicz"
    },
    {
      "id": "nm6155463",
      "name": "Sydney Schiller",
      "character": "Sydney"
    },
    {
      "id": "nm5845911",
      "name": "Timothy Slater",
      "character": "Tim"
    },
    {
      "id": "nm2046346",
      "name": "Natalia Smith",
      "character": "Dead Girl"
    },
    {
      "id": "nm2966203",
      "name": "Toni Staniewicz",
      "character": "Ms. Banks"
    },
    {
      "id": "nm5171368",
      "name": "Richie Stephens",
      "character": "Detective St. John"
    },
    {
      "id": "nm4495742",
      "name": "Tessa Zehnder",
      "character": "Stacy"
    }
  ],
  "overview": "Guilt ridden mother seeks to enact her vengeance against her daughter's killers. With detectives closing in, Eva transforms into a vengeful God.",
  "storyline": "Eva and her daughter Amber are attacked outside a restaurant after an evening of Amber's musical concert. Eva is knocked out during the attack! Eva wakes in the hospital to discover Amber has been kidnapped, raped and murdered, but she is unable to help in the investigation due to amnesia. On a quiet evening while listening to Amber's music play, Eva recalls her attack. Having learned the lessons with past abused children and the lack of protection authorities could provide, Eva decides to take the justice system into her own hand. Eva constructs a dungeon in her garage to enact her own version of Vengeance. Then she tracks her daughter's killer! Along the way, she transform from a Mini-Van soccer mom to a hip slick huntress of Evil. Eva meets the worst of society and puts an end to their reign of terror, personally! But not all is smooth sailing as Detective Grind and Wood track Eva down as the bodies of her daughter's killers are discovered. As the detectives close in, Eva is ...",
  "plot": "In a small New England town during a frigid winter season, four elderly friends -- businessman Ricky Hawthorne, lawyer Sears James, Dr. John Jaffrey, and Mayor Edward Charles Wanderley -- form the Chowder Society, an informal mens club where they regale each other with scary stories. Edward's son David, living in New York City, falls from a window after seeing a girl he's sleeping with turns suddenly into a living corpse. His other son, Don, comes home at Edward's request. Edward becomes so distraught that he wanders in the snow and, seeing the same female apparition that killed David, falls to his death from the bridge.\n\nDoubting his father committed suicide, Don approaches the remaining three friends and tells them a \"ghost\" story to gain membership in the Chowder Society. In a flashback, Don tells the story of how he, a college professor in Florida, begins a torrid sexual affair with a mysterious secretary named Alma, costing him his reputation. Don breaks things off with Alma, he learns from David that he has met the same girl in New York and intends to marry her. Don warns his brother that she's trouble and, when he dies, suspects her of being involved in his death. The elderly friends react to Don's story.\n\nJaffrey has a nightmare about Alma and dies of a heart attack. Sears and Ricky explain to Don that, in the 1930s, the four friends became smitten with a young flirtatious girl named Eva Galli. Edward (Don's father) who first took her to bed, but he was impotent with her. Outside her house, the other three friends serenaded Eva in hopes of catching a glimpse of her when a shirtless Edward came to the window instead, giving the impression that he did sleep with her. Edward left with his friends, and the four became very drunk, discussing Eva's prowess in the bedroom. They returned to her house, where all but Sears danced with her. When it was proposed that they leave, Sears suggestively insisted on getting his dance, to which she pointedly responded that she intended to dance with all of them. She confronted Edward about what he had told his friends, then was about to tell them the truth when Young Edward leaped to silence her, knocking her down, accidentally smashing her head into the stone fireplace. Horrified, the young men believed that the unresponsive Eva was dead. They considered calling the police, but realized it would only mean wrecking their lives. Instead, they loaded her body into her car, then pushed it into the nearby lake. As the car descends, Eva stirred inside, looking out at them from the back window, screaming and hammering at the glass as the car sank beneath the surface, taking her with it.\n\nBack in the present, Ricky and Sears admit that the death has haunted them all these years. Whereas Sears is dubious, both Ricky and Don believe that Alma and Eva are the same woman and that her ghost has returned to seek revenge.\n\nDon suggests they go to Eva's old house, now in ruins, to confront the past and her ghost once and for all. They go there, but Don falls on the rotting stairs and breaks his leg. Sears leaves in his car to seek help, leaving Don and Ricky behind. While driving through the snowstorm, Sears comes upon Eva's apparition. He slams on the brakes, and swerves to the side of the road. He survives, but is attacked and killed by Fenny Bate, one of Eva's accomplices.\n\nRicky nearly dies at the hands of Eva's other accomplice, Gregory Bate, but Ricky stabs him and escapes to get to the authorities, telling them to pull Eva's car up from the lake to reveal her body inside. This is intercut with Don, who confronts the rotting specter of Alma/Eva. Ricky and the authorities drag out the ancient car, wrenching open the rusted, corroded door, and the undead rotting corpse of Eva lunges into view. It falls to the ground and begins to disintegrate before their eyes. Don is spared from her vengeance and the town is restored to peace.",
  "synopsis": null
}