{
  "imdb_id": "tt3034594",
  "tmdb_id": "279973",
  "douban_id": null,
  "title": "Nowhere Safe (TV Movie 2014)",
  "genres": [
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "92 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm0112647",
      "name": "Brian Brough"
    }
  ],
  "writer": [
    {
      "id": "nm1372462",
      "name": "Brittany Wiscombe",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0000449",
      "name": "Natasha Henstridge",
      "character": "Julie Johnson"
    },
    {
      "id": "nm0005085",
      "name": "Jamie Kennedy",
      "character": "Kevin Carlisle"
    },
    {
      "id": "nm1058095",
      "name": "Danielle C. Ryan",
      "character": "Ashley Evans       (as Danielle Chuchran)"
    },
    {
      "id": "nm4197678",
      "name": "James Gaisford",
      "character": "Nick"
    },
    {
      "id": "nm5804664",
      "name": "Tatum Chiniquy",
      "character": "Carrie"
    },
    {
      "id": "nm5804663",
      "name": "Jeremias Elvegaard",
      "character": "Max"
    },
    {
      "id": "nm5355912",
      "name": "David Mamata",
      "character": "Burnside"
    },
    {
      "id": "nm1570097",
      "name": "Kelsi Cullimore",
      "character": "Mel"
    },
    {
      "id": "nm4014225",
      "name": "Angelique Cooper",
      "character": "Alana"
    },
    {
      "id": "nm5804666",
      "name": "Allyena Hew'Len",
      "character": "Kylie       (as Allyena Hew-Len)"
    },
    {
      "id": "nm5980048",
      "name": "Emilly Vang",
      "character": "Wei"
    },
    {
      "id": "nm1013338",
      "name": "Caitlin E.J. Meyer",
      "character": "Lisa       (as Caitlin Meyer)"
    },
    {
      "id": "nm1324105",
      "name": "Sue Rowe",
      "character": "Principal Tanner"
    },
    {
      "id": "nm1343822",
      "name": "Yolanda Wood",
      "character": "English Teacher"
    },
    {
      "id": "nm2667589",
      "name": "Shona Kay",
      "character": "Math Teacher"
    },
    {
      "id": "nm5678768",
      "name": "Terry Guthrie",
      "character": "Science Teacher"
    },
    {
      "id": "nm5804667",
      "name": "Heather Beaman",
      "character": "Angry Teacher       (as Heather M. Beaman)"
    },
    {
      "id": "nm0998822",
      "name": "Michael Birkeland",
      "character": "Janitor #1"
    },
    {
      "id": "nm0726997",
      "name": "Bus Riley",
      "character": "Janitor #1"
    },
    {
      "id": "nm6838500",
      "name": "Eli Davidson",
      "character": "Donut Boy"
    },
    {
      "id": "nm6076053",
      "name": "Mia Carson",
      "character": "History Student"
    },
    {
      "id": "nm6076047",
      "name": "Angie Clyde",
      "character": "History Student"
    },
    {
      "id": "nm6076048",
      "name": "Michelle Clyde",
      "character": "History Student"
    },
    {
      "id": "nm6076054",
      "name": "Brett Dickson",
      "character": "History Student"
    },
    {
      "id": "nm6047647",
      "name": "Helene Lam",
      "character": "History Student"
    },
    {
      "id": "nm6076045",
      "name": "Samuel Mele",
      "character": "History Student"
    },
    {
      "id": "nm6076049",
      "name": "Brandon Ostler",
      "character": "History Student"
    },
    {
      "id": "nm6076052",
      "name": "Mckell Palmer",
      "character": "History Student"
    },
    {
      "id": "nm6076051",
      "name": "Morgan Palmer",
      "character": "History Student"
    },
    {
      "id": "nm6076044",
      "name": "Sammie Parkinson",
      "character": "History Student"
    },
    {
      "id": "nm6076043",
      "name": "Graeme Perriton",
      "character": "History Student"
    },
    {
      "id": "nm6076050",
      "name": "Bri Ray",
      "character": "History Student"
    },
    {
      "id": "nm6076046",
      "name": "Micah Wilcock",
      "character": "History Student"
    },
    {
      "id": "nm3937986",
      "name": "Candy Eash",
      "character": "Office Receptionist"
    },
    {
      "id": "nm10167989",
      "name": "Morgan Lashay Carlson",
      "character": "Student"
    }
  ],
  "overview": "Nowhere to run...Nowhere to hide. After two teen girls cruelly impersonate her online in a reverse cyber bullying plot, Ashley s reputation is ruined. She and her mother, Julie (a high school teacher), are ostracized, forcing them to flee an escalating threat to their lives. Starting over in a new town and school, romantic interests and the poignant lessons from Kevin, an eccentric history teacher, draw them out of seclusion. However, when the past catches up with Ashley, she draws on what she s learned from Kevin s history lessons, giving her strength to stand tall rather than giving in to the bullies that torment her. With the support of her mother and new found friends, Ashley confronts her painful past, using the very tools of social media and technology that originally hurt her to expose lies and spread the truth.",
  "storyline": "After two girls cruelly impersonate her online in a \"reverse cyber bullying\" plot, Ashley's reputation is ruined and she and her mother flee a growing threat to their lives. Starting over at a new school, romantic interests and the poignant lessons from an eccentric history teacher draw them out of seclusion until they realize confronting a hurtful past is essential to ensure a brighter future.",
  "plot": "A frightened woman (Julianne Hough) flees her house in Boston, having held a bloody knife. After taking shelter with a neighbor, she is shown moments later at the bus station trying to flee town. She buys a bus ticket with her hair now cropped and bleached and stops in the small town of Southport, North Carolina. At the general store, she introduces herself as Katie Feldman. After acquiring a job as a waitress and renting a small house on the edge of town, Katie befriends her neighbor, Jo (Cobie Smulders) and meets Alex Wheatley (Josh Duhamel), a widowed father of two young children, Josh (Noah Lomax) and Lexie (Mimi Kirkland), who operate the local general store and give Katie a bicycle so she won't have to walk.\n\nIt's not too long before Katie and Alex start a relationship, and she becomes like a mother to Josh and Lexie. Meanwhile, Kevin Tierney (David Lyons), a Boston police detective, prepares wanted posters for a woman named \"Erin\" which describe that she is wanted for attempted murder. Alex sees Erin's wanted poster in the police station and notices the picture bears a striking resemblance to Katie. He confronts Katie with the information, causing a huge fight. They break up, and Katie moves out of her house.\n\nAs Katie is about to leave town, however, Alex intercepts her and says that he has fallen in love with her. Katie returns his love, and decides to stay in Southport. She tells Alex that she fled to Southport to escape her abusive and alcoholic husband. They got in a fight, and she stabbed him in self-defense before she fled south.\n\nMeanwhile, Kevin is suspended for creating the wanted posters, whereupon it is revealed that he is Katie's (Erin's) abusive and alcoholic husband. Enraged, he breaks into Katie's former neighbor's home back in Boston and finds the phone number to the Southport restaurant where Katie works. Arriving just in time for the town's Fourth of July parade, a severely intoxicated Kevin sees Katie kissing Alex, which enrages him. That night, Katie has a dream that she is standing on the docks watching the fireworks when Jo comes up and tells Katie that \"he\" is here. Katie wakes up in the convenience store next to a sleeping Lexie when Kevin suddenly appears and confronts her, demanding that she go back with him. She refuses and tells him to leave. Kevin pulls a gun and pours gasoline all over the store, with the intent to burn it down.\n\nWhen he hesitates, Katie buys time by faking sympathy for him and agreeing to return home with him. When he lets his guard down, she pushes him into the water; however, a firework spark lands on the gasoline, igniting a fire that engulfs the store. Alex sees the burning store, quickly makes his way across the harbor by boat, and saves Lexie. Meanwhile, Katie tries to fight off Kevin; during the struggle, the gun goes off and kills Kevin, ridding her of him forever.\n\nIn the aftermath of the fire, Alex recovers several letters which were written by his late wife Carly before she died. The letters prepared ahead of time for memorable events such as Josh's eighteenth birthday and Lexie's wedding day. Alex gives Katie a letter with the words \"To Her\" on the envelope; the letter thanks the recipient for making Alex happy. Enclosed with the letter is a photo of Alex's late wife, whom Katie is astonished to discover was actually Jo. This means that Jo was Carly, in the form of an angel, who led Katie to her husband, Alex.",
  "synopsis": null
}