{
  "imdb_id": "tt3005560",
  "tmdb_id": "199576",
  "douban_id": null,
  "title": "In Bob We Trust (2013)",
  "genres": [
    "Documentary",
    "Biography",
    "Drama",
    "History"
  ],
  "country": "Australia",
  "version": [
    {
      "runtime": "102 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm0586952",
      "name": "Lynn-Maree Milburn"
    }
  ],
  "writer": [
    {
      "id": "nm0586952",
      "name": "Lynn-Maree Milburn",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm1170782",
      "name": "Denis Hart",
      "character": "Himself       (as Archbishop Denis Hart)"
    },
    {
      "id": "nm1233324",
      "name": "Bob Maguire",
      "character": "Himself"
    },
    {
      "id": "nm5308193",
      "name": "George Pell",
      "character": "Himself       (as Cardinal George Pell)"
    },
    {
      "id": "nm0755907",
      "name": "John Safran",
      "character": "Himself"
    }
  ],
  "overview": "Having faithfully served his South Melbourne parish for nearly four decades, the cantankerous, controversial Catholic provocateur affectionately called Father Bob is well known and loved, as much for his incorrigible media savvy and battles with Church hierarchy as for his staunch advocacy on behalf of the disadvantaged and disenfranchised. In Bob We Trust goes behind the scenes with Bob, documenting his everyday trials during one of the most turbulent times in his career: his forced retirement and eviction from the church he called home for 38 years.",
  "storyline": "After nearly four decades faithfully serving his parish in South Melbourne, Father Bob Maguire has acquired a reputation as a controversial and irreverent figure. His battles with church hierarchy have become legend. His forthright approach, insightful wit and dedication to improving the lives of others has made him an inspiration not just in his parish but throughout Australia. In Bob We Trust begins with Father Bob facing his greatest challenge. Despite the 'promise of a parish for life', the Archbishop of Melbourne invites him to retire. What follows is a David and Goliath story of biblical proportions as the dissident priest, loved by the faithful and the secular alike, resists the authority of the church to remove him, only to encounter treachery and betrayal. In Bob We Trust follows irreverent philosopher and working class hero Father Bob over three years, on a journey which is by turns inspirational and shocking, eye-opening and joyous, revealing behind-the-scenes drama that ...",
  "plot": null,
  "synopsis": null
}