{
  "imdb_id": "tt3072876",
  "tmdb_id": "364257",
  "douban_id": null,
  "title": "Queen Mimi (2015)",
  "genres": [
    "Documentary",
    "Biography",
    "Comedy",
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "75 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm1516159",
      "name": "Yaniv Rokah"
    }
  ],
  "writer": [
    {
      "id": "nm1516159",
      "name": "Yaniv Rokah",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0302108",
      "name": "Zach Galifianakis",
      "character": "Himself"
    },
    {
      "id": "nm0000250",
      "name": "Renée Zellweger",
      "character": "Herself"
    },
    {
      "id": "nm1516159",
      "name": "Yaniv Rokah",
      "character": "Himself"
    },
    {
      "id": "nm0574615",
      "name": "Graham McTavish",
      "character": "Himself"
    },
    {
      "id": "nm5821125",
      "name": "Marie 'Mimi' Haist",
      "character": "Herself - Mimi"
    },
    {
      "id": "nm6427968",
      "name": "Stan Fox",
      "character": "Himself"
    },
    {
      "id": "nm2186050",
      "name": "Amy Boatwright",
      "character": "Herself"
    },
    {
      "id": "nm1179733",
      "name": "Rita Branch",
      "character": "Herself"
    },
    {
      "id": "nm0553843",
      "name": "Richard Martini",
      "character": "Himself"
    }
  ],
  "overview": "Forced  onto  the  streets  in  her  50s,  Mimi  found  \"home\"  at  a  Santa  Monica laundromat. Taking shelter there for 20 years, Mimi's passion for pink, and living without  looking  back,  has  taken  her  from  homelessness  to  Hollywood's  red carpets. This is the fascinating and moving story of one incredibly strong woman’ s survival against all odds.",
  "storyline": "When you feel like a queen, even a laundromat can be a palace. Marie \"Mimi\" Haist defied her adulterous husband and moved onto the streets in her 50s, living in parking lots and doorways until finding her \"home\" one stormy night between rows of washers in a Californian laundromat. Encouraged to stay by a more than generous laundry owner, Mimi's 'the past is the past' philosophy endeared her to regular fluff and fold clients and, after more than 20 years, Mimi has made some unlikely friends, ranging from local loves to Hollywood A-listers Zach Galifianakis and Renee Zellweger. Filmed over 5 years by barista/actor/director Yaniv Rokah while he worked at a cafe across the street, Queen Mimi is the story of an unlikely hero. Now 89, Mimi reminds us to never give in and never give up, and that if you ever find yourself in the gutter, to never stop looking at the stars.",
  "plot": null,
  "synopsis": null
}