{
  "imdb_id": "tt3003800",
  "tmdb_id": "266044",
  "douban_id": null,
  "title": "Amour Fou (2014)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "Austria",
  "version": [
    {
      "runtime": "96 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm0369618",
      "name": "Jessica Hausner"
    }
  ],
  "writer": [
    {
      "id": "nm0369618",
      "name": "Jessica Hausner",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm3041056",
      "name": "Christian Friedel",
      "character": "Heinrich"
    },
    {
      "id": "nm4087835",
      "name": "Birte Schnöink",
      "character": "Henriette"
    },
    {
      "id": "nm0335951",
      "name": "Stephan Grossmann",
      "character": "Friedrich Louis Vogel"
    },
    {
      "id": "nm1197689",
      "name": "Sandra Hüller",
      "character": "Marie"
    },
    {
      "id": "nm0359675",
      "name": "Holger Handtke",
      "character": "Arzt"
    },
    {
      "id": "nm0774218",
      "name": "Barbara Schnitzler",
      "character": "Mutter"
    },
    {
      "id": "nm3048027",
      "name": "Alissa Wilms",
      "character": "Dienstmädchen Dörte"
    },
    {
      "id": "nm3047214",
      "name": "Paraschiva Dragus",
      "character": "Pauline"
    },
    {
      "id": "nm1286167",
      "name": "Peter Jordan",
      "character": "Müller"
    },
    {
      "id": "nm0778348",
      "name": "Katharina Schüttler",
      "character": "Sophie"
    },
    {
      "id": "nm0944233",
      "name": "Gustav-Peter Wöhler",
      "character": "Hypnotiseur"
    },
    {
      "id": "nm0902881",
      "name": "Marie-Paule von Roesgen",
      "character": "Frau von Massow"
    },
    {
      "id": "nm0083894",
      "name": "Marc Bischoff",
      "character": "Peguilhen"
    },
    {
      "id": "nm4413013",
      "name": "Christina Landshamer",
      "character": "Frau von Krahl"
    },
    {
      "id": "nm8638611",
      "name": "Gerold Huber",
      "character": "Pianist"
    },
    {
      "id": "nm3321506",
      "name": "Nickel Bösenberg",
      "character": "Gendarm"
    },
    {
      "id": "nm0670507",
      "name": "Josiane Peiffer",
      "character": "Dame in Kutsche"
    },
    {
      "id": "nm8638612",
      "name": "Gerhard Gdowiok",
      "character": "Diener Frau von Massow"
    }
  ],
  "overview": "A \"romantic comedy\" based loosely on the suicide of the poet Henrich von Kleist in 1811.",
  "storyline": "Berlin, the Romantic Era. Young poet Heinrich wishes to conquer the inevitability of death through love, yet is unable to convince his skeptical cousin Marie to join him in a suicide pact. It is whilst coming to terms with this refusal, ineffably distressed by his cousin's insensitivity to the depth of his feelings, that Heinrich meets Henriette, the wife of a business acquaintance. Heinrich's subsequent offer to the beguiling young woman at first holds scant appeal, that is until Henriette discovers she is suffering from a terminal illness",
  "plot": "In Berlin the affluent Henriette Vogel (Birte Schnöink) holds a soiree where the poet Heinrich von Kleist attends. Heinrich approaches his close friend and cousin Marie (Sandra Hüller) and after telling her how living has become painful to him he asks her to consider dying with him in a murder-suicide pact. Marie declines.\n\nHeinrich then approaches Henriette and tells her that as Marie has declined his dearest wish his love for her is dying as his love for Henriette begins to blossom. After telling Henriette that he feels she is an unloved outsider like him he asks her to join him in death. Henriette is appalled at his characterization of her as she feels she is close to both her husband and her daughter. She refuses his offer. Shortly after Henriette begins to suffer from spasms and fainting fits.\n\nHeinrich continues to visit with Henriette during her illness and finds her life mediocre and conventional as she will not even allow him to visit her alone in order not to raise gossip. He continues to hope that she will consent to die with him.\n\nFor awhile Henriette's doctor cannot find the cause of her illness which he assures her is likely not serious. However after sending samples of her urine and her medical file away for a second opinion he learns that she has a fatal tumour that will kill her before long. After learning of the news Henriette calls Heinrich to her home where she allows him to be alone with her for the first time. She tells him she is dying and admits that now she feels alone and unloved just as he described her. She tells him that she would like to enter into the suicide pact with him. Heinrich receives the news rather coldly telling Henriette he hoped that he would meet someone who was willing to die because he wanted to die and not for her own reasons. Reluctantly Heinrich and Henriette head off into the country together hoping to complete their pact. However at the inn where they are staying Heinrich meets an acquaintance and the three are forced to have an awkward dinner together with Heinrich's friend believing they are lovers. The trip is a failure and the two return home.\n\nHeinrich then goes to visit his cousin Marie again who has returned from Paris newly engaged. Heinrich once again asks Marie to die with him and she refuses telling him that though life is stupid and pointless it is important to seek out the good. Having conclusively been rejected by Marie, Heinrich returns to Henriette and tells her he has been thinking of her constantly and asks her to renew their pact. She agrees.\n\nMeanwhile Henriette's husband, Vogel, returning from a trip to Paris tells Henriette that he showed her file to another doctor who believes she might not have a tumour after all. He asks her to accompany him to Paris where she can receive more advanced medical treatment. Noticing how close Henriette has become to Heinrich he also tells her that he would respect her choice if she decided to leave him for Heinrich. Henriette dismisses the idea calling Heinrich selfish.\n\nHeinrich arrives at the Vogel house in order to usher Henriette away so they can die together. Henriette is reluctant to go but Vogel insists that the exercise and fresh air will be good for her. They tell Heinrich that there is a possibility that Henriette will live as they are planning to go to Paris to see another doctor.\n\nHeinrich and Henriette go off together and stay the night at an inn where Heinrich reads a poem to Henriette and apologizes for ever doubting her. The next day they head off into the woods. Henriette begins to tell Heinrich that she had something to say the previous day but before she can finish her thought he shoots and kills her. Preparing to shoot himself in the head he fires twice only to have the gun not function both times.\n\nAfter learning of the death of his wife Vogel searches his desk for a letter and eventually finds the note that Henriette wrote to him before her first planned suicide attempt hidden in a drawer. Going into the woods he is able to see both Henriette and Heinrich's bodies still lying out in the open.\n\nReturning home Vogel learns from Henriette's physician that an autopsy revealed that Henriette was in good health with no tumour or ulcer. Vogel realizes that her symptoms were caused by love after all.",
  "synopsis": null
}