{
  "imdb_id": "tt3096458",
  "tmdb_id": "362270",
  "douban_id": null,
  "title": "The Neorealism: We Were Not Just Bicycles Thieves (2013)",
  "genres": [
    "Documentary"
  ],
  "country": "Italy",
  "version": [
    {
      "runtime": "75 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.0,
  "director": [
    {
      "id": "nm0102541",
      "name": "Gianni Bozzacchi"
    }
  ],
  "writer": [
    {
      "id": "nm0102541",
      "name": "Gianni Bozzacchi",
      "description": null
    },
    {
      "id": "nm0515491",
      "name": "Carlo Lizzani",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0000934",
      "name": "Bernardo Bertolucci",
      "character": "Himself - Interviewee"
    },
    {
      "id": "nm0248767",
      "name": "Umberto Eco",
      "character": "Himself - Interviewed"
    },
    {
      "id": "nm5859712",
      "name": "Paolo Galluzzi",
      "character": "Himself - Interviewed"
    },
    {
      "id": "nm0305781",
      "name": "Gabriel García Márquez",
      "character": "Himself - Interviewed"
    },
    {
      "id": "nm0409421",
      "name": "Franco Interlenghi",
      "character": "Himself - Interviewed"
    },
    {
      "id": "nm0515491",
      "name": "Carlo Lizzani",
      "character": "Narrator /              Himself"
    },
    {
      "id": "nm0523791",
      "name": "Antonella Lualdi",
      "character": "Herself - Interviewed"
    },
    {
      "id": "nm0647438",
      "name": "Ermanno Olmi",
      "character": "Himself - Interviewed"
    },
    {
      "id": "nm0821543",
      "name": "Enzo Staiola",
      "character": "Himself - Interviewed"
    },
    {
      "id": "nm0851752",
      "name": "Paolo Taviani",
      "character": "Himself - Interviewed"
    },
    {
      "id": "nm0851754",
      "name": "Vittorio Taviani",
      "character": "Himself - Interviewed"
    }
  ],
  "overview": "This short film tells the story of the most important cinema trend that Italy has ever produced - Neo Realism. Born after the Second World War, this veritable cultural revolution rapidly became a boundless source of inspiration for movie-makers throughout the entire world. Even today it influences those wanting to produce quality movies characterized and identified as Italian products able to be exported as well. It is precisely one of the masters of this unique current rich in different personalities who introduces the story - Carlo Lizzani - whose 'lesson' reconstructs the birth and development of Neorealism in Italy. It combined innovative movie techniques with a new view based on a 'true' interpretation of reality. Due to its high cultural value, this short film was given the highest reknown of the Presidency of the Republic of Italy.",
  "storyline": "This short film tells the story of the most important cinema trend that Italy has ever produced - Neo Realism. Born after the Second World War, this veritable cultural revolution rapidly became a boundless source of inspiration for movie-makers throughout the entire world. Even today it influences those wanting to produce quality movies characterized and identified as Italian products able to be exported as well. It is precisely one of the masters of this unique current rich in different personalities who introduces the story - Carlo Lizzani - whose 'lesson' reconstructs the birth and development of Neorealism in Italy. It combined innovative movie techniques with a new view based on a 'true' interpretation of reality. Due to its high cultural value, this short film was given the highest reknown of the Presidency of the Republic of Italy.",
  "plot": "In the post-World War II Val Melaina neighbourhood of Rome, Antonio Ricci (Lamberto Maggiorani) is desperate for work to support his wife Maria (Lianella Carell), his son Bruno (Enzo Staiola), and his small baby. He is offered a position posting advertising bills, but tells Maria that he cannot accept because the job requires a bicycle. Maria resolutely strips the bed of her dowry bedsheets—​​prized possessions for a poor family—​​and takes them to the pawn shop, where they bring enough to redeem Antonio's pawned bicycle. (A memorable shot shows the sheets being added to a mountain of bedding pawned by other families.) They cycle home—​​Maria on the crossbar—​​rejoicing in their good fortune. Along the way, Maria insists that she has to visit someone. Antonio discovers that it is a seer who had prophesied that Antonio would find work; Maria gives the seer money in appreciation of her prophecy. Antonio is derisive of Maria's faith in the seer, and teases her about spending money on such foolishness.\n\nOn his first day of work Antonio is atop a ladder when a young man (Vittorio Antonucci) snatches the bicycle. Antonio gives chase but is thrown off the trail by the thief's confederates. The police take a report but warn that there is little they can do. Advised that stolen goods often surface at the Piazza Vittorio market, Antonio goes there with several friends and his small son Bruno. Finding a bike that might be Antonio's they summon an officer, but the serial numbers do not match.\n\nAt the Porta Portese market Antonio and Bruno spot the thief with an old man. They pursue the thief but he eludes them. They then accost the old man demanding the thief's identity, but the old man feigns ignorance. They follow him into a church where, after disrupting the service, he slips away from them. Bruno shows dismay after this defeat, which angers Antonio, who in turn slaps his son, greatly upsetting the boy.\n\nAntonio has Bruno wait by a bridge and goes in search of the old man. Suddenly there are cries that a boy is drowning. Rushing toward the commotion Antonio is relieved to see that the drowning boy is not Bruno. Antonio treats Bruno to lunch in a restaurant, where they briefly forget their troubles, but on seeing a rich family enjoying a fine meal, Antonio is again seized by his calamity and tortures himself by reckoning his lost earnings.\n\nDesperate, Antonio consults the seer, who tells him, \"You'll find the bike today, or not at all.\" Leaving the seer's house they encounter the thief; Antonio pursues him into what turns out to be a brothel, whose denizens quickly eject them. In the street hostile neighbors gather as Antonio accuses the thief, who conveniently falls into a fit for which the crowd blames Antonio. During this commotion Bruno fetches a policeman, who searches the thief's apartment without result. The policeman tells Antonio the case is weak—​​Antonio has no witnesses and the neighbors are certain to provide the thief with an alibi. Antonio and Bruno walk off in despair amid jeers and threats from the crowd.\n\nOn their way home, they near Stadio Nazionale PNF football stadium. Inside a game is underway, while outside, rows of bicycles await their owners. Antonio sees an unattended bicycle near a doorway. He paces distractedly, then sits with Bruno on the curb, his hat in his hands. He looks as a stream of bicycles rush past—​​the world seems full of other people's bicycles. He resumes pacing, anguished and agitated, then gives Bruno a coin, telling him to take the streetcar and wait at Monte Sacro.\n\nAntonio circles the unattended bicycle, summons his courage, and jumps on it. Instantly the hue and cry is raised and Bruno, who has missed the streetcar, is stunned to see his father surrounded, pulled from the bike, slapped and insulted—​​his hat knocked off. As Antonio is being muscled toward the police station, the bicycle's owner notices Bruno, who is carrying Antonio's hat; in a moment of compassion he tells the others to release Antonio.\n\nAntonio and Bruno walk off slowly amid a buffeting crowd. Bruno hands his father the hat, crying as Antonio stares dazedly ahead, unreacting even as a truck brushes his shoulder. They look briefly at each other. Antonio fights back tears; Bruno takes his hand. The camera watches from behind as they disappear into the crowd.\n\nThe bike redeemed, the family saved\n\nFirst day on the job\n\nIn search of the stolen bike\n\nThe thief's neighbors defend him\n\nAll seems lost",
  "synopsis": null
}