{
  "imdb_id": "tt3062742",
  "tmdb_id": "250572",
  "douban_id": null,
  "title": "Break Point (2014)",
  "genres": [
    "Comedy",
    "Sport"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm1015063",
      "name": "Jay Karas"
    }
  ],
  "writer": [
    {
      "id": "nm1926674",
      "name": "Tim Calpin",
      "description": "uncredited"
    },
    {
      "id": "nm1517674",
      "name": "Gene Hong",
      "description": "story"
    },
    {
      "id": "nm1517674",
      "name": "Gene Hong",
      "description": "writer"
    },
    {
      "id": "nm1517674",
      "name": "Gene Hong",
      "description": null
    },
    {
      "id": "nm2489912",
      "name": "Kevin Jakubowski",
      "description": "uncredited"
    },
    {
      "id": "nm0005438",
      "name": "Jeremy Sisto",
      "description": "story"
    },
    {
      "id": "nm0005438",
      "name": "Jeremy Sisto",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0005438",
      "name": "Jeremy Sisto",
      "character": "Jimmy"
    },
    {
      "id": "nm1378589",
      "name": "David Walton",
      "character": "Darren"
    },
    {
      "id": "nm2796745",
      "name": "Adam Devine",
      "character": "Nick       (as Adam DeVine)"
    },
    {
      "id": "nm3019095",
      "name": "Joshua Rush",
      "character": "Barry"
    },
    {
      "id": "nm8943784",
      "name": "Bruno Acaunas",
      "character": "Official"
    },
    {
      "id": "nm4991099",
      "name": "Cy Amundson",
      "character": "Hayes Davenport"
    },
    {
      "id": "nm3188810",
      "name": "Brad Benedict",
      "character": "Joe"
    },
    {
      "id": "nm3574485",
      "name": "Mayank Bhatter",
      "character": "Line Judge-Alans"
    },
    {
      "id": "nm0116906",
      "name": "Bob Bryan",
      "character": "Himself"
    },
    {
      "id": "nm8943786",
      "name": "Carl Bryan",
      "character": "Freddie's Partner"
    },
    {
      "id": "nm1456431",
      "name": "Mike Bryan",
      "character": "Himself"
    },
    {
      "id": "nm2020825",
      "name": "Kristian Capalik",
      "character": "Freddie Mercury"
    },
    {
      "id": "nm7066987",
      "name": "Tristan Chase",
      "character": "Young Jimmy"
    },
    {
      "id": "nm0172558",
      "name": "Mo Collins",
      "character": "Barry's Mom"
    },
    {
      "id": "nm8943791",
      "name": "Steve Crosby",
      "character": "Tennis Player"
    },
    {
      "id": "nm0213419",
      "name": "Luiggi Debiasse",
      "character": "Line Judge-Final"
    },
    {
      "id": "nm3587230",
      "name": "Nate Dickens",
      "character": "Tennis Player"
    },
    {
      "id": "nm8943792",
      "name": "Eric Fingleson",
      "character": "Tennis Player"
    },
    {
      "id": "nm1429883",
      "name": "Christopher Gerse",
      "character": "Emir"
    },
    {
      "id": "nm0316723",
      "name": "Reedy Gibbs",
      "character": "Barry's Grandma"
    },
    {
      "id": "nm5781059",
      "name": "Edwin Gomez",
      "character": "Tennis Player"
    },
    {
      "id": "nm8943789",
      "name": "Phillip Gruendler",
      "character": "German #2"
    },
    {
      "id": "nm1517674",
      "name": "Gene Hong",
      "character": "Asian Opponent"
    },
    {
      "id": "nm8943790",
      "name": "Jeswin Jolly",
      "character": "Tennis Player"
    },
    {
      "id": "nm6197911",
      "name": "James Lin",
      "character": "Asian Opponent #2"
    },
    {
      "id": "nm2831949",
      "name": "Alex Marino",
      "character": "Chandy"
    },
    {
      "id": "nm0591576",
      "name": "Jerry Minor",
      "character": "Chair Umpire"
    },
    {
      "id": "nm1652345",
      "name": "Jeremy Mitchell",
      "character": "Sal Mora"
    },
    {
      "id": "nm0663177",
      "name": "Chris Parnell",
      "character": "Jay LaRoche"
    },
    {
      "id": "nm8943794",
      "name": "Mishka Ray",
      "character": "Young Darren       (as Mishka 'Michael' Ray)"
    },
    {
      "id": "nm0799777",
      "name": "J.K. Simmons",
      "character": "Jack"
    },
    {
      "id": "nm0005442",
      "name": "Amy Smart",
      "character": "Heather"
    },
    {
      "id": "nm1413601",
      "name": "Pete Staloch",
      "character": "Line Judge-Corona       (as Peter Staloch)"
    },
    {
      "id": "nm8943788",
      "name": "Christian Straka",
      "character": "German #1"
    },
    {
      "id": "nm8943785",
      "name": "Chris Thompson",
      "character": "College Player"
    },
    {
      "id": "nm3901727",
      "name": "Tim Van De Walker",
      "character": "Cameraman"
    },
    {
      "id": "nm0893283",
      "name": "Vincent Ventresca",
      "character": "Gary"
    },
    {
      "id": "nm1023127",
      "name": "Jenny Wade",
      "character": "Video Chat Girl /              Vanessa"
    },
    {
      "id": "nm0908417",
      "name": "Jason Wall",
      "character": "Alan #1"
    },
    {
      "id": "nm4703393",
      "name": "Johnno Wilson",
      "character": "Alan #2"
    },
    {
      "id": "nm8943793",
      "name": "Ethan Wolferman",
      "character": "Tennis Player"
    },
    {
      "id": "nm8943787",
      "name": "Nome Wynn",
      "character": "Osborne"
    }
  ],
  "overview": "Jimmy Price is a reckless man-child on the last leg of his career as a doubles tennis player. When his latest partner drops him, he realizes he's officially burned all of his bridges on the pro circuit. He decides to make one last ditch effort to revive his career, reaching outside of the tennis world and convincing his childhood partner -- his estranged brother Darren, now an apathetic substitute teacher - to team up with him. The mismatched pair, with the help of a unique 11-year-old named Barry, make an unlikely run at a grand slam tournament and are forced to re-discover their game, and their brotherhood.",
  "storyline": "Two estranged brothers reunite to make an improbable run at a grand slam tennis tournament.",
  "plot": "Extreme sport athlete Johnny Utah (Luke Bracey), and his friend Jeff (Max Thieriot), are traversing a steep ridgeline on motorbikes. The run ends with a jump onto a lone stone column, where Jeff overshoots the landing and falls to his death.\n\nSeven years later, Utah is an FBI agent candidate. He attends a briefing on a skyscraper heist, in which the criminals steal diamonds, escaping by parachute, in Mumbai. A similar heist happens over Mexico where the criminals unload millions of dollars in bills over Mexico, then disappear into the Cave of Swallows. Utah's research concludes that they were done by the same men, who are attempting to complete the Ozaki 8, a list of eight extreme ordeals to honor the forces of nature. They have already completed three, and Utah predicts they'll attempt the fourth on a rare sea wave phenomenon in France. After presenting his analysis, Utah is sent undercover to France under a field agent named Pappas (Ray Winstone). They reach France and Utah gets help from others to surf the tall tube wave.\n\nAs he goes in, there is already another surfer in the wave, leaving Utah with an unstable wave. Utah gets sucked into the wave and faints, but the other surfer bails and rescues Utah. He wakes aboard a yacht with the surfer, Bodhi (Édgar Ramírez), and his team Roach (Clemens Schick), Chowder (Tobias Santelmann), and Grommet (Matias Varela). They leave him to enjoy the party and he gets acquainted with a girl, Samsara (Teresa Palmer). The next day, Utah finds the men in an abandoned Paris train station after he overhears them talk about the location. Bodhi gives him an initiation fight and soon he is accepted in the circle. They travel to the Alps for the next ordeal, wingsuit flying through the cliffs \"The Life of Wind\". The four succeed in their attempt and spend some time together with Samsara. The next day, they climb the snow peaks for the sixth ordeal, snowboarding through a steep wall of snow. They reach their spot, but Utah decides to extend his line so the others follow him. Chowder slips and falls to his death, and Utah becomes depressed about it.\n\nAfter a party, Samsara explains that she and Bodhi both knew Ono Ozaki when they were young, that her parents died in an avalanche accident and Ozaki gave her a home after. She explains further that Ozaki actually completed his third ordeal, as was widely believed. He did not die attempting the ordeal, but was actually killed by a whaling ship crashing into his boat while he was trying to save humpback whales. On his boat, a young boy, Bodhi, decided not to tell the truth of his story but to finish what Ozaki started.\n\nNext they travel to a gold mine where Bodhi detonates explosives Grommet and Roach planted. After blowing his cover, Utah chases Bodhi, managing to trip his bike. Bodhi escapes as Utah cannot stand up after the crash. The FBI freezes Bodhi's sponsors' assets; Bodhi plans to rob a nearby Italian bank on a mountain top. Utah and the police intercept the group, resulting in a crossfire that kills Roach. As the group flees, Utah chases and shoots one of them to death, revealed to be Samsara and not Bodhi.\n\nUtah finds the location of the next ordeal: solo rock climbing with no safety beside a waterfall Angel Falls in Venezuela. He finds Bodhi and Grommet and chases them on the climb, but Grommet cramps and falters, falling to his death. Utah catches up to Bodhi, but he leaps down the waterfall, completing what would have been the last ordeal; Bodhi has to redo the fourth ordeal as he bailed out on the wave when he had to save Johnny. Seventeen months later, Utah finds him in the Pacific facing another giant wave. As Utah tries to get Bodhi to come back with him, and pay for his crimes, he eventually lets Bodhi attempt to surf it, both knowing that he will not come back. The wave engulfs Bodhi and Utah continues his career in the FBI, and starts to go through his own eight ordeals.",
  "synopsis": null
}