{
  "imdb_id": "tt3045760",
  "tmdb_id": "203854",
  "douban_id": null,
  "title": "Kil (2013)",
  "genres": [
    "Action",
    "Drama",
    "Mystery"
  ],
  "country": "Malaysia",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm5796019",
      "name": "Nik Amir Mustapha"
    }
  ],
  "writer": [
    {
      "id": "nm5796023",
      "name": "Rewan Ishak",
      "description": null
    },
    {
      "id": "nm5796019",
      "name": "Nik Amir Mustapha",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3600063",
      "name": "Redza Minhat",
      "character": "Akil"
    },
    {
      "id": "nm5796021",
      "name": "Cristina Suzanne Stockstill",
      "character": "Zara"
    },
    {
      "id": "nm2143879",
      "name": "Harun Salim Bachik",
      "character": "Mr. Harun"
    },
    {
      "id": "nm5796022",
      "name": "Dira Abu Zahar",
      "character": "Salina"
    },
    {
      "id": "nm1106162",
      "name": "Hasnul Rahmat",
      "character": "Johan Iskandar"
    },
    {
      "id": "nm1308992",
      "name": "Anne James",
      "character": "Mrs. Jasmine"
    },
    {
      "id": "nm3879634",
      "name": "Juliana Evans",
      "character": "School Girl       (as Juliana Sophie Evans)"
    },
    {
      "id": "nm6884532",
      "name": "Aidil Rusli",
      "character": "Entertainment Reporter Aidil Manjalara"
    },
    {
      "id": "nm6884533",
      "name": "Mohd Anuar Mohamed Zakri",
      "character": "Akil's Boss"
    },
    {
      "id": "nm3954621",
      "name": "Raja Noor Baizura",
      "character": "Akil's Mother"
    },
    {
      "id": "nm6884534",
      "name": "Ella Aminuddin",
      "character": "Ella (Akil's Neighbour)"
    },
    {
      "id": "nm6884535",
      "name": "Atilia Raja Harun",
      "character": "Johan's Wife"
    },
    {
      "id": "nm6884536",
      "name": "Johan Iskandar",
      "character": "L.A.B. Agent"
    },
    {
      "id": "nm6884537",
      "name": "Jipie",
      "character": "Policeman #1"
    },
    {
      "id": "nm6884538",
      "name": "Asp Muhammad Zulhilmi",
      "character": "Policeman #2"
    },
    {
      "id": "nm6884540",
      "name": "Junad Mat Nor",
      "character": "Co-worker #1"
    },
    {
      "id": "nm6884541",
      "name": "Elly Rahman",
      "character": "Co-worker #2"
    },
    {
      "id": "nm6884539",
      "name": "Ungku Annuar",
      "character": "Shahir (Akil's Brother)"
    },
    {
      "id": "nm6884542",
      "name": "Hamidah Jemima Aziz",
      "character": "Mimi (Johan's Daughter)"
    },
    {
      "id": "nm5434211",
      "name": "Ray Nordin",
      "character": "Pak Samad"
    },
    {
      "id": "nm6884544",
      "name": "Soon Hoe Yap",
      "character": "Mechanic"
    },
    {
      "id": "nm6884545",
      "name": "Ham Abdullah",
      "character": "Victim"
    },
    {
      "id": "nm6884543",
      "name": "Zaleha Mohamad",
      "character": "Aunt Rose"
    },
    {
      "id": "nm6884546",
      "name": "Fazrik Kamarudin",
      "character": "Businessman"
    },
    {
      "id": "nm6884547",
      "name": "Khairul Zaman Dzulkifly",
      "character": "Fruit Vendor"
    },
    {
      "id": "nm6884548",
      "name": "Mengster",
      "character": "Black Figure"
    }
  ],
  "overview": "kil is a depressed young man who has suicidal tendencies but he could never bring himself to commit suicide. His attempts to die always fail miserably until he finds the perfect solution: a quirky assassination agency that helps kill suicidal people. The assassination will be anonymous. He would not know the details about who the assassin is, even when or where he will die. This was ideal for Akil, until he falls for a girl he meets, Zara. Suddenly, he starts to have second thoughts on taking his life.",
  "storyline": "Akil (KIL), a quiet and depressed young man sees suicide as an solution though he never succeeds in pulling it off. A chance encounter brings him face to face with the \"Life Action Bureau\" or LAB, an organization that will help him end his life. But after being bound to LAB's terms and conditions, he meets pretty and vivacious Zara with whom he eventually falls in love with and gives him a reason to live. The new Akil who embraces life must now race against time to undo what he has set in motion before he gets killed.",
  "plot": "In Canton, Mississippi, two white supremacists, Billy Ray Cobb and Pete Willard, kidnap a ten-year-old African-American girl named Tonya. They violently rape and beat her and dump her in a nearby river after a failed attempt to hang her; she survives, and the men are arrested.\n\nTonya's father, Carl Lee Hailey, contacts Jake Brigance, a white lawyer. Brigance admits the possibility that the rapists will walk free. Carl Lee goes to the county courthouse and opens fire with an automatic rifle, killing both rapists and unintentionally injuring Deputy Looney. Carl Lee is arrested. Brigance agrees to defend Carl Lee.\n\nThe rape and subsequent revenge killing gain national media attention. The district attorney, Rufus Buckley, decides to seek the death penalty, and presiding Judge Omar Noose denies Brigance a change of venue. Brigance seeks help from his defense team: law student Ellen Roark, close friend Harry Rex Vonner, and former mentor and long-time activist Lucien Wilbanks, a once-great civil rights lawyer.\n\nThe Ku Klux Klan begins to organize in the area. Klansman Freddie Lee Cobb—Billy Ray's brother—targets Brigance, burning a cross on his lawn and threatening his wife and daughter. When Brigance refuses to back down, Cobb kidnaps and assaults Roark.\n\nThe presiding judge refuses Brigance's request for a change of venue to a more ethnically diverse county, meaning that Carl Lee will have an all-white jury. Dispirited, Brigance tells Carl Lee that there is little hope for an acquittal. Carl Lee replies that he had chosen him as an attorney because even a racist jury would listen to a white man; as \"one of the bad guys\", he has an influence that a black man will never have. During closing arguments, a deeply shaken Brigance tells the jury to close their eyes and listen to a story. He describes, in slow and painful detail, the rape of a 10-year-old girl, recalling the story of Tonya's rape. He then asks the jury, in his final comment, to \"now imagine she's white.\"\n\nAfter deliberation, a black child runs out of the courthouse and screams, \"He's innocent!\" Jubilation ensues amongst the supporters outside. The Klan, enraged, begins yelling in anger. Meanwhile Sheriff Ozzie Walls manages to arrest Freddie Lee for his crimes, as well as a corrupted deputy that was by Freddie's side.\n\nBrigance brings his wife and daughter to a family cookout at Carl Lee's house to celebrate his freedom.",
  "synopsis": null
}