{
  "imdb_id": "tt3053860",
  "tmdb_id": "270342",
  "douban_id": null,
  "title": "The Chef's Wife (2014)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm0494504",
      "name": "Anne Le Ny"
    }
  ],
  "writer": [
    {
      "id": "nm6387899",
      "name": "Axelle Bachman",
      "description": "story support"
    },
    {
      "id": "nm0494504",
      "name": "Anne Le Ny",
      "description": "screenplay dialogue"
    }
  ],
  "cast": [
    {
      "id": "nm0895759",
      "name": "Karin Viard",
      "character": "Marithé Bressy"
    },
    {
      "id": "nm0222922",
      "name": "Emmanuelle Devos",
      "character": "Carole Drissi"
    },
    {
      "id": "nm0954704",
      "name": "Roschdy Zem",
      "character": "Sam Drissi"
    },
    {
      "id": "nm0714235",
      "name": "Philippe Rebbot",
      "character": "Pierre Perusel"
    },
    {
      "id": "nm0494504",
      "name": "Anne Le Ny",
      "character": "Nathalie Perusel"
    },
    {
      "id": "nm0294417",
      "name": "Philippe Fretun",
      "character": "Michel"
    },
    {
      "id": "nm0580382",
      "name": "Annie Mercier",
      "character": "Jackie"
    },
    {
      "id": "nm1742958",
      "name": "Marion Lecrivain",
      "character": "Dorothée"
    },
    {
      "id": "nm3287084",
      "name": "Yan Tassin",
      "character": "Théo"
    },
    {
      "id": "nm6387892",
      "name": "Marion Malenfant",
      "character": "Cynthia"
    },
    {
      "id": "nm0208756",
      "name": "Xavier de Guillebon",
      "character": "Vincent"
    },
    {
      "id": "nm0827622",
      "name": "Alain Stern",
      "character": "L'agent immobilier"
    },
    {
      "id": "nm0067328",
      "name": "Xavier Beja",
      "character": "Pascal"
    },
    {
      "id": "nm0228075",
      "name": "Pierre Diot",
      "character": "Le jogger"
    },
    {
      "id": "nm0053620",
      "name": "Jean-Gilles Barbier",
      "character": "Le militaire"
    },
    {
      "id": "nm0109271",
      "name": "Marie Agnès Brigot",
      "character": "Zouzou"
    },
    {
      "id": "nm6387893",
      "name": "Claire Desage",
      "character": "Une ouvrière licenciée par Monjouet"
    },
    {
      "id": "nm0831581",
      "name": "Diane Stolojan",
      "character": "Une ouvrière licenciée par Monjouet"
    },
    {
      "id": "nm5691358",
      "name": "Sarah Bussy",
      "character": "Une formatrice de l'AFPA"
    },
    {
      "id": "nm6387894",
      "name": "Aurélien Vacher",
      "character": "Le jeune commis"
    },
    {
      "id": "nm6387895",
      "name": "Noémie Strouck",
      "character": "La commis"
    },
    {
      "id": "nm4090887",
      "name": "Augustin Bonhomme",
      "character": "Le serveur"
    },
    {
      "id": "nm1317075",
      "name": "Adeline Moreau",
      "character": "La serveuse"
    },
    {
      "id": "nm6387896",
      "name": "Jonathan Cohen",
      "character": "Le chef de salle"
    },
    {
      "id": "nm6387897",
      "name": "Paul Gleizes",
      "character": "Le premier marmiton"
    },
    {
      "id": "nm6387898",
      "name": "Audrey Meschi",
      "character": "Le second marmiton"
    },
    {
      "id": "nm6387899",
      "name": "Axelle Bachman",
      "character": "Une dame au mariage"
    },
    {
      "id": "nm3146179",
      "name": "Paulette Honoré-Peyre",
      "character": "La fillette aux ballons"
    },
    {
      "id": "nm1594724",
      "name": "Freddy Viau",
      "character": "Le maître d'oeuvre du chantier"
    },
    {
      "id": "nm3445964",
      "name": "Pascal Tantot",
      "character": "L'homme du couple d'acheteurs"
    },
    {
      "id": "nm2617497",
      "name": "Mélanie Vaugeois",
      "character": "La femme du couple d'acheteurs"
    }
  ],
  "overview": "Marithé works in a training center for adults. Her mission: to help other people to change direction in their work and to find their vocation. Carole, who lives and works in the shadow cast by her husband, Sam, an energetic and talented Michelin-starred chef, arrives in the center one day. It's not so much a change in job that Carole seems to need, as a change in husband. Marithé does everything she can to help Carole set out down a new path. But what are the real motives behind this devotion? After all, Marithé doesn't seem to be impervious to Sam's charms, or to his cooking.",
  "storyline": "The wife of a successful chef feels unfulfilled in her rôle as dining-room hostess and consults career counselor, who is herself dissatisfied by her useful but mundane place in the scheme of things. Without meaning to, the two women find their lives growing tangled together, with ever more complex tragicomic consequences.",
  "plot": "Left to right: Hans Moleman, James Hetfield, Lars Ulrich, Kirk Hammett and Robert Trujillo.\nWhile driving the Springfield Elementary School's students to school, Otto stops to meet the members of Metallica (James Hetfield, Lars Ulrich, Kirk Hammett, and Robert Trujillo), whose tour bus has broken down. Behind him, however, Bart takes over driving the school bus, saying \"Look at me, I'm Otto! I'm 100 years old and I drive a school bus!\" and drives it to school, embarrassing Otto in front of Metallica. Kirk Hammett calls out to Otto, \"Hey loser! We got a ride from a real fan!\", and Robert Trujillo tells him \"Never listen to our music again!\". The entire band leaves, hitching a ride with Hans Moleman (who reveals to having slept with Lars's grandmother) instead of Otto, and playing the introduction from \"Master of Puppets\" while they ride away. At the school, a fuming Otto arrives and spanks Bart. Noticing this act of corporal punishment, Principal Skinner suspends Otto from driving the school bus. For this reason, Marge has to drive carpool to several of Bart and Lisa's friends. After picking up Milhouse Van Houten, Sherri, Terri, and Nelson, she finally picks up an introverted boy named Michael. Michael, clearly an outcast with no friends, is bullied by Nelson in the car. He forgets his math book at home, prompting Marge to drive him back to pick it up. While there, his math book is handed to him by his father, Fat Tony. Terrified, Nelson immediately takes back all his insults.\n\nNews of Michael's \"family\" spreads, and everyone tries to keep their distance from him. Some, like Ralph, are in fear because Fat Tony shot their parents. Lisa joins a lonely Michael at lunch, and they become friends. She comes to find Michael is a talented cook, which he claims to be his dream, rather than go into the family business of \"waste management\". After school, Fat Tony drives the children home, but on the way goons working for Fat Tony's rivals, the Calabresi family, attack them. Tony manages to slip them, and when they arrive at the Simpson house, Michael invites the family over for dinner. At Fat Tony's mansion, the Calabresis show up unexpectedly for a sit-down during dinner. Fat Tony advises the Calabresis against killing him as his son, Michael, would then take his place and exact a brutal vengeance. Michael, however, arrives, serving souffles to the mobsters, who love it, but are surprised when they find out he made them. The Calabresis laugh at Tony, calling Michael Chef Boyaregay and leave. Fat Tony admonishes Michael for making him look weak in front of his enemies. Suddenly, an attack helicopter appears at the window and guns Fat Tony down.\n\nAt the hospital, Fat Tony lies unconscious, and Johnny Tightlips explains to the other mobsters that, with the boss down, the Calabresis would be trying to finish the job. He tells Michael that he should step up, but when he expresses dismay, Homer volunteers to take his place as mob boss. He and Bart proceed to do Mafia dirty work, including rough treatment of Moe and Krusty. However, Michael notices how this amount of power is turning the two more maniacal (they are plotting various ways to injure/kill Ned Flanders) and seeks to put an end to it. One night, he invites the Calabresis to the Simpsons' for dinner, where he informs them that they have won and that he is out of the family business. They applaud his decision, but end up choking and dying over their own meals. Marge discovers the food had been poisoned, and although Michael appears remorseful, Lisa finds out it was intentional. At Fat Tony's mansion, Fat Tony congratulates Michael for taking down their enemies. Outside, Lisa asks Michael why he did not tell Fat Tony it was all an accident. Michael bluntly tells her to never ask him about his business, and disappears into a room with Jimbo, Dolph and Kearney, who closes the door in Lisa's face. Lisa opens the door to see Michael and co. playing with Hot Wheels, only to have Kearney close the door on her again, as a reference to the ending in The Godfather.",
  "synopsis": null
}