{
  "imdb_id": "tt3097204",
  "tmdb_id": "242022",
  "douban_id": null,
  "title": "The Inbetweeners 2 (2014)",
  "genres": [
    "Comedy",
    "Family"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "96 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm1720648",
      "name": "Damon Beesley"
    },
    {
      "id": "nm0606597",
      "name": "Iain Morris"
    }
  ],
  "writer": [
    {
      "id": "nm1720648",
      "name": "Damon Beesley",
      "description": "written by and"
    },
    {
      "id": "nm0606597",
      "name": "Iain Morris",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm3020713",
      "name": "Simon Bird",
      "character": "Will McKenzie"
    },
    {
      "id": "nm0118617",
      "name": "James Buckley",
      "character": "Jay Cartwright"
    },
    {
      "id": "nm3002919",
      "name": "Blake Harrison",
      "character": "Neil Sutherland"
    },
    {
      "id": "nm3022504",
      "name": "Joe Thomas",
      "character": "Simon Cooper"
    },
    {
      "id": "nm4970834",
      "name": "Emily Berrington",
      "character": "Katie"
    },
    {
      "id": "nm2238815",
      "name": "Freddie Stroma",
      "character": "Ben"
    },
    {
      "id": "nm0275913",
      "name": "David Field",
      "character": "Uncle Bryan"
    },
    {
      "id": "nm0829134",
      "name": "Belinda Stewart-Wilson",
      "character": "Polly McKenzie"
    },
    {
      "id": "nm4309809",
      "name": "Tamla Kari",
      "character": "Lucy"
    },
    {
      "id": "nm3617801",
      "name": "Lydia Rose Bewley",
      "character": "Jane"
    },
    {
      "id": "nm0769442",
      "name": "David Schaal",
      "character": "Terry"
    },
    {
      "id": "nm1276507",
      "name": "Alex Macqueen",
      "character": "Kevin Sutherland"
    },
    {
      "id": "nm1829595",
      "name": "Greg Davies",
      "character": "Phil Gilbert"
    },
    {
      "id": "nm0872040",
      "name": "Martin Trenaman",
      "character": "Alan Cooper"
    },
    {
      "id": "nm0915948",
      "name": "Robin Weaver",
      "character": "Pamela Cooper"
    },
    {
      "id": "nm2306975",
      "name": "Felicity Ward",
      "character": "Lizzie"
    },
    {
      "id": "nm4916360",
      "name": "Oliver Johnstone",
      "character": "Kristian"
    },
    {
      "id": "nm5031630",
      "name": "Brad Kannegiesser",
      "character": "Jasper       (as Bradley Kannegiesser)"
    },
    {
      "id": "nm1941294",
      "name": "Susan Wokoma",
      "character": "Della"
    },
    {
      "id": "nm0169982",
      "name": "Lucy Cohu",
      "character": "Nikki"
    },
    {
      "id": "nm1621864",
      "name": "Tom Wren",
      "character": "Stephen"
    },
    {
      "id": "nm4239572",
      "name": "Bibi Nerheim",
      "character": "Agnetha"
    },
    {
      "id": "nm2321381",
      "name": "Nelle Lee",
      "character": "Booth Attendant"
    },
    {
      "id": "nm2022874",
      "name": "Candice Storey",
      "character": "Young Mum"
    },
    {
      "id": "nm5370478",
      "name": "Cameron Caulfield",
      "character": "Aussie Kid"
    },
    {
      "id": "nm2289053",
      "name": "Kazuya Wright",
      "character": "Aussie Dad"
    },
    {
      "id": "nm1835523",
      "name": "Adam Nagaitis",
      "character": "Pete"
    },
    {
      "id": "nm0857173",
      "name": "Abigail Thaw",
      "character": "Shaman"
    },
    {
      "id": "nm5307166",
      "name": "Claudia O'Doherty",
      "character": "Airline Rep"
    },
    {
      "id": "nm0799402",
      "name": "Anthony Simcoe",
      "character": "Ken Webster"
    }
  ],
  "overview": "Neil, Will and Simon receive an invite from Jay to join him in Australia whilst on his gap year, who promises them it’s ”the sex capital of the world”. With their lives now rather dull compared to their hedonistic school days and legendary lads holiday, it’s an offer they can’t refuse. Once again, they put growing up temporarily on-hold, and embark on a backpacking holiday of a lifetime in an awful car, inspired by Peter Andre’s ‘Mysterious Girl’. Will soon finds himself battling with the lads to do something cultural, whilst they focus their attention on drinking, girls, and annoying fellow travelers.",
  "storyline": "Neil, Will and Simon receive an invite from Jay to join him in Australia whilst on his gap year, who promises them it's ''the sex capital of the world''. With their lives now rather dull compared to their hedonistic school days and legendary lads holiday, it's an offer they can't refuse. Once again, they put growing up temporarily on-hold, and embark on a backpacking holiday of a lifetime in an awful car, inspired by Peter Andre's 'Mysterious Girl'. Will soon finds himself battling with the lads to do something cultural, whilst they focus their attention on drinking, girls, and annoying fellow travelers.",
  "plot": "Teenage friends Will McKenzie, Simon Cooper, Jay Cartwright, and Neil Sutherland have finished their A-levels and are about to leave Rudge Park Comprehensive, much to the relief of Mr. Gilbert, their sardonic sixth form tutor. Within their final week of school, Jay's grandfather dies, Simon is dumped by his girlfriend Carli D'Amato, and Will's divorced father tells him he has married his much younger mistress. The boys decide to go on holiday together and Neil books them a trip to Malia, Crete.\n\nAt a bar, they meet four girls: Alison, Lucy, Lisa and Jane. Their initial meeting does not go smoothly, but the girls arrange to meet the boys at their hotel the next day. Outside the bar, Simon sees Carli across the street and talks awkwardly with her before being knocked down by a quad-bike ridden by James, a cocky and abusive bully club rep and Carli's new boyfriend. She reveals she is going to an all-day boat party later in the week, and Simon pledges to meet her there.\n\nThe next day, Jay and Simon get into an argument over Simon's continuing obsession with Carli and Jay's continual false bravado and they brawl in the street until Will and Neil drag off Simon and Jay, respectively, in different directions. Desperate to buy a ticket for the boat party, Simon naively sells all his clothes to James, including what he is wearing, but receives no money for it. Meanwhile, Jay angrily tears up two of the four boat party tickets he secretly bought for all of them while drunk the night before as a surprise. Jay and Neil encounter James and his friends in a bar and they try to join in and befriend them but James rejects them and verbally abuses them both and threatens to injure Jay if they don't leave which makes Jay cry. Later that evening, the four boys meet back at the empty bar and reconcile. The girls then turn up and suggest that they all go skinny dipping at the local beach. Jane attempts to kiss Jay, but when two men poke fun at him over her weight and Jay pulls away, she leaves him behind. Will has better luck with Alison until she spots her boyfriend, Nicos, having sex with another woman, and she leaves crying. In the water, Lucy and Simon appear to be growing closer, and are about to kiss, but Simon sees Carli on the beach and leaves Lucy alone in the sea.\n\nThe next day, they meet the girls again at the beach. Alison gives Will Nicos' ticket, while Simon apologises to Lucy, and she offers him her boat party ticket so that he can be with Carli. On board, Simon witnesses an argument between Carli and James. Carli then kisses Simon passionately, and he is elated, until he realises that she is just using him to make James jealous. Finally seeing Carli for what she really is, he ditches her. Meanwhile, Jay apologises to Jane and they form a relationship as do Will and Alison and Neil and Lisa. Later Jay and Jane run into James who mockingly makes fun of Jane's weight and demands a 20 euro note off Jay so that he can snort drugs. Jay gets his own back on him by taking a note that was secretly concealed in his anus and gives it to James. James then snorts cocaine unknowingly walking around with the feces sticking out of his nose causing the girls he flirts with to move away from him in disgust much to his confusion. Simon finally sees that Lucy is more worthy of his attention than the shallow Carli, and knowing that he has been less than kind to her, he decides to swim to shore as a grand romantic gesture, but he struggles and almost drowns. As he is loaded into an ambulance, Lucy kisses him and they reconcile. After the boat party is over, the other boys and girls visit Simon in hospital, and once he recovers they all spend the rest of their holiday together as couples. In a final scene before the credits, a drunken Mr. Gilbert is seen riding a quad bike through the streets of Malia in his underwear with a tie round his head in a John Rambo style.",
  "synopsis": "Will (Simon Bird), Neil (Blake Harrison) and Jay's (James Buckley) girlfriends have all broken up with them since the events of the last film, and Simon (Joe Thomas) wants to break-up with his girlfriend, Lucy (Tamla Kari), who has become too clingy. Will and Simon are at university, Neil is working in a bank and Jay is taking a gap year in Australia. He emails the others, claiming that he is now a top DJ, runs a huge night club, lives in a luxury mansion and has daily sex with multiple partners, convincing them to join him there for a holiday.Once they arrive at the club they find Jay in fact only works as a toilet attendant. While at the club, Will meets Katie (Emily Berrington), an old friend who is backpacking, and she convinces him to join her. Jay in fact lives in a tent in the front garden of his uncle's house; there Simon attempts to break-up with Lucy via a Skype call. Jay's uncle's interferes and tricks Lucy into thinking Simon asked her to marry him.The four main characters drive to Byron Bay, along with the backpackers\nThe next day the four travel to a youth hostel in Byron Bay in a Peter Andre-inspired car, as Will wants to follow Katie there. He attempts to become friends with one of the backpackers, Ben, but he is looked down upon because it is clear that he is a tourist and not a \"traveller\". After arriving, Will Skypes his mother and notices that someone else is staying at their house, which she tries to deny.The following day, the boys and the backpackers visit a water park, where Jay intends to find his ex-girlfriend, Jane (Lydia Rose Bewley). The park staff tell Jay that Jane has found a new job in the vast outback, but they don't know specifically where he can find her. Lucy tells Simon via Skype that Jane is working on a stud farm in the remote settlement of Birdsville, and the boys intend to drive there. Will however decides to follow Katie instead. He struggles to fit in with the 'spiritual' activities of the travellers and discovers that Katie is seeing multiple people at once, launching him into one of his foul-mouthed tirades towards them, which leads Katie into having sex with Ben (Freddie Stroma).The next day Will leaves the hostel and by plane travels to reunite with his friends. While driving to Jane's workplace, their car runs out of petrol in the middle of the desert and the four unsuccessfully attempt to find a source of water or help. Desperately dehydrated, Simon resorts to drinking Neil's urine, but Neil misses and urinates over his face. The group hold hands together as they realise that they will most likely die, but are rescued by Jane and her co-workers. It is revealed they have only been stranded for a couple of hours. Jane realises how far Jay came to win her over again, and although she is touched by the gesture, she does not take him back.Back at Jay's uncle's house, the boys find that their parents have travelled to find them after hearing of their 'near-death' experience. The boys are shocked to find Mr Gilbert (Greg Davies) (their old head of sixth form and Will's nemesis) there too, and Will's mother (Belinda Stewart-Wilson) announces that she and Gilbert are in a relationship, to the abject horror of Will and amusement of the other three friends. Meanwhile, Jay finally shows some backbone and slaps his uncle for insulting Jane's weight, instigating a fight between his uncle and father. Over Skype, Lucy breaks-up with Simon because she is now in a relationship with his university 'best friend' Pete, which Simon responds to by cheering and abruptly hanging-up on her.The four boys decide to travel to Vietnam in a montage during the film's credits. As they return to England, Will's mother reveals that she and Gilbert are engaged and he attempts to run away from them back towards their plane, but is wrestled to the ground by security."
}