{
  "imdb_id": "tt3044882",
  "tmdb_id": "215383",
  "douban_id": null,
  "title": "Nasha (2013)",
  "genres": [
    "Drama",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "122 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.2,
  "director": [
    {
      "id": "nm0768289",
      "name": "Amit Saxena"
    }
  ],
  "writer": [
    {
      "id": "nm5795153",
      "name": "Ajit Rajpal",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm5795152",
      "name": "Poonam Pandey",
      "character": "Anita"
    },
    {
      "id": "nm5805017",
      "name": "Shivam Patil",
      "character": "Sahil"
    },
    {
      "id": "nm10133836",
      "name": "Vishal Bhonsle",
      "character": "Samuel"
    },
    {
      "id": "nm1231900",
      "name": "Mohit Chauhan",
      "character": "Saahil's Uncle"
    },
    {
      "id": "nm4957588",
      "name": "Ranbir Chakma",
      "character": "Tenzin"
    },
    {
      "id": "nm5805018",
      "name": "Sheetal Singh",
      "character": "Tia"
    },
    {
      "id": "nm5805019",
      "name": "Rohan Khurana",
      "character": "Sunny"
    },
    {
      "id": "nm5805021",
      "name": "Chirag Lobo",
      "character": "Tarun"
    },
    {
      "id": "nm6975822",
      "name": "Tanuka Laghate",
      "character": "Prachi"
    },
    {
      "id": "nm4350921",
      "name": "Nikhil Desai",
      "character": "Pawan"
    },
    {
      "id": "nm10027523",
      "name": "Nation Chakma",
      "character": "Entertainer"
    },
    {
      "id": "nm7786990",
      "name": "Akshay Bhagat",
      "character": "Doctor"
    },
    {
      "id": "nm5805020",
      "name": "Raj Kesaria",
      "character": "Raj"
    },
    {
      "id": "nm6829329",
      "name": "Afreen Khan",
      "character": "as Bubly"
    }
  ],
  "overview": "It is the story of an 18 year old boy who falls hopelessly in love with a 25 year old woman. A woman he cannot have, but a woman he cannot help but desire. And, as is the case with desires unfulfilled, they turn into obsessions. The movie emphasizes that in a world of temptation, romance is temporary, love is lonely, but addiction is forever",
  "storyline": "It is the story of an 18 year old boy who falls hopelessly in love with a 25 year old woman. A woman he cannot have, but a woman he cannot help but desire. And, as is the case with desires unfulfilled, they turn into obsessions. The movie emphasizes that in a world of temptation, romance is temporary, love is lonely, but addiction is forever.",
  "plot": "The story is set in Panchgani, a hill station. Saahil and his gang of friends are a bunch of teenagers in school who have their share of fun and pranks. Saahil has a girlfriend called Tia. During the summer break, he and his friends are introduced to Anita, the new dramatics teacher. She decides to make them do a play. All the boys in the group fall for her beauty and persona. But its Saahil who gets the most intrigued by her. Slowly, he realises he cannot think of anything but her. As rehearsals of the play go on, he innocently starts to fantasize about being with her.\n\nOne day while rehearsing for the play, Anita's boyfriend Samuel turns up at home and surprises her. Anita and Sam are a happy couple which makes Saahil envious and unhappy. Later one night, while returning from a movie, seeing Sam and Anita cuddle in the car makes him uncomfortable and he tells Sam to stop the car and walks back home. Sam seeing Saahil's emotions tells Anita that Saahil loves her which Anita laughs over it. Over the next few days, Sam to prove his point starts teasing Saahil which makes Saahil angry and one day while having a race, Sam purposefully pushes Saahil who gets hurt. Anita scolds Sam for behaving like a child. Saahil's friends now realising that Saahil has some feelings for Anita starts teasing him by passing comments about Anita and Sam. Saahil gets offended when he hears them say that Sam and Anita having sex every night, and gets into a physical brawl with his friend. Angry and suspicious, he goes to Anita's home in the night and enters the house through the window. He's shocked to see Anita and Sam having sex. Heart broken, he is about to leave when he accidentally pushes a table which makes a noise. Anita comes out to check and is shocked seeing Saahil while Saahil sees Anita nude. The next day morning, Saahil comes to Anita's house for the rehearsal. Anita, extremely angry with him for what he did last night, scolds him and tells him to get out of the play. Because of this incident, Tia also has a very emotional break up with Saahil.\n\nA few days later, Anita gets a phone call from the police station. There she comes to know that Sam had taken one of her students (who also is Saahil's friend) to a rave party. Police had conducted a raid where she was caught, and Sam somehow escaped. Anita and Sam have a fight, and Sam being drunk, slaps Anita and leaves her. Saahil comes to know about the fight and goes and meets her. Both reconcile. In the evening, he takes some home-made biryani to Anita's place to make her feel better, only to find Sam there, talking to Anita. He is again hurt, and leaves. Anita sees him going. The next day, Anita goes to Saahil's place and meets his uncle and father. Upon seeing Saahil as he comes out to check who has come, she apologises to him and takes him out for a cup of coffee. Here, she tells him that things are finally over between her and Samuel, which turns Saahil's mood around.\n\nA few days later, Anita along with Saahil's friends come to his house to celebrate Saahil's birthday. After the party, he goes to her house with a wine bottle. They celebrate together, drink, and happen to kiss. But Anita realising her mistake, stops him and asks him to leave. Anita now knows that she has begun to love Saahil, who is heartbroken upon being literally thrown out of the house. Later, Saahil's uncle and father meet Anita to ask her what the matter with Saahil is, and Anita simply assures them that things will be back to normal in a few days. Anita then resigns from her job at school and informs Saahil. Saahil reaches her house in a desperate attempt to stop her, where a highly emotional showdown takes place between them, and they finally make love. She also confesses her love for him.\n\nLater, after Anita leaves Panchgani, Saahil reads her letter to him stating that they have to part ways as what happened between them is not right. And in the future, if they're meant to meet again, they would meet in another time and place, as different individuals. She tells him to forget her. Saahil breaks down with a sense of finality as he finishes reading the letter. Later, he goes to meet his friends where he reconciles with all of them including Tia, as he looks back at this entire experience of his with a new, mature perspective.",
  "synopsis": "The story is set in Panchgani, a hill station. Saahil and his gang of friends are a bunch of teenagers in school who have their share of fun and pranks. Saahil has girlfriend called Tia. During the summer break, he and his friends are introduced to Anita, the new dramatics teacher. All the boys in the group fall for her beauty and figure. But it is Saahil who gets the most attracted. Over time, he cannot think of anything but her. He even starts masturbating at night thinking of her.One day while rehearsing for the play, Anita's boyfriend Sam turns up at home and surprises her. Anita and Sam are a happy couple which makes Saahil unhappy. Later one night, while returning from a movie, seeing Sam and Anita cuddle in the car makes him uncomfortable and he tells Sam to stop the car and walks back home. Sam sensing Saahil's emotions tells Anita that Saahil loves her which Anita laughs off. Over the next few days, to prove his point, Sam starts teasing Saahil which makes Saahil angry. One day while having a race, Sam purposefully pushes Saahil who gets hurt. Anita scolds Sam for behaving like a child. Saahil's friends now realizing that Saahil has some feelings for Anita starts teasing him by passing comments about Anita and Sam. Saahil gets offended when he hears them say that Sam and Anita make love every night and starts beating his friends. Angry and suspicious, he goes to Anita's home in the night and enter the house through the window. He's shocked to see Anita and Sam make love. Heart broken, he is about to leave when he accidentally pushes a table which makes a noise. Anita comes out to check and is shocked seeing Saahil while Saahil sees Anita nude.The next day morning, Saahil comes to Anita's house for the rehearsal. Anita is angry because of what he did last night, scolds him and asks him to leave. Because of this incident, Tia also breaks off her relationship with him.A few days later, Anita gets a phone call from the police station. There she comes to know that Sam had taken one of her students who is also Saahil's friend to a rave party. Police had conducted a raid where she was caught, Sam somehow escaped. Anita and Sam have a fight and Sam leaves her. Saahil comes to know about the fight and goes and meets her. Both reconcile. In the evening, he goes to Anita's place only to find Sam and she are talking. He is again hurt and leaves. Anita sees him going. The next day he comes to her place and fights with her. She tells him everything is over between her and Sam.A few days later, Anita along with his friends come to Saahil's house to celebrate his birthday. After the party, he goes to her house with a wine bottle. They drink and kiss. But Anita realizing her mistake, stops him and asks him to leave. Anita now knows that she loves Saahil. Later, Saahil's uncles meet Anita who tells them that things will be back to normal in a few days. Anita then resigns from her job and informs Saahil. Saahil reaches her house and they finally make love. She also confesses her love for him.After Anita leaves Panchgani, Saahil reads her letter to him stating that they have to separate as what happened between them is not correct. And in the future, if they're ever to meet again, they would meet. She tells him to forget her. Saahil then goes to meet his friends where he reconciles with all including Tia."
}