{
  "imdb_id": "tt3037082",
  "tmdb_id": "329655",
  "douban_id": null,
  "title": "Hunters and Victims (2015)",
  "genres": [
    "Action",
    "Drama"
  ],
  "country": "Czech Republic",
  "version": [],
  "imdb_rating": 3.8,
  "director": [
    {
      "id": "nm3480391",
      "name": "Marcus Tran"
    }
  ],
  "writer": [
    {
      "id": "nm5785012",
      "name": "Milan Sluka",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3242612",
      "name": "Martin Kraus",
      "character": "Jakub"
    },
    {
      "id": "nm0361579",
      "name": "Tomás Hanák",
      "character": ""
    },
    {
      "id": "nm0636451",
      "name": "Jaromír Nosek",
      "character": ""
    },
    {
      "id": "nm4341439",
      "name": "Jakub Mohamed Ali",
      "character": ""
    },
    {
      "id": "nm1137704",
      "name": "Martin Písarík",
      "character": ""
    },
    {
      "id": "nm0379239",
      "name": "Karel Hermánek Jr.",
      "character": ""
    },
    {
      "id": "nm0890874",
      "name": "Marek Vasut",
      "character": ""
    },
    {
      "id": "nm0904563",
      "name": "Ivan Vyskocil",
      "character": ""
    },
    {
      "id": "nm0688005",
      "name": "Zdenek Podhurský",
      "character": ""
    },
    {
      "id": "nm3721356",
      "name": "Nikol Kouklová",
      "character": ""
    },
    {
      "id": "nm0293820",
      "name": "Veronika Freimanová",
      "character": "Jakub's mother"
    },
    {
      "id": "nm1155784",
      "name": "Zdenek Mahdal",
      "character": ""
    },
    {
      "id": "nm6718960",
      "name": "Eki Sluková",
      "character": ""
    },
    {
      "id": "nm6064765",
      "name": "Eva Maresová",
      "character": ""
    },
    {
      "id": "nm1893745",
      "name": "Josef Vrána",
      "character": ""
    },
    {
      "id": "nm3480391",
      "name": "Marcus Tran",
      "character": ""
    },
    {
      "id": "nm0014456",
      "name": "Eva Decastelo",
      "character": "(as Eva Aichmajerová)"
    },
    {
      "id": "nm6718961",
      "name": "Sarah Bocková",
      "character": ""
    },
    {
      "id": "nm6718962",
      "name": "Jay Diesel",
      "character": ""
    },
    {
      "id": "nm0398534",
      "name": "Katerina Hrachovcová",
      "character": ""
    },
    {
      "id": "nm0470721",
      "name": "Václav Krejcí",
      "character": ""
    },
    {
      "id": "nm5797639",
      "name": "Pavel Novotný",
      "character": ""
    },
    {
      "id": "nm0904705",
      "name": "Milos Vávra",
      "character": ""
    }
  ],
  "overview": null,
  "storyline": "The Victims and hunters movie is inspired by the real life stories that depict where you, your family or friends could end up tomorrow. What should you do if you end up in the helix of dept? Jakub - our leading protagonist - shows you how to get rid of executors. But how do you deal with the worst gangster with the roughest leader. Its impossible to save money with them before you. Or how to deal with the malicious moneylender's mean tricks with constant bills and rocketing interests. There is some very influential mafiosi and his cobbers who are protected by bribable policeman. Who Will be mafiosi jakub's angel? This is the playground where Jakub plays his game - sex, money and rock and roll - so until he makes some very bad legal moves because of enforcers. This is the time when a fight for life starts. Jakub's problems won't be only his - it befalls to his family and friends too. He's hapless and he looses in love too. This movie completely changes the modern opinion on life ...",
  "plot": "Roger Brown (Aksel Hennie), Norway's most successful headhunter, supports his lavish lifestyle by stealing paintings from his clients; his partner, Ove (Eivind Sander), works at a surveillance company and deactivates security at the victims' homes, allowing Roger to swap the art for a counterfeit. Asked to dinner by his mistress, Lotte (Julie Ølgaard), Roger declines and ends their relationship. Roger's wife and art gallery owner, Diana (Synnøve Macody Lund), introduces him to Clas Greve (Nikolaj Coster-Waldau), a former executive for GPS tech company HOTE, who wants to work for Pathfinder (whom Roger is recruiting for). Diana reveals that Clas has asked her authenticate a lost Rubens painting he inherited that is believed to be worth millions.\n\nRoger takes Clas to lunch to discuss the job at Pathfinder, and soon learns Clas used to be a member of a special forces unit that specialized in tracking people. Despite his misgivings, Roger meets with Ove to work out details on stealing the painting. Roger manages to steal it from Clas' home, but he discovers Diana's cellphone beside Clas' bed. Later, after a seemingly successful meeting with Pathfinder, an upset Roger flippantly informs Clas that the company may be looking for someone else to fill the position.\n\nThe next morning, Roger finds Ove in his car, apparently dead from a poison syringe embedded in the car seat; when Roger dumps Ove in a lake, the water revives him as he didn't get a full dose of the poison. Driving Ove to his cabin, Roger puts him in bed and ignores his demands for medical attention, as he does not want the police involved; Ove pulls a gun in response, causing a shoot-out where Roger accidentally kills Ove. Finding Clas has followed him to Ove's cabin, Roger narrowly escapes after a scuffle. Roger switches his car for Ove's and throws his clothes in a lake, changing into his spare uniform and fleeing to a farm where Ove used to stay. Clas tails Roger to the farm with his dog and murders the farmer, but Roger evades them. Trying to escape on a tractor, Roger is attacked by Clas' dog, which he kills by impaling it on the tractor's forks. Roger, believing Clas is chasing him, drives erratically and falls from the tractor, only to find his pursuer is a stranger wanting to help.\n\nWaking in a hospital, Roger learns the police think he is Ove, who arrest him for the farmer's murder when he tries to escape. Driving to the station, the officers pull over to block a truck reported stolen. Remembering that Clas developed a nanotechnology gel that is very difficult to remove, Roger realizes that he's being tracked through GPS gel rubbed in his hair by Diana, and Clas is driving the truck; despite Roger's protests, the officers ignore him, allowing Clas to ram the car off a cliff. Playing dead until Clas leaves the scene, Roger shaves his head and hides his hair on a body, then swaps clothes with a detective's disfigured body to fake his death.\n\nRoger turns to Lotte for help, only to discover she has always worked for Clas, who is still a HOTE executive and trying to steal Pathfinder's secrets. Lotte admits that she put the GPS gel in Roger's hair, and that she suggested dinner so she could introduce him to Clas; since Roger ended their affair, Clas used a counterfeit Rubens painting to meet Roger through Diana. When Roger lets his guard down, Lotte attacks him with a knife, causing Roger to shoot and kills her in retaliation. Roger returns home and admits everything to Diana, who apologizes for her affair with Clas. The next morning, Roger goes to a morgue to retrieve his cut hair, while Diana contacts Clas to resume their affair.\n\nWhile cleaning Ove's cabin of evidence, Roger is confronted by Clas, who was able to track the location transmitters in the cut hair. Clas gloats that Diana has returned to him, and tries to shoot Roger but fails. Roger fatally wounds Clas with Ove's gun, explaining Diana only resumed their affair so she could load Clas' gun with blanks. Ove's home security records Clas involved in a shootout, though Roger stays in a camera blind spot near Ove; the footage, combined with evidence doctored by Roger, suggests Ove and Clas were art thieves who killed the farmer, Lotte, then finally each other after a dispute, and the police ignore the minor inconsistencies because they want the case closed. Later, Roger and a visibly pregnant Diana are shown selling their house, and Roger returns to work.",
  "synopsis": null
}