{
  "imdb_id": "tt3042408",
  "tmdb_id": "284427",
  "douban_id": null,
  "title": "Who Am I (2014)",
  "genres": [
    "Crime",
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "102 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm2171633",
      "name": "Baran bo Odar"
    }
  ],
  "writer": [
    {
      "id": "nm1296729",
      "name": "Jantje Friese",
      "description": "screenplay &"
    },
    {
      "id": "nm2171633",
      "name": "Baran bo Odar",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0771713",
      "name": "Tom Schilling",
      "character": "Benjamin"
    },
    {
      "id": "nm1065929",
      "name": "Elyas M'Barek",
      "character": "Max"
    },
    {
      "id": "nm0617852",
      "name": "Wotan Wilke Möhring",
      "character": "Stephan"
    },
    {
      "id": "nm0006801",
      "name": "Antoine Monot Jr.",
      "character": "Paul"
    },
    {
      "id": "nm0381342",
      "name": "Hannah Herzsprung",
      "character": "Marie"
    },
    {
      "id": "nm0436965",
      "name": "Stephan Kampwirth",
      "character": "Martin Bohmer"
    },
    {
      "id": "nm0245988",
      "name": "Trine Dyrholm",
      "character": "Hanne Lindberg"
    },
    {
      "id": "nm1213137",
      "name": "Leopold Hornung",
      "character": "Oskar"
    },
    {
      "id": "nm0560684",
      "name": "Katharina Matz",
      "character": "Hilde Engel"
    },
    {
      "id": "nm1559185",
      "name": "Leonard Carow",
      "character": "MRX"
    },
    {
      "id": "nm0777912",
      "name": "Arndt Schwering-Sohnrey",
      "character": "Paradise Pizza Manager"
    },
    {
      "id": "nm1360387",
      "name": "Matthias Neukirch",
      "character": "Dr. Arnow"
    },
    {
      "id": "nm7256706",
      "name": "Nils Borghardt",
      "character": "Glatze NBD"
    },
    {
      "id": "nm0369233",
      "name": "Alexander Hauff",
      "character": "Karl-Heinz Vogt"
    },
    {
      "id": "nm3796544",
      "name": "Antonia Putiloff",
      "character": "BKA Hackerin"
    },
    {
      "id": "nm2663304",
      "name": "Lena Dörrie",
      "character": "BKA Ermittlerin #1"
    },
    {
      "id": "nm0394335",
      "name": "Max Hopp",
      "character": "BND IT-Techniker"
    },
    {
      "id": "nm0203860",
      "name": "Mike Davies",
      "character": "Europolsicherheitsmann       (as Robert Eliot)"
    },
    {
      "id": "nm0839814",
      "name": "Bjoern Susen",
      "character": "Richter       (as Björn Susen)"
    },
    {
      "id": "nm1517389",
      "name": "Eric Bouwer",
      "character": "Kassierer"
    },
    {
      "id": "nm6220934",
      "name": "Levi Strasser",
      "character": "Benjamin 8 J."
    },
    {
      "id": "nm4126098",
      "name": "Moritz Berkel",
      "character": "Benjamin 14 J."
    },
    {
      "id": "nm6448115",
      "name": "Tijan Marei",
      "character": "Marie 15 J.       (as Tijan Fischer)"
    },
    {
      "id": "nm3068761",
      "name": "Katja Wagner",
      "character": "Börsennachrichten"
    },
    {
      "id": "nm7256708",
      "name": "Marten Borgwardt",
      "character": "Krypton"
    },
    {
      "id": "nm2373237",
      "name": "Barbara Hahlweg",
      "character": "ZDF Heute Moderatorin"
    },
    {
      "id": "nm0991484",
      "name": "Marc Bator",
      "character": "SAT1 Nachrichten Moderator"
    },
    {
      "id": "nm4869457",
      "name": "Stephanie Puls",
      "character": "N24 Nachrichten Moderatorin"
    },
    {
      "id": "nm1693700",
      "name": "Harald Geil",
      "character": "BKA Mitarbeiter"
    },
    {
      "id": "nm2832213",
      "name": "Jessica Walther-Gabory",
      "character": "BKA-Ermittlerin #2"
    },
    {
      "id": "nm7256709",
      "name": "Teresa Cantz",
      "character": "Kunstlehrerin"
    },
    {
      "id": "nm6247747",
      "name": "Sara Bernhardt",
      "character": "Freundin von Marie #1"
    },
    {
      "id": "nm7256710",
      "name": "Sophia Fichtner",
      "character": "Freundin von Marie #2"
    },
    {
      "id": "nm7256711",
      "name": "Johannes H. Langner",
      "character": "Freund von Oskar #1"
    },
    {
      "id": "nm4809581",
      "name": "John Ludwig",
      "character": "Freund von Oskar #2"
    },
    {
      "id": "nm2717717",
      "name": "David Masterson",
      "character": "Cyber Mafia Mann Tattoo"
    },
    {
      "id": "nm3348365",
      "name": "Agnes Mai",
      "character": "Partymädchen #1       (as Agnes Thi-Mai)"
    },
    {
      "id": "nm4368563",
      "name": "Rosa Schrehardt",
      "character": "Partymädchen #2"
    },
    {
      "id": "nm5453479",
      "name": "Alica Hubiak",
      "character": "Partymädchen #3"
    },
    {
      "id": "nm7256712",
      "name": "Tobias Hey",
      "character": "Bühnentechniker"
    },
    {
      "id": "nm7256713",
      "name": "Marko Passehl",
      "character": "Schläger NBD"
    },
    {
      "id": "nm0314154",
      "name": "Thomas Gerber",
      "character": "Sportlehrer 1996"
    },
    {
      "id": "nm7256714",
      "name": "Franz Wilking",
      "character": "Stephan als Kind"
    },
    {
      "id": "nm7256715",
      "name": "Walid Obeidi",
      "character": "Klassenkamerad #1"
    },
    {
      "id": "nm7256716",
      "name": "Jaron Wilhelm",
      "character": "Klassenkamerad #2"
    },
    {
      "id": "nm7256717",
      "name": "Matthias Berndt",
      "character": "Sicherheitsmann"
    },
    {
      "id": "nm7108740",
      "name": "Alexander Voigt",
      "character": "Party Gast"
    },
    {
      "id": "nm7256718",
      "name": "Carmen Goesch",
      "character": "Gerdi vom BND"
    },
    {
      "id": "nm1586824",
      "name": "Wolfgang Rhaden",
      "character": "Gerichtsmediziner"
    },
    {
      "id": "nm2361605",
      "name": "Michael Vesper",
      "character": "BND Agent"
    },
    {
      "id": "nm7256719",
      "name": "Carsten Junghanns",
      "character": "BND Agent"
    },
    {
      "id": "nm1386539",
      "name": "Alexander Müller-Lenhartz",
      "character": "BND Wachmann       (as Alexander \"Big Al\" Müller-Lenhartz)"
    }
  ],
  "overview": "Benjamin, a young German computer whiz, is invited to join a subversive hacker group that wants to be noticed on the world's stage.",
  "storyline": "Benjamin (TOM SCHILLING) is invisible, a nobody. This changes abruptly when he meets charismatic Max (ELYAS M'BAREK). Even though they couldn't seem more different from the outside, they share the same interest: hacking. Together with Max's friends, the impulsive Stephan (WOTAN WILKE MÖHRING) and paranoid Paul (ANTOINE MONOT), they form the subversive Hacker collective CLAY (CLOWNS LAUGHING @ YOU). CLAY provokes with fun campaigns and speaks for a whole generation. For the first time in his life, Benjamin is part of something and even the attractive Marie (HANNAH HERZSPRUNG) begins noticing him. But fun turns into deadly danger when CLAY appears on the BKA's (Bundeskriminalamt, Federal Criminal Police Office) as well as Europol's most wanted list. Hunted by Cybercrime investigator Hanne Lindberg (TRINE DYRHOLM), Benjamin is no longer a nobody, but instead one of the most wanted hackers in the world.",
  "plot": "Lucy is a 24-year-old American woman living and studying in Taipei, Taiwan. She is tricked into working as a drug mule by her new boyfriend whose employer, Mr. Jang, is a Korean mob boss and drug lord. Lucy delivers a briefcase to Mr. Jang containing a highly valuable synthetic drug called CPH4. After seeing her boyfriend shot and killed, she is captured. A bag of the drug is forcibly sewn into her abdomen and that of three other drug mules who will also transport the drug for sale in Europe. While Lucy is in captivity, one of her captors kicks her in the abdomen, breaking the bag and releasing a large quantity of the drug into her system. As a result, she begins acquiring increasingly enhanced physical and mental capabilities, such as telepathy, telekinesis, mental time travel, and the ability not to feel pain or other discomforts. She kills off her captors and escapes.\n\nLucy travels to the nearby Tri-Service General Hospital to get the bag of drugs removed from her abdomen. The bag is successfully removed and Lucy is told by the operating doctor that natural CPH4 is a volatile substance produced in minute quantities by pregnant women to provide fetuses the energy to develop. Lucy is fortunate to have survived having such a large amount introduced into her body. Sensing her growing physical and mental abilities, Lucy returns to Mr. Jang's hotel, kills his bodyguards, assaults Mr. Jang, and telepathically extracts the locations of the three remaining drug mules from his brain.\n\nAt her shared apartment, Lucy begins researching her condition and contacts well-known scientist and doctor Professor Samuel Norman whose research may be the key to saving her. After Lucy speaks with Professor Norman and provides proof of her developed abilities, she flies to Paris and contacts a local police captain, Pierre Del Rio, to help her find the remaining three packets of the drug. During the plane ride, she starts to disintegrate as her cells destabilize from consuming a sip of champagne, which made her body inhospitable for cellular reproduction. Only by consuming more CPH4 is she able to prevent her total disintegration. Her powers continue to grow, leaving her able to telepathically incapacitate armed police and members from the Korean drug gang. With the help of Del Rio, Lucy recovers the drug and hurries to meet Professor Norman. Alongside Professor Norman and his colleagues, she agrees to share everything she now knows after Professor Norman points out that the main point of life is to pass on knowledge, something for which she now possesses an infinite capacity. Jang and the mob also want the drug and a gunfight ensues with the French police.\n\nIn the professor's lab, Lucy discusses the nature of time and life and how people's humanity distorts their perceptions. She tells the scientists that time is the only true measure of human life and of existence. At her urging, she is intravenously injected with the contents of all three remaining bags of CPH4. Her body begins to metamorphose into a bizarre black substance which behaves like nanites, spreading over computers and other objects in the lab, as she transforms these into an unconventionally shaped, next-generation supercomputer that will contain all of her enhanced knowledge of the universe. She then begins a spacetime journey into the past, eventually reaching the oldest discovered ancestor of mankind, implied to be Lucy. She touches fingertips with her, then goes all the way to the beginning of time and witnesses the Big Bang. Meanwhile, back in the lab, after an M136 AT4 anti-tank weapon destroys the door, Jang enters and points a gun at Lucy's head from behind. He shoots, but in the instant before the bullet strikes, Lucy reaches 100% of her cerebral capacity and disappears within the spacetime continuum, where she explains that everything is connected and existence is only proven through time. Only her clothes, Louboutin shoes and the black supercomputer are left behind.\n\nDel Rio enters and fatally shoots Jang. Professor Norman takes a black, presumably highly advanced flash drive offered by the advanced supercomputer, after which the computer disintegrates. Del Rio asks Professor Norman where Lucy is, immediately after which Del Rio's cell phone sounds and he sees a text message: \"I AM EVERYWHERE.\" With an overhead shot, Lucy's voice is heard stating \"Life was given to us a billion years ago. Now you know what to do with it.\"",
  "synopsis": null
}