{
  "imdb_id": "tt3012834",
  "tmdb_id": "286413",
  "douban_id": null,
  "title": "Velvet Terrorists (2013)",
  "genres": [
    "Documentary"
  ],
  "country": "Slovakia",
  "version": [
    {
      "runtime": "87 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm0449272",
      "name": "Péter Kerekes"
    },
    {
      "id": "nm4234962",
      "name": "Ivan Ostrochovský"
    },
    {
      "id": "nm5176910",
      "name": "Pavol Pekarcik"
    }
  ],
  "writer": [
    {
      "id": "nm0449272",
      "name": "Péter Kerekes",
      "description": null
    },
    {
      "id": "nm4234962",
      "name": "Ivan Ostrochovský",
      "description": null
    },
    {
      "id": "nm5176910",
      "name": "Pavol Pekarcik",
      "description": null
    }
  ],
  "cast": null,
  "overview": "Part documentary, part mockumentary and part stranger-than-fiction lesson in guerilla tactics, Velvet Terrorists is a quirky profile of three very different men and their former attempts to take down the communist regime of Czechoslovakia – by blowing the hell out of it. Having all spent time in prison for their crimes, one-time bombers Stanislav, Frantisek and Vladimir muse on their personal histories, the fall of the regime and their journey into middle age.",
  "storyline": "The Film maps the terrorist acts of individuals in the period of \"normalisation\" in Czechoslovakia. Their attempts, which often remained unrealized, were isolated heroic cries in the homogeneous gray mass of society. With the main theme as the background, the film looks at issues of ethics, irrationality and terrorism, its sense and deadly force in today's world. The film focuses on a trio of protagonists. The first wanted to blow up a podium during Labour Day celebrations in the 1970's. The second wanted to assassinate the President and launch an anti-Communist revolution, but his letter addressed to the CIA was so naive that he never received a response. The third destroyed billboards. At the time their acts were crimes, though today they are considered to be heroism. It is a film about relative perspectives on history and its heroes.",
  "plot": "Rocky is a goon from Mumbai and does anything for money. He is on a mission and constantly runs away from the police. Everyone relates to him as a 'chameleon' who constantly changes colors. Rocky finally reaches Kashmir and meets Nandini, he instantly falls in love with her. Rocky rescue Nandini while being kidnapped by terrorists. Later Rocky finds that Nandini is already engaged to Avik. Avik is a goon (and the minister's son) but Nandini doesn't know that. When Nandini found out that Avik is a goon, she dumped him. And she also come to know that she is in love with Rocky. Later on Rocky kills Avik and the minister. One day when Rocky, Nandini, and Diya (Nandini's friend) go to the temple, Diya sees Rocky killing someone. And then there is a flashback about how he and Nandini met before but she lost her memory. That happened because Nandini's brother was an undercover cop and when goons found out they killed the whole family. The only one who survived was Nandini but she had a bullet in her head. The doctors said that she would lose her memory soon. So, she tells Rocky to kill the people who killed her family because she had seen Rocky beating up a bunch of people. In the end Rocky kills all the goons who killed Nandini's family.",
  "synopsis": null
}