{
  "imdb_id": "tt3009714",
  "tmdb_id": "275603",
  "douban_id": null,
  "title": "The Portal (2014)",
  "genres": [
    "Short",
    "Comedy",
    "Fantasy",
    "Sci-Fi"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "11 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.0,
  "director": [
    {
      "id": "nm0930984",
      "name": "Jonathan Williams"
    }
  ],
  "writer": [
    {
      "id": "nm0930984",
      "name": "Jonathan Williams",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0671886",
      "name": "Tahmoh Penikett",
      "character": "Alar"
    },
    {
      "id": "nm1172442",
      "name": "Erin Karpluk",
      "character": "Kim"
    },
    {
      "id": "nm1095942",
      "name": "Penelope Park",
      "character": "Tracy       (as Penelope Corrin)"
    },
    {
      "id": "nm5778789",
      "name": "David Oliver Mes",
      "character": "Tycho"
    },
    {
      "id": "nm0212123",
      "name": "Claudio Masciulli",
      "character": "Security Guard"
    },
    {
      "id": "nm0031146",
      "name": "Geoffrey Antoine",
      "character": "Business Man"
    },
    {
      "id": "nm2524107",
      "name": "Chantelle Chung",
      "character": "Young Woman"
    },
    {
      "id": "nm4892910",
      "name": "Alex Furber",
      "character": "Young Man"
    },
    {
      "id": "nm0505358",
      "name": "Zerha Leverman",
      "character": "Tall Blonde       (as Zehra Leverman)"
    },
    {
      "id": "nm1801080",
      "name": "Mary Pitt",
      "character": "Secretary"
    },
    {
      "id": "nm3029699",
      "name": "Misha Rasaiah",
      "character": "Weatherwoman"
    },
    {
      "id": "nm0731048",
      "name": "Dylan Roberts",
      "character": "Cabbie"
    }
  ],
  "overview": "A dimension-traveling wizard gets stuck in the 21st century because cell-phone radiation interferes with his magic. With his home world on the brink of war, he seeks help from a jaded travel agent who he mistakes for a great sorceress. Without his powers to prove his identity, she has trouble taking him seriously, but finally agrees to reveal the secrets of our world in exchange for a lunch date.",
  "storyline": "A dimension-traveling wizard gets stuck in the 21st century because cell-phone radiation interferes with his magic. With his home world on the brink of war, he seeks help from a jaded travel agent who he mistakes for a great sorceress. Without his powers to prove his identity, she has trouble taking him seriously, but finally agrees to reveal the secrets of our world in exchange for a lunch date.",
  "plot": "Concept\nPlay mediaAn animated history of how the Portal project came to Valve\nPortal is Valve's spiritual successor to the freeware game Narbacular Drop, the 2005 independent game released by students of the DigiPen Institute of Technology; the original Narbacular Drop team is now employed at Valve. Valve became interested in Narbacular Drop after seeing the game at DigiPen's annual career fair; Robin Walker, one of Valve's developers, saw the game at the fair and later contacted the team providing them with advice and offering to show their game at Valve's offices. After their presentation, Valve's president Gabe Newell quickly offered the entire team jobs at Valve to develop the game further. Newell later commented that he was impressed with the DigiPen team as \"they had actually carried the concept through\", already having included the interaction between portals and physics, completing most of the work that Valve would have had to commit on their own. Certain elements have been retained from Narbacular Drop, such as the system of identifying the two unique portal endpoints with the colors orange and blue. A key difference in the signature portal mechanic between the two games however is that Portal's portal gun cannot create a portal through an existing portal unlike in Narbacular Drop. The game's original setting, of a princess trying to escape a dungeon, was dropped in favor of the Aperture Science approach. Portal took approximately two years and four months to complete after the DigiPen team was brought into Valve, and no more than ten people were involved with its development. Portal writer Erik Wolpaw, who, along with fellow writer Chet Faliszek, was hired by Valve for the game, claimed that \"Without the constraints, Portal would not be as good a game\".\n\nThe Portal team worked with Half-Life series writer Marc Laidlaw on fitting the game into the series' plot. This was done, in part, due to the limited art capabilities of the small team; instead of creating new assets for Portal, they decided to tie the game to an existing franchise—Half-Life—to allow them to reuse the Half-Life 2 art assets. Wolpaw and Faliszek were put to work on the dialogue for Portal. The concept of a computer AI guiding the player through experimental facilities to test the portal gun was arrived at early in the writing process. They drafted early lines for the yet-named \"polite\" AI with humorous situations, such as requesting the player's character to \"assume the party escort submission position\", and found this style of approach to be well-suited to the game they wanted to create, ultimately leading to the creation of the GLaDOS character. GLaDOS was central to the plot, as Wolpaw notes \"We designed the game to have a very clear beginning, middle, and end, and we wanted GLaDOS to go through a personality shift at each of these points.\" Wolpaw further describes the idea of using cake as the reward came about as \"at the beginning of the Portal development process, we sat down as a group to decide what philosopher or school of philosophy our game would be based on. That was followed by about 15 minutes of silence and then someone mentioned that a lot of people like cake.\" The cake element along with additional messages given to the player in the behind-the-scenes areas were written and drawn by Kim Swift.\nDesign\nA typical Portal test chamber, with both of the player's colored portals opened. The Weighted Companion Cube can also be seen. The clean, spartan look to the chambers was influenced by the film The Island.\nThe austere settings in the game came about because testers spent too much time trying to complete the puzzles using decorative but non-functional elements. As a result, the setting was minimized to make the usable aspects of the puzzle easier to spot, using the clinical feel of the setting in the film The Island as reference. While there were plans for a third area, an office space, to be included after the test chambers and the maintenance areas, the team ran out of time to include it. They also dropped the introduction of the Rat Man, a character who left the messages in the maintenance areas, to avoid creating too much narrative for the game, though the character was developed further in a tie-in comic \"Lab Rat\", that ties Portal and Portal 2's story together. According to project lead Kim Swift, the final battle with GLaDOS went through many iterations, including having the player chased by James Bond lasers, which was partially applied to the turrets, Portal Kombat where the player would have needed to redirect rockets while avoiding turret fire, and a chase sequence following a fleeing GLaDOS. Eventually, they found that playtesters enjoyed a rather simple puzzle with a countdown timer near the end; Swift noted, \"Time pressure makes people think something is a lot more complicated than it really is\", and Wolpaw admitted, \"It was really cheap to make [the neurotoxin gas]\" in order to simplify the dialogue during the battle.\n\nChell's face and body are modeled after Alésia Glidewell, an American freelance actress and voice-over artist, selected by Valve from a local modeling agency for her face and body structure. Ellen McLain provided the voice of the antagonist GLaDOS. Erik Wolpaw noted, \"When we were still fishing around for the turret voice, Ellen did a sultry version. It didn't work for the turrets, but we liked it a lot, and so a slightly modified version of that became the model for GLaDOS's final incarnation.\" Mike Patton performed the growling and snarling voice of GLaDOS's final personality core, named the Anger Sphere.\n\nThe Weighted Companion Cube inspiration was from project lead Kim Swift with additional input from Wolpaw from reading some \"declassified government interrogation thing\" whereby \"isolation leads subjects to begin to attach to inanimate objects\"; Swift commented, \"We had a long level called Box Marathon; we wanted players to bring this box with them from the beginning to the end. But people would forget about the box, so we added dialogue, applied the heart to the cube, and continued to up the ante until people became attached to the box. Later on, we added the incineration idea. The artistic expression grew from the gameplay.\" Wolpaw further noted that the need to incinerate the Weighted Companion Cube came as a result of the final boss battle design; they recognized they had not introduced the idea of incineration necessary to complete the boss battle, and by training the player to do it with the Weighted Companion Cube, found the narrative \"way stronger\" with its \"death\". Swift noted that any similarities to psychological situations in the Milgram experiment or 2001: A Space Odyssey are happenstance.\n\nThe portal gun's full name, Aperture Science Handheld Portal Device, can be abbreviated as ASHPD, which resembles a shortening of the name Adrian Shephard, the protagonist of Half-Life: Opposing Force. This similarity was noticed by fans before the game's release; as a result, the team placed a red herring in the game by having the letters of Adrian Shephard highlighted on keyboards found within the game. According to Kim Swift, the cake is a Black Forest cake that she thought looked the best at the nearby Regent Bakery and Café in Redmond, Washington, and, as an Easter egg within the game, its recipe is scattered among various screens showing lines of binary code. The Regent Bakery has stated that since the release of the game, its Black Forest cake has been one of its more popular items.\nSoundtrack\n\nMost of the game's soundtrack is non-lyrical ambient music composed by Kelly Bailey and Mike Morasky, somewhat dark and mysterious to match the mood of the environments. The closing credits song, \"Still Alive\", was written by Jonathan Coulton and sung by Ellen McLain (a classically trained operatic soprano) as the GLaDOS character. A brief instrumental version of Still Alive is played in an uptempo Latin style over radios in-game. Wolpaw notes that Coulton was invited to Valve a year before the release of Portal, though it was not yet clear where Coulton would contribute. \"Once Kim [Swift] and I met with him, it quickly became apparent that he had the perfect sensibility to write a song for GLaDOS.\" The use of the song over the closing credits was based on a similar concept from the game God Hand, one of Wolpaw's favorite titles. The song was released as a free downloadable song for the music video game Rock Band on April 1, 2008. The soundtrack for Portal was released as a part of The Orange Box Original Soundtrack and includes both GLaDOS's in-game rendition and Coulton's vocal mix of \"Still Alive\".\n\nPortal's soundtrack was released as part of a four-disc retail release, Portal 2: Songs To Test By (Collector's Edition), on October 30, 2012, featuring music from both games. The game's soundtrack became available via Steam Music on September 24, 2014.\nMerchandise\nThe popularity of the Weighted Companion Cube led Valve to create merchandise based on it, including fuzzy dice\nThe popularity of the game and of its characters led Valve to develop merchandise for Portal made available through its online Steam store. Some of the more popular items were the Weighted Companion Cube plush toys and fuzzy dice. When first released, both were sold out in under 24 hours. Other products available through the Valve store include T-shirts and Aperture Science coffee mugs and parking stickers, and merchandise relating to the phrase the cake is a lie, which has become an internet meme. Wolpaw noted they did not expect certain elements of the game to be as popular as they were, while other elements they had expected to become fads were ignored, such as a giant hoop that rolls on-screen during the final scene of the game that the team had named Hoopy.\nDistribution\nDemo\n\nIn January 2008, Valve released a special demo version titled Portal: The First Slice, free for any Steam user using Nvidia graphics hardware as part of a collaboration between the two companies. It also comes packaged with Half-Life 2: Deathmatch, Peggle Extreme, and Half-Life 2: Lost Coast. The demo includes test chambers 00 to 10 (eleven in total). Valve has since made the demo available to all Steam users.\nPortal\n\nPortal was first released as part of The Orange Box for Microsoft Windows and Xbox 360 on October 9, 2007, and for the PlayStation 3 on December 11, 2007. The Windows version of the game is also available for download separately through Valve's content delivery system, Steam, and was released as a standalone retail product on April 9, 2008. In addition to Portal, the Box also included Half-Life 2 and its two add-on episodes, as well as Team Fortress 2. Portal's inclusion within the Box was considered an experiment by Valve; having no idea of the success of Portal, the Box provided it a \"safety net\" via means of these other games. Portal was kept to a modest length in case the game did not go over well with players. Since then, a standalone version of the game was released for Microsoft Windows users.\n\nPortal was the first Valve-developed game to be added to the OS X-compatible list of games available on the launch of the Steam client for Mac on May 12, 2010, supporting Steam Play, in which players that had bought the game either on a Macintosh or Windows computer could also play it on the alternate system. As part of the promotion, Portal was offered as a free title for any Steam user during the two weeks following the Mac client's launch. Within the first week of this offer, over 1.5 million copies of the game were downloaded through Steam. A similar promotion was held in September 2011, near the start of a traditional school year, encouraging the use of the game as an educational tool for science and mathematics. Valve wrote that they felt that Portal \"makes physics, math, logic, spatial reasoning, probability, and problem-solving interesting, cool, and fun\", a necessary feature to draw children into learning. This was tied to Digital Promise, a United States Department of Education initiative to help develop new digital tools for education, and which Valve is part of.\n\nDuring 2014 GPU Technology Conference on March 25, 2014, Nvidia announced that they are porting Portal to their Android handheld, the Nvidia Shield. The version was released on May 12, 2014.\nPortal: Still Alive\n\nPortal: Still Alive was announced as an exclusive Xbox Live Arcade game at the 2008 E3 convention, and was released on October 22, 2008. It features the original game, 14 new challenges, and new achievements. The additional content was based on levels from the map pack Portal: The Flash Version created by We Create Stuff and contains no additional story-related levels. According to Valve spokesman Doug Lombardi, Microsoft had previously rejected Portal on the platform due to its large size. Portal: Still Alive was well received by reviewers. 1UP.com's Andrew Hayward stated that, with the easier access and lower cost than paying for The Orange Box, Portal is now \"stronger than ever\". IGN editor Cam Shea ranked it fifth on his top 10 list of Xbox Live Arcade games. He stated that it was debatable whether an owner of The Orange Box should purchase this, as its added levels do not add to the plot. However, he praised the quality of the new maps included in the game. The game ranked 7th in a later list of top Xbox Box Live titles compiled by IGN's staff in September 2010.\nMods\n\nA modding community has developed around Portal, with users creating their own test chambers and other in-game modifications. The group \"We Create Stuff\" created an Adobe Flash version of Portal, titled Portal: The Flash Version, just prior to release of The Orange Box. This flash version was well received by the community and the group have since converted it to a map pack for the published game. Another mod, Portal: Prelude, is an unofficial prequel developed by an independent team of three that focuses on the pre-GLaDOS era of Aperture Science, and contains nineteen additional \"crafty and challenging\" test chambers. An ASCII version of Portal was created by Joe Larson. An unofficial port of Portal to the iPhone using the Unity game engine was created but only consisted of a single room from the game. Mari0 is a fan-made four-player coop mashup of the original Super Mario Bros. and Portal.\nSequel and franchise\nMain articles: Portal 2 and Portal (series)\nSwift stated that future Portal developments would depend on the community's reactions, saying, \"We're still playing it by ear at this point, figuring out if we want to do multiplayer next, or Portal 2, or release map packs.\" Some rumors regarding a sequel arose due to casting calls for voice actors. On March 10, 2010, Portal 2 was officially announced for a release late in that year; the announcement was preceded by an alternate reality game based on unexpected patches made to Portal that contained cryptic messages in relation to Portal 2's announcement, including an update to the game, creating a different ending for the fate of Chell. The original game left her in a deserted car park after destroying GLaDOS, but the update involved Chell being dragged back into the facility by a \"Party Escort Bot\". Though Portal 2 was originally announced for a Q4 2010 release, the game was released on April 19, 2011.\n\nAlong with Portal 2, Valve has expanded Portal into its own franchise, developing spin-off media to tie into the video games.",
  "synopsis": null
}