{
  "imdb_id": "tt3060492",
  "tmdb_id": "253254",
  "douban_id": null,
  "title": "Before I Disappear (2014)",
  "genres": [
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "93 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm0159900",
      "name": "Shawn Christensen"
    }
  ],
  "writer": [
    {
      "id": "nm0159900",
      "name": "Shawn Christensen",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0159900",
      "name": "Shawn Christensen",
      "character": "Richie"
    },
    {
      "id": "nm3262742",
      "name": "Fatima Ptacek",
      "character": "Sophia"
    },
    {
      "id": "nm0002536",
      "name": "Emmy Rossum",
      "character": "Maggie"
    },
    {
      "id": "nm0913587",
      "name": "Paul Wesley",
      "character": "Gideon"
    },
    {
      "id": "nm0000579",
      "name": "Ron Perlman",
      "character": "Bill"
    },
    {
      "id": "nm0771493",
      "name": "Richard Schiff",
      "character": "Bruce Warham"
    },
    {
      "id": "nm0469823",
      "name": "Fran Kranz",
      "character": "Darren"
    },
    {
      "id": "nm5091057",
      "name": "Hani Avital",
      "character": "Dead Girl"
    },
    {
      "id": "nm3239107",
      "name": "Isabelle McNally",
      "character": "Vista"
    },
    {
      "id": "nm2548468",
      "name": "Sean Ringgold",
      "character": "Devon"
    },
    {
      "id": "nm1438390",
      "name": "Joseph DeVito",
      "character": "The Collector"
    },
    {
      "id": "nm1826988",
      "name": "Michael Drayer",
      "character": "Jordan"
    },
    {
      "id": "nm1368866",
      "name": "Stephanie Kurtzuba",
      "character": "Blonde Woman"
    },
    {
      "id": "nm0674786",
      "name": "Joe Perrino",
      "character": "Ellis       (as Joseph Perrino)"
    },
    {
      "id": "nm0175418",
      "name": "James Andrew O'Connor",
      "character": "Cody"
    },
    {
      "id": "nm1497615",
      "name": "Victor Cruz",
      "character": "Terry the Doorman"
    },
    {
      "id": "nm6943671",
      "name": "David Pendleton",
      "character": "Homeless Man"
    },
    {
      "id": "nm3731400",
      "name": "Kitty Chen",
      "character": "School Moderator"
    },
    {
      "id": "nm1891145",
      "name": "J. Elaine Marcos",
      "character": "Annoying Woman #1"
    },
    {
      "id": "nm3165703",
      "name": "Anthoula Katsimatides",
      "character": "Annoying Woman #2"
    },
    {
      "id": "nm2292791",
      "name": "Mara Kassin",
      "character": "Music Store Manager"
    },
    {
      "id": "nm2770519",
      "name": "David H. Holmes",
      "character": "Hobo Hipster"
    },
    {
      "id": "nm1905016",
      "name": "Greg Connolly",
      "character": "Woman's Husband"
    },
    {
      "id": "nm5098457",
      "name": "Camille Howard",
      "character": "Detention Officer"
    },
    {
      "id": "nm1063433",
      "name": "Letty Sera",
      "character": "Grumpy Woman"
    },
    {
      "id": "nm1438608",
      "name": "Josh Mann",
      "character": "Peter"
    }
  ],
  "overview": "Based on the 2013 Academy Award® winning short film Curfew. At the lowest point of his life, Richie gets a call from his estranged sister, asking him to look after his eleven-year-old niece, Sophia, for a few hours.",
  "storyline": "A troubled young man and his strait-laced niece embark on a thrilling odyssey through New York City in this heartrending drama based on an Oscar-winning short. As his life hits rock bottom, 20-something Richie decides to end it all, only to have his half-hearted suicide attempt interrupted by an urgent request from his sister to babysit her precocious daughter. So begins a madcap tour of Manhattan after dark, as uncle and niece find unexpected bonds in the unlikeliest of places.",
  "plot": "In New York City, Richie (Shawn Christensen), a downtrodden young man whose girlfriend, Vista (Isabelle McNally), recently disappeared, discovers the corpse of a girl who died from a heroin overdose while he is cleaning bathroom stalls at a nightclub. The club owner, Bill (Ron Perlman), arranges for her body to be removed without notifying the authorities.\n\nAt his apartment, Richie attempts suicide by cutting one of his wrists in a bathtub, when he receives a call from his estranged sister, Maggie (Emmy Rossum), asking him to look after her eleven-year-old daughter, Sophia (Fátima Ptacek). Richie goes to her school, where she recites \"Because I could not stop for Death\" by Emily Dickinson in both English and Mandarin Chinese. Richie takes her to her apartment before heading home, where he attempts suicide by drug overdose. Richie hallucinates a drug dealer calling him on the phone, threatening him by saying he is in the building. Sophia calls, however, and informs Richie that her mother has not returned home.\n\nRichie arrives at the lobby of Maggie's apartment, where he discovers that the drugs he took were Zolafren, intended for menopause. Outside Maggie's apartment, a suspicious-looking woman asks Richie about his sister's whereabouts. After entering, Maggie calls the apartment, indicating to Richie that she is in central booking and upon hearing of the woman, orders Richie to sneak Sophia out of the building.\n\nRichie takes Sophia to a bowling alley where he works. Richie calls central booking, who inform him that his sister was arrested and is awaiting arraignment at 4:30 AM. The owner of the bowling alley, Gideon (Paul Wesley), has Richie brought to the office. Gideon informs him that his girlfriend has been missing for a day, with her last whereabouts being at Bill's nightclub, and produces a photograph, which Richie recognizes as being of the dead woman he saw the night before. Richie denies knowledge of her whereabouts. He calls Bill, who tells him to come in at 1:30 AM to discuss the situation.\n\nAs a favor to Richie, Gideon allows Maggie the use of his lawyer, Bruce Warham (Richard Schiff), who informs Maggie that in the public's eyes, she is a mistress, due to her having sexual relations to a married man, despite having been assaulted.\n\nRichie tells Sophia about flip books he made growing up about a character called \"Sophia\". He brings Sophia to his former apartment in a downtrodden part of town, where he retrieves some flip books and calms his panicked niece by presenting the premise of a girl who dies in intricate ways, but comes back by the next installment. He then collapses from blood loss, but refuses to go to a hospital, due to promising Maggie to keep Sophia safe.\n\nAfter Sophia tells him the cruel things her estranged father, Darren (Fran Kranz), says to her, Richie assaults him at his work. Richie and Sophia visit Bill, who divulges that Gideon's girlfriend had been resisting his advances and in retaliation, he gave her heroin. Richie returns to Maggie's apartment, where he returns Sophia home. Sophia tells him that his constant love letters to Vista would work if he told her he loves her.\n\nHaving reached an epiphany, Richie confronts Gideon, telling him what happened to his girlfriend. Gideon and his armed thugs abduct Richie, then drop him off alongside the road, before speeding off to deal with Bill. Richie re-encounters the blonde woman, who is revealed to be the wife of Maggie's lover. Richie makes his rendezvous with a released Maggie and escorts her to her apartment.\n\nMaggie tells Richie that she does not want him to stay in her daughter's life, fearing him to be a \"false idol\". Richie tells her how much he looked up to her when they were younger and how much he still looks up to her now. He returns to his bathtub and prepares to kill himself, when Maggie calls him, inviting him over for dinner. Richie writes a much shorter letter to Vista, stating that he loves and misses her, before looking up and seeing an image of her sitting across from him.",
  "synopsis": "Richie is so stressed out with all the combinations of missing his girl Vista, out of a job, and most dominantly drugs consumption effects. He knows that this can out right be his last day to live due to being out of money to get more durgs. Suddenly his distanced sister Maggie calls, yelling at him asking for a favor to pick up her daughter Sophia from school. Richie and Maggie haven't contacted each other for about five years. But Richie agrees to help. Looking dosed, he picks up Sophia, who immediately emits a very non-friendly aura on him. Richie goes home after Sophia tells him he can do so. At home he finds out that his friend wrongly supplied menopausal treatment pills to him. Maggie calls her again, furious to know that Richie left Sophia alone. Richie then picks up Sophia and takes her away from Maggie's apartment on Maggie's orders due to her being arrested. He tells Sophia that he used to draw cartoon on flip books. One of the characters he created was named Sophia, which Maggie really liked.Richie doesn't want Sophia In his place, so he takes her to other places instead. He takes her to a bowling alley but she prefers to do her homework there. The alley's owner Gideon asks Richie about Gideon's girl, to which he doesn't answer completely honestly. Richie then takes Sophia to his ex apartment to retrieve his old flip books but the visit terrifies her. Sophia is calmed after seeing the flip book. Richie's drug effects takes a toll on him as he suddenly bleeds. Sophia rushes to save him and succeeds. Richie takes Sophia while he meets his drug seller Bill. He remembered seeing Gideon's girl dying on Bill's toilet. He immediately takes Sophia out of there. As Sophia asks, Richie explains the distanced relationship between him and Maggie. Richie takes Sophia back to Maggie's place as Sophia asks. He cant get in because the guards there kick him out due to property distraction earlier that day. He goes to Gideon and tells the truth. He then goes back home and imagines Vista again. This makes absolutely no sense."
}