{
  "imdb_id": "tt3055402",
  "tmdb_id": "339362",
  "douban_id": null,
  "title": "SuperBob (2015)",
  "genres": [
    "Action",
    "Comedy",
    "Romance"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "82 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.5,
  "director": [
    {
      "id": "nm2270358",
      "name": "Jon Drever"
    }
  ],
  "writer": [
    {
      "id": "nm2782297",
      "name": "William Bridges",
      "description": "co-writer"
    },
    {
      "id": "nm2270358",
      "name": "Jon Drever",
      "description": "story"
    },
    {
      "id": "nm2073429",
      "name": "Brett Goldstein",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm2073429",
      "name": "Brett Goldstein",
      "character": "Bob"
    },
    {
      "id": "nm0851113",
      "name": "Catherine Tate",
      "character": "Theresa"
    },
    {
      "id": "nm1164730",
      "name": "Natalia Tena",
      "character": "Dorris"
    },
    {
      "id": "nm2652095",
      "name": "Laura Haddock",
      "character": "June"
    },
    {
      "id": "nm0790689",
      "name": "Ruth Sheen",
      "character": "Pat"
    },
    {
      "id": "nm8599507",
      "name": "Czeslaw Balon",
      "character": "George Porodumuo"
    },
    {
      "id": "nm1274538",
      "name": "Jason Barnett",
      "character": "Colonel"
    },
    {
      "id": "nm1326375",
      "name": "Camilla Beeput",
      "character": "Lisa       (as Camilla Marie Beeput)"
    },
    {
      "id": "nm6061254",
      "name": "David Broughton",
      "character": "Ministry of Defence Official and Policeman"
    },
    {
      "id": "nm2757852",
      "name": "Christian Contreras",
      "character": "Javier"
    },
    {
      "id": "nm1393363",
      "name": "Emily Corcoran",
      "character": "Colombian Check-In Girl"
    },
    {
      "id": "nm4866339",
      "name": "Adrian Derrick-Palmer",
      "character": "Dane Aboudowi       (as Adrian Palmer)"
    },
    {
      "id": "nm2270358",
      "name": "Jon Drever",
      "character": "Jon"
    },
    {
      "id": "nm6930677",
      "name": "Dexter Louca Godfrey",
      "character": "Rescued Baby"
    },
    {
      "id": "nm3345422",
      "name": "Gemma Godfrey",
      "character": "News Anchor"
    },
    {
      "id": "nm0344038",
      "name": "Ricky Grover",
      "character": "Barry"
    },
    {
      "id": "nm0362873",
      "name": "David Harewood",
      "character": "UK Anchor"
    },
    {
      "id": "nm5776735",
      "name": "Elizabeth Haruna",
      "character": "Choir"
    },
    {
      "id": "nm0371593",
      "name": "Hattie Hayridge",
      "character": "Pram Woman"
    },
    {
      "id": "nm5998693",
      "name": "Jermaine Humes",
      "character": "Secret Service Agent"
    },
    {
      "id": "nm6104373",
      "name": "Patrick Carney Junior",
      "character": "Car Crash Victim       (as Pat Carney)"
    },
    {
      "id": "nm3561733",
      "name": "Joelle Koissi",
      "character": "Chorus"
    },
    {
      "id": "nm4991603",
      "name": "Aleksy Komorowski",
      "character": "Carlos"
    },
    {
      "id": "nm1031009",
      "name": "Zoe Lyons",
      "character": "Peckham Dog Lady"
    },
    {
      "id": "nm5551185",
      "name": "Rizwan Shebani",
      "character": ""
    },
    {
      "id": "nm5949979",
      "name": "Peter Stanford",
      "character": "Ministry of Defence official"
    },
    {
      "id": "nm0824868",
      "name": "Matthew Steer",
      "character": "Joe"
    },
    {
      "id": "nm0911319",
      "name": "Michael Warburton",
      "character": "News Reader"
    },
    {
      "id": "nm3315134",
      "name": "Joe Wilkinson",
      "character": "The Postman"
    },
    {
      "id": "nm1082672",
      "name": "Logan Wong",
      "character": "Xiang Chou"
    },
    {
      "id": "nm5497597",
      "name": "Frida Zo",
      "character": "MOD (Ministry of Defense)"
    }
  ],
  "overview": "Six years ago, Robert Kenner, a mild mannered postman from Peckham, South London was struck by a meteor which bestowed him with super powers. Today, Bob is an overworked under-appreciated “civil servant” for the British government. He spends most waking hours saving people and filling out forms. There has been no time for anything else. Least of all love. But today he has a day off. And best of all, he has a date with the woman he once met at the library. Now all he has to do is act as if this isn’t the most exciting day of his life. Apparently that puts people off.",
  "storyline": "Faster than a Speeding Bullet, Crap with Girls: After a freak meteor storm turns postman Bob into a superhero, he must face his greatest challenge: going on his first date in six years. Featuring stellar support from top tier comedic talent, Bob must balance international politics, saving the world and getting the girl.",
  "plot": "In 2008, an asteroid breaks into fragments under Jupiter's gravity, with one of the fragments landing in the Peckham district of London and hitting a man called Robert 'Bob' Kenner; a mild-mannered and socially awkward postman. Gaining Superman-like powers as a result of the meteorite, Bob initially tries to learn how to use his new powers alone - prompting media reports of a 'flying man' - but later hands himself in after an incident involving him crashing into the Shard. Eventually trained by the Ministry of Defence in using his powers, Bob (now known as 'SuperBob') becomes the world's first superhero, working for the MOD and the British Government as a 'civil servant'.\n\n6 years later, Bob's boss Teresa Ford authorizes the creation of a documentary to show the public that SuperBob is a 'normal guy', as SuperBob's popularity is mixed with common complaints including his simplistic personality and him needing the people he rescues to sign several forms for the MOD. Bob himself is still living in Peckham with his mandatory security guard Barry and his cleaner Dorris - who also works at the care home where Bob's mother lives and is trying to raise money for a nursery in Colombia. Bob explains to the camera crew that he gets a day off from work every Tuesday and reveals that he's going out for his first date in 6 years with a librarian called June.\n\nWhile shopping for clothes with Dorris for his date, Bob receives an emergency call from Teresa telling him to come in for a meeting; arguing with Dorris after she points out he may miss his date with June. The meeting is a preparation for Bob to shake hands with American senator Bill Jackson, who is in London for the MOD Weapons Summit and who sees SuperBob as a 'dangerous weapon that Britain doesn't have control over' (although this is mostly part of a smear campaign after America failed to poach Bob from the UK a year previously). However, after talking to June and following Doris' advice, Bob finally stands up to Teresa and leaves to go on his date but is called away to the care home after his mother has an accident, with a misunderstanding causing Bob's mum (who has short-term memory loss) to think that he and Doris are now dating.\n\nWanting to keep his mum happy, the pair share a tender dance together at a care home celebration with it been clear there are some romantic feelings between them. However, June rings and – after confirming that they weren't standing each other up – Bob arranges for the pair to have dinner together at his house. After he and Dorris leave the care home following an awkward conversation with one of Dorris' friends, Bob overhears reports of a multi-car pileup and goes to help but is scolded by Teresa at the scene for not following her orders and for being seen working on his day off. Despite this, he openly disobeys her after he provides comfort to a fatality injured woman before her death. Upon returning home, Dorris briefly provides comfort for Bob before leaving following June's arrival, with Bob and June having dinner together. Upon finding a note from Dorris regarding a problem he had earlier, however, Bob decides not to continue with the date as he openly reveals to June that he wants to be with Dorris.\n\nThe date is brought to a sudden stop when Bob and June are brought to the MOD for the Weapons Summit, with June revealing Teresa stopped her from going to lunch with him and that while June does like him, Teresa and the MOD want Bob to be with June rather than Dorris due to June been American. However, upon shaking hands with Senator Jackson he learns that the US government has paid for a nursery for Dorris and is sending her away, with Bob reacting angrily at being manipulated before smashing through the roof of the MOD building and flying off to search for Dorris – invoking a worldwide manhunt for him with sightings in several locations around the world.\n\nBob eventually finds Dorris in the care home, with local residents forming a barrier to prevent the police from entering as Bob and Dorris manage to express their feelings for each other and Bob convinces her to go to Columbia with him to follow her dream of working with children. Explaining to the crowds and to the media that he's resigning from the MOD and going freelance, Bob declares he is no longer a civil servant or the property of the UK and gives his number for people to call if they need help. After bidding goodbye to Teresa and his mother, Bob flies off into the night with Dorris.\n\nIn the documentary's epilogue, Bob, Dorris and Barry have relocated to Columbia with Bob and Dorris now in a relationship and Bob continuing to work as a superhero, people's views on SuperBob have become more positive, Teresa has been reassigned to Afghanistan and scientists are shown to have been examining the meteorite remains in the hope of finding the source of Superbob's powers, but admit they haven't found anything in the 6 years they've been working on it.",
  "synopsis": null
}