{
  "imdb_id": "tt3098874",
  "tmdb_id": "286987",
  "douban_id": null,
  "title": "How to Build a Better Boy (TV Movie 2014)",
  "genres": [
    "Comedy",
    "Family",
    "Sci-Fi"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm0388505",
      "name": "Paul Hoen"
    }
  ],
  "writer": [
    {
      "id": "nm2992238",
      "name": "Jason Mayland",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm1942207",
      "name": "China Anne McClain",
      "character": "Gabby Harrison"
    },
    {
      "id": "nm2399914",
      "name": "Kelli Berglund",
      "character": "Mae Hartley"
    },
    {
      "id": "nm3246893",
      "name": "Marshall Williams",
      "character": "Albert Banks"
    },
    {
      "id": "nm2397866",
      "name": "Matt Shively",
      "character": "Bart Hartley"
    },
    {
      "id": "nm2098473",
      "name": "Ashley Argota",
      "character": "Nevaeh Barnes"
    },
    {
      "id": "nm3170207",
      "name": "Noah Centineo",
      "character": "Jaden Stark"
    },
    {
      "id": "nm0058372",
      "name": "Roger Bart",
      "character": "Dr. James Hartley"
    },
    {
      "id": "nm0494784",
      "name": "Ron Lea",
      "character": "General McFee"
    },
    {
      "id": "nm1617797",
      "name": "Ieva Lucs",
      "character": "Major Jenks"
    },
    {
      "id": "nm0637992",
      "name": "Paulino Nunes",
      "character": "Zephyr"
    },
    {
      "id": "nm0007092",
      "name": "Matthew G. Taylor",
      "character": "Weevil       (as Matt Taylor)"
    },
    {
      "id": "nm0440351",
      "name": "Alex Karzis",
      "character": "Pox"
    },
    {
      "id": "nm4299601",
      "name": "Christina Fox",
      "character": "Ella"
    },
    {
      "id": "nm2228168",
      "name": "Sasha Clements",
      "character": "Marnie"
    },
    {
      "id": "nm1028466",
      "name": "Jesse Camacho",
      "character": "Tony"
    },
    {
      "id": "nm7108348",
      "name": "Richard McMillan",
      "character": "Principal Fragner"
    },
    {
      "id": "nm0730045",
      "name": "Martin Roach",
      "character": "Coach Voss"
    },
    {
      "id": "nm1281786",
      "name": "Beatriz Yuste",
      "character": "Ms. Shapiro"
    },
    {
      "id": "nm4541756",
      "name": "Alesha Bailey",
      "character": "Chloe"
    },
    {
      "id": "nm5025424",
      "name": "Daron Washington",
      "character": "Referee"
    },
    {
      "id": "nm7108350",
      "name": "Adam Pellerine",
      "character": "Linebacker"
    },
    {
      "id": "nm0427616",
      "name": "Brayden Jones",
      "character": "Gleason"
    },
    {
      "id": "nm2161194",
      "name": "Neil Whitely",
      "character": "Police Chief"
    },
    {
      "id": "nm0095980",
      "name": "Brad Borbridge",
      "character": "Deputy"
    },
    {
      "id": "nm2795862",
      "name": "Kevin Alves",
      "character": "Senior"
    },
    {
      "id": "nm4520288",
      "name": "Shaquan Lewis",
      "character": "Injured Team Member"
    },
    {
      "id": "nm7108351",
      "name": "Simon Edwards",
      "character": "Singing Chaperone #1"
    },
    {
      "id": "nm7108352",
      "name": "Jake Warren",
      "character": "Singing Chaperone #2"
    },
    {
      "id": "nm3207927",
      "name": "Josh Dawson",
      "character": "Singing Chaperone #3"
    },
    {
      "id": "nm7108353",
      "name": "Christian Fedele",
      "character": "Singing Chaperone #4"
    },
    {
      "id": "nm4379836",
      "name": "Helen Johns",
      "character": "Computer Voice"
    },
    {
      "id": "nm6430879",
      "name": "Elina Miyake Jackson",
      "character": "High School Student       (as Elina Miyake)"
    },
    {
      "id": "nm4763179",
      "name": "Chanelle Larocque",
      "character": "Nevaeh's Angel"
    },
    {
      "id": "nm6516246",
      "name": "Attila Sebesy",
      "character": "Soldier"
    }
  ],
  "overview": "Mae and Gabby are two friends who go everywhere together but they are not very popular in their school. Their classmates always pressure because they have not had a boyfriend so to avoid further setbacks, the girls put in place a plan to create the perfect boyfriend. Both believe that it will be easy to create their perfect guy using the military team building; machinery owned by the father of Mae, the machine works through a wireless keyboard. The machine can create with their settings, a robotic soldier. Of this plan was born Albert an ideal guy to be a perfect boyfriend. He will be the most popular boy of the school.",
  "storyline": "Follows high school sophomores Mae Hartley and Gabby Harrison, two tech-savvy best friends who devise a plan to create the perfect boyfriend with just a few strokes of the keyboard and a wireless connection. What Gabby and Mae don't realize is that the computer they use is set up to generate a robotic super soldier, which they have inadvertently activated in the form of Albert, a macho yet sensitive super cute boy.",
  "plot": "Mae Hartley and Gabby Harrison are super-smart tenth graders. They are cornered in an alley by the military who advise the girls to give themselves up.\n\nTwo days earlier, the two of them have finished a calculus test under 9 minutes much to the annoyance of the other classmates. Mae has a crush on a jock named Jaden and thinks that he is going to invite her to the Homecoming dance. However, she is publicly humiliated by Nevaeh, a cheerleader and mean girl who is already going with Jaden. In her embarrassment, Mae claims that she already has a boyfriend. To cover the lie, Gabby offers to program a virtual boyfriend for Mae using a computer software called the X-17 which is owned by Mae's father Dr. James Hartley which they think is used to design high definition video game characters. Gabby successfully creates a virtual boyfriend according to Mae's direction, and names him Albert.\n\nThe X-17 software goes haywire and short circuits Mae's dad's computer. Mae's brother Bart agrees to fix the computer if Gabby will go to homecoming with him. But the next morning, Albert actually shows up at school, amazing everyone, especially Nevaeh. Albert soon shows that he can speed read and throw/kick harder than normal humans. Bart tells Gabby she created a robot soldier and hacked into the Pentagon (where his dad happens to work for the United States Department of Defense that uses Superior Gaming as a front) to do so. But this creates a string of problems as General McFee discovers the prototype robot soldier, who happens to be Albert, has escaped. The army presumes he has been stolen. Mae's father tries everything he can to convince General McFee the prototype soldier will be brought back to the facility.\n\nLater that day, Albert asks Mae to Homecoming. Feeling overwhelmed, she tries to explain to Albert that she doesn't feel like she deserves to be his girlfriend. Gabby and Mae talk privately. Gabby thinks the whole thing is getting out of hand and Albert is coming between them. When Albert sings a remix of \"Love You like a Love Song\" by Selena Gomez &amp; the Scene on the ukulele, Mae joins in and agrees to go to the dance with him.\n\nAt the house, Bart and Gabby are interrupted when Zephyr, Weevil and Pox, members of the international arms dealer group Black Sigma, break into the house, trying to find the weapon. Gabby tries to warn Mae about it at the football game, without success. Albert is brought in to play in the game and helps the team stage a comeback. The United States Army soldiers led by General McFee arrive at the homecoming game following an EMP-caused power outage caused by Zephyr that short circuits Albert's wiring. While some soldiers arrest Zephyr, Weevil, and Pox, other with General McFee and Dr. Hartley corner Mae and Gabby in an alley where they are advised to give themselves up.\n\nBack in the present, General McFee and Dr. Hartley explain how they have captured Albert and that they must now forget he ever existed. Mae is upset at the fact that she'll never see him again, and not be able to attend homecoming with him. However, in a turn of events, Albert shows up at the venue having successfully evaded the army, who have been shadowing him all along. Mae's father tries to convince the army to hold off the capture until the homecoming dance is over, not wanting to ruin her night.\n\nNevaeh tries to ruin Mae's night but is dumped by Jaden in the process. To Nevaeh's disappointment, Mae is crowned homecoming queen. However, it is revealed that the ballot box was stuffed by the army in order to trap Albert. Nevaeh interrupts Mae's speech and attempts to convince the audience that Albert is a robotic super soldier, but Jaden thwarts her by turning her warnings into compliments. The situation is successfully resolved and Gabby, along with Bart, talk to Jaden and find out that he originally intended to ask Mae to homecoming, but wasn't brave enough to do so. Gabby also realizes that she was wrong about him.\n\nGabby finds Mae backstage. Mae seems to be conflicted about being elected Homecoming queen. Gabby apologizes to Mae for telling her that Jaden was out of her league, telling her that her true intentions were to not lose her as a friend. She tells Mae that being popular \"isn't really her thing,\" but that she supports Mae in whatever she wants to do. They part ways with Mae more conflicted than ever. The Army also begins to plan their next move, intending to retrieve Albert as soon as he finishes his mission - kissing Mae at Homecoming. The Army, ironically enough, programs and designs the dance floor to be perfect for Mae (with lighting and props) due to her father's request to keep this night perfect until Albert is taken away.\n\nGabby sees one of the U.S. Army soldiers controlling the lights and realizes the Army is trying to capture Albert again. She watches hopelessly (as well as Jaden, also watching from the sidelines) as Mae dances with Albert and moves in to kiss him. However, Mae suddenly backs away and reveals that even though the moment is perfect, it doesn't feel right. Mae realizes she wants a relationship with a boy that's real, not fake or perfectly manipulated like Albert. Albert is impressed by her emotional depth. Albert and Mae hug and he points out that the army is here to take him back. He asks her to initiate his self-destruct, telling her that it is what he wants. Mae complies. Albert bids her goodbye and begins to pulsate with bright lights. Gabby and Mae (along with the guests) watch as Albert breaks out of the venue through the ceiling and is destroyed.\n\nBart smartly covers and thanks Principal Fragner (Richard McMillan) for the 'awesome special effects'. The party continues, and Jaden musters the courage to ask her out. She tells him she'll reply later. Mae and Gabby are excited that Jaden told Mae how he feels, but Mae says \"no boy is going to get in the way of our friendship.\" However, it is revealed that Bart and Gabby are dating, and that Gabby has changed her mind about boys. Then the moon and northern lights appear. The general whines, as he has lost his chance at a super soldier once again.",
  "synopsis": null
}