{
  "imdb_id": "tt3062880",
  "tmdb_id": "270403",
  "douban_id": null,
  "title": "Gett: The Trial of Viviane Amsalem (2014)",
  "genres": [
    "Drama"
  ],
  "country": "Israel",
  "version": [
    {
      "runtime": "115 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.7,
  "director": [
    {
      "id": "nm0253813",
      "name": "Ronit Elkabetz"
    },
    {
      "id": "nm1729095",
      "name": "Shlomi Elkabetz"
    }
  ],
  "writer": [
    {
      "id": "nm0253813",
      "name": "Ronit Elkabetz",
      "description": null
    },
    {
      "id": "nm1729095",
      "name": "Shlomi Elkabetz",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0253813",
      "name": "Ronit Elkabetz",
      "character": "Viviane Amsalem"
    },
    {
      "id": "nm0008787",
      "name": "Simon Abkarian",
      "character": "Elisha Amsalem"
    },
    {
      "id": "nm0025381",
      "name": "Gabi Amrani",
      "character": "Haim"
    },
    {
      "id": "nm0539764",
      "name": "Dalia Beger",
      "character": "Donna Aboukassis"
    },
    {
      "id": "nm0069898",
      "name": "Shmil Ben Ari",
      "character": "Ya'akov Ben Harouch"
    },
    {
      "id": "nm0147978",
      "name": "Abraham Celektar",
      "character": "Shmuel Azoulay"
    },
    {
      "id": "nm0200475",
      "name": "Rami Danon",
      "character": "Rabbi Danino"
    },
    {
      "id": "nm0299924",
      "name": "Sasson Gabai",
      "character": "Rabbi Shimon"
    },
    {
      "id": "nm0330832",
      "name": "Eli Gorenstein",
      "character": "Head Rabbi Salmion       (as Eli Gornstein)"
    },
    {
      "id": "nm1327064",
      "name": "Evelin Hagoel",
      "character": "Evelyn Ben Chouchan"
    },
    {
      "id": "nm0255816",
      "name": "Albert Iluz",
      "character": "Meir"
    },
    {
      "id": "nm0602217",
      "name": "Keren Mor",
      "character": "Galia"
    },
    {
      "id": "nm0637505",
      "name": "Menashe Noy",
      "character": "Carmel Ben Tovim"
    },
    {
      "id": "nm2228496",
      "name": "David Ohayon",
      "character": "David"
    },
    {
      "id": "nm0689407",
      "name": "Roberto Pollack",
      "character": "Rabbi Abraham       (as Roberto Pollak)"
    },
    {
      "id": "nm0720745",
      "name": "Ze'ev Revach",
      "character": "Simo"
    },
    {
      "id": "nm1413449",
      "name": "Ruby Porat Shoval",
      "character": "Rachel Amzalleg       (as Rubi Porat Shoval)"
    }
  ],
  "overview": "The trial story of Viviane Amsalem's five year fight to obtain her divorce in front of the only legal authority competent for divorce cases in Israel, the Rabbinical Court.",
  "storyline": "In Israel there is neither civil marriage nor civil divorce. Only rabbis can legitimize a marriage or its dissolution. But this dissolution is only possible with full consent from the husband, who in the end has more power than the judges. Viviane Amsalem has been applying for divorce for three years. But her husband Elisha will not agree. His cold intransigence, Viviane's determination to fight for her freedom, and the ambiguous role of the judges shape a procedure in which tragedy vies with absurdity, and everything is brought out for judgment, apart from the initial request.",
  "plot": "Viviane Amsalem (Ronit Elkabetz) has been married to her husband, Elisha (Simon Abkarian), for over twenty years. She goes to a religious court in order to obtain a gett as they are living apart and she no longer wants to be married to him. He still hopes to reunite and asks her to move back in with him. The court of rabbis order a trial reunion for the couple which Viviane tries to comply with. After several attempts to comply with the order the marital discord is so severe that she insists on a separation and the divorce trial begins.\n\nOver the course of several years Viviane struggles to obtain a divorce even as her husband does his best to slow the process. Though he tries to prove that he is a good husband and a pious man, witnesses reveal that Elisha is vengeful and petty and that Viviane has in fact been unhappy with him for years. After Elisha's brother, who is acting as his representative, accuses Viviane's lawyer, Carmel, of being in love with her the two brothers feud and Elisha tries to avoid more court appearances. He is then held in contempt of court and finally agrees that he will divorce his wife if the rabbinical judicial panel orders him to. However, when they do so he refuses to grant the divorce. Viviane pleads for help and mercy from the panel but they tell her they are unable to help her.\n\nSometime later Viviane and Elisha return to court having reached an agreement to divorce. Witnesses sign the gett and the rabbis give the document to Elisha to hand to Viviane. However, during the divorce ceremony Elisha finds himself unable to say that Viviane is free to be with other men. Viviane and Elisha are kicked out of the court. Elisha begs for a last minute audience with Viviane and agrees to grant her the divorce if she will promise to never be with another man. Viviane promises and the two return to the courtroom to have their divorce finalized.",
  "synopsis": null
}