{
  "imdb_id": "tt3021360",
  "tmdb_id": "243526",
  "douban_id": null,
  "title": "Faults (2014)",
  "genres": [
    "Comedy",
    "Crime",
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "89 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.7,
  "director": [
    {
      "id": "nm2720681",
      "name": "Riley Stearns"
    }
  ],
  "writer": [
    {
      "id": "nm2720681",
      "name": "Riley Stearns",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0650702",
      "name": "Leland Orser",
      "character": "Ansel"
    },
    {
      "id": "nm0935541",
      "name": "Mary Elizabeth Winstead",
      "character": "Claire"
    },
    {
      "id": "nm0254760",
      "name": "Chris Ellis",
      "character": "Dad"
    },
    {
      "id": "nm0340973",
      "name": "Jon Gries",
      "character": "Terry"
    },
    {
      "id": "nm0714698",
      "name": "Lance Reddick",
      "character": "Mick"
    },
    {
      "id": "nm0335275",
      "name": "Beth Grant",
      "character": "Evelyn"
    },
    {
      "id": "nm4359302",
      "name": "Cruz Flores",
      "character": "Hotel Staff"
    },
    {
      "id": "nm0042978",
      "name": "Suzan Averitt",
      "character": "Photo Studio Customer"
    },
    {
      "id": "nm9164410",
      "name": "Cindy Buck",
      "character": "Mother"
    },
    {
      "id": "nm2461473",
      "name": "David Chandler",
      "character": "Waiter"
    },
    {
      "id": "nm1120315",
      "name": "Leonard Earl Howze",
      "character": "Raymond"
    },
    {
      "id": "nm2092836",
      "name": "Davey Johnson",
      "character": "Concierge"
    },
    {
      "id": "nm1900869",
      "name": "Kellie Matteson",
      "character": "Jennifer"
    },
    {
      "id": "nm1732464",
      "name": "Amanda Saunders",
      "character": "Receptionist"
    },
    {
      "id": "nm2431167",
      "name": "Nicholas Tucci",
      "character": "James"
    },
    {
      "id": "nm2033992",
      "name": "Shira Weitz",
      "character": "Perky Waitress"
    },
    {
      "id": "nm0954655",
      "name": "David Zellner",
      "character": "Restaurant Manager"
    }
  ],
  "overview": "Claire is under the grip of a mysterious new cult called Faults. Desperate to be reunited with their daughter, Claire's parents recruit one of the world's foremost experts on mind control, Ansel Roth.",
  "storyline": "Washed-up and broke, an author whose books on mind control were once respected reluctantly helps a couple in deprogramming their daughter from the control of a cult named \"Faults.\" But this assignment turns out to be more complicated than he had expected.",
  "plot": "Hazel Grace Lancaster is an intelligent and witty teenager living in Indianapolis, who has terminal thyroid cancer that has spread to her lungs. Believing she is depressed, her mother Frannie urges her to attend a weekly cancer patient support group to help her make friends with individuals who are going through the same thing. There Hazel meets Augustus Waters, a charming teenager who lost a leg from bone cancer but has since been cancer-free. He invites Hazel to his house where they bond over their hobbies and agree to read each other's favorite book. Hazel recommends An Imperial Affliction, a novel about a cancer-stricken girl named Anna that parallels her experience, and Augustus gives Hazel Counter Insurgence. They keep in touch via text over the weeks that follow and grow closer. After Augustus finishes the book, he expresses frustration with its abrupt ending (it ends in the middle of a sentence). Hazel explains that the novel's mysterious author, Peter Van Houten (Willem Dafoe), retreated to Amsterdam following the novel's publication and has not been heard from since.\n\nWeeks later, Augustus tells Hazel he has traced Van Houten's assistant, Lidewij, and has corresponded with Van Houten by email. She writes to him to find out more about the novel's ambiguous ending. Van Houten replies that he is only willing to answer her questions in person. Hazel asks her mother if she can travel to Amsterdam to visit him, but Frannie refuses because of financial and medical constraints. Augustus suggests that she use the \"cancer wish\" she received from Make-A-Wish Foundation but Hazel explains that she has already used hers to visit Disney World. Augustus and Hazel go on a picnic date and begin to fall in love. Augustus surprises Hazel with tickets to Amsterdam. After a medical setback, Hazel's doctors eventually agree to allow the trip, since they expect that she will soon become incapable of doing anything at all.\n\nHazel and Augustus arrive in Amsterdam and are presented with reservations at an expensive restaurant, pre-paid by Van Houten. During the meal, Augustus confesses his love for Hazel. The following afternoon, they go to Van Houten's house, but are shocked to find he is a mean-spirited alcoholic. Lidewij arranged the meeting and their dinner without Van Houten knowing anything about it. Angered by his assistant's actions, he taunts Hazel for seeking serious answers to a piece of fiction and belittles her medical condition. She leaves, utterly distraught. Lidewij invites them to go sightseeing to make up for their ruined experience. The three visit the Anne Frank House, where Hazel struggles to climb the house's many stairs. They spend that night together in their hotel and have sex for the first time. The next day Augustus tells Hazel that his cancer has returned and spread throughout his body and is terminal. Hazel is heartbroken, expressing how unfair life can be.\n\nAfter their return to Indianapolis, Augustus' health worsens. He is taken to the ICU and realizes he is close to death. Augustus invites his blind best friend Isaac and Hazel to his pre-funeral, where they deliver eulogies that they have both prepared. Hazel tells him she would not trade their short time together for anything, since he \"gave me a forever within the numbered days.\" Augustus dies eight days later and Hazel is astonished to find Van Houten at the funeral. He tells her that Augustus had demanded he attend his funeral to make up for the spoiled trip. Van Houten tells her that the novel is based on the experiences of his daughter Anna, who died from leukemia at a young age. He gives Hazel a piece of paper which she crumples up asking him to leave. Later, talking with Isaac, Hazel learns that Augustus had asked Van Houten to help him write a eulogy for her. She retrieves the crumpled paper and reads his words accepting his death and about his love for her. She lies on her back on her lawn looking up at the stars, smiling as she remembers Augustus and says: \"Okay.\"\nAn Imperial Affliction\n\nThe book An Imperial Affliction, which features within both the original novel and the film, is fictitious, as is its author Peter Van Houten; both are used to enhance the themes and story.\nDifferences between the novel and film\n\nAccording to Lindsey Weber of Vulture.com, the differences between the book and the film include Hazel mentioning the band the Hectic Glow many times in the book, but not in the film. Gus is 17 in the book but 18 in the film. In the book, Gus has an ex-girlfriend, Caroline, who died from cancer which is not mentioned in the film. Hazel's former best friend Kaitlyn does not appear in the film. In the book, Hazel and Gus meet when she turns around to find him staring at her, while in the film they meet on the way to their support group. Gus dies more quickly in the film than in the book. In the book, Hazel searches for the letter, while in the film, Van Houten gives it to her. In the book, Hazel shows forgiveness towards van Houten after Gus's funeral, while in the film she demands that he leave. In the book, Hazel is a vegetarian but this is not referenced in the film. A scene in the film in which Gus comes in a limousine to pick up Hazel and her mother when they are leaving for Amsterdam, does not appear in the book. However, in the book, Gus is late when Hazel and her mother arrive at his house in a taxi because he appears to be fighting with his parents over his cancer relapse and the trip.",
  "synopsis": null
}