{
  "imdb_id": "tt3195644",
  "tmdb_id": "280092",
  "douban_id": "25728008",
  "title": "Insidious: Chapter 3 (2015)",
  "genres": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.1,
  "director": [
    {
      "id": "nm1191481",
      "name": "Leigh Whannell"
    }
  ],
  "writer": [
    {
      "id": "nm1191481",
      "name": "Leigh Whannell",
      "description": "written by"
    },
    {
      "id": "nm1191481",
      "name": "Leigh Whannell",
      "description": "characters"
    }
  ],
  "cast": [
    {
      "id": "nm0000551",
      "name": "Dermot Mulroney",
      "character": "Sean Brenner"
    },
    {
      "id": "nm2640887",
      "name": "Stefanie Scott",
      "character": "Quinn Brenner"
    },
    {
      "id": "nm0760151",
      "name": "Angus Sampson",
      "character": "Tucker"
    },
    {
      "id": "nm1191481",
      "name": "Leigh Whannell",
      "character": "Specs"
    },
    {
      "id": "nm0005417",
      "name": "Lin Shaye",
      "character": "Elise Rainier"
    },
    {
      "id": "nm3131124",
      "name": "Tate Berney",
      "character": "Alex Brenner"
    },
    {
      "id": "nm0533197",
      "name": "Michael Reid MacKay",
      "character": "The Man Who Can't Breathe"
    },
    {
      "id": "nm0183548",
      "name": "Steve Coulter",
      "character": "Carl"
    },
    {
      "id": "nm3072243",
      "name": "Hayley Kiyoko",
      "character": "Maggie"
    },
    {
      "id": "nm1151458",
      "name": "Corbett Tuck",
      "character": "Danielle"
    },
    {
      "id": "nm0280600",
      "name": "Tom Fitzpatrick",
      "character": "Bride in Black"
    },
    {
      "id": "nm0303132",
      "name": "Tom Gallop",
      "character": "Dr. Henderson"
    },
    {
      "id": "nm0688432",
      "name": "Jeris Poindexter",
      "character": "Harry       (as Jeris Lee Poindexter)"
    },
    {
      "id": "nm0444185",
      "name": "Ele Keats",
      "character": "Lilith Brenner"
    },
    {
      "id": "nm0032399",
      "name": "Phyllis Applegate",
      "character": "Grace"
    },
    {
      "id": "nm0009223",
      "name": "Phil Abrams",
      "character": "Mel"
    },
    {
      "id": "nm2276216",
      "name": "Erin Anderson",
      "character": "Two-Faced Woman"
    },
    {
      "id": "nm3111477",
      "name": "Amaris Davidson",
      "character": "Nurse"
    },
    {
      "id": "nm1190373",
      "name": "Ashton Moio",
      "character": "Hector"
    },
    {
      "id": "nm0307253",
      "name": "Ruben Garfias",
      "character": "Ernesto       (as Rubén Garfias)"
    },
    {
      "id": "nm1073059",
      "name": "Fawn Irish",
      "character": "Lambert Woman"
    },
    {
      "id": "nm4973896",
      "name": "Taylor John Smith",
      "character": "Teenage Boy"
    },
    {
      "id": "nm0816962",
      "name": "Adrian Sparks",
      "character": "Jack Rainier"
    },
    {
      "id": "nm3090931",
      "name": "Jacob Crawford",
      "character": "Male Nurse"
    },
    {
      "id": "nm1490123",
      "name": "James Wan",
      "character": "Theater Director"
    },
    {
      "id": "nm2238724",
      "name": "Garrett Ryan",
      "character": "Young Josh"
    },
    {
      "id": "nm1177766",
      "name": "Joseph Bishara",
      "character": "Lipstick-Face Demon"
    }
  ],
  "overview": "A twisted new tale of terror begins for a teenage girl and her family, predating the haunting of the Lambert family in the earlier movies and revealing more mysteries of the otherworldly realm The Further.",
  "storyline": "After trying to connect with her dead mother, teenager Quinn Brenner, asks psychic Elise Rainier to help her, she refuses due to negotiate events in her childhood. Quinn starts noticing paranormal events happen in her house. After a vicious attack from a demon her father goes back and begs Elise Rainier to use her abilities to contact the other side in hope to stop these attacks by this furious demon content for a body.",
  "plot": "A few years before the events of the first film, retired parapsychologist, Elise Rainier (Lin Shaye), reluctantly uses her spiritual ability to contact the spirit of Quinn Brenner's (Stefanie Scott) mother, Lillith, who died a year before. However, she urges Quinn not to make contact with her mother again after she senses that the spirit is not Lillith. Quinn begins to see a mysterious figure waving at her from a distance, and following her unsuccessful attempt to win an audition for a prestigious drama school, she is hit by a car and briefly flatlines before waking up with her legs cast.\n\nThe accident leaves Quinn stuck in her apartment with her father, Sean (Dermot Mulroney), and younger brother, Alex (Tate Berney). The demonic figure continues to haunt her, becoming increasingly malevolent as time progresses and leaving Quinn with her neck injured after the demon flings her around her bedroom. Sean tries to convince Elise, who like him is still grieving after the loss of her husband Jack, to help his daughter, but Elise declines, stating that her previous visits to the \"dark\" spiritual world made her realize that an evil spirit is hunting to kill her. However, she is convinced by her fellow parapsychologist, Carl (Steve Coulter), to continue using her spiritual ability, reminding her about her successful case involving Josh Lambert and stating that she is stronger than any spirits or demons because she is living and they are not.\n\nDue to Elise's refusal, Alex suggests to call the demonologists Specs (Leigh Whannell) and Tucker (Angus Sampson), but Quinn's possession grows increasingly worse as she, now possessed by the demon, breaks through her braces. Realizing that they are scammers, Sean prepares to kick the duo out until Elise arrives timely. Deducing that the demon's goal is to lure potential victims to \"the Further\" so it can eat their life force, Elise decides to enter the spiritual world with Specs and Tucker recording any activities and words she spells out. With the help of a spirit who likewise is a victim of the demon, Elise enters the Further and after a brief encounter with the evil spirit that haunts her, the Bride in Black/Parker Crane (Tom Fitzpatrick), meets with Jack (Adrian Sparks), whom she realizes is the demon (Michael Reid MacKay). While managing to defeat the demon, Elise returns to the material world after realizing that Quinn has to defeat the faceless version of herself by herself, who is slowly taking control of her features and soul. Though Quinn is at first at a disadvantage, Elise reads a message that the Brenners' late neighbor had tried to tell Quinn of: that Lillith is leaving her with a letter to read before she graduated. Lillith's (Ele Keats) spirit then appears to help Quinn fully take control of her body and return to the material world. She then disappears after leaving parting words to her family.\n\nFollowing the Brenner' successful case, Elise decides to come out of retirement and work with Specs and Tucker. She arrives home and notices a figure watching her from outside. Thinking that it is Jack at first, Elise realizes that it is something demonic as the demon from the first film (Joseph Bishara) suddenly appears beside her.",
  "synopsis": "A prequel set before the haunting of the Lambert family. Elise Rainier reluctantly agrees to use her spiritual ability to contact the dead in order to help Quinn Brenner, a teenage girl whose mother Lillith has recently passed. Quinn believes that Lillith has been attempting to reach out to her through the spirit world, so she visits Elise for a reading. Elise is unable to complete the reading, she stops after hearing a demonic presence who threatens to kill her. She warns Quinn that if, \"you call out to one of the dead,all of them can hear you.\"Soon after the reading, Quinn begins to hear noises at night and notices more and more supernatural events occuring. She skips school to audition for a theater academy in New York. Before going onstage, she notices a figure waving to her from the offstage. This throws her audition off, and she stumbles through her lines. Later that night, Quinn meets with her friend Maggie. Maggie complains of her blown audition, and after they have a short conversation, both start feeling better. As they are crossing the street, Quinn sees the same figure waving down the street and stops to look. She is then hit by a car. The car accident leaves Quinn with two broken legs in casts. She is bound to a wheelchair. Her father, Sean, puts her in bed, with a bell to ring if she need him. Later in the night, she hears a knock on her wall. Assuming it is her next door neighbor Hector, she knocks twice. He copies her, and she knocks the \"Shave and a Haircut\" pattern. He finishes it. Quinn texts Hector, when he reveals that he isn't home. Fearing it was someone else next door, she turns the light off to go to bed. The bell rings itself, scaring her, and her dad comes in.These paranormal occurances become more and more frequent, each time Sean comes in and saves her. The demon is seen more and more frequently: a demonic corpse with a breathing mask, making a deathly rattling noise. Sean finds her thrown from her bed, on an entirely different floor, etc. Eventually, a version of Quinn without a face, hands or feet, is seen following under the demon's command. The odd version of Quinn is found by Sean on the ground outside of a broken window. When Quinn attempts to look over the edge of the window to see, the demon grabs her and tries to pull her down. Sean saves her, but her neck is injured in the process. Sean attempts to get in contact with Elise. She reluctantly comes, but as she enters the spiritual realm she finds herself afraid, and the demon very nearly kills her. She is brought back to living world, terrified, and refuses to continue. Sean has no choice but to call in someone else, a pair of bloggers: Specs and Tucker. Meanwhile, Elise seeks solace from her friend Carl with her same \"gift\". Carl reassures her that she is much stronger than she believes.After a terrifying experience with Quinn and her demon, the three men admit that there is no doing this without Elise. Elise is now willing to help, this time she is much more powerful and confident. She is easily able to defeat the demon, but as they are escaping, it grabs a hold of Quinn's limbless version. This version of Quinn is revealed to be the half of Quinn's soul that the demon controls. Elise returns to the living world, and tells the group that this part of the battle must be fought by Quinn alone. They all grab ahold of her, but it is shown that she is losing the battle against the demon, as her alternate version gains more of her features. Elise begins to hear a voice in the living world, leading her to Quinn's diary, revealing a letter that Lillith wanted her to see before she graduated. The power from this letter helps guide Lillith to save Quinn and banish the demon, returning her to the living world. Lillith leaves her with some parting words, and the family is finally back together, as Specs and Tucker join Elise to deal with other supernatural disturbances.Elise heads home to find that her husband's spirit has left his sweater on the bed. Overwhelmed with emotion, she holds his sweater close. Her dog then begins barking into the darkness. Elise approaches the area he's barking at, where she discovers the presence of two supernatural entities."
}