{
  "imdb_id": "tt3142688",
  "tmdb_id": "283201",
  "douban_id": null,
  "title": "Finding Fanny (2014)",
  "genres": [
    "Adventure",
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "102 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm1223294",
      "name": "Homi Adajania"
    }
  ],
  "writer": [
    {
      "id": "nm1223294",
      "name": "Homi Adajania",
      "description": "written by"
    },
    {
      "id": "nm1802643",
      "name": "Kersi Khambatta",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2138653",
      "name": "Deepika Padukone",
      "character": "Angie"
    },
    {
      "id": "nm0787462",
      "name": "Naseeruddin Shah",
      "character": "Ferdinand Pinto"
    },
    {
      "id": "nm9441688",
      "name": "Basilo Dias",
      "character": "Man Reading Newspaper"
    },
    {
      "id": "nm9441689",
      "name": "Kevin D'Mello",
      "character": "Baker"
    },
    {
      "id": "nm9441690",
      "name": "Urcelina Mascarenhas",
      "character": "Sewing Woman"
    },
    {
      "id": "nm0438092",
      "name": "Dimple Kapadia",
      "character": "Rosie Eucharistica"
    },
    {
      "id": "nm1802377",
      "name": "Ankur Tewari",
      "character": "Prospective Groom"
    },
    {
      "id": "nm4405794",
      "name": "Anjali Patil",
      "character": "Stefanie Fernandes"
    },
    {
      "id": "nm3828984",
      "name": "Ranveer Singh",
      "character": "Gabo Eucharistica"
    },
    {
      "id": "nm9441691",
      "name": "Meher Verma",
      "character": "Little Girl in Wedding"
    },
    {
      "id": "nm0438488",
      "name": "Pankaj Kapur",
      "character": "Don Pedro Cleto Colaco"
    },
    {
      "id": "nm2945270",
      "name": "Anand Tiwari",
      "character": "Father Francis"
    },
    {
      "id": "nm1819083",
      "name": "Arjun Kapoor",
      "character": "Savio Da Gama"
    },
    {
      "id": "nm4439925",
      "name": "Libert Olivera",
      "character": "Savio's Father       (credit only)"
    },
    {
      "id": "nm9441692",
      "name": "Rithika Po",
      "character": "Choir Girl 1"
    },
    {
      "id": "nm9441693",
      "name": "Calsay Albuquerque",
      "character": "Choir Girl 2"
    },
    {
      "id": "nm9441694",
      "name": "Rihija Govekar",
      "character": "Choir Girl 3"
    },
    {
      "id": "nm9441695",
      "name": "Natalie Sealy",
      "character": "Choir Girl 4"
    },
    {
      "id": "nm9441696",
      "name": "Blisscia Fernandes",
      "character": "Choir Girl 5"
    },
    {
      "id": "nm9441697",
      "name": "Riona Po",
      "character": "Choir Girl 6"
    },
    {
      "id": "nm9441698",
      "name": "Vedant Govekar",
      "character": "Choir Boy 1"
    },
    {
      "id": "nm9441699",
      "name": "Mark D'Souza",
      "character": "Choir Boy 2"
    },
    {
      "id": "nm9441700",
      "name": "Digvesh Parab",
      "character": "Choir Boy 3"
    },
    {
      "id": "nm9441701",
      "name": "Sahil Belekar",
      "character": "Choir Boy 4"
    },
    {
      "id": "nm9441702",
      "name": "Shreyash Sawant",
      "character": "Choir Boy 5"
    },
    {
      "id": "nm9441703",
      "name": "Sherwyn Misquitta",
      "character": "Choir Boy 6"
    },
    {
      "id": "nm9441704",
      "name": "Mihai Fusu",
      "character": "Vladimir Ilyanov"
    },
    {
      "id": "nm9441705",
      "name": "Rosario Band",
      "character": "Band in Feast"
    },
    {
      "id": "nm9441706",
      "name": "Anya Bostock",
      "character": "Angel in Feast"
    },
    {
      "id": "nm9441707",
      "name": "Muhammad Kaif",
      "character": "Alter Ego Boy"
    },
    {
      "id": "nm9441708",
      "name": "Sonja Appel",
      "character": "Woman on Bike"
    },
    {
      "id": "nm9441709",
      "name": "The Panjim Band",
      "character": "Band in Funeral"
    },
    {
      "id": "nm5097668",
      "name": "Bond Braganza",
      "character": "Paul Bearer 1"
    },
    {
      "id": "nm9441710",
      "name": "Girish Salgaonkar",
      "character": "Paul Bearer 2"
    },
    {
      "id": "nm8967788",
      "name": "Nandita Bandyopadyay",
      "character": "Old Fanny"
    },
    {
      "id": "nm9441711",
      "name": "Mohan Deshprabhu",
      "character": "Wedding Photographer"
    },
    {
      "id": "nm9441712",
      "name": "Winston Bento Travasso",
      "character": "Opera Voice of Ferdie       (voice)"
    }
  ],
  "overview": "A man embarks on a road trip to find his lost love.",
  "storyline": "Late one night, an undelivered letter is returned to postmaster and singer Ferdinand 'Ferdie' Pinto. He realizes that his one true love Stefanie 'Fanny' Fernandes never received the marriage proposal he sent to her forty-six years earlier. Angie, a young widow and Ferdie's dear friend suggests they go on a road trip to find Fanny. Joining them on the journey is Rosie, Angie's mother-in-law; and Don Pedro, an artists who is keen to paint Rosie. Driving the car is Savio, the childhood friend whose heart Angie broke six years earlier when she married another.",
  "plot": "The film begins with Ferdinand 'Ferdie' Pinto aka Fernando (Naseeruddin Shah), receiving a letter in the middle of the night and realizes that his one true love Stefanie 'Fanny' Fernandes (Anjali Patil), never knew about his true feelings for her. Angelina 'Angie' Eucharistica (Deepika Padukone), a young widow and a dear friend to Ferdie decides to help him find Fanny with the help of her mother-in-law Rosalina 'Rosie' Eucharistica (Dimple Kapadia), a good-for-nothing artist called Don Pedro Cleto Collaco (Pankaj Kapur) and her childhood friend Savio Da Gama (Arjun Kapoor), who has only recently returned from Mumbai after leaving when Angie got married to Gabo Eucharistica (Ranveer Singh), his best friend instead of him. They set off in high hopes of finding Fanny. Gabo dies suddenly while revelling during his marriage party leaving young Angie as a widow.\n\nOn the journey, Ferdie throws Rosie's cat out of the window by accident whilst sneezing as he is allergic; so to keep her unawares, they bring the dead cat and pretend that it is sleeping. They visit Fanny's old house and find a deranged Russian man Vladmir Olianov (Mihai Fusu), who eventually tells them that Fanny sold him the house 20 years ago and moved to Tivoli. On the journey at a rail crossing, Ferdie tells Savio that Rosie's husband isn't dead and instead had run away to Madagascar with a girl; Rosie had simply lied to the village for the sake of her pride. As they approach Tivoli, Ferdie gives a speech and thanks everyone for joining him on his journey – but unbeknownst to him, everybody has their own reasons for going on the journey except for Angie, who just wants to help old Ferdie. However, Savio realizes that they have gone the wrong way and are now, in fact, in Karnataka state due to wrong navigation by Ferdie, who cannot read a map. When they run out of petrol, Ferdie volunteers to go and get some in a jerrycan in the morning; so they spend the night in the open field next to the road. Don Pedro tries his hand at seducing Rosie into being a model for his painting whilst Savio and Angie go away from the others to talk. Savio tells Angie that he does not have a big business in Mumbai as presumed; in fact, he was a waiter for 5 years and is as poor as the rest of them. It is revealed that Angie only married Gabo because Savio never asked her, she was in fact, in love with Savio as he was with her. He kisses her and she slaps him. They eventually talk and after realizing that they both still have feelings for each other, they have sex that night.\n\nIn the morning, Ferdie goes to find petrol and comes back to Rosie posing in the field for Don Pedro and Angie and Savio busy talking. Don Pedro has dropped his prettiness of suave sophistication and is mistreating Rosie. When she sees the painting, she is devastated as she thought it was for church when it is in fact a nude unflattering portrait of her. Don Pedro walks off with the painting and finds the jerrycan that Ferdie has left along with a letter explaining that he is going on alone and thanking them for coming this far with him. The rest of them start to leave but Rosie refuses to go, saying that they can't leave Ferdie. She gets extremely upset and begins yelling at Savio, telling him that he should have died, not Gabo and that Gabo only married Angie because Savio was in love with her. Savio angrily tells her off for being selfish herself and tells her that her cat is actually dead and she hadn't even noticed or fed her, leaving everyone else to look after it. They bury the cat and set off home. On the way, Rosie accidentally opens the glove compartment in the car and finds Savio's father's revolver and puts it to her head, intending to shoot herself. When no one notices, she coughs and Savio sees his dad's revolver which is an antique and worth a lot of money and begins wrestling with Rosie for the gun, whilst driving. When they are fighting for the gun, it goes off and Don Pedro gets shot in the head without anyone noticing. They turn the car around and go to look for Ferdie; they find him by the road side waiting for the bus but can't pick him up as the car brakes fail. The back door of the car opens and when the car veers close to the cliff edge, Don Pedro's body falls out. The car eventually comes to a stop and Angie notices that Don Pedro has gone. Rosie says that he jumped out of the car to save himself, then Ferdie sees someone who he thinks is Don Pedro on a passing bus, while in fact, his body is in the bottom of the sea.\n\nThe rest of them carry on to Tivoli to find Fanny. They get to the village to see a funeral procession go past; Ferdie sees a woman that he thinks is his beloved Fanny. He runs up to her only to discover that she is Fanny's daughter (Anjali Patil) and the funeral procession is for Fanny. Ferdie is told by the daughter that Fanny was married four times and never even mentioned his name to her daughter, implying that he wasn't important to her. They go to the funeral and Angie muses that you can't wait for love, you must go out and find it. The story moves ahead by six months to a wedding in the church, initially presumed to be between Savio and Angie but is in fact between Ferdie and Rosie. The happy couple drives away into the sunset, leaving behind Angie and Savio kissing near the church as they leave.",
  "synopsis": null
}