{
  "imdb_id": "tt3164166",
  "tmdb_id": "268115",
  "douban_id": null,
  "title": "Patchwork Family (2014)",
  "genres": [
    "Comedy",
    "Drama",
    "Family"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "91 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm3258082",
      "name": "Pascal Rabaté"
    }
  ],
  "writer": [
    {
      "id": "nm2466151",
      "name": "Antoine Pinson",
      "description": "writer"
    },
    {
      "id": "nm3258082",
      "name": "Pascal Rabaté",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0098793",
      "name": "Sami Bouajila",
      "character": "Christian"
    },
    {
      "id": "nm0141140",
      "name": "Isabelle Carré",
      "character": "Christine"
    },
    {
      "id": "nm0699545",
      "name": "Daniel Prévost",
      "character": "Kader"
    },
    {
      "id": "nm0815668",
      "name": "Zinedine Soualem",
      "character": "Patrick Fellous"
    },
    {
      "id": "nm2686320",
      "name": "Talina Boyaci",
      "character": "Vanessa"
    },
    {
      "id": "nm3729435",
      "name": "Laura Genovino",
      "character": "Alizée"
    },
    {
      "id": "nm3041664",
      "name": "David Salles",
      "character": "Olivier"
    },
    {
      "id": "nm0773740",
      "name": "Charles Schneider",
      "character": "L'entraîneur"
    },
    {
      "id": "nm3119704",
      "name": "Olivier Jeannelle",
      "character": "Marc"
    },
    {
      "id": "nm0494287",
      "name": "Joël Lefrançois",
      "character": "Animateur triathlon"
    },
    {
      "id": "nm0726814",
      "name": "Philippe Rigot",
      "character": "Animateur triathlon"
    },
    {
      "id": "nm2772272",
      "name": "Thierry Robard",
      "character": "Animateur triathlon"
    },
    {
      "id": "nm2312927",
      "name": "Stéphanie Pillonca",
      "character": "La mère de Vanessa"
    },
    {
      "id": "nm6296590",
      "name": "Nicolas Avinée",
      "character": "Le stagiaire"
    },
    {
      "id": "nm0746019",
      "name": "Mireille Roussel",
      "character": "Animatrice majorettes"
    },
    {
      "id": "nm0303145",
      "name": "Jean-François Gallotte",
      "character": "Le voisin bègue"
    },
    {
      "id": "nm1086956",
      "name": "Gustave Kervern",
      "character": "Paul Gracineau       (as Gustave de Kervern)"
    },
    {
      "id": "nm0759608",
      "name": "Sophie Sam",
      "character": "Mme Colon"
    },
    {
      "id": "nm4649622",
      "name": "Soazig Segalou",
      "character": "Fille boîte de nuit"
    },
    {
      "id": "nm1835510",
      "name": "Patrick Harivel",
      "character": "Voisin Kader"
    },
    {
      "id": "nm6430260",
      "name": "Alain Leclerc",
      "character": "Le gréviste"
    },
    {
      "id": "nm1013436",
      "name": "Florence Maury",
      "character": "Directrice des ventes Santos"
    },
    {
      "id": "nm6750487",
      "name": "Parvin Tchizari",
      "character": "Madame Yildirim"
    },
    {
      "id": "nm2078473",
      "name": "Sébastien Autret",
      "character": "Paul"
    },
    {
      "id": "nm0508920",
      "name": "Tony Librizzi",
      "character": "Homme boîte de nuit"
    },
    {
      "id": "nm3908197",
      "name": "Jean-Marie Sirgue",
      "character": "Homme boîte de nuit"
    },
    {
      "id": "nm5408954",
      "name": "Dominique Maingot",
      "character": "Client Patrick"
    },
    {
      "id": "nm6898023",
      "name": "Arnaud Pépin",
      "character": "Le grosse caissiste"
    }
  ],
  "overview": "Christian is a divorced father who can only see his young  daughter Vanessa every other weekend.  When he meets the single mother Christine and decides  to participate in a summer TV show, his whole life is  turned upside down.",
  "storyline": "Christian is a divorced father who can only see his young daughter Vanessa every other weekend. When he meets the single mother Christine and decides to participate in a summer TV show, his whole life is turned upside down.",
  "plot": "Lingesan (Vikram) is a bodybuilder from Chennai, Tamil Nadu, whose main ambition is to become Mr. India. He wins the title of Mr. Tamil Nadu, which gives him direct entry to the Mr. India pageant. He is infatuated by Diya (Amy Jackson), a leading supermodel. Diya is soon blacklisted and all her advertisement film contracts are cancelled by John (Upen Patel), her co-star in all her advertisements, after she constantly rejected his advances. To save her career, Diya decides to replace John with Lingesan, whom she had earlier met at one of her shoots, as her co-star for her next advertisement. The shooting is to take place in China at the same time when the Mr. India contest is to take place, but Lingesan agrees, sacrificing his Mr. India ambitions in the process.\n\nLingesan is given a makeover by Diya's stylist, a transgender woman Osma Jasmine (Ojas Rajani). The shoot initially does not go well as Lingesan is shy and awkward around Diya. On her director's advice, Diya pretends to fall in love with Lingesan so that he would loosen up and perform better during the shoot. The plan proves successful and gradually both excel in the modelling industry as the lead pair. As time passes, Diya reciprocates Lingesan's love for her and they soon get engaged.\n\nIn his journey from a bodybuilder to a top model, Lingesan makes many enemies, including John, whose modelling career was ruined due to Lingesan's rising popularity; Osma, who was infatuated by Lingesan and proposed to him, only to be rejected; industrialist Indrakumar (Ramkumar Ganesan), whose company suffered losses when Lingesan refused to endorse their soft drink as it was reported to contain pesticides; and another bodybuilder Ravi (M. Kamaraj), who also competed for the Mr. Tamil Nadu title but lost to Lingesan. These four people conspire to take revenge on Lingesan and destroy his fame and modelling career.\n\nTwo days before his wedding, Lingesan slowly starts to experience hair and teeth loss and a skin disorder. He consults his friend Vasudevan (Suresh Gopi), a doctor who is also the guardian of Diya's family. Vasudevan claims that he is suffering from a rare and incurable genetic disease which results in premature ageing. Lingesan's condition worsens, with his face and body deforming, and eventually he becomes a hunchback. In his current condition, Lingesan decides to disappear from public eye and also from Diya's life by faking his death in a car accident. Only his friend Babu (Santhanam) and Vasudevan know that he is alive. Lingesan asks Vasudevan to marry Diya as he is the only person who will be able to understand Diya's past and present situation. Vasudevan agrees and the wedding is fixed.\n\nOn the eve of Diya's wedding, another doctor reveals to Lingesan that, contrary to Vasudevan's claims, he is actually suffering from H4N2 influenza, caused by the \"I\" virus, which can only be transmitted by injection. He discovers that John, Osma, Indrakumar, Ravi and, to his horror, even Vasudevan, are responsible for injecting the virus into his body. Vasudevan had an insatiable lust for Diya since she was ten years old and was enraged when she chose Lingesan over him. Therefore, he sided with Lingesan's enemies and planned the entire operation to have Lingesan injected with the virus. An enraged and betrayed Lingesan abducts Diya on her wedding day and keeps her safely in an old house without revealing his identity to her.\n\nAided by Babu, Lingesan starts taking revenge on those who had deformed him. He first immolates Ravi, who suffers severe burns. He then prepares a paste which Osma applies on her body, causing her body to sprout huge growths of hair. Next, he subjects Indrakumar to bee stings all over his body. He fights John over a moving train and gets him electrocuted. Finally, he gets Vasudevan to unwittingly inject a virus into himself, causing his whole body to swell up. After achieving his revenge, Lingesan reveals his condition to Diya, who, though initially taken aback, still loves him despite his deformity. They decide to live a secluded life together. Lingesan undergoes ayurvedic treatment, yoga and physiotherapy for his condition and soon returns to normal.",
  "synopsis": null
}