{
  "imdb_id": "tt3161960",
  "tmdb_id": "300839",
  "douban_id": null,
  "title": "Nobody from Nowhere (2014)",
  "genres": [
    "Drama",
    "Thriller"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "118 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.7,
  "director": [
    {
      "id": "nm1141181",
      "name": "Matthieu Delaporte"
    }
  ],
  "writer": [
    {
      "id": "nm1141181",
      "name": "Matthieu Delaporte",
      "description": "screenplay adaptation dialogue"
    },
    {
      "id": "nm0478799",
      "name": "Alexandre de La Patellière",
      "description": "screenplay adaptation dialogue"
    }
  ],
  "cast": [
    {
      "id": "nm0440913",
      "name": "Mathieu Kassovitz",
      "character": "Sébastien Nicolas /              Henri de Montalte"
    },
    {
      "id": "nm0189887",
      "name": "Marie-Josée Croze",
      "character": "Clémence Corneli"
    },
    {
      "id": "nm0136001",
      "name": "Éric Caravaca",
      "character": "Capitaine Deveaux"
    },
    {
      "id": "nm6734788",
      "name": "Diego Le Martret",
      "character": "Vincent Corneli       (as Hugo Le Martret)"
    },
    {
      "id": "nm0278239",
      "name": "Siobhan Finneran",
      "character": "Elizabeth Traven"
    },
    {
      "id": "nm0239947",
      "name": "Philippe Duclos",
      "character": "Le prêtre"
    },
    {
      "id": "nm0705005",
      "name": "Olivier Rabourdin",
      "character": "Pierre Chambard"
    },
    {
      "id": "nm0594885",
      "name": "Geneviève Mnich",
      "character": "Hélène Nicolas, la mère"
    },
    {
      "id": "nm0613573",
      "name": "Bernard Murat",
      "character": "Henri de Montalte       (voice)"
    },
    {
      "id": "nm1151200",
      "name": "Dimitri Storoge",
      "character": "Charles Beaumont"
    },
    {
      "id": "nm0968797",
      "name": "Sophie Cattani",
      "character": "Marion, la soeur"
    },
    {
      "id": "nm0710628",
      "name": "Mounia Raoui",
      "character": "L'adjointe de Deveaux"
    },
    {
      "id": "nm0747678",
      "name": "Matthieu Rozé",
      "character": "Bertrand, le vendeur Fnac"
    },
    {
      "id": "nm1311741",
      "name": "Hichem Yacoubi",
      "character": "Mourad, aux Alcooliques Anonymes"
    },
    {
      "id": "nm1649894",
      "name": "Martin Pautard",
      "character": "Paul Roumagnac /              Doublure Sébastien Nicolas"
    },
    {
      "id": "nm0077987",
      "name": "Ludovic Berthillot",
      "character": "L'animateur des Alcooliques Anonymes"
    },
    {
      "id": "nm1731527",
      "name": "Antoine Oppenheim",
      "character": "Julien, le beau-frère"
    },
    {
      "id": "nm0163096",
      "name": "Leslie Clack",
      "character": "Doublure Henri de Montalte"
    },
    {
      "id": "nm6930005",
      "name": "Inès Aniado",
      "character": "Maria, la concierge"
    },
    {
      "id": "nm2672457",
      "name": "Jean-Baptiste Guinchard",
      "character": "Le policier moqueur"
    },
    {
      "id": "nm6930006",
      "name": "Guillaume Tagnati",
      "character": "Le policier 2"
    },
    {
      "id": "nm0873539",
      "name": "Gaëlle Tronquit",
      "character": "L'infirmière espagnole"
    },
    {
      "id": "nm6930007",
      "name": "Jan Orawiec",
      "character": "Le professeur de violon"
    },
    {
      "id": "nm5184365",
      "name": "Julianne Binard",
      "character": ""
    },
    {
      "id": "nm0440914",
      "name": "Peter Kassovitz",
      "character": "Joseph Rosenblatt       (scenes deleted)"
    },
    {
      "id": "nm3318396",
      "name": "Thomas Lemoine",
      "character": "Policier"
    },
    {
      "id": "nm1046476",
      "name": "Miren Pradier",
      "character": "Vendeuse Décathlon       (scenes deleted)"
    },
    {
      "id": "nm0710856",
      "name": "Joseph Rapp",
      "character": "Journaliste       (scenes deleted)"
    }
  ],
  "overview": null,
  "storyline": "Sébastien Nicolas, realtor, leads a dull existence and gets used to disguising himself to take on the appearance of the characters he meets.",
  "plot": "Cha Tae-sik leads a quiet life running a pawnshop. His only friend is a little girl, So-mi, who lives next door. So-mi's mother, Hyo-jeong, is a heroin addict who steals drugs from a feared organized crime group. She pawns her camera bag to Tae-sik; he does not realize it has the stolen drugs inside. Crime lord Oh Myung-gyu sends his subordinates, brothers Man-Seok and Jong-seok to retrieve the drugs; Jong-seok and his henchman Lum Ramrowan torture Hyo-jeong to find the drugs' location, then kidnap her and So-mi. Two gangsters, Du-chi and \"Bear\" go to Tae-sik pawn shop, but Tae-sik easily overpowers them. When he finds that Hyo-jeong and So-mi have been kidnapped, he gives them the bag, and Ramrowan kills Bear to set him up as the fall guy.\n\nRealizing that Tae-sik may serve better as a mule, the gang brothers force Tae-sik to perform a delivery to Oh Myung-gyu, who they have set up. Police arrest Tae-sik and discover Hyo-jeong's body, with her organs harvested, in the back of the car he used to make the delivery. Tae-sik escapes from the police station to search for So-mi, and during his escape, the police are bewildered at Tae-sik's display of power, combat techniques, and agility. On further investigation, they discover that Tae-sik was a former covert operator for the South Korean Army Intelligence, with numerous commendations, but he retired after he was wounded and his pregnant wife was murdered by an assassin.\n\nTae-sik tracks Du-chi to a nightclub, beats up two of Du-chi's guards, and stabs Du-chi with his own knife. As he asks where the brothers are. Ramrowan walks in and shoots at Tae-sik, killing Du-chi in the crossfire. The two fight to a standstill, and Tae-sik suffers a bullet wound. Tae-sik chases after Ramrowan and the brothers as they flee, but he is too late; Tae-sik barely escapes from undercover cops. Critically wounded after his encounter with Ramrowan, Tae-sik finds his former partner, who performs an impromptu surgery. Tae-sik then acquires a gun from him and continues on his journey.\n\nTae-sik finds and frees several child slaves in a drug manufacturing plant, in the process killing off the younger of the brothers, Jong-seok. He tracks down the elder brother, Man-seok, at the gang's condo, where a dozen gang members and Ramrowan are also waiting. Man-seok says that he has had So-Mi killed and shows Tae-sik a container that has what he says are her eyes. He demands to know what happened to his younger brother, and, in a rage, Tae-sik kills the gang members, including Ramrowan and Man-seok.\n\nAs Tae-sik prepares to commit suicide out of grief, a scared and dirty So-mi emerges from the darkness. She had been saved by Ramrowan, who took pity on her because she had been kind to him. It is then revealed that the eyes in the container belonged to the gangsters' surgeon, who had been killed off-camera by Ramrowan. The police allow Tae-sik and So-mi to ride together after they arrest him, and, while she sleeps, Tae-sik asks if they can be dropped off at a small convenience store. Tae-sik buys a backpack along with other school supplies. He tells her that she's going to be on her own now, as the police have to take him away. Before he goes, he asks her for a hug and breaks down in tears as they embrace.",
  "synopsis": null
}