{
  "imdb_id": "tt3172532",
  "tmdb_id": "250124",
  "douban_id": null,
  "title": "The Diary of a Teenage Girl (2015)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "102 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.9,
  "director": [
    {
      "id": "nm1716636",
      "name": "Marielle Heller"
    }
  ],
  "writer": [
    {
      "id": "nm6390963",
      "name": "Phoebe Gloeckner",
      "description": "novel"
    },
    {
      "id": "nm1716636",
      "name": "Marielle Heller",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm2525790",
      "name": "Bel Powley",
      "character": "Minnie"
    },
    {
      "id": "nm7820904",
      "name": "Willie",
      "character": "Domino the Cat"
    },
    {
      "id": "nm1325419",
      "name": "Kristen Wiig",
      "character": "Charlotte"
    },
    {
      "id": "nm5278409",
      "name": "Abby Wait",
      "character": "Gretel       (as Abigail Wait)"
    },
    {
      "id": "nm0002907",
      "name": "Alexander Skarsgård",
      "character": "Monroe"
    },
    {
      "id": "nm0047419",
      "name": "Miranda Bailey",
      "character": "Andrea"
    },
    {
      "id": "nm2492376",
      "name": "Carson Mell",
      "character": "Michael Cocaine"
    },
    {
      "id": "nm1215491",
      "name": "John Parsons",
      "character": "Burt"
    },
    {
      "id": "nm6265987",
      "name": "Madeleine Waters",
      "character": "Kimmie"
    },
    {
      "id": "nm5266877",
      "name": "Austin Lyon",
      "character": "Ricky Wasserman"
    },
    {
      "id": "nm6203830",
      "name": "Quinn Nagle",
      "character": "Chuck"
    },
    {
      "id": "nm5269552",
      "name": "Davy Clements",
      "character": "Arnie"
    },
    {
      "id": "nm2565613",
      "name": "Charles Lewis III",
      "character": "Cool English Teacher"
    },
    {
      "id": "nm0006718",
      "name": "David Fine",
      "character": "Old Hippie"
    },
    {
      "id": "nm7292867",
      "name": "Susannah Rogers",
      "character": "Aline Kominsky       (voice) (as Susannah Schulman)"
    },
    {
      "id": "nm0005221",
      "name": "Christopher Meloni",
      "character": "Pascal"
    },
    {
      "id": "nm6209117",
      "name": "Bob Scott",
      "character": "Man on Docks"
    },
    {
      "id": "nm3994251",
      "name": "Anthony Williams",
      "character": "Frankie"
    },
    {
      "id": "nm1514370",
      "name": "Joshua Grannell",
      "character": "Drag Queen"
    },
    {
      "id": "nm1760272",
      "name": "Margarita Levieva",
      "character": "Tabatha"
    },
    {
      "id": "nm7102529",
      "name": "Nate Heller",
      "character": "Band Member"
    },
    {
      "id": "nm7498924",
      "name": "Lance Hill",
      "character": "Band Member"
    },
    {
      "id": "nm7498925",
      "name": "Jon Freeman",
      "character": "Band Member"
    },
    {
      "id": "nm7095421",
      "name": "Persephone Gloeckner-Suits",
      "character": "Student"
    }
  ],
  "overview": "Minnie Goetze is a 15-year-old aspiring comic-book artist, coming of age in the haze of the 1970s in San Francisco. Insatiably curious about the world around her, Minnie is a pretty typical teenage girl. Oh, except that she’s sleeping with her mother’s boyfriend.",
  "storyline": "A teen artist living in 1970s San Francisco enters into an affair with her mother's boyfriend.",
  "plot": "In 1976 San Francisco, aspiring 15-year-old cartoonist Minnie begins keeping an audio diary. She is stirred by her awakening sexuality and wants to lose her virginity. She fears she may be unattractive, but receives attention from boys at school.\n\nWhen Minnie's bohemian mother Charlotte is too busy to go out with her boyfriend Monroe, she suggests he take Minnie out instead. At a bar, Minnie and Monroe flirt and she tells him she wants to sleep with him. They begin meeting at his apartment and having sex. She shares the details of her sexual experiences with her friend Kimmie, as well as recording them on her tape recorder. At a comic book store, Minnie sees cartoonist Aline Kominsky signing books. She mails Aline her first comic, about a woman walking through town.\n\nMinnie sleeps twice with her schoolmate Ricky, but he finds her sexual enthusiasm intimidating. At a bar, Minnie and Kimmie decide to pose as prostitutes. They fellate two boys in the bathroom, but the next day they agree it was a bad choice. Minnie's stepfather, Pascal, calls from New York City and invites Minnie to live with him, but she declines.\n\nCharlotte loses her job as a librarian. Minnie and her younger sister Gretel ask Pascal for money, and though he is irritated, he sends the family a check. Minnie, Kimmie, and Monroe have a threesome. Minnie and Monroe take acid together and Monroe has a bad trip, convinced they are being watched. During the trip he tells Minnie he loves her and she realizes that she no longer cares for him. Monroe begins making plans for them to be together when she is 18 and Minnie leaves him.\n\nCharlotte grows suspicious of the relationship between Minnie and Monroe, but he persuades her she is imagining things. Charlotte discovers Minnie's audio diary, and confronts Minnie and Monroe. She decides that Minnie and Monroe must now marry, which Monroe agrees to. Minnie runs away from home in disgust and begins seeing a risk-taking lesbian, Tabatha. When Tabatha brings her to a drug dealer, having told him that Minnie will have sex with him for the drugs, Minnie returns to her family.\n\nMinnie finds a letter from Aline encouraging her to draw more comics. Selling her comics and zines on the beach, Minnie runs into Monroe. She is cold towards him, and they go their separate ways. Minnie reflects on her emotional growth and realizes that the only way to find happiness is by loving herself, not by depending on another person's affection.",
  "synopsis": "In 1976 San Francisco, aspiring 15-year-old cartoonist Minnie begins keeping an audio diary. She is stirred by her awakening sexuality and wants to lose her virginity. She considers herself overweight and unattractive, but receives attention from boys at school.When Minnie's bohemian mother Charlotte is too busy to go out with her boyfriend Monroe, she suggests he take Minnie out instead. At a bar, Minnie and Monroe flirt and she tells him she wants to sleep with him. They begin meeting at his apartment and having sex. She shares the details of her sexual experiences with her friend Kimmie.At a comic book store, Minnie sees cartoonist Aline Kominsky signing books. She mails Aline her first comic, about a woman walking through town.Minnie sleeps twice with her schoolmate Ricky, but he finds her sexual appetite intimidating. At a bar, Minnie and Kimmie pose as prostitutes and fellate two boys in the bathroom. The next day, they agree not to repeat the experience. Minnie's stepfather, Pascal, calls from New York City and invites her to live with him, but she declines.Charlotte loses her job as a librarian. Minnie and her younger sister Gretel ask Pascal for money, and though he is irritated, he sends the family a check. Minnie, Kimmie, and Monroe have a threesome. Minnie and Monroe take acid together and Monroe has a bad trip, convinced they are being watched.Charlotte grows suspicious of Minnie and Monroe's relationship, but he persuades her that she is imagining things. Charlotte discovers Minnie's audio diary and Minnie runs away from home. She begins seeing a girl named Tabatha, but when she brings her to a man Minnie does not trust, she returns to her family. She finds a letter from Aline encouraging her to draw more comics. Selling her comics and zines on the beach, Minnie runs into Monroe and they part ways."
}