{
  "imdb_id": "tt3195054",
  "tmdb_id": "265715",
  "douban_id": null,
  "title": "Field of Dogs (2014)",
  "genres": [
    "Drama",
    "History",
    "Horror"
  ],
  "country": "Poland",
  "version": [
    {
      "runtime": "101 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm0538107",
      "name": "Lech Majewski"
    }
  ],
  "writer": [
    {
      "id": "nm5679541",
      "name": "Lukas Kersys",
      "description": "writer"
    },
    {
      "id": "nm0538107",
      "name": "Lech Majewski",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm7416323",
      "name": "Michael Tatarek",
      "character": "Adam /              Hero"
    },
    {
      "id": "nm0645822",
      "name": "Elzbieta Okupska",
      "character": "Aunt Xenia"
    },
    {
      "id": "nm1702579",
      "name": "Jacenty Jedrusik",
      "character": "Confessor"
    },
    {
      "id": "nm5019350",
      "name": "Jan Wartak",
      "character": "Father"
    },
    {
      "id": "nm3661956",
      "name": "Szymon Budzyk",
      "character": "Kamil"
    },
    {
      "id": "nm6887381",
      "name": "Anna Mielczarek",
      "character": "Basia"
    },
    {
      "id": "nm6309137",
      "name": "Karolina Korta",
      "character": "Girl in Bikini"
    },
    {
      "id": "nm1704127",
      "name": "Dorota Lis",
      "character": ""
    },
    {
      "id": "nm5667371",
      "name": "Massimiliano Cutrera",
      "character": ""
    }
  ],
  "overview": "A visionary romance based on a contemporary reading of Dante.",
  "storyline": "Father ploughs a supermarket with oxen, the plough ripping the tiles. A forest full of dead and Niagara falling onto a cathedral altar. These are the visions of Adam, a poet who ha lost his beloved in a car crash. A national tragedy imposes on a personal one. It is 2010, a Biblical year for Poland with floods, fires, landslides and the catastrophe of the presidential plane being torn apart i mysterious circumstances along with the nations elite. Adam gives up his job as professor of literature to work at a supermarket checkout. Yet all he wants is to sleep, escaping from the painful reality.",
  "plot": "This section needs expansion. You can help by adding to it. (October 2016)\nUbisoft Montreal began development on Watch Dogs in 2009. Ubisoft Montreal's creative director Jonathan Morin noted that Watch Dogs is designed to \"go beyond the limits of today's open world games\", referencing both its use of information as a plot point, and allowing players to control the entire city through its hacking mechanics. In order to achieve realism in the game's hacking mechanic, the game production team worked with Russian anti-virus firm Kaspersky Lab. The developers sent some of the game designs to Kaspersky, who then gave feedback. \"Sometimes they say, 'Yeah, that's possible, but change that word,' or, 'That's not the way it works'\", said senior producer Dominic Guay. When developing the hacking mechanic, the team focused on reducing it to one button; \"You want to have one button, so that people don't have to swallow 'how' on top of 'when' and 'why' to use those things\", said Morin. The team travelled to Chicago during development to record non-player character (NPC) dialogue, to achieve the distinct accent. To record the dialogue, two studios ran simultaneously in Chicago for about six weeks. \"You will never see exactly the same profile on any NPC anywhere in the game\", said lead story designer Kevin Shortt.\n\nWhen developing the game, Ubisoft prioritised development for the eighth generation consoles and PC. For Watch Dogs, Ubisoft Montreal built a new game engine called Disrupt. The engine was originally intended for a different game focused on driving. Ubisoft North American president Laurent Detoc explained that the team working on the project realized an open-world game was a better fit than their original vision. Watch Dogs runs in 900p on PlayStation 4 and 792p on Xbox One; both versions of the game run at 30fps. Creative director Jonathan Morin explained that he's more concerned with the overall experience rather than the technical minutiae. Morin added that people tend to forget that achieving higher fidelity visuals is easier for corridor shooters than it is for open-world games.\n\nWatch Dogs was developed under the code name \"Nexus\" as of 2009. Inspiration for the development of the game was, among other things, the real hacker organization Anonymous and numerous hacker conventions. The game was first presented at the Electronic Entertainment Expo 2012 but was postponed in 2013 scheduled release. As with Assassin's Creed, Ubisoft worked on downloadable content before publication.",
  "synopsis": null
}