{
  "imdb_id": "tt3144600",
  "tmdb_id": "277231",
  "douban_id": null,
  "title": "Take",
  "genres": [
    "Comedy"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.6,
  "director": [
    {
      "id": "nm2147000",
      "name": "Amelle Chahbi"
    }
  ],
  "writer": [
    {
      "id": "nm0972375",
      "name": "Matt Alexander",
      "description": "scenario, adaptation and dialogue"
    },
    {
      "id": "nm2147000",
      "name": "Amelle Chahbi",
      "description": "screenplay adaptation dialogue"
    },
    {
      "id": "nm1597648",
      "name": "Alexandre Coquelle",
      "description": "screenplay as Matt Alexander adaptation dialogue"
    },
    {
      "id": "nm2916628",
      "name": "Noom Diawara",
      "description": "screenplay adaptation dialogue"
    },
    {
      "id": "nm1597688",
      "name": "Matthieu Le Naour",
      "description": "screenplay as Matt Alexander adaptation dialogue"
    }
  ],
  "cast": [
    {
      "id": "nm2147000",
      "name": "Amelle Chahbi",
      "character": "Amelle"
    },
    {
      "id": "nm2916628",
      "name": "Noom Diawara",
      "character": "Noom"
    },
    {
      "id": "nm5117871",
      "name": "Pablo Pauly",
      "character": "Julien"
    },
    {
      "id": "nm2621400",
      "name": "Aude Pépin",
      "character": "Barbara"
    },
    {
      "id": "nm0145705",
      "name": "Sébastien Castro",
      "character": "Jeff"
    },
    {
      "id": "nm1354491",
      "name": "Nader Boussandel",
      "character": "Samir le tombeur"
    },
    {
      "id": "nm1738443",
      "name": "Marie-Julie Baup",
      "character": "Blair Witch"
    },
    {
      "id": "nm2926160",
      "name": "François Godart",
      "character": "Le directeur du Starbucks"
    },
    {
      "id": "nm4853759",
      "name": "Kimberly Zakine",
      "character": "Vanessa"
    },
    {
      "id": "nm1851991",
      "name": "Stella Rocha",
      "character": "Tatiana la Brésilienne"
    },
    {
      "id": "nm0830599",
      "name": "Mostéfa Stiti",
      "character": "Le père d'Amelle       (as Stiti)"
    },
    {
      "id": "nm3445565",
      "name": "Akéla Sari",
      "character": "La mère d'Amelle"
    },
    {
      "id": "nm0587010",
      "name": "Laurentine Milebo",
      "character": "La mère de Noom 1"
    },
    {
      "id": "nm0628866",
      "name": "Marie-Philomène Nga",
      "character": "La mère de Noom 2"
    },
    {
      "id": "nm2682412",
      "name": "N'Gwamoué Diabaté",
      "character": "Le père de Noom       (as N'Gouamoué Diabaté)"
    },
    {
      "id": "nm2561940",
      "name": "Fabrice Eboué",
      "character": "Bernard le prof de danse"
    },
    {
      "id": "nm2881758",
      "name": "Victoria Monfort",
      "character": "Martha"
    },
    {
      "id": "nm2925934",
      "name": "Bartholomew Boutellis",
      "character": "Le beau mec"
    },
    {
      "id": "nm0084670",
      "name": "Biyouna",
      "character": "La grand-mère d'Amelle"
    },
    {
      "id": "nm0223540",
      "name": "Bass Dhem",
      "character": "Le grand-père de Noom"
    },
    {
      "id": "nm6283377",
      "name": "Joakhim Sigue",
      "character": "Noom 5 ans"
    },
    {
      "id": "nm6584222",
      "name": "Romain Limpens",
      "character": "Le jeune du cinéma 1"
    },
    {
      "id": "nm4669329",
      "name": "Vladimir Zongo",
      "character": "Le jeune du cinéma 2"
    },
    {
      "id": "nm1493564",
      "name": "Prudence Maïdou",
      "character": "La jolie fille du Starbucks"
    },
    {
      "id": "nm6356382",
      "name": "Sofiane Lakrouf",
      "character": "Le pompier du cinéma"
    },
    {
      "id": "nm1577101",
      "name": "Nicolas Wanczycki",
      "character": "Le vendeur Mercedes"
    },
    {
      "id": "nm7435827",
      "name": "Adrien Bourdet",
      "character": "Le serveur"
    },
    {
      "id": "nm1832398",
      "name": "Wahid Bouzidi",
      "character": "Le chauffeur de taxi arabe"
    },
    {
      "id": "nm0846484",
      "name": "Claudia Tagbo",
      "character": "Taxi woman"
    },
    {
      "id": "nm0499099",
      "name": "Catherine Lefroid",
      "character": "L'infirmière de l'hôpital"
    },
    {
      "id": "nm3452927",
      "name": "David Bosteli",
      "character": "Le présentateur du spectacle"
    },
    {
      "id": "nm7435828",
      "name": "Amelia Morelli",
      "character": "Hayfa"
    },
    {
      "id": "nm7435829",
      "name": "Mathis Bourcier Abi Saad",
      "character": "Pablo"
    },
    {
      "id": "nm2920051",
      "name": "Nathan Rippy",
      "character": "Le présentateur américain"
    },
    {
      "id": "nm4263177",
      "name": "Linda Massoz",
      "character": "La névrosée interview 1"
    },
    {
      "id": "nm1764365",
      "name": "Zazon",
      "character": "La maîtresse interview 2       (as Zazon Castro)"
    },
    {
      "id": "nm5066032",
      "name": "Alexia Degrémont",
      "character": "L'amante interview 3"
    },
    {
      "id": "nm1641171",
      "name": "Claudine Acs",
      "character": "La mamie interview 4"
    },
    {
      "id": "nm7560535",
      "name": "Saïd Benchnafa",
      "character": ""
    },
    {
      "id": "nm2306211",
      "name": "Fabien Gravillon",
      "character": "Audience member"
    },
    {
      "id": "nm7421977",
      "name": "Victoria Montfort",
      "character": "Martha"
    }
  ],
  "overview": "Amelle and Noom are two young thirties are total opposites and that fate will bring. Serious She manager at Starbucks, and dynamic IT dilettante, smart, and apprentice comic.  Both victims disappointments in love, they swore that it does take longer.  So how do when despite all these opposites attract? A game of seduction then sets up for our greatest happiness. But all is not so rosy, families, friends, colleagues get involved, wars are declared, quarrels explode.  Caught between the roots of their education and the fire of their feelings, which side will they choose? The love he will triumph? One thing is sure, they will make us have a good loads of fun and excitement ...",
  "storyline": "Amelle and Noom are total opposites-each had bad break-ups so both are wary but fate has brought them together proving that opposites do attract.",
  "plot": "Don \"Wardaddy\" Collier, a battle-hardened U.S. Army staff sergeant in the 2nd Armored Division, commands an M4 Sherman \"Easy Eight\" tank named Fury and its five-man, all-veteran crew: gunner Boyd \"Bible\" Swan; loader Grady \"Coon-Ass\" Travis; and driver Trini \"Gordo\" Garcia (all of whom have been together since the North African Campaign), as the Allies make their final push into Nazi Germany. It becomes clear that the tank crew, especially Wardaddy, have an intense hatred towards Nazi Germany's infamous Waffen-SS. When the tank's original assistant driver/bow gunner, \"Red\", is killed in action, Private Norman Ellison (a fresh recruit trained only as a clerk typist) is assigned to be an immediate replacement.\n\nAs Fury and its tank platoon move deeper into Germany, Norman's inexperience becomes dangerous: first when he fails to shoot several Hitler Youth child soldiers — who ambush the commanding officer's tank with a Panzerfaust, killing him and his crew, and then later during a skirmish with German anti-tank guns, in which he hesitates under fire. Wardaddy is angered at his incompetence, and after the battle, he orders Norman to execute a captive German soldier. When Norman refuses, Wardaddy wrestles a pistol into his hand and forces him to pull the trigger, killing the prisoner and traumatizing Norman. Wardaddy then leads the tanks to capture a small German town, where Norman kills several German soldiers. While searching an apartment, Wardaddy and Norman encounter a German woman, Irma, and her younger cousin, Emma. Norman and Emma go into the bedroom together and have sex. The four then have breakfast, but the rest of Fury's crew barges in, harassing the women and angering Wardaddy and Norman. The men soon leave and a German artillery bombardment strikes the town. Norman finds Emma among the dead, which traumatizes him once more.\n\nWardaddy and his platoon are then ordered to hold a vital crossroads to prevent the enemy from attacking the Allies' vulnerable rear lines. They head to their objective, only to be ambushed by a German Tiger I. Wardaddy leads the Shermans in a counter-attack; their shells fail to penetrate the Tiger's thick frontal armor, and its heavier gun knocks out three tanks from the platoon. Fury eventually destroys the Tiger by outmaneuvering it and firing into its thinner rear armor, but with the radio damaged, Fury is forced to continue the mission alone. Just as it reaches the crossroads, the tank is immobilized by a landmine. Norman is ordered to scout a nearby hill where he spots a battalion of three hundred Waffen-SS panzergrenadiers heading their way. The crew initially wants to flee, but Wardaddy refuses to leave and they decide to stay.\n\nThe crew disguises Fury so that it would appear knocked-out, and then waits for the approaching Germans inside. They share a bottle of whiskey, and Norman is finally accepted by the crew and given his nickname: \"Machine\". When the Germans arrive, the crew ambush them using both the tank's and their own personal weapons. As ammunition runs out and the battle turns desperate, Grady is killed by a Panzerfaust round penetrating the turret; Gordo is wounded and then sacrifices himself by covering one of his dropped grenades; then a sniper kills Bible and severely wounds Wardaddy. Wardaddy then orders Norman to escape through an emergency hatch in the floor as the Germans drop grenades into the tank. Norman slips out just as they explode, killing Wardaddy. Norman tries to hide as the Germans move on, but is quickly discovered by a young SS soldier. The soldier hesitates and then leaves, deciding not to report him.\n\nThe next morning, Norman awakens and crawls back into the tank, where he covers Wardaddy's corpse with his coat and takes his revolver as he hears movement outside. Norman awaits his fate, only to discover he is being rescued by US soldiers, who tell him that he is a hero. As Norman is transported away to safety, he looks back at the carnage behind him: the countless dead German troops lying around the battered Fury.",
  "synopsis": null
}