{
  "imdb_id": "tt3164198",
  "tmdb_id": "261857",
  "douban_id": null,
  "title": "Ballet 422 (2014)",
  "genres": [
    "Documentary",
    "Music",
    "Sport"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "75 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm1464511",
      "name": "Jody Lee Lipes"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm0669732",
      "name": "Tiler Peck",
      "character": "Herself"
    },
    {
      "id": "nm5943811",
      "name": "Sterling Hyltin",
      "character": "Herself"
    },
    {
      "id": "nm5968383",
      "name": "Justin Peck",
      "character": "Himself, Choreographer"
    },
    {
      "id": "nm2860043",
      "name": "Amar Ramasar",
      "character": ""
    }
  ],
  "overview": "The film shadows Justin Peck, wunderkind choreographer of the New York City Ballet, as he undertakes the Herculean task of creating the company’s 422nd original piece. Following the creative process from its embryonic stages to its highly anticipated premiere, Ballet 422 is a powerful celebration of the skill and endurance of New York’s most talented dancers—as well as those who remain hidden in the wings.",
  "storyline": "Ballet 422 is a record of the creative process of a young choreographer Justin Peck, just 26 years old, hired to create a new ballet for the winter season of the New York City Ballet in 2013. The New York City Ballet is considered one of the best companies in the world. Since 1990 he is led by Peter Martins, his Ballet Master in Chief. The documentary describes the intense backstage work that takes place during the process of creating and learning this new ballet: \"Paz de la Jolla\". It shows Peck working with his fellow dancers (Justin Peck is also a soloist at NYCB!), with musicians, lighting technicians, and costume designers in the composition of a new work, his third creation for the NYCB. It is the first time the New York City Ballet is exposed during the creation of a new a ballet.",
  "plot": null,
  "synopsis": null
}