{
  "imdb_id": "tt3144678",
  "tmdb_id": "254664",
  "douban_id": null,
  "title": "The Journey (2014)",
  "genres": [
    "Comedy",
    "Drama",
    "Family"
  ],
  "country": "Malaysia",
  "version": [
    {
      "runtime": "103 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm4691188",
      "name": "Keng Guan Chiu"
    }
  ],
  "writer": [
    {
      "id": "nm4691290",
      "name": "Ryon Lee",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm5902098",
      "name": "Sai Peng Lee",
      "character": "Uncle Chuan"
    },
    {
      "id": "nm5902097",
      "name": "Ben Pfeiffer",
      "character": "Benji"
    },
    {
      "id": "nm5902095",
      "name": "Joanne Yew",
      "character": "Bee"
    }
  ],
  "overview": "The Journey is a cross-continental story that explores the idea of culture, not just as tradition but as an expression of love. When Bee (Yew) returns to Malaysia for the first time in a decade - she introduces her conservative father Uncle Chuan (Lee) to her happy-go-lucky British fiancé, Benji (Pfeiffer). With Benji's lack of cultural understanding and comprehension of Chinese traditions, Chuan opposes their marriage. Unexpected circumstances ensue, and Chuan reluctantly submits to their union, on the condition that their wedding adheres to Chinese tradition. Part of that tradition is that Chuan must invite all of his childhood friends personally. So the quintessential odd couple, Benji and Chuan, embark on a cross country adventure to deliver the invitations. Despite language barriers and initial hesitation from both parties, the two men come to realize that their priorities are essentially one and the same.",
  "storyline": "The Journey is a cross-continental story that explores the idea of culture, not just as tradition but as an expression of love. When Bee (Yew) returns to Malaysia for the first time in a decade - she introduces her conservative father Uncle Chuan (Lee) to her happy-go-lucky British fiancé, Benji (Pfeiffer). With Benji's lack of cultural understanding and comprehension of Chinese traditions, Chuan opposes their marriage. Unexpected circumstances ensue, and Chuan reluctantly submits to their union, on the condition that their wedding adheres to Chinese tradition. Part of that tradition is that Chuan must invite all of his childhood friends personally. So the quintessential odd couple, Benji and Chuan, embark on a cross country adventure to deliver the invitations. Despite language barriers and initial hesitation from both parties, the two men come to realize that their priorities are essentially one and the same.",
  "plot": "The Journey tells the story of Uncle Chuan (Frankie Lee), a conservative father with a rigid set of rules. When his daughter, Bee (Joanne Yew) returns home after spending most of her formative years in England with a fiance, Benji (Ben Pfeiffer) in-tow, Uncle Chuan refuses to give his blessing. With cultural differences and a language barrier that could potentially damage the union between Benji and his loved one, he feels that something must be done quick. Uncle Chuan reluctantly allows them to marry but on one condition — the wedding ceremony has to be in the traditional way. Despite their lack of understanding towards one another, Benji and Uncle Chuan embark on a nationwide journey to hand-deliver wedding invitations to the latter’s childhood friends. Throughout the journey, the two learn valuable lessons about accepting each other’s differences.",
  "synopsis": null
}