{
  "imdb_id": "tt3137630",
  "tmdb_id": "339792",
  "douban_id": null,
  "title": "David Brent: Life on the Road (2016)",
  "genres": [
    "Comedy",
    "Music"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "96 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm0315041",
      "name": "Ricky Gervais"
    }
  ],
  "writer": [
    {
      "id": "nm0315041",
      "name": "Ricky Gervais",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0315041",
      "name": "Ricky Gervais",
      "character": "David Brent"
    },
    {
      "id": "nm0419112",
      "name": "Rob Jarvis",
      "character": "Client"
    },
    {
      "id": "nm7150152",
      "name": "Abbie Murphy",
      "character": "Serena Wilson"
    },
    {
      "id": "nm3778244",
      "name": "Mandeep Dhillon",
      "character": "Karen Parashar"
    },
    {
      "id": "nm0366846",
      "name": "Jo Hartley",
      "character": "Pauline Gray"
    },
    {
      "id": "nm0111685",
      "name": "Andrew Brooke",
      "character": "Jerry 'Jezza' Collins"
    },
    {
      "id": "nm6835247",
      "name": "Miles Chapman",
      "character": "Andy Chapman"
    },
    {
      "id": "nm1502204",
      "name": "Tom Bennett",
      "character": "Nigel Martin"
    },
    {
      "id": "nm1775084",
      "name": "Rebecca Gethings",
      "character": "Miriam Clark"
    },
    {
      "id": "nm0072552",
      "name": "Kim Benson",
      "character": "Office Worker"
    },
    {
      "id": "nm3795611",
      "name": "Alfie Stewart",
      "character": "Office Worker"
    },
    {
      "id": "nm2509609",
      "name": "Doc Brown",
      "character": "Dom Johnson"
    },
    {
      "id": "nm2235764",
      "name": "Tom Basden",
      "character": "Dan Harvey"
    },
    {
      "id": "nm2342072",
      "name": "Andy Burrows",
      "character": "Foregone Conclusion: Drums"
    },
    {
      "id": "nm8382286",
      "name": "Stuart Wilkinson",
      "character": "Foregone Conclusion: Guitar"
    },
    {
      "id": "nm8382287",
      "name": "Steve Clarke",
      "character": "Foregone Conclusion: Bass"
    },
    {
      "id": "nm8382288",
      "name": "Michael Clarke",
      "character": "Foregone Conclusion: Keyboard & Guitar"
    },
    {
      "id": "nm0815317",
      "name": "Nina Sosanya",
      "character": "Dr. Vivienne Keating"
    },
    {
      "id": "nm2296327",
      "name": "Stacha Hicks",
      "character": "Sandra"
    },
    {
      "id": "nm8382289",
      "name": "Martin Collins",
      "character": "Stagehand"
    },
    {
      "id": "nm3864730",
      "name": "Nathan Dean Williams",
      "character": "Engineer"
    },
    {
      "id": "nm0084107",
      "name": "Kevin Bishop",
      "character": "DJ"
    },
    {
      "id": "nm1854269",
      "name": "Diane Morgan",
      "character": "Briony Jones"
    },
    {
      "id": "nm0443825",
      "name": "Dermot Keaney",
      "character": "Tattooist"
    },
    {
      "id": "nm0910484",
      "name": "Carol Walton",
      "character": "Waitress"
    },
    {
      "id": "nm1371443",
      "name": "Ashley McGuire",
      "character": "Mo"
    },
    {
      "id": "nm4421176",
      "name": "Roisin Conaty",
      "character": "Cat"
    },
    {
      "id": "nm1924735",
      "name": "Alexander Arnold",
      "character": "Pog"
    },
    {
      "id": "nm1616822",
      "name": "Jamie Kenna",
      "character": "Promoter"
    },
    {
      "id": "nm0028171",
      "name": "Peter Andre",
      "character": "Himself"
    }
  ],
  "overview": "A camera crew catches up with David Brent, the former star of the fictional British series, \"The Office\" as he now fancies himself a rockstar on the road.",
  "storyline": "About 13 years on from his appearance in the documentary series The Office, a documentary film crew is once again following the life of David Brent. He is now working as a rep for cleaning goods distributor but still harbours dreams of making it big in the music business. Acting on this, he takes three weeks off work and tours with a new-look version of Foregone Conclusion, the band he was in in the 90s (he's the only remaining original member, for various reasons...).",
  "plot": "Fifteen years after his appearance in the BBC2 \"documentary\" series The Office, David Brent is a sales rep for bathroom supply firm Lavichem. His colleagues include his nemesis, Jezza, who cannot stand Brent or his jokes; however, he gets a more sympathetic response from colleague Pauline and receptionist Karen, and shares the same sense of humour as fellow sales rep Nigel.\n\nDesperate to resume his music career and sign a record deal, Brent takes a month of unpaid leave and uses money from his pension to pay his fellow band members (Foregone Conclusion), his rapper friend Dom, Dan the sound engineer (whom he boldly offers double what he earns at the studio), a PR consultant, and many other costs, to arrange a tour of venues around Berkshire.\n\nAs the tour wears on, the band and crew refuse to socialise with Brent (unless he pays them to do so), and even make him drive behind the tour bus claiming there is no room for him. When Brent finally manages to convince a record company rep to attend a show, they are more interested in Dom's rapping than Brent's music. As the costs of the tour spiral out of control, sound engineer Dan confronts a dejected Brent, telling him to stop wasting his money. The band plays one final show, and then willingly join Brent for a drink.\n\nBrent returns to Lavichem to the delight of Pauline, Karen and Nigel. Pauline asks him to take her out for a coffee and she takes his hand as they head out.",
  "synopsis": "It isn't required to have seen the 2001 British TV comedy \"The Office\" before watching this film. Comedian/writer Ricky Gervais created and starred in the TV series and this film as David Brent. Brent is just as clueless in this film as he was in the earlier TV series. There Gervais played a clueless middle manager in a paper supply company in Slough, England, here he plays a clueless salesman at Lavichem, a cleaning supply company also in Slough. After working for two unexciting companies, Brent wants some excitement and what better way to get excitement is to become a rock musician. He cashes in his retirement, recruits a band, rents a tour bus and takes time off work to tour Slough with his new band. The film follows him on his 'Rock N Roll' tour where it becomes evident that he doesn't have the talent necessary to become a star - or even enough talent to keep from embarrassing his band. The members of his band continue to back him up because he's paying all the bills. Eventually he runs out of money and time so he returns to Lavichem with the idea to save enough money to make another try at his rock-star dream. In both the TV comedy and this film he is followed by a documentary film crew which allows the David Brent character to deliver comments along the way."
}