{
  "imdb_id": "tt3147290",
  "tmdb_id": "238469",
  "douban_id": null,
  "title": "Little Favour (2013)",
  "genres": [
    "Short",
    "Action",
    "Thriller"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "22 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm2192829",
      "name": "Patrick Viktor Monroe"
    }
  ],
  "writer": [
    {
      "id": "nm2192829",
      "name": "Patrick Viktor Monroe",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm1212722",
      "name": "Benedict Cumberbatch",
      "character": "Wallace"
    },
    {
      "id": "nm0758760",
      "name": "Colin Salmon",
      "character": "James"
    },
    {
      "id": "nm0602941",
      "name": "Nick Moran",
      "character": "Logan"
    },
    {
      "id": "nm8049046",
      "name": "Paris Winter Munroe",
      "character": "Lilah"
    },
    {
      "id": "nm5992785",
      "name": "Liam Collins",
      "character": "Polska       (as Liam Loughrey)"
    },
    {
      "id": "nm6033406",
      "name": "Nina Friis",
      "character": "Extra"
    },
    {
      "id": "nm5254152",
      "name": "Jack Goldenberg",
      "character": "Yoel"
    },
    {
      "id": "nm3479192",
      "name": "Bobby Holland Hanton",
      "character": "Brandon"
    },
    {
      "id": "nm0998782",
      "name": "Robert Shannon",
      "character": "Morgan"
    },
    {
      "id": "nm4355399",
      "name": "Julian Shaw",
      "character": "Jimmy"
    },
    {
      "id": "nm1162884",
      "name": "John Street",
      "character": "Pierre"
    },
    {
      "id": "nm2623046",
      "name": "Jennifer Van Gessel",
      "character": "Extra"
    }
  ],
  "overview": "A short film starring Benedict Cumberbatch, Colin Salmon and Nick Moran. LITTLE FAVOUR follows the story of WALLACE (Benedict Cumberbatch) when he is contacted by a former colleague to help him out with a deal gone wrong. 'Its been 7 years since he left Her Majesty's service and 10 years since the American Counter part who became his friend, saved his life on a joint mission in Iraq. He's migrated his skill set into a lucrative business while managing to keep his secret battle with PTSD under wraps. One day, while finally deciding to try his hand at a functional relationship, his old friend JAMES cashes in his chip and asks a LITTLE FAVOUR. How could he refuse when he owes the man his life?",
  "storyline": "LITTLE FAVOUR follows the story of WALLACE when he is contacted by a former colleague to help him out with a deal gone wrong. 'Its been 7 years since he left Her Majesty's service and 10 years since the American Counter part who became his friend, saved his life on a joint mission in Iraq. He's migrated his skill set into a lucrative business while managing to keep his secret battle with PTSD under wraps. One day, while finally deciding to try his hand at a functional relationship, his old friend JAMES cashes in his chip and asks a LITTLE FAVOUR. How could he refuse when he owes the man his life?",
  "plot": null,
  "synopsis": "The movie tells us about Wallace (Benedict Cumberbatch) who has worked for Her Majesty. During his long service in Iraq, a decade ago Wallaces life was saved by former colleague, James (Colin Salmon). Several years after the memories still haunt him. His secret fight against PTSD is lying on his entire appearance like a waft of mist.\nBoth men, one taller than the other, meet and James quickly calls in that favour. It could be anything until the men are joined by a third party named Lilah. What the favour is about remains unspoken but for some reason Lilah needs to be guarded. Although Wallace isn't convinced, there is no point to refuse to help when he owes James his very own life. From now on Lilah and Wallace form a unit. Soon after the meeting they are taken hostage by a group of attackers led by Yoel (Jack Goldenberg). Separated from each other, Wallace and Lilah are the most vulnerable. Beaten and bloodied Wallace is threatened with his own death to leak information. He refuses to cooperate and wants to know whether or not Lilah has been harmed. She and Wallace are the strongest when reunited but they have to face each other in the end. The final trigger is pulled and it turns out they aren't dealing with a little favour at all."
}