{
  "imdb_id": "tt3181822",
  "tmdb_id": "241251",
  "douban_id": "25780555",
  "title": "The Boy Next Door (2015)",
  "genres": [
    "Drama",
    "Horror",
    "Romance",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "91 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.6,
  "director": [
    {
      "id": "nm0003418",
      "name": "Rob Cohen"
    }
  ],
  "writer": [
    {
      "id": "nm3204152",
      "name": "Barbara Curry",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0000182",
      "name": "Jennifer Lopez",
      "character": "Claire Peterson"
    },
    {
      "id": "nm4554428",
      "name": "Ryan Guzman",
      "character": "Noah Sandborn"
    },
    {
      "id": "nm4122775",
      "name": "Ian Nelson",
      "character": "Kevin Peterson"
    },
    {
      "id": "nm0179173",
      "name": "John Corbett",
      "character": "Garrett Peterson"
    },
    {
      "id": "nm0155693",
      "name": "Kristin Chenoweth",
      "character": "Vicky Lansing"
    },
    {
      "id": "nm4885949",
      "name": "Lexi Atkins",
      "character": "Allie Callahan"
    },
    {
      "id": "nm0004991",
      "name": "Hill Harper",
      "character": "Principal Edward Warren"
    },
    {
      "id": "nm0908685",
      "name": "Jack Wallace",
      "character": "Mr. Sandborn"
    },
    {
      "id": "nm0382791",
      "name": "Adam Hicks",
      "character": "Jason Zimmer"
    },
    {
      "id": "nm0154236",
      "name": "François Chau",
      "character": "Detective Johnny Chou"
    },
    {
      "id": "nm0003082",
      "name": "Bailey Chase",
      "character": "Benny"
    },
    {
      "id": "nm1366393",
      "name": "Kent Avenido",
      "character": "Mr. Avenido"
    },
    {
      "id": "nm0005402",
      "name": "Travis Schuldt",
      "character": "Ethan"
    },
    {
      "id": "nm0537126",
      "name": "Brian Mahoney",
      "character": "Couper"
    },
    {
      "id": "nm0307074",
      "name": "Raquel Gardner",
      "character": "Barbara"
    },
    {
      "id": "nm5613682",
      "name": "Kari Perdue",
      "character": "Rachel"
    },
    {
      "id": "nm5253052",
      "name": "Chad Bullard",
      "character": "Chad the Bully"
    },
    {
      "id": "nm4328247",
      "name": "Forrest Kiyoshi Hoffman",
      "character": "Forrest the Bully       (as Forrest Hoffman)"
    },
    {
      "id": "nm3614628",
      "name": "Brandon Rush",
      "character": "Paramedic"
    },
    {
      "id": "nm0502706",
      "name": "Matt Leonard",
      "character": "Brawny Male Teacher"
    },
    {
      "id": "nm0341498",
      "name": "Tad Griffith",
      "character": "Truck Driver"
    }
  ],
  "overview": "A recently cheated on married woman falls for a younger man who has moved in next door, but their torrid affair soon takes a dangerous turn.",
  "storyline": "When a handsome, charming teenager named Noah (Ryan Guzman) moves in next door, newly separated high-school teacher Claire Peterson (Jennifer Lopez) encourages his friendship and engages in a little bit of harmless (or so she thinks) flirtation. Although Noah spends much of the time hanging out with Claire's son, the teen's attraction to her is palpable. One night, Claire gives in to temptation and lets Noah seduce her, but when she tries to end the relationship, he turns violent.",
  "plot": "Claire Peterson (Jennifer Lopez) separates from her husband Garrett (John Corbett), after he was caught cheating with his secretary. Her colleague and best friend Vicky Lansing (Kristin Chenoweth) urges Claire to divorce. Claire meets 19-year-old Noah Sandborn (Ryan Guzman)—the orphaned nephew of her wheelchair-bound neighbor—who has just moved in next door. Noah befriends Kevin (Ian Nelson), Claire's teenage son, and begins attending his school, where Claire teaches English literature. Noah is drawn to Claire, expressing love for Homer's Iliad. With Kevin and Garrett away on a fishing trip, Claire watches a naked Noah in his room through her window.\n\nClaire goes on a miserable double date with Vicky and her boyfriend Ethan (Travis Schuldt), and his ill-mannered friend Benny (Bailey Chase). With Kevin still away, Noah calls Claire over to help him cook. She ends up having dinner with him, during which he unashamedly flirts with her. Despite Claire's hesitation, she lets Noah seduce her and they have sex. Claire tells Noah that she regrets their night together, causing him to punch a wall in rage. The school year begins, with Noah joining an uncomfortable Claire's class after hacking into her computer, making it appear as if she had requested this. Noah manipulates Kevin into hating his father, causing him to lash out at Garrett. Later, Kevin overexerts himself at the gymnasium and goes into shock; Noah saves his life by injecting him with Kevin's EpiPen. Claire receives flowers from Noah, and she confronts him about this. Noah witnesses Claire and Garrett on a date together, which escalates his obsession with her.\n\nAfter an incident where Noah—in defense of Kevin—slams a bully's (Adam Hicks) head into a locker repeatedly, Vicky (who is vice principal at the school) discovers that Noah was kicked out of his previous school for disorderly conduct. After an encounter where Noah insults her, she expels him. During the fall fling, Claire goes to investigate a leak in the boys' bathroom, where she instead sees the words \"I fucked Claire Peterson\" written on the wall before Noah emerges. He attempts to force himself on her, but she fends him off and demands that he stay away from her and Kevin. The following day, Noah leaves a printer running in Claire's classroom, with images of them sleeping together scattered everywhere. When Garrett's car brakes fail to work, he and Kevin are nearly involved in an accident. Noah blackmails Claire; telling her that he has a tape of them having sex, which he will relinquish to her if she continues sleeping with him. She refuses, and organizes a plot with Vicky to steer Noah away from his house. Claire breaks into Noah's house and sees hundreds of images of herself in his basement. She finds his laptop, deleting their sex tape, and also sees images of car brakes, implying that he rigged Garrett's brakes. She meets with Detective Chou (François Chau), who informs her that Noah's father was killed after swerving into a truck with his minivan.\n\nNoah binds and gags Vicky with duct tape and uses an audio recording of her voice to lure Claire to her house. When Claire arrives, she discovers Vicky's dead body, with her throat having been slashed by Noah. A horrified Claire contacts the police, but runs into Noah again. He reveals to her that his mother killed herself after his father cheated on her, so he rigged the brakes of his father's minivan, killing him and his mistress. Noah takes Claire to a barn house where he has kidnapped Garrett and Kevin, threatening to kill them unless Claire stays with him. A violent altercation occurs as Claire attempts to free them. Noah pours kerosene around the barn, causing it to ignite in flames. Garrett, having freed himself, attempts to choke Noah with a rope, prompting Noah to shoot him in the chest. Claire stabs Noah's eye with Kevin's EpiPen. When Noah removes the EpiPen from his eye and blindly attempts to strangle Claire to death, she then jams her thumb into the same damaged eye to blind him further, much to Noah's agony and he strikes her across the face. When he later holds Kevin at gunpoint, she pulls a switch that drops an engine on Noah, killing him. Claire and Kevin then help a wounded Garrett exit the burning barn house as the police arrive. Garrett is put in an ambulance. A paramedic says that Garrett will be fine. Claire and Kevin ride in the ambulance with him and Claire tells Garrett that he's gonna be okay and promises him after he arrives at the hospital, \"we're going home.\", hinting at a family reconciliation between Claire, Garrett and Kevin. As all three family members remain together in the ambulance truck, the ambulance then drives off into road to the hospital and the camera pans out to the moon hovering in the night sky.",
  "synopsis": "Claire Peterson (Jennifer Lopez) is on the verge of divorcing her husband Garrett (John Corbett) after he was caught cheating with his secretary. She kicks him out and it causes a rift between both of them and their son Kevin (Ian Nelson). Claire's best friend Vicky Lansing (Kristin Chenoweth) stands by her and urges her to sign the divorce papers immediately and leave Garrett for good.For Kevin's birthday, Garrett shows up for dinner. He invites Claire and Kevin to a fishing trip following a business trip he's taking in San Francisco, which is where his affair took place. Claire declines the invitation but allows Kevin to join his father. She is still very much hurt by the deception.One day, Claire is getting ready to take Kevin out when their garage door gets stuck. Claire goes to push it open and is helped by a young man named Noah Sandborn (Ryan Guzman). He is the nephew of Claire's wheelchair-bound neighbor. Noah offers to help fix the garage door. He goes with Kevin to the hardware store. After they leave, Noah's uncle tells Claire that Noah's parents died the previous year and he is still coping with the loss.The boys walk to the hardware store, and Kevin learns that Noah is going to attend the same high school as him, where Claire happens to be a teacher. After they get their stuff, Kevin notices a girl from his school that works there named Allie Callahan (Lexi Atkins). He has a crush on her but is too nervous around her. Noah persuades him to go up and talk to her. As Kevin goes to pay, Noah introduces himself to Allie. Moments later, three punks on skateboards led by a guy named Jason Zimmer (Adam Hicks) come in and harass Kevin in front of Allie and Noah.Noah spends a lot of time with Kevin while his uncle is in the hospital, and Claire invites him to have lunch with them and Vicky. Claire mentions that she teaches classic literature at school, prompting Noah to quote Homer and express his love for \"The Iliad\". Claire is clearly impressed by this. Later, Noah notices a pair of stilettos that Claire keeps in a box, which she says were a gift from Vicky. Noah comments that the shoes are for women who try to be sexy, and that Claire doesn't need to try. He apologizes for sounding too forward.With Kevin and Garrett away on their trip, Claire is getting ready to go out. She looks out the window and sees Noah naked in his room. He spots her watching him, but she hides behind the curtains.Claire goes on a double date with Vicky and her boyfriend Ethan (Travis Schuldt) with his buddy Couper (Brian Mahoney) at a restaurant. Couper is a douchebag that insults Claire's fondness for classic literature and calls her a firecracker when she defends her opinion. She also notices him checking out a waitress. Claire leaves the restaurant and goes home.Noah calls Claire and tells her he tried defrosting a chicken in a microwave. He asks her to come over and help him cook it properly. She ends up going over and staying to eat the chicken with him after they cook it properly. Noah continues to flirt with Claire, and while she is interested, she feels it would be wrong. Noah starts to kiss her and feel her up, leaving her unable to resist. They end up having very passionate sex.The next morning, Claire starts to regret what happened the previous night. She tells Noah what they did was wrong. But tt makes him so angry that he punches a wall and bloodies his knuckles.Kevin and Garrett return from their trip. They have lunch with Claire, when Noah shows up moments later. Claire brings in a plate of cookies, and Noah asks her if she told the guys what happened while they were gone. She says there was a big rainstorm, to which Noah smugly remarks that it got very wet over there. Kevin offers him a cookie, and Noah responds, \"I love your mother's cookies.\"The school year begins, and as Claire begins her first class, the principal comes in and tells her that Noah is joining their class, since he made it appear as though Claire requested him to transfer into her class. She realizes that he hacked her computer.Kevin and Noah hang out, despite Claire starting to feel uncomfortable with Noah. Noah takes Kevin to the woods with a gun belonging to his uncle. He sets up a line of oranges and manipulates Kevin into hating his father for cheating on Claire. This is present at the dinner table when Garrett comes over and Kevin yells at him.Kevin joins Noah at the school gym and he takes out his frustration on a punching bag. Kevin overexerts himself and starts to go into shock. Noah rushes to the locker and grabs Kevin's epipen. He sticks it in Kevin's leg and saves him.Vicky brings Claire some flowers at work that they both believe came from Garrett. Claire calls him and he denies sending anything. She figures that Noah sent them and she confronts him in the gym. A teacher notices this and sees her shove Noah.Kevin goes back to the hardware store to ask Allie out to a movie. She says she can't, but she would like to go with him to the fall fling.Claire and Garrett go out on a date, and he starts to get handsy with her. She is still upset over the affair, but Garrett truly wants to start fresh. Noah notices all this and he angrily confronts Claire about it the next morning. Kevin catches them, and, since he's still upset with his parents, he rides to school with Noah.Jason and his buddies go over to Kevin and bug him. Kevin steps up to confront Jason when Noah comes in and kicks Jason into the locker before repeatedly slamming his head against it. Vicky runs in to break up the fight, only to get shoved by Noah. He is pulled off by a bigger teacher. Noah is sent to the principal's office where Vicky (who is the vice principal) says the school never got Noah's transcript from his previous school because he was kicked out for disorderly conduct. In response, Noah calls her a \"dried-up dirty fucking cunt.\" Vicky raises her hand to strike him, but he catches it. He leaves as she expels him.Claire chaperones the fall fling and leaves Kevin with Allie. Allie tells Claire about a leak in the boy's bathroom. She goes to turn the sink off and sees in big letters on the wall, \"I fucked Claire Peterson\". Noah emerges from the darkness and tries to force himself on Claire, only to get kicked in the balls. She tells him to stay away from her and Kevin.The next day, Claire's students are locked out of the class. She opens the door and looks inside to see something awful. She leaves her students outside and finds hundreds of pictures all over the classroom showing her and Noah having sex, with even more being printed out. Claire unplugs the printer and frantically tries to get rid of the pictures as the principal shows up. She opens the door for the students to come in. The principal expresses his concern over Claire's recent behavior, and he tells her of what he heard regarding her confrontation with Noah in the gym.Garrett picks Kevin up from school to drive his car home. Kevin drives it angrily, still resentful towards his dad. He goes way too fast and is unable to stop since the brakes are out. Kevin nearly hits two cars until Garrett helps him swerve into a row of water containers on the road.Claire returns home and sees the dent in Garrett's car. He and Kevin don't tell Claire what happened and assure her they're both fine. She finds them watching TV with Noah. He follows her into the kitchen where she tells him about the photos. He tells her he took a video of their night together, and if she wants it, she has to go to his house. Claire does go over later that night, but Noah promises to give the video only if she continues sleeping with him. She refuses and leaves.Claire tells Vicky everything and asks for her help. She tells Claire to get into Noah's house and find the tape herself.Noah follows what he thinks is Claire's car, only to see Vicky. He turns his car around, prompting Vicky to call Claire, just as she is breaking into Noah's house. She finds the camera hidden behind a clock above the fireplace. She walks into the basement and finds hundreds of pictures of herself all over the walls. Claire looks into Noah's laptop and finds the video and picture files. She trashes all of it, and then spots two other files with pictures of brakes, implying that Noah was the one that cut the brakes out of Garrett's car, as well as from a minivan. Claire goes back upstairs and is startled when Noah's uncle shows up. She runs back home.Claire meets with a detective and learns that Noah's parents were killed in a car accident after his dad swerved into a truck. She is taken to the remains of the car and figures it's the same minivan listed in Noah's laptop.At home, Claire calls Vicky and is startled when the door gets banged on. She thinks it's Noah, and Vicky tells Claire to go to her house with Kevin. The door opens and it's just Kevin. After the ladies hang out, Vicky gets knocked over the head by Noah.Noah calls Kevin and invites him to go over to Vicky's house. He has Vicky tied up and gagged while he calls Claire and uses a recording of Vicky's voice to have her come over.Claire arrives at Vicky's house. It's dark and the lights have been cut. Claire gets frightened by Vicky's cat and stumbles against the closet, which opens up and drops out Vicky's dead body. Noah slashed her throat. Claire screams and runs out of the house. She calls the police, right as Noah finds her and pulls her out of the car. She tells him she knows he killed his parents. Noah says that he loved his mother, but she killed herself after his father cheated on her, and he cut the brakes of the minivan to kill his father and the mistress.Noah takes Claire to a barn house where he has both Garrett and Kevin tied up. Noah threatens to kill them both unless Claire agrees to stay with him. She grabs a wrench and whacks him with it. She runs over to Kevin and tries to untie him until Noah gets up and pulls Claire away. He grabs some kerosene and throws it all around Garrett and Kevin. He takes out the lighter when Claire pushes him and makes him drop it, igniting the kerosene. The barn house starts to go up in flames. Garrett gets himself loose and wraps the rope on his wrists around Noah's throat. Noah gets his gun and shoots Garrett once in the chest. Claire takes Kevin's epipen and jabs Noah's eye. She tries to go back and untie Kevin, but Noah continues to fight her. She sticks her finger in his eye, making it ooze pus and blood. Kevin breaks the rope and whacks Noah with a block of wood, and Noah pushes him off. He aims his gun at Kevin and says that sometimes heroes need to make difficult choices. Claire calls Noah and says, \"You're no hero\" before pulling a switch that drops an engine on Noah to finally kill him. Claire and Kevin pull Garrett up and walk out of the burning barn house.The paramedics and police arrive on the scene. They wheel Garrett into the ambulance with Claire and Kevin riding by his side. She continues to assure Garrett everything will be okay and that they're finally going home."
}