{
  "imdb_id": "tt3168230",
  "tmdb_id": "280996",
  "douban_id": null,
  "title": "Mr. Holmes (2015)",
  "genres": [
    "Drama",
    "Mystery"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "104 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.9,
  "director": [
    {
      "id": "nm0174374",
      "name": "Bill Condon"
    }
  ],
  "writer": [
    {
      "id": "nm1616194",
      "name": "Mitch Cullin",
      "description": "novel"
    },
    {
      "id": "nm0368774",
      "name": "Jeffrey Hatcher",
      "description": "screenplay"
    },
    {
      "id": "nm0236279",
      "name": "Arthur Conan Doyle",
      "description": "characters"
    }
  ],
  "cast": [
    {
      "id": "nm0005212",
      "name": "Ian McKellen",
      "character": "Sherlock Holmes"
    },
    {
      "id": "nm0001473",
      "name": "Laura Linney",
      "character": "Mrs. Munro"
    },
    {
      "id": "nm6057785",
      "name": "Milo Parker",
      "character": "Roger"
    },
    {
      "id": "nm0760796",
      "name": "Hiroyuki Sanada",
      "character": "Tamiki Umezaki"
    },
    {
      "id": "nm0602455",
      "name": "Hattie Morahan",
      "character": "Ann Kelmot"
    },
    {
      "id": "nm1171145",
      "name": "Patrick Kennedy",
      "character": "Thomas Kelmot"
    },
    {
      "id": "nm0019885",
      "name": "Roger Allam",
      "character": "Dr. Barrie"
    },
    {
      "id": "nm0205289",
      "name": "Phil Davis",
      "character": "Inspector Gilbert"
    },
    {
      "id": "nm0209428",
      "name": "Frances de la Tour",
      "character": "Madame Schirmer       (as Frances De La Tour)"
    },
    {
      "id": "nm6674671",
      "name": "Charles Maddox",
      "character": "Oswald"
    },
    {
      "id": "nm1212366",
      "name": "Takako Akashi",
      "character": "Maya Umezaki"
    },
    {
      "id": "nm3978485",
      "name": "Zak Shukor",
      "character": "Masuo Umezaki"
    },
    {
      "id": "nm0785938",
      "name": "John Sessions",
      "character": "Mycroft Holmes"
    },
    {
      "id": "nm0191410",
      "name": "Michael Culkin",
      "character": "Bank Manager"
    },
    {
      "id": "nm0289368",
      "name": "David Foxxe",
      "character": "Chemist"
    },
    {
      "id": "nm5628404",
      "name": "Oliver Devoti",
      "character": "Ticket Agent"
    },
    {
      "id": "nm1130878",
      "name": "Mike Burnside",
      "character": "Ann's Solicitor"
    },
    {
      "id": "nm0746583",
      "name": "Nicholas Rowe",
      "character": "Matinee 'Sherlock Holmes'"
    },
    {
      "id": "nm3563211",
      "name": "Sam Coulson",
      "character": "Matinee 'Thomas Kelmot'"
    },
    {
      "id": "nm0053384",
      "name": "Frances Barber",
      "character": "Matinee 'Madame Schirmer'"
    },
    {
      "id": "nm5795508",
      "name": "Hermione Corfield",
      "character": "Matinee 'Ann Kelmot'"
    },
    {
      "id": "nm5598573",
      "name": "Kit Connor",
      "character": "Boy"
    },
    {
      "id": "nm4979953",
      "name": "Zoe Rainey",
      "character": "Boy's Mother"
    },
    {
      "id": "nm0203688",
      "name": "Eileen Davies",
      "character": "Lady on Platform"
    },
    {
      "id": "nm1541496",
      "name": "Colin Starkey",
      "character": "Dr. John Watson"
    },
    {
      "id": "nm0189562",
      "name": "Sarah Crowden",
      "character": "Mrs. Hudson"
    }
  ],
  "overview": "The story is set in 1947, following a long-retired Holmes living in a Sussex village with his housekeeper and rising detective son. But then he finds himself haunted by an unsolved 50-year old case. Holmes' memory isn't what it used to be, so he only remembers fragments of the case: a confrontation with an angry husband, a secret bond with his beautiful but unstable wife.",
  "storyline": "The story is set in 1947, following a long-retired Holmes living in a Sussex village with his housekeeper and her young son. But then he finds himself haunted by a thirty-year old case. Holmes memory isn't what it used to be, so he only remembers fragments of the case: a confrontation with an angry husband, and a secret bond with his beautiful, but unstable wife.",
  "plot": "In 1947, the long-retired Sherlock Holmes, aged 93, lives in a remote Sussex farmhouse with his housekeeper, Mrs Munro, and her young son Roger. Having just returned from a trip to Hiroshima, he starts to use jelly made from the prickly ash plant he acquired there to improve his failing memory. Unhappy about his ex-partner Watson's fictionalisation of Holmes's last case, The Adventure of the Dove Grey Glove, he hopes to write his own account but has trouble recalling the events. As Holmes spends time with Roger, showing him how to take care of the bees in the farmhouse's apiary, he comes to appreciate Roger's curiosity and intelligence and develops a paternal liking for him.\n\nOver time, Roger's prodding helps Holmes remember the case (shown in flashbacks) and why he retired from the detective business. About 30 years earlier, after the First World War had ended and Watson had left Baker Street, a man named Thomas Kelmot approached Holmes to find out why his wife Ann had changed so much after suffering two miscarriages. Holmes followed Ann around London and observed her taking certain actions - forging cheques in her husband's name and cashing them, reviewing the details of his will, buying poison, checking train schedules – which made it appear as if she were planning to murder Thomas and inherit his property. Holmes deduced her true intentions: to have gravestones made for herself and her miscarried children and then commit suicide with the poison. Confronting her, he claimed to understand her sense of loneliness and isolation and confessed he had those same feelings. Ann asked Holmes if they could share the burden of their loneliness together. Holmes urged her to return to her husband. She poured the poison on the ground, thanked Holmes, and departed. Holmes later learned that she had killed herself by stepping in front of an oncoming train; blaming himself for her death, he retired from the detective business.\n\nA second series of flashbacks recounts Holmes's trip to Japan, where he met a supposed admirer named Tamiki Umezaki. Years ago, Umezaki's father had abandoned him and his mother while in England. In a letter, Umezaki's father wrote he was so impressed by the brilliant Sherlock Holmes that he resolved to stay in England forever. Holmes bluntly told Umezaki that his father simply wanted a new life for himself and that Holmes never met him. Umezaki was crushed.\n\nIn the present, Mrs Munro gradually becomes dissatisfied with caring for Holmes as his overall health deteriorates, especially after he becomes unconscious from an experiment with the prickly ash and requires more physical care. She accepts a job at a hotel in Portsmouth, planning to take Roger to work there as well. Roger has become dissatisfied with his uneducated mother and his family's working-class status, and tension develops between mother and son.\n\nHolmes and Mrs Munro later discover Roger lying unconscious near the house, a victim of multiple stings, and he is rushed to a hospital. Distraught, Mrs Munro tries to burn down the apiary, blaming Holmes for caring only about himself and his bees. Holmes stops her, having realised that Roger had been stung by wasps; Roger found their nest and tried to drown them to protect the bees, but they swarmed on him instead. Holmes and Mrs Munro burn down the wasps' nest together, and Roger begins to recover. Acknowledging the value of personal connections with others, Holmes tells Mrs Munro that she and Roger will inherit the house and grounds after his death, encouraging her to stay in the home she knows rather than move away to take another unrewarding job.\n\nFinally, Holmes writes a letter to Umezaki saying that his father was a brave, honourable man who chose to work secretly for the British Empire. As Roger begins to teach his mother how to care for the bees, Holmes emulates a tradition he saw being practiced in Hiroshima: creating a ring of stones to serve as a place where he can recall the loved ones he has lost over the years.",
  "synopsis": null
}