{
  "imdb_id": "tt3155734",
  "tmdb_id": "352988",
  "douban_id": null,
  "title": "Dark Moon Rising (2015)",
  "genres": [
    "Fantasy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "124 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.2,
  "director": [
    {
      "id": "nm2691863",
      "name": "Justin Price"
    }
  ],
  "writer": [
    {
      "id": "nm2691863",
      "name": "Justin Price",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2612218",
      "name": "Anastasia Antonia",
      "character": "Dawn       (as Stasi Esper)"
    },
    {
      "id": "nm0000616",
      "name": "Eric Roberts",
      "character": "Henrick"
    },
    {
      "id": "nm4395571",
      "name": "Khu",
      "character": "Kaio"
    },
    {
      "id": "nm0087593",
      "name": "Billy Blanks",
      "character": "Sheriff Tom"
    },
    {
      "id": "nm2691863",
      "name": "Justin Price",
      "character": "Sin"
    },
    {
      "id": "nm4008189",
      "name": "Cameron White",
      "character": "Chace"
    },
    {
      "id": "nm5925891",
      "name": "Lisa May",
      "character": "Feighn"
    },
    {
      "id": "nm3206766",
      "name": "Matthew Simmons",
      "character": "Gecko"
    },
    {
      "id": "nm2945461",
      "name": "Timea Saghy",
      "character": "Danse"
    },
    {
      "id": "nm4570531",
      "name": "Jared Allman",
      "character": "James"
    },
    {
      "id": "nm4933762",
      "name": "Emily Bedford",
      "character": "Lisa       (voice)"
    },
    {
      "id": "nm3264089",
      "name": "Deanna Grace Congo",
      "character": "Amy"
    },
    {
      "id": "nm6054725",
      "name": "Michele Gourdine",
      "character": "Lisa"
    },
    {
      "id": "nm2995580",
      "name": "Sasha Higgins",
      "character": "Dominique"
    },
    {
      "id": "nm6603408",
      "name": "Katie Lee Mayo",
      "character": "College Student       (as Katie Mayo)"
    },
    {
      "id": "nm1335224",
      "name": "Mikki Padilla",
      "character": "Vasha"
    },
    {
      "id": "nm6616526",
      "name": "Amber Peirson",
      "character": "College Student"
    },
    {
      "id": "nm2859836",
      "name": "Christina Trevino",
      "character": "Van"
    },
    {
      "id": "nm6897057",
      "name": "Greg H. Trevino",
      "character": "Mark"
    },
    {
      "id": "nm5343883",
      "name": "Cierra Voelkl",
      "character": "College Student"
    }
  ],
  "overview": "A group of shape-shifting werewolves descend upon a small town in search of a girl who is re-born once every 2000 years. She holds the key to their survival and all will die who stand in their way.",
  "storyline": "In this first installment of the werewolf trilogy, we follow a group of shape-shifting werewolves that appear in a small town in search of a mysterious girl who is re-born once every 2000 years. In order to save their kind from the brink of extinction, they must capture her before she becomes a full fledged Lycan and reclaim her place as the Alpha species. Unknown to them however lurks yet another of her kind secretly living in the same small town. If they can capture both, then they would have the power to control a new species of werewolves and enslave the human race.",
  "plot": "Dark Moon Rising, commonly known as Wolf Moon, is a horror film about a girl named Amy, who falls in love with the new boy in town. Dan is the drifter from out of town who carries a dark secret with him. In the beginning, Amy's friends, tell her to go talk to Dan, who is working in an auto shop. He treats Amy with disinterest until he realizes that he has hurt her feelings. He asks to give her a ride home. Amy's father doesn't trust Dan from the beginning. Dan's a drifter, so people automatically don't trust him. But, the reason people don't trust him is because of the vibes he gives off. Amy and Dan get to know each other as the movie progresses. Meanwhile, Dan's father, Bender, is out killing people only a few states over. Dan's dad eventually shows up and kills a dog along with a horse. Sam, the local sheriff, and Amy's dad investigate the murders and eventually connect them to the killings from other states. The two eventually discover Charles Thibodeaux. Charles tells them that he knows Bender from a while ago and Bender is a werewolf. Charles put Bender in jail a while back, and he escaped seeking revenge. Bender killed Charles' wife brutally and Charles never got over it.",
  "synopsis": null
}