{
  "imdb_id": "tt3110958",
  "tmdb_id": "291805",
  "douban_id": "25662337",
  "title": "Now You See Me 2 (2016)",
  "genres": [
    "Action",
    "Adventure",
    "Comedy",
    "Crime",
    "Mystery",
    "Thriller"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "129 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm0160840",
      "name": "Jon M. Chu"
    }
  ],
  "writer": [
    {
      "id": "nm0004412",
      "name": "Ed Solomon",
      "description": "screenplay"
    },
    {
      "id": "nm0004412",
      "name": "Ed Solomon",
      "description": "story by &"
    },
    {
      "id": "nm1095804",
      "name": "Peter Chiarelli",
      "description": "story by"
    },
    {
      "id": "nm0945026",
      "name": "Boaz Yakin",
      "description": "based on characters created by &"
    },
    {
      "id": "nm3242689",
      "name": "Edward Ricourt",
      "description": "based on characters created by"
    }
  ],
  "cast": [
    {
      "id": "nm0251986",
      "name": "Jesse Eisenberg",
      "character": "J. Daniel Atlas"
    },
    {
      "id": "nm0749263",
      "name": "Mark Ruffalo",
      "character": "Dylan Rhodes"
    },
    {
      "id": "nm0000437",
      "name": "Woody Harrelson",
      "character": "Merritt McKinney"
    },
    {
      "id": "nm2002649",
      "name": "Dave Franco",
      "character": "Jack Wilder"
    },
    {
      "id": "nm0705356",
      "name": "Daniel Radcliffe",
      "character": "Walter Mabry"
    },
    {
      "id": "nm0135221",
      "name": "Lizzy Caplan",
      "character": "Lula"
    },
    {
      "id": "nm1727100",
      "name": "Jay Chou",
      "character": "Li"
    },
    {
      "id": "nm0005125",
      "name": "Sanaa Lathan",
      "character": "Deputy Director Natalie Austin"
    },
    {
      "id": "nm0000323",
      "name": "Michael Caine",
      "character": "Arthur Tressler"
    },
    {
      "id": "nm0000151",
      "name": "Morgan Freeman",
      "character": "Thaddeus Bradley"
    },
    {
      "id": "nm0913175",
      "name": "David Warshofsky",
      "character": "Agent Cowan"
    },
    {
      "id": "nm0157796",
      "name": "Tsai Chin",
      "character": "Bu Bu"
    },
    {
      "id": "nm4793189",
      "name": "William Henderson",
      "character": "Young Dylan"
    },
    {
      "id": "nm0481924",
      "name": "Richard Laing",
      "character": "Lionel Shrike"
    },
    {
      "id": "nm1631222",
      "name": "Henry Lloyd-Hughes",
      "character": "Allen Scott-Frank"
    },
    {
      "id": "nm3041488",
      "name": "Brick Patrick",
      "character": "Chase McKinney"
    },
    {
      "id": "nm1939540",
      "name": "Zach Gerard",
      "character": "Hannes Pike"
    },
    {
      "id": "nm3858223",
      "name": "Ben Lamb",
      "character": "Owen Case"
    },
    {
      "id": "nm8196458",
      "name": "Fenfen Huang",
      "character": "Lab Tech"
    },
    {
      "id": "nm5082903",
      "name": "Aaron Ly",
      "character": "Head Security Guard"
    },
    {
      "id": "nm1077806",
      "name": "Cyd Casados",
      "character": "Case Advisor"
    },
    {
      "id": "nm7190491",
      "name": "Jem Wilner",
      "character": "Agent Dore"
    },
    {
      "id": "nm2487593",
      "name": "James Richard Marshall",
      "character": "Agent UK"
    },
    {
      "id": "nm2300753",
      "name": "Alexa Brown",
      "character": "Agent 2 UK"
    },
    {
      "id": "nm0573294",
      "name": "Karl McMillan",
      "character": "Prison Guard 2 (US)"
    },
    {
      "id": "nm0685308",
      "name": "Jim Pirri",
      "character": "Eye Voice"
    },
    {
      "id": "nm0517530",
      "name": "Christopher Logan",
      "character": "Chef"
    },
    {
      "id": "nm4215324",
      "name": "Varada Sethu",
      "character": "Tressler Assistant"
    },
    {
      "id": "nm2539247",
      "name": "Michael Walters",
      "character": "Prison Guard US"
    },
    {
      "id": "nm1701602",
      "name": "Justine Wachsberger",
      "character": "Zoey Taylor"
    },
    {
      "id": "nm5250672",
      "name": "Simon Connolly",
      "character": "Octa Guard"
    },
    {
      "id": "nm5776744",
      "name": "Dino Fetscher",
      "character": "Octa Guard"
    },
    {
      "id": "nm0216317",
      "name": "Martin Delaney",
      "character": "Bo Walsh"
    },
    {
      "id": "nm3968749",
      "name": "Nichole Bird",
      "character": "Disappearing Lady 1"
    },
    {
      "id": "nm3930361",
      "name": "Danielle Bird",
      "character": "Disappearing Lady 2"
    },
    {
      "id": "nm0177474",
      "name": "Michael Cooke",
      "character": "Jack Stooge 1A"
    },
    {
      "id": "nm0177445",
      "name": "John Cooke",
      "character": "Jack Stooge 1B"
    },
    {
      "id": "nm8499282",
      "name": "Greg McKenzie",
      "character": "Jack Stooge 2A"
    },
    {
      "id": "nm8499283",
      "name": "Michael McKenzie",
      "character": "Jack Stooge 2B"
    },
    {
      "id": "nm7934134",
      "name": "Tai Yin Chan",
      "character": "Science Lab Guard"
    },
    {
      "id": "nm5413069",
      "name": "Bruce Chong",
      "character": "Science Lab Guard 2"
    },
    {
      "id": "nm5201494",
      "name": "Missy Malek",
      "character": "Case Assistant"
    },
    {
      "id": "nm3422247",
      "name": "Krystal Ellsworth",
      "character": "Casino Dancer"
    },
    {
      "id": "nm1222294",
      "name": "Jessica Lee Keller",
      "character": "Casino Dancer       (as Jessica Keller)"
    },
    {
      "id": "nm8196459",
      "name": "Krysada Phounsiri",
      "character": "Casino Dancer"
    },
    {
      "id": "nm2157003",
      "name": "Luis Rosado",
      "character": "Casino Dancer"
    },
    {
      "id": "nm8196460",
      "name": "Karl Hussain",
      "character": "Street Drummer"
    },
    {
      "id": "nm2789663",
      "name": "Savannah Guthrie",
      "character": "Herself"
    },
    {
      "id": "nm7401404",
      "name": "Zoey Callandria Jones",
      "character": "Hannes Attractive Woman"
    }
  ],
  "overview": "One year after outwitting the FBI and winning the public’s adulation with their mind-bending spectacles, the Four Horsemen resurface only to find themselves face to face with a new enemy who enlists them to pull off their most dangerous heist yet.",
  "storyline": "One year after outwitting the F.B.I. and winning the public's adulation with their Robin Hood-style magic spectacles, The Four Horsemen resurface for a comeback performance in hopes of exposing the unethical practices of a tech magnate. The man behind their vanishing act is none other than Walter Mabry, a tech prodigy who threatens the Horsemen into pulling off their most impossible heist yet. Their only hope is to perform one last unprecedented stunt to clear their names and reveal the mastermind behind it all.",
  "plot": "One year after outwitting the FBI, the remaining members of the Four Horsemen—J. Daniel Atlas (Jesse Eisenberg), Merritt McKinney (Woody Harrelson) and Jack Wilder (Dave Franco)—are in hiding, awaiting further instructions from The Eye, the secret society of magicians they've been recruited into. Atlas, having grown tired of waiting for a mission, seeks out The Eye himself. His search leads him to an underground tunnel in which he hears a voice that tells him that his wait may be coming to an end. The Horseman handler FBI agent Dylan Rhodes (Mark Ruffalo) ultimately assigns them a new mission, exposing corrupt businessman Owen Case (Ben Lamb), whose new software secretly steals data on its users for Case's benefit. Lula (Lizzy Caplan) is added to the team to replace former member Henley Reeves (Isla Fisher), who has left the Horsemen due to her breaking up with Atlas.\n\nThe Horsemen hijack the launch party for the new software but the show is interrupted by a mysterious individual who reveals to the world that Wilder, believed to be dead, is actually alive, and that Dylan Rhodes is their mole, forcing Rhodes to escape. While escaping, the Horsemen enter their escape tube on a roof and emerge in Macau, where they are captured by mercenaries and Chase McKinney (also played by Woody Harrelson), Merritt's twin brother. The Horsemen are then brought before Chase's employer, technology prodigy Walter Mabry (Daniel Radcliffe), Case's former business partner who faked his death after Case stole Walter's company. Mabry conscripts the Horsemen into stealing the data-mining device developed by Case to prevent Case from using it. The chip allows the user to decrypt and access any electronic device around the world. Atlas agrees to steal the device.\n\nThey get supplies at a famous magic shop in Macau, run by Li (Jay Chou) and Bu Bu (Tsai Chin), and secretly contact The Eye to arrange to hand over the device after they steal it. Meanwhile, Rhodes is branded a fugitive and forced to spring his rival Thaddeus Bradley (Morgan Freeman), whom Rhodes blames for the death of his father, out of jail for help.\n\nThe Horsemen infiltrate the facility. They're interrogated and searched by security guard Allen Scott-Frank (Henry Lloyd-Hughes), but they manage to steal the chip. Atlas is then confronted by Mabry, revealing that Atlas had been fooled into thinking that Mabry was The Eye. Rhodes intervenes and pretends to retrieve the device but is captured by Mabry's forces and taken to a nearby yacht where he learns Mabry is acting on behalf of his father, Arthur Tressler (Michael Caine), the businessman whom Rhodes employed the Horsemen to expose in the first film. Tressler places Rhodes in a replica of the same safe that his father died in and leaves him to drown, but Rhodes escapes. After the rescue, the Horsemen find that the chip they had stolen appears to be a fake.\n\nRhodes and the Horsemen broadcast that they will be performing live in London at midnight on New Year's Eve. Mabry and Tressler think that they have the computer chip, they make haste to London, where the Horsemen are performing a series of tricks live on the streets. Mabry, Tressler and Chase discover that Rhodes is still alive and capture the five, before boarding them on his private plane. Mabry takes the chip card from them and Rhodes, along with the other Horsemen, are thrown out of the plane in flight. However, Tressler finds that the plane has never taken off, and instead they were tricked into boarding a plane on a barge in the middle of the River Thames, their criminal activities being broadcast live to the world by the Horsemen in the process. Mabry, Tressler and Chase are arrested by the FBI, and Rhodes, now going by his real surname, \"Shrike\", entrusts the information they've gathered on the real criminals' activities to the FBI, who allows him a head start to escape.\n\nRhodes and the Horsemen are then taken to meet the leaders of the Eye in a secret library in Greenwich observatory. They find that the members of the Eye include Li, Bu Bu, Allen, and Bradley. Bradley reveals that he was actually Lionel Shrike's partner, and he had been masquerading as his rival as part of their planned act: he had exposed Lionel's first act planning to be dumbfounded by his second act, only to abandon the Eye after Lionel's death. Before Bradley leaves, he asks Rhodes to be his successor in the Eye's leadership and request that the Horsemen enter a curtain. The Horsemen, with Rhodes, go behind the curtain, and find a door behind it. They enter the room and find a staircase; the camera zooms out to the stairs, forming an Eye.",
  "synopsis": "New Jersey, 1984The magician Lionel Shrike (Richard Laing) is set to perform a trick in which he attempts to escape from a safe as it is dropped into the river. Thaddeus Bradley (Morgan Freeman) is reporting on the event, claiming it can't be done. Lionel's son Dylan (William Henderson) runs to his dad, expressing doubts over the trick. Lionel assures Dylan he'll be out in five minutes. Lionel gets in the safe and it's dropped in the water. Five minutes pass, and Lionel never resurfaces. People begin to panic, and Dylan tries running toward the water, but he is held back by authorities.We see a video from Thaddeus in the present as he sits in his prison cell. He mentions the magic society known as The Eye, and how The Horsemen will get what's coming to them.New York City, Present Day.The Horsemen have been hiding out for a year since their last heist show. Since then, Henley Reeves has left the group. J. Daniel Atlas (Jesse Eisenberg) is walking through a tunnel that leads him into a room. A voice speaks to Danny, claiming to be part of The Eye, the underground consortium of magic and illusion. Danny is sick of hiding out and not having made progress over the past year, but the voice tries to assure Danny that things are about to pay off.Meanwhile, Dylan Shrike (now played by Mark Ruffalo) is still playing out his own act as an agent by pretending to be on the trail of The Horsemen, despite being their mole. He talks to new agent Natalie Austin (Sanaa Lathan) and senior agent Cowan (David Warshofsky) about the trail he's picked up, but they think he's full of crap.Danny returns to his apartment to find a woman named Lula May (Lizzy Caplan) on his couch. He triggers a set-up that makes it look like Lula gets decapitated on his couch, but Danny knows it's a trick. She appears behind him and starts saying what she knows about The Horsemen. Danny recognizes her from a show she performed ages ago in which she pulled a hat out of a rabbit (you read it right). He tries tying her up, but when his back is turned, Lula disappears.Danny is summoned to meet with the rest of The Horsemen. Merritt McKinney (Woody Harrelson) and Jack Wilder (Dave Franco) are practicing throwing cards, while Jack thinks he's gotten the hang of hypnotism (he hasn't). The three go to their meeting place to find Dylan and Lula together, as she is now part of the group. Dylan says it's time for their next show to go on. The plan is to sabotage a launch for the tech program Octa, and to expose the company's CEO Owen Case (Ben Lamb) for being a fraud and taking the information of his consumers.The Horsemen get to the launch site in New York while disguised as employees. They set up the trap with cameras, and Merritt hypnotizes Owen into walking into a room where he will openly broadcast his deceit. The show begins, with Danny, Lula, and Merritt taking the stage and the audience taking The Horsemen's reappearance as a big surprise. Suddenly, Dylan finds a fool tarot card in his booklet. Before The Horsemen can perform any tricks, however, their own show is sabotaged as a distorted voice begins to speak. The voice starts to expose the secrets of The Horsemen, namely that Jack is still alive and that Dylan is their mole. This happens as Natalie, Cowan, and other FBI agents show up. They begin to arrest Dylan, but he uncuffs himself and cuffs the agents together.The Horsemen all run to the roof of the building to escape. They slide down a chute, thinking they will land in a truck that gets them out of there. However, they end up in the kitchen of a Chinese food restaurant. To their bewilderment, they have somehow ended up in Macau. To add even more confusion, The Horsemen discover that this was partially orchestrated by Merritt's twin brother Chase (also Woody Harrelson in a duo role). A group of armed thugs take The Horsemen away in vans.Dylan gets a phone call from Thaddeus, still speaking as though he is going to exact his revenge. Dylan later uses Cowan's ID to get into Thaddeus's prison cell and eventually set him free as he helps him figure out what happened with The Horsemen.The Horsemen ride with Chase to their next destination. Chase and Merritt explain that were once a brotherly duo that performed together, until Merritt went off and made a name for himself, leaving Chase kicked to the curb. Chase says that he once disguised himself as a pizza delivery guy and hypnotized Merritt before stealing his information along with that of the other three Horsemen. The thugs bring The Horsemen into a building and take it up to the penthouse where they meet Walter Mabry (Daniel Radcliffe), Owen's former partner that was believed to have died a year earlier. Walter faked his death (which he claims to have gotten from Jack) after Owen had him declared unstable when Owen stole Walter's plans and took credit for their work. Walter also explains how The Horsemen ended up in China - they were put to sleep as they slid down the chutes and were flown out to Macau while unconscious. Walter then states that he wants The Horsemen to pull off a heist in which they are to infiltrate an underground facility and steal a memory stick that would allow people like Owen to gather information on many people. Lula, Merritt, and Jack all refuse, but Danny agrees to it.The next day, The Horsemen go to what is said to be the oldest magic shop in the world. They meet a man named Li (Jay Chou) and his grandmother Bu Bu (Tsai Chin). Li provides The Horsemen with the materials they need to pull off their heist.Dylan and Thaddeus fly out to Macau to find The Horsemen. Thaddeus knows that Dylan had been plotting revenge on him after believing Thaddeus goaded Lionel into performing the trick that took his life, leaving Dylan still angered. When the two arrive, they visit the same magic shop and speak to Bu Bu and Li in regards to what they know about The Horsemen. Thaddeus walks into a sarcophagus and disappears, leaving Dylan with only a note that says \"Your move\".The Horsemen must first meet a South African gangster at a casino before he guides them to the facility where they will find the stick. They are brought there in disguise as researchers. Creating diversions, Jack gets the stick and attaches it to a playing card. The Horsemen get inspected individually, while constantly trying to keep the card hidden from view. After a long inspection, they are cleared to get out. Knowing the stick would set off the metal detector, Danny creates another distraction to allow Merritt to throw the card to Lula without detection.Danny waits for someone to pick up the stick, but when Walter shows up with his thugs, Danny learns that he's being double-crossed. Walter's thugs hit Danny as Walter demands the stick, but Dylan appears and makes it seem like he grabbed the card from Danny, leading the thugs to chase after Dylan. After taking out most of the thugs, Dylan runs into Chase, who distracts him long enough for Walter to show up and knock Dylan unconscious.Dylan is brought onto a boat. Walter knows about Dylan's desire to avenge his father, which Walter states is something that he relates to, as this is part of his plan. His father turns out to be Arthur Tressler (Michael Caine), the same man that Dylan aided The Horsemen in screwing over after Tressler's company denied Dylan's mother a claim after Lionel's death. Tressler coldly dismisses this and proceeds to have Dylan placed into a safe. They drop the safe into the river, confident that Dylan will drown. As the villains leave, Dylan manages to pick the lock open, but he loses consciousness before he can resurface. Thankfully, The Horsemen figured out where he was, and Danny pulls him up.Tressler gets into his limo and sits next to Thaddeus, as he apparently helped in getting back at Dylan and The Horsemen.After resuscitating Dylan, The Horsemen take him to their hideout. They discover that the card they have with the stick is fake, meaning they may have lost it at some point when Danny and Dylan were attacked. Feeling despaired, they are then met by Li and Bu Bu, who reveal that they are part of The Eye and have been watching The Horsemen for a while. They realize that they need to put on a show to expose Walter and Tressler. They begin to set up their plan.The Horsemen head to London to put on their show. First, Jack does a set up in front of a small crowd of people where he takes three volunteers (two jacks and a queen) to hide behind three large cards while people try to guess where the queen went. Next, Lula does a performance involving doves. Then, Danny is gathered in front of a large crowd where it appears to be raining, leading him to act as though he is manipulating the water. The FBI head in toward London to find The Horsemen, while Walter, Tressler, and Chase are all tracking their locations as well, noticing that they are all located in a pattern.Chase finds Merritt and deduces that he is headed toward Greenwich. Feeling that they are in trouble, Dylan calls The Horsemen together to meet at their rendezvous point. Meanwhile, the FBI have managed to apprehend Thaddeus. Dylan and The Horsemen are caught by Walter's goons and taken to his plane. As they take off, Chase suggests that they throw them all off the plane. One by one, the five are thrown off the plane. As Walter and Tressler drink to celebrate, they notice something tastes wrong with their champagne. Tressler then peels off the sticker and sees a fool card. The plane stops, and they look outside to see The Horsemen waving at them. The villains get off the plane and see that the entire thing was staged. Thousands of Londoners are gathered around the Thames to watch the show, which is also streaming around the world. The Horsemen then elaborate on how the show was set up, using help from Li and other willing participants, leading them to a fake hangar that made the villains think they took off. Jack also managed to hypnotize Chase when he bumped into him moments earlier into planning to throw The Horsemen off the plane. They expose Walter and Tressler to the public, along with Chase, leading to the three of them getting arrested.Natalie confronts Dylan for his deceit, though he claims he's still the same guy she looked up to when she started working for the FBI. He hands her the stick with all the incriminating evidence, and he vanishes.Not long after, Dylan and The Horsemen are taken to a building belonging to The Eye. Dylan enters a room and finds pictures of his father, including one of him with Thaddeus. Thaddeus emerges (he escaped custody) and explains that he and Lionel were partners whose act was pretending to be rivals. He has always felt remorse over what happened to Lionel, but he is proud of the magician Dylan grew up to be. Dylan appears to forgive Thaddeus, and he asks what happens now. Thaddeus says he should find a successor, just as Danny and the other three walk in. Thaddeus walks out, but not before telling the five to pay no mind to the curtain in the room. They end up walking to the curtain and find a door behind it. This leads them toward a spiral staircase. They walk down to see whatever happens to be at the bottom, and the film suddenly ends."
}