{
  "imdb_id": "tt3121332",
  "tmdb_id": "308077",
  "douban_id": null,
  "title": "Nasty Baby (2015)",
  "genres": [
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "101 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm2928364",
      "name": "Sebastián Silva"
    }
  ],
  "writer": [
    {
      "id": "nm2928364",
      "name": "Sebastián Silva",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm2928364",
      "name": "Sebastián Silva",
      "character": "Freddy"
    },
    {
      "id": "nm1325419",
      "name": "Kristen Wiig",
      "character": "Polly"
    },
    {
      "id": "nm0011758",
      "name": "Tunde Adebimpe",
      "character": "Mo"
    },
    {
      "id": "nm0146146",
      "name": "Reg E. Cathey",
      "character": "The Bishop"
    },
    {
      "id": "nm0546797",
      "name": "Mark Margolis",
      "character": "Richard"
    },
    {
      "id": "nm2927993",
      "name": "Agustín Silva",
      "character": "Chino"
    },
    {
      "id": "nm0790057",
      "name": "Alia Shawkat",
      "character": "Wendy"
    },
    {
      "id": "nm0925132",
      "name": "Lillias White",
      "character": "Cecilia"
    },
    {
      "id": "nm0158207",
      "name": "Anthony Chisholm",
      "character": "Mo's Father"
    },
    {
      "id": "nm1750371",
      "name": "Marsha Stephanie Blake",
      "character": "Mo's Sister /              Haimy"
    },
    {
      "id": "nm2013524",
      "name": "William Oliver Watkins",
      "character": "Mo's Brother-in-Law"
    },
    {
      "id": "nm0795723",
      "name": "Constance Shulman",
      "character": "Bishop's Girlfriend"
    },
    {
      "id": "nm0400223",
      "name": "Neal Huff",
      "character": "Gallery Owner"
    },
    {
      "id": "nm7696946",
      "name": "Jesse Thurston",
      "character": "Gallery Owner Assistant"
    },
    {
      "id": "nm0304289",
      "name": "Catrina Ganey",
      "character": "Policewoman"
    },
    {
      "id": "nm1316875",
      "name": "Toni D'Antonio",
      "character": "Nurse"
    },
    {
      "id": "nm0551441",
      "name": "Judy Marte",
      "character": "Abused Woman"
    },
    {
      "id": "nm1752172",
      "name": "Becky London",
      "character": "Jewish Woman"
    },
    {
      "id": "nm0786806",
      "name": "Cara Seymour",
      "character": "Nosy Neighbor"
    },
    {
      "id": "nm3459347",
      "name": "Ina Howard-Parker",
      "character": "Brooklyn Mom       (as Ina Howard)"
    },
    {
      "id": "nm5553424",
      "name": "Nico Arge",
      "character": "Nico"
    }
  ],
  "overview": "Nasty Baby centers around a Brooklyn couple, Freddy and his boyfriend Mo, who are trying to have a baby with the help of their best friend, Polly. Freddy is an artist, and his latest work is all about babies – it’s clear he’s dying to be a father. Polly is a family practitioner who is more interested in having a baby than having a man. Mo is hesitant about the entire idea, especially when Polly isn’t having success with Freddyʼs sperm and the donor responsibility shifts to him. Set almost entirely in the multicultural vibrancy of Fort Greene, Brooklyn, the trio navigates the idea of creating life, when they are confronted by unexpected harassment from particularly aggressive neighborhood man, nicknamed The Bishop. The Bishop is bothersome in small, yet persistent ways, with a hint of danger. As their clashes become increasingly aggressive, someone is bound to get hurt.",
  "storyline": "A close-knit trio navigates the idea of creating life, while at the same time being confronted with a brutal scenario.",
  "plot": "The film centers on European immigrant Freddy and Mo, a gay couple trying to have a baby with the help of their friend Polly. Freddy is also a performance artist who is attempting to make a short film entitled Nasty Baby which features himself portraying a screaming infant. Freddy's sperm count is too low causing every attempt with Polly to fail. Mo is reluctant to be the donor but eventually concedes, and Polly successfully gets pregnant. Throughout the film the trio are plagued by a mentally ill vagrant called The Bishop. Polly and Freddy make the mistake of initially being friendly to him, but he is aggressively homophobic and gives Polly unwanted attention. One evening he assaults Polly, and the next morning a policewoman intervenes. This only worsens the situation, and ultimately The Bishop follows Freddy home the same evening his performance art piece is rejected. The Bishop assaults Freddy with a rock while verbally attacking him with homophobic slurs, and in self-defense Freddy swings a six pack of beer at The Bishop's head, badly wounding him. Freddy carries The Bishop up the stairs of his apartment, remorseful and wanting to help, but The Bishop attacks Freddy with a kitchen knife and Freddy kills him in self-defense. Realizing Freddy could be deported because of this, and with Polly pregnant, the trio (with the help of several other friends) take the body to the woods and burn it.",
  "synopsis": "Three friends trying to accomplish a life goal while working on crazy art proyect and struggling to find a place in the art business will depict a colourful, joyfull sample of Brooklyn's young adulthood life style in 2013. A duality of dreams and hopelessness. They will understand life can be a little nasty."
}