{
  "imdb_id": "tt3177316",
  "tmdb_id": "254191",
  "douban_id": null,
  "title": "Honeymoon (2014)",
  "genres": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "87 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm4074404",
      "name": "Leigh Janiak"
    }
  ],
  "writer": [
    {
      "id": "nm5177682",
      "name": "Phil Graziadei",
      "description": null
    },
    {
      "id": "nm4074404",
      "name": "Leigh Janiak",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3310211",
      "name": "Rose Leslie",
      "character": "Bea"
    },
    {
      "id": "nm2016685",
      "name": "Harry Treadaway",
      "character": "Paul"
    },
    {
      "id": "nm3193675",
      "name": "Ben Huber",
      "character": "Will"
    },
    {
      "id": "nm3813339",
      "name": "Hanna Brown",
      "character": "Annie"
    },
    {
      "id": "nm8785643",
      "name": "Bob Harrison",
      "character": "Dark Figures"
    },
    {
      "id": "nm5116004",
      "name": "John Lauterbach",
      "character": "Dark Figures"
    },
    {
      "id": "nm8790373",
      "name": "Peter Leo",
      "character": "Dark Figures"
    }
  ],
  "overview": "Young newlyweds Paul (Harry Treadaway) and Bea (Rose Leslie) travel to a remote lake house for their honeymoon, where the promise of private romance awaits them. Paul is woken in the middle of the night by a shaft of light entering the cabin, which sets off his bedside alarm. Returning to bed, he finds it empty and, after an anxious period of search, discovers a naked Bea cold and disoriented in the woods. As she becomes more distant and her behaviour increasingly peculiar, Paul begins to suspect something more sinister than sleepwalking took place in the woods.",
  "storyline": "Young newlyweds Paul and Bea travel to remote lake country for their honeymoon. Shortly after arriving, Paul finds Bea wandering and disoriented in the middle of the night. As she becomes more distant and her behavior increasingly peculiar, Paul begins to suspect something more sinister than sleepwalking took place in the woods.",
  "plot": "Bea (Rose Leslie) and Paul (Harry Treadaway) are newly married and off to have a romantic honeymoon in a rustic cabin set in a secluded forest. During their stay there, they go to a small restaurant where Will, the owner, initially acts hostile and asks them to leave, but later calms down, realizing he was Bea's childhood friend. Will's wife then comes in, acting strangely and saying they need to get away. Afterwards, everything goes normally until their wedded bliss is cut short when Bea goes missing. Paul finds her naked and disoriented in the woods with no evidence as to how she got there or why she was there in the first place. He takes her back to the cabin, where she claims she was sleepwalking due to stress, and tells him to make nothing of it.\n\nAs time passes, Bea's behavior becomes increasingly distant and strange. At first, Paul blames Bea's strange behaviour on some encounter with Will, but soon he realizes there's more going on. One night as Paul is lying awake, he sees some bright lights through the windows, but when he goes to investigate he finds nothing. As Paul sees his wife's behavior becoming more erratic he finds unique marks on Bea's inner thighs which she passes off as mosquito bites. Some time later during an argument, Bea locks herself in the bathroom, and when Paul breaks in he finds her repeatedly stabbing herself in the genitals. Paul then ties her to the bed and she asks him to \"take it out of her\". Paul puts his hand into her vagina and takes out a large worm-like creature. Bea later explains that the night she disappeared into the woods, she saw the same lights Paul had seen and couldn't help walking towards them. She then saw some silhouettes, which apparently impregnated her with the creature. Bea says that she is herself, but they're taking away what's left of her. She says she must protect Paul because they are going to \"dispose of him\". Bea then knocks Paul out, takes him into the middle of the lake on a boat, ties an anchor to his feet, and throws him to his death while believing that she is protecting him by \"hiding\" him under the water.\n\nBea is later shown to be deteriorating, her skin becoming white and flaky. She then meets Will's wife, and they walk away into the lights. The film finishes with Bea saying \"Before I was alone, but now I'm not.\"",
  "synopsis": "Bea (Rose Leslie) and Paul (Harry Treadaway) are newly married and off to have a romantic honeymoon in a rustic cabin set in a secluded forest. During their stay there, they go to a small restaurant whose owner initially acts hostile and asks them to leave, but later calms down, realizing he was Bea's childhood friend, Will. Will's wife then comes in, acting strangely and saying they need to get away. Afterwards, everything goes normally until their wedded bliss is cut short when Bea goes missing. Paul finds her naked and disoriented in the woods with no evidence as to how she got there or why she was there in the first place. He takes her back to the cabin, where she claims she was sleepwalking due to stress, and tells him to make nothing of it.As time passes, Bea's behavior becomes increasingly distant and strange. At first, Paul blames Bea's strange behaviour on some encounter with Will, but soon he realizes there's more going on. One night as Paul is lying awake, he sees some bright lights through the windows, but when he goes to investigate he finds nothing. As Paul sees his wife's behavior becoming more erratic he finds unique marks on Bea's inner thighs which she passes off as mosquito bites. Some time later during an argument, Bea locks herself in the bathroom, and when Paul breaks in he finds her repeatedly stabbing herself in the genitals. Paul then ties her to the bed and she asks him to \"take it out of her\". Paul puts his hand into her vagina and takes out a large worm-like creature. Bea later explains that the night she disappeared into the woods, she saw the same lights Paul had seen and couldn't help walking towards them. She then saw some silhouettes, which apparently impregnated her with the creature. Bea says that she is herself, but they're taking away what's left of her. She says she must protect Paul because they are going to \"dispose of him\". Bea then knocks Paul out, takes him into the middle of the lake on a boat, ties an anchor to his feet, and throws him to his death while believing that she is protecting him by \"hiding\" him under the water.Bea is later shown to be deteriorating, her skin becoming white and flaky. She then meets Will's wife, and they walk away into the lights. The film finishes with Bea saying \"Before I was alone, but now I'm not.\""
}