{
  "imdb_id": "tt3178822",
  "tmdb_id": "221410",
  "douban_id": null,
  "title": "Ruins (2013)",
  "genres": [
    "Documentary"
  ],
  "country": "Greece",
  "version": [
    {
      "runtime": "57 min",
      "description": "theatrical"
    }
  ],
  "imdb_rating": 8.6,
  "director": [
    {
      "id": "nm5938389",
      "name": "Zoe Mavroudi"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm5938396",
      "name": "Mariniki Alevizopoulou",
      "character": "Herself"
    },
    {
      "id": "nm5938393",
      "name": "Chrysa Botsi",
      "character": "Herself"
    },
    {
      "id": "nm5938390",
      "name": "Kostas Farmakidis",
      "character": "Himself"
    },
    {
      "id": "nm5938391",
      "name": "Ourania Georgiou",
      "character": "Herself"
    },
    {
      "id": "nm5938395",
      "name": "Anna Kavouri",
      "character": "Herself"
    },
    {
      "id": "nm5938392",
      "name": "Marianella Kloka",
      "character": "Herself"
    },
    {
      "id": "nm5938394",
      "name": "Vaggelio Soumeli",
      "character": "Herself       (as Evangelia Soumeli)"
    },
    {
      "id": "nm4259648",
      "name": "Matthew Weaitt",
      "character": "Himself"
    }
  ],
  "overview": "A documentary about a shocking case of HIV criminalization in Greece.",
  "storyline": "A documentary about a shocking case of HIV criminalization in Greece.",
  "plot": "Two young American couples — Jeff (Jonathan Tucker) and Amy (Jena Malone), and Eric (Shawn Ashmore) and Stacy (Laura Ramsey) — enjoy their vacation in Mexico. They meet Mathias (Joe Anderson), a German tourist, who is looking for his brother Heinrich. His last known location is an archaeological dig at a remote Mayan ruin in the jungle. They are also joined by Dimitri (Dimitri Baveas), Mathias's friend. The group reaches the ruins of a Mayan temple, and are confronted by Mayan villagers with guns and bows. Mathias tries to explain their purpose, but the villagers do not understand Spanish or English. When Amy accidentally touches some vines the villagers become increasingly agitated. Dimitri approaches the villagers, hoping to appease them, but they shoot and kill him. The rest of the group flees up the steps of the ruins.\n\nAt the top, they find an abandoned camp and a shaft in the center. The group cannot call for help since Eric's phone has no signal. They hear a cell phone ringing from somewhere inside the ruins. Believing it is Heinrich's phone ringing, the rest of the group lowers Mathias down the shaft with a rope. The rope breaks and Mathias falls, becoming completely paralyzed. Amy and Jeff descend the temple steps hoping to reason with the Mayans, but to no success. In anger, Amy throws a clump of vines at them and hits a young boy, whom the Mayans promptly kill. They realize the Mayans are afraid of the vines, and won't let them go since they have touched them. Later, Stacy and Amy descend the shaft to help Mathias and to find the phone. Jeff and Eric rig a backboard and bring Mathias out of the shaft.\n\nThe next morning, Stacy sees a tendril of vine has crept into a wound on her leg. The vines have also wrapped themselves around Mathias's lower legs and eaten them down to the bone. Eric and Jeff are barely able to remove the vines from Stacy but cannot get them off of Mathias. The cell phone is heard again from deep in the shaft so Stacy and Amy descend again. In a small, vine-covered room, the two find the body of the young archaeologist, Heinrich's friend, and a broken phone. They then realize that the ringing sound are made by the flowers of the vine. As Amy touches one flower, the vines attack and the two barely escape.\n\nThe group now realizes that the vines are predatory, which is why the Mayans won't let anyone leave. As Mathias' condition worsens, Jeff amputates his legs to avoid an infection. Stacy becomes jealous at Eric comforting a distraught Amy. Later, she accuses them of having sex and claims that she overheard Amy moaning (the sound is implied to be made by the flowers). While the four argue, the vines suffocate Mathias by creeping down his throat.\n\nIn the morning Eric brings in Amy and Jeff into the tent and tells Stacey to show them what is on her back. She turns around and exposed her back and we can see vines under her skin moving. Eric pours alcohol over her leg to sterilize it and then cuts her leg to remove the vine. He then proceeds to remove the three-foot-long vine from her spine. After they remove the vines she tries to take the knife claiming that the vines are in her head.\n\nThe next morning, Stacey awakens and goes out of the tent where they are all sleeping. She finds a backpack and looks inside and finds a knife. Jeff heard moans coming from outside and goes to see what is going on. Then Jeff and Amy follow out with Eric. Jeff walks over to Stacey trying to calm her down as she has a deep gash on her forehead and is slicing up her thigh to get a vine out. He touches her and she flails the knife at him, slicing his palm. He backs away. Eric then approaches Stacey trying to calm her down also. As he touches her back to calm her, she spins around and fatally stabs him in the chest. As they try and calm Stacey, the vines have wrapped themselves around Eric's legs and drag him into the bushes. Jeff sees a now unstable Stacy cutting herself, paranoid that the vines are inside her. Overcome with remorse, Stacy begs Amy to kill her. She is then killed off-screen. Jeff makes a plan for Amy to escape. He smears Stacy's blood all over her, then carries her to the bottom of the temple and lays her on the ground. He then provokes and berates the Mayans, drawing their attention away from Amy. The Mayans eventually shoot Jeff with arrows. Amy gets up and runs through the jungle with the Mayans chasing after her. Jeff is executed by the Mayan leader with a gunshot to the head. She reaches the Jeep and manages to drive away only to have a vine shoot up from her eye.\n\nAfter Amy's failed escape, Dimitri's two Greek friends are walking through the woods and come up to the temple, looking for him. As they make their way towards the temple, They shout \"Dimitri, Dimitri!\"\nThe Untold Ending\nA version of the scene plays out identically, then cuts to a cemetery where a caretaker is walking among the headstones whistling \"Frère Jacques\". When he hears the same tune coming from Amy's grave, he goes forward to investigate and the camera follows, revealing several red flowers around the headstone. As the caretaker reaches for one, the music surges and the scene cuts to black.\nDirector Carter Smith told an interviewer, \"We shot a bunch of different stuff to see which one would work best with the finished film. There's a testing process you go through with a studio movie and as frustrating as it can be, it also really gives you a good sense of how an audience feels about an ending. Our final decision was informed by what audiences found the most satisfying after watching a really punishing film. I love the ending of the book, but if the movie had ended the same way, the audience would have wanted to kill themselves.\"",
  "synopsis": null
}