{
  "imdb_id": "tt3110960",
  "tmdb_id": "262958",
  "douban_id": null,
  "title": "Jimmy's Hall (2014)",
  "genres": [
    "Biography",
    "Drama",
    "History"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "109 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.7,
  "director": [
    {
      "id": "nm0516360",
      "name": "Ken Loach"
    }
  ],
  "writer": [
    {
      "id": "nm0491956",
      "name": "Paul Laverty",
      "description": "screenplay"
    },
    {
      "id": "nm0641525",
      "name": "Donal O'Kelly",
      "description": "play uncredited"
    }
  ],
  "cast": [
    {
      "id": "nm0911395",
      "name": "Barry Ward",
      "character": "Jimmy"
    },
    {
      "id": "nm0535837",
      "name": "Francis Magee",
      "character": "Mossie"
    },
    {
      "id": "nm5879255",
      "name": "Aileen Henry",
      "character": "Alice"
    },
    {
      "id": "nm2034064",
      "name": "Simone Kirby",
      "character": "Oonagh"
    },
    {
      "id": "nm7249530",
      "name": "Stella McGirl",
      "character": "Stella"
    },
    {
      "id": "nm0289258",
      "name": "Sorcha Fox",
      "character": "Molly"
    },
    {
      "id": "nm2292032",
      "name": "Martin Lucey",
      "character": "Dessie"
    },
    {
      "id": "nm0613847",
      "name": "Mikel Murfi",
      "character": "Tommy"
    },
    {
      "id": "nm4713237",
      "name": "Shane O'Brien",
      "character": "Finn"
    },
    {
      "id": "nm1740112",
      "name": "Denise Gough",
      "character": "Tess"
    },
    {
      "id": "nm0636235",
      "name": "Jim Norton",
      "character": "Father Sheridan"
    },
    {
      "id": "nm4957233",
      "name": "Aisling Franciosi",
      "character": "Marie"
    },
    {
      "id": "nm1160803",
      "name": "Seán T. Ó Meallaigh",
      "character": "Journalist"
    },
    {
      "id": "nm0311297",
      "name": "Karl Geary",
      "character": "Seán"
    },
    {
      "id": "nm0639928",
      "name": "Brían F. O'Byrne",
      "character": "Commander O'Keefe"
    },
    {
      "id": "nm0567587",
      "name": "Conor McDermottroe",
      "character": "Doherty"
    },
    {
      "id": "nm7249531",
      "name": "John Cronogue",
      "character": "Séamus Clarke"
    },
    {
      "id": "nm1797196",
      "name": "Seamus Hughes",
      "character": "Ruairí"
    },
    {
      "id": "nm0778831",
      "name": "Andrew Scott",
      "character": "Father Seamus"
    },
    {
      "id": "nm1034260",
      "name": "Michael Sheridan",
      "character": "Fintan"
    },
    {
      "id": "nm2641725",
      "name": "Rebecca O'Mara",
      "character": "Mrs. O'Keefe"
    },
    {
      "id": "nm7249532",
      "name": "Diane Parkes",
      "character": "Mossie's Wife"
    },
    {
      "id": "nm7249533",
      "name": "Padraig Fallon",
      "character": "Roscommon IRA"
    },
    {
      "id": "nm6514139",
      "name": "Chris MacManus",
      "character": "Roscommon IRA"
    },
    {
      "id": "nm0641525",
      "name": "Donal O'Kelly",
      "character": "Roscommon IRA"
    },
    {
      "id": "nm2978384",
      "name": "John O'Dowd",
      "character": "Steward"
    },
    {
      "id": "nm4570731",
      "name": "Anna Crossley",
      "character": "Young Dancer"
    },
    {
      "id": "nm7249534",
      "name": "Róisín Judge",
      "character": "Young Violinist"
    },
    {
      "id": "nm7249535",
      "name": "John McCarrick",
      "character": "Mayor"
    },
    {
      "id": "nm7249536",
      "name": "Hugh Gallagher",
      "character": "Senior Guard"
    },
    {
      "id": "nm1739676",
      "name": "Colm Gormley",
      "character": "Guard"
    },
    {
      "id": "nm3335274",
      "name": "John Colleary",
      "character": "Guard"
    },
    {
      "id": "nm6682318",
      "name": "Shane Cullen",
      "character": "Guard"
    },
    {
      "id": "nm7249537",
      "name": "Joe Lafferty",
      "character": "Guard"
    },
    {
      "id": "nm7249538",
      "name": "Tom Colsh",
      "character": "Guard"
    },
    {
      "id": "nm8684584",
      "name": "Shane Cronogue",
      "character": "Shane"
    },
    {
      "id": "nm5464542",
      "name": "Sean Fox",
      "character": "(as Paul Fox)"
    },
    {
      "id": "nm8247164",
      "name": "Dorothy Jones",
      "character": "Dancer (Jennifer Healy)"
    }
  ],
  "overview": "In the 1930s political activist Jimmy Gralton is deported from Ireland during the 'Red Scare'.",
  "storyline": "1932. Jimmy Gralton is back home in the Irish countryside after ten years of forced exile in the USA. His widowed mother Alice is happy, Jimmy's friends are happy, all the young people who enjoy dancing and singing are happy. Which is not the case of Father Sheridan, the local priest, nor of the village squire, nor of Dennis O'Keefe, the chief of the fascists. The reason is simple: Jimmy is a socialist activist. So when the \"intruder\" reopens the village hall, thus enabling the villagers to gather to sing, dance, paint, study or box, they take a dim view of the whole thing. People who think and unite are difficult to manipulate, aren't they? From that moment on they will use every means possible to get rid of Jimmy and his \"dangerous\" hall.",
  "plot": "In 1932, after ten years in the United States, Jimmy Gralton returns to his native Ireland to help his mother run the family farm. A new government is in power in Ireland ten years after the end of the Civil War. To meet the needs of the young people of County Leitrim, Jimmy, in spite of his reluctance to cause upset to his old enemies (the Church and the local landowners), decides to reopen the \"Hall\", a young people's centre, free and open to all, where the local young people meet to dance, study or talk. Success comes quickly, but the growing influence of Jimmy and his radical ideas are not to the taste of everyone in the village.\n\nThe film centres around political tensions between the Catholic church, the state and the republican movement to which Jimmy through his pre-emigration history is connected. Jimmy's political alignment is central to the film, he suffers for being a free-thinker and committed to the liberation of ordinary people through education and also by having experience from America of jazz (the rhythms and passions of \"darkest Africa\" are warned against in one church sermon warning of the perils of the \"Hall\"). Jimmy is aligned to communism by the communist support and encourage participation in the study and dancing that evolve as key activities at the \"Hall\".\n\nThe power and hypocrisy of the church is demonised in the film by aligning it to the beating by her father of a free spirited young girl who laughs at the priest while she is named and shamed for attending a dance at the Hall in a church service. The pious religion of Jimmy's mother is also contrasted against her love of learning and ability to explore popular non-religious literature, which has aligned her family to Communism for liberation of working people. It is clear throughout the film that Jimmy and his mother are not aligned to any struggle above and beyond the necessities of their local community; however, this does bring them into involvement with attempting to prevent an eviction of a family who are displaced from their home.\n\nThis eviction and the assertive reinstatement of the family along with Jimmy's support and oratory to those gathered at the reinstatement draw him to the attention of the Gardaí. This starts a chain of events which ends in Jimmy's expulsion from Ireland based on the flimsy premise that he holds a US passport and that political agitators have previously been expelled from the country on such grounds. The lack of a fair trial is emphatically explained in the film by a speech given by Jimmy's mother at a rally surrounding the expulsion.\n\nThe behaviour of the state's police is shown and explained to be occurring at a time when Stalin was in full control of the Soviet Union and it is obvious that the state and church are fearful of forces that threaten to destroy them. It is this tension between the ideals of Christianity and the fear of the church and its natural tendency to be reactionary that is the central issue that the film explores.",
  "synopsis": "In 1932, after ten years in the United States of America, Jimmy Gralton returns to his native Ireland to help his mother run the family farm. A new government is in power in Ireland ten years after the end of the Civil War. To meet the needs of the young people of County Leitrim, Jimmy, in spite of his reluctance to cause upset to his old enemies (the Church and the local landowners), decides to reopen the 'Hall', a young people's centre, free and open to all, where the local young people meet to dance, study or talk. Success comes quickly, but the growing influence of Jimmy and his radical ideas is not to the taste of everyone in the village."
}