{
  "imdb_id": "tt3146360",
  "tmdb_id": "204668",
  "douban_id": null,
  "title": "Belle & Sebastian (2013)",
  "genres": [
    "Adventure",
    "Drama",
    "Family"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "104 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm1534640",
      "name": "Nicolas Vanier"
    }
  ],
  "writer": [
    {
      "id": "nm0758118",
      "name": "Juliette Sales",
      "description": "screenplay adaptation dialogue &"
    },
    {
      "id": "nm0836830",
      "name": "Fabien Suarez",
      "description": "screenplay adaptation dialogue &"
    },
    {
      "id": "nm1534640",
      "name": "Nicolas Vanier",
      "description": "screenplay adaptation dialogue"
    },
    {
      "id": "nm0041438",
      "name": "Cécile Aubry",
      "description": "original characters"
    }
  ],
  "cast": [
    {
      "id": "nm5904498",
      "name": "Félix Bossuet",
      "character": "Sébastien"
    },
    {
      "id": "nm0001409",
      "name": "Tchéky Karyo",
      "character": "César"
    },
    {
      "id": "nm2010399",
      "name": "Margaux Chatelier",
      "character": "Angélina"
    },
    {
      "id": "nm1151200",
      "name": "Dimitri Storoge",
      "character": "Docteur Guillaume"
    },
    {
      "id": "nm0133636",
      "name": "Urbain Cancelier",
      "character": "The Mayor"
    },
    {
      "id": "nm0682960",
      "name": "Andreas Pietschmann",
      "character": "Lieutenant Peter"
    },
    {
      "id": "nm0252653",
      "name": "Mehdi El Glaoui",
      "character": "André       (as Mehdi)"
    },
    {
      "id": "nm6391984",
      "name": "Paloma Palma",
      "character": "Esther"
    },
    {
      "id": "nm0012512",
      "name": "Karine Adrover",
      "character": "La mère d'Esther"
    },
    {
      "id": "nm1168266",
      "name": "Loïc Varraut",
      "character": "Le père d'Esther"
    },
    {
      "id": "nm1851604",
      "name": "Jan Oliver Schroeder",
      "character": "Soldat Hans       (as Jan-Oliver Schroeder)"
    },
    {
      "id": "nm2999907",
      "name": "Tom Sommerlatte",
      "character": "Soldat Erich"
    },
    {
      "id": "nm0198610",
      "name": "Andrée Damant",
      "character": "Célestine"
    },
    {
      "id": "nm0195747",
      "name": "Pasquale D'Inca",
      "character": "Le boucher"
    },
    {
      "id": "nm0815671",
      "name": "Eric Soubelet",
      "character": "Fabien"
    },
    {
      "id": "nm6391985",
      "name": "Michel Pellé",
      "character": "Le passeur"
    },
    {
      "id": "nm6391986",
      "name": "Jean Blanc",
      "character": "Habitant délogé"
    },
    {
      "id": "nm1824780",
      "name": "Matthieu Warter",
      "character": "Colonel allemand"
    },
    {
      "id": "nm6391987",
      "name": "Jean-Hubert Vasina",
      "character": "Soldat désespéré"
    },
    {
      "id": "nm6391988",
      "name": "Pascal Bison",
      "character": "Chasseur"
    },
    {
      "id": "nm6391989",
      "name": "Michel Claraz",
      "character": "Chasseur"
    },
    {
      "id": "nm6391990",
      "name": "Daniel Gainetdinoff",
      "character": "Chasseur"
    },
    {
      "id": "nm6391991",
      "name": "Célestin Personnaz",
      "character": "Chasseur"
    },
    {
      "id": "nm6391992",
      "name": "Jean-Michel Personnaz",
      "character": "Chasseur"
    },
    {
      "id": "nm6391993",
      "name": "Pierre Ferréol",
      "character": "Doublure Sébastien"
    },
    {
      "id": "nm9751439",
      "name": "Valentin Vincendet",
      "character": "Chasseur"
    },
    {
      "id": "nm6391994",
      "name": "Gilbert Suiffet",
      "character": "Doublure César"
    },
    {
      "id": "nm6391995",
      "name": "Yvann Lebedeff",
      "character": "Doublure Sébastien"
    },
    {
      "id": "nm6391996",
      "name": "Lonni Charrier",
      "character": "Doublure Sébastien"
    },
    {
      "id": "nm6391997",
      "name": "Gaspard Gogué Meunier",
      "character": "Doublure Sébastien"
    },
    {
      "id": "nm6391998",
      "name": "Emma Fogarolo",
      "character": "Doublure Esther"
    }
  ],
  "overview": "Belle and Sebastian is set high in the snowy Alps during the Second World War. The resourceful Sebastian is a lonely boy who tames and befriends a giant, wild mountain dog, Belle – even though the villagers believe her to be ‘the beast’ that has been killing their sheep.",
  "storyline": "In 1943, in the French Alps, the orphan Sébastien lives in a small village with his grandfather César, who is a shepherd, and his aunt Angélina, who is a baker. Sébastien misses his mother and believes she has traveled to America. He expects to get a watch with compass as a gift from her. The local Dr. Guillaume is a member of the Frech resistance that helps Jewish refugees to flee to Switzerland and the German Lieutenant Peter and troop are hunting down the resistance. When sheep are found slaughtered, César and the other residents believe that a stray dog that has been abused by his owner is the responsible and hunt it down. Sébastien finds the dog, gives the name of Belle to her and they become friends. But the animal is considered a beast by the inhabitants. Will Sébastien be capable to save Belle?",
  "plot": "In the French Alps, during the year 1943, Sébastien is a seven year old orphan boy living with César, an adoptive \"grandfather\" and his daughter, Angélina. The unusual little family lives in the small village of Saint-Martin, whose inhabitants, despite the German occupation, secretly organize the passage of Jewish exiles into Switzerland. The village is also plagued by a mysterious \"Beast\" who preys on the flocks of the shepherds and the inhabitants, including César's animals. Sébastien is a very lonely child who is suffering from the absence of his mother. He believes that she migrated \"to America, just over the mountains\", and spends all his days in the mountains. One day, on the way home, he meets a huge dog, wild and completely discredited: it is the so-called \"Beast\". Sébastien is not slow to make friends with the animal, a female livestock guardian dog, and names her \"Belle\" because he is struck by her beauty after she is cleaned up from the mud that she was coated with. Sébastien decides to keep his friendship with Belle a secret to protect her.\n\nMeanwhile, a German patrol, commanded by the ambiguous Lieutenant Peter Braun, arrives in Saint-Martin to put an end to the secret escape route of the Jews. Sébastien, during one of his trips along with Belle, collides with two of the soldiers; Belle responds by attacking and injuring one of the soldiers. Lieutenant Peter Braun orders the mayor of Saint-Martin to arrange a hunt to track down and kill the \"Beast\". Meanwhile, César discovers Sébastien's secret and is horrified. Knowing that Sébastien will try to prevent Belle from being shot, César gives the boy the wrong directions to the hunting area. But he is still able to interfere, at least for a while. Then César takes him out of the area, while the hunt goes on. César and the village men manage to find and hurt Belle. Sébastien escapes confinement, and finds the wounded dog and tries to help her. He is now furious with César, but asks for help from Dr. Guillaume, the village doctor and Angélina's boyfriend. After an initial hesitation, (and being prodded with a con from Sébastien) he agrees to treat Belle and saves her life.\n\nUnbeknownst to Sébastien, Dr. Guillaume is also the one who is responsible for escorting the Jews to the Swiss border. One evening, the doctor hides a family in a cave prior to a trip to the border, when the sound of wolves is heard in the valley. The doctor goes out as the wolves start causing a ruckus in the sheepfold. Guillaume slips and falls into the sheepfold as Belle bounds down out of nowhere and drives off the wolves. The doctor sits up and moans: his ankle is broken, he cannot walk. He finds a sled, lies down on it, and starts pawing his way to town when Belle stops him, picks up the rope, and begins to tow him. She takes him to Angélina's house where everyone except Sébastien and Guillaume is surprised by the dog. César instantly apologizes to Sébastien for wanting to kill Belle.\n\nGuillaume, who is now injured, can no longer lead the Jews and his place is taken by Angélina and Sébastien, who followed her and sneaked into the cave behind her. The boy befriends Esther, the daughter of the two refugees that Guillaume was to escort, and by talking with her, he discovers that César lied to him about where America truly is. That evening, Sébastien creeps back into town and sneaks into the schoolhouse to look at a map. Later, César discovers him in the schoolhouse and reveals the truth: his mother died while giving birth to him. César was present by chance and agreed to take care of Sébastien; he has so far been silent or preferring to lie to protect him. Sébastien is sad, but now he knows he can always count on César and he makes peace with him. It is Christmas Eve, and César gives him a treasured gift: a pocket watch with a compass, which will come in handy shortly.\n\nMeanwhile, the Germans realize that some Jews might try to escape on Christmas Day and begin to scour the mountain passes. Angélina and the Jews leave the cave, but the trip is cut short by Lieutenant Peter. He shouts to her, and she herds the family faster up the mountain. He shouts to her again, but all of them are suddenly overwhelmed by an avalanche caused by his shouts. Lt. Peter, when dug out of the snow, surprisingly warns her to take another route to reach the border because his soldiers are patrolling the mountain. Angélina is moved, and kisses the man. The only possible way now is dangerous and full of crevasses; Sébastien boasts that Belle, thanks to her sense of smell, will guide them. Not without difficulty, Belle, Sébastien and Angélina manage to escape from the Germans and to bring the Jews to Switzerland where they are greeted by a local guide. Here, Angélina reveals that she will go on to England to help win the war. She promises Sébastien that she will return once it's all over, leaving Belle and Sébastien to walk back home, all alone. The Swiss guide questions her if she is sure that he is able to make such a long, difficult journey on his own, but Angélina, in tears, replies that Sébastien is not all alone.",
  "synopsis": null
}