{
  "imdb_id": "tt3170902",
  "tmdb_id": "287628",
  "douban_id": null,
  "title": "Theeb (2014)",
  "genres": [
    "Adventure",
    "Drama",
    "Thriller"
  ],
  "country": "United Arab Emirates",
  "version": [
    {
      "runtime": "100 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm3578681",
      "name": "Naji Abu Nowar"
    }
  ],
  "writer": [
    {
      "id": "nm3578681",
      "name": "Naji Abu Nowar",
      "description": null
    },
    {
      "id": "nm2630722",
      "name": "Bassel Ghandour",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm6849498",
      "name": "Jacir Eid Al-Hwietat",
      "character": "Theeb       (as Jacir Eid)"
    },
    {
      "id": "nm7210549",
      "name": "Hassan Mutlag Al-Maraiyeh",
      "character": "The Stranger       (as Hassan Mutlag)"
    },
    {
      "id": "nm7210548",
      "name": "Hussein Salameh Al-Sweilhiyeen",
      "character": "Hussein       (as Hussein Salameh)"
    },
    {
      "id": "nm3484657",
      "name": "Jack Fox",
      "character": "Edward"
    },
    {
      "id": "nm8390140",
      "name": "Marji Audeh",
      "character": "Marji"
    },
    {
      "id": "nm8390141",
      "name": "Hmood Ali",
      "character": "Sheikh"
    },
    {
      "id": "nm8390142",
      "name": "Abdul Aziz Mousa",
      "character": "Suleiman"
    },
    {
      "id": "nm2922811",
      "name": "Baha Othman",
      "character": "Mulazim"
    },
    {
      "id": "nm8390144",
      "name": "Ali Omayan",
      "character": "Revolt Commander"
    },
    {
      "id": "nm8390145",
      "name": "Aswad Gasem",
      "character": "Revolt Officer"
    },
    {
      "id": "nm8390146",
      "name": "Ali Saleh",
      "character": "Revolter"
    },
    {
      "id": "nm8390147",
      "name": "Abdullah Atawi",
      "character": "Revolter"
    },
    {
      "id": "nm8390148",
      "name": "Suleiman Fraj",
      "character": "Revolter"
    },
    {
      "id": "nm8390149",
      "name": "Hisham Ahmand",
      "character": "Revolter"
    },
    {
      "id": "nm8390150",
      "name": "Ouday Hassan",
      "character": "Raider"
    },
    {
      "id": "nm8390151",
      "name": "Marwan Mohammad",
      "character": "Raider"
    },
    {
      "id": "nm8390152",
      "name": "Ali Al-Awaisheh",
      "character": "Ottoman Solider"
    },
    {
      "id": "nm8390153",
      "name": "Mohammad Al-Ugaily",
      "character": "Ottoman Solider"
    },
    {
      "id": "nm8390154",
      "name": "Khlali Abu Haltam",
      "character": "Ottoman Solider"
    },
    {
      "id": "nm8390155",
      "name": "Yaseer Al-Braji",
      "character": "Ottoman Solider"
    },
    {
      "id": "nm8390156",
      "name": "Maidi Asa'ad",
      "character": "Ottoman Solider"
    },
    {
      "id": "nm8390157",
      "name": "Mahmoud Ibrahim Odeh",
      "character": "Ottoman Solider"
    },
    {
      "id": "nm8390158",
      "name": "Thiab Yousef Jarrah",
      "character": "Ottoman Solider"
    },
    {
      "id": "nm8390159",
      "name": "Taha Ahmad Al-Radaideh",
      "character": "Ottoman Soldier"
    },
    {
      "id": "nm8390160",
      "name": "Nidal Shraim",
      "character": "Ottoman Soldier"
    },
    {
      "id": "nm8390161",
      "name": "Abdel Qader Salleg",
      "character": "Ottoman Soldier"
    },
    {
      "id": "nm8390162",
      "name": "Nasser Mohammed",
      "character": "Abu Ali"
    },
    {
      "id": "nm8390209",
      "name": "Safa Alazarat",
      "character": "Noaf"
    },
    {
      "id": "nm8390210",
      "name": "Oasem Nsser Sweilheen",
      "character": "Tribesman VO Actors"
    },
    {
      "id": "nm8390211",
      "name": "Ali Oassem Sweilheen",
      "character": "Tribesman VO Actors"
    },
    {
      "id": "nm8390212",
      "name": "Salm Eid Sweilheen",
      "character": "Tribesman VO Actors"
    },
    {
      "id": "nm8390213",
      "name": "Burak Wahib Ramadan",
      "character": "Turkish VO Actors"
    },
    {
      "id": "nm8390214",
      "name": "Saif Hamdan Al-Udwan",
      "character": "Turkish VO Actors"
    },
    {
      "id": "nm8390215",
      "name": "Mohamad Mansour Al-Zoubi",
      "character": "Turkish VO Actors"
    },
    {
      "id": "nm8390216",
      "name": "Mahmoud Eid Abu Zeid",
      "character": "Turkish VO Actors"
    },
    {
      "id": "nm8390217",
      "name": "Eyad Daher",
      "character": "Dead Body in Well"
    },
    {
      "id": "nm8390218",
      "name": "Fayez Sweilheen",
      "character": "Dead Body in Well"
    },
    {
      "id": "nm9225256",
      "name": "Abu Farouq",
      "character": "Farouq"
    }
  ],
  "overview": "In the Ottoman province of Hijaz during World War I, a young Bedouin boy experiences a greatly hastened coming of age as he embarks on a perilous desert journey to guide a British officer to his secret destination.",
  "storyline": "In the Ottoman province of Hijaz during World War I, a young Bedouin boy experiences a greatly hastened coming-of-age as he embarks on a perilous desert journey to guide a British officer to his secret destination.",
  "plot": "It is 1916. Recently orphaned brothers Hussein and Theeb, the second and third sons of a Bedouin sheik of the Howeitat tribe, come from a family of pilgrim guides, and are accustomed to a nomadic lifestyle. One night, their camp is visited by Edward, a British officer, and an Arab named Marji. The officer is carrying a wooden box, rumoured to contain gold, which raises Theeb's curiosity. Hussein is asked to guide them to a Roman well lying on the pilgrims' trail, next to the strategic Ottoman railway. Men at the camp warn that the trail is rife with bandits. Theeb wants to join, but his brother insists on leaving him behind. The next day as the group leaves, the boy disobeys his brother and follows them and manages to catch up after a day's walk. Despite objections from Hussein and Marji concerning Theeb's presence and fear for his safety, Edward is adamant on continuing their travel immediately, so Theeb stays with the group.\n\nAfter they reach the well, they discover that it is contaminated by blood from slaughtered bodies thrown into it. The group then notice that they are being watched by a group of men in the distance. They quickly escape, but Edward insists that they continue. Hussein leads them to another nearby well in a canyon, where they are ambushed. Edward and Marji are suddenly shot dead from a distance. Hussein and Theeb hide from the raiders; when night falls, another engagement with the raiders leaves Hussein dead. While trying to escape, Theeb trips and falls into the well. A raider cuts the water bag rope. He manages to climb up the next day, and finds himself stranded in the desert. The boy weeps for his murdered brother and buries him in the sand.\n\nTheeb spends the day wandering around the canyon, and eventually notices a camel heading towards him from the distance. He approaches the camel, and finds an unconscious man collapsed on top. The next day, Theeb wakes up to see the man staring at him. He is Hassan, a gravely injured mercenary who is one of the perpetrators of the massacre. Theeb is too small to get the camel to obey him, and Hassan is too injured too move. They are initially aggressive and hostile, but soon realise that they need each other's help to survive.\n\nTheeb spends some time with Hassan, feeding and healing him. Hassan asks Theeb not to betray him, considering how he let Theeb eat with him. The next day, the pair mount the camel and head towards an Ottoman rail station. They bump into Arab revolutionaries who ask Hassan questions regarding his modern Western belongings – they are looking for the British officer, who had coordinated an attack with them against the Ottomans on the Hejaz railway. Allowed to pass, the two continue towards the rail station. On their way there, they pass by a part of the railway where dozens of dead Arab revolutionaries lie. They had been waiting for the British officer, with his wooden box detonator, which was intended to blow up the railway. At the station, Hassan sells the Englishman's belongings to an Ottoman Chief in exchange for silver. When Theeb sees how Hassan sold the items, especially the wooden box, he is disgusted at Hassan's (a fellow Arabian's) betrayal to the Turks and decides to kill him. Young Theeb waits outside the station and shoots Hassan dead. The Ottoman chief lets the boy go after learning that Hassan had killed his brother, and Theeb rides off into the desert alone.",
  "synopsis": null
}