{
  "imdb_id": "tt3138166",
  "tmdb_id": "347841",
  "douban_id": null,
  "title": "Gone Doggy Gone (2014)",
  "genres": [
    "Adventure",
    "Comedy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "89 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.0,
  "director": [
    {
      "id": "nm0113960",
      "name": "Kasi Brown"
    },
    {
      "id": "nm0909988",
      "name": "Brandon Walter"
    }
  ],
  "writer": [
    {
      "id": "nm0113960",
      "name": "Kasi Brown",
      "description": null
    },
    {
      "id": "nm0909988",
      "name": "Brandon Walter",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0113960",
      "name": "Kasi Brown",
      "character": "Abby Harmon"
    },
    {
      "id": "nm0909988",
      "name": "Brandon Walter",
      "character": "Eliott Harmon"
    },
    {
      "id": "nm0993496",
      "name": "Kate Connor",
      "character": "Kat"
    },
    {
      "id": "nm2163625",
      "name": "Shaina Vorspan",
      "character": "Jill Tozer"
    },
    {
      "id": "nm0726223",
      "name": "Richard Riehle",
      "character": "Stan Janson"
    },
    {
      "id": "nm2448324",
      "name": "Jeff Sloniker",
      "character": "Dan Janson"
    },
    {
      "id": "nm5698663",
      "name": "Edward Winters",
      "character": "Devon"
    },
    {
      "id": "nm0913942",
      "name": "Marsha Waterbury",
      "character": "Ruth Tozer"
    },
    {
      "id": "nm5960710",
      "name": "Jordan Hendricks",
      "character": "Kent"
    },
    {
      "id": "nm1728804",
      "name": "Lizzie Peet",
      "character": "Zelda"
    },
    {
      "id": "nm4828384",
      "name": "Sina J. Henrie",
      "character": "Cowgirl"
    },
    {
      "id": "nm1116054",
      "name": "Mark Teich",
      "character": "Bob"
    },
    {
      "id": "nm1461071",
      "name": "Miles Stroth",
      "character": "Morty"
    },
    {
      "id": "nm5960712",
      "name": "Sara Olliver",
      "character": "Shelby Ramclam"
    },
    {
      "id": "nm4525535",
      "name": "Brett Maline",
      "character": "Doug"
    },
    {
      "id": "nm4418111",
      "name": "Elizabeth Lamboy-Wilson",
      "character": "Esmeralda"
    },
    {
      "id": "nm2197544",
      "name": "William Fix",
      "character": "Timmy"
    },
    {
      "id": "nm2682705",
      "name": "Jordan Lawson",
      "character": "Male Robber"
    },
    {
      "id": "nm5172067",
      "name": "Maggie De Leonardis",
      "character": "Hot Maid"
    },
    {
      "id": "nm5960715",
      "name": "Jenny Kurpil",
      "character": "Baby Mama"
    },
    {
      "id": "nm1483668",
      "name": "Kari Nissena",
      "character": "Command Center Chief"
    },
    {
      "id": "nm5960717",
      "name": "Sarah Rose Reynolds",
      "character": "Bike Messenger"
    },
    {
      "id": "nm4626323",
      "name": "Allison Lobel",
      "character": "Crying Vegetarian"
    },
    {
      "id": "nm5960714",
      "name": "Rumi Murakami",
      "character": "Stan's Secretary"
    },
    {
      "id": "nm0071661",
      "name": "Charles Edward Bennett",
      "character": "Policeman 1"
    },
    {
      "id": "nm3128529",
      "name": "Erik Clabeaux",
      "character": "Policeman 2"
    },
    {
      "id": "nm5321120",
      "name": "William Mulligan",
      "character": "Bartender"
    },
    {
      "id": "nm7016829",
      "name": "Rebecca Hochman-Fisher",
      "character": "Child on Playground"
    }
  ],
  "overview": "Gone Doggy Gone is a comedic feature about a couple stuck in a lack-luster marriage who treat their dog like a baby. Working the grind in LA they leave little time for each other, and what free time they have they spend doting on the dog... until it gets kidnapped. What ensues is an outlandish cat-and-mouse adventure as they hunt down the kidnapper, enlist a schlubby PI, find a renewed love of each other, and conquer their fear of parenthood.",
  "storyline": "Gone Doggy Gone is a comedic feature about a couple stuck in a lack-luster marriage who treat their dog like a baby. Working the grind in LA they leave little time for each other, and what free time they have they spend doting on the dog... until it gets kidnapped. What ensues is an outlandish cat-and-mouse adventure as they hunt down the kidnapper, enlist a schlubby PI, find a renewed love of each other, and conquer their fear of parenthood.",
  "plot": "When Owen (Luke Benward) and his distracted older sister, Lilly (Brittany Curran), are alone and their parents are away, Owen delivers the paper, dodges a school bully, and spends afternoons in a forest hideaway spinning tall tales and making inventions. He encounters three thugs named Blackie (French Stewart), Bud (Kevin Farley) and Arty (Kelly Perine) who have a mistreated dog and Owen's life changes.\n\nUnbeknownst to Owen, the thugs have previously committed a diamond heist and supposedly hid the stolen diamonds on the dog's collar. With Owen's help, the dog escapes from the thugs and Owen bonds with the golden retriever whom he names Diamond. When he reads a newspaper account about the thugs' diamond heist, he soon realizes about how they are the chief suspects and how they hid the diamonds on Diamond.\n\nHe takes her to the police, but the police believe that the story is not true. So Owen decides to look after Diamond. He hides her at his forest hideaway and visits her often to feed her and comfort her. Meanwhile, the thugs are searching for Owen and Diamond. Owen rigs his hideaway in the forest with booby traps for the thugs. As he heads back to his house, he is caught by the thugs, but Owen manages to escape from their grasp. He runs into the woods with Diamond and the thugs give chase. They trace Owen to his hideway and search the whole area from him, but end up setting off Owen's booby traps one by one. At one point, Blackie finally catches Owen.\n\nThe thugs tie Owen to a chair at the hideaway, while the thugs inspect Diamond for the diamonds. Blackie notices a band-aid on Diamond's stomach that Owen previously put on her and suspects Owen did something to Diamond. When Blackie orders Owen to show him where he hid the diamonds, he leads them to a canoe trailer and claims he hid them in it. Bud and Arty jump into the canoe to find the diamonds and become glued to their seats of the canoe, as part of Owen's booby traps. But the two find the collar in the canoe and toss him to Blackie, but he becomes annoyed. He tells Owen he actually hid the stolen diamonds in Diamond's stomach, not on her collar. Diamond becomes sick when the diamonds in her stomach fall down to her intestines. And Blackie ends up being thrown into the canoe with Bud and Arty by the \"Mad Man of the Mountain\" and they roll down the hill in the trailer into town, where they eventually stop at a Mexican food restaurant. But they soon find themselves next to some policeman, who see the thugs whom they recognize from the diamond heist and arrest them.\n\nOwen comes home with Diamond sick, and he asks his sister for help. Owen and his parents are at the vet to comfort Diamond, who just had the stolen diamonds removed from her. Owen learns the truth about the \"Mad Man of the Mountain;\" he was a man who tried to save his family in a fire, but failed, and his vocal chords were burned up. Owen goes up the mountain and gives Diamond to the man, who thanks Owen from afar.",
  "synopsis": null
}