{
  "imdb_id": "tt3169710",
  "tmdb_id": "274483",
  "douban_id": null,
  "title": "Fool Circle (2014)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm3431390",
      "name": "Vincent Mariette"
    }
  ],
  "writer": [
    {
      "id": "nm3431390",
      "name": "Vincent Mariette",
      "description": null
    },
    {
      "id": "nm2099207",
      "name": "Vincent Poymiro",
      "description": "contributing writer"
    }
  ],
  "cast": [
    {
      "id": "nm0756203",
      "name": "Ludivine Sagnier",
      "character": "Chloé"
    },
    {
      "id": "nm0480850",
      "name": "Laurent Lafitte",
      "character": "Léon Camus"
    },
    {
      "id": "nm0531195",
      "name": "Vincent Macaigne",
      "character": "Bruno Camus"
    },
    {
      "id": "nm0527852",
      "name": "Noémie Lvovsky",
      "character": "Rebecca"
    },
    {
      "id": "nm0721469",
      "name": "Dominique Reymond",
      "character": "Claude"
    },
    {
      "id": "nm0044386",
      "name": "Anne Azoulay",
      "character": "Florence"
    },
    {
      "id": "nm0714235",
      "name": "Philippe Rebbot",
      "character": "Yvan"
    },
    {
      "id": "nm5697371",
      "name": "Délia Espinat-Dief",
      "character": "Lola"
    },
    {
      "id": "nm6563686",
      "name": "Emile Baujard",
      "character": "Jérôme Camus"
    },
    {
      "id": "nm4965045",
      "name": "Théo Cholbi",
      "character": "Guillaume"
    },
    {
      "id": "nm5648710",
      "name": "Thomas De Pourquery",
      "character": "Le gardien de l'hôtel"
    },
    {
      "id": "nm5809559",
      "name": "Lock Mosoner",
      "character": "Le caissier"
    },
    {
      "id": "nm6563687",
      "name": "Malva Benredjem",
      "character": "Danseuse station-service 1"
    },
    {
      "id": "nm6570100",
      "name": "Alizée Fischer",
      "character": "Danseuse station-service 2"
    },
    {
      "id": "nm6570101",
      "name": "Guillaume Benoît",
      "character": "Jeune du lac 1"
    },
    {
      "id": "nm6570102",
      "name": "Lauren Bacquet",
      "character": "Jeune du lac 2"
    }
  ],
  "overview": "Two, very different, brothers are reunited for their father's funeral. But, when they arrive at the crematorium nobody is there, not even the corpse, except for Chloe who introduces herself as their sister.",
  "storyline": "Good news for Léon and Bruno, their (unworthy) father has just died! The two brothers, very different from each other, are reunited in some dead loss in the Savoie for the funeral. But at the crematorium, nobody, not even the corpse of their (hated) dad! Well not quite nobody: one girl, a certain Chloe is waiting for them. And there is one more surprise in store for the two brothers: Chloé introduces herself as... their sister!",
  "plot": "A Russian plumber, Dima Nikitin, is also a municipal repair-crew chief, and studying building engineering, in an unnamed Russian town that is not yet 40 years old. Some of the city’s housing blocks are already in a grave state of disrepair. A burst bathroom pipe in one of the rickety communal housing buildings reveals a much larger problem, as the exterior wall behind the pipe has cracked and started to shift. When Nikitin goes outside to inspect the matter, he realizes the building has fissured from the ground up to the ninth and last floor.\n\nThough it’s not officially part of his district, Nikitin’s sense of personal responsibility leads him to go in the middle of the night to find and alert the authorities of his belief that the building will collapse in less than 24 hours. Nikitin races to the 50th birthday party of Nina Galaganova, the town’s imperious mayor, to convince her to evacuate the building. He bypasses his direct boss Fedotov, the corrupt inspector of public housing, who applied only a coat of paint the last time he received funds for a major overhaul of his projects; he had stolen the money to use on expanding his daughter's personal residence. Galaganova conducts an extended, behind-closed-doors meeting with Nikitin, Fedotov and heads of several other departments, including the fire brigade chief, Matugin. The intense gathering takes place in a room next to the hotel restaurant where Nina’s birthday party is in full swing, with loud music filtering into the meeting room.\n\nGalaganova sends Fedotov and Matugin to assess the damage with Nikitin. The officials soon accept that the building will indeed fall, and return to report this to the mayor. They all realize that an evacuation of this scale would cause a financial review, and reveal years of embezzlement. Arrangements begin to evacuate the inhabitants, but the mayor calls them off, seeking temporary housing for her residents in a nearby suburb. The manager of the blocks of houses refuses to accept the people. Bogachyov, another corrupt official, threatens her job and reminds her that he had helped Galaganova get elected to office and improve her status in life.\n\nGalaganova and Bogachyov decides to pin the expected building collapse on Fedotov and Matugin. Together with Nikitin, Fedotov and Matugin are instructed by Sayapin, the police chief, that arrangements are being made for evacuation. The trio are put into a police van and taken allegedly to meet Galaganova, but instead they are driven to a remote location on the city outskirts. It becomes clear to them that Galaganova is covering her tracks by eliminating them, to pin the eventual collapse of the building on them. Fedotov pleads with the policemen to release Nikitin and they reluctantly agree, instructing him to leave the city with his family immediately. Matugin and Fedotov are executed.\n\nNikitin takes his wife and son and drives away, believing that the building is being evacuated. However, as they drive past it, Nikitin realizes that no attempts at evacuation are being made. His wife is fearful and wants to leave immediately, but Nikitin is angry and tells her to leave him forever. Nikitin decides to stay and help the residents even if his life is at stake. The wife drives off, leaving Nikitin behind. Knowing Nikitin's actions, his parents feel sorry for him and ask him to forgive them for not equipping him to live with and through the reality of the world.\n\nEarly morning, Nikitin rushes into the building and evacuates the inhabitants one by one, telling them that the building is about to collapse. Eventually, he gets everyone out of the building, but after seeing nothing has happened, the tenants beat Nikitn and return to their flats, leaving him unconscious on the sidewalk.",
  "synopsis": null
}