{
  "imdb_id": "tt3175286",
  "tmdb_id": "224409",
  "douban_id": null,
  "title": "Ezhamathe Varavu (2013)",
  "genres": [
    "Family"
  ],
  "country": "India",
  "version": [],
  "imdb_rating": 5.9,
  "director": [
    {
      "id": "nm0363030",
      "name": "T. Hariharan"
    }
  ],
  "writer": [
    {
      "id": "nm0619760",
      "name": "M.T. Vasudevan Nair",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1418952",
      "name": "Bhavana",
      "character": "Bhanu"
    },
    {
      "id": "nm0541126",
      "name": "Mammukoya",
      "character": "Nagu"
    },
    {
      "id": "nm1011348",
      "name": "Indrajith Sukumaran",
      "character": "Gopinath       (as Indrajith)"
    },
    {
      "id": "nm0898913",
      "name": "Vineeth",
      "character": "Prasad"
    }
  ],
  "overview": "Set in the forests of Wayanad, Ezhamathe Varavu is a multilayered story that delineates the link between man and nature. It revolves around three principal characters — a planter, his wife and his friend. Gopi, a wealthy planter is an Alpha male, a hunter who assumes he knows the jungle and its creatures. Bhavana plays his long-suffering wife, who craves for his company and affection. Into their turbulent marriage comes Vineeth, an archaeologist on a dig in Wayanad. He turns out to be her college beau. Kavitha plays a tribal who introduces Vineeth to the forests and its inhabitants.",
  "storyline": "This film helmed by the hitmaker duo MT and Hariharan is about the life of a hunter(Indrajith) who expects the arrival of a nuisance causing tiger in a remote village.He is interrupted when his wife's old love affair comes to live with them(vineeth).The rest forms the plot of the movie.",
  "plot": "Set in the forests of Wayanad, Ezhamathe Varavu is a multilayered story that delineates the link between man and nature. It revolves around three principal characters&#160;— a planter, his wife and his friend. Gopi, a wealthy planter is an Alpha male, a hunter who assumes he knows the jungle and its creatures. Bhavana plays his long-suffering wife, who craves for his company and affection. Into their turbulent marriage comes Vineeth, an archaeologist on a dig in Wayanad. He turns out to be her college beau. Kavitha plays a tribal who introduces Vineeth to the forests and its inhabitants.",
  "synopsis": null
}