{
  "imdb_id": "tt3174376",
  "tmdb_id": "301804",
  "douban_id": null,
  "title": "Before I Wake (2016)",
  "genres": [
    "Drama",
    "Fantasy",
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.1,
  "director": [
    {
      "id": "nm1093039",
      "name": "Mike Flanagan"
    }
  ],
  "writer": [
    {
      "id": "nm1093039",
      "name": "Mike Flanagan",
      "description": null
    },
    {
      "id": "nm3670452",
      "name": "Jeff Howard",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0098378",
      "name": "Kate Bosworth",
      "character": "Jessie"
    },
    {
      "id": "nm0005048",
      "name": "Thomas Jane",
      "character": "Mark"
    },
    {
      "id": "nm5016878",
      "name": "Jacob Tremblay",
      "character": "Cody"
    },
    {
      "id": "nm0001272",
      "name": "Annabeth Gish",
      "character": "Natalie"
    },
    {
      "id": "nm6078796",
      "name": "Topher Bousquet",
      "character": "Canker Man"
    },
    {
      "id": "nm0005231",
      "name": "Dash Mihok",
      "character": "Whelan"
    },
    {
      "id": "nm0439813",
      "name": "Jay Karnes",
      "character": "Peter"
    },
    {
      "id": "nm0629634",
      "name": "Lance E. Nichols",
      "character": "Detective"
    },
    {
      "id": "nm6153272",
      "name": "Antonio Evan Romero",
      "character": "Sean       (as Antonio Romero)"
    },
    {
      "id": "nm4152381",
      "name": "Kyla Deaver",
      "character": "Annie"
    },
    {
      "id": "nm6416506",
      "name": "Hunter Wenzel",
      "character": "Tate"
    },
    {
      "id": "nm2174090",
      "name": "Scottie Thompson",
      "character": "Teacher"
    },
    {
      "id": "nm1544655",
      "name": "Jason Alan Smith",
      "character": "Vice Principal"
    },
    {
      "id": "nm0689187",
      "name": "Michael Polish",
      "character": "Charlie"
    },
    {
      "id": "nm0614861",
      "name": "Brett Murray",
      "character": "Uniformed Officer       (as Brett Luciana Murray)"
    },
    {
      "id": "nm1092778",
      "name": "Natalie Roers",
      "character": "Katie"
    },
    {
      "id": "nm4033048",
      "name": "Erika Hoveland",
      "character": "Nurse"
    },
    {
      "id": "nm0055499",
      "name": "Avis-Marie Barnes",
      "character": "Home Director"
    },
    {
      "id": "nm1352905",
      "name": "Courtney Bell",
      "character": "Andrea"
    },
    {
      "id": "nm6113975",
      "name": "Rigby Flanagan-Bell",
      "character": "Young Cody"
    },
    {
      "id": "nm1653291",
      "name": "Justin Gordon",
      "character": "Doctor Tennant"
    },
    {
      "id": "nm4351877",
      "name": "Kelsey Phillips",
      "character": "Stand-In Jessie"
    },
    {
      "id": "nm8934084",
      "name": "Thad Watkins",
      "character": "Stand-In Mark"
    },
    {
      "id": "nm7722465",
      "name": "Heather Rogers",
      "character": "Stand-In Cody"
    },
    {
      "id": "nm6629680",
      "name": "Ben Jacobs",
      "character": "Stand-In Canker Man"
    },
    {
      "id": "nm1573268",
      "name": "Dyer Scott Lumpkin",
      "character": "Chrysalis Kids       (as Dyer Lumpkin)"
    },
    {
      "id": "nm8934085",
      "name": "Hallie Ryals",
      "character": "Chrysalis Kids"
    },
    {
      "id": "nm6529150",
      "name": "Thad August",
      "character": "Therapy patient"
    },
    {
      "id": "nm6148547",
      "name": "Aurora Blue",
      "character": ""
    },
    {
      "id": "nm8338781",
      "name": "Virginia Dru Bramblett",
      "character": "Four-square girl, student"
    },
    {
      "id": "nm9824185",
      "name": "Keenen S. Crook",
      "character": "Nurse"
    },
    {
      "id": "nm6132132",
      "name": "Angel Ellis",
      "character": "Mental Patient       (rumored)"
    },
    {
      "id": "nm10357110",
      "name": "Hali Everette",
      "character": "School Mate"
    },
    {
      "id": "nm6244711",
      "name": "Ginger McNamara",
      "character": "Hospital Guest"
    },
    {
      "id": "nm5273037",
      "name": "Jack Teague",
      "character": "Physcian in Mental Ward Dayroom"
    }
  ],
  "overview": "About an orphaned child whose dreams - and nightmares - manifest physically as he sleeps.",
  "storyline": "In this intense and heart pounding supernatural thriller, Jessie (Kate Bosworth) and Mark (Thomas Jane) decide to take in a sweet and loving 8-year-old boy, Cody. Unbeknownst to them, Cody is terrified of falling asleep. At first, they assume his previous unstable homes caused his aversion to sleep, but soon discover why: Cody's dreams manifest in reality as he sleeps. In one moment they experience the incredible wonder of Cody's imagination, and in the next, the horrific nature of his night terrors. To save their new family, Jessie and Mark embark on a dangerous hunt to uncover the truth behind Cody's nightmares.",
  "plot": "The movie begins with a frightened man with a gun and a sleeping child. Trembling and perspiring, the man nervously enters the child's room . He looks around, as if searching for something that he expects to reveal itself in the shadows, then a sudden commotion makes him pull the trigger. The gunfire awakens the child and the man breaks down in tears, saying that he can't do it.\n\nLater, Jessie (Kate Bosworth) and Mark (Thomas Jane) Hobson adopt a new foster child, eight-year-old Cody Morgan (Jacob Tremblay), after their young son Shawn dies suddenly. They soon find out that Cody's dreams become reality, but his nightmares are quite deadly.\n\nOn his first night, the couple are amazed as multicolored butterflies flutter across the living room, emitting a strong glow. Mark tries to capture one to show to Cody, as he likes butterflies. However, Cody wakes up and the butterflies disappear. The following day, he goes to school and finds a friend in a girl, and hostility from a mean kid. At home, Cody asks Mark who the kid in the picture was and Mark replies that he was their son, and that his name was Shawn. Cody asks about his whereabouts, to which Jessie replies that he is in heaven, and Cody tells her that that's where his mom is too. That night, the couple see their deceased child and try to hug him. Cody wakes up and Shawn disappears.\n\nUpon discovering the amazing gift that Cody has, Jessie takes advantage of it. She lets Cody watch home videos of Shawn and then that night, the couple once again sees their beloved child. Days later, Mark notices the addiction that his wife has found and confronts her, telling her that she is just using Cody for his gift instead of loving him, which results in them arguing and Mark taking down the pictures of Shawn.\n\nCody falls asleep at school, and a nightmarish creature, who Cody calls \"The Canker Man\", appears before the mean kid, as the girl he's befriended watches in horror. Meanwhile Jessie goes to a doctor and expresses her complaints about her foster child not going to bed, to which the doctor prescribes medication. She mixes it with his drink, unbeknownst to her husband. That night Shawn once again appears before them, but turns into a nightmarish creature. Mark tries to wake Cody up but can't. Jessie confesses that she drugged the boy. The creature devours Mark as Jessie is thrown across the room and falls unconscious. She wakes up with Cody on the phone calling for help, as he found her lying on the floor. Suspecting it to be domestic violence, and knowing of the boy being drugged to sleep, social services takes Cody away.\n\nJessie steals Cody's social worker's files and talks to Cody's former foster parent, who took care of him for at least fifteen months. He reveals that, with butterflies appearing seemingly out of nowhere, Cody's dreams started to become reality. More and more of Cody's dreams came true, including that of the couple's deceased child. When the man's wife got sick, Cody became upset and that night, \"The Canker Man\" appeared and took her. Shocked and heartbroken, the former parent showed Cody all the couple's pictures in hopes him of recreating her in his dreams. However, what resulted was a poor copy of the wife, since Cody was too young to remember her face fully. The parent urges Jessie to kill Cody; not willing to give in, she digs more into Cody's background and finds more about his mother through several records. Finally, she goes to the orphanage where Cody was staying. In the orphanage, the staff notices that Cody has not been sleeping for the past 2 days. That night, the boy is given a tranquilizer to make him sleep, to which he helplessly protests. Jessie arrives to find the place dark and isolated. She witnesses nightmarish versions of people in every room, including that of Shawn, Cody and his foster family. She finally finds where Cody is, but before she can go near him, she is thrown across the hallway by the tall, slender nightmare creature. She pulls out a pillow shaped like a blue butterfly, hugs the creature, and as she holds it, it takes the form of Cody and disappears. Jessie places the butterfly shaped pillow on the sleeping child's chest and carries him out of the room. Along the way, she whispers to Cody and asks him to release all the people the creature has imprisoned. The nightmare then turns into a beautiful dream, and all the people taken hostage by \"The Canker Man\" are released. When the supervisor confronts her, she lets her take the still-unconscious boy home.\n\nThe following day, Jessie gives Cody the journal his birth mother Andrea had kept, which shows how much she had loved him and his gift of lucid dreaming. However, she had died of pancreatic cancer when Cody was just six years old, which resulted in his anxiety, which occurs when people get sick. At bedtime, Cody asks Jessie to tell him a story. She tells him about a gifted boy who needed a mother, and a lonely mother who needed a child. Her story also tells about a mean kid who woke up, a couple which reunited, and the father who met his son. When Cody asks her if these will come true, she tells him that it is up to him to decide, since there is more to his dreams than meets the eye.",
  "synopsis": null
}