{
  "imdb_id": "tt3175460",
  "tmdb_id": "285960",
  "douban_id": null,
  "title": "Coffee Please (2013)",
  "genres": [
    "Romance"
  ],
  "country": "Thailand",
  "version": [
    {
      "runtime": "105 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm3632558",
      "name": "Genwaii Thongdenok"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm1370362",
      "name": "Joy Chonticha",
      "character": "Ying"
    },
    {
      "id": "nm4337367",
      "name": "Anna Chuancheun",
      "character": ""
    },
    {
      "id": "nm6926869",
      "name": "Akkaphan Namart",
      "character": "Noom"
    },
    {
      "id": "nm1115138",
      "name": "Somlek Sakdikul",
      "character": "Amorn"
    },
    {
      "id": "nm4283498",
      "name": "Akamsiri Suwannasuk",
      "character": "Fay"
    },
    {
      "id": "nm5982286",
      "name": "Ravit Terdwong",
      "character": "Toh"
    }
  ],
  "overview": "A man who wants to become a barrister falls for an architect, while another man heads up north to pursue a dream of starting a coffee plantation, where he meets a woman who shares his passion.",
  "storyline": null,
  "plot": "Will (Glenn Howerton) is a website manager for an electronics company who uses his local coffee house, Coffee Town, as his own personal office. When the corporate owners of the shop have plans to convert the coffee house into a modern Coffee Town and Bistro, Will enlists the help of his two best friends – lighting salesman Chad (Steve Little) and local police officer Gino (Ben Schwartz) – to save his office. In order to thwart the plans of Coffee Town's corporate owners, the trio plan to stage a robbery, creating the illusion of a crime-riddled neighborhood that is not suitable for a bistro. However, standing in Will's way is Sam (Josh Groban), a disgruntled barista with big dreams of being a rock star. Meanwhile, Will tries his best to court his coffee house crush Becca (Adrianne Palicki), an ER Trauma Nurse.",
  "synopsis": null
}