{
  "imdb_id": "tt3125472",
  "tmdb_id": "259943",
  "douban_id": null,
  "title": "Coming Home (2014)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "China",
  "version": [
    {
      "runtime": "109 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm0955443",
      "name": "Yimou Zhang"
    }
  ],
  "writer": [
    {
      "id": "nm0945802",
      "name": "Geling Yan",
      "description": "based on the novel by"
    },
    {
      "id": "nm1802940",
      "name": "Jingzhi Zou",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0000084",
      "name": "Li Gong",
      "character": "Feng Wanyu"
    },
    {
      "id": "nm0155203",
      "name": "Daoming Chen",
      "character": "Lu Yanshi"
    },
    {
      "id": "nm6517324",
      "name": "Huiwen Zhang",
      "character": "Dan Dan, the daughter"
    },
    {
      "id": "nm0849919",
      "name": "Tao Guo",
      "character": "Officer Liu"
    },
    {
      "id": "nm1106713",
      "name": "Ni Yan",
      "character": "Officer Li"
    },
    {
      "id": "nm5149335",
      "name": "Chun Li",
      "character": "Cui Meifang"
    },
    {
      "id": "nm1289005",
      "name": "Jia-yi Zhang",
      "character": "Doctor Dai"
    },
    {
      "id": "nm0514988",
      "name": "Peiqi Liu",
      "character": "Officer Liu"
    },
    {
      "id": "nm0227621",
      "name": "Jiali Ding",
      "character": "Mr. Fang's wife"
    },
    {
      "id": "nm1249409",
      "name": "Bai Qing Xin",
      "character": "Officer Ballet School"
    },
    {
      "id": "nm3422245",
      "name": "Feng Zu",
      "character": "Officer Deng"
    },
    {
      "id": "nm1148166",
      "name": "Xiaoyi Chen",
      "character": "Gong Suzhen"
    }
  ],
  "overview": "Lu and Feng are a devoted couple forced to separate when Lu is arrested and sent to a labor camp as a political prisoner during the Cultural Revolution. He finally returns home only to find that his beloved wife no longer remembers him.",
  "storyline": "Lu Yanshi (Chen Daoming) and Feng Wanyu (Gong Li) are a devoted couple forced to separate when Lu is arrested and sent to a labor camp as a political prisoner, just as his wife is injured in an accident. Released during the last days of the Cultural Revolution, he finally returns home only to find that his beloved wife has amnesia and remembers little of her past. Unable to recognize Lu, she patiently waits for her husband's return. A stranger alone in the heart of his broken family, Lu Yanshi determines to resurrect their past together and reawaken his wife's memory.",
  "plot": "The story is adapted from the novel, The Criminal Lu Yanshi (陆犯焉识; 陸犯焉識) written by novelist Geling Yan.\n\nLu Yanshi (陆焉识; 陸焉識, \"Yanshi\" literally means \"how to recognize\") was a professor before being sent to the labor camp (laogai, literally \"reform through labor\") during the Cultural Revolution. He escaped from the labor camp in Xining to meet his long-missed wife Feng Wanyu (冯婉瑜; 馮婉瑜) and daughter Dandan (Chinese: 丹丹). However, the police were already waiting outside the house to arrest him.\n\nDandan, who was then a teenage ballerina, could not play the leading role in Red Detachment of Women due to her father's outlaw status. Under the temptation of regaining the leading role, Dandan revealed her parents' secret meeting plan to the police. The meeting ended with the capture of Lu but Dandan still didn't get the leading role. After the end of the Cultural Revolution, Lu came home only to find his broken family, his wife suffering from amnesia and his daughter working as textile worker. Under the shock of a former official's sexual harassment, his wife sometimes recognized him as Officer \"Fang\" instead of being her husband.\n\nTo reawaken his wife's memory, Lu played out as a total stranger just to be near with his wife. Although she recognized him as a letter reader or a piano tuner, he never could be able to be close enough to live with his chaste wife. During these years, Lu continued to write to his wife as a way of communicating with her, and to convince his wife to forgive their daughter.\n\nThe movie ended with Feng waiting to receive her husband outside the railway station and Lu standing with her on a snowy day, pretending to be pedicab driver.",
  "synopsis": "Lu Yanshi (Chen Daoming) and Feng Wanyu (Gong Li) are a devoted couple forced to separate when Lu is arrested and sent to a labor camp as a political prisoner, just as his wife is injured in an accident. Released during the last days of the Cultural Revolution, he finally returns home only to find that his beloved wife has amnesia and remembers little of her past. Unable to recognize Lu, she patiently waits for her husband's return. A stranger alone in the heart of his broken family, Lu Yanshi determines to resurrect their past together and reawaken his wife's memory."
}