{
  "imdb_id": "tt3181776",
  "tmdb_id": "346808",
  "douban_id": null,
  "title": "Momentum (2015)",
  "genres": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "country": "South Africa",
  "version": [
    {
      "runtime": "96 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.5,
  "director": [
    {
      "id": "nm0132120",
      "name": "Stephen S. Campanelli"
    }
  ],
  "writer": [
    {
      "id": "nm0546057",
      "name": "Adam Marcus",
      "description": "written by &"
    },
    {
      "id": "nm0838032",
      "name": "Debra Sullivan",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0000151",
      "name": "Morgan Freeman",
      "character": "Senator"
    },
    {
      "id": "nm1385871",
      "name": "Olga Kurylenko",
      "character": "Alexis Faraday"
    },
    {
      "id": "nm0700856",
      "name": "James Purefoy",
      "character": "Mr. Washington"
    },
    {
      "id": "nm3089615",
      "name": "Jenna Saras",
      "character": "Jessica"
    },
    {
      "id": "nm2467118",
      "name": "Brett Williams",
      "character": "Male Teller"
    },
    {
      "id": "nm2674546",
      "name": "Daniel Fox",
      "character": "Amphetamine"
    },
    {
      "id": "nm5105990",
      "name": "Greg Kriek",
      "character": "Mr. Monroe"
    },
    {
      "id": "nm2056385",
      "name": "Karl Thaning",
      "character": "Doug MacArthur"
    },
    {
      "id": "nm0546057",
      "name": "Adam Marcus",
      "character": "Dinner Guest"
    },
    {
      "id": "nm4211367",
      "name": "Aidan Whytock",
      "character": "Captain de Lange"
    },
    {
      "id": "nm2592022",
      "name": "Scot Cooper",
      "character": "Officer #1"
    },
    {
      "id": "nm5953245",
      "name": "Lee Raviv",
      "character": "Little girl"
    },
    {
      "id": "nm6633794",
      "name": "Shelley Nicole",
      "character": "Ms. Clinton"
    },
    {
      "id": "nm1978748",
      "name": "Joe Vaz",
      "character": "Bank Manager"
    },
    {
      "id": "nm3376647",
      "name": "Brendan Sean Murray",
      "character": "Raymond Kelly       (as Brendan Murray)"
    },
    {
      "id": "nm0295474",
      "name": "Eva-Marie Fredric",
      "character": "Dinner Guest       (as E.M. Fredric)"
    },
    {
      "id": "nm1412503",
      "name": "Colin Moss",
      "character": "Kevin Fuller"
    },
    {
      "id": "nm1791638",
      "name": "Grant Roberts",
      "character": "Secret Service Agent"
    },
    {
      "id": "nm0421252",
      "name": "Stephen Jennings",
      "character": "International Anchor"
    },
    {
      "id": "nm2537706",
      "name": "Lee-Anne Summers",
      "character": "Penny Fuller"
    },
    {
      "id": "nm0838032",
      "name": "Debra Sullivan",
      "character": "Dinner Guest"
    },
    {
      "id": "nm2899434",
      "name": "Laurent Eyquem",
      "character": "Dinner Guest"
    },
    {
      "id": "nm0678431",
      "name": "Tudor Petrut",
      "character": "Government Official"
    },
    {
      "id": "nm3083788",
      "name": "Marian Frizelle",
      "character": "Dinner Guest"
    },
    {
      "id": "nm1786440",
      "name": "Sabine Palfi",
      "character": "Newscaster"
    },
    {
      "id": "nm5482481",
      "name": "Ebby Weyime",
      "character": "Officer in charge"
    },
    {
      "id": "nm1407696",
      "name": "Sascha Rasmussen",
      "character": "Mr. Childress"
    },
    {
      "id": "nm4007984",
      "name": "Dylan Edy",
      "character": "Black Hat"
    },
    {
      "id": "nm3462243",
      "name": "Richard Lothian",
      "character": "Mr. Jefferson"
    },
    {
      "id": "nm1520849",
      "name": "Hennie Bosman",
      "character": "Huge Man       (as Henie Bosman)"
    },
    {
      "id": "nm1034066",
      "name": "Wayne Harrison",
      "character": "Interpol Officer #1"
    },
    {
      "id": "nm2415330",
      "name": "Anselmo Martini",
      "character": "Dinner Guest"
    },
    {
      "id": "nm4947583",
      "name": "Michael Kirch",
      "character": "Bellman"
    },
    {
      "id": "nm0831104",
      "name": "Royston Stoffels",
      "character": "Air Traffic Chief"
    },
    {
      "id": "nm0199226",
      "name": "Hlomla Dandala",
      "character": "Mr. Madison"
    },
    {
      "id": "nm3549561",
      "name": "Chloe Kirby",
      "character": "Senator's Aide"
    },
    {
      "id": "nm2875018",
      "name": "Anneli Muller",
      "character": "Young Woman at bank"
    },
    {
      "id": "nm3432688",
      "name": "Lisa Trublet De Nermont",
      "character": "Lisa       (as Lisa Leonard)"
    },
    {
      "id": "nm0544781",
      "name": "Anthony Mo Marais",
      "character": "Parking Security Guard       (as Mo Marais)"
    },
    {
      "id": "nm4276373",
      "name": "Dennis Nicomede",
      "character": "Dinner Guest"
    },
    {
      "id": "nm8379692",
      "name": "Abbey Riggle",
      "character": "Dinner Guest"
    },
    {
      "id": "nm8379694",
      "name": "Robert Madison",
      "character": "General Resnick"
    },
    {
      "id": "nm6633796",
      "name": "Kingsley Pearson",
      "character": "Matthew Fuller"
    },
    {
      "id": "nm7445447",
      "name": "Daniele Tripepi",
      "character": "Hotel Security Guard"
    },
    {
      "id": "nm3348755",
      "name": "Rhobye Wyatt",
      "character": "Senator's Wife"
    },
    {
      "id": "nm1247737",
      "name": "Donald A. Barton",
      "character": "Admiral Harris"
    },
    {
      "id": "nm3873021",
      "name": "Thandiwe Mesele",
      "character": "Xhosa Newscaster"
    },
    {
      "id": "nm8379688",
      "name": "Audrey Mitchell",
      "character": "Dinner Guest"
    },
    {
      "id": "nm8379677",
      "name": "David Johnson",
      "character": "Bank Guard"
    },
    {
      "id": "nm8379684",
      "name": "Tapiwaneshe Musvosi",
      "character": "Officer #2"
    },
    {
      "id": "nm8379687",
      "name": "Michael Douglas",
      "character": "Dinner Guest"
    },
    {
      "id": "nm6397094",
      "name": "Grant Orpen",
      "character": "Motorcyclist"
    },
    {
      "id": "nm8379681",
      "name": "Zintle Ntshoko",
      "character": "Bystander"
    },
    {
      "id": "nm2854709",
      "name": "Frederick Heim",
      "character": "Secret Service Agent"
    },
    {
      "id": "nm8379693",
      "name": "Micayla Marie Campanelli",
      "character": "Party Guest"
    },
    {
      "id": "nm8379676",
      "name": "Yolande Botha",
      "character": "Little Girl's Mother"
    },
    {
      "id": "nm8379678",
      "name": "Henri Kriel",
      "character": "Rookie Security"
    },
    {
      "id": "nm8379685",
      "name": "Bob Balyszak",
      "character": "General"
    },
    {
      "id": "nm8379680",
      "name": "Peter Treurnicht",
      "character": "Newscaster #2"
    },
    {
      "id": "nm6533067",
      "name": "Lois Douglas",
      "character": "Dinner Guest"
    },
    {
      "id": "nm8379690",
      "name": "Kenneth Steinhorn",
      "character": "Dinner Guest"
    },
    {
      "id": "nm8379695",
      "name": "Rune Lorentz Nordbustad",
      "character": "Secret Service Agent"
    },
    {
      "id": "nm8379686",
      "name": "Samara Collins",
      "character": "Dinner Guest"
    },
    {
      "id": "nm6684974",
      "name": "Mzukisi Ntantiso",
      "character": "Interpol Officer #2"
    },
    {
      "id": "nm8379691",
      "name": "Cleo Florence Eyquem",
      "character": "Dinner Guest"
    },
    {
      "id": "nm8379683",
      "name": "Dobs Madotyeni",
      "character": "Hotel Valet"
    },
    {
      "id": "nm8049373",
      "name": "John Carne",
      "character": "Middle Aged Man"
    },
    {
      "id": "nm8379675",
      "name": "Swalala Bongolethu Mbutama",
      "character": "2nd Detective"
    },
    {
      "id": "nm8379679",
      "name": "Hein De Vos",
      "character": "Business Man"
    }
  ],
  "overview": "When Alex, an infiltration expert with a secret past, accidentally reveals her identity during what should have been a routine heist, she quickly finds herself mixed up in a government conspiracy and entangled in a deadly game of cat-and-mouse with a master assassin and his team of killers.  Armed with her own set of lethal skills, Alex looks to exact revenge for her murdered friends while uncovering the truth.",
  "storyline": "Alex, a mysterious thief, is pulled in by her former partner for one last heist. She quickly finds it was never just about the diamonds. A brutal murder sparks a cat and mouse chase between Alex and a master assassin. Now she must uncover the lies behind the heist and discover the secrets behind the men who have made her a target.",
  "plot": null,
  "synopsis": "Pre-credits you hear a U.S. senator (Morgan Freeman) speaking to some unseen defense contractors. They are planning to orchestrate an event that will result in a war for them and a higher political office for him.The first scene opens in a bank in South Africa (Cape Town?). A robber gang of four, dressed in mysterious and futuristic garb (they have rows of different colored lights on their suits for identification and all their voices sound the same because they have been electronically modified) ruthlessly torture the bank manager until he opens the safe. The \"key\" to the safe is the manager's body and after an initial failure, the robbers shove two teeth that they had knocked out back in place, which works to open the safe. The thieves only open and remove the contents of one safety deposit box, which contains diamonds and one other small, unidentified, item. We begin to differentiate between the robbers. Red light and green light appear to be the leaders and violet light seems to be a hot-head who was apparently recruited by the fourth member, blue light. Red light gets in a fight with violet light and they shoot each other. Violet light is hit in the upper shoulder or neck, which does little damage, and red light takes only a nick to the cheek. They struggle and Red lights mask is pulled off, revealing a beautiful young red-haired woman. All the hostages see her face and blue light says she must kill all of them because she's been compromised. She says no and about that time violet light struggles back up and is shot again, this time with fatal result. All the robbers leave the bank and ride away in a van. Blue light removes his mask revealing a bearded man who is very angry with the woman because his friend violet light (Wayne) is dead and because she didn't kill all the witnesses and when green light (also a man) comes to her defense he also turns his anger on him. The woman knocks him unconscious with a left-handed backwards punch. As the thieves split up, the woman reminds the bearded man to lay low for a month and then he will receive \"30,000\".The man and the woman (now identified as \"Alex\" or \"Alexis Farraday\" (Olga Kurylenko) relax in different rooms of a luxury hotel. Alex is seen changing her eye and hair color. She goes to her partner's room and it becomes apparent that they are ex-lovers with Alex being mad with him and him wanting to reconcile. The man says he found \"some even better insurance\" in with the diamonds and wants Alex to help him with it but is disturbed by a knock on the door. He -- now identified as \"Kev\" or \"Kevin Fuller\" (Colin Moss)\" -- is expecting a woman who will the original insurance. She (Jessica) is indeed at the door but followed by some gunmen -- actually three men and one woman. Alex hides under the bed, but Kev and Jessica are subdued. Jessica gives up her cell phone with a sex video and is promptly shot in the head. The leader then demands Kevin give over a USB drive, after badly torturing home they kill Kevin, Alex is quiet and unnoticed under the bed. The head \"bad guy\", Mr. Washington (James Purefoy) is annoyed that Kevin has died prematurely. Alex sneaks out from under the bed and finds a gun but it turns out to be unloaded. An extended chase and running gun battle ensues but in the end, Alex escapes from the hotel.There's a chase scene on the city streets with the bad guys temporarily joined by the police when she runs a red light. However she escapes everyone.Alex shows up at \"blue light\"''s apartment and he confidently prepares to defend his place but has underestimated his opponents and is quickly killed. In the other room, Alex calls Kev's wife and warns her to get out of town immediately. She also ask her to bring the package containing the diamonds and disk, which she suspects Kevin has stashed at home in his \"bug-out bag\". Kev's wife insults Alex because she knew of the affair Kev and Alex were having, and refuses to bring the package, if any, however, she reluctantly prepares to leave. Alex hides in a ceiling space and overhears Mr. Washington's plan to kill Kevin's wife and child. He learns of their address by tricking the young boy over the phone.At the Fuller home, Penny Fuller retrieves Kev's bug-out bag from the ceiling of the garage, inadvertently breaking the windshield of her car in the process. We see her look down at the windshield fragments, thoughtfully.Three bad guys race to Kevin Fuller's home while the other group are cleaning up the bodies left behind at the hotel. Alex also gets to the house and another big fight happens in which both baddies are killed (Mr. Washington had already left for the hotel with the bug-out bag). Alex is given the disk by Mrs. Fuller (which leaves us wondering just what was in the bug-out bag) but when she attempts to view the disk on the home computer, it activates a GPS device telling \"someone\" her location, so she immediately leaves along with Mrs. Fuller and the boy.Mr. Washington receives a phone call from the senator asking about the drive and is annoyed when the senator says he is sending his right-hand man, Doug MacArthur (Karl Thaning) to provide assistance. Mr. Washington is annoyed at this but polite to the senator while on the phone with him.As the cleanup at the hotel is taking place, Washington receives a call from Alex and is tricked into revealing that they are at the hotel. She races to the hotel on a stolen motorbike and then follows him to some abandoned industrial building. Washington has with him two associates, Ms. Clinton (who he thinks well of) and Mr. Jefferson who both he and Clinton think is an idiot. Alex sneaks in and subdues Mr. Jefferson and holds him hostage by holding him with a gun in his mouth. Alex calls Washington and it now is explicitly stated that both the robbers and Mr. Washington's crew were hired by the senator. The robbers weren't told about the drive, only the diamonds, and Washington knew about both and was assigned to kill the robbers. She then deliberately makes Washington and Clinton aware of her presence and attempts to trade Mr. Jefferson for the diamonds (even though she already has the diamonds and the drive). When Washington refuses, she shoots Jefferson through the head. She also activates a bomb she has hidden in Mr. Washington's SUV, but fails to seriously harm him or Clinton. Alex has hidden but again makes her whereabouts known. She gets captured when a third member of Washington's crew appears. She's placed in a chair with her leg in a vice and there is a long torture scene. Washington figures out she was a CIA \"entry-specialist\" who quit after a job in Beirut went wrong and innocent people were killed. Washington also discovers that the \"diamonds\" he thought he had were actually just shards of a broken windshield. Alex had placed them in a bag earlier and he hadn 't bothered to look in the bag until later. Alex fagrees to make a trade for the diamonds and drive at 9 PM that night at Cape Town airport. she calls Penny Fuller to confirm the meet.That evening at the airport, what's left of Washington and Clinton show up along with Alexis, in a short black dress, heels and a cane. Penny is there is a dark wig, keeping incognito. Alex is handed a key to a locker at the airport (Penny hands it to her as she walks by). Penny then lingers around the airport with the bug-out bag, which is dripping a bit of blood .Washington is very suspicious of Alex and insists she open the locker and then the box. However, she has tricked him by placing both items in an inner compartment in the box and when this is opened by Ms. Clinton, a bomb goes off. Clinton is seriously wounded in the face but still able to fight. Meanwhile, the third member of the crew has spotted and captured Penny. The airport police are now involved. Clinton defeats a squad of them in hand-to-hand combat but is finally shot. Washington and Alex fight and she wrestles away from him the drive- which Penny had hid in his necktie, earlier. She stuns Washington with a blow to the face and runs toward the terminal door. Washington kills a policeman who gets in his way. All this time, the third baddie has been carrying a subdued Penny through the chaos of the terminal. Alex gets to him and puts a bullet through his head. She runs towards the exit. Washington is surrounded by police just outside the terminal. He stops and raises his hands. Penny pulls off her wig changes her appearance quickly, and tries to exit the terminal. Alex comes out and talks to Washington. She makes a chess comment, \"Queen to Bishop 5\" then yells out \"gun\" and dives off. The police open fire and Washington goes down in a hail of bullets. Penny Fuller is held as a witness at first, on the scene, along with all the others, but released when the lead detectives attention is diverted elsewhere. He is shown a bag left on the scene which contains a woman's head, Jessica's. The head has been given a fresh wound to the face because Alex had received such a wound when she was shot at the bank by violet lights. A few diamonds were left on the scene also, however it is revealed that Penny has the bulk of the diamonds in her bag. She leaves to go to her mother's to pick up Matthew, her son. A Squad of Interpol police arrive along with Mr. MacArthur, and take control of everything, but it is too late, Alex gets past security with a fake passport and is on an outbound flight. She has a new tech associate with her and they view the video on the disk. It is of building plans with large bombs in the basement. She calls Washington's cell, McArthur answers and she lets him know she knows the plans. In the closing scenes, the senator and McArthur discuss the situation. The senator wonders whether she is going to be \"greedy or a martyr\". McArthur indicates that she will be a martyr (be a hero) . The senator mutters that martyrs must die."
}