{
  "imdb_id": "tt3100274",
  "tmdb_id": "311667",
  "douban_id": null,
  "title": "Manhattan Night (2016)",
  "genres": [
    "Crime",
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "113 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm1802093",
      "name": "Brian DeCubellis"
    }
  ],
  "writer": [
    {
      "id": "nm1802093",
      "name": "Brian DeCubellis",
      "description": "screenplay"
    },
    {
      "id": "nm5853165",
      "name": "Colin Harrison",
      "description": "novel"
    }
  ],
  "cast": [
    {
      "id": "nm0004778",
      "name": "Adrien Brody",
      "character": "Porter Wren"
    },
    {
      "id": "nm2088803",
      "name": "Yvonne Strahovski",
      "character": "Caroline Crowley"
    },
    {
      "id": "nm0001714",
      "name": "Campbell Scott",
      "character": "Simon Crowley"
    },
    {
      "id": "nm0000884",
      "name": "Jennifer Beals",
      "character": "Lisa Wren"
    },
    {
      "id": "nm0000925",
      "name": "Steven Berkoff",
      "character": "Sebastian Hobbs"
    },
    {
      "id": "nm0492089",
      "name": "Linda Lavin",
      "character": "Norma Segal"
    },
    {
      "id": "nm1478067",
      "name": "Frank Deal",
      "character": "Walden Campbell"
    },
    {
      "id": "nm0139255",
      "name": "Stan Carp",
      "character": "Frank Crowley"
    },
    {
      "id": "nm6935436",
      "name": "Madison Elizabeth Lagares",
      "character": "Sally Wren"
    },
    {
      "id": "nm6935437",
      "name": "Thomas Bair",
      "character": "Tommy Wren"
    },
    {
      "id": "nm1784977",
      "name": "Theis Weckesser",
      "character": "Charlie"
    },
    {
      "id": "nm2134580",
      "name": "Alex Echevarria",
      "character": "Tull"
    },
    {
      "id": "nm2425789",
      "name": "Chinasa Ogbuagu",
      "character": "Haitian Woman"
    },
    {
      "id": "nm6935435",
      "name": "Jahni Brown",
      "character": "Vernon"
    },
    {
      "id": "nm0201753",
      "name": "Karin Collison",
      "character": "Abigail       (as Karin de la Penha)"
    },
    {
      "id": "nm3099025",
      "name": "Arlene A. McGruder",
      "character": "Josephine"
    },
    {
      "id": "nm0032965",
      "name": "Raul Aranas",
      "character": "Luis"
    },
    {
      "id": "nm1080718",
      "name": "Will Beinbrink",
      "character": "Billy"
    },
    {
      "id": "nm2935346",
      "name": "Maria-Christina Oliveras",
      "character": "Prostitute"
    },
    {
      "id": "nm6130132",
      "name": "Grace Rundhaug",
      "character": "Young Caroline"
    },
    {
      "id": "nm0108362",
      "name": "Kevin Breznahan",
      "character": "Ron"
    },
    {
      "id": "nm2308210",
      "name": "Allegra Cohen",
      "character": "Detective"
    },
    {
      "id": "nm2799571",
      "name": "Oscar J. Castillo",
      "character": "Doorman"
    },
    {
      "id": "nm1784765",
      "name": "George Pogatsia",
      "character": "Tipster On Phone"
    },
    {
      "id": "nm0242536",
      "name": "Colleen Dunn",
      "character": "Gossipping Woman"
    },
    {
      "id": "nm2102314",
      "name": "Maureen Isern",
      "character": "Gossipping Woman"
    }
  ],
  "overview": "Porter Wren is a Manhattan tabloid writer with an appetite for scandal. On the beat he sells murder, tragedy, and anything that passes for the truth. At home, he is a dedicated husband and father. But when Caroline, a seductive stranger asks him to dig into the unsolved murder of her filmmaker husband Simon, he is drawn into a very nasty case of sexual obsession and blackmail--one that threatens his job, his marriage, and his life.",
  "storyline": "Based on Colin Harrison's acclaimed novel Manhattan Nocturne (a New York Times Notable Book of the Year), MANHATTAN NIGHT tells the story of Porter Wren (Adrien Brody), a New York City tabloid writer with an appetite for scandal. On the beat he sells murder, tragedy and anything that passes for the truth. At home he is a model family man, devoted to his loving wife (Jennifer Beals). But when a seductive stranger (Yvonne Strahovski) asks him to dig into the unsolved murder of her filmmaker husband Simon (Campbell Scott), he can't resist. In this modern version of a classic film noir, we follow Porter as he is drawn into a very nasty case of sexual obsession and blackmail - one that threatens his job, his marriage, and his life. MANHATTAN NIGHT will be released by Lionsgate Premiere in theaters and On Demand May 20, 2016. Lionsgate Premiere, Grindstone Entertainment Group and 13 Films present in association with Sparkle Roll Media Corporation and Big Indie Pictures a production of Fable...",
  "plot": "The film opens with a montage of images of Manhattan and other parts of New York City accompanied by George Gershwin's Rhapsody in Blue, with Isaac Mortimer Davis (Woody Allen) narrating drafts of an introduction to a book about a man who loves the city. Isaac is a twice-divorced, 42-year-old television comedy writer dealing with the women in his life who quits his unfulfilling job. He is dating Tracy (Mariel Hemingway), a 17-year-old girl attending the Dalton School. His best friend, college professor Yale Pollack (Michael Murphy), married to Emily (Anne Byrne), is having an affair with Mary Wilkie (Diane Keaton). Mary's ex-husband and former teacher, Jeremiah (Wallace Shawn), also appears. Isaac's ex-wife Jill Davis (Meryl Streep) is writing a confessional book about their marriage. Jill has also since come out of the closet as a lesbian and lives with her partner, Connie (Karen Ludwig).\n\nWhen Isaac meets Mary, her cultural snobbery rubs him the wrong way. Isaac runs into her again at an Equal Rights Amendment fund-raising event at the Museum of Modern Art hosted by Bella Abzug (who is played by herself) and accompanies her on a cab ride home. They chat until sunrise in a sequence that culminates in the iconic shot of the Queensboro Bridge. In spite of a growing attraction to Mary, Isaac continues his relationship with Tracy but emphasizes that theirs cannot be a serious relationship and encourages her to go to London to study acting. In another iconic scene, at Tracy's request, they go on a carriage ride through Central Park.\n\nAfter Yale breaks up with Mary, he suggests that Isaac ask her out. Isaac does, always having felt that Tracy was too young for him. Isaac breaks up with Tracy, much to her dismay, and before long, Mary has virtually moved into his apartment. Emily is curious about Isaac's new girlfriend, and after several meetings between the two couples, including one where Emily reads out portions of Jill's new book about her marriage with Isaac, Yale leaves Emily to resume his relationship with Mary. A betrayed Isaac confronts Yale at the college where he teaches, and Yale argues that he found Mary first. Isaac responds by discussing Yale's extramarital affairs with Emily, but Yale told her that Isaac introduced Mary to him. In the denouement, Isaac lies on his sofa, musing into a tape recorder about the things that make \"life worth living\". When he finds himself saying \"Tracy's face\", he sets down the microphone.\n\nHe leaves his apartment and sets out on foot for Tracy's. He arrives at the lobby of her family's apartment just as she is leaving for London. He says that she does not have to go and that he does not want \"that thing about [her] that [he] like[s]\" to change. She replies that the plans have already been made and reassures him that \"not everybody gets corrupted\" before saying \"you have to have a little faith in people.\" He gives her a slight smile with a final coy look to the camera then segueing into final shots of the skyline with some bars of Rhapsody in Blue playing again. An instrumental version of \"Embraceable You\" plays over the credits.",
  "synopsis": null
}