{
  "imdb_id": "tt3140024",
  "tmdb_id": "273693",
  "douban_id": null,
  "title": "Baby Boot Camp (TV Movie 2014)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm1592228",
      "name": "Christie Will"
    }
  ],
  "writer": [
    {
      "id": "nm1672013",
      "name": "Barbara Kymlicka",
      "description": null
    },
    {
      "id": "nm1592228",
      "name": "Christie Will",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1566486",
      "name": "Danneel Ackles",
      "character": "Julia"
    },
    {
      "id": "nm0808902",
      "name": "Kavan Smith",
      "character": "Scott"
    },
    {
      "id": "nm1468333",
      "name": "Ryan McDonell",
      "character": "Phil"
    },
    {
      "id": "nm1193045",
      "name": "Peter Benson",
      "character": "Jeremy"
    },
    {
      "id": "nm2026124",
      "name": "Kevin O'Grady",
      "character": "Police Officer"
    },
    {
      "id": "nm3900474",
      "name": "Eliza Faria",
      "character": "Melissa Cuthbert"
    },
    {
      "id": "nm1058352",
      "name": "Miranda Frigon",
      "character": "Gwen"
    },
    {
      "id": "nm6553665",
      "name": "Heather Griffith",
      "character": "Midwife-Stephanie"
    },
    {
      "id": "nm1535265",
      "name": "Lindsay Maxwell",
      "character": "Amber"
    },
    {
      "id": "nm1705724",
      "name": "Jill Morrison",
      "character": "Carla"
    },
    {
      "id": "nm5246346",
      "name": "Jena Skodje",
      "character": "Charlotte"
    },
    {
      "id": "nm1288632",
      "name": "Alexandra Staseson",
      "character": "Hip Baby Clerk"
    }
  ],
  "overview": null,
  "storyline": "Widower Scott joins as sole male the New York single parents 'bootcamp' run illegally by penniless klutz Julia. her pregnant big sister pushes until Scott hires clueless Julia as nanny for his daughters, a toddler and maternal brat Charlotte, who switches from support to sabotage when she overhears Julia at the Phone discussing her hope to seduce Scott, who assured his buddy and agency travel agency partner to have no romantic interest.",
  "plot": "This film is the story of a group of unruly teenagers whose parents send them to a rehabilitation boot camp to turn them around. The camp collects each child individually, then delivers them to the boot camp facility owned by Dr. Arthur Hail, on a remote island in Fiji. There are no walls to stop the teenagers from leaving, but escape is impractical due to the surrounding sea. On arriving at the camp, the teenagers are forced to wear cuffs with sensors around their ankles—if they attempt to escape, security will be alerted.\n\nThe main teenagers featured are Sophie, her boyfriend Ben, Danny and Trina. As time passes on the island, Sophie rebels against Dr. Hail and once Ben joins her, the two escape to a nearby island. However, they are recaptured and Ben is told he will be sent home. One morning, while on a run, Logan has the male teenagers go swimming. However, Danny, who can't swim, drowns and Logan tries to get Ben to help cover it up by threatening him with solitary confinement, but Ben refuses.\n\nMeanwhile, Sophie discovers that Logan has raped Trina and when Logan is put before the camp to admit responsibility for Danny's death, she reveals this to the rest of the teenagers, many of whom also were offered yellow shirts by Logan in exchange for sex. As the teenagers surround Logan, Sophie turns the attention onto Hail, at which point Ben announces to the shocked teenagers that this isn't the first death to occur on a camp run by Dr. Hail.\n\nThe teenagers run amok and burn down the entire campsite. In addition, they go after Logan, who dies when his Toyota Land Cruiser crashes into a burning building. At this point they turn their attention solely to Hail, who tries to shoot them in the hope that he can restore order. However, after finding out his gun wasn't loaded, he is thrown into solitary confinement, to be left for the police to arrest. As the film fades out, we see images of the teenagers celebrating freedom and swimming in the ocean. A message also appears on screen stating that since the 1970s, when these type of camps were introduced in real life, over 40 deaths have occurred.",
  "synopsis": null
}