{
  "imdb_id": "tt3175452",
  "tmdb_id": "273157",
  "douban_id": null,
  "title": "King Naresuan 5 (2014)",
  "genres": [
    "History"
  ],
  "country": "Thailand",
  "version": [
    {
      "runtime": "118 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.1,
  "director": [
    {
      "id": "nm0950841",
      "name": "Chatrichalerm Yukol"
    }
  ],
  "writer": [
    {
      "id": "nm0950841",
      "name": "Chatrichalerm Yukol",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2509128",
      "name": "Jukrit Ammarat",
      "character": "King Nandabayin"
    },
    {
      "id": "nm1665349",
      "name": "Nopachai Chaiyanam",
      "character": "Bunthing"
    },
    {
      "id": "nm0153400",
      "name": "Inthira Charoenpura",
      "character": "Princess Loekhin"
    },
    {
      "id": "nm0154083",
      "name": "Sorapong Chatree",
      "character": "Mahathera Kanchong"
    },
    {
      "id": "nm2574162",
      "name": "Komgrit Intrasawan",
      "character": ""
    },
    {
      "id": "nm2570470",
      "name": "Napatkorn Mitr-em",
      "character": ""
    },
    {
      "id": "nm2574763",
      "name": "Thaksawn Phaksukjaroen",
      "character": "Maneechan"
    },
    {
      "id": "nm2300248",
      "name": "Wanchana Sawatdee",
      "character": "King Naresuan"
    },
    {
      "id": "nm2454886",
      "name": "Winthai Suvaree",
      "character": ""
    },
    {
      "id": "nm2568671",
      "name": "Prapadon Suwannabang",
      "character": "Phra Chai Buri"
    }
  ],
  "overview": "The Legend of King Naresuan Part 5  Elephant Battle. In the year 2129 the Department of the Red God was incensed to the crushing defeat of King Naresuan. Both have to face the hosts and glory. So then wreak vengeance to the Lord Supangkanlaya. HRH on Dlamini's father was a sadness with the realization that the fate of the daughter and invading the Ayutthaya done it, because he defected to the enemy side. Nordstrom will finally died King Naresuan's went up succeed to the throne of Ayudhya dominate the successor of his father.",
  "storyline": null,
  "plot": "Part I: Hongsawadee's Hostage\n\nThe film concerns the childhood of King Naresuan. Born in 1555, he was taken to Burma as a child hostage; there he became acquainted with sword fighting and became a threat to the Burmese empire\n\nThe film begins in 1564, during the Burmese siege of Phitsanulok, the center of the languishing Sukhothai kingdom. Naresuan's father, Maha Thammarachathirat, admits defeat and follows Burmese orders that his two sons, Naresuan (nicknamed Ong Dam Thai: องค์ดำ Black Prince) and Ekathotsarot (the White Prince), be taken hostage and be raised in Pegu (the center of the Hanthawadi kingdom) under the watchful eyes of Bayinnaung, the Burmese king, who promises to care for Naresuan like one of his own. This creates a rift between Naresuan's father and his mother, Queen Wisutkasat, whose brother is the king of the neighboring Ayutthaya kingdom, as Phitsanulok is now a Burmese vassal state. Ayutthaya falls soon after.\n\nImmediately after entering the Burmese palace, Naresuan sees the palace politics and rivalries between himself and Bayinnaung's grandson, Mingyi Swa. Naresuan is sent to be educated as a novice monk, by an ethnic Mon Buddhist monk named Khanchong, at a Buddhist monastery outside the palace. There, while wandering the Thai village outside Pegu (made up of Thais displaced by Bayinnaung's expansionist campaigns and subsequent forced relocations to Hanthawadi), he befriends Bunthing, a Thai street child who is later allowed to work as a temple boy. He also befriends Maneechan, a temple girl at the monastery. The monk Khanchong, who had also trained Bayinnaung, teaches Naresuan the skills of war and ethics.\nPart II: Reclaiming Sovereignty\n\nBayinnaung dies in the beginning of the film from natural causes. Thammaracha, the governor-king of Ayutthaya, believes it is important that he go and pay respect to the dead king out of fear that the new Burmese king Nanda would deem it as an insult and attack Ayutthaya. Prince Naresuan, however, having been raised in Pegu (the kingdom of Hanthawadi) and who regards Bayinnaung as a second father, convinces Thammaracha to let him go in his place.\n\nUpon arriving in Hanthawadi (Hongsawadi in Thai), Naresuan's childhood teacher, a Buddhist monk named Khan Chong, informs him about the dangers that king Nanda and many factions in Burma are plotting his assassination. At king Bayinnaung's funeral, all representatives from vassal kingdoms are present besides for one, the Krang kingdom. King Nanda sees it as disrespect and seizes the opportunity to wage war and siege the mountain top city. Naresuan's Ayutthaya army is successful in taking the mountain top city and proves itself superior to the rival Burmese armies, namely of the Lord of Pyay and of Mingyi Swa (the eldest son of Nandabayin). Burmese rivals felt even more threatened by the strength and wits of Naresuan's army. During the battle, Naresuan's friend, Bunthing, now a highly skilled general under Naresuan, falls for the princess of Krang, who becomes his companion.\n\nA plot is uncovered by Naresuan's childhood friends, two Mon rulers, that the Burmese are in fact planning the assassination of Naresuan. Upon finding out, Naresuan executes the plotters and ceremoniously declares Ayutthaya free and sovereign from Hanthawadi. King Nanda and his Burmese are furious and begin a military campaign to capture and kill king Naresuan before his forces and liberated Siamese subjects can reach the Sittaung River. King Naresuan uses the strategy of a fighting retreat. His forces built a wooden bridge across the river and engage the pursuing Burmese army as they follow. Several battles took place during the crossing. However, as the Burmese forces catch up, the Siamese citizens and forces have already crossed to the other bank.\n\nThe Burmese, determined to defeat the Siamese, try to pursue Naresuan's forces by crossing the river. The king is then approached by his revered Buddhist teacher, Mon monk Khanchong. Here, he is given a special musket, which is capable of firing across the river. According to history, the movie portrays king Naresuan firing the musket across the Sittaung River, and with one strike, killing the general of the Burmese army. With the general dead, Burmese forces retreated back to Hanthawadi. King Naresuan and his now independent Siamese forces head back to Ayutthaya and the king declares&#160;; \"It's not over yet, there is more work for us to do!\"\nPart III: Naval Battle\n\nIn 1584 at Kraeng, King Naresuan continues the war for independence of the Kingdom of Ayutthaya (Thai&#160;: อาณาจักรอยุธยา). The war began because King Nandabayin king of the Burmese Kingdom(Thai&#160;: อาณาจักรพม่า)had secretly determined to fight a war by sending two armies to attack King Naresuan. The first army is that of Lord Pathein which passes through the Three Pagodas Pass(Thai: ด่านเจดีย์สามองค์). The second army is that of the King Noratra Mangsosri (Thai&#160;: นรธาเมงสอ) of Lanna (Chiangmai) which attacks from the north of the Kingdom of Ayutthaya. The Lanna army halts and builds a camp at BanSraKet (Thai&#160;: บ้านสระเกศ). While two armies are preparing for continuing the war with Ayutthaya, the King of Loverk (Thai&#160;: ละแวก) sends Lord Jinjantu(Thai&#160;: จินจันตุ), a Chinese official, to spy in Ayutthaya, but a short time later, he heads back to Lovek because king Naresuan knows that he is a spy. After an intense river battle between Jinjantu's Chinese troops and the Siamese gunboats under Naresuan's personal command, he is able to escape.\n\nWhen the King of Lovek learns about the skills and abilities of Naresuan, he decides to make an alliance with Ayutthaya by sending his reluctant brother, Prince Srisuphanrachathirat (Thai: พระศรีสุพรรณราชาธิราช) to help Ayutthaya fight against Hanthawadi(Thai&#160;: หงสาวดี). While Naresuan prepares for the war, he realizes that the soldiers in the army of Ayutthaya are outnumbered by the two armies of Burma, so he decides to fight with each army separately before the two armies come together. First he fights with army of Lord Pathein west of Ayutthaya and he wins this first battle. Then he fights with the army north of Ayutthaya. After a hard fought battle, King Naresun defeats the army of King Noratra Mangsosri of Lanna (Chiangmai). After King Nandabayin finish war with Inn wa (Thai&#160;: อังวะ), he back to war with Ayuthaya. Finally,King Naresuan can keep independent of Ayuthaya.\nPart IV The Nanda Bayin War\n\nArmy of God, King Ananda Bago Red Score big hitters than any war. 3200, elephant riding includes the army and the commoners Regiment, which amounted to 12000 252000 by Mr. A wise army into battle. Well Maha Raja Manga equipment necessary to do and steal cover Roland Smooth brave soldiers. Reputation greatest hitters of Bago forces that come into this. As a result, the cities in the northern frontier of the Ayutthaya Kingdom qualm with conspiracy to renege on healing for the Department of the Red God. The result was the Battle of King Naresuan the face off and battle. When the crowd raging battle over the Tigers. Viziers lack of unity misdeeds, but their personal and partisan considerations. Deputy commander and the survival of the throne was captured mid-battle to bayonet fighting. The soldier was besieged by warlords who Charnarong than captured. Fate of Ayudhya And King Naresuan will end. To follow in the film The Legend of King Naresuan Part 4 \"The Nanda Bayin War\".\nPart V Elephant Battle\n\nThe Legend of King Naresuan Part V:Elephant Battle \n Main article: The Legend of King Naresuan Part 5 &#160;Elephant Battle.\n\nIn the year 2129 the Department of the Red God was incensed to the crushing defeat of King Naresuan. Both have to face the hosts and glory. So then wreak vengeance to the Lord Supangkanlaya. HRH on Dlamini's father was a sadness with the realization that the fate of the daughter and invading the Ayutthaya done it, because he defected to the enemy side. Nordstrom will finally died King Naresuan's went up succeed to the throne of Ayudhya dominate the successor of his father. News I have a new king of Ayutthaya to the Department of the Red God. He also said the Kingdom of Siam is not a normal life as a candidate I was so please to bodily foils at the viceroy viceroy reinforcements to attack Ayutthaya and reproduction. By King Naresuan's royal manu composer had given themselves up to the enemy troops to Nong Sarai. Manu Vanguard collided with the Burmese army to the battle. But are the royal manu less so the aliens turned into a riot. King Naresuan's so aware of the scheme, the army fired to disperse the enemy down to the process, he brought out the enemy army York. Then the elephant of King Naresuan. Behalf XVI Chaiyanuparp The elephant of King Phraya is Ekathosarot subdue the three worlds rut. Nora Elizabeth ran into the Burmese army through the enemy cordon Raman medium and stopped in front of the great stumbling elephant king. King Naresuan the Great declared challenger viceroy of Hong Sa Iuthheete is the honor done to the earth. Royal honor His Majesty the King was connected with the royal elephant is planning to do battle with King Naresuan's Elephant. While Robin Manga dry patch. His mentor, the King's viceroy to King Iuthheete Ekathosarot fighting in two pairs. As a veteran of the land of fame.\nPart VI The end of Hong Sa \n\nThe end of Hongsa [Edit] Main article: King Naresuan the end of Hong Sa.\n\nThe king receives news that the Burmese king Nanda Bayin, enraged over the loss of his son, had ordered the deaths of most of the military leaders in his Army, on the grounds that they had 'let his son die'. There was also news that, in his rage, Nanda Bayin had also killed off Suphankalaya, Naresuan's older sister. This angers the King, and he quickly announces his intention to gather an army, capture Pegu, and burn it to the ground as revenge.",
  "synopsis": null
}