{
  "imdb_id": "tt3163080",
  "tmdb_id": "340224",
  "douban_id": null,
  "title": "Hello, My Name Is Frank (2014)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "105 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.1,
  "director": [
    {
      "id": "nm2074599",
      "name": "Dale Peterson"
    }
  ],
  "writer": [
    {
      "id": "nm2074599",
      "name": "Dale Peterson",
      "description": "written by and"
    },
    {
      "id": "nm2519839",
      "name": "Margaret Kerrison",
      "description": "screenplay"
    },
    {
      "id": "nm6270942",
      "name": "Christine Bartsch",
      "description": "original screenplay"
    },
    {
      "id": "nm2074599",
      "name": "Dale Peterson",
      "description": "story"
    },
    {
      "id": "nm2074599",
      "name": "Dale Peterson",
      "description": "writer"
    },
    {
      "id": "nm2519839",
      "name": "Margaret Kerrison",
      "description": "co-writer"
    }
  ],
  "cast": [
    {
      "id": "nm0113595",
      "name": "Garrett M. Brown",
      "character": "Frank Brown"
    },
    {
      "id": "nm3847085",
      "name": "Rachel DiPillo",
      "character": "Laura"
    },
    {
      "id": "nm3167202",
      "name": "Mary Kate Wiles",
      "character": "Kim"
    },
    {
      "id": "nm3072243",
      "name": "Hayley Kiyoko",
      "character": "Alisa"
    },
    {
      "id": "nm2062691",
      "name": "Travis Caldwell",
      "character": "Vinnie"
    },
    {
      "id": "nm0842729",
      "name": "Kitty Swink",
      "character": "Louise"
    },
    {
      "id": "nm0944535",
      "name": "Ray Xifo",
      "character": "Ray"
    },
    {
      "id": "nm0003069",
      "name": "James DuMont",
      "character": "Dad in Park"
    },
    {
      "id": "nm2107837",
      "name": "Nate Hartley",
      "character": "John"
    },
    {
      "id": "nm0245145",
      "name": "Wayne Duvall",
      "character": "Preacher"
    },
    {
      "id": "nm0109785",
      "name": "Brent Briscoe",
      "character": "Puggis"
    },
    {
      "id": "nm0002128",
      "name": "Tess Harper",
      "character": "Aunt Flossie"
    },
    {
      "id": "nm1655587",
      "name": "Karina Bonnefil",
      "character": "Mama"
    },
    {
      "id": "nm4822487",
      "name": "Lisa Carswell",
      "character": "Cruel Teacher"
    },
    {
      "id": "nm4098408",
      "name": "Maxwell Chase",
      "character": "Skateboarder"
    },
    {
      "id": "nm0302153",
      "name": "Eileen Galindo",
      "character": "Maria"
    },
    {
      "id": "nm3623897",
      "name": "Brandon W. Jones",
      "character": "Kevin Bowman       (as Brandon Jones)"
    },
    {
      "id": "nm1559593",
      "name": "Happy Mahaney",
      "character": "Rick the Hippie Caregiver"
    },
    {
      "id": "nm3503228",
      "name": "Richard McCollister",
      "character": "Radio News Broadcaster"
    },
    {
      "id": "nm6115509",
      "name": "Craig McInnis",
      "character": "Preacher's Henchman"
    },
    {
      "id": "nm1307714",
      "name": "Graham Sibley",
      "character": "Dick Huston"
    }
  ],
  "overview": "Comedy - Comedy about Frank, a hermit with Tourette Syndrome who is thrust into the harsh realities of the world when his caregiver dies. After recognizing that Frank is despondent, the caregiver's teenage daughter, Laura, drags a reluctant Frank along on a life-changing road trip with Laura and her friends.  -  Garrett M. Brown, Rachel DiPillo, Mary Kate Wiles",
  "storyline": "Comedy about Frank, a hermit with Tourette Syndrome who is thrust into the harsh realities of the world when his caregiver dies. After recognizing that Frank is despondent, the caregiver's teenage daughter, Laura, drags a reluctant Frank along on a life-changing road trip with Laura and her friends. 'Hello, My Name is Frank...' is a modern-day Wizard of Oz meets Little Miss Sunshine - a road trip taken by Frank and his companions that causes them all to grow, bond and come into their own.",
  "plot": "Walking along the beach of his hometown, Jon (Domhnall Gleeson), an aspiring songwriter, witnesses police trying to save a man from drowning himself. Jon makes small talk at the scene with a stranger named Don (Scoot McNairy). Don says he manages an experimental rock band, the Soronprfbs (which is never pronounced by the band: Don just points at the van painted with it), and the suicidal man is the band's keyboardist. Jon mentions that he plays keyboards, and Don invites him to fill in for the incapacitated keyboardist at the band's show that night. He arrives to find the concert already in progress as Don pushes him onstage to a waiting keyboard. Despite his unfamiliarity Jon's performance goes well — for half a song, at which point Clara (Maggie Gyllenhaal) breaks her theremin and storms offstage, ending the show.\n\nThe next day, Don phones on behalf of Frank (Michael Fassbender), the mysterious bandleader who always wears an oversized papier-mâché mask, to invite Jon to join the band as a full-time member. Jon accompanies the band to a remote cabin in Ireland, where they plan to spend the next year recording their first album. Despite Don's friendliness and Frank's enthusiasm for him, the rest of the band display ennui toward Jon — particularly Clara, who continually torments him for being mediocre and untalented. Don tells Jon that he too once wanted to be a songwriter, but like Jon, lacked talent and was terrible. He plays a song for Jon, who compliments it. Don tells Jon that Frank is special, and that eventually Jon will believe that he either can be Frank or could at least be like him, but that it is impossible because Frank is unique. However, Jon feels that if he could just have hard experiences that he assumes Frank had, it would fuel him and get him to take the next step in his creativity. Jon believes that his time with the band will be the catalyst that will make this happen.\n\nThe morning after they complete recording of their album, Jon finds Frank's corpse hanging from a tree. He calls the rest of the band down and they remove the mask, only to find it was Don wearing Frank's mask. Don is cremated and Jon is told that Don was the band's first keyboard player; every keyboard player from Soronprfbs has had some kind of mental breakdown. Afterwards, Jon reveals he has been posting the band's recording sessions online. Soronprfbs have gained a small following and have been invited to South by Southwest. Clara is against going to South by Southwest, and accuses Jon of manipulating Frank and giving him delusions of grandeur. During one of their fights, Clara and Jon's hatred for each other turns into passion and they end up having sex, but Clara tells Jon that he disgusts her and they will never be together again. However, Frank wants to be popular and to create \"extremely likable music\" so he decides to go; Clara warns Jon that if things go badly in Austin she'll stab him.\n\nUpon arrival in Texas, Jon, Frank, and Clara scatter Don's ashes, but realize the band's guitarist Baraque (Francois Civil) accidentally packed a canister of powdered food instead of the ashes. Afterwards, the band travels to Austin. While signing up for South by Southwest, Jon and the band discover that they aren't as popular as they thought, and that the crowd will have no idea who they are and will have never listened to their music before. Upon hearing this, Frank starts to become erratic and has a panic attack.\n\nClara sees the changes in Frank and knows that he can't handle this situation, so she pleads with Jon to help convince Frank to not perform and go back to their unknown status. Jon refuses and works with Frank to try to create a more likeable version of their songs. On the day before the concert, Clara and Frank disappear. Jon finds them in an alley where Clara is trying to calm Frank and get him to agree to leave. Jon convinces Frank to ignore Clara and to do the gig. Clara stabs Jon in the leg and is later arrested by the police.\n\nBack at the hotel room Drummer Nana (Carla Azar) and Baraque accuse Jon of getting rid of Clara and quit the band. Jon and Frank become a duo. As they go onstage, Jon announces that it's the best day of his life and begins singing one of his own songs. Frank falls over and when Jon rushes over to him to check on him, Frank tells Jon that his music is bad, suffering a nervous breakdown. Frank passes out on stage with Jon trying to revive him. The next day, Jon attempts to reason with Frank and tries to remove his mask. A panicked Frank runs out of the motel room and is hit by a car. Jon gives chase but realizes Frank has escaped, leaving only remains of the mask behind. Jon subsequently gets hit by a car.\n\nAfter being released from the hospital, Jon goes to a diner and learns from \"fans\" that Soronprfbs is a laughingstock. Sometime later, Jon has attempted to track down Frank in order to make amends, but he cannot be found anywhere. However, he finds a bar where Clara, Nana, and Baraque are now playing. Jon finally succeeds in tracking Frank to his Kansas hometown where he is living with his parents. They explain that Frank has had mental health issues all his life and that his dad built the mask as a costume, but Frank never took it off. They tell Jon that Frank had a loving family and a happy childhood. Jon finally sees Frank's face, only to see a despondent man with scars on his face and bald spots from the prolonged use of the mask. Jon apologizes to Frank for ruining the band and trying to take off his mask. He then takes Frank to the bar where the band is. Frank begins to speak and they realize who he is. He begins singing and joins them in a song while Jon leaves the bar.",
  "synopsis": null
}