{
  "imdb_id": "tt3165612",
  "tmdb_id": "288036",
  "douban_id": null,
  "title": "Sleeping with Other People (2015)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "101 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm2853516",
      "name": "Leslye Headland"
    }
  ],
  "writer": [
    {
      "id": "nm2853516",
      "name": "Leslye Headland",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1555340",
      "name": "Alison Brie",
      "character": "Lainey"
    },
    {
      "id": "nm0837177",
      "name": "Jason Sudeikis",
      "character": "Jake"
    },
    {
      "id": "nm1994167",
      "name": "Jordan Carlos",
      "character": "R.A."
    },
    {
      "id": "nm1760272",
      "name": "Margarita Levieva",
      "character": "Hannah"
    },
    {
      "id": "nm4625653",
      "name": "Charles Cain",
      "character": "Helmet Kid"
    },
    {
      "id": "nm0111013",
      "name": "Adam Brody",
      "character": "Sam"
    },
    {
      "id": "nm1644112",
      "name": "Michael Cyril Creighton",
      "character": "Attentive Waiter"
    },
    {
      "id": "nm2813994",
      "name": "Billy Eichner",
      "character": "SLAA Speaker"
    },
    {
      "id": "nm1727621",
      "name": "Jason Mantzoukas",
      "character": "Xander"
    },
    {
      "id": "nm0001605",
      "name": "Amanda Peet",
      "character": "Paula"
    },
    {
      "id": "nm3676170",
      "name": "Victoria Frings",
      "character": "Nurse"
    },
    {
      "id": "nm0004395",
      "name": "Adam Scott",
      "character": "Matthew"
    },
    {
      "id": "nm0005169",
      "name": "Natasha Lyonne",
      "character": "Kara"
    },
    {
      "id": "nm0767242",
      "name": "Andrea Savage",
      "character": "Naomi"
    },
    {
      "id": "nm5055099",
      "name": "Sawyer Shipman",
      "character": "Lyle"
    },
    {
      "id": "nm2385935",
      "name": "Anna Margaret Hollyman",
      "character": "Renee"
    },
    {
      "id": "nm5653710",
      "name": "Margaret Odette",
      "character": "Thea"
    },
    {
      "id": "nm0016243",
      "name": "Carlo Alban",
      "character": "Microcenter Employee"
    },
    {
      "id": "nm3567948",
      "name": "Remy Nozik",
      "character": "George"
    },
    {
      "id": "nm2342283",
      "name": "Jamil Mena",
      "character": "Big Dude"
    },
    {
      "id": "nm0089456",
      "name": "Marc Blucas",
      "character": "Chris"
    },
    {
      "id": "nm2457760",
      "name": "Austin Ku",
      "character": "Pho Grand Waiter"
    },
    {
      "id": "nm2239702",
      "name": "Katherine Waterston",
      "character": "Emma"
    },
    {
      "id": "nm3228287",
      "name": "Skylar Gaertner",
      "character": "Oliver"
    },
    {
      "id": "nm1634988",
      "name": "Mitchell Green",
      "character": "Police Officer"
    },
    {
      "id": "nm1191921",
      "name": "Jeff Mantel",
      "character": "Detective"
    },
    {
      "id": "nm1125288",
      "name": "Brian Berrebbi",
      "character": "Sobvechik's Lawyer"
    },
    {
      "id": "nm0216320",
      "name": "Michael Delaney",
      "character": "Jake's Lawyer"
    }
  ],
  "overview": "Can two serial cheaters get a second chance at love? After a one-night stand in college, New Yorkers Lainey and Jake meet by chance twelve years later and discover they each have the same problem: because of their monogamy-challenged ways, neither can maintain a relationship. Determined to stay friends despite their mutual attraction, they make a pact to keep it platonic, a deal that proves easier said than done.",
  "storyline": "Can two serial cheaters get a second chance at love? After a one-night stand in college, New Yorkers Lainey (Alison Brie) and Jake (Jason Sudeikis) meet by chance twelve years later and discover they each have the same problem: because of their monogamy-challenged ways, neither can maintain a relationship. Determined to stay friends despite their mutual attraction, they make a pact to keep it platonic, a deal that proves easier said than done.",
  "plot": "In 2002 Lainey (Alison Brie) causes a scene in a dorm. Taking pity on her as she is about to be kicked out by security, Jake (Jason Sudeikis) claims her as his guest. He learns that Lainey was there in order to lose her virginity to her T.A. Matt (Adam Scott) who Jake thinks is the most boring guy in the world. Lainey eventually realizes that Jake is also a virgin. The two sleep together.\n\nIn the present Lainey breaks up with her long-term boyfriend Sam after telling him she has been cheating on him. On the advice of her therapist she attends a sex addicts meeting where she runs into Jake, who is there because of his inability to commit. Lainey has been having an off-and-on-again relationship with Matt the entire time learns that he is engaged. On the advice of a friend she contacts Jake. The two go on one date where they confess their sexual problems to one another. At the end of the date Jake confesses that he wants to sleep with her. Lainey decides that the two of them should just be friends and Jake agrees with the codeword \"mousetrap\" to be used to deflate sexual tension between them.\n\nThe two hang out more and more and eventually become best friends. However they begin to be mistaken for a couple by strangers, and their friends begin to think they are in a relationship as well. Jake learns that Lainey is going to re-enroll in school and possibly move to Michigan. He brings her to the birthday party of his friend's child where she meets a man called Chris Smith and begins seeing him, to Jake's chagrin. Jake decides to move forward, and asks his boss Paula on a date.\n\nA date with Chris Smith leads Lainey to run into Matt and his now pregnant wife. At the same time Jake has sex with Paula and calls her Lainey. After their nights out Jake and Lainey spend the night together where they realize that they are both in love with one another. They decide to do nothing about it.\n\nLainey moves to Michigan and Jake devotes himself to Paula. Two months after Lainey has left, during brunch with Paula, Jake sees Matt and punches him in the face. Paula breaks up with him and Jake is arrested. He calls Lainey from the police station and confesses he is in love with her. She tells him she feels the same way.\n\nSometime later Matt is suing Jake for emotional distress and refuses every settlement he offers. Lainey goes to see him and tells him she will tell his wife about them if he does not accept Jake's settlement. After leaving his office Lainey meets with Jake and the two rush off to be married.",
  "synopsis": null
}