{
  "imdb_id": "tt3128900",
  "tmdb_id": "261037",
  "douban_id": null,
  "title": "Miss Meadows (2014)",
  "genres": [
    "Drama",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "88 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm0394212",
      "name": "Karen Leigh Hopkins"
    }
  ],
  "writer": [
    {
      "id": "nm0394212",
      "name": "Karen Leigh Hopkins",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0005017",
      "name": "Katie Holmes",
      "character": "Miss Meadows"
    },
    {
      "id": "nm0197647",
      "name": "James Badge Dale",
      "character": "Sheriff"
    },
    {
      "id": "nm0612534",
      "name": "Callan Mulvey",
      "character": "Skylar"
    },
    {
      "id": "nm0005443",
      "name": "Jean Smart",
      "character": "Mother Meadows"
    },
    {
      "id": "nm0005316",
      "name": "Mary Kay Place",
      "character": "Mrs. Davenport"
    },
    {
      "id": "nm4795991",
      "name": "Ava Kolker",
      "character": "Heather"
    },
    {
      "id": "nm1212071",
      "name": "Stephen Bishop",
      "character": "Lt. Danny"
    },
    {
      "id": "nm0511721",
      "name": "Kate Linder",
      "character": "Trudy Navis"
    },
    {
      "id": "nm2566469",
      "name": "James Landry Hébert",
      "character": "Derek Pierson /              Young Man at Weenie Stand"
    },
    {
      "id": "nm0443856",
      "name": "James Keane",
      "character": "Father Peter"
    },
    {
      "id": "nm0065320",
      "name": "Graham Beckel",
      "character": "Tony Weaver /              Driver of Truck"
    },
    {
      "id": "nm6912395",
      "name": "Gregory Allen Smith",
      "character": "Willie"
    },
    {
      "id": "nm6001760",
      "name": "Anna Moravcik",
      "character": "Little Miss Meadows"
    },
    {
      "id": "nm5548780",
      "name": "Tyler Corbet",
      "character": "Gordon       (as Tyler R. Corbet)"
    },
    {
      "id": "nm6081081",
      "name": "Milly Hopkins",
      "character": "Sarah"
    },
    {
      "id": "nm2365299",
      "name": "Harry Zinn",
      "character": "Minister"
    },
    {
      "id": "nm1029241",
      "name": "Saidah Arrika Ekulona",
      "character": "Dr. Danielle Ryan"
    },
    {
      "id": "nm3825771",
      "name": "Charlotte Labadie",
      "character": "Hallway Girl /              Violet"
    },
    {
      "id": "nm6350095",
      "name": "Aubree Stone",
      "character": "Little Girl Maggie"
    },
    {
      "id": "nm6912396",
      "name": "Amy Kravockuck",
      "character": "Miss Katherine"
    },
    {
      "id": "nm0548718",
      "name": "Barry Markowitz",
      "character": "Homeless Man"
    }
  ],
  "overview": "Miss Meadows is a school teacher with impeccable manners and grace. However, underneath the candy-sweet exterior hides a ruthless gun-toting vigilante who takes it upon herself to right the wrongs in the world by whatever means necessary. For Miss Meadows, bad behavior is simply unforgivable.",
  "storyline": "Prim schoolteacher Miss Meadows (Katie Holmes) is not entirely what she appears. Well-mannered, sweet, and caring, yes, but underneath the candy-sweet exterior hides the soul of a vigilante, taking it upon herself to right the wrongs in this cruel world by whatever means necessary. Things get complicated, however, when Miss Meadows gets romantically entangled with the town sheriff (James Badge Dale) and her steadfast moral compass is thrown off, begging the question: \"Who is the real Miss Meadows and what is she hiding?\"",
  "plot": "Miss Mary Meadows is a young woman who works as a substitute first-grade elementary school teacher who enjoys taking long walks in her suburban neighborhood, wearing traditional clothing and tap-dancing shoes. Unknown to everyone, she is a secret vigilante who murders local thugs who accost her or when she witnesses them committing crimes. She always carries a small semi-automatic pistol in her purse and speaks in a childlike, innocent manner. She lives by herself in a small house and talks occasionally with her mother over the telephone about what she did during the day.\n\nInvestigating the vigilante killings is a local sheriff. He soon meets and develops an attraction to Miss Meadows due to her old-fashioned clothing and style of speech. When he begins to suspect that the woman he finds himself drawn to may be the suspect he is looking for, the sheriff is torn over whether to arrest her or protect her.\n\nWhen Miss Meadows meets an ex-convict named Skylar, who she learns served time for molesting young children, she begins to fear for her young students' safety. When Miss Meadows approaches and threatens to kill Skylar if he continues hanging around the school or around her kids, he begins stalking her.\n\nIt is eventually revealed that all of the telephone conversations that Miss Meadows has been having with her mother over the course of the film are imaginary. As a young girl, Mary Meadows witnessed her mother's murder in a drive-by shooting outside a local church after attending the wedding of a family friend. This traumatic incident left Miss Meadows so emotionally scarred that she withdrew into a fantasy world in which she imagined that her mother was still alive and caused her to go after and kill criminals who she sees as a threat to society.\n\nThe various criminals that Miss Meadows kills on-screen include a trucker who tries to abduct her in the opening scene, a young man who committed a mass shooting at a local diner, and the town's Catholic priest who Miss Meadows finds sexually molesting a young boy.\n\nWhen Miss Meadows learns that she is pregnant after a one-time sexual encounter with the sheriff, she decides to accept his proposal to get married. On the day of the wedding, Skylar kidnaps Heather, one of Miss Meadows's students, from her house, forcing Miss Meadows to go to Skylar's house (wearing her wedding dress) to try to stop him, only to end up a captive herself. When she manages to free Heather and struggle with Skylar over her gun, the sheriff, passing by after leaving the church, sees Heather running from Skylar's house as she shouts for help. Meanwhile, Skylar takes Miss Meadows' gun from her purse, aims it at her and asks, \"Do you really think you can save the world? Well, try saving your self first!\" Just then, the sheriff arrives and fatally shoots Skylar in the head. Seeing Miss Meadows' gun still clutched in Skylar's hand, he notes \"it has his prints now\". He and Miss Meadows proceed back to the church.\n\nOne year later, Miss Meadows and the Sheriff are married; she still wears her tap shoes and he has taken up the accordion. Now parents to a baby daughter, they are content to be peculiar together. As Miss Meadows prepares to go out before dinner, the sheriff tells her \"be careful\"; she replies \"I always am\" and dances away down the sidewalk.",
  "synopsis": null
}