{
  "imdb_id": "tt3184608",
  "tmdb_id": "390536",
  "douban_id": null,
  "title": "Ella & Él (2015)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "Peru",
  "version": [
    {
      "runtime": "78 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.2,
  "director": [
    {
      "id": "nm1347151",
      "name": "Frank Pérez-Garland"
    }
  ],
  "writer": [
    {
      "id": "nm1347151",
      "name": "Frank Pérez-Garland",
      "description": null
    },
    {
      "id": "nm0754461",
      "name": "Vanessa Saba",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0754461",
      "name": "Vanessa Saba",
      "character": "Ella"
    },
    {
      "id": "nm0161974",
      "name": "Giovanni Ciccia",
      "character": "Él"
    },
    {
      "id": "nm0628671",
      "name": "Gianella Neyra",
      "character": "Mariana"
    },
    {
      "id": "nm3023822",
      "name": "Alejandra Saba",
      "character": "Andrea"
    },
    {
      "id": "nm2733017",
      "name": "Lucho Cáceres",
      "character": "Daniel"
    },
    {
      "id": "nm0968665",
      "name": "Claudia Berninzon",
      "character": "Sandra"
    },
    {
      "id": "nm4573940",
      "name": "Jose Manuel Barrios",
      "character": "Rodrigo"
    },
    {
      "id": "nm6026579",
      "name": "Rodrigo Palacios",
      "character": "Antonio"
    }
  ],
  "overview": "Every couple is unique. At the same time there are patterns that all of us inherit from our families. We all have choices: repeat that pattern in the family we choose to build or create new one. That is the fight that the characters of About Them embraces. Both are gown up adults who has not been able to move away from their past, but they are trying so hard to build their own pattern, but the past keep reaches them.",
  "storyline": "Every couple is unique. Each one has its own code, rules and secrets and it is unrepeatable. But at the same time there are patterns that all of us inherit from our families. We all have two choices: repeat that pattern in the family we choose to build or build a new pattern. That's the fight that the characters of About Them embraces. Both of them are grown up adults who hasn't been able to move away form their past. Both of them are carrying a big bag on their back. Both of them has decided to love in a new way. They are trying to build a new pattern but the past reaches them at every step. The reasons why they are together and the way they choose to love each other is a secret only understandable by them. Any judgment we can make from the outside could be wrong. But it can also be a reflection of our own selves since the characters of About Them are unique, as we all are.",
  "plot": null,
  "synopsis": null
}