{
  "imdb_id": "tt3174084",
  "tmdb_id": "348760",
  "douban_id": null,
  "title": "The Werewolf Game: The Villagers Side (2013)",
  "genres": [
    "Horror",
    "Thriller"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "110 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.9,
  "director": [
    {
      "id": "nm2930352",
      "name": "Izuru Kumasaka"
    }
  ],
  "writer": [
    {
      "id": "nm5079016",
      "name": "Giguru Akiguchi",
      "description": "based on the novel by as Ryo Kawakami"
    }
  ],
  "cast": [
    {
      "id": "nm2400607",
      "name": "Mina Fujii",
      "character": "Marie Inoue"
    },
    {
      "id": "nm3367426",
      "name": "Kaoru Fujiwara",
      "character": "Fumitaka Kawasaki"
    },
    {
      "id": "nm5407381",
      "name": "Kinari Hirano",
      "character": "Yuhei Simobayashi"
    },
    {
      "id": "nm2951952",
      "name": "Jingi Irie",
      "character": "Takeshi Fujiki"
    },
    {
      "id": "nm2069032",
      "name": "Hikari Kajiwara",
      "character": "Naoko Inose"
    },
    {
      "id": "nm4111995",
      "name": "Hikaru Ohsawa",
      "character": "Hitomi Inaba"
    },
    {
      "id": "nm5140520",
      "name": "Amane Okayama",
      "character": "Seiichiro Machimura"
    },
    {
      "id": "nm3142576",
      "name": "Nanami Sakuraba",
      "character": "Airi Nishina"
    },
    {
      "id": "nm2665929",
      "name": "Taiga",
      "character": "Tomohiro Tada"
    },
    {
      "id": "nm4235895",
      "name": "Seika Taketomi",
      "character": "Konomi Inoue"
    }
  ],
  "overview": "Airi (Nanami Sakuraba) is a high school student. On the way home from school, Airi is kidnapped by someone. Then, 9 more high school students are all kidnapped like Airi. Those kidnapped students are forced to participate in Jinroh Game, with their lives at stake.",
  "storyline": "Airi Nishina is a high school student. On the way home from school, Airi is kidnapped by someone. Then, nine more high school students are all kidnapped like Airi. Those kidnapped students are forced to participate in Jinroh Game, with their lives at stake.",
  "plot": "Roujin Z is set in early 21st century Japan. A group of scientists and hospital administrators, under the direction of the Ministry of Public Welfare, have developed the Z-001: a computerized hospital bed with robotic features. The Z-001 takes complete care of the patient: it can dispense food and medicine, remove excretory waste, bathe and exercise the patient lying within its frame. The bed is driven by its own built-in nuclear power reactor—and in the event of an atomic meltdown, the bed (including the patient lying within) would become automatically sealed in concrete. The first patient to be \"volunteered\" to test the bed is a dying widower named Kiyuro Takazawa. He is an invalid who is cared for by a young nursing student named Haruko. The electronic elements within the Z-001 somehow manage to transcribe Takazawa's thoughts through Haruko's office computer, and he uses the communication to cry for help. Although she objects to such treatment of elderly patients, Haruko begrudgingly seeks the aid of a group of computer hackers in the hospital's geriatric ward to create and install a vocal simulation of Takazawa's deceased wife in the Z-001. However, once Takazawa wishes to go to the beach, the Z-001 detaches itself from its moorings and escapes from the hospital with the man in its grasp. Haruko's fears are then justified, as it is discovered that the bed is actually a government-designed, experimental weapons robot.",
  "synopsis": null
}