{
  "imdb_id": "tt3129484",
  "tmdb_id": "246308",
  "douban_id": null,
  "title": "Master of the Universe (2013)",
  "genres": [
    "Documentary"
  ],
  "country": "Austria",
  "version": [
    {
      "runtime": "88 min",
      "description": ""
    },
    {
      "runtime": "59 min",
      "description": "TV"
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm1519249",
      "name": "Marc Bauder"
    }
  ],
  "writer": [
    {
      "id": "nm1519249",
      "name": "Marc Bauder",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm5893857",
      "name": "Rainer Voss",
      "character": "Himself"
    }
  ],
  "overview": "He was one of Germany's leading investment experts with an income of several million Euros per day. Now, he sits on one of the upper floors of an empty bank building in the middle of Frankfurt, overlooking a skyline of glass and steel. And talks. In an extended mix of a monologue and an in-depth interview, which is as frightening as it is fascinating, he shares his inside knowledge from a megalomaniac parallel world where illusions are the market's hardest currency. Marc Bauder's 'Master of the Universe' is based on meticulous research and provides us with geniune insight into the notoriously secretive and self-protective 'universe' of which our nameless protagonist experiences himself a master. Where other films on the financial meltdown have focused on the epic nature of larger-than-life business, Bauder probes the mentality that made it possible in the first place. A tense drama where psychology meets finance - two things that are more closely linked than you would like to believe.",
  "storyline": "A former banker in Germany, who entered the business with the advent of modern computer systems reminisces of his working years in some of the world-leading banking corporations. His narration outlines the typical paradigm of the professional and personal life of a bank's employee, along with the ethical dilemmas they often faced. Also, he shares his views on the dynamics in financial markets and recession.",
  "plot": null,
  "synopsis": null
}