{
  "imdb_id": "tt3170504",
  "tmdb_id": "339725",
  "douban_id": null,
  "title": "Last Love Lost (2015)",
  "genres": [
    "Drama"
  ],
  "country": null,
  "version": [
    {
      "runtime": "83 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm5183339",
      "name": "Jahmar Hill"
    }
  ],
  "writer": [
    {
      "id": "nm5183339",
      "name": "Jahmar Hill",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm5183339",
      "name": "Jahmar Hill",
      "character": "Antonio"
    },
    {
      "id": "nm2844512",
      "name": "Toni Belafonte",
      "character": "Vanessa"
    },
    {
      "id": "nm5279863",
      "name": "Talli Clemons",
      "character": "Streetz"
    },
    {
      "id": "nm1419977",
      "name": "Nakia Dillard",
      "character": "Chris"
    },
    {
      "id": "nm4988210",
      "name": "Bill Johnson",
      "character": "Father"
    },
    {
      "id": "nm6459035",
      "name": "Rahsona Elder",
      "character": "Mother"
    },
    {
      "id": "nm5715295",
      "name": "Sade Whiting",
      "character": "Gi Gi"
    },
    {
      "id": "nm5945365",
      "name": "Lynia Love",
      "character": "Tammi"
    },
    {
      "id": "nm5332804",
      "name": "Gabby Girma",
      "character": "Nurse"
    },
    {
      "id": "nm5945366",
      "name": "Jaleesa Jones",
      "character": ""
    },
    {
      "id": "nm6459036",
      "name": "Barbara Beddouk",
      "character": "Dance Student"
    },
    {
      "id": "nm6459037",
      "name": "Drusell De Vose",
      "character": "Jon Jon (Dance Student)"
    },
    {
      "id": "nm6152515",
      "name": "Robbie Newell",
      "character": "Mistress"
    },
    {
      "id": "nm5632260",
      "name": "Sid O'Connell",
      "character": "Bouncer"
    },
    {
      "id": "nm6459038",
      "name": "Terese Tunia",
      "character": "Waitress"
    }
  ],
  "overview": "Antonio (Jahmar Hill) is awakened from a coma; he was in for a year and a half after being shot by his father while trying to break up a domestic dispute between him and his mother. When Antonio wakes up he learns that his father who then committed suicide by shooting himself murdered his mother. With nowhere to go or a place to call home, Antonio turns to the cold streets of New York to find refuge and shelter. Antonio becomes the night shining armor to a stranger, Vanessa (Toni Belafonte) when he steps in to defend her from her abusive boyfriend, Streetz",
  "storyline": "Antonio (Jahmar Hill) is awakened from a coma he was in for a year and a half after being shot by his father while trying to break up a domestic dispute between him and his mother. When Antonio wakes up he learns that his father who then committed suicide by shooting himself murdered his mother. With nowhere to go or a place to call home, Antonio turns to the cold streets of New York to find refuge and shelter. Antonio becomes the knight in shining armor to a stranger, Vanessa (Toni Belafonte), when he steps in to defend her from her abusive boyfriend, Streetz (Talli Clemons).",
  "plot": "Perry Mason is a distinguished criminal defense lawyer practicing in Los Angeles, California. He represents clients, most of whom have been charged with murder. Each episode typically follows a formula. The first half of the show introduces a prospective murder victim and a situation that presents a legal danger to someone Mason accepts as a client. The body is found, often through circumstance by Mason and private investigator Paul Drake, or with his secretary Della Street. Clues point to Mason's client, who is charged with murder. In the second-half courtroom setting, Mason spars most often with his legal adversary Hamilton Burger, Los Angeles district attorney, and police homicide detective Lt. Arthur Tragg. Mason establishes his client's innocence by dramatically demonstrating the guilt of another character.[a] The murderer often breaks down and confesses to the crime in the courtroom. In the closing scene, the characters gather together to discuss how the case was solved.\n\nIn many episodes, the identity of the guilty party is uncovered without an actual trial being held. Instead, this occurs at the preliminary hearing stage, in which the district attorney is required to produce just enough evidence to convince the judge that the defendant should be bound over for trial.[b] During this stage, other malefactors — such as blackmailers, frauds, and forgers — are frequently forced into confessions by Mason's relentless and clever questioning, and the killer is exposed.",
  "synopsis": null
}