{
  "imdb_id": "tt3262084",
  "tmdb_id": "281300",
  "douban_id": null,
  "title": "Imperfect (2012)",
  "genres": [
    "Action",
    "Crime"
  ],
  "country": "Singapore",
  "version": [
    {
      "runtime": "96 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.4,
  "director": [
    {
      "id": "nm6017262",
      "name": "Steve Cheng"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm3045647",
      "name": "Kimberly Chia",
      "character": "Shan Shan"
    },
    {
      "id": "nm4872152",
      "name": "Tsu-Ping Chiang",
      "character": "He Huifang"
    },
    {
      "id": "nm6017263",
      "name": "Ian Fang",
      "character": "Zach"
    },
    {
      "id": "nm5248156",
      "name": "Edwin Goh",
      "character": "He Jianhao"
    },
    {
      "id": "nm6017264",
      "name": "Elizabeth Lee",
      "character": "Izzy"
    },
    {
      "id": "nm3561327",
      "name": "Patrick Pei-hsu Lee",
      "character": "Nuo-ge"
    },
    {
      "id": "nm0508484",
      "name": "Nan Xing Li",
      "character": "Zhihua       (as Nanxing Li)"
    },
    {
      "id": "nm0514961",
      "name": "Kai Chi Liu",
      "character": "Wang Guodong"
    },
    {
      "id": "nm3841025",
      "name": "Wilson Ng",
      "character": "Mafia Boss"
    },
    {
      "id": "nm6017265",
      "name": "Xavier Ong",
      "character": "Alex"
    },
    {
      "id": "nm3389281",
      "name": "Yida Phua",
      "character": "Square"
    }
  ],
  "overview": "He Jianhao is released from the Boys' Home and his mother Huifang, is worried that he would be led astray again. Thus, she wants him to look after her stall in Bugis under her stepsister's supervision. Jian Hao's girlfriend Shanshan also manages to convince him to retake his O-levels. Jian Hao is getting back on the right path and his future seems promising. Jianhao's friend, Zach, joined a gang Yi Ren Tang to get protection as he is always bullied by Alex. Wang Guodong is a gang leader of 660 and also the father of Alex. Jianhao joined the Yi Ren Tang after much persuasion from Zach...",
  "storyline": "He Jianhao is released from the Boys' Home and his mother Huifang, is worried that he would be led astray again. Thus, she wants him to look after her stall in Bugis under her stepsister's supervision. Jian Hao's girlfriend Shanshan also manages to convince him to retake his O-levels. Jian Hao is getting back on the right path and his future seems promising. Jianhao's friend, Zach, joined a gang Yi Ren Tang to get protection as he is always bullied by Alex. Wang Guodong is a gang leader of 660 and also the father of Alex. Jianhao joined the Yi Ren Tang after much persuasion from Zach...",
  "plot": "After getting into a teen brawl to protect his friend, Zach (Ian Fang), one night while watching a Getai performance, Jianhao (Edwin Goh) gets sent to a Boys' Home for six months. He decides to start afresh, working hard to retake his O-levels with the help of his girlfriend Shan Shan (Kimberly Chia). His mother, Huifang (Chiang Tsu-ping), arranges for him to help out in her stall at Bugis Street. However, due to his loyalty to his \"brother\" Zach, he follows him to join a triad gang, Yi Ren Tang, led by Zhihua (Li Nanxing) to get protection against a rival gang, Gang 660, which was run by their enemy, Alex's (Xavier Ong) father, Guodong (Liu Kai Chi). One day, during a fight between Gang 660 and Zach, Square (Phua Yida) and Jianhao, Zach uses a brick to hit Alex's head. As a result, Alex ends up in a vegetative state, and dies soon after. Guodong promises to take revenge for his son. The boys become fugitives overnight, running away from Guodong and the police. Huifang seeks Zhihua's help, revealing that Jianhao is actually his biological son which she refused to abort 17 years ago. Huifang begs Zhihua to save Jianhao. Zhihua agrees, and manages to find Jianhao. He wants to send him overseas to escape. However, before Jianhao sets off, Guodong and his gang finds both Jianhao and Zhihua, entering into yet another bloody fight. This time, Zhihua gets stabbed to death by Guodong. The police arrive in time just before Guodong is about to hit Zach with a metal pipe. Guodong, Zach and Jianhao get arrested and sent to jail. Jianhao is released before Zach, and decides to turn over a new leaf, with the encouragement of his mother, sister Xin Xin and Shan Shan.",
  "synopsis": null
}