{
  "imdb_id": "tt3284618",
  "tmdb_id": "272731",
  "douban_id": null,
  "title": "Pane e burlesque (2014)",
  "genres": [
    "Comedy"
  ],
  "country": "Italy",
  "version": [
    {
      "runtime": "86 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.8,
  "director": [
    {
      "id": "nm3466764",
      "name": "Manuela Tempesta"
    }
  ],
  "writer": [
    {
      "id": "nm3466764",
      "name": "Manuela Tempesta",
      "description": "story &"
    },
    {
      "id": "nm0116511",
      "name": "Massimiliano Bruno",
      "description": "story"
    },
    {
      "id": "nm3466764",
      "name": "Manuela Tempesta",
      "description": "screenplay &"
    },
    {
      "id": "nm2594938",
      "name": "Michela Andreozzi",
      "description": "screenplay and"
    },
    {
      "id": "nm0116511",
      "name": "Massimiliano Bruno",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0157098",
      "name": "Laura Chiatti",
      "character": "Matilde"
    },
    {
      "id": "nm0408234",
      "name": "Sabrina Impacciatore",
      "character": "Giuliana"
    },
    {
      "id": "nm2594938",
      "name": "Michela Andreozzi",
      "character": "Teresa"
    },
    {
      "id": "nm0350125",
      "name": "Caterina Guzzanti",
      "character": "Frida"
    },
    {
      "id": "nm0716897",
      "name": "Giovanna Rei",
      "character": "Viola"
    },
    {
      "id": "nm0502412",
      "name": "Edoardo Leo",
      "character": "Vincenzo"
    },
    {
      "id": "nm3527566",
      "name": "Raffaele Braia",
      "character": "Vito"
    },
    {
      "id": "nm4374878",
      "name": "Fabrizio Buompastore",
      "character": "Antonio"
    },
    {
      "id": "nm0094693",
      "name": "Marco Bonini",
      "character": "Mago Zep"
    },
    {
      "id": "nm0287398",
      "name": "Domenico Fortunato",
      "character": "Gregorio"
    },
    {
      "id": "nm1493701",
      "name": "Pietro Naglieri",
      "character": "Elio"
    },
    {
      "id": "nm6541374",
      "name": "Aurora Roca",
      "character": "Lisa"
    },
    {
      "id": "nm0056948",
      "name": "Teodosio Barresi",
      "character": "Nonno Ernesto"
    },
    {
      "id": "nm6284810",
      "name": "Giulia Lapertosa",
      "character": "Divette mora"
    },
    {
      "id": "nm2664187",
      "name": "Anna Terio",
      "character": "Divette rossa"
    },
    {
      "id": "nm2959621",
      "name": "Lodovica Mairè Rogati",
      "character": "Divette bionda       (as Lodovica Mariè Rogati)"
    },
    {
      "id": "nm7898032",
      "name": "Kecco Recchia",
      "character": "Giovane Cantante"
    },
    {
      "id": "nm7378057",
      "name": "William Volpicella",
      "character": "Presentatore"
    }
  ],
  "overview": null,
  "storyline": null,
  "plot": "Ali Rose (Aguilera) moves to Los Angeles after she quits her bar job when her boss refuses to pay her. Once in L.A., she tries and fails at every audition she does until one night, she finds herself unknowingly in a burlesque club when she hears the music on the street. She finds Tess (Cher) and the dancers performing “Welcome to Burlesque” and decides to pursue a career on stage once she meets Jack (Gigandet). Jack refers her to Tess for an audition, but she is rejected instantly and ushered out by Sean (Tucci). Instead of leaving, Ali begins serving customers at the club as a waitress, while Tess and Sean observe with Jack asking Tess to give Ali a chance.\n\nWhen Georgia (Hough) becomes pregnant, auditions are held to replace her. Ali begins her audition when everyone leaves, and after performing \"Wagon Wheel Watusi\", persuades Tess to allow her to become one of the club's dancers, much to the annoyance of Nikki (Bell), the lead performer who is always late and caught drinking before numbers. One day Ali has to replace Nikki on stage because Nikki is too drunk to perform. Nikki sabotages the performance by turning off the music that the dancers usually lip sync to but before the curtain is dropped down, Ali impresses everyone with her amazing singing skills. Tess immediately decides to have Ali be the star of a whole new show at the club. It becomes increasingly popular and Ali enjoys her newfound stardom while Nikki fumes in the background. Despite the club's growing success, Tess is still unable to pay the bank all the money that she owes it.\n\nOne night after the club closes, Tess, worried with the club's economic prospects, sings \"You Haven't Seen the Last of Me\". A very jealous Nikki shows up drunk and picks a fight with Tess, calling Ali a \"slut with mutant lungs\". Tess, who has grown frustrated with Nikki, questions her gratitude for the help she has received. Angered, Nikki quits on the spot (before falsely claiming that she slept with Vince after his and Tess's honeymoon), and the altercation ends when Tess angrily retaliates by smashing the passenger side window on Nikki's convertible with a crowbar.\n\nTensions arise between Ali and Jack as Marcus grows increasingly infatuated with Ali, making Jack jealous. At Georgia's wedding, Jack appears to call off his engagement, getting drunk. That night, Ali and Jack sleep together, but the following morning Jack's fiancé, Natalie (Agron), returns unexpectedly from her play in New York City and tells Ali that the engagement is still on. Jack denies this, and while trying to fix things, he asks Ali to leave. Feeling heartbroken and betrayed, Ali runs to Sean for support, and learns that Sean is gay, due to his having spent the night with Georgia's wedding DJ the night before. While making coffee, Ali receives a call from Marcus, and Sean prompts her to go with Marcus after his phone call, while Sean and Mark (the DJ) go on a date.\n\nWhile spending time with Marcus, Ali finds out about \"air rights\", which refers to the empty space above a building and what can be done with it. Ali breaks things off with Marcus after she sees his plans to build a skyscraper on the property the club is on; Marcus protests this, asking why this suddenly makes him \"the bad guy\", to which Ali replies, \"It doesn't, Marcus. It just makes you the wrong guy\". Ali tells Tess about the predicament, and together they inform the owner of the new million-dollar condos across the street; fearing the loss of business that would result from the obstruction of his prospective tenants' view, he purchases the air rights to the club's property. The resulting money is enough for Tess to buy out Vince's share (as they are divorced and he wanted out of the club), pay off the bank, and re-fashion the club to her own vision. She also makes up with Nikki, who tells Tess that she claimed she slept with Vince just to hurt her, and rehires her at the club after Nikki tells her she wants to \"come home\". In the end, Ali, having reunited with Jack after he tells her that it's over with Natalie for good, and earned Nikki's respect, performs \"Show Me How You Burlesque\", written by Jack (who refused to allow Ali to listen or see his music throughout the movie due to it being \"not ready\") with all of the dancers, much to the crowds' delight.",
  "synopsis": null
}