{
  "imdb_id": "tt3289944",
  "tmdb_id": "238018",
  "douban_id": null,
  "title": "The Christmas Ornament (TV Movie 2013)",
  "genres": [
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "83 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm0419865",
      "name": "Mark Jean"
    }
  ],
  "writer": [
    {
      "id": "nm0920114",
      "name": "Bill Wells",
      "description": "teleplay and"
    },
    {
      "id": "nm0924896",
      "name": "J.B. White",
      "description": "teleplay"
    },
    {
      "id": "nm0920114",
      "name": "Bill Wells",
      "description": "story"
    }
  ],
  "cast": [
    {
      "id": "nm0005192",
      "name": "Kellie Martin",
      "character": "Kathy Howard"
    },
    {
      "id": "nm0558950",
      "name": "Cameron Mathison",
      "character": "Tim Pierce"
    },
    {
      "id": "nm0821612",
      "name": "Jewel Staite",
      "character": "Jenna Lowe"
    },
    {
      "id": "nm2063811",
      "name": "Brendan Meyer",
      "character": "Connor"
    },
    {
      "id": "nm2254636",
      "name": "Matthew Kevin Anderson",
      "character": "Ben Lowe"
    },
    {
      "id": "nm5595481",
      "name": "Cole Vigue",
      "character": "Graham"
    },
    {
      "id": "nm0646955",
      "name": "Nicole Oliver",
      "character": "Sarah"
    },
    {
      "id": "nm0227459",
      "name": "Stephen Dimopoulos",
      "character": "Mario"
    },
    {
      "id": "nm0909657",
      "name": "Gwynyth Walsh",
      "character": "Eve Atkinson"
    },
    {
      "id": "nm1733480",
      "name": "Ian Carter",
      "character": "Middle Aged Man"
    },
    {
      "id": "nm1345167",
      "name": "Evans Johnson",
      "character": "Andrea"
    },
    {
      "id": "nm0579728",
      "name": "Laura Mennell",
      "character": "Rebecca"
    },
    {
      "id": "nm0201437",
      "name": "Linda Darlow",
      "character": "Vanessa"
    },
    {
      "id": "nm6102712",
      "name": "Phillip David Lee",
      "character": "Andrea's Husband"
    },
    {
      "id": "nm0501971",
      "name": "Nels Lennarson",
      "character": "Dale"
    }
  ],
  "overview": "Newly widowed Kathy plans to skip out on decking the halls and trimming the tree this Christmas, trying to avoid anything that will bring back memories of her late husband. The only Christmas tradition she will observe is baking cookies for her friends, a passion since she was a child. When Kathy meets handsome Christmas tree shop owner Tim, their undeniable chemistry - along with an ornament Tim gives her that symbolizes hope - helps Kathy open up to the joys of the season again. With the support of her best friend Jenna, and the budding relationship with Tim, Kathy begins to embrace the hopeful message of the ornament.  Although Kathy wants to take a chance on Tim, she struggles to find the balance between preserving the memory of her husband and moving on with her own future. Is the Christmas ornament a sign that she can have a hopeful future?",
  "storyline": "Newly widowed Kathy plans to skip out on decking the halls and trimming the tree this Christmas, trying to avoid anything that will bring back memories of her late husband. The only Christmas tradition she will observe is baking cookies for her friends, a passion since she was a child. When Kathy meets handsome Christmas tree shop owner Tim, their undeniable chemistry - along with an ornament Tim gives her that symbolizes hope-helps Kathy open up to the joys of the season again. With the support of her best friend Jenna, and the budding relationship with Tim, Kathy begins to embrace the hopeful message of the ornament. Although Kathy wants to take a chance on Tim, she struggles to find the balance between preserving the memory of her husband and moving on with her own future. Is the Christmas ornament a sign that she can have a hopeful future?",
  "plot": "A young widow, Kathy (Kellie Martin), is not putting up a Christmas tree this year. For years, she and her recently deceased husband gave each other Christmas ornaments as gifts that represented their love for each other. Now she keeps those ornaments locked away in order to avoid memories of her tragic loss. The only holiday tradition she observes now is baking Christmas cookies for her friends, which she's been doing since childhood.\n\nShortly before Christmas, Kathy meets a handsome Christmas tree shop owner, Tim (Cameron Mathison), who tries to sell her a tree, but is initially unsuccessful. The two are attracted to each other, and soon she accepts a tree from him as a gift, as well as an ornament that symbolizes hope for her. She helps him deliver his trees, and he helps her start a new cookie business—something she's always dreamed of doing—and brings the joy of the Christmas season back into her life.\n\nSupported by her best friend, Jenna (Jewel Staite), and her newfound feelings of love for Tim, Kathy starts to accept the message of hope symbolized by Tim's ornament. Their relationship, however, is complicated by her memories of her husband and by Tim's ex-girlfriend who comes back into his life unexpectedly. As Christmas approaches, they come to realize how much their love means to each other and their future together.",
  "synopsis": null
}