{
  "imdb_id": "tt3220100",
  "tmdb_id": "357054",
  "douban_id": null,
  "title": "The Suffering (2016)",
  "genres": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "105 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.4,
  "director": [
    {
      "id": "nm3581002",
      "name": "Robert Hamilton"
    }
  ],
  "writer": [
    {
      "id": "nm3581002",
      "name": "Robert Hamilton",
      "description": null
    },
    {
      "id": "nm3993900",
      "name": "Marco V. Scola",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2904130",
      "name": "Phil Amico",
      "character": "Mr. Remiel"
    },
    {
      "id": "nm3533879",
      "name": "Nick Apostolides",
      "character": "Henry Dawles"
    },
    {
      "id": "nm4132160",
      "name": "Liz Christmas",
      "character": "Selena"
    },
    {
      "id": "nm4590660",
      "name": "Elizabeth Deo",
      "character": "Rebecca Dawles"
    },
    {
      "id": "nm3845384",
      "name": "Kina Gee",
      "character": "Nurse"
    },
    {
      "id": "nm5996112",
      "name": "Chappy Gould",
      "character": "Creature 1"
    },
    {
      "id": "nm5996113",
      "name": "Timo Gould",
      "character": "Creature 2"
    },
    {
      "id": "nm3930780",
      "name": "Lee Hamilton",
      "character": "Mrs. Gates"
    },
    {
      "id": "nm5996225",
      "name": "Fahim Hussaini",
      "character": "Creature 3       (as Fahim Hussaaini)"
    },
    {
      "id": "nm5996114",
      "name": "Reed Peltier",
      "character": "Child"
    },
    {
      "id": "nm4322472",
      "name": "Chad Eric Smith",
      "character": "Ahmad"
    },
    {
      "id": "nm3279400",
      "name": "Carl Stevens",
      "character": "Rail Thin Man"
    },
    {
      "id": "nm1625868",
      "name": "Regen Wilson",
      "character": "Driver"
    }
  ],
  "overview": "A man fights for his sanity when he finds himself trapped on a rural farm inhabited by sinister beings overseen by a mysterious caretaker.",
  "storyline": "Property appraiser Henry Dawles must fight for his sanity when he finds himself trapped on a rural farm owned by mysterious caretaker, Mr. Remiel. As the threat to Henry escalates, he is forced to face the horror of the farm and uncover the dark mysteries of Remiel, and the sinister beings he encounters.",
  "plot": "Note: This plot synopsis details the \"good ending\"\n\nThe game begins as Torque (who never speaks) is being escorted by CO Ernesto Alvarez (voiced by Mark Dias) onto death row in Abbott State Penitentiary on Carnate Island, off the coast of Maryland, an island with a long and troubled history. Torque has been sentenced to death for murdering his ex-wife and their two children, although he claims to have blacked out during the incident, and can remember nothing. Shortly after entering his cell, an earthquake rocks the prison, and moments later, all of the inmates on death row except Torque are killed by strange creatures. One of the creatures opens Torque's cell, and he sets out to escape. After seeing several guards killed by the creatures, Torque uses security monitors to find the entire prison is under attack. He then gets a phone call from his dead wife, Carmen (Rafeedah Keys), telling him the island is more than a prison, that it brings out evil in everyone, and advising him to escape as soon as he can.\n\nDescending to the basement, he soon encounters the spirits of three of Abbot's most famous occupants. Dr. Killjoy (voiced by John Armstrong) was a psychiatrist/surgeon who ran an insane asylum on the island in the 1920s. Obsessed with discovering what is wrong with Torque, Killjoy appears as an image projected from 16 mm film projectors. Hermes T. Haight (John Patrick Lowrie) was the executioner in Abbot for twenty-seven years, before he committed suicide in the gas chamber. He appears as a green vapor formed into the shape of a human. Hermes is determined to drive Torque into unleashing the evil inside him. Horace P. Gauge (John Armstrong) was an inmate who was executed in the electric chair for murdering his wife during a conjugal visit. Full of guilt for his actions, he claims Carnate drove him to it, and wants to help Torque realize his decency. He appears in the form of electricity. They teach Torque how to unleash the anger inside himself and transform into a powerful monster, although the transformation is only in Torque's mind.\n\nTorque then encounters a fellow inmate, Dallas (Mark Berry), who he knows from his previous prison, Eastern Correctional Institution. They head through the eastern cellblock, where Torque has a vision of Carmen, who explains why she left him; when he was incarcerated for the second time, she knew she needed to make a change to her life. Torque and Dallas make it to the loading bay, and Torque heads to the control room, opening the doors, and allowing Dallas to escape. However, a fire starts, preventing Torque from following. He then hears a call from Consuela Alvarez (Meg Savlov), Ernesto's wife, asking Ernesto to call her. She tells him that herself and the girls are fine, but there is a fire in the nearby forest getting closer to their house.\n\nTorque heads to the western cellblock, where he has another vision of Carmen, telling him she is pregnant but is filing for divorce. Torque heads to the radio room, finding the radio is working, but something from the asylum is preventing communication with the mainland. Torque heads to the asylum, and encounters Killjoy, who is determined to 'cure' him using his \"Rebirth Machine.\" Torque fights through a series of tests set by Killjoy before destroying all his projectors. Killjoy then tells Torque to return to the prison, where he will give him his diagnosis.\n\nTorque heads back to Abbot by way of the beach, where he encounters Clem (Ross Douglas), an elderly inmate who was in the middle of an escape when the earthquake struck. Clem has a small one-person boat ready to sail, but needs Torque's help fighting creatures emerging from a wrecked slave ship before he can leave. Torque sets fire to the wreck, enabling Clem to escape. He enters Abbot's sewer system where he encounters Horace, who tells him Abbot wants his soul. He then heads to the electric chair, destroying it and releasing Horace's spirit. Returning to death row, he finds Killjoy's diagnosis, and then returns to the radio room. Successfully sending a signal, he learns a Coast Guard vessel is on the way. However, Carnate's lighthouse is not working, and must be reactivated before the vessel can approach the island. Torque heads to the lighthouse, passing through the old military barracks, Fort Maleson. In the fort, he encounters Hermes, who forces him to fight. Torque defeats him by using pressurized gas to push Hermes into a furnace. He continues to the lighthouse, outside of which he meets Ernesto Alverez, who is trying to find his family. They restore power, and reactivate the lighthouse, arranging to meet the ship at the dock.\n\nThey then head to the nearby village to look for Alverez' family. The gate to town is locked, but in return for freeing his soul, Horace opens it. They then encounter a broken bridge, but, impressed with Torque's efforts to kill him, Hermes helps them cross. As they near the village, however, they are separated by a fire, and Alverez goes on alone, telling Torque to get to the docks. As he arrives, he encounters Killjoy, who tells him to cure himself he must face what awaits him, and only by using the Rebirth Machine can he defeat it. Torque heads to the docks where he encounters a massive creature with a miniature version of himself protruding from its stomach. Torque fights and defeats the creature, finally remembering what happened to his family; they were murdered by two hitmen, one of whom told Torque \"the Colonel sends his regards. Back in Eastern, he warned you, but you didn't listen. He said to leave you alive. Only you. Enjoy your new life.\" Torque heads to the docks and is picked up by the coastguard. On the boat, the captain recognizes him, telling him his case has been reopened and the prosecutor indicted, with a retrial likely. The game ends with the boat sailing away from Carnate.\nAlternate endings\n\nBad ending\n\nAfter Torque defeats the creature, he remembers the murders, realizing that he was the one who killed his family; he smashed his wife's head in, drowned his youngest son, and threw his eldest son from the window. When the coast guard arrives, Torque transforms into his monster state and kills him, before running back into the woods of Carnate.\n\nNeutral ending\n\nAfter Torque defeats the creature, he remembers the murders. During an argument with his wife, he pushed her, and she accidentally knocked her head against the bedside table. Seeing his mother dead, Torque's eldest son, Cory, drowns his younger brother and then jumps from the upstairs window, telling Torque, \"You took her away, I'm taking us away.\" When the coastguard arrives, Torque knocks him out and commandeers the boat, sailing away from Carnate.",
  "synopsis": null
}