{
  "imdb_id": "tt3234082",
  "tmdb_id": "236059",
  "douban_id": null,
  "title": "12",
  "genres": [
    "Documentary"
  ],
  "country": "USA",
  "version": [],
  "imdb_rating": 5.1,
  "director": [
    {
      "id": "nm0052737",
      "name": "Amir Bar-Lev"
    },
    {
      "id": "nm2932640",
      "name": "Charlie Lightening"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm0000954",
      "name": "Jon Bon Jovi",
      "character": "Himself"
    },
    {
      "id": "nm0002008",
      "name": "Eric Clapton",
      "character": "Himself"
    },
    {
      "id": "nm0002032",
      "name": "Roger Daltrey",
      "character": "Himself"
    },
    {
      "id": "nm0218752",
      "name": "Michael Dempsey",
      "character": "Himself"
    },
    {
      "id": "nm2642203",
      "name": "James L. Dolan",
      "character": "Himself       (as James Dolan)"
    },
    {
      "id": "nm0342970",
      "name": "Dave Grohl",
      "character": "Himself       (as David Grohl)"
    },
    {
      "id": "nm0001396",
      "name": "Mick Jagger",
      "character": "Himself"
    },
    {
      "id": "nm0005055",
      "name": "Billy Joel",
      "character": "Himself"
    },
    {
      "id": "nm1006024",
      "name": "Alicia Keys",
      "character": "Herself"
    },
    {
      "id": "nm1112874",
      "name": "Chris Martin",
      "character": "Himself"
    },
    {
      "id": "nm0005200",
      "name": "Paul McCartney",
      "character": "Himself"
    },
    {
      "id": "nm0724189",
      "name": "Keith Richards",
      "character": "Himself"
    },
    {
      "id": "nm0001674",
      "name": "Chris Rock",
      "character": "Himself"
    },
    {
      "id": "nm0001191",
      "name": "Adam Sandler",
      "character": "Himself"
    },
    {
      "id": "nm0819803",
      "name": "Bruce Springsteen",
      "character": "Himself"
    },
    {
      "id": "nm0005468",
      "name": "Michael Stipe",
      "character": "Himself"
    },
    {
      "id": "nm0843068",
      "name": "John Sykes",
      "character": "Himself"
    },
    {
      "id": "nm0870175",
      "name": "Pete Townshend",
      "character": "Himself       (as Pete Townsend)"
    },
    {
      "id": "nm0891641",
      "name": "Eddie Vedder",
      "character": "Himself"
    },
    {
      "id": "nm3653860",
      "name": "Alexander J. Vietmeier",
      "character": "Himself - Live Show AD"
    },
    {
      "id": "nm0914166",
      "name": "Roger Waters",
      "character": "Himself"
    },
    {
      "id": "nm0915115",
      "name": "Charlie Watts",
      "character": "Himself"
    },
    {
      "id": "nm0005544",
      "name": "Harvey Weinstein",
      "character": "Himself"
    },
    {
      "id": "nm1577190",
      "name": "Kanye West",
      "character": "Himself"
    }
  ],
  "overview": "A mix of live performances and behind-the-scenes footage from the televised benefit concert to raise relief funds for victims of Hurricane Sandy in 2012.",
  "storyline": "A mix of live performances and behind-the-scenes footage from the televised benefit concert to raise relief funds for victims of Hurricane Sandy in 2012.",
  "plot": "In 1841, Solomon Northup is a free African-American man working as a violinist, living with his wife and two children in Saratoga Springs, New York. Two white men, Brown and Hamilton, offer him short-term employment as a musician if he will travel with them to Washington, D.C. However, once they arrive, the duo drug Northup and conspire to deliver him to a slave pen run by a man named Burch. Northup is later shipped to New Orleans along with others who have been detained against their will. A slave trader named Freeman gives Northup the identity of \"Platt\", a runaway slave from Georgia, and sells him to plantation owner William Ford. Due to tension between Northup and another plantation worker, Ford sells him to another slave owner named Edwin Epps. In the process, Northup attempts to explain that he is actually a free man, but to no avail.\n\nAt the plantation, Northup meets Patsey, a favored slave, whom Epps regularly rapes and abuses. Some time later, an outbreak of cotton worm befalls Epps's plantation. Unable to work his fields, Epps leases his slaves to a neighboring plantation for the season. While there, Northup gains the favor of the plantation's owner, Judge Turner, who allows him to play the fiddle at a neighbor's wedding anniversary celebration, and to keep his earnings. When Northup returns to Epps, he attempts to use the money to pay a white field hand and former overseer, Armsby, to mail a letter to his friends in New York state. Armsby agrees to deliver the letter, and accepts Northup's saved money in return, but later betrays him to Epps. Northup is narrowly able to convince Epps that Armsby is lying and avoids punishment.\n\nNorthup begins working on the construction of a gazebo with a Canadian laborer named Samuel Bass. Bass is unsettled by the brutal way that Epps treats his slaves and expresses his opposition to slavery, earning Epps's enmity. Northup later reveals his kidnapping to Bass. Once again, Northup asks for help in getting a letter to Saratoga Springs. Bass, risking his life, agrees to send it. One day, Northup is called over by the local sheriff, who arrives in a carriage with another man. The sheriff asks Northup a series of questions to confirm his answers match the facts of his life in New York. Northup recognizes the sheriff's companion as Mr. Parker, a shopkeeper he knew in Saratoga. Parker has come to free him, and the two embrace, though an enraged Epps furiously protests the circumstances and tries to prevent him from leaving.\n\nAfter being enslaved for 12 years, Northup is restored to freedom and returned to his family; leaving behind the other slaves, including Patsey. As he walks into his home, he sees his wife with their son and daughter and her husband, who present him with his grandson and namesake, Solomon Northup Staunton. The film's epilogue displays a series of graphics recounting Northup's unsuccessful suits against Brown, Hamilton and Burch, along with the 1853 publication of Northup's slave narrative memoir, Twelve Years a Slave. The memoir describes his role in the abolitionist movement, and the mystery surrounding details of his death and burial.",
  "synopsis": "On December 12, 2012, some of entertainments most iconic names came together at Madison Square Garden for a historic concert to benefit the victims of Hurricane Sandy. 12-12-12 captures the unprecedented gathering of talent who turned up on stage and behind the scenes to raise over $50 million in one night for the Robin Hood Hurricane Sandy Relief Fund to support organizations helping victims in New York, New Jersey and Connecticut. The evenings Emmy Award-nominated telecast included performances by some of the music industrys legendary acts: Bruce Springsteen and the E Street Band, Billy Joel, Alicia Keys, Paul McCartney, Dave Grohl, Roger Waters, Eddie Vedder, Chris Martin, Michael Stipe, Adam Sandler, Eric Clapton, Jon Bon Jovi, The Rolling Stones, The Who, Kanye West and included involvement from entertainment and media elite such as Billy Crystal, Susan Sarandon, Paul Shaffer, Brian Williams, Kristen Stewart, Jon Stewart, Chelsea Clinton, Jimmy Fallon, Stephen Colbert, Sean Combs, Olivia Wilde, Steve Buscemi, Chris Rock, Seth Meyers, Jake Gyllenhaal, Blake Lively, Katie Holmes, Jason Sudekis, Jamie Foxx, Quentin Tarantino, and Christoph Waltz on this historic night."
}