{
  "imdb_id": "tt3202500",
  "tmdb_id": "257132",
  "douban_id": null,
  "title": "The Ambassador to Bern (TV Movie 2014)",
  "genres": [
    "Drama",
    "History",
    "Thriller"
  ],
  "country": "Hungary",
  "version": [
    {
      "runtime": "76 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm1889381",
      "name": "Attila Szász"
    }
  ],
  "writer": [
    {
      "id": "nm2146818",
      "name": "Norbert Köbli",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0474603",
      "name": "János Kulka",
      "character": "Koroknai"
    },
    {
      "id": "nm2376760",
      "name": "Tamás Szabó Kimmel",
      "character": "Ábel"
    },
    {
      "id": "nm2375076",
      "name": "József Kádas",
      "character": "Bános"
    },
    {
      "id": "nm3072413",
      "name": "Rozi Lovas",
      "character": "Hajni"
    },
    {
      "id": "nm1167934",
      "name": "Rémusz Szikszai",
      "character": "Vermes"
    },
    {
      "id": "nm0457189",
      "name": "László I. Kish",
      "character": "Lambert"
    },
    {
      "id": "nm1634838",
      "name": "Mónika Balsai",
      "character": "Edina"
    },
    {
      "id": "nm2334332",
      "name": "Ádám Lábodi",
      "character": "Radó"
    },
    {
      "id": "nm0843741",
      "name": "Mariann Szalay",
      "character": "Ági"
    },
    {
      "id": "nm1013094",
      "name": "László Katona",
      "character": "Vince"
    },
    {
      "id": "nm1433000",
      "name": "Péter Takátsy",
      "character": "Gottman"
    },
    {
      "id": "nm2986374",
      "name": "András Jáger",
      "character": "Hadnagy"
    },
    {
      "id": "nm1381783",
      "name": "Zoltán Tamási",
      "character": "Kelemen"
    },
    {
      "id": "nm0959209",
      "name": "Sarolta Zöldhegyi",
      "character": "Kelemenné"
    },
    {
      "id": "nm2058054",
      "name": "Gábor Maday",
      "character": "Rendõr"
    },
    {
      "id": "nm3793759",
      "name": "Júlia Huzella",
      "character": "Teréz"
    },
    {
      "id": "nm0253219",
      "name": "Ferenc Elek",
      "character": "Pongrácz       (voice)"
    },
    {
      "id": "nm0478045",
      "name": "Ákos Köszegi",
      "character": "Narrátor       (voice)"
    },
    {
      "id": "nm6318989",
      "name": "Nie Bang Guo",
      "character": "Lai attasé"
    },
    {
      "id": "nm6318990",
      "name": "Zijian Gyõzõ Yang",
      "character": "Tolmács"
    },
    {
      "id": "nm2270276",
      "name": "Caroline Schneider",
      "character": "Pincérnõ"
    },
    {
      "id": "nm6318991",
      "name": "Jolán Feldmayer",
      "character": "Magyar anya"
    },
    {
      "id": "nm6318992",
      "name": "Laura Kádár",
      "character": "Irodista lány"
    },
    {
      "id": "nm6318993",
      "name": "Péter Gönczöl",
      "character": "Kisfiú"
    },
    {
      "id": "nm6318994",
      "name": "Zoltán Albertzki",
      "character": "Kommandós"
    },
    {
      "id": "nm6318995",
      "name": "Róbert Bujtás",
      "character": "Kommandós"
    },
    {
      "id": "nm3990309",
      "name": "Glenn Clemann",
      "character": "Kommandós"
    },
    {
      "id": "nm6318996",
      "name": "Sándor Horváth",
      "character": "Kommandós"
    },
    {
      "id": "nm1517824",
      "name": "Attila László",
      "character": "Kommandós"
    }
  ],
  "overview": "A fictional account of the 1958 attack against the Hungarian embassy in Bern. Based on a true story about the aftermath of the 1956 Hungarian revolution.",
  "storyline": "On August 16, 1958 two Hungarian immigrants break into the Hungarian embassy in Bern and take the ambassador hostage. As the Swiss police surrounds the building and a group of Hungarian immigrants shows up on the street to demonstrate, a tense, twist-filled hostage drama plays out behind the closed doors of the embassy. Based on a true story.",
  "plot": "On November 4, 1979, Iranian activists storm the United States embassy in Tehran in retaliation for President Jimmy Carter giving the Shah asylum in the U.S. during the Iranian Revolution. 60 of the embassy staff are taken as hostages, but six avoid capture and hide in the home of Canadian ambassador Ken Taylor. With the escapees' situation kept secret, the U.S. State Department begins to explore options for exfiltrating them from Iran. Tony Mendez, a U.S. Central Intelligence Agency exfiltration specialist, is brought in for consultation. He criticizes the proposals, but is at a loss when asked for an alternative. While on the phone with his son, he is inspired by watching Battle for the Planet of the Apes and begins plans for creating a cover story for the escapees: that they are Canadian filmmakers who happened to be in Iran scouting exotic locations for a similar science-fiction film.\n\nMendez contacts John Chambers, a Hollywood make-up artist who had previously crafted disguises for the CIA. Chambers puts Mendez in touch with film producer Lester Siegel. Together, they set up a phony film production company, publicize their plans, and successfully establish the pretense of developing Argo, a \"science fantasy adventure\" in the style of Star Wars, to lend credibility to the cover story. Meanwhile, the escapees grow frantic inside the ambassador's residence. The revolutionaries reassemble embassy photographs shredded before the takeover and learn that some personnel have escaped.\n\nPosing as a producer for Argo, Mendez enters Iran under the fake name Kevin Harkins and links up with the six escapees. He provides them with Canadian passports and fake identities to prepare them to get through security at the airport. Although afraid to trust Mendez's scheme, they reluctantly go along with it, knowing that he is risking his own life too. A scouting visit to the bazaar to maintain their cover story takes a bad turn, but their Iranian culture contact gets them away from the hostile crowd.\n\nMendez is told that the operation has been cancelled to avoid conflicting with a planned military rescue of the hostages. He pushes ahead, forcing his boss Jack O'Donnell to hastily re-obtain authorization for the mission to get tickets on a Swissair flight. Tension rises at the airport, where the escapees' flight reservations are confirmed at the last minute, and a guard's call to the supposed production company in Hollywood is answered at the last second. The group boards the plane, which takes off just as the Revolutionary Guards at the airport uncover the ruse and try to stop them.\n\nTo protect the hostages remaining in Tehran from retaliation, all U.S. involvement in the rescue is suppressed and full credit is given to the Canadian government and its ambassador (who left Iran with his wife under their own credentials as the operation was underway). The ambassador's Iranian housekeeper, who had known about the Americans and lied to the revolutionaries to protect them, escaped to Iraq. Mendez is awarded the Intelligence Star, but due to the mission's classified nature, he would not be able to officially receive the medal until the details were publicized in 1997.",
  "synopsis": null
}