{
  "imdb_id": "tt3211518",
  "tmdb_id": "230603",
  "douban_id": null,
  "title": "Zum Beispiel Suberg (2013)",
  "genres": [
    "Documentary"
  ],
  "country": "Switzerland",
  "version": [
    {
      "runtime": "90 min",
      "description": "original"
    }
  ],
  "imdb_rating": 8.0,
  "director": [
    {
      "id": "nm2335125",
      "name": "Simon Baumann"
    }
  ],
  "writer": [
    {
      "id": "nm2335125",
      "name": "Simon Baumann",
      "description": null
    },
    {
      "id": "nm3274669",
      "name": "Kathrin Gschwend",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3811742",
      "name": "Ruedi Baumann",
      "character": "Ruedi Baumann"
    },
    {
      "id": "nm2335125",
      "name": "Simon Baumann",
      "character": "Simon Baumann"
    },
    {
      "id": "nm5969762",
      "name": "Stephanie Baumann",
      "character": "Stephanie Baumann"
    },
    {
      "id": "nm5969763",
      "name": "Männerchor Suberg",
      "character": "Männerchor Suberg"
    }
  ],
  "overview": "It's about a little village in Switzerland, and about one guy who lives there since 32 years and doesn't know anyone there...",
  "storyline": "Suberg. 475 meters above the sea, 612 inhabitants. A train station, a school, a tavern and a fertilizer factory. An average village in the Swiss Plateau. Within only three decades, this sleepy farmers' village has turned into an anonymous dormitory village. Simon Baumann has lived in Suberg since he was born. For 32 years, however, the filmmaker has successfully ignored the village and its inhabitants. Unlike his grandfather, who was a central figure in the village, he hardly knows anybody here. The filmmaker wants to change this now and tries to establish contact with the villagers. But how to integrate into a village that offers hardly any village community anymore? And why is it like that? Searching for answers, Simon meets people who have characterized Suberg and its development, deals with the concepts of life of his ancestors and finds with the male choir a last small oasis of community spirit.",
  "plot": null,
  "synopsis": null
}