{
  "imdb_id": "tt3232142",
  "tmdb_id": "249173",
  "douban_id": null,
  "title": "Blood Type (2013)",
  "genres": [
    "Documentary",
    "Action",
    "Drama",
    "War"
  ],
  "country": "Estonia",
  "version": [
    {
      "runtime": "67 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.0,
  "director": [
    {
      "id": "nm2119268",
      "name": "Leeni Linna"
    }
  ],
  "writer": [
    {
      "id": "nm2119268",
      "name": "Leeni Linna",
      "description": "writer"
    }
  ],
  "cast": null,
  "overview": "What blood calls a man to war? BLOOD TYPE is a reflective documentary about professional Estonian soldiers in the Afghan war. The deeply personal revelations of the warriors are woven in with footage of their daily dangers, forming an intimate portrait of the soldiers' day-to-day struggles. Their stressful job and haunting fear to lose their legs echo the destiny of Andrei, who lost his leg in the Afghan war two years ago. Having returned to homeland, Andrei gives his all to reunite with his blood brothers on the battle field despite his disability. What is the spiritual journey of a soldier? What kind of responsibility does he have to his brothers in arms, his family, and the locals? By showing the cooperation between Estonians and Afghans, the film is looking for the imprint that might be left behind once the international forces have been withdrawn from the distant Afghanistan.",
  "storyline": "In 2008, a 25-year-old Estonian junior sergeant Andrei lost his right leg during the mission in Afghanistan. Two years later, the young man walks with the help of his artificial leg among other soldiers in the woods, planning to rejoin the mission. The film follows his objectives and the way he reaches them. It would be the first, unprecedented case in Estonian history that a crippled soldier is sent back to the mission. What is the reason the soldier wants to go back to the war zone? What will happen if he will not be allowed to go back for medical reasons?",
  "plot": null,
  "synopsis": null
}