{
  "imdb_id": "tt3288508",
  "tmdb_id": "218217",
  "douban_id": null,
  "title": "Arikil Oraal (2013)",
  "genres": [
    "Mystery"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "145 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm5407951",
      "name": "Sunil Ibrahim"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm3557375",
      "name": "Shine Tom Chacko",
      "character": "Alfred"
    },
    {
      "id": "nm2445419",
      "name": "Lena",
      "character": "Arathi"
    },
    {
      "id": "nm2463487",
      "name": "Ramya Nambeeshan",
      "character": "Veena"
    },
    {
      "id": "nm4028885",
      "name": "Nivin Pauly",
      "character": "Icha"
    },
    {
      "id": "nm0693092",
      "name": "Prathap Pothen",
      "character": "Sudheer Bose"
    },
    {
      "id": "nm5398845",
      "name": "Riya Saira",
      "character": "Helen"
    },
    {
      "id": "nm4584689",
      "name": "Sunil Sukhada",
      "character": ""
    },
    {
      "id": "nm1011348",
      "name": "Indrajith Sukumaran",
      "character": "Siddharth       (as Indrajith)"
    }
  ],
  "overview": "The story revolves around five people who are enjoying their life in Kochi. Indrajith Sukumaran plays a creative ad director; Remya Nambeesan as Veena plays a trained dancer; Nivin Pauly plays a waiter at a cafe; Prathap Pothen plays a psychologist; and Lena Abhilash plays the head of a corporation.",
  "storyline": "A creative executive at an advertising agency and his girlfriend try to solve the mystery of their friend Icha who seemingly starts to appear at two different places at the same time.",
  "plot": "Sidharth (Indrajith) is the creative head of a prominent advertising agency. He has just been transferred to Kochi from Bangalore. Veena is Siddhu's girlfriend and runs a contemporary dance troupe. Icha (Nivin Pauly) is Veena's friend and a waiter in an upmarket coffee shop. When they fail to find a suitable place for Siddhu to stay, Veena suggests that he share Icha's place until he finds his own accommodation. Siddhu instantly agrees, but Icha agrees reluctantly. Soon Siddharth and his girlfriend Veena find themselves caught in a horrific riddle - they find Icha at two different places at the same time. Their search for answers turns to be a brilliant psychological probe of Siddharth, who is actually imagining the 2nd icha. This forms the crux of the story.",
  "synopsis": null
}