{
  "imdb_id": "tt3265408",
  "tmdb_id": "294073",
  "douban_id": null,
  "title": "Tokyo Shutter Girl (2013)",
  "genres": [
    "Drama"
  ],
  "country": "Japan",
  "version": [],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm6020212",
      "name": "Motoyuki Kobayashi"
    },
    {
      "id": "nm2938030",
      "name": "Kôtarô Terauchi"
    },
    {
      "id": "nm0856802",
      "name": "Macoto Tezuka"
    }
  ],
  "writer": [
    {
      "id": "nm6020220",
      "name": "Ken'ichi Kiriki",
      "description": "manga"
    },
    {
      "id": "nm0856802",
      "name": "Macoto Tezuka",
      "description": "screenplay &"
    },
    {
      "id": "nm6020212",
      "name": "Motoyuki Kobayashi",
      "description": "screenplay &"
    },
    {
      "id": "nm2938030",
      "name": "Kôtarô Terauchi",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm6020219",
      "name": "Kôhei Hiramitsu",
      "character": "Kojiro Onoda"
    },
    {
      "id": "nm6020218",
      "name": "Noriyuki Ohashi",
      "character": "Hiroki Tamashiro"
    },
    {
      "id": "nm4048450",
      "name": "Kirara Asuka",
      "character": "Mikako Kawai"
    },
    {
      "id": "nm4960899",
      "name": "Takemi Fujii",
      "character": "Ayumi Yumeji"
    },
    {
      "id": "nm6020216",
      "name": "Yûsei Kiyota",
      "character": "Hiroki Tamashiro"
    },
    {
      "id": "nm6020213",
      "name": "Aoi Natsume",
      "character": "Ayumi Yumeji"
    },
    {
      "id": "nm4515172",
      "name": "Mami Nishino",
      "character": "Madoka Haruna"
    },
    {
      "id": "nm6020214",
      "name": "Satsuki Ohnishi",
      "character": "Mika"
    },
    {
      "id": "nm6020215",
      "name": "Kaho Taguchi",
      "character": "Sumire Minato"
    },
    {
      "id": "nm5331220",
      "name": "Mirei Tanaka",
      "character": "Ayumi Yumeji"
    },
    {
      "id": "nm2421044",
      "name": "Herbie Yamaguchi",
      "character": "Hosomura"
    },
    {
      "id": "nm6020217",
      "name": "Sôjirô Yoshimura",
      "character": "Genki"
    }
  ],
  "overview": "The movie Tokyo Shutter Girl, based on the comic series by Kenichi Kiriki, consists of three separate works by three separate directors, each set in Tokyo. It is about three Japanese schoolgirls in a photo club.",
  "storyline": "Based on the Tokyo Shatta Garu manga series, the film chronicles the girls who are members of their high school's photo club as they experience their environment photographing and filming around Tokyo. The story is comprised of three segments each focusing on a separate girl with each piece directed by a different person.",
  "plot": "Ben Shaw (Joshua Jackson) and his new bride, Jane (Rachael Taylor), leave New York City for Tokyo, Japan, where Ben has a job as a photographer. While travelling by car in the wilderness of the countryside, Jane accidentally hits a girl standing in the middle of the road and ends up running over her. They could not find a body or even a trace of blood and decide to leave, thinking the victim was alright and had left. They later start to find mysterious lights in their photos, which are later identified as spirit photography by Ben's assistant, Seiko Nakamura (Maya Hazen). Jane begins to have eerie dreams and visions as if they are trying to tell her something and senses a haunting presence stalking them. Ben begins to complain of severe shoulder pain and his friends begin to comment he's looking bent and hunched over, although the doctor could not determine what was the actual physical cause of it. Seiko takes Jane to her ex-boyfriend, Ritsuo (James Kyson Lee), whose career is to investigate paranormal activities, and he tells them that the lights in the photos are spirits as well as manifestations of intense emotions that are trying to be communicated. At a subway station, Jane spots the ghostly presence of the girl she hit and ran over, causing her to believe that she killed the girl. Later, Ben also has a similarly-terrifying encounter. They go to a medium, Murase, to find out what spiritual activity is really happening to them. However, after Murase clearly appears to have stumbled upon something, Ben refuses to translate what Murase says and storms out, claiming that he is a fraud.\n\nJane decides to visit the office building in one of the photos. She takes pictures and encounters the yūrei, and learns that the girl's name was Megumi Tanaka and that Ben knew her. When she confronts Ben about it, he admits that he and Megumi were once involved in a relationship, but that after the death of her father, she became very obsessive and clingy, and eventually he dumped her, with help from his two friends.\n\nBen's friends, Adam (John Hensley) and Bruno (David Denman), are killed by Megumi. After witnessing Bruno's death, Ben wants to leave but Jane hands Ben their wedding photo, which shows a distorted picture of Megumi. They realize she's been with them the entire time and go to Megumi's home, only to find her decayed body. She had committed suicide with potassium cyanide long before the car impact and thus they had actually first encountered her as a ghost at that time.\n\nThat night, Ben is tortured by Megumi. Jane screams at Megumi to leave them alone; Megumi stops with a brief sinister laugh, leaving Ben alive. After Megumi's funeral, Ben and Jane return to New York, thinking it's all over. However, Jane finds some recent photos in an envelope which show Megumi. With Megumi's clues, Jane finds a camera in a trunk and uploads the memory card into the laptop. There, Jane sees photos taken by Ben, showing Adam and Bruno raping Megumi before her suicide, while Ben does nothing but watch them doing the deed.\n\nBen returns home, where he tries to explain to a distraught Jane that he felt it was the only way to drive Megumi away. They had planned on using the pictures as blackmail against Megumi if she didn't leave him alone but it turned into rape. This explains why Megumi murdered Adam and Bruno, as Ben knew this was about revenge against all three of them. Believing that Megumi was trying to warn her, and disgusted by Ben's past actions, Jane concludes that she can't spend her life with someone like Ben so she leaves him. Ben tries to stop her, but Megumi locks the door and doesn't let him.\n\nDriven mad by Megumi, Ben throws the camera across the room. It takes a picture of him, showing Megumi sitting astride his shoulders. Remembering his shoulder pains and the hospital where a nurse weighed Ben and it showed the weight of two people, Ben realizes that Megumi has been with him all along since her suicide without his knowledge. Horrified, and in an effort to rid himself of her, he electrocutes himself. He is rendered completely catatonic and sent to a mental institution, where he is shown sitting slumped over on the edge of his bed. The last scene shows Megumi still draped over his back.",
  "synopsis": null
}