{
  "imdb_id": "tt3278416",
  "tmdb_id": "326136",
  "douban_id": null,
  "title": "Dirty Beautiful (2015)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.3,
  "director": [
    {
      "id": "nm0058445",
      "name": "Tim Bartell"
    }
  ],
  "writer": [
    {
      "id": "nm0058445",
      "name": "Tim Bartell",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0531061",
      "name": "Ricky Mabe",
      "character": "David"
    },
    {
      "id": "nm3366702",
      "name": "Jordan Monaghan",
      "character": "Kat"
    },
    {
      "id": "nm3300306",
      "name": "Conor Leslie",
      "character": "Nicole"
    },
    {
      "id": "nm0372396",
      "name": "Darin Heames",
      "character": "Armstrong"
    },
    {
      "id": "nm3856316",
      "name": "Zoe Chao",
      "character": "Jamie"
    },
    {
      "id": "nm2273210",
      "name": "Stu James",
      "character": "Marcus"
    },
    {
      "id": "nm3780310",
      "name": "Kelly Tighe",
      "character": "Dream Woman"
    },
    {
      "id": "nm6123408",
      "name": "Otis Vergow",
      "character": "Dream Boy"
    },
    {
      "id": "nm6123409",
      "name": "Olive Vergow",
      "character": "Dream Girl"
    },
    {
      "id": "nm3074546",
      "name": "Chad Strawn",
      "character": "Surfer Jeff"
    },
    {
      "id": "nm0630573",
      "name": "Jim Nieb",
      "character": "Writers Group Leader"
    },
    {
      "id": "nm1553207",
      "name": "Georgia Reed",
      "character": "Sara"
    },
    {
      "id": "nm2444304",
      "name": "Nicole J. Adelman",
      "character": "Innocent Writer"
    },
    {
      "id": "nm2072113",
      "name": "James Hallett",
      "character": "Dan"
    },
    {
      "id": "nm2054325",
      "name": "Jennifer Hardaway",
      "character": "Woman Writer"
    },
    {
      "id": "nm6123410",
      "name": "Stanka Peric",
      "character": "Croatian Woman"
    },
    {
      "id": "nm4133362",
      "name": "Shannan Vergow",
      "character": "Pregnant Woman"
    },
    {
      "id": "nm6123411",
      "name": "Adam Bliefernicht",
      "character": "Creep Guy"
    },
    {
      "id": "nm1140388",
      "name": "Patrick O'Sullivan",
      "character": "Sleazy Guy"
    },
    {
      "id": "nm0216322",
      "name": "Christian Calloway",
      "character": "Homeless Man"
    },
    {
      "id": "nm6123412",
      "name": "Joe Smith",
      "character": "Man in Short Film"
    },
    {
      "id": "nm1133132",
      "name": "Tracey Rooney",
      "character": "Woman in Short Film"
    },
    {
      "id": "nm6123413",
      "name": "Sophia Samios",
      "character": "Pool Girl"
    },
    {
      "id": "nm6123414",
      "name": "Owen Hand",
      "character": "Pool Boy 1"
    },
    {
      "id": "nm6123415",
      "name": "Forrest Brock",
      "character": "Pool Boy 2"
    }
  ],
  "overview": "A lonely artist brings a young, drifter woman back to his tiny apartment to live with him. Between his obsessive tendencies and her non-stop drinking, something strange happens. They start to care for each other.",
  "storyline": "A lonely artist brings a young, drifter woman back to his tiny apartment to live with him. Between his obsessive tendencies and her non-stop drinking, something strange happens. They start to care for each other.",
  "plot": "Okwe is an illegal Nigerian immigrant to the United Kingdom who drives a cab in London during the day and works at the front desk of a hotel at night. The hotel is staffed with many immigrants, both legal and illegal. Okwe keeps himself awake by chewing khat, an herbal stimulant. A doctor in his home country, he was forced to flee after being falsely accused of murdering his wife. In London, he is pressed into giving medical treatment to other poor immigrants, including fellow cab drivers with venereal diseases. Okwe's friend Guo Yi, an employee at a hospital mortuary, provides him with antibiotics under the table.\n\nA prostitute known as Juliette, who plies her trade in the hotel, informs Okwe about a blocked toilet in one of the hotel rooms. He fishes out the blockage and finds a human heart. The manager of the hotel, Juan, runs an illegal operation at the hotel wherein immigrants swap kidneys for forged passports. After learning of Okwe's past as a doctor, Juan pressures him to join his operation as a surgeon, but Okwe refuses.\n\nSenay is a Turkish Muslim seeking asylum, who also works at the hotel, as a cleaner. Her immigration status allows her to stay in the UK providing she does not work; the hotel is a perfect cover because she is not named on its books. She allows Okwe to sleep on her sofa when she is not home, her religion forbidding her from being alone with a man, other than a relative, at any time.\n\nSenay is frightened after a visit from the Immigration service, and convinces Okwe to leave before the authorities find him in her home. The officials find a book of matches from the hotel and decide to inspect it before Senay arrives for her early morning shift. Okwe asks the doorman to intercept Senay; the officials don't catch her, but she can no longer work at the hotel. She begins working in a sweatshop making clothes, but the officials raid that site, too. The entire staff flee to the roof while the manager gets rid of the Immigration agents. The manager will let Senay keep her job and promises not to report her to the authorities only if she will perform oral sex on him. After a couple of such sessions, she refuses to cooperate and bites him, then flees with an expensive coat and some dresses.\n\nOkwe finds her a place to stay at the hospital mortuary, but Senay panics. She asks him to raise money for her to travel to America by selling the stolen clothes and acting as a surgeon in Juan's organ business. Okwe refuses.\n\nIn desperation, Senay agrees to exchange a kidney for a passport. As a \"deal maker\", Juan takes her virginity as well, and later Juliette provides her with the morning-after pill. After learning of Senay's plan, Okwe tells Juan that he will perform the operation to ensure her safety, but only if Juan provides them both with passports under different names. After Juan delivers the passports, Okwe and Senay drug him, surgically remove his kidney, and sell it to Juan's contact.\n\nOkwe plans to use his new identity to return to his young daughter in Nigeria, and Senay plans to start a new life in New York City. Before they part at Stansted Airport, she gives him her cousin's address in New York. They mouth the words, \"I love you\", to each other. Senay boards her plane, and Okwe calls long-distance to his daughter to tell her he is coming home at last.",
  "synopsis": "David is a young, struggling writer very alone in the world. Kat is a lost soul recently left homeless by her ex. Both survive on the fringe of life. So when Kat storms into Davids life and throws out the crazy idea that they become an instant couple, David impulsively agrees and moves her into his tiny apartment.After some wild ups and downs, they make their home into a cave. A safe haven away from the world. But their retreat is fueled as much by drinking and escape as affection. When fantasies of children and a normal life compete with their bohemian ways, things turn ugly. Out of their cave, in the sober light of day, can David & Kat's love survive?"
}