{
  "imdb_id": "tt3253548",
  "tmdb_id": "239651",
  "douban_id": null,
  "title": "Naveena Saraswathi Sabatham (2013)",
  "genres": [
    "Comedy",
    "Fantasy"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "149 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.6,
  "director": [
    {
      "id": "nm5965104",
      "name": "K. Chandru"
    }
  ],
  "writer": [
    {
      "id": "nm5965104",
      "name": "K. Chandru",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0415773",
      "name": "Jai",
      "character": "Ramarajan"
    },
    {
      "id": "nm3223429",
      "name": "Niveda Thomas",
      "character": "Jayashree"
    },
    {
      "id": "nm2536215",
      "name": "Vtv Ganesh",
      "character": "Ganesh       (as Ganesh)"
    },
    {
      "id": "nm3561501",
      "name": "Sathyan",
      "character": "Gopi"
    },
    {
      "id": "nm5408510",
      "name": "Rajkumar",
      "character": "Krishna"
    },
    {
      "id": "nm1007581",
      "name": "Manobala",
      "character": "Naradhar"
    },
    {
      "id": "nm4082417",
      "name": "Subbu Panchu",
      "character": "Paramasivan       (as P. Subramaniam)"
    },
    {
      "id": "nm1420794",
      "name": "Chitra Lakshmanan",
      "character": "Ramarajan's Father"
    },
    {
      "id": "nm0794478",
      "name": "R.S. Shivaji",
      "character": "Jayashree's Father"
    },
    {
      "id": "nm2697818",
      "name": "Swaminathan",
      "character": "Gopi's Father"
    },
    {
      "id": "nm5097020",
      "name": "Badava Gopi",
      "character": "Rajendran"
    },
    {
      "id": "nm5628626",
      "name": "Sam Anderson",
      "character": "Kumar"
    },
    {
      "id": "nm6323446",
      "name": "Vishal Venkat",
      "character": "Lord Muruga"
    },
    {
      "id": "nm6323447",
      "name": "Madhusoodhanan",
      "character": ""
    },
    {
      "id": "nm6323448",
      "name": "Saamy",
      "character": ""
    },
    {
      "id": "nm2011414",
      "name": "Devadarshini Chetan",
      "character": "Parvathi"
    },
    {
      "id": "nm6127939",
      "name": "Ramya",
      "character": "Saraswathi"
    },
    {
      "id": "nm6323449",
      "name": "Usha Elizabeth",
      "character": "Gopi's Mother"
    },
    {
      "id": "nm1862815",
      "name": "Venkat Prabhu",
      "character": "Cameo Appearance"
    }
  ],
  "overview": "A comic fantasy about four men. As the name suggests, it is a modern-day spin on more than one mythological Tamil films from the mid 60s.",
  "storyline": "Four friends from different strata of society (Jai, VTV Ganesh, Satyan, Rajkumar) go to Bangkok for a bachelor party. They have a ball at a local night club, get dozed and wake up next day in a remote uninhabited island with no recollection of how they landed there. Meanwhile god's in the heaven headed by Lord Siva (Subbu Panchu), Parvathi (Devadarshini), Saraswathi (Ramya) and Naradar (Manobala) are controlling the fate of these guys.",
  "plot": "The film begins in a modern heaven, where Lord Paramasivan (Subbu Panchu) gives orders to Narada (Manobala) to pick 4 people for his Thiruvilaiyadal. The candidates picked are Ramarajan (Jai), a Siddha Doctor, Ganesh (VTV Ganesh), a helpless man who is the husband of a local female don, Gopi (Sathyan Sivakumar), a future politician and son of a selfish politician and Krishna (Rajkumar), a budding actor. Paramasivan and Narada see all the four's routine and premises on an imac. Ramarajan falls in love with Jayshree (Niveda Thomas), who is a singer, and wins her heart and engaged for marriage after 26 days, the four plans to fix a bachelor party at Bangkok, when they reach Bangkok, they enjoy and flirts with girls at the party. They are drunk too much, when they woke up, they find themselves abandoned in a tropical island in Bangkok. They try many ways to escape but are unsuccessful. 6 months have elapsed, Paramasivan gives a final chance for them, their last chance is a motorboat of pirates arrive to explore the island, the four begs them to take them to (Chennai), but they refuses to help them and flees, but the four fights them back and escapes the island in the boat abandoning the pirates in the island, after reaching Chennai, they have a happy ending except Gopi, Ramarajan soon knows that today is Jayshree's marriage, he runs out and goes to the marriage, finally Ramarajan marries Jayshree implying the groom as an American software engineer and tells him to marry another girl by wishing him all the best. in post-credits scene, the film mentions behind the scenes.",
  "synopsis": null
}