{
  "imdb_id": "tt3215486",
  "tmdb_id": "255421",
  "douban_id": null,
  "title": "Idhu Kathirvelan Kadhal (2014)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "156 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.6,
  "director": [
    {
      "id": "nm5269807",
      "name": "S. Prabhakaran"
    }
  ],
  "writer": [
    {
      "id": "nm5269807",
      "name": "S. Prabhakaran",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3561350",
      "name": "Udhayanidhi Stalin",
      "character": "Kathirvelan"
    },
    {
      "id": "nm1521381",
      "name": "Nayanthara",
      "character": "Pavithra"
    },
    {
      "id": "nm1495762",
      "name": "Chaya Singh",
      "character": "Kathirvelan's Sister"
    },
    {
      "id": "nm1962272",
      "name": "Santhanam",
      "character": "Mayilvaganam"
    },
    {
      "id": "nm0764853",
      "name": "Saranya Ponvannan",
      "character": "Kathirvelan's Mother"
    },
    {
      "id": "nm4698683",
      "name": "Sunder Ramu",
      "character": "Gautham"
    },
    {
      "id": "nm4861046",
      "name": "Aadukalam Naren",
      "character": "Kathirvelan's Father       (as Narein)"
    },
    {
      "id": "nm5472019",
      "name": "Vanitha Krishna Chandran",
      "character": ""
    },
    {
      "id": "nm1416319",
      "name": "Mayilsamy",
      "character": ""
    },
    {
      "id": "nm4742611",
      "name": "Ganeshkar",
      "character": ""
    },
    {
      "id": "nm4742592",
      "name": "Aarthi",
      "character": ""
    },
    {
      "id": "nm5046880",
      "name": "Dinesh",
      "character": "Special Appearance"
    }
  ],
  "overview": "Kathir (Udhayanidhi) a Madurai lad goes to Coimbatore with a purpose and very soon flips for the charms of a beautiful Pavithra (Nayanthara) who is their neighbor. But Pavithra is already in love with her friend Gautham (Sundar) who is 'not a nice guy'. Kathir who was looking out for his friend at college Mayil (Santhanam) bumps into suddenly and he turns love advisor for Kathir.",
  "storyline": "Kathir (Udhayanidhi) a Madurai lad goes to Coimbatore with a purpose and very soon flips for the charms of a beautiful Pavithra (Nayanthara) who is their neighbor. But Pavithra is already in love with her friend Gautham (Sundar) who is 'not a nice guy'. Kathir who was looking out for his friend at college Mayil (Santhanam) bumps into suddenly and he turns love advisor for Kathir.",
  "plot": "This article's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (April 2015) (Learn how and when to remove this template message)\nThe film opens with a prologue, in which a person is being taken to a hospital and the doctor later reporting that the person's condition will be known only after sometime. The scene then shifts a few months back.\n\nEnter Kathirvelan aka Kathir (Udhayanidhi Stalin), a Madurai-based minibus owner who is a devotee of Lord Anjaneya since the age of five. Due to his devotion for Lord Anjaneya, he does not show any interest in women.\n\nOne day, while returning from an Anjaneya temple, he sees his elder sister Vineethra (Chaya Singh) crying outside his house after his father (Aadukalam Naren) refused to take her in, having disowned her for eloping with a Coimbatore-based mill owner Shanmugham (Dr. Bharath Reddy) against his wishes. Vineethra however, now has issues with Shanmugham, as a result of which she left him and returned to her father's house. On Kathir's cajoling, his father reluctantly accepts Vineethra into the house. Kathir then decides to find out what caused the standoff between Vineethra and Shanmugham and leaves for Coimbatore, lying to his father that he is headed for Salem to do some work related to his minibus business. Before leaving, he is warned by Vineethra not to fall for Shanmugham's neighbor, Pavithra (Nayanthara), as her father and Shanmugham are sworn enemies.\n\nIn Coimbatore, Kathir successfully manages to resolve the conflict between Vineethra and Shanmugham, with Vineethra returning to Coimbatore eventually. He however, does not return to Madurai immediately, staying back in Coimbatore after noticing Pavithra and falling in love with her, despite Vineethra's warning and his devotion to Lord Anjaneya. Determined to win Pavithra's heart, he takes the help of his college friend Mayilvaganam aka Mayil (Santhanam), who finds out that Pavithra is working as a manager in a Panasonic showroom. The duo go there so that Kathir can speak to Pavithra, but end up creating a scene, forcing Pavithra to throw both of them out. After Pavithra notices Kathir constantly following her, she confronts him and threatens to take him to the police, which increases the friction between them. However, when Pavithra finds out how Kathir had saved his sister's marriage, she forgives him and becomes his friend, but later reveals that she is in love with a businessman Gautham (Sunder Ramu), which breaks Kathir's heart. To add to Kathir's woes, Shanmugham finds out that he is in love with Pavithra, and kicks him out of his house for showing interest in his enemy's daughter. Meanwhile, back in Madurai, his father too disowns him after finding out that he had not gone to Salem after all. Without a home now, Kathir moves into Mayil's room.\n\nKathir soon finds out that Pavithra's boyfriend Gautham is a womaniser, planning to dump Pavithra after having a one night stand with her at his friend's upcoming marriage in Ooty. He tells her about this, but she rubbishes his claims and admonishes him for still hitting on her. However, she soon realises the truth about Gautham after he attempts to kiss her in his car and then she dumps him. She and Kathir reconcile, but she now realises that she has feelings for Kathir. With the help of Mayil and Pavithra's Malayali friend (Kala Kalyani), they soon express their feelings for one another.\n\nTrouble soon erupts however, after Shanmugham and Pavithra's father find out that Kathir and Pavithra are in love. Kathir and Pavithra decide that the only way Shanmugham and Pavithra's father can accept their relationship is to make them reconcile (Shanmugham and Pavithra's father are sworn enemies due to the enmity which existed between the latter and Shanmugham's deceased father, who happened to be Pavithra's paternal uncle). They take the help of a mimicry artist, Balaraman (Mayilsamy), who mimics both Shanmugham's and Pavithra's father's voices in the presence of the real Pavithra's father and Shanmugham respectively, which eventually leads to Shanmugham and Pavithra's father reconciling.\n\nWith the initial hurdle cleared, Kathir and Mayil then plan to convince Kathir's father, who has now reconciled with Kathir, but is also searching for a bride for him, to allow Kathir to marry Pavithra. However, while trying to tell Kathir's father about Pavithra, Mayil consumes poison and is immediately rushed to hospital (though it is later revealed that Mayil pretended to poison himself by pretending to swallow laxatives, fearing the wrath of Kathir's father, and thereby revealing the identity of the person in the prologue). On returning home, Kathir tells his father about Pavithra, who, as expected, becomes furious and locks himself up in his room. Later, Kathir manages to calm down his father and adds that he will not marry Pavithra as long as he refuses to accept their relationship, whilst also saying that, unlike his sister, he did not want to marry without seeking his father's permission. At this, his father forgives Kathir, accepts his relationship with Pavithra and gives the go-ahead for their marriage.\n\nThe movie ends with Kathir and Pavithra getting married happily.",
  "synopsis": null
}