{
  "imdb_id": "tt3253930",
  "tmdb_id": "236735",
  "douban_id": "25892603",
  "title": "Marshland (2014)",
  "genres": [
    "Crime",
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "Spain",
  "version": [
    {
      "runtime": "105 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm0735705",
      "name": "Alberto Rodríguez"
    }
  ],
  "writer": [
    {
      "id": "nm1943791",
      "name": "Rafael Cobos",
      "description": null
    },
    {
      "id": "nm0735705",
      "name": "Alberto Rodríguez",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0349522",
      "name": "Javier Gutiérrez",
      "character": "Juan Robles"
    },
    {
      "id": "nm1666855",
      "name": "Raúl Arévalo",
      "character": "Pedro Suárez"
    },
    {
      "id": "nm7102804",
      "name": "María Varod",
      "character": "Trinidad"
    },
    {
      "id": "nm6960420",
      "name": "Perico Cervantes",
      "character": "Padre Trinidad"
    },
    {
      "id": "nm3575130",
      "name": "Jesús Ortiz",
      "character": "Andrés"
    },
    {
      "id": "nm1941730",
      "name": "Jesús Carroza",
      "character": "Miguel"
    },
    {
      "id": "nm1892699",
      "name": "Salva Reina",
      "character": "Jesús"
    },
    {
      "id": "nm0209409",
      "name": "Antonio de la Torre",
      "character": "Rodrigo"
    },
    {
      "id": "nm0057776",
      "name": "Nerea Barros",
      "character": "Rocío"
    },
    {
      "id": "nm6799882",
      "name": "Ana Tomeno",
      "character": "Marina"
    },
    {
      "id": "nm7102805",
      "name": "Paula Palacios",
      "character": "Niña 1"
    },
    {
      "id": "nm7102806",
      "name": "Claudia Ubreva",
      "character": "Niña 2"
    },
    {
      "id": "nm7102807",
      "name": "Lucía Arias",
      "character": "Niña 3"
    },
    {
      "id": "nm7102808",
      "name": "Chelo Castro",
      "character": "Niña 4"
    },
    {
      "id": "nm5631118",
      "name": "Jesús Castro",
      "character": "Quini"
    },
    {
      "id": "nm7102809",
      "name": "Lola Páez",
      "character": "Señora del Dyane"
    },
    {
      "id": "nm1237961",
      "name": "Paco Inestrosa",
      "character": "Barquero"
    },
    {
      "id": "nm6803308",
      "name": "Ángela Vega",
      "character": "Angelita"
    },
    {
      "id": "nm7102810",
      "name": "Julián Candón",
      "character": "Cazador 1"
    },
    {
      "id": "nm7102811",
      "name": "Jorge Amat",
      "character": "Cazador 2"
    },
    {
      "id": "nm7102812",
      "name": "Laura López",
      "character": "Carmen"
    },
    {
      "id": "nm6210838",
      "name": "Cyntia Suano",
      "character": "Estrella       (as Cyntia María Suano)"
    },
    {
      "id": "nm1253638",
      "name": "Juan Carlos Villanueva",
      "character": "Juez Andrade"
    },
    {
      "id": "nm7102813",
      "name": "Josemi Rodríguez",
      "character": "Médico Forense"
    },
    {
      "id": "nm1254805",
      "name": "Manolo Solo",
      "character": "Periodista el Caso"
    },
    {
      "id": "nm7102814",
      "name": "Miguel Ángel Díaz",
      "character": "Castro"
    },
    {
      "id": "nm2431367",
      "name": "Adelfa Calvo",
      "character": "Fernanda"
    },
    {
      "id": "nm7102815",
      "name": "Francisco García",
      "character": "Juanito"
    },
    {
      "id": "nm2654746",
      "name": "Javier Berger",
      "character": "Barman Pub"
    },
    {
      "id": "nm1992164",
      "name": "Pedro Lanzas",
      "character": "Vicente"
    },
    {
      "id": "nm0182874",
      "name": "Beatriz Cotobal",
      "character": "Madre Marina"
    },
    {
      "id": "nm1872631",
      "name": "Mercedes León",
      "character": "Señora Casa Coto"
    },
    {
      "id": "nm2153517",
      "name": "Juan Carlos Montilla",
      "character": "Fermín"
    },
    {
      "id": "nm2828628",
      "name": "Abel Mora",
      "character": "Traficante"
    },
    {
      "id": "nm7102816",
      "name": "Gonzalo Trujillo",
      "character": "Recepcionista"
    },
    {
      "id": "nm1385036",
      "name": "Nacho Fortes",
      "character": "Botones"
    },
    {
      "id": "nm7102817",
      "name": "Antonio Álvarez",
      "character": "Capataz"
    },
    {
      "id": "nm7102818",
      "name": "Manuel Rodríguez",
      "character": "Camarero"
    },
    {
      "id": "nm2825789",
      "name": "Álex Peña",
      "character": "Trabajador Megáfono"
    },
    {
      "id": "nm0328023",
      "name": "Alberto González",
      "character": "Don Alfonso Corrales"
    },
    {
      "id": "nm0757603",
      "name": "Manuel Salas",
      "character": "Sebastián Rovira Gálvez"
    }
  ],
  "overview": "The Spanish deep South, 1980. A series of brutal murders of adolescent girls in a remote and forgotten town bring together two disparate characters - both detectives in the homicide division - to investigate the cases. With deep divisions in their ideology, detectives Juan and Pedro must put aside their differences if they are to successfully hunt down a killer who for years has terrorized a community in the shadow of a general disregard for women rooted in a misogynistic past.",
  "storyline": "1980. In a little town close to Coto of Doñana (Andalusia, south to Spain), two teen girls have disappeared. The father of one of the girls, who have connections with important people in the forces of the law, gets that two police detectives of homicides from Madrid are assigned to the mission to find the girls if they are alive, or find the assassin if they appear died. The detectives are Pedro Suárez and Juan Robles. While that Suárez is a young, taciturn and circumspect agent in a Spain that it tries to find a new identity as democratic country after General Franco's death in 1975, Robles is a veteran, funny and expeditious agent, with a mysterious past as alleged member of Franco's Armed Police dismantled in 1978. Unable to reconcile one with each other, Suárez and Robles find trapped by the hostile environment of a place where the old Franco's methods and customs still alive, and where they two aren't welcome. When the girls appears died, the following investigation move the cops...",
  "plot": "In 1980, Madrid homicide detectives Pedro Suarez and Juan Robles are sent to a forgotten town on the Guadalquivir Marshes to investigate the disappearance of two teenage sisters during the town's festivities. Pedro, openly critical of Spain's past during Franco's reign, faces problems with authority figures, while Juan cares not, though he has a troubled past of his own.\n\nThe detectives meet with the girls' (Carmen and Estrella) father, Antonio, a local river boat driver. Although Antonio and his wife Rocío say their daughters were average girls, the duo learn from their friends that they had a deep urge to leave the town. Rocío also gives the detectives a burnt film reel she's found, depicting the girls naked and in bed with a man whose face is obscured by a flash. Soon enough as well, both Carmen and Estrella are found dumped in the local marsh, having been raped and tortured to death.\n\nTroubled and with no leads, the two attempt to spy on Quini, the handsome and suave former boyfriend of Carmen. Quini, now dating another town girl Marina, is able to sneak up on the detectives after they've followed him and attempts to threaten them with a knife. After disarming and sending him away, the two agree that Quini must be a part of whatever is occurring. The problem is confirmed to be even bigger after a drunk man named Castro confronts the detectives with a similar case; his girlfriend, Beatriz, was close to Quini and the sisters, and was found dismembered with her suitcase along the marshes.\n\nPedro and Juan continue to investigate and come upon unraveled secrets. It is revealed that the river boats and marshes are used to smuggle and transport heroin, and that Antonio had stolen a kilo and sold it, putting him in trouble with the locals. However, the locals confront the detectives, revealing the information in whole, and claiming that they had nothing to do with the sisters' deaths. One of the men do aid the investigation though by describing a white Dyane 6 that lurked around a church where one of the girls' purse was found. After digging through more victim's items, the two see a pattern of out-of-town job brochures for women, eventually linking Quini to a man named Sebastian. Digging through Sebastian's past, they find a warrant out for him for the possible sexual molestation of a child, solidifying his chance of being the main culprit. Juan and Pedro deduce that Quini and Sebastian were luring the young women of the town, who were aching to leave and find their own independence through work, by passing these brochures around and then entrapping them into sexual slavery within a local hunting lodge.\n\nTurmoil begins to strike however, as Pedro becomes aware of Juan's past shooting of a girl during time in Franco's Spain. Pedro is also angered after a possible third culprit, a worker's union representative named Alfonso Corrales, is brushed over most likely due to complex political ties. The two continue on though, eventually deducing Sebastian's cover as the watchman of the hunting lodge. Pedro attempts to tail his white Dyane 6, but loses him. With the help of a local poacher, Jesús, the trio finally chase Sebastian into the marshes. All three are shot by the sniping Sebastian, though as he is about to slay Pedro, Juan is able to sneak up and gut him with a knife. After Sebastian falls dead into the swamp, Juan opens the trunk of the car to find a bruised but still alive Marina.\n\nThe town is brought peace after the case is solved, as well as by the local worker's union giving in to a pay raise. All seems well for the detectives too, as Pedro sees a promotion and relocation closer to his own home and wife. On the final night of their stay however, Pedro receives photographs from a journalist who has helped on the case. Though Juan justified his shooting story by saying it was his former partner's actions, the journalist reveals him to have actually been a brutal enforcer for Franco's secret police force, and to have once been known as 'The Crow'.\n\nIn the morning, before they drive home, Juan asks a stoney-faced Pedro if they 'are good'. Pedro does not answer, and the two ride off to an uncertain future.",
  "synopsis": null
}