{
  "imdb_id": "tt3290676",
  "tmdb_id": "247501",
  "douban_id": null,
  "title": "Uyyala Jampala (2013)",
  "genres": [
    "Drama",
    "Family",
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "124 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm6044566",
      "name": "Virinchi Varma"
    }
  ],
  "writer": [
    {
      "id": "nm6044568",
      "name": "Ram Mohan P.",
      "description": null
    },
    {
      "id": "nm6044567",
      "name": "Raj Tarun",
      "description": "dialogue & screenplay"
    },
    {
      "id": "nm6044566",
      "name": "Virinchi Varma",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm6044567",
      "name": "Raj Tarun",
      "character": "Suri"
    },
    {
      "id": "nm3597669",
      "name": "Avika Gor",
      "character": "Uma Devi"
    },
    {
      "id": "nm4442569",
      "name": "Joy Badlani",
      "character": "Suri's Uncle"
    },
    {
      "id": "nm5852439",
      "name": "Punarnavi Bhupalam",
      "character": "Sunitha"
    },
    {
      "id": "nm3815196",
      "name": "Anitha Chowdary",
      "character": ""
    },
    {
      "id": "nm5057686",
      "name": "Kireeti Damaraju",
      "character": "Murali"
    },
    {
      "id": "nm6174639",
      "name": "Peela Gangadhar",
      "character": "Vasu"
    },
    {
      "id": "nm6174640",
      "name": "Alluri Hanuma",
      "character": "Kodanda"
    },
    {
      "id": "nm6174638",
      "name": "Shashank Srivatsavaya",
      "character": "Parthu"
    }
  ],
  "overview": "Close relatives, Suri (Raj) and Uma Devi (Avika) grow up together living next door to each other. They are made for each other but Suri takes a while to figure that out.",
  "storyline": "A romantic entertainer between a \"bava\" and a \"maradalu\" set in a contemporary coastal town.",
  "plot": "The whole film is narrated by the protagonist of the film Soori (Raj Tarun) who is running back to confess his love to his cousin Umadevi (Avika Gor). Soori and Umadevi quarrel since their childhood which starts from the time of the latter's birth itself. Umadevi is the daughter of Rangaraju (Ravi Varma), the younger brother of Soori's mother. Rangaraju, his family and his parents live in a mansion while Soori and his widowed mother (Anita Chowdary) live in a small house exactly beside the mansion in a modernized yet naturally scenic village called Konavaram. Soori deals in the business of cock-shit which is required for those who maintain fish ponds nearby the village. He has two friends Kodanda (Alluri Hanuma), a person nearly equal to a Google search engine when it comes to the day-to-day advances in Technology and day-to-day affairs in the Village and Vasu (Peela Gangadhar), a gullible person who always has a \"Be positive\" attitude in all the cases. Added to this, a local belle Sunitha (Punarnavi Bhupalam) is infatuated to Soori and she happens to be Umadevi's close friend. In order to tease Umadevi, Soori flirts Sunitha everyday and gets on Umadevi's nerves. Meanwhile Umadevi too falls in love with a techie Parthu (Shashank Srivatsavaya). When Soori observes her neglecting him and Sunitha and roaming around, he gets a suspicion and along with Vasu, he follows Umadevi one day and finds her in the company of Parthu. When Vasu and Soori follow him on their bike, they come to know that Parthu is a mechanic who works in the nearby town's Hero Motorcorp outlet. Soori calls Parthu and tells him that he wants to purchase the bike Parthu uses. After a test drive, Parthu is damaged severely as Soori trashes him. Later a wounded Parthu asks Umadevi to elope with him as Parthu's father is trying to arrange a marriage for him. When Umadevi expresses her fear, Parthu threatens her that he would die by swallowing sleeping tablets if she doesn't elope with him and she agrees. After packing her dresses, gifts presented by Parthu and her ornaments, Umadevi escapes from her house that night and boards a bus along with Parthu. Rangaraju creates havoc in his house and Soori finds out with the help of Sunitha that Umadevi is in Tuni, major town in East Godavari District. Immediately, Parthu and Umadevi get down from the bus and then Parthu's friends try to kidnap her while Parthu tries to snatch her ornaments. Soori comes there along with Kodanda and Vasu. He beats up Parthu and rescues Umadevi.Then Umadevi comes to know that all the while parthu was trapping her when Soori admits with a grin that the love letter written by Parthu for Uma is of hen's blood but not his own.Then Uma in a rage beats him in black n blue.",
  "synopsis": null
}