{
  "imdb_id": "tt3219310",
  "tmdb_id": "224648",
  "douban_id": null,
  "title": "Naiyaandi (2013)",
  "genres": [
    "Comedy",
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "158 min",
      "description": ""
    }
  ],
  "imdb_rating": 2.7,
  "director": [
    {
      "id": "nm4260569",
      "name": "A. Sarkunam"
    }
  ],
  "writer": [
    {
      "id": "nm4260569",
      "name": "A. Sarkunam",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm1333687",
      "name": "Dhanush",
      "character": "Chinna Vandu"
    },
    {
      "id": "nm2601111",
      "name": "Nazriya Nazim",
      "character": "Vanaroja"
    },
    {
      "id": "nm5115608",
      "name": "Vamsi Krishna",
      "character": ""
    },
    {
      "id": "nm3561501",
      "name": "Sathyan",
      "character": "Chinna Vandu's Brother"
    },
    {
      "id": "nm4262344",
      "name": "Soori",
      "character": ""
    },
    {
      "id": "nm3951906",
      "name": "Sathish",
      "character": "(as Satish)"
    },
    {
      "id": "nm3826010",
      "name": "Lakshmi Ramakrishnan",
      "character": ""
    },
    {
      "id": "nm5180821",
      "name": "Ashwin Raja",
      "character": ""
    },
    {
      "id": "nm1228414",
      "name": "Pyramid Natarajan",
      "character": "Chinna Vandu's Father"
    },
    {
      "id": "nm5977706",
      "name": "Sabari Ashok",
      "character": ""
    },
    {
      "id": "nm1690560",
      "name": "Sachhu",
      "character": "Vanaroja's Grandmother"
    },
    {
      "id": "nm1417060",
      "name": "Sriman",
      "character": "Chinna Vandu's Brother"
    },
    {
      "id": "nm2670388",
      "name": "Singampuli",
      "character": ""
    },
    {
      "id": "nm5180541",
      "name": "Imman Annachi",
      "character": ""
    },
    {
      "id": "nm1572739",
      "name": "Meera Krishna",
      "character": "Chinna Vandu's Mother"
    }
  ],
  "overview": "Chinna Vandu (Dhanush), the youngest of three brothers, falls in love with Vana Roja (Nazriya) when she visits her grandmother, coinciding with the village carnival. After a few hiccups, their romance becomes mutual. Chinna Vandu has to then handle his family members, particularly his lovesick elder brothers, and also a dreaded goon who sets his eagle eyes on Roja.",
  "storyline": "Chinna Vandu (Dhanush) is the youngest in a family consisting of father(Pyramid Natarajan), mother and his two elder brothers (Sriman and Sathyan), bachelors who are desperate to get married. The first half is all about how Chinna Vandu meets and fall in love with Vana Roja ( Nazriya ) and due to circumstances is forced to run away on her engagement day. She comes to Chinna Vandu's house as an apprentice in his brass shop, but his two elder brothers want to marry her.",
  "plot": "This story begins with Chinna Vandu's (Dhanush) brothers Paranjothi (Sriman) and Paranthavan (Sathyan), who are not yet married, despite their old age. Chinna Vandu, who studied in his uncle's son home, falls in love with Vanaroja (Nazriya Nazim), who comes there to visit her grandma (Sachu) and see the village festival. Chinna Vandu finds many ways to make Vanaroja to fall in love such as making her laugh, but she still does not fall in love with Chinna Vandu. During the village festival, Vanaroja's ring goes missing, so her father Poongavanam (Aadukalam Naren) comes there and tells everyone to find the ring for a reward of 1 lakh. Only Chinna Vandu finds it in front of Vanaroja, but he gives the ring to a poor lady to claim the prize, as Vanaroja does not like him. Seeing this, Vanaroja falls in love with him. Chinna Vandu makes a challenge to himself: to know whether Vanaroja's in love or not. He gets to know that Vanaroja is also in love with him.\n\nVanaroja leaves the village to her home but upon reaching, she finds her father has arranged for her engagement with Krishna (Vamsi Krishna) and is getting married with Krishna on her birthday. Chinna Vandu comes to wish her for her birthday on that night, and comes to know about the engagement. They both escape from Krishna and his henchmen. Chinna Vandu tells his cousin Soori (Soori) that he has eloped with Vanaroja, and asks him to come and meet them. Soori tries to find a way for Chinna Vandu to live with Vanaroja, but Chinna Vandu tells him that he has already married her. Soori tells them to hide their marriage and go to his family in Kumbukonam. Soori brings Vanaroja to Chinna Vandu's house saying that she is an orphan and his family accepts her in, but Chinna Vandu's brothers start to love Vanaroja. Chinna Vandu comes there and makes sure that his brothers do not marry her. After some days, their mother finds that Vanaroja is pregnant, and she throws her out of the house. Meanwhile, Krishna's men find Vanaroja and kidnap her. Chinna Vandu finds Vanaroja captured by Krishna and follows him. He goes in a fight and wins, but Chinna Vandu is caught by his whole family, and his father Sambandham (Pyramid Natarajan) does not accept this, but Vanaroja's father comes and tells Chinna Vandu's father that his daughter's life needs to be happy, and so finally he accepts their relationship.",
  "synopsis": null
}