{
  "imdb_id": "tt3251284",
  "tmdb_id": "280109",
  "douban_id": null,
  "title": "Aura (2014)",
  "genres": [
    "Drama",
    "Sci-Fi"
  ],
  "country": "Hungary",
  "version": [
    {
      "runtime": "80 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.5,
  "director": [
    {
      "id": "nm0077218",
      "name": "Zsolt Bernáth"
    }
  ],
  "writer": [
    {
      "id": "nm0457108",
      "name": "Mark Kis-Szabo",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm6055407",
      "name": "Szénási Bálint",
      "character": "Tokió's younger brother"
    },
    {
      "id": "nm4705978",
      "name": "Szénási Kristóf",
      "character": "Tokió"
    },
    {
      "id": "nm6007461",
      "name": "Kapócs Panka",
      "character": "Eszter"
    },
    {
      "id": "nm6007460",
      "name": "Dubai Péter",
      "character": "Peti"
    },
    {
      "id": "nm4706022",
      "name": "Ungvár Ádám",
      "character": "Ádám"
    }
  ],
  "overview": "Four kids, Tokyo, Pete, Adam and Esther wake up in their stranded car in an abandoned field only to find that the Sun did not rise. What's more, they discover that a strange, 30 foot diameter, almost invisible, bionic \"aura\" is covering their surroundings. It reacts to their touch, and soon mysterious things start to happen. Our heroes find seashells in and around their car, the smell and the sound of the ocean fill the air, and long lost memories start to materialize in front of their very eyes. Rainfall from nowhere, unexplainable noises, mysterious messages and clues hidden all around force them to go along on an investigation that reveals much more than they would have ever hoped for: they unearth long forgotten secrets rooted deep in the very beginning of mankind's existence. And these secrets have direct consequences not only on their lives; but also on the survival of our planet as we know it.",
  "storyline": "Four kids wake up in the morning in an abandoned field only to find that the Sun did not rise. As darkness covers them the whole day, with no hope of light, they must face mysteries rooted deep in mankind's very beginning.",
  "plot": null,
  "synopsis": null
}