{
  "imdb_id": "tt3294732",
  "tmdb_id": "355536",
  "douban_id": null,
  "title": "Director's Cut (2016)",
  "genres": [
    "Comedy",
    "Crime",
    "Horror"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm0726472",
      "name": "Adam Rifkin"
    }
  ],
  "writer": [
    {
      "id": "nm0422710",
      "name": "Penn Jillette",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0701512",
      "name": "Missi Pyle",
      "character": "Herself /              Mabel"
    },
    {
      "id": "nm0422710",
      "name": "Penn Jillette",
      "character": "Herbert Blount"
    },
    {
      "id": "nm0002122",
      "name": "Harry Hamlin",
      "character": "Godfrey Winters /              Himself"
    },
    {
      "id": "nm1887429",
      "name": "Hayes MacArthur",
      "character": "Reed /              Himself"
    },
    {
      "id": "nm0005417",
      "name": "Lin Shaye",
      "character": "Captain Wheeler"
    },
    {
      "id": "nm0331906",
      "name": "Gilbert Gottfried",
      "character": "Superintendent"
    },
    {
      "id": "nm0726472",
      "name": "Adam Rifkin",
      "character": "Adam Rifkin"
    },
    {
      "id": "nm0068382",
      "name": "Marshall Bell",
      "character": "Moving Company Guy"
    },
    {
      "id": "nm0004801",
      "name": "Nestor Carbonell",
      "character": "CSI Perry"
    },
    {
      "id": "nm0854418",
      "name": "Teller",
      "character": "Rudy Nelson"
    },
    {
      "id": "nm6966362",
      "name": "Dave Anthony",
      "character": "Richard Speck"
    },
    {
      "id": "nm6966360",
      "name": "Jeff Levine",
      "character": "Uniformed Officer"
    },
    {
      "id": "nm2283346",
      "name": "Coleman Lannum",
      "character": "Blump's Burgers Crowdfunder"
    },
    {
      "id": "nm6966389",
      "name": "David Chapman",
      "character": "Assistant Director"
    },
    {
      "id": "nm0935109",
      "name": "Scott Winig",
      "character": "Real Director of Photography"
    },
    {
      "id": "nm2510013",
      "name": "Bree Olson",
      "character": "Sexy Nurse"
    },
    {
      "id": "nm1029346",
      "name": "Cokey Falkow",
      "character": "Special Effects Guy       (as Jonathan 'Cokey' Falkow')"
    },
    {
      "id": "nm2949174",
      "name": "Patrick Statham",
      "character": "James Huberty"
    },
    {
      "id": "nm6779385",
      "name": "Brian D Sheehy",
      "character": "Himself - Uniformed Officer"
    },
    {
      "id": "nm1328999",
      "name": "Lexi Love",
      "character": "Prison Guard 02"
    },
    {
      "id": "nm5889990",
      "name": "C. Ronald McPherson",
      "character": "Restaurant Patron       (as Ron McPherson)"
    },
    {
      "id": "nm2416507",
      "name": "Bridey Elliott",
      "character": "Wardrobe girl"
    },
    {
      "id": "nm2780474",
      "name": "Jon Barinholtz",
      "character": "Video Assist Guy"
    },
    {
      "id": "nm1942808",
      "name": "Kirsty Hill",
      "character": "Hooker Crowdfunder"
    },
    {
      "id": "nm0825805",
      "name": "Rob Steinberg",
      "character": "Detective Whiteside"
    },
    {
      "id": "nm6797862",
      "name": "Demetrius Thomas",
      "character": "Detective Jones"
    },
    {
      "id": "nm1975800",
      "name": "Matt Donnelly",
      "character": "Prison Guard 01"
    },
    {
      "id": "nm6065170",
      "name": "Derek A. Zavala",
      "character": "Crowdfunder"
    },
    {
      "id": "nm6065169",
      "name": "Dionne A. Zavala",
      "character": "Crowdfunder"
    },
    {
      "id": "nm0131541",
      "name": "Dean Cameron",
      "character": "Brian"
    },
    {
      "id": "nm6119882",
      "name": "David Aboussafy",
      "character": "Massive Headwound Hank"
    },
    {
      "id": "nm7874364",
      "name": "Carey Barrett",
      "character": "Dead Faculty"
    },
    {
      "id": "nm0069699",
      "name": "Robert Belushi",
      "character": "Elder Ashby"
    },
    {
      "id": "nm6469377",
      "name": "Jan Philip Browne",
      "character": "Jan - Owner of Blump's Burgers"
    },
    {
      "id": "nm4675888",
      "name": "Daz Byard",
      "character": "Detective"
    },
    {
      "id": "nm5692772",
      "name": "Leonel Claude",
      "character": "Officer Gause"
    },
    {
      "id": "nm6000061",
      "name": "Valerie R. Cook",
      "character": "Security Guard"
    },
    {
      "id": "nm5322255",
      "name": "Brie Cubelic",
      "character": "College Girl"
    },
    {
      "id": "nm0234793",
      "name": "Miles Dougal",
      "character": "Charles Manson"
    },
    {
      "id": "nm1179543",
      "name": "Rod Fielder",
      "character": "Cop"
    },
    {
      "id": "nm3966606",
      "name": "Javier Flores",
      "character": "Police officer /              Detective"
    },
    {
      "id": "nm6560660",
      "name": "Caroline Gayle",
      "character": "Naked Paddle Girl"
    },
    {
      "id": "nm8202472",
      "name": "Ché Graham",
      "character": "Fillet-O-Fish"
    },
    {
      "id": "nm0334280",
      "name": "Ronald Graham",
      "character": "Albert Fish"
    },
    {
      "id": "nm0352727",
      "name": "Michael Haddad",
      "character": "Detective"
    },
    {
      "id": "nm3083308",
      "name": "Dave Johnson",
      "character": "Cop"
    },
    {
      "id": "nm9834987",
      "name": "Cayla Kirschbaum",
      "character": "Cranial Cavity Cayla"
    },
    {
      "id": "nm3032793",
      "name": "Warren Scott Kirschbaum",
      "character": "Keystone Cop 3.0       (as Warren Kirschbaum)"
    },
    {
      "id": "nm6814535",
      "name": "Chris Koontz",
      "character": "Dead Hippie"
    },
    {
      "id": "nm4601495",
      "name": "Gus Langley",
      "character": "Undercover Cop"
    },
    {
      "id": "nm5966618",
      "name": "Katarina Law",
      "character": "Cop"
    },
    {
      "id": "nm6869888",
      "name": "Jeffrey S. Levine",
      "character": "CSI Agent"
    },
    {
      "id": "nm6100057",
      "name": "Kayla Levine",
      "character": "Girl in Park"
    },
    {
      "id": "nm1243655",
      "name": "Sarah Lowe",
      "character": "Agenty Cindy"
    },
    {
      "id": "nm4572567",
      "name": "Leslie McKeller",
      "character": "Nurse Twiggy"
    },
    {
      "id": "nm2258412",
      "name": "Robert McMurrer",
      "character": "Charles Whitman"
    },
    {
      "id": "nm6159058",
      "name": "Mac McPherson",
      "character": "Cop"
    },
    {
      "id": "nm3824335",
      "name": "Jeremy L. Morrison",
      "character": "Clash of the Titans Geek"
    },
    {
      "id": "nm1850421",
      "name": "Rich Nathanson",
      "character": "Guy Sleeping Under Stabbed Nurse"
    },
    {
      "id": "nm4944851",
      "name": "Jonny Ortiz",
      "character": "Club goer"
    },
    {
      "id": "nm3025400",
      "name": "Shawn C. Phillips",
      "character": "Birthday Boy"
    },
    {
      "id": "nm1740248",
      "name": "Jon Ray",
      "character": "Cop /              Restaurant Patron"
    },
    {
      "id": "nm8830110",
      "name": "Brittany Rohn",
      "character": "Kidnapped Hippie"
    },
    {
      "id": "nm4757423",
      "name": "Mark Rossignol",
      "character": "Cop"
    },
    {
      "id": "nm4153415",
      "name": "Benjamin Schrader",
      "character": "Elder Altman"
    },
    {
      "id": "nm0775109",
      "name": "D. Brett Schramm",
      "character": "Jeffrey Dahmer"
    },
    {
      "id": "nm8418353",
      "name": "Larry F. Scott",
      "character": "Cop at Lunch Table"
    },
    {
      "id": "nm6644455",
      "name": "Carlos Simental Jr.",
      "character": "Thug"
    },
    {
      "id": "nm6824870",
      "name": "Taylor J. Smith",
      "character": "Police Sgt"
    },
    {
      "id": "nm3979831",
      "name": "Destiny Soria",
      "character": "Herself"
    },
    {
      "id": "nm3694051",
      "name": "Debi Staron",
      "character": "Police Officer"
    },
    {
      "id": "nm0855764",
      "name": "Diana Terranova",
      "character": "Manson Girl"
    },
    {
      "id": "nm4243023",
      "name": "Ebony Williams",
      "character": "Ebony Williams"
    },
    {
      "id": "nm6062679",
      "name": "Javier Andy Zavala Jr.",
      "character": "Cop"
    }
  ],
  "overview": "Herbert Blount aspires to replace the real director of a movie and make it his own by capturing the lead actress and inflicting much horror upon her in his version.",
  "storyline": "Herbert Blount aspires to replace the real director of a movie and make it his own by capturing the lead actress and inflicting much horror upon her in his version.",
  "plot": "The original Deus Ex and its sequel Invisible War were developed by Ion Storm, with varying involvement of series creator and studio co-founder Warren Spector and designer Harvey Smith. After the release of Invisible War, multiple attempts were made to develop a sequel, even after Spector left Ion Storm. The two main projects were dubbed Deus Ex: Insurrection, which used the same engine as Invisible War while moving away from its divisive mechanics; and Deus Ex 3, which aimed to be an open world game with a branching narrative. An aborted attempt, intended as the fourth Deus Ex project following Insurrection, led to the development of Project Snowblind. Prospective development on the third Deus Ex game was halted when, following further staff departure and financial difficulties, the studio's owner Eidos Interactive closed them down in 2005.\n\nConcept development on Human Revolution began in early 2007, shortly after the founding of Eidos Montréal. The team at this point was fairly small, consisting of producer David Anfossi, director Jean-François Dugas, senior designer François Lapikas, and art director Jonathan Jacques-Belletête. The early period was devoted to research before performing brainstorming sessions to create the game's basic concepts. One of the concepts established early on was that it would be an ambitious project and they needed to bring the key staff on board as early as possible. They started with playing the first two games, determining what they liked and disliked about the original Deus Ex, and how they could carry over or improve these points. An early decision was to remain true to the series' core values, despite Human Revolution being essentially a series reboot. When presenting their project to Eidos management, they presented multiple sheets of their concept, and after two days the game was green-lit. The entire main staff were newcomers to the Deus Ex series, providing a large challenge to the development team as a whole. During the early design process, one of the things that worked well was the blueprint testing process and cutting items that would either not fit into the game or would make the project too large to handle. The most difficult period for the development team was the opening two-year period, which was described as a \"vertical slice\" through the game concepts, when they were trying to bring a piece of Human Revolution to retail quality before extending that out across the whole game.\n\nHuman Revolution was planned for consoles and Microsoft Windows systems, and one of the things Dugas insisted upon was that the PC version would not be a port of the console versions. With this in mind, the two versions needed to be as close as possible in gameplay feel. The full motion cutscenes were created collaboratively by Eidos Montréal, Square Enix's CGI department Visual Works, and Vancouver-based company Goldtooth Creative. Goldtooth created initial concepts based on the game, then the animation proper was handled by Visual Works. It was later stated that, despite knowing the necessity of incorporating multiple story-telling methods into the game, the team felt that the cutscene creation process was turned into a multi-studio effort due to time constraints. Time limits also forced them to drop real-time cutscenes. For the engine, the team used the Crystal Engine, developed by Crystal Dynamics and previously used in Tomb Raider Legend. It was intended to be part of a technology sharing policy that would further improve the engine for distribution in an enhanced form. Despite the initial intentions and an early tech demo going smoothly, the engine quickly proved to be inadequate to the team's needs as Eidos Montréal and Crystal Dynamics were pulling the engine's design in different directions. Eidos Montréal were given permission to branch away from the core engine so they could make the game work, adding new production tools that made it work in the new environment.\nGame design\n\nLapikas was responsible for multiple aspects of the game as lead designer, including the cover system, augmentations, conversations, hacking, combat and stealth AI, interactive objects, and general balancing. When creating the gameplay, the team settled on four pillar concepts: \"Combat\", \"Stealth\", \"Hacking\", and \"Social\". While gameplay took place primarily in first-person, a feature that had been part of the Deus Ex series since its inception, during certain actions the camera switched to a third-person view. This was because the team wanted to create a connection between players and Adam despite the risk that it might break immersion. Augmentations were designed to be customizable by players depending on playstyle, but unlike the previous two Deus Ex games, the use of mechanical augmentations and switches to third-person view enabled the player to see their changes affect Adam's appearance.\n\nFor combat, multiple references were used. These included Rainbow Six: Vegas for the cover system and tactical combat; F.E.A.R. for the design of AI; BioShock for the interlinking of weapon and obstacle types; the Call of Duty series for the regenerating health system; and Resident Evil 4 for multiple aspects including the inventory system, game economy and contextual actions. Regenerating health ended up being divisive among the fanbase during the game's run-up to release, despite it being seen as a necessary inclusion in the modern gaming market. Combat was intended to be easy-to-understand and visceral, with enemy types ranging from normal humans to augmented humans to robots, all mixed and matched for different combat situations. For stealth gameplay, the team used Metal Gear Solid as reference for the AI and alert systems, and The Chronicles of Riddick: Escape from Butcher Bay for the general organic feel of stealth. They had similar precepts to combat, wanting to make this style's rules and rewards clear to players. Interactive hacking was one of the earliest things the team had decided upon, alongside not including quick time events. The Hacking mechanics were inspired by the tabletop role-playing game Shadowrun. They were designed to invoke tension, and require a survey of both the surroundings and the security system while at the same time providing rewards. Social interactions followed similar patterns, becoming an extension to the general gameplay, with a similar risk-reward system.\n\nThe team had originally wanted to create the game's boss battles in-house around the game's similar elements of player choice, with their initial design inspired by the boss fights in Metal Gear Solid. As the development on the story and gameplay framework took priority, boss battles became less and less of a focus. It eventually reached a point when the main development team could not complete them in time for the game's release. The team contemplated cutting them, but that would have negatively impacted the story and other areas of the game's design. In the end, development of the boss battles was outsourced to Grip Entertainment. Having been given access to the game's engine, Grip Entertainment were given the task of creating the boss battles and incorporating them into the framework of Human Revolution. For this, they needed to incorporate their own technology into the system, working from Eidos' specifications while bringing their own development style to bear on the project. They also attempted to balance the boss fights' action-focused approach with the other elements within Human Revolution so it would be accessible to all players.\nScenario\n\nThe script of Human Revolution was written by Mary DeMarle, who was narrative director and main writer. While she did act as chief writer, DeMarle also worked on a number of other people throughout development so the story could be conveyed through environments and dialogue, along with handling how its progression was influenced by player choices. Sheldon Pacotti, main writer for the first two Deus Ex titles, was brought in as story consultant during the early stages, and was also contacted regularly through production to ensure that the storyline fitted properly within the series chronology. A total of four writers worked on the game, including author James Swallow. DeMarle was brought onto the project four months into its development, after it had been decided that it would be prequel to the first game, focusing on mechanical rather than nanotechnological enhancement technology. As part of her research, DeMarle looked up multiple subjects, from speculated conspiracy theories to the current level of biotechnology: the final story was influenced in large part by her reading of non-fiction and writings concerning transhumanism. DeMarle compared the game's study of transhumanism through main character Adam to that in the 1982 film Blade Runner, while also using the video game medium to put questions surrounding the ethics and motivations surrounding transhumanism in a nuanced way. She also stated that Adam being forced to confront these issues in person was the narrative's central irony, something that had previously been explored using different narrative elements in Deus Ex. The ending, which was ultimately decided using a choice of buttons, was chosen because of technical and time constraints while retaining player interaction. While the gameplay evolved continually through development and some elements required cutting, the story remained almost unchanged, instead being further refined and improved to work out plot holes.\n\nWhen creating the character of Adam Jensen, DeMarle wanted to give him a well-defined personality, and this necessitated balancing it with the narrative's player-driven nature. One of the biggest challenges was creating the various dialogue choices, as she needed to imagine what a character would say if they were hostile when she might normally portray them as benign. Multiple layers of dialogue were created within these variances to create different atmospheres within the narrative. There was standard dialogue with minor characters, more complex dialogue with major characters in quests, and what DeMarle termed \"conversation boss fights\", dialogue tied to the gameplay where social skill could help the player reach an objective. When creating characters, the team drew inspiration from the character portrayals in the Metal Gear series. When designing the corporate side, DeMarle particularly cited the backgrounds of Howard Hughes, Richard Branson and Bill Gates as inspiration for the powerful CEO figures in the narrative of Human Revolution. She also noted the way in which corporations had gained greater power than governments in the narrative, something that paralleled political comments on corporate power at the time.\n\nThe world of Human Revolution was designed to parallel the Greek myth of Icarus; in the myth, Icarus was flying with artificial wings, but flew too close to the sun and destroyed his wings, causing his fatal fall. The world's new reliance on and experimentation with augmentation technology mirrored the myth, with the game's narrative taking place at a crucial tipping point, the outcome of which would be decided by the player. The general focus on technology and its effect on human society also tied into the game's visual themes. The development team used multiple sources as references while creating the world and scenario. The Children of Men was used to capture the setting and resultant chaotic drama, Bioshock gave them a reference for the handling of mature themes, while the television series Rome showed how powerful people's ambitions shaped history. The sense of tension between augmented and normal humans was inspired by the similar tension between humans and mutants in the X-Men franchise. For the conspiracy elements of the plot, the team used novels Deception Point, The Firm, and Frank Herbert's Dune saga as inspiration. The desired quality of cutscenes and dialogue were directly inspired by the Grand Theft Auto and Mass Effect franchises. DeMarle termed the final product as a study in contrasts, as the implementation of augmentation technology had created a new form of divided social class system when other social barriers had fallen. Other themes used earlier in Deus Ex, such as exploring a culture of fear; the workings of a surveillance state; and the exploitation created by economic inequality, were paralleled in Human Revolution. To add more depth to the world and narrative, the team created supplementary written material such as emails, e-books, and cell phone-like devices called pocket secretaries.\nArt design\nConcept artwork of the city hub of Hengsha. While still carrying cyberpunk themes, the aesthetics and colors drew inspiration from Renaissance-era artwork.\nJonathan Jacques-Belletête acted as the game's art director, being in charge of creating its look. The two key visual themes were the Icarus myth and the artwork of the Renaissance: both were woven in on a narrative and visual level. In terms of colors, the team drew inspiration from notable Renaissance artists, including Johannes Vermeer and Rembrandt. The color scheme was dominated by black and gold: black represented the game's dystopian aspects, while the gold both humanity and hope for the future. The Renaissance styling originally permeated everything, but they were ending up with crates looking like baroque furniture, so they toned it down and blended it with modern and cyberpunk elements. During development, the team coined the term \"cyber-renaissance\" to define their blending of Renaissance styling, cyberpunk elements, and the Icarus myth. An extensive amount of concept art was created for the game: while the majority was handled by artists Richard Dumont and Eric Gagnon, other contributors included Jim Murray, Brian Dugan, Theirry Doizon, Trong Nguyen and Sébastien Larroudé.\n\nWhile cyberpunk remained a core part of the game, the team were faced with the trouble that no-one really knew what cyberpunk was any more: the most recent game and film references they had were from the early 2000s, as many works that might have been classed as cyberpunk were now being treated as science fiction. While they could easily have replicated the atmosphere of films like Blade Runner, the team wanted to create something original within the genre. Something that concerned the team was about portraying the world of Human Revolution in relation to the original Deus Ex, which chronologically took place 25 years later: while the original Deus Ex used technological elements common at the time it was made such as 4:3 aspect ratio monitors and landline telephones, Human Revolution used mobiles and wide-screen televisions. According to Jacques-Belletête, this separation was ultimately put down to the differing portrayals of the world between the two games: while Deus Ex was set in poor communities and focused on the social impact of new technology, Human Revolution focused on the high end of society and technology's physical impact.\n\nJacques-Belletête worked on character designs with Murray, whose previous work included artwork for the comic series 2000 AD. Before designing character costumes, Jacques-Belletête looked extensively at modern fashion. As focusing purely on Renaissance styling would have resulted in clothing styles deemed \"too allegoric\" to work in the game, they redesigned them so they included Renaissance and cyberpunk elements while resembling clothing people would wear in the present day and not appearing cliched. For Adam's character design, the team looked at multiple protagonist from cyberpunk fiction, from Blade Runner to the original Deus Ex. Their main wishes were to incorporate sunglasses and a trench coat. Jacques-Belletête moderated his design to combine Renaissance aesthetics with the cyberpunk thematics: he defined it as being able to see Adam's augmented state in combat during the brief third-person camera moments while still seeing him having a meal in a high-class restaurant. One design which had him sleeveless throughout the game was scrapped as it made him \"look like a douche\". Instead, they created two looks: a sleeveless action-oriented look for missions, and a sleeved trench coat with a high collar and geometric patterning to portray the Renaissance elements. In total, it took two years and a half to finalize Adam's design, with multiple designs being rejected as they failed to properly balance the cyberpunk and Renaissance elements.\n\nThe team wanted to make the game as consistently realistic as possible, wishing to avoid the situation of realistic character models standing in front of low-resolution backgrounds. They created varying degrees of technical advancement for different locations: the most realistic location they created was the Detroit hub, while the most advanced was the two-level fictional metropolis of Hengsha. Architecture in the Detroit area was inspired by then-modern buildings from Japan and Europe. Jacques-Belletête spent a long time researching furniture designs while creating interiors for in-game environments, joking that they could fill an IKEA catalogue with the results. Multiple other hub locations were planned, including the upper levels of Hengsha, and an area of Montreal dubbed \"Plateau\" that featured \"very specific architecture, called tri-plexes, with twirling exterior staircases made of [...] old metal\". At the beginning of production, there were even plans to feature a hub location in India. When it became clear how much work it would be, the team cut out what could not be managed. Upper Hengsha was built but never finished before being scrapped.\nMusic\n\nDeus Ex: Human Revolution Original Soundtrack\nSoundtrack album by Michael McCann\nReleasedNovember 15, 2011\nGenreVideo game soundtrack\nLength\t1:07:21\nLabel\tSumthing Else Music Works\nProducer\tMichael McCann\nThe music of Human Revolution was composed by Michael McCann, who worked on the score from 2008 to 2011. McCann also handled production, performance, mixing and arranging. Additional arrangements were done by Francois Arbour and Eric Arvisais. Vocals were provided by Andrea Revel and Courtney Wing. McCann, when comparing Human Revolution with his prior work on Ubisoft's Tom Clancy's Splinter Cell: Double Agent, stated that the latter could be scored more like a feature film due to its linear nature, while Human Revolution's non-linear approach to both gameplay and story made composition more challenging. McCann's music for Human Revolution was focused around the game's multilayered dualistic themes, which he described as \"technology/nature, past/future, wealth/poverty\", all of which were encompassed by the general transhumanist theme. McCann and sound director Steve Szczepkowski initially started out using dark electronic scoring typical of the cyberpunk genre, but during the three-year period he worked on the game the music gradually became more \"organic\". He was influenced by the visuals' Renaissance styling, convincing him to blend organic and traditional cyberpunk elements. The electronic elements were influenced by the film music of John Carpenter, Vangelis, and the band Tangerine Dream. The acoustic mood elements were inspired by the work of Lisa Gerrard, Ennio Morricone and Elliot Goldenthal. Outside films, he was strongly influenced by electronic bands and musicians, such as Amon Tobin and the band Massive Attack.\n\nThe musical structure was defined by him as \"three-sided\", mimicking the thematic use of triangles in the game. His three musical elements were acoustics (vocals, strings) representing the past; electronic music representing the future; and the present being a mixture of the two in both style and instrumentation. Vocals also evoked slight religious overtones, which again connected to the use of the number three due to the number's multiple religious associations, in turn suggested and influenced by the Renaissance atmosphere. Another example of three-fold design was the ambient music, which needed to vary between quiet, tense and active depending on Adam's situation: each piece was constructed as a standalone cue that would interact with its fellows depending on the flow of gameplay. This presented a challenge to McCann about the handling of themes and melodies, as short cues might grow repetitive over time. Individual environments were also designed to contrast each other musically. An example given by McCann was different areas of the main city hubs: in the wealthy areas of Hengsha, the music evokes light and wealth, while in the poor areas of Detroit, it would be dark to reflect lawlessness and the surrounding decay. This necessity of intertwining music with the environment meant that McCann needed to keep the music minimal enough to be unobtrusive while still being noticeable.\n\nMcCann did not design any specific character themes, instead keeping any recurring themes ambiguous. He gave both stylistic and technical reasons for this: technically the music system was too simple to allow for a large number of unique musical cues, and stylistically it worked on a technical and musical level for there to be no specific musical themes influencing the player's judgement of characters and situations. The cues for hacking sequences were created fairly early in the process, and was one of a group of cues McCann created during a break from the project. A piece he commented on in 2010 was \"Icarus\", the game's main theme. He created special versions for the game's reveal trailer, including a six-minute version broken into five sections for the director's cut of the trailer. He worked on creating the theme for two months, starting out with piano, vocals and minimal synthesizer work before building the full layers onto it. The final layer added were \"synth arpeggios\" that completed the piece's transformation into a full piece of cyberpunk-themed music. The \"Icarus\" theme, and by extension the soundtrack, also tied into the game's overall themes and motifs.\n\nA soundtrack disc was included in the limited \"Augmented Edition\". An official album, Deus Ex: Human Revolution Original Soundtrack, was released on November 15, 2011. It was released through Sumthing Else Music Works as a physical and digital release. The album contained 25 tracks created from 50 out of the 200 pieces created for the game. The tracks included both cues from the game and arranged versions used in trailers. McCann chose the tracks to represent the game's story, drawing on the various styles of the music as a whole. He used the official album release to accentuate what he had been doing for the soundtrack as a whole. He initially wanted the soundtrack to be two discs, but realized that this would lead to repetition, so limited himself to a single disc. The remaining unreleased pieces were left out because of that potential repetition. The soundtrack received praise from multiple music critics: Original Sound Version's Gideon Dabi, commenting on the game's music prior to the album's commercial release, was highly positive about McCann's work, calling it \"a tremendous upgrade over its predecessors\" and praising its low-key impact. Simon Elchlepp, writing for Video Game Music Online, gave the album 4/5 stars: he called it \"a very satisfying experience\", praising the score's connection to the game's themes and overall quality despite some perceived missteps about use of its main theme. RPGFan's Liz Maas said that, while it trended towards being generic, with the track \" Barrett Boss Fight\" being most guilty of this, it managed to remain consistent with its themes and was worth buying.",
  "synopsis": null
}