{
  "imdb_id": "tt3210998",
  "tmdb_id": "301606",
  "douban_id": null,
  "title": "Matthew 18 (2014)",
  "genres": [
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "101 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.6,
  "director": [
    {
      "id": "nm5714435",
      "name": "Roy Belfrey"
    }
  ],
  "writer": [
    {
      "id": "nm5714435",
      "name": "Roy Belfrey",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm6349549",
      "name": "Denise Baker",
      "character": "Angelica"
    },
    {
      "id": "nm6749379",
      "name": "Irina Balushka",
      "character": "Russian Party Host"
    },
    {
      "id": "nm6749373",
      "name": "Lanore VanBuren Belfrey",
      "character": "Melissa"
    },
    {
      "id": "nm6749367",
      "name": "Sanya Belfrey",
      "character": "Aunt Liz"
    },
    {
      "id": "nm5819173",
      "name": "Don Benjamin",
      "character": "Nathan"
    },
    {
      "id": "nm6749359",
      "name": "Markaja Cooper",
      "character": "Tammy"
    },
    {
      "id": "nm6749368",
      "name": "Aidan Crawford",
      "character": "Maria Jamieson"
    },
    {
      "id": "nm6749374",
      "name": "Russell Daniel",
      "character": "Pastor"
    },
    {
      "id": "nm6749364",
      "name": "Isis De Oliveira",
      "character": "Julia"
    },
    {
      "id": "nm6749369",
      "name": "Olga Frayman",
      "character": "Veronica"
    },
    {
      "id": "nm6749361",
      "name": "Cherie Frazier",
      "character": "Claire Jamieson"
    },
    {
      "id": "nm6749389",
      "name": "Jessica Grams",
      "character": "Ghost 1       (voice)"
    },
    {
      "id": "nm6749362",
      "name": "James Griffin",
      "character": "Edward"
    },
    {
      "id": "nm4374699",
      "name": "James Griffin",
      "character": "Lawyer 2       (as James Wesley)"
    },
    {
      "id": "nm6749380",
      "name": "Avis Gustason",
      "character": "Café waitress"
    },
    {
      "id": "nm6749383",
      "name": "Lenorise Guy",
      "character": "There are Signs lady"
    },
    {
      "id": "nm1179560",
      "name": "Eric Hackett",
      "character": "Police 2"
    },
    {
      "id": "nm6749375",
      "name": "Thomas Hoskamer",
      "character": "Old Man 1"
    },
    {
      "id": "nm6749391",
      "name": "Dixie Howell",
      "character": "Ominous phone lady       (voice)"
    },
    {
      "id": "nm5629105",
      "name": "Joy Yvonne Jones",
      "character": "India       (as Joy Jones)"
    },
    {
      "id": "nm6749385",
      "name": "Bob Kretchmer",
      "character": "Doctor"
    },
    {
      "id": "nm6749388",
      "name": "Nikki Kretchmer",
      "character": "Female Nurse 2"
    },
    {
      "id": "nm5430745",
      "name": "Rina Kurtz",
      "character": "Miss Hillshire       (as Maureen Kurtz)"
    },
    {
      "id": "nm6749378",
      "name": "Melodie Lanegran",
      "character": "Ghost 1"
    },
    {
      "id": "nm6749382",
      "name": "Bob Leibman",
      "character": "Lawyer 3"
    },
    {
      "id": "nm0522324",
      "name": "Faizon Love",
      "character": "Lifton Tyler"
    },
    {
      "id": "nm0132685",
      "name": "Luenell",
      "character": "Aunt Jessie"
    },
    {
      "id": "nm4545309",
      "name": "Jennifer Jayleen Martinez",
      "character": "Michelle Jamieson"
    },
    {
      "id": "nm1139547",
      "name": "Ashley Michelle",
      "character": "Club Waitress"
    },
    {
      "id": "nm6749377",
      "name": "Janet Mondloh",
      "character": "Ghost 2"
    },
    {
      "id": "nm3131363",
      "name": "Darrick Mosley",
      "character": "Renfro"
    },
    {
      "id": "nm6749387",
      "name": "Jennifer Nelson",
      "character": "Female Nurse"
    },
    {
      "id": "nm6749376",
      "name": "Renee Phifer",
      "character": "Old Man 2"
    },
    {
      "id": "nm0741258",
      "name": "Barb Rose",
      "character": "Flight Attendant"
    },
    {
      "id": "nm6749370",
      "name": "Maria Schwartzenberger",
      "character": "Russian 2"
    },
    {
      "id": "nm6749365",
      "name": "James Simmons",
      "character": "Grandad"
    },
    {
      "id": "nm6749381",
      "name": "James Storholm",
      "character": "Lawyer 1"
    },
    {
      "id": "nm6744727",
      "name": "Lexi Sullivan",
      "character": "Young angelica"
    },
    {
      "id": "nm6749386",
      "name": "Sean Sullivan",
      "character": "Male Nurse"
    },
    {
      "id": "nm6749390",
      "name": "Lorie Swanson",
      "character": "Ghost 2       (voice)"
    },
    {
      "id": "nm6749384",
      "name": "Kelly Thomas",
      "character": "Police 1"
    },
    {
      "id": "nm6749371",
      "name": "Henry Van Gurp",
      "character": "Harris Jamieson"
    },
    {
      "id": "nm6749363",
      "name": "Shenel Williams",
      "character": "Keela"
    },
    {
      "id": "nm6749366",
      "name": "Lucy Young",
      "character": "Mystery Woman"
    }
  ],
  "overview": "When Michelle Jamieson is accepted in the medical program at the University of Minnesota, she is eager to find her own path away from her deeply religious family. But when she stay in a Minneapolis mansion belonging to her family for generations, she begins to encounter strange and unexplainable occurrences. As she is forced to investigate, what she uncovers is a world of family secrets and unspeakable evils.",
  "storyline": "The story centers around the subject of African American culture, what goes on in the grassroots of the church community and even within the households and fabric of the culture. The film, explores the spiritual world as it impacts the natural world.",
  "plot": "Based on a true story, the film depicts a group of lesbian and gay activists who raised money to help families affected by the British miners' strike in 1984, at the outset of what would become the Lesbians and Gays Support the Miners campaign. The alliance was unlike any seen before and was ultimately successful.\n\nGay activist Mark Ashton watches the news about the Miners Strike, before setting off to join the Gay Pride Parade in London. Joe Cooper, a 20-year old student from Bromley who is exploring his own homosexuality, goes off to watch the Gay Pride Parade, but before he knows it, he is involved with the small group of Gay and Lesbian activists led by Mark. The group plan their protests and actions from Gay's the Word, a bookstore, run by gay couple Gethin and Jonathan. Mark explains that the gay community is not harassed as much by the police the last days, because the police have found a new target: every day, the miners clash with the police violently, and many minors are arrested and beaten up. And just like the gay community, they are treated with hostility from the public and the government, and the subject of a smear campaign by the tabloid newspapers. Mark announces the forming of the \"Lesbians and Gays Support the Miners\" to help raise money. Many activists however refuse to join because of past experiences with discrimination and aggression from miners against the gay community. The LGSM thus consists of \"six gays and a dyke\" who start raising money immediately; Joe will be their official photographer. Their actions prove a success.\n\nThe National Union of Mineworkers however is reluctant to accept the group's support due to the union's public relations' worries about being openly associated with a gay group. Frustrated by the lack of response, the activists instead decide to take their donations directly to a mining village. Gethin explains most mining villages are in Wales, so with a map in hand they pick a random village. They call the community center in Onllwyn, a small mining village in Wales, and to their excitement, the support group there accepts the donation of the LGSM. Dai Donovan, spokesperson for the miners in Onllwyn, comes to London to meet their new allies, only to discover that \"L\" does not stand for London and LGSM is a gay and lesbian group. He admits he has never met gay people before, to which Mark responds that he has never met a miner before. Dai quickly realizes the importance of an alliance between the two communities. When announced to give a speech to thank the gay community for their support, the gay and lesbian crowd is at first sceptical and even hostile. However, with his eloquent speech he wins the hearts and minds of the crowd.\n\nIn Onllwyn, Siân James is starting as a volunteer at the community center. She overhears the Womens' Support Group debating wether or not to invite LGSM to their village. Despite her husband Martin urging her not to stand out too much on her first day, she speaks out to invite the LGSM, which leads to her becoming a member of the Womens' Support Group. It is soon clear that some are unwilling to let the gays come over. The anti-gay sentiments are centered around Maureen Barry, who vehemently opposes the gay and lesbian support from the start, inciting her two sons to protest against them coming to Onllwyn. When the LGSM arrive in Onllwyn, they are met by a silent and hostile crowd; Marks' clumsy speech worsens the situation (at one point he says that \"when one in five people is gay, so is one in five miners, so at least one in five of you is happy to see us\", which leads to villagers walking out immediately). The next day, the LGSM is taken on a sightseeing tour around the countryside by Siân and Cliff Barry. In the distance, they see police cars, which means the miners are again arrested, a form of harassment by the police against the miners. Jonathan explains to Siân that the police are acting unlawfully, and that they cannot arrest the miners without evidence. Siân barges into the police office to demand the miners, among other her husband, be released immediately. Back in the community center, the miners are celebrating their release. When explained that they owe their quick release to the gays and lesbians, most miners now regard the LGSM as allies. That evening in the community center, the gays and lesbians in turn see the sense of community among the villagers, letting go of their own prejudice about the miners. Spontaneously, Mark announces that the LGSM will organize something spectacular to collect even more money and make the government meet the demands of the miners, although he has no idea as yet.\n\nMaureen Barry, bitter about the miners and support groups embracing the gays and lesbians, contacts a tabloid about the LGSM. The next day, the miners from Onllwyn are greeted by police and fellow miners with cat calls and comments, and read the front page article. The National Union of Miners urges the Onllwyn support group to sever ties with the LGSM. A meeting will be arranged on whether the support of the LGSM should be accepted or not. Mark and the group see their chance: being called 'perverts' in the tabloid, they decide to adopt the term for themselves, and instead use it for the grand idea. A music festival, with the title \"Perverts and Pits\", will be organized in the Electric Ballroom in Camden Town. At first no record label is willing to have their artists play at their festival (at one office, after being told that \"the label does not have gay artists\", Mark writes the phone number of the Gay and Lesbian Support Hotline under the pictures of two artists, \"in case someone might need it in the future\"; the pictures feature prominent gay artists Elton John and Soft Cell). In the end, Bronski Beat announces it will perform at the festival. Members of the Mens' and Womens' Support Groups from Onllwyn and other villagers that are interested are coming over to London. The festival is a huge success. Afterwards, the villagers are taken on a tour along the bars and disco's of London, which results in the villagers and the gays and lesbians becoming even closer friends.\n\nThe next day they hurry back to be in time for the meeting. Upon arrival, they discover the meeting was rescheduled to 12:00 PM instead of 3:00 PM, resulting in the decision to sever ties with the LGSM. Cliff and Martin, lacking the eloquence of Dai, were not able to stand up to the others, let alone have the meeting cancelled. Siân and the other women confront Maureen, who tells that the LGSM is only supporting them to push forward their own agenda on gay rights. Siân then empties the bag of money on the table, showing the thousands of pounds raised at the festival. Disillusioned, the LGSM and villagers part and go home. From the money, the Womens' Support Group buy a new red van to transport the miners to the protest rallies. The red van has prominently displayed on the side that it was donated by the LGSM.\n\nIn March 1985, the Miners' Strike is over. The miners of Onllwyn gather to go back into the mines. Joe visits the village to see them go off to work. He sees Mark, who has alienated himself from the LGSM in fear of being infected with HIV. Mark confronts Joe about him hiding his activism and homosexuality towards his parents. When Siân drives Joe home in the red van, his family has just gathered to celebrate the birthday of his nephew. Joe's mother panics upon seeing the van and demands Siân move it from their property. Joe confronts his parents and leaves them, finally choosing for himself.\n\nAt the 1985 Gay Pride Parade, the LGSM and the Lesbians Against Pit Closures are asked to walk in the back of the line with the other fringe groups, because the organisers want to keep out any political signs. The LGSM is disappointed at first, until the red van arrives, with several of the villagers, to show their support in turn. The organisers of the parade announce that they will now have to walk in front of the parade because they are with too many people: hundreds of miners, led by the National Union of Mineworkers, arrive to show their solidarity. In the closing scenes, the comment says that the miners led the Gay Pride Parade. In 1986, the Labour Party incorporated rights for gays and lesbians in their party programme, due to pressure from the National Union of Mineworkers.\n\nWhile the film focuses primarily on LGSM, there are several smaller plot threads:\nOne is devoted to the women-only splinter group Lesbians Against Pit Closures.The growing awareness about HIV and AIDS is another thread, with Mark being confronted with an ex-lover being infected and dying, whilst he himself distancing himself from the others because he suspects he is infected as well. Jonathan explains later to Siân that he is the second person diagnosed with HIV in the UK and the impact HIV and AIDS have on the gay community.Joe's growing involvement in the activist group and his coming out, resulting in him leaving home and breaking ties with his parents and family.The inequality in age of consent, exemplified by Joe.Gwen, the elderly woman who becomes good friends with the lesbian members of LGSM.Siân becoming more aware of her own talents, and realizing with the help of Jonathan that she can be more than just a mother and housewife.Gethin reconciling with his Welsh background and his mother, who he has not seen in 16 years because she could not accept his homosexuality.Hostility towards the gay community: Gay's the Word is targeted by vandalism several times, Maureen and her sons oppose the acceptance of the LGSM by the Support Group, and Gethin is beaten up and taken into hospital.",
  "synopsis": null
}