{
  "imdb_id": "tt3247678",
  "tmdb_id": "399959",
  "douban_id": null,
  "title": "Dominium (2013)",
  "genres": [
    "Drama",
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "Puerto Rico",
  "version": [
    {
      "runtime": "75 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.3,
  "director": null,
  "writer": null,
  "cast": [
    {
      "id": "nm6026883",
      "name": "Emanuel Freire",
      "character": "Enrique"
    },
    {
      "id": "nm6021597",
      "name": "Yomar Davila",
      "character": "Alexis"
    },
    {
      "id": "nm6026884",
      "name": "Nicole Ramos",
      "character": "Michelle"
    },
    {
      "id": "nm6021594",
      "name": "Lycan Maldoando",
      "character": "Renato /              Tanato"
    },
    {
      "id": "nm6079272",
      "name": "Juan Boria",
      "character": "Arturo"
    }
  ],
  "overview": "Kike, Alexis, and Arturo want to film a documentary about urban legends. When they unexpectedly interrupt a strange ceremony at an ancient cemetery, they are forced to join with Michelle and Renato, a nurse who loves to install cameras at places where paranormal activities occur. Together they will unfold a horror that should have never been revealed.",
  "storyline": "Horrific paranormal hauntings disturb a documentary crew's boundary-pushing film. Investigating an unsettling ceremony, they uncover mysteries that'll put all of their lives in danger.",
  "plot": null,
  "synopsis": "Kike (Emanuel Freire) , Alexis (Yomar Davila) and Michelle (Nicole Ramos) made a documentary for the University about places and paranormal events.Documenting the documentary Kike keeps the camera as long as possible on. And propose visiting a cemetery to start off . This begins the chain of events , given that unintentionally disrupt a strange ceremony that was done among the graves .Originally Arturo (Juan Boria) was among them, but because of his religious beliefs and his experience in the visit of an old cemetery decides to leave the assignment and ask that a friend of Kike to replace him . Alexis from the beginning embraces the idea and he makes every effort to not only do the job but conquer Michelle because of his womanizing nature.With Michelle in the team they take the task of interviewing people on the street and experts as well as visiting places that such events occurs .In investigations encounter a Web site that exhibited the same types of cases they want to investigate. They interview the creator of the page. This turns out to be Renato (Lycan Maldonado) . He will take them to places to capture paranormal images and voices .Both Alexis and Kike do not imagine that between Michelle and Renato there another agenda ."
}