{
  "imdb_id": "tt3202890",
  "tmdb_id": "286654",
  "douban_id": null,
  "title": "Reclaim (2014)",
  "genres": [
    "Action",
    "Crime",
    "Drama",
    "Thriller"
  ],
  "country": "China",
  "version": [
    {
      "runtime": "96 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.1,
  "director": [
    {
      "id": "nm0924429",
      "name": "Alan White"
    }
  ],
  "writer": [
    {
      "id": "nm1729294",
      "name": "Luke Davies",
      "description": null
    },
    {
      "id": "nm5959679",
      "name": "Carmine Gaeta",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0000131",
      "name": "John Cusack",
      "character": "Benjamin"
    },
    {
      "id": "nm0000202",
      "name": "Ryan Phillippe",
      "character": "Steven"
    },
    {
      "id": "nm0498956",
      "name": "Rachelle Lefevre",
      "character": "Shannon"
    },
    {
      "id": "nm0915865",
      "name": "Jacki Weaver",
      "character": "Reigert"
    },
    {
      "id": "nm0350079",
      "name": "Luis Guzmán",
      "character": "Superintendent"
    },
    {
      "id": "nm6205746",
      "name": "Briana Roy",
      "character": "Nina"
    },
    {
      "id": "nm3972804",
      "name": "Jandres Burgos",
      "character": "Salo"
    },
    {
      "id": "nm4460433",
      "name": "Veronica Faye Foo",
      "character": "Paola"
    },
    {
      "id": "nm6119389",
      "name": "Alex Cintrón",
      "character": "Hotel Manager"
    },
    {
      "id": "nm0750448",
      "name": "Millie Ruperto",
      "character": "Female Sergeant"
    },
    {
      "id": "nm1109334",
      "name": "Oscar H. Guerrero",
      "character": "Taxi Driver"
    },
    {
      "id": "nm5640356",
      "name": "Reema Sampat",
      "character": "Interpreter"
    },
    {
      "id": "nm3641960",
      "name": "Isabelle Adriani",
      "character": "Esmeralda (Bank Teller)       (as Isabella Adriani)"
    },
    {
      "id": "nm0517778",
      "name": "Sunshine Logroño",
      "character": "Mr. Lopez (Bank Manager)       (as Emmanuel Logrono)"
    },
    {
      "id": "nm6531335",
      "name": "Sean Taylor",
      "character": "Gerry"
    },
    {
      "id": "nm5667034",
      "name": "Blas Sien Diaz",
      "character": "Walker       (as Blas Diaz)"
    },
    {
      "id": "nm4562163",
      "name": "Omar Cruz Soto",
      "character": "Tourist (BG)"
    },
    {
      "id": "nm1579008",
      "name": "Luis Gonzaga",
      "character": "Detective"
    },
    {
      "id": "nm6598694",
      "name": "Edwin Lord",
      "character": "Civil"
    },
    {
      "id": "nm7455946",
      "name": "Jonathan Louis Ramos",
      "character": "Local guy at the bar"
    }
  ],
  "overview": "After their newly adopted daughter goes missing in a small town, Steven and Shannon will stop at nothing to uncover the truth behind her disappearance and the dangerous secret behind the adoption agency they trusted. Risking their own lives, they will discover just what being a parent means and how far they will go to get their child back.",
  "storyline": "Chicago artists couple Steven and Shannon travel to Puerto Rico to complete the adoption of Haiti earthquake orphan Nina. They start bonding in a hotel and later resort waiting for the travel documents, but the trauma of a car accident rendering her infertile is rekindled by their weird neighbors, headed by NGO veteran Benjamin and feisty henchman Salo, who picks an even weirder bar fight to beat up staged-drunk Steven. Shortly after, Nina disappears and the San Juan police superintendent concludes it's a scam by a fake adoption agency. While the couple keeps looking desperately for cahoot Nina, Benjamin prepares an even crueler chapter, which bodes ill for all adults.",
  "plot": "After a car accident that left her unable to have children, Shannon (Rachelle Lefevre) and her husband, Steven (Ryan Phillippe), decide to adopt a Haitian girl, Nina, orphaned after the 2010 earthquake, through the IRA (International Rescue Adoption), an organization run by Gabrielle Reigert (Jacki Weaver) and based in Puerto Rico. Having paid $60,000, the two move to a resort while they wait for Nina's United States passport to arrive. Steven takes an instant dislike at his neighbors, Benjamin (John Cusack), Salo (Jandres Burgos), and Paola (Veronica Faye Foo), especially after a misunderstanding with Salo at a bar, where he tells them about Nina, leads to a fight.\n\nTwo days after the adoption, the couple wakes up to discover that Nina has disappeared. They begin their search and contact a policeman (Luis Guzmán) who tells them that their adoption documents are not recorded, while the IRA's headquarters in Old San Juan has been deserted. Steven admits that Reigert had demanded an additional $40,000 as part of the adoption cost, which he did not tell to Shannon beforehand. Benjamin then suggests that the IRA is a confidence schemer which offers orphans to unsuspecting couples in exchange for a hefty sum of money, only to take them away just a few days afterward. That night, Steven and Shannon are kidnapped by Benjamin and his aides, who reveal themselves to be child traffickers working for Reigert. Holding Nina, they force the couple to send their entire savings, which is largely compensation for the car accident that left them unable to conceive.\n\nThe next day, Steven heads to the bank at gunpoint to collect the savings. Having taken note that Benjamin's mansion was in Maunabo, he escapes back to the mansion with the money from Salo. Meanwhile, Shannon breaks free from her captivity, takes Nina, then distracts Paola long enough for Steven to take her gun and vehicle to facilitate his escape with his wife and Nina. They are pursued by Benjamin and Salo, though the latter is killed when a truck hits his car. After a chase, Benjamin crashes his car and is presumed dead, while the couple and Nina narrowly avoid falling from a steep cliff.\n\nThe three are escorted back by the policeman, but he is killed by Benjamin who, having survived his crash, knocks Steven unconscious before taking them to Riegert's villa. A dispute regarding his shares of the money causes Benjamin to shoot Riegert dead. Steven recovers and follows Benjamin, who chases Shannon and Nina into a decrepit building. Just before he is able to murder Shannon, Steven arrives and kills Benjamin. The couple then convinces Nina, traumatized by the incident, to put down the gun she took and live with them.\n\nThe film ends with a text showing the viewers that 1.2 million children are being trafficked each year, most of which go undetected.",
  "synopsis": null
}