{
  "imdb_id": "tt3258080",
  "tmdb_id": "268898",
  "douban_id": null,
  "title": "The Candidate (2013)",
  "genres": [
    "Comedy",
    "Thriller"
  ],
  "country": "Slovakia",
  "version": [
    {
      "runtime": "106 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm6014039",
      "name": "Jonás Karásek"
    }
  ],
  "writer": [
    {
      "id": "nm6014048",
      "name": "Peter Balko",
      "description": null
    },
    {
      "id": "nm6014047",
      "name": "Michal Havran",
      "description": null
    },
    {
      "id": "nm4455926",
      "name": "Maros Hecko",
      "description": "writer"
    },
    {
      "id": "nm4455926",
      "name": "Maros Hecko",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2141804",
      "name": "Marek Majeský",
      "character": "Adam Lambert"
    },
    {
      "id": "nm0385182",
      "name": "Monika Hilmerová",
      "character": "Alena"
    },
    {
      "id": "nm5005245",
      "name": "Michal Kubovcík",
      "character": "Blondacik"
    },
    {
      "id": "nm0229352",
      "name": "Michal Dlouhý",
      "character": "Jazva"
    },
    {
      "id": "nm0805118",
      "name": "Pavel Slabý",
      "character": "Biskup"
    },
    {
      "id": "nm4114538",
      "name": "Ján Jackuliak",
      "character": "Ivan Muller"
    },
    {
      "id": "nm0525715",
      "name": "Roman Luknár",
      "character": "Bachratý"
    },
    {
      "id": "nm0637288",
      "name": "Pavel Nový",
      "character": "Generál"
    },
    {
      "id": "nm0972612",
      "name": "Alice Bendová",
      "character": "Silvia"
    },
    {
      "id": "nm6014045",
      "name": "Lubomir Burgr",
      "character": "Starozitník"
    },
    {
      "id": "nm2806562",
      "name": "Milan Chalmovský",
      "character": "Peter Palko"
    },
    {
      "id": "nm6014047",
      "name": "Michal Havran",
      "character": "Peter Poton"
    },
    {
      "id": "nm6014043",
      "name": "Ivana Havranová",
      "character": "Redaktorka"
    },
    {
      "id": "nm10612605",
      "name": "Jana Holkova",
      "character": "Girl from the street"
    },
    {
      "id": "nm6014041",
      "name": "Lucia Jarosková",
      "character": "Asistentka Monika"
    },
    {
      "id": "nm10846669",
      "name": "Michal Kozelský",
      "character": "Ziak"
    },
    {
      "id": "nm6014040",
      "name": "Katka Kurecková",
      "character": "Petra Jamnická"
    },
    {
      "id": "nm6014046",
      "name": "Marek Liso",
      "character": "Agent"
    },
    {
      "id": "nm3768102",
      "name": "Danica Matusová",
      "character": "Casnicka"
    },
    {
      "id": "nm3070482",
      "name": "Marian Mitas",
      "character": "Lekár"
    },
    {
      "id": "nm2935661",
      "name": "Lucie Molnárová",
      "character": "Dina"
    },
    {
      "id": "nm3308054",
      "name": "Petra Molnárová",
      "character": "Dása"
    },
    {
      "id": "nm4158249",
      "name": "Lukas Pelc",
      "character": "Milan Kraus       (as Lukás Pelc)"
    },
    {
      "id": "nm6014044",
      "name": "Dusan Vicen",
      "character": "Primár"
    },
    {
      "id": "nm6014042",
      "name": "Dominika Zeleníková",
      "character": "Hana, receptionist       (as Dominika Moravkova)"
    }
  ],
  "overview": "It is a fiction movie about the background of one presidential election campaign. It is a real story, that never happened.",
  "storyline": "Nowadays, information is the most valuable currency. The story follows the background of a political campaign of a presidential candidate. There are two months remaining to the elections. Adam Lambert, a successful and influential owner of an advertising agency, gets a job - to create a political campaign for a peculiar candidate - an indistinctive small-town entrepreneur. The goal is simply to stir the political waters and strip the opposite party of a few votes. Lambert is used to manipulating people without a blink of an eye and always gets what he wants. However, during a dinner party he is provoked into a bet against his rival - Ivan Muller, who works for the heaviest favorite of the elections. The stake is approximately 7 million euros. Lambert bets all his fortune on a single horse, the unknown candidate. He swears he will transform this loser into a president, and that he will accomplish that not later than in the first round of the elections. The movie Candidate depicts what ...",
  "plot": "Major Bennett \"Ben\" Marco (Denzel Washington) is a war veteran who begins to doubt what is commonly known about his famous U.S. Army unit. During the Gulf War, Sergeant First Class Raymond Shaw (Liev Schreiber) supposedly rescued all but two members in his unit, of which Marco was the commanding officer. Shaw became a war hero and was awarded the Medal of Honor, launching his political career.\n\nYears later in a dystopian United States, one of Marco's former NCOs, Corporal Al Melvin (Jeffrey Wright), contacts him and says that he suffers from confusing memories and \"dreams\" about their lost Army unit. He is clearly deranged, but he shows Marco some images he has drawn from his dreams.\n\nShaw, now a U.S. Congressman, becomes his party's candidate for Vice President after his mother, Virginia U.S. Senator Eleanor Prentiss (Meryl Streep), pressures party leaders into passing over their intended pick, U.S. Senator Tom Jordan (Jon Voight). A rivalry exists between Eleanor and Jordan, partly due to a past relationship between Shaw and Jordan's daughter Jocelyne (Vera Farmiga). That evening, Marco has a nightmare in which he is being held captive and brainwashed along with his fellow soldiers.\n\nAfter Shaw is nominated, Marco begins investigating what really happened during the war. He finds an implant in his back and, soon thereafter, one in Shaw's after a confrontation at campaign headquarters. After having the one taken from Shaw analyzed, Marco realizes that it is a nanotechnological experiment connected with Manchurian Global, a powerful private equity firm with major political connections. Marco researches Manchurian and recognizes Dr. Atticus Noyle (Simon McBurney), a former Manchurian geneticist-turned-mercenary, from one of his nightmares. Marco brings his findings to the attention of Jordan, who, although he doesn't entirely believe the story, confronts the Shaws and suggests that Raymond bow out of the campaign. Instead, Eleanor \"activates\" Raymond and orders him to kill Jordan. Jocelyne is also killed when she tries to stop an entranced Raymond.\n\nGiven the mounting evidence, the FBI begins to take Marco's allegations seriously. They arrange a meeting between Marco and Shaw to convince Shaw of his condition. However, Shaw receives a phone call from Eleanor and hands the phone to Marco. Eleanor uses trigger words to control Marco's mind, giving him commands to assassinate the President-Elect so that Shaw can become president. It happens, though, that with the trauma of Jocelyne's death, Shaw is gaining resistance to his own mind control.\n\nAt the election party, Shaw directs the President-Elect away from the standing place where Marco, wielding a sniper rifle, was supposed to shoot him. Shaw looks up at the vent where Marco is, giving him a nod of clearance to kill him. Shaw proceeds to dance with Eleanor and shift to that area purposely, which causes Marco to shoot, killing both of them with one shot. Marco prepares to kill himself with a hand-gun, but the FBI discovers and stops him. The FBI decides to protect Marco's innocence by framing a deceased Manchurian Global contractor as the shooter. In the last scene, Rose takes Marco to the compound where he was conditioned, which by now the FBI has found. Marco proceeds to drop Shaw's Medal of Honor into the sea.",
  "synopsis": null
}