{
  "imdb_id": "tt3220576",
  "tmdb_id": "274459",
  "douban_id": null,
  "title": "Passion (2013)",
  "genres": [
    "Drama"
  ],
  "country": "Japan",
  "version": [],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm1976701",
      "name": "Ryôko Yoshida"
    }
  ],
  "writer": [
    {
      "id": "nm1881988",
      "name": "Kaoruko Himeno",
      "description": "based on the novel by"
    },
    {
      "id": "nm1976701",
      "name": "Ryôko Yoshida",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm4423685",
      "name": "Yasushi Fuchikami",
      "character": ""
    },
    {
      "id": "nm1967617",
      "name": "Kanji Furutachi",
      "character": ""
    },
    {
      "id": "nm1373151",
      "name": "Kumiko Itô",
      "character": ""
    },
    {
      "id": "nm1959217",
      "name": "Mayuko Iwasa",
      "character": ""
    }
  ],
  "overview": "A singular deadpan comedy, The Passion tells a story of a young woman raised in a convent named Frances-ko (Mayuko Iwasa), after Saint Francesco. Distressed by not knowing about love and sex, she calls out for a sign from above, but instead hears a voice from below. A human-faced growth speaks to her from between her legs, constantly berating her, calling out \"Woman, you are worthless!\" Mr. Koga, as she names it, continues the verbal abuse, yet Frances-ko somehow adapts, forming an adversarial yet symbiotic relationship. This bizarre film, based on Kaoruko Himeno's acclaimed 1997 novel of the same name, is skillfully directed by Ryoko Yoshida, lensed by veteran cinematographer Akiko Ashizawa, grounded by Iwasa's show-stopping performance and enlivened by the hilarious Kanji Furutachi, who lends his voice to the chauvinistic Koga. The soundtrack boasts an unmissable eclectic score by legendary experimental musician and composer Otomo Yoshihide.",
  "storyline": "Francesco is a woman with no relatives who lives a solitary life after having grown up in a convent. One day while inspecting her genital area with a hand mirror, she notices a \"growth with a human face\".",
  "plot": "Some years ago, an Italian violin that Niccolò Paganini supposedly had used was stolen from a Beijing orchestra, smuggled overseas, but miraculously recovered a few years later by the Chinese law enforcement. Strangely, nothing about its recovery was ever printed in the press. Spurned by the police, an intrigued journalist (Pu Cunxin) tracks down Lu Yueyue (Xu Jinglei), a former policewoman who now works as a B-girl in a night club. She also refuses to speak on the case, but he proves more resilient than she expects. Finally she agrees to tell him the whole story, under the condition that he never publishes his story—unless she dies.\n\nAfter leaving China, the violin first landed in Bangkok before being sold to Poon Dai-wai (Wan Yeung-ming) in Hong Kong, who had just inherited his late father's enterprise. Poon gave the violin to Fung Sai-man (Leung Kai-chi), a senior triad boss, as a present, but when one of Fung's employees secretly brought the violin back to him, Poon hid it and denied knowledge before Fung. That night, the defector was assassinated and several of Poon's employees were shot. Poon Dai-wai decided to send his younger brother Poon Siu-wai (Liu Han-chiang) to mainland China to protect him from Fung's wrath.\n\nLu Yueyue had just begun working for the Ministry of Public Security when they received intelligence from the Hong Kong Police Force about the possible link between Poon Siu-wai and the stolen violin. To her great excitement, she was assigned to the team working on the case.",
  "synopsis": null
}