{
  "imdb_id": "tt3239442",
  "tmdb_id": "267463",
  "douban_id": null,
  "title": "The 10 Year Plan (2014)",
  "genres": [
    "Comedy",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm2133392",
      "name": "J.C. Calciano"
    }
  ],
  "writer": [
    {
      "id": "nm2133392",
      "name": "J.C. Calciano",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4791710",
      "name": "Jack Turner",
      "character": "Myles"
    },
    {
      "id": "nm2219278",
      "name": "Michael Adam Hamilton",
      "character": "Brody"
    },
    {
      "id": "nm3117202",
      "name": "Teri Reeves",
      "character": "Diane"
    },
    {
      "id": "nm2086809",
      "name": "Moronai Kanekoa",
      "character": "Richard"
    },
    {
      "id": "nm4120586",
      "name": "Adam Bucci",
      "character": "Hunter"
    },
    {
      "id": "nm0745193",
      "name": "Michael Rothhaar",
      "character": "Neighbor"
    },
    {
      "id": "nm0933281",
      "name": "Debra Wilson",
      "character": "Minister"
    },
    {
      "id": "nm4209001",
      "name": "Ben Palacios",
      "character": "Walter"
    },
    {
      "id": "nm4304211",
      "name": "Trevor Kuhn",
      "character": "Raul"
    },
    {
      "id": "nm5181589",
      "name": "Chris Sean Reid",
      "character": "David       (as Chris Reid)"
    },
    {
      "id": "nm3813358",
      "name": "Jesse Welch",
      "character": "Jesse"
    },
    {
      "id": "nm4842836",
      "name": "Cedric Jonathan",
      "character": "Cedric"
    },
    {
      "id": "nm5387679",
      "name": "Josh Wise",
      "character": "Stu"
    },
    {
      "id": "nm3297585",
      "name": "Matthew Bridges",
      "character": "Matthew"
    },
    {
      "id": "nm5497340",
      "name": "Mattias Ramos",
      "character": "Chad"
    },
    {
      "id": "nm2483745",
      "name": "Nathan Peterson",
      "character": "Kodi"
    },
    {
      "id": "nm4893653",
      "name": "Shane Young",
      "character": "Josh"
    },
    {
      "id": "nm9992777",
      "name": "Jeffrey Charbonneau",
      "character": "Kyle"
    },
    {
      "id": "nm9992778",
      "name": "Connor Howe",
      "character": "Go-Go Dancer"
    },
    {
      "id": "nm9992779",
      "name": "Pablo Hernandez",
      "character": "Go-Go Dancer"
    },
    {
      "id": "nm4548174",
      "name": "Zack Schor",
      "character": "Vance the Bartender"
    },
    {
      "id": "nm3311692",
      "name": "David John Walsh",
      "character": "Hot Waiter       (as David Walsh)"
    },
    {
      "id": "nm5804961",
      "name": "Skyler Seymour",
      "character": "Shot Boy"
    },
    {
      "id": "nm9992780",
      "name": "John C. Anderson",
      "character": "Additional Cast"
    },
    {
      "id": "nm9992781",
      "name": "Lee Anderson",
      "character": "Additional Cast"
    },
    {
      "id": "nm9992782",
      "name": "Olga Antonova",
      "character": "Additional Cast"
    },
    {
      "id": "nm7497201",
      "name": "Gretchen Beane",
      "character": "Additional Cast"
    },
    {
      "id": "nm9992783",
      "name": "Raymond Burgas",
      "character": "Additional Cast"
    },
    {
      "id": "nm5772891",
      "name": "Derrell Coakley",
      "character": "Additional Cast       (as Derrell J. Coakley)"
    },
    {
      "id": "nm9992784",
      "name": "Richard Coley",
      "character": "Additional Cast"
    },
    {
      "id": "nm4179658",
      "name": "Chad Dennis",
      "character": "Additional Cast"
    },
    {
      "id": "nm9992785",
      "name": "Paul Draper",
      "character": "Additional Cast"
    },
    {
      "id": "nm9992786",
      "name": "Michael Edwards",
      "character": "Additional Cast"
    },
    {
      "id": "nm7102670",
      "name": "Silvia Esparza-Safran",
      "character": "Additional Cast       (as Silvia Esparza)"
    },
    {
      "id": "nm9992787",
      "name": "Danny Fox",
      "character": "Additional Cast"
    },
    {
      "id": "nm9992788",
      "name": "Jazz Hiuk",
      "character": "Additional Cast"
    },
    {
      "id": "nm9992789",
      "name": "Matthew Kiel",
      "character": "Additional Cast"
    },
    {
      "id": "nm2415045",
      "name": "Gregory Leonardo",
      "character": "Additional Cast"
    },
    {
      "id": "nm9992790",
      "name": "Ana Laspetkovski",
      "character": "Additional Cast"
    },
    {
      "id": "nm2317345",
      "name": "Jeff Manabat",
      "character": "Additional Cast"
    },
    {
      "id": "nm6130407",
      "name": "Nick Marietta",
      "character": "Additional Cast       (as Nicholas Marietta)"
    },
    {
      "id": "nm4958018",
      "name": "Rose Mazzola",
      "character": "Additional Cast"
    },
    {
      "id": "nm9992791",
      "name": "Adrian Mendoza",
      "character": "Additional Cast"
    },
    {
      "id": "nm9992792",
      "name": "Matthew Moran",
      "character": "Additional Cast"
    },
    {
      "id": "nm9992793",
      "name": "Thomas Ohlson",
      "character": "Additional Cast"
    },
    {
      "id": "nm9992794",
      "name": "Ashley Pierce",
      "character": "Additional Cast"
    },
    {
      "id": "nm0709040",
      "name": "Meghan Ramsey",
      "character": "Additional Cast"
    },
    {
      "id": "nm9992795",
      "name": "Evan Schmitt",
      "character": "Additional Cast"
    },
    {
      "id": "nm9992796",
      "name": "Andrew Scully",
      "character": "Additional Cast"
    },
    {
      "id": "nm9992797",
      "name": "James Singleton",
      "character": "Additional Cast"
    },
    {
      "id": "nm0836883",
      "name": "John Suazo",
      "character": "Additional Cast"
    }
  ],
  "overview": "Myles (Jack Turner) and Brody (Michael Adam Hamilton) are best friends with two very different ways of finding love. Displeased with their current love lives, they make a pact to be together, if neither finds love in ten year’s time. Now two month’s shy of their deadline, both friend’s set off to do whatever it takes to avoid ending up as each other’s last resort.",
  "storyline": "Meet Myles and Brody, best friends and total opposites. Myles is a hopeless romantic looking for Mr. Right. Brody is a sexy player on the hunt for Mr. Right Now. These two friends make a plan that they'll be together if both of them are still single in a decade. Nearly ten years later and still alone, both friends will do whatever it takes to avoid becoming a couple.",
  "plot": "Sometime in the 21st century, a series of crop blights on Earth threatens humanity's survival. Joseph Cooper, a widowed former NASA pilot, runs a farm with his father-in-law, son Tom, and daughter Murphy, who believes her bedroom is haunted by a poltergeist. Living in a post-truth society (Cooper is reprimanded at school for telling Murphy that the Apollo missions did indeed happen), Cooper encourages Murphy to carefully observe and record what she sees. They realize that a pattern of dust on the floor is created by gravity variations and are able to decode it as a set of geographic coordinates.\n\nCooper and Murphy follow them to a secret facility, where Cooper's former professor, Dr. Brand, continues to operate NASA in secrecy after it was officially defunded. Brand reveals that a wormhole which appeared near Saturn opens a pathway to a distant galaxy with potentially habitable planets. Twelve volunteers traveled through it, each assessing a planet's suitability as humanity's new home. Volunteers Miller, Edmunds and Mann have sent back encouraging data from planets near a black hole called Gargantua. Brand recruits Cooper to pilot the spaceship Endurance, carrying 5,000 frozen embryos for a \"Plan B\": to colonize a habitable planet to ensure humanity's survival. The only option for the majority of mankind to survive is his continued work on a \"Plan A\" – a gravitational theory for propulsion that would allow a mass exodus from Earth. Cooper agrees to go, upsetting Murphy who feels abandoned.\n\nCooper's crew consists of scientists Romilly, Doyle, Brand's daughter Amelia, and robots TARS and CASE. Traversing the wormhole, they use a lander to investigate Miller's planet, where time is severely dilated (one hour equals seven years on Earth). Finding only wreckage from the expedition, Amelia retrieves Miller's data just before a gigantic tidal wave hits, killing Doyle and water-logging the engines. After returning to Endurance, they discover that 23 years have elapsed on Earth.\n\nMurphy, now an adult scientist, has been assisting Dr. Brand with his research. On his deathbed, he admits to her that he never considered Plan A feasible; Plan B was the only plan. In a recorded video session Murphy notifies Amelia of her father's death, accusing her and Cooper of abandoning Earth. However, believing the equations can be solved, she continues working on a solution to Plan A, knowing she needs more data on gravitational singularities.\n\nWith limited fuel, the crew chooses Mann's planet over Edmunds' as the next stop, since Mann is still transmitting. Mann assures the crew that the frozen planet is habitable despite its ammonia-laden atmosphere. However, he soon attempts to kill Cooper, revealing that he falsified data in the hope of being rescued. Stealing Cooper's lander, he heads for Endurance while Romilly is killed by a booby trap set by Mann. Amelia rescues Cooper and they race to Endurance in a second lander. Mann attempts a dangerous manual docking operation and is killed in the attempt, severely damaging the Endurance in the process. Cooper uses the lander to stabilize the ship.\n\nCASE warns Cooper that Endurance is slipping toward Gargantua's pull. Cooper decides to use Gargantua as a gravitational slingshot to propel the ship toward Edmunds' planet. To shed weight, Cooper and TARS jettison themselves toward the black hole, so that Amelia and CASE can complete \"Plan B\". Slipping past the event horizon, Cooper and TARS find themselves inside a tesseract, which resembles a stream of bookshelves capable of peering into Murphy's bedroom at different periods in her life. Cooper surmises that the tesseract and wormhole were created to enable communication with Murphy, and that he was her \"ghost\" all along. Using the second-hand on the watch he gave her before he left, Cooper relays the quantum data Murphy needs to solve the gravitational equation.\n\nFollowing a turbulent ejection, Cooper awakens in a space habitat orbiting Saturn. He reunites with an aged Murphy, who is nearing death. At Murphy's request, Cooper and TARS leave to rejoin Amelia on Edmunds' habitable planet, where she is preparing a new human colony.",
  "synopsis": null
}