{
  "imdb_id": "tt3205376",
  "tmdb_id": "223485",
  "douban_id": "25731554",
  "title": "Slow West (2015)",
  "genres": [
    "Adventure",
    "Western"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.9,
  "director": [
    {
      "id": "nm3304468",
      "name": "John Maclean"
    }
  ],
  "writer": [
    {
      "id": "nm3304468",
      "name": "John Maclean",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm2240346",
      "name": "Kodi Smit-McPhee",
      "character": "Jay Cavendish"
    },
    {
      "id": "nm3308569",
      "name": "Caren Pistorius",
      "character": "Rose Ross"
    },
    {
      "id": "nm7324744",
      "name": "Aorere Paki",
      "character": "Young Native Boy"
    },
    {
      "id": "nm0859005",
      "name": "Jeffrey Thomas",
      "character": "Union Officer"
    },
    {
      "id": "nm3743063",
      "name": "Hayden Frost",
      "character": "Young Soldier 1"
    },
    {
      "id": "nm5864629",
      "name": "Kieran Charnock",
      "character": "Young Soldier 2"
    },
    {
      "id": "nm1055413",
      "name": "Michael Fassbender",
      "character": "Silas Selleck"
    },
    {
      "id": "nm7324745",
      "name": "Joseph Passi",
      "character": "Congolese Singer 1"
    },
    {
      "id": "nm2236672",
      "name": "Sam Manzanza",
      "character": "Congolese Singer 2"
    },
    {
      "id": "nm4476708",
      "name": "Tawanda Manyimo",
      "character": "Congolese Singer 3"
    },
    {
      "id": "nm5686344",
      "name": "David T. Lim",
      "character": "Tattoo Man       (as David Lim)"
    },
    {
      "id": "nm4916177",
      "name": "Bryan Michael Mills",
      "character": "The Minstrel       (as Bryan Mills)"
    },
    {
      "id": "nm0759819",
      "name": "Madeleine Sami",
      "character": "Marimacho"
    },
    {
      "id": "nm0132426",
      "name": "Eddie Campbell",
      "character": "Skelly"
    },
    {
      "id": "nm0578853",
      "name": "Ben Mendelsohn",
      "character": "Payne"
    },
    {
      "id": "nm2390032",
      "name": "Michael Whalley",
      "character": "The Kid"
    },
    {
      "id": "nm7324747",
      "name": "Jon Cummings",
      "character": "Gull"
    },
    {
      "id": "nm0785082",
      "name": "Brian Sergent",
      "character": "Payote Joe"
    },
    {
      "id": "nm1249752",
      "name": "Edwin Wright",
      "character": "Victor the Hawk"
    },
    {
      "id": "nm0085612",
      "name": "Ken Blackburn",
      "character": "Josh McKenzie"
    },
    {
      "id": "nm1526335",
      "name": "Karl Willetts",
      "character": "Johan"
    },
    {
      "id": "nm2010527",
      "name": "Brooke Williams",
      "character": "Maria"
    },
    {
      "id": "nm6110484",
      "name": "Evie Simon",
      "character": "Eva Swedish Girl"
    },
    {
      "id": "nm6143989",
      "name": "George Simon",
      "character": "Jan Swedish Boy"
    },
    {
      "id": "nm0564920",
      "name": "Rory McCann",
      "character": "John Ross"
    },
    {
      "id": "nm3516668",
      "name": "Stuart Martin",
      "character": "Callum"
    },
    {
      "id": "nm7324748",
      "name": "James Martin",
      "character": "Willie Leven"
    },
    {
      "id": "nm7324749",
      "name": "Tony Croft",
      "character": "Angus the Clergyman"
    },
    {
      "id": "nm7324750",
      "name": "Marian Leven",
      "character": "Crofter Woman 1"
    },
    {
      "id": "nm7324751",
      "name": "Margaret Starling",
      "character": "Crofter Woman 2"
    },
    {
      "id": "nm1930572",
      "name": "Kevin MacLeod",
      "character": "Musician 1"
    },
    {
      "id": "nm7324753",
      "name": "Will Maclean",
      "character": "Musician 2"
    },
    {
      "id": "nm7324752",
      "name": "Ali Beag Macleod",
      "character": "Musician 3"
    },
    {
      "id": "nm0266012",
      "name": "Kern Falconer",
      "character": "Donald"
    },
    {
      "id": "nm0101400",
      "name": "Stuart Bowman",
      "character": "Gordon Shaw"
    },
    {
      "id": "nm1276507",
      "name": "Alex Macqueen",
      "character": "Rupert Cavendish"
    },
    {
      "id": "nm0574173",
      "name": "Andy McPhee",
      "character": "Burly Man 1"
    },
    {
      "id": "nm7324754",
      "name": "David Maclean",
      "character": "Burly Man 2"
    },
    {
      "id": "nm0083079",
      "name": "Andrew Robertt",
      "character": "Werner"
    },
    {
      "id": "nm3635264",
      "name": "Aaron McGregor",
      "character": "Bill Allson"
    },
    {
      "id": "nm0703398",
      "name": "Kalani Queypo",
      "character": "Kotori"
    }
  ],
  "overview": "In the Old West, a 17-year-old Scottish boy teams up with a mysterious gunman to find the woman with whom he is infatuated.",
  "storyline": "'Slow West' follows a 16-year-old boy on a journey across 19th Century frontier America in search of the woman he loves, while accompanied by mysterious traveler Silas.",
  "plot": "Jay Cavendish, a young Scottish man, travels to the American West to search for his love, Rose Ross. He encounters a group of men chasing a Native American; a bounty hunter, Silas Selleck, arrives and kills the leader. Jay employs the bounty hunter for protection.\n\nAt a trading post, unbeknownst to Jay, Silas sees a wanted poster offering a $2,000 bounty for Rose and her father. He plans to use Jay to get to the bounty. Another bounty hunter, Victor the Hawk, also takes notice of the poster. In the trading post, a Swedish couple attempt a robbery which results in the death of the owner and the man. Jay intervenes and shoots the woman. Silas and Jay gather provisions and leave, abandoning the couple's children outside.\n\nIn the past, in Scotland, Rose is aware of Jay's affection, but only cares for him as a \"little brother\". Jay's uncle Lord Cavendish is accidentally killed by John Ross, Rose's father, in an argument; Rose and her father leave for America with the bounty on their heads.\n\nIn the present, Jay abandons Silas and proceeds alone, thinking him a \"brute\". He meets a travelling writer, Werner, who offers to accompany Jay. When Jay wakes the next morning, Werner has left, stealing his horse and equipment. Silas tracks down Jay with his stolen belongings, saying he ran into Werner while looking for Jay.\n\nThe pair meet Payne, the leader of Silas's old gang, which has taken in the Swedish children. Payne gives them absinthe in a failed attempt to gather information about Rose and her father's whereabouts. While they are asleep, Silas and Jay share a dream of Silas and Rose living together with a child. They awaken to find that Payne has stolen their weapons. Silas discloses the bounty to Jay. They lose Payne's gang in a forest, where Jay is injured by Native Americans.\n\nRose and her father live in a nearby prairie, protected by a Native American called Kotori. Victor, disguised as a priest, tracks them down and kills Rose's father. After reaching the prairie, Silas ties Jay to a tree to keep him from harm's way. Silas rushes to the house to warn Rose of Payne's gang but is wounded by Victor. Payne and his men kill Victor and assault the house.\n\nJay frees himself and runs to the house. After Kotori and most of Payne's gang are killed, Rose realizes she has shot Jay in the confusion. While she comforts him, Payne enters the house and Jay shoots him as he dies. Silas tells Rose that Jay loved her \"with all his heart\". Silas stays with Rose and the Swedish children.",
  "synopsis": "Jay Cavendish (Kodi Smit-McPhee) is a young man from Scotland traveling through the United States in search of his love, Rose Ross (Caren Pistorius). On his journey, he comes by the woods near a Native American camp where a group of union officers are chasing after a Native American. Two run off and chase the man, and gunshots are heard. A bandit named Silas Selleck (Michael Fassbender) shows up with a gun aimed at the one officer. Jay holds his gun up to Silas, but Silas still shoots the officer. He and Jay then join forces and travel together.Through some flashbacks, we see Jay and Rose spending time together back in Scotland, rolling down a hill near a beach. He was very much in love with her, while she only saw him as a brother, something that troubled him.Jay and Silas ride through a field where three Congolese men are playing a song about love. Jay tells one of the men that he likes the song, and he notes that \"love is universal like death\". Following closeby are a group of bounty hunters, led by Payne (Ben Mendelsohn). The two ride by a shop where Silas sees a wanted poster for both Rose and her father John (Rory McCann), offering a $2,000 reward if they're caught dead. Everybody but Jay knows about it. The two enter the shop to gather some items. After them enters a Swedish couple, Johan and Maria (Karl Willetts and Brooke Williams). Johan raises his gun to the shopkeeper, demanding money even though the shopkeeper insists that this shop would be the only place he could spend money. The shopkeeper shoots Johan in the chest, and Maria shoots the shopkeeper dead. She aims at Silas, also demanding money. Jay shoots her in the back. He and Silas leave with their items until they see two children, Eva and Jan (Evie and George Simon). Figuring he just killed their mother, Jay leave the children with his items.In another flashback, right after Rose tells Jay that he is like her brother, she tells him to hide under the bed. He stays there for hours as John has company over. Jay's uncle Rupert (Alex MacQueen) shows up and tries taking Jay back, dismissing everyone in the house as peasants. Jay says he is with Rose now. Rupert slaps Rose, prompting John to retaliate by shoving Rupert backwards and causing him to smash his head against a rock, killing him. This leads to John and Rose becoming outlaws.Shortly after the incident, Jay makes it to the U.S. and encounters a clergyman named Angus (Tony Croft). He says he is documenting the downfall of the Aboriginal tribe and hoping to spread Christianity. Jay asks Angus for advice. The next morning, Jay wakes up alone to nothing but an egg resting on a note that says \"West\". He then breaks the egg open and lets the yolk fall out.Jay and Silas bond as the latter guides the boy to his destination. Silas shaves Jay's face with his knife while Jay tells Silas that he is a lonely man. Payne walks out from behind a tree with a bottle and some glasses. He joins the two at their camp site, and he asks Jay knowingly if he is traveling to find his sweetheart. At night, Silas and Payne discuss the bounty on John and Rose, with Payne trying to get a word out of Silas after getting him drunk. Silas was part of Payne's gang, but he left after deciding that he is not like Payne. Silas knows nothing and wouldn't tell Payne anything if he did.When Jay wakes up, he sees Silas and Payne are both gone. He comes across Payne's group, who have Eva and Jan with them. Jay sits with them around the fire as one of the bounty hunters tells a story about a man he killed.Jay finds Silas in the woods. Silas tries to get him to stop his pursuit of Rose, but Jay insists that she is his. They fall asleep and wake up to the pouring rain, almost submerging them and their items. They dry off in the morning and see more bounty hunters. This forces Silas to come clean to Jay about the bounty on Rose and her father.We see John and Rose living in a cabin, miles from anywhere else. They have a Native American helper, Kotori (Kalani Queypo). A man visits them, knowing who Rose is, leading her to get worried, but John insists that nobody there knows who they are.Silas ties Jay to a tree to prevent him from going to save Rose. He rides toward their house, just as Payne and his gang do. They initiate a shootout, with John being the first one killed. Rose stands her ground to defend herself against the hail of bullets. Silas shows up, not wanting to kill Rose. He gets hit in the shoulder and leg, but he remains alive. Jay breaks himself free from the tree and runs to the house. Without warning, he enters and startles Rose, causing her to shoot him in the chest. She continues to defend herself, while Kotori rushes to her side to help her. At one point, a bullet hits a jar of salt and causes it to spill on Jay's bullet wound. The bounty hunters, and even Kotori, are killed, until Payne is the only one left. Rose walks over to Jay's side, unaware until now that she just killed him. She gives him her gun to shoot Payne as he enters the house. Silas then comes in as Jay dies. He tells Rose that Jay loved her. She says his heart was in the wrong place. Silas says his spirit wasn't.Later on, Rose appears to adopt Eva and Jan. Silas continues living, never forgetting Jay or what he stood for."
}