{
  "imdb_id": "tt3242418",
  "tmdb_id": "299710",
  "douban_id": null,
  "title": "Being 14 (2015)",
  "genres": [
    "Drama"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "86 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.6,
  "director": [
    {
      "id": "nm3509272",
      "name": "Hélène Zimmer"
    }
  ],
  "writer": [
    {
      "id": "nm3509272",
      "name": "Hélène Zimmer",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm5998777",
      "name": "Athalia Routier",
      "character": "Sarah"
    },
    {
      "id": "nm1863193",
      "name": "Galatéa Bellugi",
      "character": "Jade"
    },
    {
      "id": "nm5998778",
      "name": "Najaa Bensaid",
      "character": "Louise"
    },
    {
      "id": "nm7146166",
      "name": "Kevin Château",
      "character": "Anthony"
    },
    {
      "id": "nm7146167",
      "name": "Louis Jacq",
      "character": "Roméo"
    },
    {
      "id": "nm6954654",
      "name": "Yassine Douighi",
      "character": "Sofiane"
    },
    {
      "id": "nm3152112",
      "name": "Azzedine Bouabba",
      "character": "Hakim"
    },
    {
      "id": "nm4746483",
      "name": "Sam Greep",
      "character": "Lauren"
    },
    {
      "id": "nm7146168",
      "name": "Antoine Coissac",
      "character": "Hugo"
    },
    {
      "id": "nm7146169",
      "name": "Camille Garcette",
      "character": "Ryan"
    },
    {
      "id": "nm3148169",
      "name": "Oliver Cywie",
      "character": "Igor"
    },
    {
      "id": "nm5626268",
      "name": "Eva Gonsalves",
      "character": "Léa       (as Eva Goncalves)"
    },
    {
      "id": "nm7146170",
      "name": "Eva Ranaivo",
      "character": "Clémence"
    },
    {
      "id": "nm7146171",
      "name": "Sofiane El Ouali",
      "character": "Reza"
    },
    {
      "id": "nm7146172",
      "name": "Alfred Shimimana Shema",
      "character": "Vivien"
    },
    {
      "id": "nm5427443",
      "name": "Louca Acerbo",
      "character": "Garçon première fois Sarah"
    },
    {
      "id": "nm0238506",
      "name": "Dinara Drukarova",
      "character": "La mère de Sarah       (as Dinara Droukarova)"
    },
    {
      "id": "nm0522151",
      "name": "Olivier Loustau",
      "character": "Le beau-père de Sarah"
    },
    {
      "id": "nm0161046",
      "name": "Delphine Chuillot",
      "character": "La mère de Jade"
    },
    {
      "id": "nm0190211",
      "name": "Olivier Cruveiller",
      "character": "Le père de Jade"
    },
    {
      "id": "nm0495950",
      "name": "Françoise Lebrun",
      "character": "La grand-mère de Jade"
    },
    {
      "id": "nm0517974",
      "name": "Anne Loiret",
      "character": "La mère de Louise"
    },
    {
      "id": "nm0405907",
      "name": "Stéphane Höhn",
      "character": "Le beau-père de Louise"
    },
    {
      "id": "nm0146119",
      "name": "Aude Cathelin",
      "character": ""
    }
  ],
  "overview": "The lives and turbulent adventures of a bunch of fourteen-year-old teenagers, through the eyes of three young girls - Sarah, Jade and Louise - with one last year to go before high school.",
  "storyline": "Sarah, Jade and Louise meet for a final year at college. Between euphoria, rivalries, revolts and seduction, they face the torment of adolescence to find their place.",
  "plot": "In the months before the US 2004 presidential election, Mary Mapes (producer of the primetime news program 60 Minutes Wednesday) and her crew consisting of Mike Smith (Grace), Lucy Scott (Moss), and Colonel Roger Charles (Quaid) are seeking evidence to verify whether or not George W. Bush received any preferential treatment during his time in the military. Charles, knowing that the military \"is good at what they do\", believes that there were no mistakes or errors despite some claims that Bush's records were lost, that the records were altered, and that Bush had difficulty meeting minimal physical aptitude testing. Seeking any and all leads, Mapes and her crew eventually find Bill Burkett who tells them that he has hard evidence in the form of memos and letters dictating that Bush did indeed have preferential treatment. Eventually, Mapes writes a story which Dan Rather reports upon in an edition of 60 Minutes.\n\nAfter the airing, Mapes and Rather face accuracy questions on the segment. The core documents on which these allegations were based were immediately called into question by a variety of sources with some indicating the documents being forgeries first appeared on a blog, which was then investigated and amplified by various talk radio hosts, bloggers and numerous mainstream media sources, including The Washington Post and CBS itself. They easily found that certain characteristics of the memos, such as its font and letter spacing, indicated the memos were created on a computer using Microsoft Word, and therefore could not have been typed on a typewriter in the early 1970s. Subsequently, Burkett who produced the documents admitted that he had lied about where he had obtained them.\n\nAfter the scandal in which Mapes, her crew, and Rather are faced with charges of using Mapes' liberal political agenda for the segment. One by one they are forced to face an internal review panel to determine whether or not political bias was used in the report. Smith, Scott, and Charles go into it, but are eventually banned from their work and subsequently fired with Smith going on a rant in the office before being escorted out. Rather faces the music and decides that after the hearing, he will retire from broadcasting along with Mapes. While Mapes faces the board, she comes under heavy fire about her agenda for the segment. Mapes stands up for herself and presents her evidence for her side. After the hearing, Mapes is fired and Rather makes his last broadcast, citing how courage helped him and his crew get through the toughest of times.",
  "synopsis": null
}