{
  "imdb_id": "tt3280486",
  "tmdb_id": "296529",
  "douban_id": null,
  "title": "The Grandad (2014)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "Iceland",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm1557914",
      "name": "Bjarni Thorsson"
    }
  ],
  "writer": [
    {
      "id": "nm0251033",
      "name": "Ólafur Egilsson",
      "description": null
    },
    {
      "id": "nm1557914",
      "name": "Bjarni Thorsson",
      "description": "\"based on his play\""
    }
  ],
  "cast": [
    {
      "id": "nm0045489",
      "name": "Þorsteinn Bachmann",
      "character": "Eiríkur"
    },
    {
      "id": "nm1904539",
      "name": "Sigrún Edda Björnsdóttir",
      "character": "Erla"
    },
    {
      "id": "nm0797610",
      "name": "Sigurður Sigurjónsson",
      "character": "Guðjón"
    },
    {
      "id": "nm1196163",
      "name": "Ingibjörg Reynisdóttir",
      "character": "Guðbjörg"
    },
    {
      "id": "nm0315191",
      "name": "Pálmi Gestsson",
      "character": "Lárus"
    },
    {
      "id": "nm2621096",
      "name": "Steinþór Hróar Steinþórsson",
      "character": "Nökkvi"
    },
    {
      "id": "nm3027764",
      "name": "Birgitta Sigursteinsdóttir",
      "character": "Coworker (2014)"
    },
    {
      "id": "nm8104993",
      "name": "Ester Sveinbjarnardóttir",
      "character": "Vinnufélagi á bar"
    },
    {
      "id": "nm7763300",
      "name": "Tinna Sverrisdóttir",
      "character": "Magga"
    }
  ],
  "overview": "Gudjón has led a safe life. Suddenly faced with retirement and growing older, he is forced to take a good, hard look at his marriage. A dramatic but often lighthearted story about life at a crossroads and the meaning of it all.",
  "storyline": "Guðjón has led a safe life. Suddenly he is faced with retirement, getting older and is forced to take a hard look at his marriage. Dramatic but often hilarious story about crossroads and the meaning of it all.",
  "plot": "This article's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (April 2016) (Learn how and when to remove this template message)\nJason Kelly attends his grandmother's funeral, where he reunites with his grandfather, Army veteran Dick, who is now widowed after 40 years of marriage. Jason and Dick were once very close, but have since drifted apart, mainly due to Jason's new job as a corporate attorney, where he works with his father David. After the funeral, Dick personally requests that Jason drive him from his home in Georgia to Boca Raton, Florida. Jason is uncomfortable with the situation, as is his uptight and controlling fiancee Meredith Goldstein, but reluctantly agrees to do so.\n\nThe next day, Jason walks in on Dick playing music records and masturbating to pornography. Officially beginning their journey, Dick chides Jason for giving up his dream of becoming a photographer and traveling the world, but Jason insists he is happy in his current position. While stopping at a diner, the duo encounter Shadia, a former classmate of Jason's from his photography class when he attended The University of Georgia, as well as her friends Lenore: who needs to finish her trifecta (sleep with a freshman, an alumnus and a professor) and Bradley. Dick introduces himself as a college professor and Jason as a photographer for Time magazine, leaving out his family connections. Lenore, who wants to sleep with Dick, invites the duo to join them in their quest to Daytona Beach, where they are headed for spring break, but Jason insists they should carry on to Boca.\n\nAfterwards, Jason and Dick hit the golf course, where Dick flirts with women while denying his relationship with Jason. Jason is shocked that his grandfather would flirt with women the day after his wife's funeral, but Dick proclaims it is okay because he was never unfaithful to his wife during forty years of marriage. Claiming he has not had sex for fifteen years because of his wife's cancer and that she insisted he \"get back out there\". Hearing Dick's plea, Jason reluctantly agrees to go to Daytona.\n\nUpon their arrival in Daytona, Jason and Dick meet up with Shadia and Lenore on the beach, where they also meet the girls' boyfriends Cody and Brah, both of whom Dick takes an immediate disliking to. Dick laces his own drink with Xanax, but Jason accidentally drinks it while competing in a drinking game. While partying with the girls, Dick witnesses, and records, Jason, wearing nothing but a hornet fanny pack, partying while highly intoxicated, and smoking crack from a local shop owner/drug dealer Pam. Jason later steals a motorcycle and drives off.\n\nJason awakens the next day on the beach, where he endures an awkward FaceTime conversation with Meredith and his family. He is later approached by a young boy who wants to touch the hornet fanny pack, but is caught by the boy's furious father, who believes Jason is a pedophile. Jason winds up in jail over the incident, but Dick posts his bail. Furious with Dick over the previous night's events, Jason tries to drop him off with his old war buddy Stinky, but Dick is heartbroken to see his friend stuck in a wheelchair in a retirement home. Stinky's dire situation helps Dick convince Jason that they need to go back to Daytona.\n\nReturning to Daytona, the duo reunite with Shadia and Lenore at a beach party hosted by Pam. They soon enter a \"flex-off\" against Cody and Brah, winning over the crowd with a wild stunt that they used to do when Jason was a child. However, Jason forces them to flee, as the crowd is recording the event on their phones, and Jason does not want to be caught on film. With Cody and Brah winning the flex-off by default, Dick alters a T-shirt cannon to fire a beer can at the winning duo, hospitalizing them. Dick reveals to Jason that he was part of a Special Forces group in the Army, rather than just a mechanic. With Cody and Brah in the hospital, Jason and Dick take their hotel room. That night, the duo go to a popular nightclub with Shadia, Lenore, and Bradley. Seeing a gang pick on Bradley for his homosexuality, Dick single-handedly takes down the gang, who vows revenge. Despite the chaos, Dick admits he is proud of Jason, who agrees to give Dick some private time so Dick can sleep with Lenore.\n\nThe next day, Jason spends some private time with Shadia, who reveals her own intentions to travel the world, and is leaving shortly after the trip. They nearly share a kiss, but are interrupted by a call from Bradley, who reveals that Dick and Lenore have been kidnapped by the gang from the club. They track them down to a motel, where Dick's charming demeanor has won over the gang, and they all go to a karaoke bar to celebrate. As Jason and Shadia serenade the crowd with a love song, Cody, released from the hospital, sneaks into Dick's jacket and finds a valid driver's license. After they return to the hotel, Jason and Dick share a heartfelt conversation, where Jason reveals he will call off his wedding, and plans to reveal the truth to Shadia, much to Dick's horror as he has not slept with Lenore yet. However, Cody and Brah, using Dick's driver's license to look them up, have already revealed the ruse to the girls (though Lenore seems unfazed by the news) and also reveal to Shadia that Jason is engaged, thanks to a wedding announcement seen online. A heartbroken Shadia tells Jason to never talk to her again, and Jason is soon arrested again, for carrying drugs. Dick bails Jason out again, but a furious Jason demands that Dick stay away from him, driving back to Georgia alone. Dick soon mails Jason a new camera and an inappropriate needlepoint Stinky made.\n\nAt Jason and Meredith's wedding rehearsal dinner, a slide show featuring romantic photos of the couple is hacked by Dick, who inserts inappropriate photos from their Daytona trip. Viewing the photos, Jason realizes he cannot go through with the wedding and calls off his engagement, to which Meredith reacts indifferently, as she slept with Jason's cousin Nick while he was gone and she herself was not really happy in the relationship either. Jason then reunites with Dick, who has enlisted Pam's help in stopping Shadia's bus to admit his true feelings for her. During a wild car chase, in which they are joined by David and chased by cops, eventually Jason is able to reunite with Shadia, and offers to join her in her photography trip around the world. She agrees and they reconcile. With Jason cleared of his legal offense with the help of both his father and Pam, Jason shares a heartfelt farewell with Dick.\n\nAfterwards, Dick is driven to a retirement community in Boca, where he reconciles with his son. Upon his arrival to his room, Dick finds Lenore waiting for him.\n\nIn a mid-credits scene, Dick and Lenore are married and have selected Jason and Shadia to be their new infant son's godparents.",
  "synopsis": null
}