{
  "imdb_id": "tt3289712",
  "tmdb_id": "342474",
  "douban_id": null,
  "title": "Jenny's Wedding (2015)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.5,
  "director": [
    {
      "id": "nm0232858",
      "name": "Mary Agnes Donoghue"
    }
  ],
  "writer": [
    {
      "id": "nm0232858",
      "name": "Mary Agnes Donoghue",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0001337",
      "name": "Katherine Heigl",
      "character": "Jenny"
    },
    {
      "id": "nm0929489",
      "name": "Tom Wilkinson",
      "character": "Eddie"
    },
    {
      "id": "nm0256599",
      "name": "Linda Emond",
      "character": "Rose"
    },
    {
      "id": "nm3501146",
      "name": "Grace Gummer",
      "character": "Anne"
    },
    {
      "id": "nm0088127",
      "name": "Alexis Bledel",
      "character": "Kitty"
    },
    {
      "id": "nm0573481",
      "name": "Sam McMurray",
      "character": "Denny"
    },
    {
      "id": "nm0362051",
      "name": "Diana Hardcastle",
      "character": "Ellen"
    },
    {
      "id": "nm1711663",
      "name": "Matthew Metzger",
      "character": "Michael"
    },
    {
      "id": "nm1625732",
      "name": "Houston Rhines",
      "character": "Frankie"
    },
    {
      "id": "nm1851958",
      "name": "Cathleen O'Malley",
      "character": "Lorraine"
    },
    {
      "id": "nm2089320",
      "name": "Ed Ackerman",
      "character": "Fireman #1"
    },
    {
      "id": "nm1826889",
      "name": "Bill Watterson",
      "character": "Fireman #2"
    },
    {
      "id": "nm2728365",
      "name": "Joshua Elijah Reese",
      "character": "Fireman #3"
    },
    {
      "id": "nm7486287",
      "name": "Betsie Devan",
      "character": "Barbara Ellen"
    },
    {
      "id": "nm0565152",
      "name": "Hollis McCarthy",
      "character": "Marion"
    },
    {
      "id": "nm2277058",
      "name": "Ann Hagemann",
      "character": "Saleswoman"
    },
    {
      "id": "nm6476052",
      "name": "Alex Wake",
      "character": "Aaron"
    },
    {
      "id": "nm2182042",
      "name": "Greg Violand",
      "character": "Priest"
    },
    {
      "id": "nm0862946",
      "name": "Seamus Tierney",
      "character": "Tommy"
    },
    {
      "id": "nm6523795",
      "name": "Sarah Kinsey",
      "character": "Godmother       (as Sarah Ann Kinsey)"
    },
    {
      "id": "nm6082236",
      "name": "Matt O'Shea",
      "character": "Godfather #1"
    },
    {
      "id": "nm3343582",
      "name": "Tom Kondilas",
      "character": "Godfather #2"
    },
    {
      "id": "nm7486289",
      "name": "Kenya Gest",
      "character": "Margaret"
    },
    {
      "id": "nm7486290",
      "name": "Jerome Harris Jr.",
      "character": "DJ at Wedding"
    },
    {
      "id": "nm7486291",
      "name": "John Donoghue",
      "character": "Minister"
    },
    {
      "id": "nm7486292",
      "name": "Hildy 'McGillicuddy' Johnson",
      "character": "Mickey the Dog"
    },
    {
      "id": "nm4036022",
      "name": "Justine Greenwald",
      "character": "Salesperson"
    }
  ],
  "overview": "Jenny Farrell is getting married. But how will her straight-laced family react when they find out that the woman they thought was their daughter’s roommate is actually her fiancée? As the old-fashioned Farrells attempt to come to terms with the prospect of a surprise daughter-in-law, they face a difficult choice: either adapt with the times or risk being left behind.",
  "storyline": "Jenny Farrell has led an openly gay life - except with her conventional family. When she finally decides to start a family and marry the woman they thought was just her roommate, the small, safe world the Farrells inhabited changes forever. They are left with a simple and difficult choice - either change with it or drown.",
  "plot": "Jenny (Katherine Heigl) will get married to Kitty (Alexis Bledel), but her family does not know her sexuality. Her parents, Eddie (Tom Wilkinson) and Rose (Linda Emond), have always dreamed of the day their middle daughter get married and are overjoyed when they find out that she is engaged, but not to whom they expected as she plans to wed a woman. Jenny has the support of her older brother, Michael (Matthew Metzger), but has to deal with the prejudice of parents and the conflicts with her younger sister, Anne (Grace Gummer), who always felt rejected and less loved by the family.",
  "synopsis": "The first scene is of a baptism of two babies with Jenny holding one of the babies. Her parents in the audience are discussing the fact that Jenny's running out of time to find a husband and the fact that Jenny feels guilty about something but they don't know what. Later, we see the family at the parent's house. Jenny arrives at the house and her brother forcibly introduces her to a man called Tommy. Tommy says he has to leave but offers to call her some time which she agrees to. As Jenny leaves, her brother tells Tommy not to bother calling her as she won't call back. When Jenny goes into the kitchen she gets into an argument with her sister who tells her she needs to find someone and Jenny tells her that for all they know she could already be in a relationship. Her sister then assumes that Jenny is in a relationship with a married man as she has never brought the person home and tells her mom stating that Jenny has always been jealous of her life as she's married with kids. Later we see Jenny talking to her father in the garage. Her father asks her to not tell anyone that he is smoking to which she answers that she's never told on him. She admits that she does want to be married and that she is seeing someone. She says that she has found the right person but when her dad asks her \"when's the wedding?\" she answers \"I don't know\". Her mother, in the dining room, calls Jenny over and Jenny clarifies that she is not with a married man. After they reconcile Jenny hugs her mom.\nThat night, her mom and dad are in bed and her dad tells her that he thinks the man he's seeing is not willing to commit to her and that that must be the issue. They talk about how secretive Jenny has become."
}