{
  "imdb_id": "tt3231010",
  "tmdb_id": "240704",
  "douban_id": null,
  "title": "Island of Lemurs: Madagascar (2014)",
  "genres": [
    "Documentary",
    "Short",
    "Adventure",
    "Biography",
    "Family"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "39 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.0,
  "director": [
    {
      "id": "nm0235010",
      "name": "David Douglas"
    }
  ],
  "writer": [
    {
      "id": "nm4187702",
      "name": "Drew Fellman",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0000151",
      "name": "Morgan Freeman",
      "character": "Narrator       (voice)"
    },
    {
      "id": "nm6397457",
      "name": "Hantanirina Rasamimanana",
      "character": "Herself"
    },
    {
      "id": "nm0942697",
      "name": "Patricia Wright",
      "character": "Herself"
    }
  ],
  "overview": "Academy Award winner Morgan Freeman (“Million Dollar Baby”) narrates the documentary about the incredible true story of nature’s greatest explorers—lemurs. Captured with IMAX 3D cameras, “Island of Lemurs: Madagascar” takes audiences on a spectacular journey to the remote and wondrous world of Madagascar. Lemurs arrived there as castaways millions of years ago and evolved into hundreds of diverse species but are now highly endangered. Join trailblazing scientist Patricia Wright on her lifelong mission to help these strange and adorable creatures survive in the modern world",
  "storyline": "Academy Award winner Morgan Freeman narrates Island of Lemurs: Madagascar, the incredible true story of nature's greatest explorers - lemurs. Captured with IMAX 3D cameras, the film takes audiences on a spectacular journey to the remote and wondrous world of Madagascar. Lemurs arrived in Madagascar as castaways millions of years ago and evolved into hundreds of diverse species but are now highly endangered. Join trailblazing scientist Patricia Wright on her lifelong mission to help these strange and adorable creatures survive in the modern world. Directed by David Douglas and written and produced by Drew Fellman, Island of Lemurs: Madagascar is a presentation of Warner Bros. Pictures and IMAX Entertainment.",
  "plot": "The film takes place on Madagascar, and focuses on lemurs. The film also highlights Dr. Patricia C. Wright's efforts on her mission to help lemurs survive in the modern world. The film also focuses on the endangered levels of lemur species, who are losing their populations due to agricultural fires.",
  "synopsis": null
}