{
  "imdb_id": "tt3202392",
  "tmdb_id": "277230",
  "douban_id": null,
  "title": "La liste de mes envies (2014)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.4,
  "director": [
    {
      "id": "nm0494558",
      "name": "Didier Le Pêcheur"
    }
  ],
  "writer": [
    {
      "id": "nm0216081",
      "name": "Grégoire Delacourt",
      "description": "novel"
    },
    {
      "id": "nm5959062",
      "name": "Delphine Labouret",
      "description": "screenplay adaptation dialogue"
    },
    {
      "id": "nm0494558",
      "name": "Didier Le Pêcheur",
      "description": "screenplay adaptation dialogue"
    }
  ],
  "cast": [
    {
      "id": "nm0782565",
      "name": "Mathilde Seigner",
      "character": "Jocelyne Guerbette"
    },
    {
      "id": "nm0492200",
      "name": "Marc Lavoine",
      "character": "Jo Guerbette"
    },
    {
      "id": "nm1720035",
      "name": "Virginie Hocq",
      "character": "Danielle 1"
    },
    {
      "id": "nm1078628",
      "name": "Frédérique Bel",
      "character": "Danielle 2"
    },
    {
      "id": "nm0156228",
      "name": "Patrick Chesnais",
      "character": "Le père de Jocelyne"
    },
    {
      "id": "nm3424655",
      "name": "Tiphaine Haas",
      "character": "Nadine Guerbette"
    },
    {
      "id": "nm0092362",
      "name": "Julien Boisselier",
      "character": "Jean-Luc"
    },
    {
      "id": "nm0904273",
      "name": "Michel Vuillermoz",
      "character": "Le curé       (as Michel Vuillermoz de la Comédie Française)"
    },
    {
      "id": "nm0714229",
      "name": "Cécile Rebboah",
      "character": "Mado"
    },
    {
      "id": "nm0501845",
      "name": "Raphaël Lenglet",
      "character": "Hervé Meunier"
    },
    {
      "id": "nm1922676",
      "name": "Julie Ferrier",
      "character": "La psychologue Européenne des Jeux"
    },
    {
      "id": "nm1959043",
      "name": "Nathalie Blanc",
      "character": "La journaliste"
    },
    {
      "id": "nm5085213",
      "name": "Laurent Delay",
      "character": "Romain"
    },
    {
      "id": "nm0255693",
      "name": "Pascal Elso",
      "character": "Alain"
    },
    {
      "id": "nm1343817",
      "name": "Nicolas Woirion",
      "character": "L'homme de la plage"
    },
    {
      "id": "nm1817264",
      "name": "Anne Girouard",
      "character": "Hôtesse Européenne des Jeux"
    },
    {
      "id": "nm1057100",
      "name": "France Darry",
      "character": "Luciette Viguier"
    },
    {
      "id": "nm0281002",
      "name": "Valérie Flan",
      "character": "La boulangère"
    },
    {
      "id": "nm1707785",
      "name": "François-David Cardonnel",
      "character": "Ludo"
    },
    {
      "id": "nm3237026",
      "name": "Guillaume Gallo-Manrique",
      "character": "L'agent immobilier"
    },
    {
      "id": "nm6380001",
      "name": "Martine Martos",
      "character": "Nadine 8 ans"
    },
    {
      "id": "nm6380002",
      "name": "Loup-Angel Haberlick",
      "character": "Romain 10 ans       (as Lou Angel Haberlinck)"
    },
    {
      "id": "nm6197055",
      "name": "Jacques Herlin",
      "character": "Le maire"
    },
    {
      "id": "nm6380003",
      "name": "Juliette Nass",
      "character": "Ouvrière usine frigos"
    },
    {
      "id": "nm3365927",
      "name": "Eric Beauchamps",
      "character": "Le banquier       (as Eric Beauchamp)"
    },
    {
      "id": "nm4368123",
      "name": "Victoria Quesnel",
      "character": "La mère de Jocelyne"
    },
    {
      "id": "nm3620299",
      "name": "Emmanuel Rausenberger",
      "character": "Client discothèque"
    },
    {
      "id": "nm5565981",
      "name": "Anne-Christelle Roussel",
      "character": "Actrice Feux de l'amour"
    },
    {
      "id": "nm4275324",
      "name": "Eléa Clair",
      "character": "Présentatrice TV Loterie"
    },
    {
      "id": "nm6380004",
      "name": "Cloé Deriemont",
      "character": "Jocelyne enfant"
    },
    {
      "id": "nm5109911",
      "name": "Louise Molinaro",
      "character": ""
    }
  ],
  "overview": "When the little haberdasher Arras discovers she's won 18 million in the lottery and can now afford anything she wants, she has only one fear: losing the small joys of life made simple it cherishes above all. But fate is obstinate, and this is giving too long this good fortune will trigger it, despite herself, a hurricane that will change everything. Everything except her.",
  "storyline": "When Jocelyne, a seamstress in the northern French town of Arras, finds out she's won ï¿½ï¿½ï¿½18 million on the lottery and that she can now have anything she wants, she only has one fear: losing her modest way of life made up of simple pleasures that she cherishes more than anything. But fate can be obstinate, and by renouncing this fortune for too long, she triggers a hurricane that changes everything. Everything except her.",
  "plot": "Remy is an idealistic and ambitious young rat, gifted with highly developed senses of taste and smell. Inspired by his idol, the recently deceased chef Auguste Gusteau, Remy dreams of becoming a cook himself. When an old French woman discovers Remy's colony in her house and attempts to exterminate them, they are forced to flee, and Remy becomes separated from his family in the panic. He ends up in the sewers of Paris and eventually finds himself at a skylight overlooking the kitchen of Gusteau's restaurant.\n\nAs Remy watches through the window, a young man named Alfredo Linguini is hired as a garbage boy by Skinner, the restaurant's devious current owner and Gusteau's former sous-chef. When Linguini spills a pot of soup and attempts to recreate it, Remy recognizes that he is ruining it instead, and repairs Linguini's mistakes. Linguini catches Remy but hides him when he is then confronted by Skinner for tampering with the soup. As the two argue, the soup is accidentally served and proves to be a success. Colette Tatou, the staff's only female chef, convinces Skinner to retain Linguini, who is assumed to be the soup's creator. When Skinner catches Remy trying to escape, he orders Linguini to kill the rat, but Linguini discovers Remy's intelligence and decides to keep him instead.\nRemy discovers that he can control Linguini's movements by pulling his hair.\nOn Linguini's first day as a chef, he and Remy find a way to communicate: Remy guides Linguini like a marionette by pulling on his hair while hidden under Linguini's toque, while Skinner assigns Colette to train his new cook.\n\nSuspicious, Skinner learns that the boy is Gusteau's illegitimate son and the rightful heir to the restaurant, which jeopardizes Skinner's control of the restaurant and the lucrative packaged food enterprise he formed using the restaurant's reputation after Gusteau's death. Remy discovers the evidence of Linguini's inheritance and, after eluding Skinner, gives it to Linguini, who deposes Skinner as owner. The restaurant continues to thrive, and Linguini and Colette develop a budding romance, leaving Remy feeling left out. Remy finds that his clan has come to Paris as well, and is taken to their new lair, but despite his father Django's attempts to rid his son of his admiration of humans, Remy leaves.\n\nFrance's top restaurant critic, Anton Ego, whose previous negative review cost Gusteau's one of its stars, announces he will be re-reviewing the restaurant the following evening. After a disagreement with Linguini, Remy leads his clan to raid the restaurant's pantries in retaliation, but Linguini catches them and throws them out. Having now discovered Remy's skills, Skinner captures him in an attempt to use him to create a new line of frozen foods. However, Remy is freed by his brother Emile and Django. He returns to the restaurant, only to find Linguini is unable to cook without him. Linguini apologizes and reveals the truth to the staff, but they leave in disbelief. Colette later returns after recalling Gusteau's motto, \"Anyone can cook.\"\n\nDjango arrives with the rest of the clan, offering to help after seeing his son's determination. Remy has the rats cook, while Linguini waits tables. For Ego and Skinner, Remy and Colette create a variation of ratatouille, which reminds an astonished Ego of his mother's cooking. During the meal, the rats are forced to tie up Skinner and a health inspector to prevent them from revealing their involvement in the cooking. When Ego requests to see the chef, Linguini and Colette make him wait until the rest of the diners have left before introducing Remy. Ego is stunned and leaves the restaurant, deep in thought. He writes a positive and thoughtful review for the newspaper the next day, stating that Gusteau's chef (Remy) is \"nothing less than the finest chef in France.\"\n\nDespite the positive review, Gusteau's is shut down, since Linguini and Remy had to release Skinner and the health inspector. Ego loses credibility as a critic but funds a popular new bistro, \"La Ratatouille\", created and run by Remy, Linguini, and Colette; Ego frequents the bistro for Remy's cooking. The rats settle into their new home in the bistro's roof.",
  "synopsis": null
}