{
  "imdb_id": "tt3250070",
  "tmdb_id": "182154",
  "douban_id": null,
  "title": "Dead Body Welcome (2013)",
  "genres": [
    "Drama"
  ],
  "country": "Netherlands",
  "version": [
    {
      "runtime": "73 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm1498638",
      "name": "Kees Brienen"
    }
  ],
  "writer": [
    {
      "id": "nm3527893",
      "name": "Desiree Duwel",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm1498638",
      "name": "Kees Brienen",
      "character": "Himself"
    }
  ],
  "overview": "‘DEAD BODY WELCOME’ is based on a true story about the journey filmmaker Kees Brienen undertook to see the phenomenon of the total solar eclipse. Upon arrival in India he finds out his best friend Ritchy had passed away. The trip suddenly becomes a search for a dead body, trying to understand and accept what had happened to him. Kees finds his friend up in the mountains, does what he needs to do, discovering new perspectives on love, life and death.",
  "storyline": "DEAD BODY WELCOME is based on a true story about the journey filmmaker Kees Brienen undertook to see the phenomenon of the total solar eclipse. Upon arrival in India he finds out his best friend Ritchy had passed away. The trip suddenly becomes a search for a dead body, trying to understand and accept what had happened to him. Kees finds his friend up in the mountains, does what he needs to do, discovering new perspectives on friendship.",
  "plot": "Distraught after losing his fortune in the 2008 financial crisis, stockbroker Jeffrey Desange kills his business partners and estranged wife before taking his children, three-year-old Victoria and one-year-old Lilly, away from home. Driving dangerously fast on a snowy road, Jeffrey loses control and the car slides down the mountain, ramming into the woods. Surviving, he takes the children into an abandoned cabin. Planning to kill his daughters and commit suicide, he holds a gun to Victoria's head, but a shadowy figure kills him. The girls, huddled by the fireside, are tossed a cherry by the mysterious figure.\n\nFive years later, a rescue party, sponsored by Jeffrey's identical twin brother Lucas, finds Victoria and Lilly alive, but in a feral state after years of isolation. The girls are put in a welfare clinic under the psychiatric care of Dr. Gerald Dreyfuss. They make reference to \"Mama\", a maternal protector figure. The girls are initially hostile to Lucas but Victoria recognizes him after he gives her a pair of glasses and she can see him properly. Dreyfuss agrees to support Lucas and his girlfriend Annabel's custody claim against the girls' maternal great-aunt, Jean Podolski. Victoria acclimates quickly to domestic life while Lilly retains much of her feralness (language regression, growling, laying on the floor), not being used to being around people.\n\nWhile in bed with Lucas, Annabel is startled by the appearance of a monstrous figure. Lucas is attacked by \"Mama\" and is put into a coma. Annabel, who is uncomfortable being around the girls, finds herself left alone to care for them. Although Annabel makes progress with Victoria, she finds Lilly hostile. Alarmed by nightmares of a woman and Victoria's warning about Mama's jealousy, Annabel asks Dreyfuss to investigate. He initially thought \"Mama\" to be an imaginary alter-ego of Victoria; however, his research corroborates Victoria's story that Mama is an aggrieved mother and brings to light the story of Edith Brennan, a mental asylum patient in the 1800s.\n\nDreyfuss recovers a box from a government warehouse containing a baby's remains. Annabel has a nightmare revealing Mama's past: when Edith Brennan (\"Mama\") was sent to St. Gertrude's Asylum for an unknown reason, her child was taken from her and given to nuns. She escaped the asylum, stabbed a nun and took her baby back. Fleeing her pursuers, Brennan jumped off a cliff, but before hitting the water below, Brennan and the child made impact with a large branch and she drowned; Edith's child's corpse snagged on the branch and did not fall with Brennan into the water. Annabel realizes that Mama still hasn't realized her child died from hitting the tree; Mama unsuccessfully searched the woods for more than a century and had taken on Victoria and Lilly as substitutes.\n\nLucas regains consciousness after a vision of his dead brother, Jeffrey, tells him to save his daughters. Victoria's growing closeness to Annabel makes her less willing to play with Mama, unlike Lilly. Dreyfuss visits the cabin and is killed by Mama. Annabel and the girls are attacked by a jealous Mama, who kills Jean and uses her body to scare the children away in Jean's car. Annabel and Lucas find the children on the same cliff where Brennan leaped with her child to their deaths over a century earlier. Mama is preparing to re-enact her fall with Victoria and Lilly.\n\nWhen Annabel offers Mama the remains of her child, Mama transforms into her human form and sobs at the baby's death. However, when Lilly (remembering only Mama as her original parent, since she was abandoned in the woods for most of her life) calls out for her, Mama reverts to her monstrous form and takes the girls again, nearly killing Annabel and Lucas, but refraining mainly because Victoria cares about them and does not want them hurt. Annabel clings to Victoria, who asks to stay with Annabel instead of leaving with Mama, which Mama accepts. After a tearful farewell, Mama and Lilly fall off the cliff, turning into a shower of moths when they hit the branch. Annabel and Lucas embrace Victoria, and Victoria notices a bright blue moth landing on her hand, indicating that Lilly is still with her in some form.",
  "synopsis": null
}