{
  "imdb_id": "tt3236120",
  "tmdb_id": "310121",
  "douban_id": null,
  "title": "I'll See You in My Dreams (2015)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "92 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.7,
  "director": [
    {
      "id": "nm1417640",
      "name": "Brett Haley"
    }
  ],
  "writer": [
    {
      "id": "nm5303256",
      "name": "Marc Basch",
      "description": null
    },
    {
      "id": "nm1417640",
      "name": "Brett Haley",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0001100",
      "name": "Blythe Danner",
      "character": "Carol Petersen"
    },
    {
      "id": "nm0820053",
      "name": "June Squibb",
      "character": "Georgina"
    },
    {
      "id": "nm0674231",
      "name": "Rhea Perlman",
      "character": "Sally"
    },
    {
      "id": "nm0005316",
      "name": "Mary Kay Place",
      "character": "Rona"
    },
    {
      "id": "nm1865834",
      "name": "Aarti Mann",
      "character": "Dr. DaSilva"
    },
    {
      "id": "nm0771414",
      "name": "Martin Starr",
      "character": "Lloyd"
    },
    {
      "id": "nm0010486",
      "name": "Mark Adair-Rios",
      "character": "Exterminator"
    },
    {
      "id": "nm3332017",
      "name": "Ashley Spillers",
      "character": "Vitamin Store Clerk"
    },
    {
      "id": "nm0000385",
      "name": "Sam Elliott",
      "character": "Bill"
    },
    {
      "id": "nm0481222",
      "name": "Caroline Lagerfelt",
      "character": "Leslie"
    },
    {
      "id": "nm0301178",
      "name": "Max Gail",
      "character": "Carl"
    },
    {
      "id": "nm0730838",
      "name": "Arthur Roberts",
      "character": "Speed Dater 1"
    },
    {
      "id": "nm0134199",
      "name": "Harold Cannon",
      "character": "Speed Dater 2       (as Harold Cannon-Lopez)"
    },
    {
      "id": "nm0689269",
      "name": "Vic Polizos",
      "character": "Speed Dater 3"
    },
    {
      "id": "nm0945194",
      "name": "Michael Yama",
      "character": "Speed Dater 4"
    },
    {
      "id": "nm1378594",
      "name": "Kevin Wheatley",
      "character": "Bartender"
    },
    {
      "id": "nm3820180",
      "name": "Shoniqua Shandai",
      "character": "Checkout Girl"
    },
    {
      "id": "nm1169428",
      "name": "Reid Scott",
      "character": "Officer Shumaker"
    },
    {
      "id": "nm0015196",
      "name": "Malin Akerman",
      "character": "Katherine Petersen"
    },
    {
      "id": "nm1147128",
      "name": "Jocelyn Ayanna",
      "character": "Nurse"
    },
    {
      "id": "nm3723968",
      "name": "Linda Lee McBride",
      "character": "Female Bartender"
    },
    {
      "id": "nm0006970",
      "name": "Patricia Belcher",
      "character": "Shelter Worker"
    },
    {
      "id": "nm7319973",
      "name": "Brownie",
      "character": "Hazel the Dog"
    },
    {
      "id": "nm4253536",
      "name": "Oscar",
      "character": "Beenie the Dog"
    }
  ],
  "overview": "A sudden loss disrupts Carol’s orderly life, propelling her into the dating world for the first time in 20 years. Finally living in the present tense, she finds herself swept up in not one, but two unexpected relationships that challenge her assumptions about what it means to grow old.",
  "storyline": "In this vibrant, funny, and heartfelt film, a widow and former songstress discover that life can begin anew at any age. With the support of three loyal girlfriends (June Squibb, Rhea Perlman, and Mary Kay Place), Carol (Blythe Danner) decides to embrace the world, embarking on an unlikely friendship with her pool maintenance man (Martin Starr), pursuing a new love interest (Sam Elliott), and reconnecting with her daughter (Malin Akerman).",
  "plot": "Widow and former songstress Carol Petersen lives alone in California with her dog, Hazel. Her life is very routine, especially since she has not had a serious relationship in the twenty years since her husband has died and has no desire to begin dating or marrying again. She has no grandchildren, and her only daughter Katherine living in a different state. One day she is forced to put the elderly dog down, leaving her without her main companion outside of her friends Georgina, Rona, and Sally. After coming home from the appointment, she finds a large rat in her house, which leads her to sleep outside for the night, at which point she meets her new pool boy, Lloyd. Though Lloyd initially offends her by implying that she seemed dead, the two begin an unlikely friendship after Lloyd asks to meet with her as friends.\n\nWhile looking for medicine, Carol meets Bill, who flirts with her before leaving; she is clearly intrigued by him. Later, her friends convince her to go to a speed dating session for senior citizens. Though Carol is uninterested by the men she meets, she later encounters Bill in the parking lot, and he asks her for her number so that he can call her for a date. Carol goes home and calls Lloyd to go to karaoke. Though Lloyd is a mediocre singer, Carol impresses him with her singing ability. They go back to her house, and they discuss \"living in the moment,\" which concerns Lloyd but is something that Carol dismisses. Lloyd reveals that he's not looking forward to anything in his life, and that he feels he has no real prospects outside of the responsibility he feels for his ailing mother.\n\nThe next day, Carol gets a message from her daughter Katherine, who hasn't visited in a while but decided to buy a ticket to visit. She also gets a message from Bill, who wants to set up a date. She meets with him and he impulsively takes her out on his boat, something, he says, he has never done for anyone else. The two quickly connect. Bill tells her that he is originally from Texas, but decided to move to California and buy a boat on a whim, as he did not want to be the sort of retiree who fell into boring, stagnated routines. After dinner, Bill drives her home, and they share a kiss; Bill says that he wants to see her again. Carol is giddy, until she sees the rat again.\n\nCarol begins to open herself up to being more adventurous again, and she and her friends get high, steal a grocery cart after shopping, and evade a curious policeman. When she gets home, she has messages from Katherine, reminding her about her visit, and Bill, wanting to set up another date. After the date, she invites Bill to her home and the two have sex. Carol and Bill grow even closer together, and Bill insinuates that he may want to marry her despite the fact that they've only had a couple of dates. The next morning, Carol gets a visit from Lloyd, who tells her that he quit his job, though he did get a job as a pool cleaner at another business. He then leaves awkwardly after meeting Bill.\n\nBill wants to see Carol again, but she tells him that she has to spend time with Katherine; he says that he'd like to meet her daughter someday, and Carol agrees. They part ways affectionately. Katherine arrives, and notes that Carol is different, in a good way: she seems more open, positive, and thoughtful. Carol tells her that she is seeing someone, which makes Katherine happy, and Katherine insists that she wants to meet him. However, Carol finds frantic messages from Rona on her answering machine; Bill is in the hospital for an unknown condition.\n\nSince only immediate family can see him, Carol is unable to be admitted, though the nurse promises that she will get a call about his condition. Sadly, she soon gets a call that he has died, and grieves that he has died while she was falling for him, and that she never got to say goodbye. She asks Katherine why people bother getting attached when death is inevitable, a sentiment she expressed to Lloyd earlier; Katherine points out all the good things that happened because of Carol taking chances and risks; she led a full life, and still has good times to look forward to. Afterwards, Carol grieves privately, passing Bill's old boat and spending time with her friends, to whom she reveals that she kept a possession of Bill's: his cigar that he always carried around.\n\nLloyd comes to visit Carol in his new uniform. The rat appears again and he manages to trap it, and afterwards Carol finally breaks down in tears over losing Bill. Lloyd comforts her and plays for her a poignant song that he wrote, \"I'll See You in My Dreams.\" Later, Carol meets with her friends, and Sally insists that they should all go on a cruise together. Though the other friends are reluctant at first, Carol impulsively agrees, leading the others to join in. The movie ends with Carol adopting an elderly dog and driving home with him, getting a new companion.",
  "synopsis": "The film begins with Carol (Blythe Danner) waking-up in a bed which used to hold two people. Now her only bedmate is her elderly dog. Soon she is the only one occupying the bed. When she sees a rat in her house, she sleeps outside by the pool. The next morning Lloyd the pool guy (Martin Starr) wakes her. They form a bond and he takes her out Karaokeing - a new adventure. Soon Carol is back spending her day, like all days, playing cards with her friends: other elderly women living in a nearby retirement village. She meets Bill (Sam Elliott) a widower who dates her thereby continuing to open her up to life. Carol's grown daughter comes to visit, learns about her mother's new adventures and is excited that her mother is beginning to live again. Bill dies before he and Carol can re-start life, this time with each other. But Lloyd re-enters her life, captures the rat and Carol sees that both of them need to move on and live for the future. If Carol was a teenager this would be a 'coming-of-age' film. But Carol is a widow in her 60's so it's a 'coming-to-terms-with-life' film. At the film's end, Carol gets a rescue dog to replace her earlier dog and moves on with life."
}