{
  "imdb_id": "tt3210282",
  "tmdb_id": "340753",
  "douban_id": null,
  "title": "Sunset Edge (2015)",
  "genres": [
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "87 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.5,
  "director": [
    {
      "id": "nm1942664",
      "name": "Daniel Peddle"
    }
  ],
  "writer": [
    {
      "id": "nm1942664",
      "name": "Daniel Peddle",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm5968253",
      "name": "William Dickerson",
      "character": "Will"
    },
    {
      "id": "nm2548303",
      "name": "Andy Foltz",
      "character": "Killer"
    },
    {
      "id": "nm5968254",
      "name": "Liliane Gillenwater",
      "character": "Dora May Moon"
    },
    {
      "id": "nm5968248",
      "name": "Jack Horn",
      "character": "Pa"
    },
    {
      "id": "nm5968249",
      "name": "Jacob Kristian Ingle",
      "character": "Jacob"
    },
    {
      "id": "nm5968251",
      "name": "Haley Ann McKnight",
      "character": "Haley"
    },
    {
      "id": "nm5968252",
      "name": "Gilberto Padilla",
      "character": "Malachi"
    },
    {
      "id": "nm5968250",
      "name": "Blaine Edward Pugh",
      "character": "Blaine"
    }
  ],
  "overview": "Two narratives clash violently in this meditative portrayal of disaffected youth set in a graveyard of abandoned mobile homes known as Sunset Edge. We follow a group of four aimless, suburban teenagers - they skateboard the park, sleep in the sun, and rummage through the decaying remains completely unaware that this is where a lonesome teen is confronting a horrific past. Day turns to night, people disappear, and the secrets of Sunset Edge are revealed in a paralyzing finale.",
  "storyline": "Two narratives clash violently in this meditative portrayal of disaffected youth set in a graveyard of abandoned mobile homes known as Sunset Edge. We follow a group of four aimless, suburban teenagers - they skateboard the park, sleep in the sun, and rummage through the decaying remains completely unaware that this is where a lonesome teen is confronting a horrific past. Day turns to night, people disappear, and the secrets of Sunset Edge are revealed in a paralyzing finale. Sunset Edge shines as a mesmerizing indie Southern Gothic tale loaded with suspense and lush visuals. Using sparse dialog and techniques culled from his previous two feature documentaries, Daniel Peddle's debut work of fiction is a haunting coming-of-age story that will have viewers holding their breath!",
  "plot": "The film tells the story of an Aberdeenshire farm girl Chris Guthrie (Agyness Deyn) as she searches for her independence against the odds, in an epic rites of passage story set just before the First World War. The film features Peter Mullan and Kevin Guthrie, and was shot in New Zealand, Luxembourg and Scotland. It was produced by Iris Productions, SellOut Pictures and Hurricane Films and backed by BFI, Creative Scotland, BBC Scotland and Luxembourg Film Fund.",
  "synopsis": null
}