{
  "imdb_id": "tt3235888",
  "tmdb_id": "270303",
  "douban_id": null,
  "title": "It Follows (2014)",
  "genres": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "100 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.9,
  "director": [
    {
      "id": "nm1379002",
      "name": "David Robert Mitchell"
    }
  ],
  "writer": [
    {
      "id": "nm1379002",
      "name": "David Robert Mitchell",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm6092492",
      "name": "Bailey Spry",
      "character": "Annie"
    },
    {
      "id": "nm5085895",
      "name": "Carollette Phillips",
      "character": "Woman with Groceries"
    },
    {
      "id": "nm3257024",
      "name": "Loren Bass",
      "character": "Annie's Father"
    },
    {
      "id": "nm1507857",
      "name": "Keir Gilchrist",
      "character": "Paul"
    },
    {
      "id": "nm2140860",
      "name": "Maika Monroe",
      "character": "Jay Height"
    },
    {
      "id": "nm2714273",
      "name": "Lili Sepe",
      "character": "Kelly Height"
    },
    {
      "id": "nm7180491",
      "name": "Charles Gertner",
      "character": "Neighbor Boy"
    },
    {
      "id": "nm6011302",
      "name": "Debbie Williams",
      "character": "Mrs. Height       (as Deborah Williams)"
    },
    {
      "id": "nm3459140",
      "name": "Olivia Luccardi",
      "character": "Yara"
    },
    {
      "id": "nm1621032",
      "name": "Jake Weary",
      "character": "Hugh /              Jeff"
    },
    {
      "id": "nm4683167",
      "name": "Daniel Zovatto",
      "character": "Greg Hannigan"
    },
    {
      "id": "nm3697376",
      "name": "Ruby Harris",
      "character": "Mrs. Redmond"
    },
    {
      "id": "nm3712833",
      "name": "Leisa Pulido",
      "character": "Mrs. Hannigan"
    },
    {
      "id": "nm7180492",
      "name": "D.J. Oliver",
      "character": "Police Officer       (as DJ Oliver)"
    },
    {
      "id": "nm2359829",
      "name": "Linda Boston",
      "character": "Teacher       (as Linda B. Boston-Gilbert)"
    },
    {
      "id": "nm5715518",
      "name": "Ingrid Mortimer",
      "character": "Old Woman in Pajamas"
    },
    {
      "id": "nm4758195",
      "name": "Kourtney Bell",
      "character": "Chatting Girl"
    },
    {
      "id": "nm7180493",
      "name": "Alexyss Spradlin",
      "character": "Girl in Kitchen"
    },
    {
      "id": "nm7180494",
      "name": "Mike Lanier",
      "character": "Giant Man"
    },
    {
      "id": "nm3248880",
      "name": "Claire Sloma",
      "character": "Greg's Date (Pretty Girl in Car)"
    },
    {
      "id": "nm2570703",
      "name": "Scott Norman",
      "character": "Homeless Man Behind Tree"
    },
    {
      "id": "nm7180496",
      "name": "Erin Stone",
      "character": "High School Girl in Courtyard"
    },
    {
      "id": "nm3940961",
      "name": "Joanna Bronson",
      "character": "Nurse"
    },
    {
      "id": "nm7180497",
      "name": "Don Hails",
      "character": "Old Naked Man"
    },
    {
      "id": "nm2364777",
      "name": "Ele Bardha",
      "character": "Mr. Height"
    }
  ],
  "overview": "For 19-year-old Jay, fall should be about school, boys and weekends out at the lake. But a seemingly innocent physical encounter turns sour and gives her the inescapable sense that someone, or something, is following her. Faced with this burden, Jay and her teenage friends must find a way to escape the horror that seems to be only a few steps behind.",
  "storyline": "For nineteen-year-old Jay, Autumn should be about school, boys and week-ends out at the lake. But after a seemingly innocent sexual encounter, she finds herself plagued by strange visions and the inescapable sense that someone, something, is following her. Faced with this burden, Jay and her friends must find a way to escape the horrors, that seem to be only a few steps behind.",
  "plot": "Michigan college student Jaime \"Jay\" Height sees a film with her new boyfriend, Hugh. In the theater, Hugh points out a girl whom Jay says she cannot see. Afraid, he asks that they leave. On another date, Hugh and Jay have sex in his car and he incapacitates her with chloroform. She wakes up tied to a wheelchair. Hugh explains that she will be pursued by an entity that only she can see, which can take the appearance of any person. Although it only moves at a walking pace, it will always know where she is and will be constantly approaching, and if it catches Jay, it will kill her and pursue the previous person to have passed it on: Hugh. After they see a naked woman walking toward them, Hugh drives Jay home and flees.\n\nThe next day, the police cannot find the woman or Hugh, who was living under a false identity. At school, Jay sees an old woman in a hospital gown walking towards her, invisible to others. Jay's younger sister Kelly and her friends Paul and Yara agree to help and spend the night in the same house. Paul investigates a smashed kitchen window but sees no one; Jay sees a bloodied half-naked woman walking toward her. Jay runs upstairs to the others, who cannot see the entity. When a tall man with gouged-out eyes enters the bedroom, Jay flees the house.\n\nWith the help of their neighbor, Greg, the group discovers Hugh's real name, Jeff Redmond, and trace him to his address. Jeff explains that the entity began pursuing him after a one-night stand, and that Jay can pass it to someone else in the same way. The group drives to Greg's lake house, where Jay learns to fire a gun. The entity, taking multiple guises, attacks Jay on the lakefront. She shoots it but it recovers. Jay flees in Greg's car but crashes into a cornfield, and wakes up in a hospital with a broken arm.\n\nGreg sleeps with Jay, as he does not believe the entity exists. Days later, Jay sees the entity in the form of Greg. It then smashes the window to his house and enters. She tries to warn the real Greg on the telephone but he does not answer. She runs into the house and finds the entity in the form of Greg's half-naked mother knocking on his door; it jumps on Greg and kills him. Jay flees by car and spends the night outdoors. On a beach, Jay sees three young men on a boat. She undresses and walks into the water. Back home, Jay refuses Paul's offer of sex.\n\nThe group plans to kill the entity by luring it into a university swimming pool and plunging electrical devices into the water. Jay, waiting in the pool, spots the entity and realizes it has taken the appearance of her father as it throws the devices at her. Firing at an invisible target, Paul accidentally wounds Yara, but shoots the entity in the head, causing it to fall into the pool. As it pulls Jay's foot underwater, Paul shoots it again and Jay escapes. Paul asks Jay if the entity is dead. Jay approaches the pool, which slowly fills with blood.\n\nJay and Paul have sex. Afterwards, Paul drives past prostitutes in a seedy part of town. Later, Jay and Paul walk down the street holding hands while someone walks behind them.",
  "synopsis": "In the opening scene, a young woman is fleeing from someone or something. She is shown driving to the beach. At the beach, she calls her father and tells him that she's sorry for being so unkind to him. In the morning, it is shown that she was brutally murdered during the night. Her leg is twisted and a bone is seen sticking out of it.The film then switches to Jay (Maika Monroe) who is on a date with Hugh (Jake Weary) at the movies. While they are waiting in line, Hugh starts talking about how envious he is of young children and how they have innocent, carefree lives. When they are inside the theater, Hugh spots a young woman at the entrance. He points her out to Jay, but she, however, cannot see her. Suddenly, Hugh starts getting afraid and demands to Jay that they leave the theater.On their next date, Jay and Hugh are having sex in his car, when he suddenly chloroforms her. When Jay awakens, she is tied up in a wheelchair. Hugh is there and he explains to her that when they had sex, he passed on a curse to her. This curse is an entity that can only be seen by the person with the curse (which is now Jay). The entity can take the form of any person and will follow her repeatedly at a walking pace. If IT catches her, it will kill her and will go after the previous person who had the curse (which would now be Hugh) to get them to pass the curse on to someone else.It is implied that Hugh had slept with the young woman from the beginning of the film, but since IT caught her, IT is continuing to stalk Hugh until he passes the curse on to someone else, hence why he slept with Jay.At that moment, Hugh spots a naked woman walking towards them. Jay and Hugh then flee. Hugh drops Jay off at home and continues to flee. The police are searching for Hugh, but are unable to find him.While at school, Jay spots an old woman in a hospital gown walking towards her. Everyone around does not appear to notice to the old woman. Jay's friend, Paul (Keir Gilchrist), who has a crush on Jay, and her sister Kelly (Lili Sepe) agree to help.That night, Jay, Paul, Kelly and another friend, Yara (Olivia Luccardi), all agree to spend the night in the same house. During the night, Paul hears a noise and examines a smashed window in the kitchen. He looks around, but does not see anyone. Jay then sees an almost naked woman with dark eyes walking towards her.She runs to tell the others, but none of them can see anything. Suddenly, a tall man with dark eyes walks into the room. Jay then runs out of the house.Jay runs to a playground nearby, where her friends eventually catch up to her. A neighbor named Greg (Daniel Zovatto) offers to help the group by giving them a ride. Jay and her friends plan to confront Hugh, so after tracking him down by figuring out his real address, he insists on his original story, telling Jay that she needs to sleep with someone in order to successfully pass the curse on to someone else.The group then goes back to Greg's house. Jay deduces that she needs to learn how to use a gun. While the group is sitting by the water, the entity takes on the appearance of Yara and begins to attack Jay. Jay flees and then IT takes the appearance of the tall old man and then Paul. Jay manages to shoot IT, but it does not die. Jay gets into a car and drives away, but she only manages to crash into a cornfield.When Jay awakens, she is in the hospital being treated for her broken arm. Before she is released, Jay decides to pass the curse on to someone else. She sleeps with Greg in her hospital bed in hopes of successfully passing the curse on to him. Paul is heartbroken after finding out that Jay was with Greg.At home, Jay looks out the window to see Greg walking down the street to his house. When he gets to his window, he breaks it and enters. Jay then figures out that IT has taken the appearance of Greg. Jay runs over to the house and peeks inside to see IT taking on the appearance of Greg's mom. Jay then tries to warn Greg, who is on the telephone. IT jumps on top of Greg and kills him. Now, the curse has reverted back to Jay, who flees to the woods.When she awakens in the morning, Jay is near a beach and spots three young men on a boat. She undresses and goes into the water, hoping that she can sleep with one of the men and can pass on the curse to buy herself more time.Back at home, Paul wants to sleep with Jay, but she rebuffs him, since she does not want him to be killed. Jay spots IT, posing as a naked man, spying on her from the roof. Jay then comes up with a plan to kill IT.The group goes to a deserted swimming pool in hopes of luring IT into the water and then electrocuting it. Jay is the bait and gets into the pool. When she finally spots IT, it has taken on the appearance of her father. But, IT has figured out the plan and starts throwing electrical devices into the water to kill Jay. Since they cannot see IT, the others fire blindly to try to kill it. In the ensuing chaos, Paul accidentally wounds Yara, but then shoots IT in the head, supposedly killing the entity.After heading home, Paul and Jay finally have sex. Paul then drives to a run-down part of Detroit where there are prostitutes walking the street. (The implication seems to be that the Paul plans to have sex with a hooker in order to quickly pass the curse to someone else...)Sometime later, Jay and Paul are walking down the street hand-in-hand. Behind them, a person is following them.THE END."
}