{
  "imdb_id": "tt3263548",
  "tmdb_id": "324345",
  "douban_id": null,
  "title": "The Seventh Fire (2015)",
  "genres": [
    "Documentary",
    "Drama",
    "Family"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "76 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.7,
  "director": [
    {
      "id": "nm0725652",
      "name": "Jack Pettibone Riccobono"
    }
  ],
  "writer": [
    {
      "id": "nm0725652",
      "name": "Jack Pettibone Riccobono",
      "description": null
    },
    {
      "id": "nm2629339",
      "name": "Shane Slattery-Quintanilla",
      "description": null
    },
    {
      "id": "nm1783737",
      "name": "Andrew Ford",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm7445956",
      "name": "Robert Duane Brown",
      "character": "Himself"
    },
    {
      "id": "nm7445957",
      "name": "Kevin Fineday Jr.",
      "character": "Himself"
    },
    {
      "id": "nm10796406",
      "name": "Albino Garcia",
      "character": "Himself       (archive footage)"
    }
  ],
  "overview": "When Rob Brown, a Native American gang leader on a remote Minnesota reservation, is sentenced to prison for a fifth time, he must confront his role in bringing violent drug culture into his beloved Ojibwe community. As Rob reckons with his past, his seventeen-year-old protégé, Kevin, dreams of the future - becoming the biggest drug dealer on the reservation.",
  "storyline": "When Rob Brown, a Native American gang leader on a remote Minnesota reservation, is sentenced to prison for a fifth time, he must confront his role in bringing violent drug culture into his beloved Ojibwe community. As Rob reckons with his past, his seventeen-year-old protégé, Kevin, dreams of the future - becoming the biggest drug dealer on the reservation. Terrence Malick presents this haunting and visually arresting nonfiction film about the gang crisis in Indian Country.",
  "plot": "A few mysterious disappearances happen in Fort Worth, Texas. The sister of one the victims hires a cop to investigate her disappearance. The young woman (Tamara Hext) and the cop (Tom Campitelli) discover that an evil cult is involved. They find a medallion, sought after by some worshipers of demon Moloch, a beast that may be invoked and wreaks havoc, but can only be stopped with the amulet.",
  "synopsis": null
}