{
  "imdb_id": "tt3215356",
  "tmdb_id": "227062",
  "douban_id": null,
  "title": "Vanakkam Chennai (2013)",
  "genres": [
    "Comedy",
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "143 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm5894951",
      "name": "Kiruthiga Udhayanidhi"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm3585913",
      "name": "Shiva",
      "character": "Ajay"
    },
    {
      "id": "nm3591550",
      "name": "Priya Anand",
      "character": "Anjali"
    },
    {
      "id": "nm1962272",
      "name": "Santhanam",
      "character": "Narayanan"
    },
    {
      "id": "nm4591136",
      "name": "Rahul Ravindran",
      "character": "Deepak"
    },
    {
      "id": "nm0882219",
      "name": "Urvashi",
      "character": "Inspector Chandra"
    },
    {
      "id": "nm0719915",
      "name": "Renuka",
      "character": "Ajay's Mother"
    },
    {
      "id": "nm0712437",
      "name": "Nizhalgal Ravi",
      "character": "Anjali's Father"
    },
    {
      "id": "nm1007581",
      "name": "Manobala",
      "character": "Yettu Ayya"
    },
    {
      "id": "nm5631806",
      "name": "Crane Manohar",
      "character": "Rosy's Husband"
    },
    {
      "id": "nm4062192",
      "name": "Pandi",
      "character": "Ajay's Friend"
    },
    {
      "id": "nm5408510",
      "name": "Rajkumar",
      "character": "Vasu"
    },
    {
      "id": "nm2697818",
      "name": "Swaminathan",
      "character": "Ponraj"
    },
    {
      "id": "nm6046288",
      "name": "Na. Kumanan",
      "character": ""
    },
    {
      "id": "nm4742592",
      "name": "Aarthi",
      "character": "Ponraj's Wife"
    },
    {
      "id": "nm5117787",
      "name": "Deepthi Nambiar",
      "character": ""
    },
    {
      "id": "nm4367928",
      "name": "Misha Ghoshal",
      "character": ""
    },
    {
      "id": "nm6046289",
      "name": "Gowri Lakshmi",
      "character": ""
    },
    {
      "id": "nm6046290",
      "name": "Mangal",
      "character": ""
    },
    {
      "id": "nm0621937",
      "name": "Nassar",
      "character": "Guest Appearance       (as Nasser)"
    },
    {
      "id": "nm1294683",
      "name": "Sangeetha",
      "character": "Guest Appearance"
    },
    {
      "id": "nm3561350",
      "name": "Udhayanidhi Stalin",
      "character": "Guest Appearance"
    }
  ],
  "overview": "Tricked by a fraudster, Ajay and Anjali are forced to stay in the same flat. They gradually warm up to each other and start getting romantic notions but the arrival of Deepak, Anjali's fiance, puts them in a dilemma.",
  "storyline": "Ajay and Anjali set out to the city of assortment with a varied ambition each and their lives get tied up to one another's inevitably as they get cheated into the same rental accommodation by the comic fraudster Narayanan. With Ajay having come from his native land down south near Theni for livelihood and Anjali having carried her camera along to shoot the south Indian culture, all the way from London, against her father's wishes, the two are forced to stay in the same apartment. They fight and eventually fall in love.",
  "plot": "Ajay (Shiva), an educated youth comes to Chennai from his hometown Theni to take up a job. Anjali (Priya Anand), a photographer from London is also in the city to capture the South Indian culture on camera.\n\nThe duo are deceived by Narayanan (Santhanam), a real estate broker, who rents out unoccupied houses without informing the house owners. Ajay and Anjali pay the rental money to Narayanan and end up signing the same house. Unable to find another house to rent, the duo decide to stay together till they find Narayanan. They squabble and argue a lot, but soon Ajay falls in love with Anjali. However, he does not reveal her of his feelings. After taking her on a trip to his hometown, he realises that she does not reciprocate his feelings. Soon, Ajay tracks down Narayanan (in a chance encounter earlier, Ajay pockets Narayanan's address from his wallet) and blames him for the misery in his life, because it was Narayanan's trickery that brought them together and now Ajay cannot live without her love. Narayanan decides to help Ajay and he visits the house under the pretense of being Ajay's friend \"Billa\". He tries to make Anjali fall for Ajay. Anjali's fiance Deepak (Rahul Ravindran) then gives Anjali a surprise visit, just as when she begins to enjoy Ajay's company. Narayanan continues to try to getting Ajay and Anjali together, with no success.\n\nOn the night of Anjali's birthday, Ajay decides that she will never love him, and resorts to drinking after being depressed. Meanwhile, Anjali realises that she loves Ajay, but is angry at his behaviour under the influence of alcohol. The next day, she goes to the wedding of Ajay's colleague as his wife (his colleagues think she is his wife) and looks for him there. Just when they find each other and are about to confess their feelings for one another, due to a misunderstanding, Anjali thinks that Ajay and Narayanan are tricksters and have planned the whole same-house plot. Enraged, she returns to London.\n\nThree months later, as Anjali wins her photography contest, Deepak tells her that Narayanan had told him everything from scratch, and convinces her that she loves Ajay and vice versa. Anjali comes back to their apartment, and looks for Ajay, but does not find him. At the same moment, Ajay opens the door and finds his passport that he was looking for. Anjali meets him at last and is thrilled. She asks him why he did not come to woo her for three months in London. Ajay tells her that he had just received his passport and was planning on leaving to the airport. As the two reconcile, Narayanan enters, with a prospective victim (Udhayanidhi Stalin) to trick, and shows him the house. The film concludes showing the same deceiving trick that brought the couple together.",
  "synopsis": null
}