{
  "imdb_id": "tt3282088",
  "tmdb_id": "228962",
  "douban_id": null,
  "title": "Idukki Gold (2013)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "India",
  "version": [],
  "imdb_rating": 5.9,
  "director": [
    {
      "id": "nm3351235",
      "name": "Aashiq Abu"
    }
  ],
  "writer": [
    {
      "id": "nm4543222",
      "name": "Dileesh Nair",
      "description": null
    },
    {
      "id": "nm4544331",
      "name": "Syam Pushkaran",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0693092",
      "name": "Prathap Pothen",
      "character": "Michael"
    },
    {
      "id": "nm0683477",
      "name": "Maniyanpilla Raju",
      "character": "Madan"
    },
    {
      "id": "nm6643390",
      "name": "Shebin Benson",
      "character": "Madan Mohan"
    },
    {
      "id": "nm1184326",
      "name": "Babu Antony",
      "character": "Antony"
    },
    {
      "id": "nm0712469",
      "name": "Raveendran",
      "character": "Ravi"
    },
    {
      "id": "nm9711810",
      "name": "Anil Reji",
      "character": "Antony Gonzalves"
    },
    {
      "id": "nm1066795",
      "name": "Vijayaraghavan",
      "character": "Raman"
    },
    {
      "id": "nm0482309",
      "name": "Lal",
      "character": "Behnnan"
    },
    {
      "id": "nm5399645",
      "name": "Sajitha Madathil",
      "character": "Shyamala"
    },
    {
      "id": "nm0558593",
      "name": "Joy Mathew",
      "character": "John"
    },
    {
      "id": "nm6376274",
      "name": "Arthur Antony",
      "character": "Antony's Son"
    },
    {
      "id": "nm4051131",
      "name": "Sasi Kalinga",
      "character": "Dead Body in Coffin"
    },
    {
      "id": "nm9762693",
      "name": "Anoop Vickraman",
      "character": "Raman"
    },
    {
      "id": "nm6036658",
      "name": "Nazim Hasbi",
      "character": ""
    },
    {
      "id": "nm5939213",
      "name": "Shohaibkhan Hanifrawther",
      "character": "Driver murugan"
    },
    {
      "id": "nm8199042",
      "name": "Sandeep Narayan",
      "character": "Taxi Driver"
    },
    {
      "id": "nm1443795",
      "name": "Praseetha",
      "character": "Manju"
    },
    {
      "id": "nm0884872",
      "name": "Ravi Vallathol",
      "character": "Sadanandan"
    },
    {
      "id": "nm9025545",
      "name": "Indian Pallassery",
      "character": "Mlechan ravi"
    }
  ],
  "overview": "The film narrates the story of a few high-school friends getting back together after a long time.",
  "storyline": "Five friends get separated during their school days, meet up after 35 years and decide to head back to their school in order to relive their teenage indulgence... smoke joints of marijuana that was exclusively available in Idukki... its better known as \"Idukki gold\". As the movie concludes they realize that true Idukki gold was their \"friendship\"... not \"Marijuana\", that they were searching for.",
  "plot": "The movie starts with Michael (Prathap Pothen), who resides in Czech Republic returns to India to meet up with his estranged schoolmates Madan (Maniyanpilla Raju), Antony (Babu Antony), Ravi (Raveendran) and Raman (Vijayaraghavan). He puts up an advertisement in the local newspaper. Ravi and Madan who have still contact with each other notice Michael’s advertisement and decide to meet him. Upon meeting Michael, Ravi and Madan reminisce about their school lives. Eventually they decide to go on a road trip to locate the rest of their friends Antony and Raman and visit their school. Throughout the movie, they have added their childhood clips and narrated what had happened in their school life.\n\nThe whole movie is divided into five parts 1. \"Perilatha Gang\" 2. \"Neechanum mlechanum\" 3. \"Plastic Nirodhikanam\" 4. \"Cheruthoniyile Bhagath Singh\" 5. \"Idukki Gold\". The movie focuses on their teenage and their current life. Ravi being an easygoing guy became a photographer after graduation with very few clients. Madan had a successful life becoming a planter but was forced to divorce his wife as they had no children and was very unhappy. The crew finally finds Antony living a normal quiet life as a restaurant manager. Antony decides to join the trip. They continue their journey to pick up their final member Raman who used to be a core communist. After few hardships they find Raman but in a baffled situation. Raman being a widower with a single son falls in love with one of his co workers but he learns that her marriage is already fixed. On the night of her marriage Raman and Manju elope together with the help of his son and old friends who happened to pass by to pick him up. His friends arrange the marriage and Raman joins the road trip. The flashbacks tells us how the boys used to get drunk, smoke up marijuana and \"beedi\" and had fun bunking classes and just chilling with their friends.\n\nThe title of the movie was obtained from the actual Marijuana known as \"Idukki Gold\" , which these boys had smoked up as teens. They go in search for this so prominent \"Idukki Gold \" and the movie takes on to a serious note when they are met with an accident and find themselves in a field of Marijuana. But they find out that they are held captive by Behnnan(Lal) whom these boys had a fight with as kids. Behnnan was a helper boy at an estate near their school. The boys were caught by the Principal for smoking and they thought Behnnan was the one who sold them out. They beat up Behnnan and leave him there half dead. There they are scared that Behnnan will shoot them for blinding him in one of his eye but the plot twists when Behnnan just smiles at them and tells them all he ever wanted to was to be friends with them. The movie ends on a cheerful note as Behnnan sets them free and Madan reunites with his wife the crew realizing that it was the friendship who bound them together not the \"Idukki Gold\".",
  "synopsis": null
}