{
  "imdb_id": "tt3202478",
  "tmdb_id": "318581",
  "douban_id": null,
  "title": "Wrong Side Up (2014)",
  "genres": [
    "Short",
    "Drama",
    "History"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "15 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm3132631",
      "name": "Henry Darrow McComas"
    }
  ],
  "writer": [
    {
      "id": "nm3132631",
      "name": "Henry Darrow McComas",
      "description": "writer"
    },
    {
      "id": "nm3132631",
      "name": "Henry Darrow McComas",
      "description": null
    },
    {
      "id": "nm6115464",
      "name": "Serena Robar",
      "description": "revisions"
    }
  ],
  "cast": [
    {
      "id": "nm0602920",
      "name": "Jude Moran",
      "character": "Caleb"
    },
    {
      "id": "nm1751327",
      "name": "Katharyn Grant",
      "character": "Suzanne"
    },
    {
      "id": "nm6066097",
      "name": "Jason Olree",
      "character": "Mac"
    },
    {
      "id": "nm6066098",
      "name": "Annabelle Hafey",
      "character": "Liza"
    },
    {
      "id": "nm6066099",
      "name": "Coby Fox",
      "character": "Josiah"
    },
    {
      "id": "nm6572365",
      "name": "Joey Brienza",
      "character": "Boy 1"
    },
    {
      "id": "nm6572366",
      "name": "Christian Cox",
      "character": "Boy 2"
    },
    {
      "id": "nm6826861",
      "name": "Saige Schupbach",
      "character": "Extra"
    },
    {
      "id": "nm7992443",
      "name": "Elijah Patterson",
      "character": "Extra"
    }
  ],
  "overview": "A twelve-year-old boy's fate is determined by his father's departure and the impending Dust Bowl as he is forced to care for his family and their farm.",
  "storyline": "Set in the heart of the Dust Bowl, Wrong Side Up is the story of a young man, Mac, and his family as they struggle with the realities of living in one of the most difficult times in America's history. Mom, Suzanne, is found dealing on her own as her absent husband travels for \"work\" as a plasterer. Caleb, father of Mac and Liza, comes and goes as he pleases often returning with little money and lots of trouble. While Liza is \"daddy's little girl\" Mac is forced to realize the role of his father and his tendencies toward violence forcing Mac's transition from young man to man of the house. It is this transformation that we see unfold in Wrong Side Up during the night of the \"great dust storm\" as Mac is forced to make one of the toughest decisions of his young life that will forever impact his family. On this night two ominous forces descend upon this little homestead, one a great storm and the other an agitated and entitled father. Mac knows he has to be strong for his little sister and...",
  "plot": "A former aircrew member (Petr) is no longer flying, but works in an aviation-related dead-end job, loading boxes at an air-cargo company. He spends his working hours dreaming of re-winning the hand of his former fianceé (Jana), who has moved on to another man whose prospects seem better. He spends his off hours surreptitiously observing a female neighbor.\n\nHis parents also face personal problems: his mother has involved herself in causes promoting world peace but ignores her collapsing family; his father is fighting a midlife crisis by trying to pursue an extramarital affair with a colleague.",
  "synopsis": "Set in the heart of the Dust Bowl, Wrong Side Up is the story of a young man, Mac, and his family as they struggle with the realities of living in one of the most difficult times in American history. Mom, Suzanne, is found dealing on her own as her absent husband travels for work as a plasterer. Caleb, father of Mac and Liza, comes and gos as he pleases often returning with little money and lots of trouble. While Liza is daddys little girl Mac is forced to realize the role of his father and his tendencies toward violence forcing Macs transition from young man to man of the house. It is this transformation that we see unfold in Wrong Side Up during the night of the great dust storm as Mac is forced to make one of the toughest decisions of his young life that will forever impact his family. On this night two ominous forces descend upon this little homestead, one a great storm and the other an agitated and entitled father. Mac knows he has to be strong for his little sister and for his mother, but his quick decision-making leads him into a precarious and irreversible situation with his father and some unfortunate consequences.Mac, fed up wit his fathers antics and abuse, uses a chicken axe to keep him from hurting his mother and his family again casting his father into the relentless elements outside as the great dust storm rages on. Mac is scared, but more importantly he is forever changed. Despite a long and emotional night for this family some much-needed light and peace arrives. Mac not only saved his mother from a terrible situation but he has also come to terms with his new role in the family. We see him grow closer to his sister as he helps her combat her fear of the dusters, one that he struggled with not too long ago. As he tries to comfort his little sister about the dusters we are reminded of a similar conversation he had with Caleb about the nature of the storms. It is in this rare tender moment that Caleb shares some wisdom with his concerned son: the storms are like stories...each one has a beginning, a middle, and an end. The real question is how will Mac handle these stories?"
}