{
  "imdb_id": "tt3399916",
  "tmdb_id": "283322",
  "douban_id": null,
  "title": "The Dead Lands (2014)",
  "genres": [
    "Action",
    "Adventure"
  ],
  "country": "New Zealand",
  "version": [
    {
      "runtime": "107 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm1089736",
      "name": "Toa Fraser"
    }
  ],
  "writer": [
    {
      "id": "nm0822101",
      "name": "Glenn Standring",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2034752",
      "name": "James Rolleston",
      "character": "Hongi"
    },
    {
      "id": "nm0538692",
      "name": "Lawrence Makoare",
      "character": "The Warrior"
    },
    {
      "id": "nm2702696",
      "name": "Te Kohe Tuhaka",
      "character": "Wirepa"
    },
    {
      "id": "nm1901866",
      "name": "Xavier Horan",
      "character": "Rangi"
    },
    {
      "id": "nm5425381",
      "name": "Raukura Turei",
      "character": "Mehe"
    },
    {
      "id": "nm0376234",
      "name": "George Henare",
      "character": "Tane"
    },
    {
      "id": "nm0654240",
      "name": "Rena Owen",
      "character": "Grandmother"
    },
    {
      "id": "nm3723888",
      "name": "Pana Hema Taylor",
      "character": "Mana"
    },
    {
      "id": "nm0878288",
      "name": "Calvin Tuteao",
      "character": "Ka"
    },
    {
      "id": "nm6777452",
      "name": "Jamus Webster",
      "character": "Tahi"
    },
    {
      "id": "nm6777453",
      "name": "Bianca Hyslop",
      "character": "Pipi"
    },
    {
      "id": "nm6777454",
      "name": "Isabella Rakete",
      "character": "Keri"
    },
    {
      "id": "nm3452033",
      "name": "Matariki Whatarau",
      "character": "Tama"
    },
    {
      "id": "nm6777455",
      "name": "Wairangi Koopu",
      "character": "Raupatu"
    },
    {
      "id": "nm6777456",
      "name": "Jeff Ruha",
      "character": "Mere"
    },
    {
      "id": "nm6777457",
      "name": "Kani Collier",
      "character": "Papa"
    },
    {
      "id": "nm6777458",
      "name": "Te Manahau Morrison",
      "character": "Priest"
    },
    {
      "id": "nm0102381",
      "name": "Mere Boynton",
      "character": "Turikatuku"
    },
    {
      "id": "nm2704187",
      "name": "Maria Walker",
      "character": "Eldest Wife"
    },
    {
      "id": "nm6777459",
      "name": "Ria Paki",
      "character": "First Wife"
    },
    {
      "id": "nm6777460",
      "name": "Taupunakohe Tocker",
      "character": "Second Wife"
    },
    {
      "id": "nm1398322",
      "name": "Thomas Kiwi",
      "character": "Apera"
    },
    {
      "id": "nm6777461",
      "name": "Tori Marsh",
      "character": "Ratu"
    },
    {
      "id": "nm1991541",
      "name": "Antonio Te Maioha",
      "character": "Corpse /              Sentry"
    },
    {
      "id": "nm6777462",
      "name": "Kimo Houltham",
      "character": "Mehe Warrior"
    },
    {
      "id": "nm6777463",
      "name": "Ngarino Watt",
      "character": "Mehe Warrior"
    },
    {
      "id": "nm3900891",
      "name": "Rob Kipa-Williams",
      "character": "Tana       (as Rob Williams)"
    },
    {
      "id": "nm6615500",
      "name": "Eds Eramiha",
      "character": "Hemi"
    },
    {
      "id": "nm1929366",
      "name": "Siosa Fonua",
      "character": "Wirepa warrior       (as Siaosi Fonua)"
    },
    {
      "id": "nm3277251",
      "name": "Stephen Grey",
      "character": "Wirepa Warrior"
    },
    {
      "id": "nm3320869",
      "name": "Jeremy Hollis",
      "character": "Wirepa Warrior"
    },
    {
      "id": "nm1398914",
      "name": "Nooroa Poa",
      "character": "Wirepa warrior"
    }
  ],
  "overview": "Hongi, a Maori chieftain’s teenage son, must avenge his father’s murder in order to bring peace and honour to the souls of his loved ones after his tribe is slaughtered through an act of treachery. Vastly outnumbered by a band of villains led by Wirepa, Hongi’s only hope is to pass through the feared and forbidden “Dead Lands” and forge an uneasy alliance with a mysterious warrior, a ruthless fighter who has ruled the area for years.",
  "storyline": "After his tribe is slaughtered through an act of treachery, Hongi, a Maori chieftain's teenage son, must avenge his father's murder in order to bring peace and honor to the souls of his loved ones. Vastly outnumbered by a band of villains, Hongi's only hope is to pass through the feared and forbidden Dead Lands and forge an uneasy alliance with the mysterious Warrior, a ruthless fighter who has ruled the area for years.",
  "plot": "Tane, the chief of a Maori tribe, his 15-year-old son Hongi and their tribe allow a rival clan access to the remains of the second tribes fallen warriors. Hongi does not trust the rival clans leader, Wirepa, and follows him. As Hongi suspected, the visit is a ruse, and Wirepa desecrates the grave site as a pretext for war, blaming Hongi for disturbing the remains. Tane believes his son is innocent, but offers to kill Hongi if it will prevent war. Wirepa refuses, saying war is imminent. Wirepa's clan returns later in force, kills the men of the tribe and beheads Tane, taking his head as a trophy. Hongi is knocked away from the battle, and survives.\n\nHongi leaves and attempts to track down Wirepa. On the way, he discovers that Wirepa and his men have entered the Dead Lands, an area of land where any men who venture into are believed to be killed by a monster. Hongi, suspecting that the monster is in fact a man, tracks him down and, although reluctant, the monster agrees to help Hongi hunt down Wirepa. The monster is in fact a warrior (who is never named in the film) who was the sole survivor of a tribe that used to occupy the Dead Lands, and he kills anyone who ventures there to prevent his tribes historic lands from being occupied.\n\nWhile tracking down Wirepa, Hongi has a series of visions of his long dead grandmother, who helps them on their way. Hongi and the warrior track down Wirepa, and several of his men are killed before Wirepa and his surviving warriors flee. Hongi and the warrior go after them, and the warrior kills a small band of hunters they come across to keep his identity a secret. Hongi is devastated by this, and screams at the warrior. The two separate, but the warrior has a vision from his ancestors that convinces him to continue helping Hongi.\n\nWirepa and his men are tracked to a mountaintop fort, where they barricade themselves inside. Wirepa taunts Hongi with his fathers head, angering him, but the warrior convinces him to regroup and return later. Wirepa's men leave Tane's head on a spike, and most of the men leave the fort. Again, this is a ruse by Wirepa to lure Hongi in. However, when the trap is sprung, the warrior and Hongi get the upper hand and kill most of Wirepa's men. While Hongi battles Wirepa, the warrior is severely wounded but manages to return and save Hongi. Wirepa, distracted from his battle with Hongi, beats the warrior to the ground before returning his attention to Hongi. This time Hongi gains the upper hand, and is about to kill Wirepa. This pleases Wirepa, because it will allow him to be remembered as a great warrior who died in battle about whom songs will be sung, and stories will be told. Hongi denies Wirepa this honor, and allows him to leave. Defeated and alone, Wirepa walks off in shame.\n\nHongi returns to the warrior, who is mortally wounded. Hongi adopts the warrior into his clan, so that his ancestors will guide him into the afterlife. The film ends with a final vision of Hongi's grandmother, who is very pleased, as Hongi begins his return home.",
  "synopsis": null
}