{
  "imdb_id": "tt3309662",
  "tmdb_id": "243831",
  "douban_id": null,
  "title": "Jackpot (2013)",
  "genres": [
    "Comedy",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "132 min",
      "description": ""
    }
  ],
  "imdb_rating": 2.1,
  "director": [
    {
      "id": "nm0004072",
      "name": "Kaizad Gustad"
    }
  ],
  "writer": [
    {
      "id": "nm0004072",
      "name": "Kaizad Gustad",
      "description": "screenplay"
    },
    {
      "id": "nm3728294",
      "name": "Amol Parashar",
      "description": "dialogue"
    }
  ],
  "cast": [
    {
      "id": "nm0787462",
      "name": "Naseeruddin Shah",
      "character": "Boss"
    },
    {
      "id": "nm1293381",
      "name": "Sunny Leone",
      "character": "Maya"
    },
    {
      "id": "nm4580164",
      "name": "Sachiin Joshi",
      "character": "Francis       (as Sachiin J. Joshi)"
    },
    {
      "id": "nm6089600",
      "name": "Bharath Niwas",
      "character": "Anthony D'Souza"
    },
    {
      "id": "nm0221218",
      "name": "Makrand Deshpande",
      "character": "Inspector Tukaram"
    },
    {
      "id": "nm4451966",
      "name": "Meenacshi Martins",
      "character": "Philomena"
    },
    {
      "id": "nm6997777",
      "name": "Satish Gawas",
      "character": "C.M."
    },
    {
      "id": "nm7950092",
      "name": "George Rodrigues",
      "character": "Joseph Alamaro, Francis' uncle"
    },
    {
      "id": "nm3365680",
      "name": "Daniel Weber",
      "character": "Daniel Astrowsky"
    },
    {
      "id": "nm4197660",
      "name": "Melissa Makeup",
      "character": "Melissa Williams       (as Melissa Murphy)"
    },
    {
      "id": "nm1627695",
      "name": "Adam Bedi",
      "character": "Adam Summers"
    },
    {
      "id": "nm7950093",
      "name": "Nijanand Mawani",
      "character": "Dunga"
    },
    {
      "id": "nm7950094",
      "name": "Deepak Walvaikar",
      "character": "Sub-inspector"
    },
    {
      "id": "nm7950095",
      "name": "Bosco Menez",
      "character": "Peter Francisco, insurance agent"
    },
    {
      "id": "nm6418789",
      "name": "Anil V. Raikar",
      "character": "Advocate Antonio Cordeiro"
    },
    {
      "id": "nm7950096",
      "name": "Rohan Govenkar",
      "character": "Bodyguard"
    },
    {
      "id": "nm7950097",
      "name": "Sarvesh Shetty",
      "character": "Bodyguard"
    },
    {
      "id": "nm7950098",
      "name": "Chetan Gurthos",
      "character": "Police peon"
    },
    {
      "id": "nm7950099",
      "name": "Peter D'Silva",
      "character": "Francis' brother"
    },
    {
      "id": "nm7950100",
      "name": "Priyanka Golatkar",
      "character": "Francis' sister"
    },
    {
      "id": "nm7950101",
      "name": "Pretiosa D'Silva",
      "character": "Francis' cousin"
    },
    {
      "id": "nm7950102",
      "name": "Udai Charr",
      "character": "Francis' uncle"
    },
    {
      "id": "nm5366273",
      "name": "Ciara A. Lyons",
      "character": "Club Girl"
    },
    {
      "id": "nm6090992",
      "name": "Bharat Niwas",
      "character": ""
    }
  ],
  "overview": "JACKPOT THE SET UP -  Jackpot is a fast-paced thriller con, with sharp comic one-liners and crazy characters, set entirely in Goa against the backdrop of casino boats.  The film goes back and forth in time, capturing one Goan monsoon of Full Jhol. Its a card game between the players in the con. Who will come out Aces and who will end up being the Joker?  An amateur gang of young Goans plan the perfect con - no nuksaan, no pareshan. However, all good plans often  It doesn't take long for them to discover that a reverse con has been played back on them - by the very people they were trying to con.  In doing so, the five members of the gang split and start suspecting each other. After all, when there is cash in a briefcase, and a beautiful woman with a gun, things tend to go horribly wrong.",
  "storyline": "Jackpot is a fast-paced thriller con, with sharp comic one-liners and crazy characters, set entirely in Goa against the backdrop of casino boats. The film goes back and forth in time, capturing one Goan monsoon of Full Jhol. It's a card game between the players in the con. Who will come out Aces and who will end up being the Joker?",
  "plot": "Francis (Sachiin J Joshi) packs in the muscle and has a can of beer always close at hand. He is also street-smart enough to impress Maya (Sunny Leone), the oomphy voice of reason in the movie. Boss Man (Naseeruddin Shah) is a veteran raver whose clothes are as colorful as his principles and punchlines. Slow in speech but quick to draw a six-shooter, he owns the Jackpot casino.",
  "synopsis": "JACKPOT THE SET UP - Jackpot is a fast-paced thriller con, with sharp comic one-liners and crazy characters, set entirely in Goa against the backdrop of casino boats.The film goes back and forth in time, capturing one Goan monsoon of Full Jhol. Its a card game between the players in the con. Who will come out Aces and who will end up being the Joker?An amateur gang of young Goans plan the perfect con - no nuksaan, no pareshan. However, all good plans oftenIt doesn't take long for them to discover that a reverse con has been played back on them - by the very people they were trying to con.In doing so, the five members of the gang split and start suspecting each other. After all, when there is cash in a briefcase, and a beautiful woman with a gun, things tend to go horribly wrong.The world of the lazy Goa backwaters is pitted against the world of the non-stop Goa casinos, where night can be day.This is an ideal breeding ground, where all kind of cons can find a suitable home. This is Jackpot -The Casino. The largest ship in the harbour. And were open 24x7.Con artists are most welcome to try Jackpot: Trust. Greed. Sex. Money. Poker. River. This is The Full Jhol."
}