{
  "imdb_id": "tt3379814",
  "tmdb_id": "341886",
  "douban_id": null,
  "title": "June (2015)",
  "genres": [
    "Horror",
    "Sci-Fi"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.2,
  "director": [
    {
      "id": "nm4998490",
      "name": "L. Gustavo Cooper"
    }
  ],
  "writer": [
    {
      "id": "nm0167808",
      "name": "Sharon Y. Cobb",
      "description": "writer"
    },
    {
      "id": "nm4998490",
      "name": "L. Gustavo Cooper",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0000680",
      "name": "Casper Van Dien",
      "character": "Dave Anderson"
    },
    {
      "id": "nm0695560",
      "name": "Victoria Pratt",
      "character": "Lily Anderson"
    },
    {
      "id": "nm0420646",
      "name": "Eddie Jemison",
      "character": "Victor Emmanuel"
    },
    {
      "id": "nm2900452",
      "name": "Addy Miller",
      "character": "Lily (as Teenager)"
    },
    {
      "id": "nm0629634",
      "name": "Lance E. Nichols",
      "character": "Dr. Wynstrom"
    },
    {
      "id": "nm5583008",
      "name": "Aiden Flowers",
      "character": "Bully #1"
    },
    {
      "id": "nm4613008",
      "name": "Kennedy Brice",
      "character": "June"
    },
    {
      "id": "nm3576837",
      "name": "Theodora Greece",
      "character": "Ms. Wapos"
    },
    {
      "id": "nm0389507",
      "name": "Cindy Hogan",
      "character": "Candy"
    },
    {
      "id": "nm0929558",
      "name": "Kevin Will",
      "character": "Tic Tac Tim"
    },
    {
      "id": "nm1926982",
      "name": "Kelly Lind",
      "character": "Stripper #2"
    },
    {
      "id": "nm2565812",
      "name": "Rachel Whitman Groves",
      "character": "June's Biological Mother"
    },
    {
      "id": "nm6443884",
      "name": "Heather Cazes",
      "character": "Cloaked Figure Cult Member"
    },
    {
      "id": "nm5586122",
      "name": "Juliette Beavan",
      "character": "Priestess"
    },
    {
      "id": "nm0189659",
      "name": "Thomas R. Martin",
      "character": "June's Biological Father"
    },
    {
      "id": "nm6118378",
      "name": "Hector Presedo",
      "character": "Gardener /              Cult Member"
    },
    {
      "id": "nm5862412",
      "name": "Jordyn A. Davis",
      "character": "Student"
    },
    {
      "id": "nm6410834",
      "name": "Julia Contrenchis",
      "character": "Cult Member"
    },
    {
      "id": "nm5242830",
      "name": "Carsen Flowers",
      "character": "Foster Kid #1"
    },
    {
      "id": "nm2116917",
      "name": "Walter Colson",
      "character": "DCF Worker       (as Walter J. Colson)"
    },
    {
      "id": "nm5037761",
      "name": "Ronnie Hooks",
      "character": "Nurse /              Cult Member"
    },
    {
      "id": "nm5243044",
      "name": "Camden Flowers",
      "character": "Orphan #2"
    },
    {
      "id": "nm0853566",
      "name": "John Teal Jr.",
      "character": "Cult Member"
    },
    {
      "id": "nm6963456",
      "name": "Ellie Foco",
      "character": "Student"
    },
    {
      "id": "nm5037797",
      "name": "Chad Graham",
      "character": "Hughes"
    },
    {
      "id": "nm3718990",
      "name": "Arielle Stephens",
      "character": "Student"
    },
    {
      "id": "nm4694437",
      "name": "Mark Mills",
      "character": "Student #1 /              Bully #5"
    },
    {
      "id": "nm5450187",
      "name": "Towns W. Sanford",
      "character": "Jimbo"
    },
    {
      "id": "nm4623946",
      "name": "D.J. Mills",
      "character": "Student #2 /              Bully #6"
    },
    {
      "id": "nm3972253",
      "name": "Brock Patrick Kaufman",
      "character": "Bully #4       (as Brock Kaufman)"
    },
    {
      "id": "nm4694319",
      "name": "Elizabeth Foley",
      "character": "Student"
    },
    {
      "id": "nm6464540",
      "name": "Joshua Hidalgo",
      "character": "Foster Kid #3"
    },
    {
      "id": "nm9103805",
      "name": "Charles Major",
      "character": "Gardener"
    },
    {
      "id": "nm4736923",
      "name": "Caleb Welch",
      "character": "Student"
    },
    {
      "id": "nm9103809",
      "name": "Jalen Martrain",
      "character": "Student"
    },
    {
      "id": "nm6464541",
      "name": "Anderson Dalbom",
      "character": "Baby June"
    },
    {
      "id": "nm9103800",
      "name": "Shampaon Hewitt",
      "character": "Stripper #1"
    },
    {
      "id": "nm9103801",
      "name": "Thomas Lillis",
      "character": "Biker at BBQ"
    },
    {
      "id": "nm9103803",
      "name": "Jared Poland",
      "character": "Bully #2"
    },
    {
      "id": "nm9103811",
      "name": "Cassidy Wartelle",
      "character": "Student"
    },
    {
      "id": "nm3890954",
      "name": "Paul Garry",
      "character": "Cult Member"
    },
    {
      "id": "nm6645108",
      "name": "Gordon Warrington",
      "character": "Student"
    },
    {
      "id": "nm9103808",
      "name": "Izzy Fant",
      "character": "Student"
    },
    {
      "id": "nm9103807",
      "name": "Charles Price",
      "character": "Cult Member"
    },
    {
      "id": "nm9103806",
      "name": "Brandon",
      "character": "Cult Member"
    },
    {
      "id": "nm5337447",
      "name": "Matthew Slade",
      "character": "Cute boy in class"
    },
    {
      "id": "nm6572328",
      "name": "Chloe McGehee",
      "character": "Student"
    },
    {
      "id": "nm9103810",
      "name": "Allie Canova",
      "character": "Student"
    },
    {
      "id": "nm5270261",
      "name": "Sherry Price",
      "character": "Cult Member"
    },
    {
      "id": "nm6645104",
      "name": "Caleb Zerangue",
      "character": "Student"
    },
    {
      "id": "nm6484142",
      "name": "Taylor Sacco",
      "character": "Student"
    },
    {
      "id": "nm6452632",
      "name": "Joshua R. Todd",
      "character": "Ronnie"
    },
    {
      "id": "nm9103802",
      "name": "Anthony Flowers",
      "character": "Redneck #2"
    },
    {
      "id": "nm9103804",
      "name": "Joseph Davis",
      "character": "Bully #3"
    }
  ],
  "overview": "June is different from all other nine-year old girls.  She is an orphan hiding a secret.  Bad things happen when she gets upset, supernatural things.  June has been in many foster homes usually leaving them destroyed.  But this time it will be different.  June has a new foster home and she really likes her new parents.  She will have to face the force within her to protect her new parents and to save herself.",
  "storyline": "JUNE is a 9-year-old orphan girl who shares her body with an ancient supernatural being whose mission is to destroy mankind to allow nature to prevail on earth.",
  "plot": "At Culver University in Virginia, General Thunderbolt Ross meets with Dr. Bruce Banner, the colleague and boyfriend of his daughter Betty, regarding an experiment that Ross claims is meant to make humans immune to gamma radiation. The experiment — part of a World War II era \"super soldier\" program that Ross hopes to recreate — fails, and the exposure to gamma radiation causes Banner to transform into the Hulk for brief periods of time, whenever his heart rate rises above 200. The Hulk destroys the lab and injures or kills the people inside. Banner becomes a fugitive from the U.S. military and Ross in particular, who wants to weaponize the Hulk process.\n\nFive years later,[N 1] Banner works at a bottling factory in Rocinha, Rio de Janeiro in Brazil, while searching for a cure for his condition. On the Internet, he collaborates with a colleague he knows only as \"Mr. Blue\", and to whom he is \"Mr. Green\". He is also learning meditative breathing techniques to help keep control, and has not transformed in five months. After Banner cuts his finger, a drop of his blood falls into a bottle, and is eventually ingested by an elderly consumer in Milwaukee, Wisconsin, giving him gamma sickness. Using the bottle to track down Banner, Ross sends a SWAT team, led by Russian-born British Royal Marine Emil Blonsky, to capture him. Banner transforms into the Hulk and defeats Blonsky's team. After Ross explains how Banner became the Hulk, Blonsky agrees to be injected with a small amount of a similar serum, which gives him enhanced speed, strength, agility, and healing, but also begins to deform his skeleton and impair his judgment.\n\nBanner returns to Culver University and reunites with Betty, who is dating psychiatrist Leonard Samson. Banner is attacked by Ross and Blonsky's forces, tipped off by the suspicious Samson, causing him to again transform into the Hulk. The ensuing battle outside the university proves to be futile for Ross' forces and they eventually retreat, though Blonsky, whose sanity is starting to falter, boldly attacks and mocks the Hulk. The Hulk seemingly kills Blonsky and flees with Betty. After the Hulk reverts to Banner, he and Betty go on the run, and Banner contacts Mr. Blue, who urges them to meet him in New York City. Mr. Blue is actually cellular biologist Dr. Samuel Sterns, who tells Banner he has developed a possible antidote to Banner's condition. After a successful test, he warns Banner that the antidote may only reverse each individual transformation. Sterns reveals he has synthesized Banner's blood samples, which Banner sent from Brazil, into a large supply, with the intention of applying its \"limitless potential\" to medicine. Fearful of the Hulk's power falling into the military's hands, Banner wishes to destroy the blood supply.\n\nMeanwhile, Blonsky is revealed to have survived the battle and has completely healed. He joins Ross' forces for a third attempt to take Banner into custody. They succeed and Banner, along with Betty, are taken away in a helicopter. Blonsky stays behind and forces Sterns to inject him with Banner's blood, as he covets the Hulk's power. Sterns warns that the combination of the super-soldier formula and Banner's blood may cause him to become an \"abomination\", but Blonsky insists. The experiment mutates Blonsky into a creature with size and strength surpassing that of the Hulk, but drives him mad. He attacks Sterns, who gets some of Banner's blood in a cut on his forehead, causing him to begin mutating as well. Blonsky then rampages through Harlem. Realizing that the Hulk is the only one who can stop Blonsky, Banner convinces Ross to release him. He jumps from Ross' helicopter and transforms after hitting the ground. After a long and brutal battle through Harlem, the Hulk defeats Blonsky. After having a small, peaceful moment with Betty, the Hulk flees from New York.\n\nA month later, Banner is in Bella Coola, British Columbia. Instead of trying to suppress his transformation, he successfully transforms in a controlled manner. In a final scene, Tony Stark approaches Ross at a local bar and informs him a team is being put together.",
  "synopsis": "As a baby, June is at the center of an occult ritual attempting to join her to a dark entity known as Aer. As a portal opens in the sky overhead, June's biological mother has a change of heart and slashes the cult priestess' throat. The portal explodes, sending out energy bolts that strike down the cultists. A teenage girl later revealed to be named Lily escapes with June and they are picked up by a passing police car.9 Years Later - Louisiana Department of Children and Families case worker Victor Emmanuel visits the trailer park home of June's foster parents Tim and Candy. Victor hints to June that he knows she gains supernatural abilities when she grows angry. Enraged by the ongoing abuse suffered from her foster family, Aer's darkness possesses June at an outdoor BBQ. June's rage creates a pulse wave that knocks partygoers unconscious.Emmanuel brings June to the home of her new middle class foster parents Dave and Lily Anderson, the former cultist now hiding her previous affiliation. June begins bleeding and collapses in front of her class on her first day of school. As June's strange behavior continues, Emmanuel has Lily take June to Dr. Wynstrom for a consultation.With the supernatural activity surrounding June escalating, Dave suggests giving up on her. Lily kicks Dave out of their house.Revealed to be members of the Aer cult, Dr. Wynstom tasks Emmanuel and a henchman named Hughes with retrieving June so that the bonding ritual may finally be completed. Emmanuel and Hughes kidnap June and leave Lily trapped in a burning garage.Dave learns from photographs that Emmanuel had been stalking his family. Dave races back to the house and arrives in time to rescue his wife and to see Emmanuel and Hughes pulling away in their car with June.Lily reveals to Dave that she was the former cult member who rescued June nine years earlier. She and Dave race to the cult's compound where they find Dr. Wynstrom and others conducting the ritual that will fully fuse June with Aer.With the portal expanding overhead, Dave interrupts the ritual. Energy bolts are released, striking down Dave and the cultists. Lily appeals to June through love and the entire scene explodes in light. Lily and June leave together hand in hand and take to the road to go on the run."
}