{
  "imdb_id": "tt3399818",
  "tmdb_id": "204333",
  "douban_id": null,
  "title": "Animeshi Sugii Gisaburô (2012)",
  "genres": [
    "Documentary",
    "Biography"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "92 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm0411132",
      "name": "Masato Ishioka"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm0837485",
      "name": "Gisaburô Sugii",
      "character": "Himself"
    }
  ],
  "overview": "A master of Japanese animation, Gisaburo Sugii talks candidly about his career and creative process in this rare and exciting piece of film.",
  "storyline": null,
  "plot": "See also: List of Captain Tsubasa charactersCaptain Tsubasa\n\nTsubasa Oozora is an 11-year-old elementary school student who is deeply in love with football and dreams of one day winning the FIFA World Cup for Japan. He lives together with his mother in Japan, while his father is a seafaring captain who travels around the world.\n\nTsubasa Oozora is known as the Soccer no Moshigo which translates as \"heaven-sent child of football\". When he was only barely a year old, he was almost run over by a rushing bus while playing with a football. However, Tsubasa held the ball in front of him which served as a cushion for most of the impact. The force of the bump blew him away, but he was able to right himself with the ball. Hence, Tsubasa Oozora's motto of \"The ball is my friend\". Ever since he was little, he always went out with a football. His mother concludes that he was indeed born to only play football. At a very young age, Tsubasa Oozora already had amazing speed, stamina, dribbling skills and shotpower - he astounded anyone who saw him play.\n\nAt the beginning of the story, Tsubasa and his mom both move to the city of Nankatsu, a town well known for their talented elementary school football teams and where Tsubasa meets Ryo Ishizaki, a football-loving young student who often sneaks out from his mother's public bath houses and chores to play football. He meets Sanae Nakazawa (also known as Anego), his future wife, an enthusiastic girl who also loves football and helps cheer the Nankatsu High team on, and Genzo Wakabayashi, a highly talented young goalkeeper whom he soon challenges to a game in Nankatsu's annual Sports Festival. He also meets Roberto Hongo, one of the best Brazilian footballers in the world who is a friend of Tsubasa's father and who starts living with Tsubasa and his mother in order to train Tsubasa. Roberto becomes a mentor to Tsubasa and helps him to harness his football skills, convincing him to join Nankatsu Elementary and its fledgling elementary school football team, which Roberto later coaches as he passes his techniques onto Tsubasa.\n\nTsubasa meets Taro Misaki, who has travelled around Japan due to his father's job and soon joins Nankatsu. The two become the best of friends on the pitch and real life, forming a partnership soon to be renowned as the \"Golden Duo\" or \"dynamic duo\" of Nankatsu. Soon Tsubasa and his Nankatsu team start taking on the best of elementary school football, meeting such talented players as Kojiro Hyuga, Ken Wakashimazu, Jun Misugi, Hikaru Matsuyama, and many others. Tsubasa's Nankatsu squad wins numerous youth national championships, and he wins the U-17 World Championships for Japan, before leaving the country to play in Brazil...",
  "synopsis": null
}