{
  "imdb_id": "tt3332690",
  "tmdb_id": "365951",
  "douban_id": null,
  "title": "Mosayile Kuthira Meenukal (2014)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "129 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm6087992",
      "name": "Ajith Pillai"
    }
  ],
  "writer": [
    {
      "id": "nm6087992",
      "name": "Ajith Pillai",
      "description": null
    },
    {
      "id": "nm6087993",
      "name": "Vipin Radhakrishnan",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3981484",
      "name": "Asif Ali",
      "character": "Alexi"
    },
    {
      "id": "nm1548005",
      "name": "P. Balachandran",
      "character": "Raviettan"
    },
    {
      "id": "nm3817633",
      "name": "Janani Iyer",
      "character": "Deena"
    },
    {
      "id": "nm6410449",
      "name": "Jijoy Rajagopalan",
      "character": "Sulaiman"
    },
    {
      "id": "nm1335581",
      "name": "Nishanth Sagar",
      "character": "Hashim"
    },
    {
      "id": "nm0893449",
      "name": "Nedumudi Venu",
      "character": "Kuriachen"
    }
  ],
  "overview": "Mosayile Kuthira Meenukal (English: Swordfishes of Big Tides), a Malayalam Adventure movie directed by Ajith Pillai. Asif Ali (Alex) is the scion of a large and rich Christian family, whose male members take pride in flaunting their virility. Due to his wayward life he lands up in prison. He makes attempts to flee from prison but in vain. A savior appears before him in the form of Sunny Wayne. He is from Lakshadweep, and circumstances make Asif Ali to follow him to the beautiful picturesque sea side town where he learns to amend his selfish ways. The narration forms the rest of the story.",
  "storyline": "An unusual friendship between two escaped convicts is formed during a cat and mouse chase, which leads them to the beautiful islands of Lakshadweep.",
  "plot": "The film starts with Alex narrating his sad story. He is the scion of a large and rich Christian family, whose male members take pride in flaunting their virility. Due to his wayward life he lands up in prison. He makes attempts to flee from prison but in vain. A saviour appears before him in the form of Akbar Ali. Akbar Ali is from Lakshadweep, and circumstances make Alex follow him to the beautiful islands.The aftermath is the rest of the narration.",
  "synopsis": null
}