{
  "imdb_id": "tt3322364",
  "tmdb_id": "321741",
  "douban_id": null,
  "title": "Concussion (2015)",
  "genres": [
    "Biography",
    "Drama",
    "Sport"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "123 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm1481618",
      "name": "Peter Landesman"
    }
  ],
  "writer": [
    {
      "id": "nm1481618",
      "name": "Peter Landesman",
      "description": "written by"
    },
    {
      "id": "nm6543415",
      "name": "Jeanne Marie Laskas",
      "description": "based on the GQ article \"Game Brain\" by"
    }
  ],
  "cast": [
    {
      "id": "nm0000226",
      "name": "Will Smith",
      "character": "Dr. Bennet Omalu"
    },
    {
      "id": "nm0000285",
      "name": "Alec Baldwin",
      "character": "Dr. Julian Bailes"
    },
    {
      "id": "nm0000983",
      "name": "Albert Brooks",
      "character": "Dr. Cyril Wecht"
    },
    {
      "id": "nm1813221",
      "name": "Gugu Mbatha-Raw",
      "character": "Prema Mutiso"
    },
    {
      "id": "nm0001556",
      "name": "David Morse",
      "character": "Mike Webster"
    },
    {
      "id": "nm0397124",
      "name": "Arliss Howard",
      "character": "Dr. Joseph Maroon"
    },
    {
      "id": "nm0005282",
      "name": "Mike O'Malley",
      "character": "Daniel Sullivan"
    },
    {
      "id": "nm0550371",
      "name": "Eddie Marsan",
      "character": "Dr. Steve DeKosky"
    },
    {
      "id": "nm0004991",
      "name": "Hill Harper",
      "character": "Christopher Jones"
    },
    {
      "id": "nm0015382",
      "name": "Adewale Akinnuoye-Agbaje",
      "character": "Dave Duerson"
    },
    {
      "id": "nm0610459",
      "name": "Stephen Moyer",
      "character": "Dr. Ron Hamilton"
    },
    {
      "id": "nm0429114",
      "name": "Richard T. Jones",
      "character": "Andre Waters"
    },
    {
      "id": "nm0001663",
      "name": "Paul Reiser",
      "character": "Dr. Elliot Pellman"
    },
    {
      "id": "nm0005561",
      "name": "Luke Wilson",
      "character": "Roger Goodell"
    },
    {
      "id": "nm3935293",
      "name": "Sara Lindsey",
      "character": "Gracie"
    },
    {
      "id": "nm2200632",
      "name": "Matthew Willig",
      "character": "Justin Strzelczyk"
    },
    {
      "id": "nm1128780",
      "name": "Elizabeth Tulloch",
      "character": "Keana Strzelczyk       (as Bitsie Tulloch)"
    },
    {
      "id": "nm1620679",
      "name": "Kevin Jiggetts",
      "character": "FBI Agent"
    },
    {
      "id": "nm0344196",
      "name": "Gary Grubbs",
      "character": "FBI Agent"
    },
    {
      "id": "nm0468414",
      "name": "Randy Kovitz",
      "character": "Deputy Mayor"
    },
    {
      "id": "nm0129749",
      "name": "L. Scott Caldwell",
      "character": "Waters' Mother"
    },
    {
      "id": "nm0957201",
      "name": "Dan Ziskie",
      "character": "Paul Tagliabue"
    },
    {
      "id": "nm0583579",
      "name": "Larry John Meyers",
      "character": "Father D'Amico"
    },
    {
      "id": "nm1924104",
      "name": "Joni Bovill",
      "character": "Mrs. Scott"
    },
    {
      "id": "nm1151921",
      "name": "Jason Davis",
      "character": "Defense Attorney"
    },
    {
      "id": "nm4917414",
      "name": "Dan Anders",
      "character": "College Coach       (as Dan D.A. Anders)"
    },
    {
      "id": "nm7210400",
      "name": "Jeb Keller",
      "character": "High School Coach       (as John Keller)"
    },
    {
      "id": "nm2728365",
      "name": "Joshua Elijah Reese",
      "character": "Graveyard Tech"
    },
    {
      "id": "nm0564697",
      "name": "Holt McCallany",
      "character": "Angry Neurologist"
    },
    {
      "id": "nm7804425",
      "name": "Jackie Schafer",
      "character": "TV Reporter (Webster Site)"
    },
    {
      "id": "nm4156269",
      "name": "Mike Clark",
      "character": "TV Reporter (Interview)"
    },
    {
      "id": "nm7804426",
      "name": "Scott Conner",
      "character": "ER Doctor"
    },
    {
      "id": "nm0679465",
      "name": "Jared Pfennigwerth",
      "character": "Tech"
    },
    {
      "id": "nm4585077",
      "name": "Phillip Chorba",
      "character": "Tech       (as Phillip JM Chorba)"
    },
    {
      "id": "nm0282266",
      "name": "David Flick",
      "character": "Hospital Security Guard"
    },
    {
      "id": "nm2095178",
      "name": "Kelley Davis",
      "character": "Assistant"
    },
    {
      "id": "nm0596159",
      "name": "Alison Moir",
      "character": "Colleen Bailes"
    },
    {
      "id": "nm6342241",
      "name": "Dino Rende",
      "character": "Strzelczyk's Son"
    },
    {
      "id": "nm5343317",
      "name": "Samara Lee",
      "character": "Strzelczyk's Daughter"
    },
    {
      "id": "nm2716691",
      "name": "Nathan Hollabaugh",
      "character": "Young Reporter"
    },
    {
      "id": "nm4372600",
      "name": "Cindy Jackson",
      "character": "Paramedic"
    },
    {
      "id": "nm8770063",
      "name": "Scott A Miller",
      "character": "Contractor       (as Scott Miller)"
    },
    {
      "id": "nm3881932",
      "name": "Michael Schaich",
      "character": "Security Guard"
    },
    {
      "id": "nm7804429",
      "name": "Hennessey Joseph",
      "character": "NFL Employee"
    },
    {
      "id": "nm7804430",
      "name": "Antonia Long",
      "character": "Piano Player"
    },
    {
      "id": "nm7804431",
      "name": "Lisa Earley",
      "character": "Lodi Morgue Tech"
    },
    {
      "id": "nm7804432",
      "name": "Ann B. Betters",
      "character": "Cantor"
    },
    {
      "id": "nm0559994",
      "name": "Dihlon McManne",
      "character": "Reporter at Westin"
    },
    {
      "id": "nm3082309",
      "name": "Britanni Johnson",
      "character": "Rachel Green       (as Britanni D. Johnson)"
    },
    {
      "id": "nm7804433",
      "name": "Dawn Vocke",
      "character": "Nurse in Bailes' Office"
    }
  ],
  "overview": "A dramatic thriller based on the incredible true David vs. Goliath story of American immigrant Dr. Bennet Omalu, the brilliant forensic neuropathologist who made the first discovery of CTE, a football-related brain trauma, in a pro player and fought for the truth to be known. Omalu's emotional quest puts him at dangerous odds with one of the most powerful institutions in the world.",
  "storyline": "Will Smith stars in Concussion, a dramatic thriller based on the incredible true David vs. Goliath story of American immigrant Dr. Bennet Omalu, the brilliant forensic neuropathologist who made the first discovery of CTE, a football-related brain trauma, in a pro player and fought for the truth to be known. Omalu's emotional quest puts him at dangerous odds with one of the most powerful institutions in the world.",
  "plot": "In 2002, former Pittsburgh Steelers center Mike Webster is found dead in his pickup truck, after years of self-mutilation and homelessness. Before his death, a fellow football player, Justin Strzelczyk, comes to him, and confides that he is starting to lose his memory, that he is saying odd things to his children, and nearly threw his wife against the wall. A disoriented Webster brushes the worries off, and deliriously tells him that the most important thing \"is to finish the game\", which is what he said during his Hall of Fame speech.\n\nBennet Omalu, a forensic pathologist with the Allegheny County, Pennsylvania cororner's office, handles Webster's autopsy. He wonders how a man, otherwise healthy, and fairly young, could have degenerated so quickly, and makes it a point to figure out why he died of a heart attack at only fifty. Omalu closely examines microscope slides of Webster's brain and discovers that he had severe brain damage. He ultimately determines that Webster died as a result of the long-term effects of repeated blows to the head, a disorder he later calls chronic traumatic encephalopathy (CTE). With the help of former Steelers team doctor Julian Bailes, fellow neurologist Steven T. DeKosky and county coroner Cyril Wecht, Omalu publishes a paper on his findings, which is initially dismissed by the NFL.\n\nOver the next few years, Omalu discovers that three other former NFL players, Strzelczyk (died 2004), Terry Long (died 2005), and Andre Waters (died 2006), had symptoms very similar to Webster's. He finally persuades newly appointed NFL commissioner Roger Goodell to allow him to present his findings before a committee on player safety. However, the NFL does not take him seriously and he is barred from the committee meeting, forcing Bailes, a former NFL employee, to give the presentation in his place. However, the meeting is a set up, where they claim the players' head trauma was due to past injuries, having nothing to do with football. As he leaves the meeting, Dave Duerson angrily confronts Omalu, and tells him to \"go back to Africa\".\n\nOmalu is subjected to considerable pressure to back down from his efforts, as football is a widely beloved sport in Pittsburgh, having provided jobs and allowed men go to college. Wecht is subjected to a politically motivated prosecution on corruption charges, and Omalu is forced to leave Pittsburgh soon after, lest he be deported, or sent to prison on petty charges as punishment for tarnishing the NFL. Omalu's wife, Prema, suffers a miscarriage after being stalked. The Omalus are forced to leave their dream home outside Pittsburgh. They move to Lodi, California, where Omalu takes a job with the San Joaquin County coroner's office.\n\nThree years later, Omalu is vindicated when former NFL Players Association executive Dave Duerson commits suicide due to growing cognitive problem. In his suicide note, Duerson admits that Omalu was right. Omalu is allowed to address an NFLPA conference on concussions and CTE. He informs them that he once wished he had never known Mike Webster, but by knowing him, he has the responsibility to inform NFL players of the true risk they are taking in playing. He holds no resentment for the NFL, and tells them to forgive themselves, and be at peace. Amid growing scrutiny from Congress, the NFL is forced to take the concussion issue more seriously, and in 2011, NFL players sue the league for not properly informing them of the risk of CTE. Omalu is offered a job as chief medical examiner for the District of Columbia, but as explained in closing title cards, turns it down, remaining with Prema and their two children in California, where he became a U.S. citizen in February 2015.",
  "synopsis": "The film opens with a footage of football player Mike Webster (David Morse), showing him in action during games in playing for the Pittsburgh Steelers, as well as the man speaking in a conference. In the present time, September 2002, Mike is homeless and living in his car, suffering from dementia.Nigerian pathologist Dr. Bennet Omalu (Will Smith) is giving a testimony in court over a murder case. Based on his research, he determines that the blood on the defendant's hands was not that of the victim's because the defendant is a hemophiliac and could not risk something for possibility of injury or death.Bennet works at the coroner's office in Allegehney county where he has an odd habit of speaking to the deceased so that he can get an idea as to what it is that killed them. He is friends at work with Gracie (Sara Lindsey) but is antagonized by Danny (Mike O'Malley). Bennet also tends to throw away knives after being used once. He is called into the office of his boss, Dr. Cyril Wecht (Albert Brooks) over this. Bennet asks Cyril if he would like it if Bennet cut his mother open with the same knife he used on a serial killer. Cyril says yes, and that he would personally ask him to do so.Bennet is asked to provide care for a young immigrant woman named Prema Mutiso (Gugu Mbatha-Raw). He takes her to his home and offers her some money, which she appears to find offensive. Bennet explains to her that it's okay to need money and that it doesn't make her weak, but in America, sometimes it is necessary to fake it in order to get ahead.Webster visits Dr. Julian Bailes (Alec Baldwin) over his condition. He appears to be getting worse. Webster is visited at his car by fellow football player Justin Strzelczyk (Matthew Willig), who is also suffering from a similar condition. Webster complains that he doesn't want to go to sleep, so he is seeing tasing himself to stay awake. He is later found dead.Mike Webster's death shocks the city. His body is brought in for Bennet to examine. He observes that Webster pulled out his teeth and superglued them back together. Bennet takes a look at Webster's brain and discovers severe head trauma that led to his mental deterioration. He brings this to Cyril's attention. Bennet furthers his research by studying football videos and noticing the amount of times someone like Webster took serious blows to the head.Bennet and Prema spend the night out and quickly fall in love. Bennet later proposes to her and they are married, and later are expecting their first child.Strzcelczyk is seen ready to attack his wife and children, claiming that the voices in his head are telling him to kill them. His wife screams at him to get out, and he drives away. He turns up dead, and another football player, Terry Long, is reported to have died from drinking antifreeze. Bennet examines them as well and concludes that the men suffered from CTE (Chronic Traumatic Encephalopathy). He presents his research to Dr. Steven DeKosky (Eddie Marsan) and Dr. Ron Hamilton (Stephen Moyer), who reluctantly agree with him. After word of this gets out, it is believed that Bennet is trying to shame football, earning him a number of enemies. He is told to retract his statements, saying that he made it all up to harm the NFL's reputation. He does, however, receive support from Julian, who distances himself from the NFL's actions.Meanwhile, Dave Duerson (Adewale Akinnuoye-Agbaje) is approached by fellow player Andre Waters (Richard T. Jones). Waters is suffering from a mental condition as well and begs Duerson to help him, but Duerson leaves him and walks away. Waters is later found dead from a self-inflicted gunshot wound to the head.One evening at a restaurant, Bennet and Julian meet with Dr. Joseph Maroon (Arliss Howard) over the matter. He chastises Bennet and thinks he is trying to destroy football, although Bennet continuously urges him to tell the truth that could prevent other football players from suffering similar fates to the recently departed.Roger Goodell (Luke Wilson) is made the new commissioner of the NFL. Bennet is called upon to speak at a summit for concussion. However, Julian later tells him that they don't want Bennet to speak, but rather for Julian to speak since he was the NFL's neurological consultant, leading the two men to conflict. Furthermore, two corrupt FBI agents shows up to Bennet's job to indict Cyril on multiple charges for supporting Bennet's work, while also coming for Bennet by threatening to deport him back to Nigeria. Bennet decides he must resign and look for work in another state.Prema is driving by herself when she feels that someone is following her. She makes a detour and loses the car, but she experiences a problem. She is taken to the hospital and joined by Bennet, where they are told that the doctors cannot find a heartbeat from the baby. After Bennet is forced to sell his home, he breaks down, feeling utterly defeated.Three years later, Bennet and Prema are living in Lodi, California with their daughter. Bennet is called by Julian when Dave Duerson commits suicide and requested that his brain be examined.Bennet speaks before a group of people on his research, while also simultaneously admiring the sport of football. Talks of CTE begin flowing through the country, sparking comparisons between tobacco companies and their denial of the links between their products and bad health. Bennet is redeemed, and he is offered a job in Washington DC. In the final scene, he later drives by a school during football practice and watches as two players run head-to-head into each other.The final text states that Bennet Omalu turned down the Washington job and remained in California with Prema Mutiso and their two children. Multiple retired NFL players filed lawsuits against the NFL for concealing information on concussed football players. The NFL settled on the condition that it would not have to disclose that it knew, and when, on the effects of concussion on football players. It was later determined that 28% of football players have or will suffer from CTE. All charges against Cyril Wecht were dropped. In February 2015, Bennet Omalu officially became a US citizen."
}