{
  "imdb_id": "tt3356174",
  "tmdb_id": "258881",
  "douban_id": null,
  "title": "Música Serve Pra Isso (2013)",
  "genres": [
    "Documentary"
  ],
  "country": "Brazil",
  "version": [
    {
      "runtime": "92 min",
      "description": "original"
    }
  ],
  "imdb_rating": 6.9,
  "director": [
    {
      "id": "nm1201936",
      "name": "Bel Bechara"
    },
    {
      "id": "nm1204171",
      "name": "Sandro Serpa"
    }
  ],
  "writer": [
    {
      "id": "nm1201936",
      "name": "Bel Bechara",
      "description": null
    },
    {
      "id": "nm1204171",
      "name": "Sandro Serpa",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0009494",
      "name": "André Abujamra",
      "character": "Abu"
    },
    {
      "id": "nm0673177",
      "name": "Maurício Pereira",
      "character": "Mau"
    }
  ],
  "overview": "Documentary about “Os Mulheres Negras” , the world´s third smallest big band, discussing music, aesthetics and creation in Brazil from the 80´s till nowadays.",
  "storyline": "Documentary abou the worlds third smallest big band, Os Mulheres Negras (The Black Women), discussing music, aesthetics and creation in Brazilian culture since the 80s till now.O documentário conta a história da Terceira Menor Big Band do Mundo, Os Mulheres Negras, formada por Maurício Pereira e André Abujamra em meados dos anos 80. Através de depoimentos, imagens de arquivo, quadrinhos e música são levantadas questões decisivas no processo de criação, nas escolhas estéticas e nos caminhos trilhados pela banda, evidenciando o contexto histórico, político e cultural que permeou sua trajetória e discutindo um dos pontos centrais de todo procedimento artístico: pra que serve fazer tudo isso?",
  "plot": null,
  "synopsis": "Documentary abou the worlds third smallest big band, Os Mulheres Negras (The Black Women), discussing music, aesthetics and creation in Brazilian culture since the 80s till now.O documentário conta a história da Terceira Menor Big Band do Mundo, Os Mulheres Negras,\nformada por Maurício Pereira e André Abujamra em meados dos anos 80. Através de\ndepoimentos, imagens de arquivo, quadrinhos e música são levantadas questões decisivas no\nprocesso de criação, nas escolhas estéticas e nos caminhos trilhados pela banda, evidenciando\no contexto histórico, político e cultural que permeou sua trajetória e discutindo um dos pontos\ncentrais de todo procedimento artístico: pra que serve fazer tudo isso?"
}