{
  "imdb_id": "tt3368222",
  "tmdb_id": "358893",
  "douban_id": null,
  "title": "Angry Indian Goddesses (2015)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "115 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm0659023",
      "name": "Pan Nalin"
    }
  ],
  "writer": [
    {
      "id": "nm0659023",
      "name": "Pan Nalin",
      "description": "writer and"
    },
    {
      "id": "nm2987926",
      "name": "Subhadra Mahajan",
      "description": null
    },
    {
      "id": "nm0788157",
      "name": "Dilip Shankar",
      "description": null
    },
    {
      "id": "nm3977264",
      "name": "Arsala Qureishi",
      "description": "co-writer"
    }
  ],
  "cast": [
    {
      "id": "nm3591549",
      "name": "Sarah-Jane Dias",
      "character": "Frieda Da Silva"
    },
    {
      "id": "nm5423482",
      "name": "Rajshri Deshpande",
      "character": "Lakshmi"
    },
    {
      "id": "nm1269584",
      "name": "Sandhya Mridul",
      "character": "'Su' Suranjana"
    },
    {
      "id": "nm4199026",
      "name": "Amrit Maghera",
      "character": "'Jo' Joanna"
    },
    {
      "id": "nm6120325",
      "name": "Pavleen Gujral",
      "character": "'Pammy' Pamela Jaswal"
    },
    {
      "id": "nm2821699",
      "name": "Anushka Manchanda",
      "character": "'Mad' Madhurita"
    },
    {
      "id": "nm1318578",
      "name": "Tannishtha Chatterjee",
      "character": "Nargis Nasreen"
    },
    {
      "id": "nm6120326",
      "name": "Anuj Choudhry",
      "character": "The Neighbour"
    },
    {
      "id": "nm2220774",
      "name": "Jeffrey Goldberg",
      "character": "Chris"
    },
    {
      "id": "nm1300009",
      "name": "Adil Hussain",
      "character": "Police Superintendent"
    },
    {
      "id": "nm8915138",
      "name": "Aditya Suhas Jambhale",
      "character": "Lallan"
    },
    {
      "id": "nm5843593",
      "name": "Vikram Kochhar",
      "character": "Agent"
    },
    {
      "id": "nm1464837",
      "name": "Arjun Mathur",
      "character": "Zain"
    },
    {
      "id": "nm7987433",
      "name": "Kkunal Shinde",
      "character": "Supporting       (voice) (as Kunal Shiinde)"
    }
  ],
  "overview": "Frieda, a fashioncommercial photographer trying to find her own art, gathers her closest girlfriends from all over India to travel to Goa for a surprise announcement: she’s getting married! Thus begins an impromptu bachelorette celebration that lasts for a full week. A riotous roller-coaster ride of girl bonding; friendships, break ups, make ups, fuck ups, passion, devastation, hesitation, terrorization and self realization. Amidst the fun and frenzy, heartbreak and heartache, passion and obsession, youth and innocence, secrets tumble out, tensions emerge, bonds are formed and emotions run high. Soon events will take a more serious turn, but for the moment these women are determined to seize the day.",
  "storyline": "India's FIRST female buddy movie! A power packed comic drama about Indian women finding their hearts and loosing their heads! A wild bunch of girls from all over India descent upon Goa! Their closest friend FREIDA has invited them to her family home for a surprise announcement : she's getting married! Thus begins an impromptu bachelorette. A riotous roller coaster of girl bonding: friendships, breakups, make ups, screw ups, passion, devastation, hesitation, terrorization, realization, boom- explosions! Among the fun and frenzy, heart breaks and heart aches, passion and obsession, youth and innocence, emotions run high and dry and hidden secrets surface. The girls go on living life like there is no tomorrow, oblivious of the impending doom upon them...",
  "plot": "Freida (Sarah-Jane Dias) is a fashion photographer who invites a group of friends to her family's home to announce that she is getting married. The group consists of Madhurita or Mad (Anushka Manchanda), a Bollywood singer, Pamela Jaswal or Pammy (Pavleen Gujral), a trophy wife, Suranjana or Su (Sandhya Mridul), a businesswoman, Nargis (Tannishtha Chatterjee), an activist and Joanna or Jo (Amrit Maghera), an aspiring actress. The announcement sets off a chain of reactions, letting out hidden secrets. After the announcement, the wild bunch of girls from all over India descends upon Goa. Thus begins an impromptu bachelorette party, and a riotous roller-coaster ride of girl-bonding. Amidst the fun and frenzy, the girls are oblivious of the impending doom and go on living life like there is no tomorrow.\n\nEverything's set for a night of celebration. There's only one issue: Frieda won't say who her betrothed is. As they banter their way through celebration, their conversation, derived entirely from improvisations among the actors, covers everything from sex to street harassment to the buff (and often shirtless) next-door neighbour. During the trip, the women are harassed and they react boldly. Their harassers are enraged and they are shaken. As the holiday progresses, we become acquainted with the women's dreams, desires, fears and, above all, their unwavering bond with one another -a bond that eventually takes them to extreme lengths. Later the ladies come to know that Freida is getting married to Nargis (which is illegal under the IPC section 377). A night before the marriage, the group decides to party . At the party, a heated argument between Jo and Freida leads Jo to walk out, but the party continues. When they decide to go home, they look about for Jo . She is found dead on the beach, apparently raped. The police officer in charge conducts his preliminary enquiries in a manner that shames the women, reiterating their lack of faith in a patriarchal society that treats women shabbily. They go home, distraught and frustrated. Su's daughter had followed Jo when she left the party and clicked photos of her subsequently. The snaps reveal that the group of men who had harassed the friends earlier had raped Jo. The women take the evidence back to the police but encounter resistance once again. One of the women heads back to the beach with a gun. The rest of the group follows and, before you know it, all five rapist are shot dead. At Jo's funeral, the group makes a series of sentimental speeches, Nargis' speech summarising the worth of a woman. The police officer interrupts the ceremony, asking for a confession of guilt from the women. The story has an open-ended conclusion when the entire congregation stands up in solidarity with the women.",
  "synopsis": null
}