{
  "imdb_id": "tt3300946",
  "tmdb_id": "419143",
  "douban_id": null,
  "title": "What Makes Me Tic? (2013)",
  "genres": [
    "Documentary",
    "Biography"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "40 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm6055103",
      "name": "Matt Duhamel"
    },
    {
      "id": "nm6055102",
      "name": "Heather Duhamel"
    }
  ],
  "writer": [
    {
      "id": "nm6055103",
      "name": "Matt Duhamel",
      "description": "story"
    }
  ],
  "cast": null,
  "overview": "Facing community misconceptions, four people diagnosed with Tourette's Syndrome find themselves living a fulfilling and ambitious life despite consent and sometimes debilitating effects of the misunderstood disorder.",
  "storyline": "Facing community misconceptions, four people diagnosed with Tourette's Syndrome find themselves living a fulfilling and ambitious life despite consent and sometimes debilitating effects of the misunderstood disorder.",
  "plot": "In 1996, treasure hunter Brock Lovett and his team aboard the research vessel Akademik Mstislav Keldysh search the wreck of RMS Titanic for a necklace with a rare diamond, the Heart of the Ocean. They recover a safe containing a drawing of a young woman wearing only the necklace dated April 14, 1912, the day the ship struck the iceberg.[Note 1] Rose Dawson Calvert, the woman in the drawing, is brought aboard Keldysh and tells Lovett of her experiences aboard Titanic.\n\nIn 1912 Southampton, 17-year-old first-class passenger Rose DeWitt Bukater, her fiancé Cal Hockley, and her mother Ruth board the luxurious Titanic. Ruth emphasizes that Rose's marriage will resolve their family's financial problems and retain their high-class persona. Distraught over the engagement, Rose considers suicide by jumping from the stern; Jack Dawson, a penniless artist, intervenes and discourages her. Discovered with Jack, Rose tells a concerned Cal that she was peering over the edge and Jack saved her from falling. When Cal becomes indifferent, she suggests to him that Jack deserves a reward. He invites Jack to dine with them in first class the following night. Jack and Rose develop a tentative friendship, despite Cal and Ruth being wary of him. Following dinner, Rose secretly joins Jack at a party in third class.\n\nAware of Cal and Ruth's disapproval, Rose rebuffs Jack's advances, but realizes she prefers him over Cal. After rendezvousing on the bow at sunset, Rose takes Jack to her state room; at her request, Jack sketches Rose posing nude wearing Cal's engagement present, the Heart of the Ocean necklace. They evade Cal's bodyguard and have sex in an automobile inside the cargo hold. On the forward deck, they witness a collision with an iceberg and overhear the officers and designer discussing its seriousness.\n\nCal discovers Jack's sketch of Rose and an insulting note from her in his safe along with the necklace. When Jack and Rose attempt to inform Cal of the collision, he has his bodyguard slip the necklace into Jack's pocket and accuses him of theft. Jack is arrested, taken to the master-at-arms' office, and handcuffed to a pipe. Cal puts the necklace in his own coat pocket.\n\nWith the ship sinking, Rose flees Cal and her mother, who has boarded a lifeboat, and frees Jack. On the boat deck, Cal and Jack encourage her to board a lifeboat; Cal claims he can get himself and Jack off safely. After Rose boards one, Cal tells Jack the arrangement is only for himself. As her boat lowers, Rose decides that she cannot leave Jack and jumps back on board. Cal takes his bodyguard's pistol and chases Rose and Jack into the flooding first-class dining saloon. After using up his ammunition, Cal realizes he gave his coat and consequently the necklace to Rose. He later boards a collapsible lifeboat by carrying a lost child.\n\nAfter braving several obstacles, Jack and Rose return to the boat deck. The lifeboats have departed and passengers are falling to their deaths as the stern rises out of the water. The ship breaks in half, lifting the stern into the air. Jack and Rose ride it into the ocean and he helps her onto a wooden panel only buoyant enough for one person. He assures her that she will die an old woman, warm in her bed. Jack dies of hypothermia but Rose is saved.\n\nWith Rose hiding from Cal en route, the RMS Carpathia takes the survivors to New York City where Rose gives her name as Rose Dawson. She later finds out Cal committed suicide after losing all his money in the 1929 Wall Street crash.\n\nBack in the present, Lovett decides to abandon his search after hearing Rose's story. Alone on the stern of Keldysh, Rose takes out the Heart of the Ocean — in her possession all along — and drops it into the sea over the wreck site. While she is seemingly asleep or has died in her bed, photos on her dresser depict a life of freedom and adventure inspired by the life she wanted to live with Jack. The final scenes are of traveling across Titanic's sunken deck to a set of doors, as it changes to when it was new again. Going through the doors, Jack is seen on the Grand Staircase and a young Rose reunites with him, applauded by those who died.",
  "synopsis": "The documentary film, \"What Makes Me Tic?\" is a powerful look into four average Americans living with the often misunderstood disorder, Tourette's Syndrome.\nNatasha was diagnosed with Tourette's when she was seven years old. Today at age twelve, she's organizing a Tourette's Syndrome Awareness Walk not allowing herself to be defined by her facial and vocal \"tics\".Josh has been living with Tourette's since he was a child. Damaged teeth, bruises and scars are only a few examples of the damage he's caused himself because of his uncontrollable tics. Today, his ambitious personality helped him succeed in his career and to write a memoir titled \"The World's Strongest Librarian\". Calvert was diagnosed with Tourette's while in his fifties. His recent PhD from Brigham Young University and his position as Chairman of the Tourette Syndrome Association, Utah Chapter gives him an outlet to talk and help others better understand the disorder.Peter has an extremely emotional story. Once diagnosed with one of the worst cases of Tourette's Syndrome in the United States, Peter has beaten the odds. He underwent experimental brain surgery to help reduce his severe tics which previously caused him to shake and sweat. Peter looks ahead with his message of hope and determination. \"What Makes Me Tic\" is a film that not only educates, but offers hope for people who may not feel accepted or understood by their friends, teachers, and or society."
}