{
  "imdb_id": "tt3323638",
  "tmdb_id": "251387",
  "douban_id": null,
  "title": "The Night Crew (2015)",
  "genres": [
    "Action",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "89 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.0,
  "director": [
    {
      "id": "nm2341319",
      "name": "Christian Sesma"
    }
  ],
  "writer": [
    {
      "id": "nm2341319",
      "name": "Christian Sesma",
      "description": null
    },
    {
      "id": "nm0806002",
      "name": "Paul Sloan",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0331577",
      "name": "Luke Goss",
      "character": "Wade"
    },
    {
      "id": "nm0940158",
      "name": "Bokeem Woodbine",
      "character": "Crenshaw"
    },
    {
      "id": "nm0001803",
      "name": "Danny Trejo",
      "character": "Aguilar"
    },
    {
      "id": "nm0806002",
      "name": "Paul Sloan",
      "character": "Ronnie"
    },
    {
      "id": "nm3276414",
      "name": "Chasty Ballesteros",
      "character": "Mae"
    },
    {
      "id": "nm3445312",
      "name": "Luciana Faulhaber",
      "character": "Rose"
    },
    {
      "id": "nm0582939",
      "name": "Jason Mewes",
      "character": "Chachi"
    },
    {
      "id": "nm1697789",
      "name": "Jacqueline Lord",
      "character": "Myra"
    },
    {
      "id": "nm1273864",
      "name": "Roberto 'Sanz' Sanchez",
      "character": "Gustavo       (as Roberto Sanchez)"
    },
    {
      "id": "nm2307223",
      "name": "Kaleti Williams",
      "character": "Chupa"
    },
    {
      "id": "nm6130245",
      "name": "Pedro Chingo Bling Herrera",
      "character": "Lobo       (as Pedro 'Chingo Bling' Herrera)"
    },
    {
      "id": "nm0842023",
      "name": "Don Swayze",
      "character": "Big Willy"
    },
    {
      "id": "nm1789278",
      "name": "Christine Nguyen",
      "character": "Krissy X"
    },
    {
      "id": "nm1882430",
      "name": "Ryan Noto",
      "character": "Armenian Mafia Mek"
    },
    {
      "id": "nm2204477",
      "name": "Anthony J. Rickert-Epstein",
      "character": "Armenian Mafia Yerkoo"
    },
    {
      "id": "nm1494112",
      "name": "Bruna Rubio",
      "character": "Jill"
    }
  ],
  "overview": "A group of hard up bounty hunters must survive the night in a desert motel against a horde of savage cartel killers. They soon realize that their fugitive, a mysterious Chinese woman, is much more than she lets on.",
  "storyline": "THE NIGHT CREW centers on a group of hard up bounty hunters who must survive the night in a desert motel against a horde of savage border runners. They soon realize that their fugitive, a mysterious Chinese woman, is much more than she lets on.",
  "plot": "Following Gareth Mallory's promotion to M, James Bond takes leave from MI6. Receiving a posthumous message from the previous M, Bond carries out an unauthorised mission in Mexico City, killing three men plotting a terrorist bombing on a stadium during Day of the Dead celebrations, before giving chase to their leader, Marco Sciarra. In the ensuing struggle, Bond steals Sciarra's ring, which is emblazoned with a stylised octopus, and kills him. Upon returning to London, Bond is indefinitely suspended from field duty by M. Parallel to this, M is in the midst of a power struggle with Max Denbigh (whom Bond dubs \"C\"), the head of a privately backed agency, the Joint Intelligence Service. C campaigns for Britain to form \"Nine Eyes\", a global surveillance and intelligence co-operation initiative and uses his influence to close down the '00' section as he believes it to be outdated.\n\nBond disobeys M's order and travels to Rome to attend Sciarra's funeral. That evening he seduces Sciarra's widow Lucia, who tells him about Spectre, an organisation of businessmen with criminal and terrorist connections to which her husband belonged. Bond uses Sciarra's ring to infiltrate a Spectre meeting, where he identifies the leader, Franz Oberhauser. When Oberhauser addresses Bond by name, he is pursued across the city by Spectre's assassin, Mr. Hinx. Moneypenny informs Bond that the information he collected leads to Mr. White, a former member of Quantum—a subsidiary of Spectre—who has fallen afoul of Oberhauser and has been marked for assassination. Bond asks her to investigate Oberhauser, who was presumed dead years earlier.\n\nBond locates White in Austria, where he learns that White is dying of thallium poisoning. He admits to having grown disenchanted with Quantum and tells Bond to find and protect his daughter, Dr. Madeline Swann, who will take him to L'Américain; this will in turn lead him to Spectre. White then commits suicide. Bond approaches Swann, and after he rescues her from Hinx, the two meet Q. Through Sciarra's ring, Q forensically links Oberhauser to Bond's previous missions, identifying Le Chiffre, Dominic Greene and Raoul Silva as Spectre agents. Swann reveals that L'Américain is a hotel in Tangier.\n\nThe two travel to the hotel and discover White left evidence directing them to Oberhauser's operations base in the desert. After an encounter with Hinx that sees the assassin killed, Bond and Swann are escorted to Oberhauser's base. There, Oberhauser reveals that Spectre has been funding the Joint Intelligence Service while staging terrorist attacks around the world, creating a need for the Nine Eyes programme. In return C will give Spectre unlimited access to intelligence gathered by Nine Eyes, allowing them to anticipate and counter-act investigations into their operations. Bond is tortured as Oberhauser discusses their shared history: after the younger Bond was orphaned, Oberhauser's father, Hannes, became his temporary guardian. Believing that Bond supplanted his role as son, Oberhauser killed his father and staged his own death, subsequently adopting the name Ernst Stavro Blofeld and going on to form Spectre. Bond and Swann overpower him and escape, destroying the base in an explosion and leaving Blofeld to die.\n\nAs the Moroccan facility was one node in a wider network, Bond and Swann return to London where they meet M, Bill Tanner, Q, and Moneypenny with the intention of arresting C and stopping Nine Eyes from being activated. Swann and Bond are abducted separately, while the rest of the group proceed with the plan. After Q succeeds in preventing the Nine Eyes from going online, a brief struggle between M and C ends with C falling to his death. Meanwhile, Bond is taken to the old MI6 building, which is scheduled for demolition. Moving throughout a ruined labyrinth, he encounters a disfigured Blofeld, who tells him that he has a choice between escaping the building before explosives are detonated or die trying to save Swann. Bond finds Swann and the two escape by boat as the building collapses.\n\nBond gives chase and manages to shoot down Blofeld's helicopter, which crashes onto Westminster Bridge. Blofeld crawls away from the wreckage and is confronted by Bond, with Blofeld attempting to goad Bond into shooting him. Bond unloads his gun, sparing Blofeld. As Blofeld is arrested by M, Bond throws his gun into the Thames and leaves the bridge with Swann.",
  "synopsis": "At a highway rest stop Mae slugs Rose in washroom and escapes. She tricks Wade and hijacks a pickup. The Bounty hunters follow, puzzled how Mae escaped Wade phones their boss Willie in LA, a wheels chair guy under threat from Armenians, anxiously waiting for Mae.Aguilar is under medical care with an IV and is anxious to get Mae back. Mae finds and abandoned resort motel and enters, finds a room. A young ponytailed white guy, Chachi, smokes weed by the empty pool.Mae cleans up, has flashbacks of Aguilar approaching her shirtless. Aguilar phones her but Mae says she is never coming back, upset he ruined her life. The guard has noticed a light and called it in, he had heard the Mexicans were looking for an Asian girl.She captures Chachi, he says his brother in law runs drugs and he had to.The bounty hunters arrive and quickly find Mae and Chachi and take them prisoner. In a hurry to leave the group go warily to their truck but a large group of armed Mexicans arrive firing weapons. Barely escaping an RPG the six make it back into the motel.Aguilar calls his aide who reports Mae is protected by bounty hunters, but he wants her alive.Mexicans call out to surrender, Wade says they have to hold firm. 'Shaw and Ronnie and take Chachi to a landline phone and call Willie in LA for \"hostage rescue support\" but the line is cut before they can say where.The Bounty Hunters withstand a furious assault. The Mexicans have an advantage in numbers but many die. Mae goes into a trance. Another RPG. Chachi is wounded and is dragged away. The Bounty Hunters regroup and pause. Ronnie has been hit and is bleeding . Rose explains to 'Shaw he \"wasn't there when she needed him\", angry he goes to fight Wade her new boyfriend. Rose announces she is pregnant and the men stop fighting. A grenade goes off and the room is stunned. They are captured. The men are bound and kicked. Mae has disappeared again and the Mexicans demand to know where she is. Rose is bound on a bed in the command Van, under guard. Wade is tortured. Mae hears Rose's screams and pauses on her escape.Shaw recovers and helps Wade kill their torturer. The two put aside their differences. Mae rescues Rose and kills her guard. The bounty hunters recover their weapons and move into the courtyard shooting the Mexicans.The women hold the bus and the three make their way and all manage to escape. Ronnie is badly hurt and dies. Motorcycle attackers approach and a gunfight starts again. Shaw is killed.\nMae weeps.Aguilar at his mansion is confident Mae will return. He has has old book about resurrection.Wade is wounded in the leg. Rose is distraught, Mae takes her away to safety to a nearby old factory. Rose is in pain, Mae says she has miscarried.Mae explains she used to love Aguilar. The Mexicans approach calling for Mae. Mae, armed with a knife fights the lead Mexican, she cuts him but the man's strength overcomes her, forced to call Aguilar they argue, Aguilar then orders her killed. Meanwhile Wade has recovered a bit and fights through more henchmen. Rose shoots The big Mex in the back but he turns and fires a shot into Rose. Mae now fights for her life and chews the big man's jugular.Sunrise, the two women hug, Mae says she can cure Rose and bites into her neck, Wade, still alive kills the last five Mexicans and then drops, Rose rushes to him. She tells Mae she can't lose him.Aguilar walks his mansion grounds, Mae arrives again, now with Wade and Rose all fit and healthy. Aguilar bares his fangs and prepares to fight.Back in LA the bail bondsman is surprised by Wade, Wade leaves a duffle bag full of cash.Wade and Rose drive off together, Mae goes her own way."
}