{
  "imdb_id": "tt3387648",
  "tmdb_id": "297608",
  "douban_id": null,
  "title": "The Taking of Deborah Logan (2014)",
  "genres": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm0733263",
      "name": "Adam Robitel"
    }
  ],
  "writer": [
    {
      "id": "nm0733263",
      "name": "Adam Robitel",
      "description": "written by &"
    },
    {
      "id": "nm1134130",
      "name": "Gavin Heffernan",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0489010",
      "name": "Jill Larson",
      "character": "Deborah Logan"
    },
    {
      "id": "nm0708867",
      "name": "Anne Ramsay",
      "character": "Sarah Logan"
    },
    {
      "id": "nm0029391",
      "name": "Michelle Ang",
      "character": "Mia Medina"
    },
    {
      "id": "nm1654820",
      "name": "Brett Gentile",
      "character": "Gavin"
    },
    {
      "id": "nm1513843",
      "name": "Jeremy DeCarlos",
      "character": "Luis"
    },
    {
      "id": "nm0193982",
      "name": "Ryan Cutrona",
      "character": "Harris"
    },
    {
      "id": "nm2987522",
      "name": "Tonya Bludsworth",
      "character": "Sheriff Tweed"
    },
    {
      "id": "nm0619549",
      "name": "Anne Bedian",
      "character": "Dr. Nazir"
    },
    {
      "id": "nm0371530",
      "name": "Randell Haynes",
      "character": "Dr. Schiffer"
    },
    {
      "id": "nm3105945",
      "name": "Jeffrey Woodard",
      "character": "Father Vitali"
    },
    {
      "id": "nm6141442",
      "name": "Julianne Taylor",
      "character": "Cara       (as Julianne Elizabeth Taylor)"
    },
    {
      "id": "nm2817581",
      "name": "Dave Blamy",
      "character": "Cara's Father"
    },
    {
      "id": "nm0860493",
      "name": "Melissa Lozoff",
      "character": "Cara's Mother       (as Melissa Ann Lozoff)"
    },
    {
      "id": "nm0445180",
      "name": "Bo Keister",
      "character": "Officer John Donato"
    },
    {
      "id": "nm1919608",
      "name": "Kevin A. Campbell",
      "character": "Henry Desjardins"
    },
    {
      "id": "nm0818013",
      "name": "Lee Spencer",
      "character": "Dr. Kevin Leder"
    },
    {
      "id": "nm2998299",
      "name": "Jana Allen",
      "character": "Reporter #1"
    },
    {
      "id": "nm5897476",
      "name": "Bruce Florence",
      "character": "Reporter #2       (as Bruce Edward Florence)"
    },
    {
      "id": "nm0354331",
      "name": "David Hains",
      "character": "Reporter 1976"
    },
    {
      "id": "nm6192561",
      "name": "Joey Popp",
      "character": "News Anchor #1"
    },
    {
      "id": "nm1898881",
      "name": "Bryan Hanson",
      "character": "News Anchor #2       (as Bryan Eric Hanson)"
    },
    {
      "id": "nm4954992",
      "name": "Nick Madrick",
      "character": "Young Cop"
    }
  ],
  "overview": "What starts as a poignant medical documentary about Deborah Logan's descent into Alzheimer's disease and her daughter's struggles as caregiver degenerates into a maddening portrayal of dementia at its most frightening, as hair-raising events begin to plague the family and crew and an unspeakable malevolence threatens to tear the very fabric of sanity from them all.",
  "storyline": "What starts as a poignant medical documentary about Deborah Logan's descent into Alzheimer's disease and her daughter's struggles as caregiver degenerates into a maddening portrayal of dementia at its most frightening, as hair-raising events begin to plague the family and crew and an unspeakable malevolence threatens to tear the very fabric of sanity from them all.",
  "plot": "Mia, Gavin, and Luis are a documentary team set to create a documentary about Deborah, an elderly woman suffering from Alzheimer's disease. Deborah is reluctant to be filmed but agrees to the project after her daughter Sarah reminds her that they need the money to keep the house from being repossessed. While filming, Sarah and Deborah talk about earlier years when Deborah worked as a switchboard operator for her own answering service business to make ends meet.\n\nDeborah is shown to exhibit increasingly bizarre actions that her personal physician, Dr. Nazir, states are normal for someone with an aggressive form of Alzheimer's. However, cameraman Luis begins to notice that several of Deborah's actions defy normal explanations and expresses concern that something supernatural is occurring. Things grow more tense after Luis and Gavin record audio of Deborah speaking in French while sitting at her old switchboard, talking about sacrifices and snakes. They also notice that the line for 337 continually rings and discover that the line belonged to local physician Henry Desjardins, who disappeared after a series of cannibalistic ritualized murders of four young girls. This information is too much for Gavin, so he quits. Deborah's behavior becomes so extreme that she is hospitalized for her own safety.\n\nMia and the others discover that Desjardins was supposedly trying to re-create an ancient demonic ritual that would make him immortal but required the deaths of five girls that recently had their first period. They question whether Deborah is possessed by Desjardins—as a similar case occurred in Africa where a mother was possessed by her dead son and was freed only when a witch doctor burned the son's corpse. At the hospital, Harris visits Deborah, who begs Harris to kill her. He tries to comply with her wishes but is unsuccessful due to the entity within Deborah flinging the hospital room television at Harris, preventing it. Sarah, Mia, and Luis discover that Deborah had unsuccessfully tried to abduct Cara, a young cancer patient in whom she had previously tried to take. Sarah learns that years ago, Deborah had learned that Desjardins planned to use Sarah as his fifth victim and had murdered the doctor before he could accomplish this, and buried his body in the yard. The group eventually finds the body and tries to burn it but fails to do so.\n\nDeborah succeeds in abducting Cara and taking her to the location where Desjardins had killed all of his previous victims. After discovering Deborah has gone into the mines, Sheriff Tweed follows behind, only to be killed moments later. After hearing Tweed's attack Sarah and Mia follow behind, only to find Deborah just as she's trying to eat Cara's head in a snake-like manner. They finally manage to burn Desjardins' corpse. The film then cuts to news footage of reporters stating that Deborah was deemed unfit to stand trial for the crimes she committed during her abduction of Cara. An additional news story shows that Cara has overcome her cancer and is celebrating her birthday. As the reporter begins to wrap up the story, Cara turns to the camera and gives a creepy smile, hinting that Desjardins' ritual was completed and that he is now in control of her body.",
  "synopsis": "Mia, Gavin, and Luis are a documentary team set to create a documentary about Deborah Logan, an elderly woman suffering from Alzheimer's disease. Deborah is reluctant to be filmed but agrees to the project after her daughter Sarah reminds her that they need the money to keep the house from being repossessed. While filming, Sarah and Deborah talk about earlier years when Deborah worked as a switchboard operator for her own answering service business to make ends meet.Deborah is shown to exhibit increasingly bizarre actions that her personal physician, Dr. Nazir, states are normal for someone with an aggressive form of Alzheimer's. However, cameraman Luis begins to notice that several of Deborah's actions defy normal explanations and expresses concern that something supernatural is occurring. Things grow more tense after Luis and Gavin record audio of Deborah speaking in French while sitting at her old switchboard, talking about sacrifices and snakes. They also notice that the line for 337 continually rings and discover that the line belonged to local physician Henry Desjardins, who disappeared after a series of cannibalistic ritualized murders of four young girls. This information is too much for Gavin, so he quits. Deborah's behavior becomes so extreme that she is hospitalized for her own safety.Mia and the others discover that Desjardins was supposedly trying to re-create an ancient demonic ritual that would make him immortal but required the deaths of five virgin girls that recently had their first period. They question whether Deborah is possessed by Desjardins as a similar case occurred in Africa where a mother was possessed by her dead son and was freed only when a witch doctor burned the son's corpse. At the hospital, Harris visits Deborah, who begs Harris to kill her. He tries to comply with her wishes but is unsuccessful due to the entity within Deborah preventing it. Sarah, Mia, and Luis discover that Deborah had unsuccessfully tried to abduct Cara, a young cancer patient in whom she had previously tried to take. Sarah learns that years ago, Deborah had learned that Desjardins planned to use Sarah as his fifth victim and had murdered the doctor before he could accomplish this, and buried his body in the yard. The group eventually finds the body and tries to burn it but fails to do so.Deborah succeeds in abducting Cara from the hospital and taking her to the location where Desjardins had killed all of his previous victims. After discovering Deborah has gone into the mines, Sheriff Tweed follows behind, only to be killed moments later. After hearing Tweed's attack Sarah and Mia follow behind, only to find Deborah just as she's trying to eat Cara's head in a snake-like manner. They finally manage to burn Desjardins' corpse. The film then cuts to news footage of reporters stating that Deborah was deemed unfit to stand trial for the crimes she committed during her abduction of Cara. An additional news story shows that Cara has overcome her cancer and is celebrating her birthday. As the reporter begins to wrap up the story, Cara turns to the camera and gives a creepy smile... hinting that Desjardins' ritual was completed and that his evil soul is now in control of her body."
}