{
  "imdb_id": "tt3397754",
  "tmdb_id": "253406",
  "douban_id": null,
  "title": "10,000 Saints (2015)",
  "genres": [
    "Comedy",
    "Drama",
    "Music"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "113 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.9,
  "director": [
    {
      "id": "nm0075849",
      "name": "Shari Springer Berman"
    },
    {
      "id": "nm0700301",
      "name": "Robert Pulcini"
    }
  ],
  "writer": [
    {
      "id": "nm0700301",
      "name": "Robert Pulcini",
      "description": "screenplay and"
    },
    {
      "id": "nm0075849",
      "name": "Shari Springer Berman",
      "description": "screenplay"
    },
    {
      "id": "nm6211941",
      "name": "Eleanor Henderson",
      "description": "based on the novel by"
    }
  ],
  "cast": [
    {
      "id": "nm4630480",
      "name": "Henry Kelemen",
      "character": "Young Jude"
    },
    {
      "id": "nm0629855",
      "name": "Julianne Nicholson",
      "character": "Harriet"
    },
    {
      "id": "nm0000160",
      "name": "Ethan Hawke",
      "character": "Les"
    },
    {
      "id": "nm2633535",
      "name": "Asa Butterfield",
      "character": "Jude"
    },
    {
      "id": "nm2240326",
      "name": "Avan Jogia",
      "character": "Teddy"
    },
    {
      "id": "nm3180297",
      "name": "Nadia Alexander",
      "character": "Prudence"
    },
    {
      "id": "nm2794962",
      "name": "Hailee Steinfeld",
      "character": "Eliza"
    },
    {
      "id": "nm0607865",
      "name": "Emily Mortimer",
      "character": "Diane"
    },
    {
      "id": "nm7512444",
      "name": "Austin Ramsey",
      "character": "Hockey Player"
    },
    {
      "id": "nm4871671",
      "name": "Jeff O'Donnell",
      "character": "Tory"
    },
    {
      "id": "nm5069907",
      "name": "Matthew James Ballinger",
      "character": "Hippie"
    },
    {
      "id": "nm0386472",
      "name": "Emile Hirsch",
      "character": "Johnny"
    },
    {
      "id": "nm0922902",
      "name": "Tracy Westmoreland",
      "character": "Photo Booth Bum"
    },
    {
      "id": "nm2742115",
      "name": "Warren Kelly",
      "character": "Minister"
    },
    {
      "id": "nm3927723",
      "name": "Ellie Bensinger",
      "character": "Female Classmate #1"
    },
    {
      "id": "nm6324958",
      "name": "Thomas Hettrick",
      "character": "Rooster"
    },
    {
      "id": "nm4130724",
      "name": "Eric Elizaga",
      "character": "Eric -Army of One Bassist"
    },
    {
      "id": "nm4843086",
      "name": "Cass Dillon",
      "character": "Syd -Army of One Drummer"
    },
    {
      "id": "nm1510424",
      "name": "Michael Elian",
      "character": "Security Guard"
    },
    {
      "id": "nm7512446",
      "name": "Calista Bourinaris",
      "character": "Female Classmate #2"
    },
    {
      "id": "nm0118296",
      "name": "Gaura Vani Buchwald",
      "character": "Krishna Priest"
    },
    {
      "id": "nm7512447",
      "name": "Doyal Gauranga Das",
      "character": "Harmonium Player"
    },
    {
      "id": "nm2324824",
      "name": "Giacomo Sumner",
      "character": "Merchandise Guy"
    },
    {
      "id": "nm2198607",
      "name": "Lauren Milberger",
      "character": "Protester"
    },
    {
      "id": "nm7063373",
      "name": "Gil Porter",
      "character": "Yuppie"
    },
    {
      "id": "nm5055646",
      "name": "Charlotte Ubben",
      "character": "Nurse"
    },
    {
      "id": "nm6280465",
      "name": "Moore Theobald",
      "character": "Boy in Park"
    },
    {
      "id": "nm1622694",
      "name": "Eva Kaminsky",
      "character": "Soccer Mom"
    }
  ],
  "overview": "A sweeping multigenerational story set against the backdrop of the raw, roaring New York City of the late 1980s; adoption, teen pregnancy, drugs, hardcore punk rock, the unbridled optimism and reckless stupidity of the young—and old—are all major elements in this heart-aching tale of the son of diehard hippies and his strange odyssey through the extremes of late 20th century youth culture.",
  "storyline": "Follows three screwed up young people and their equally screwed up parents in the age of CBGB's, yuppies and the tinderbox of gentrification that exploded into the Tompkins Square Park Riots in New York's East Village in the 1980s.",
  "plot": "Sixteen-year-old Jude Keffy-Horn (Asa Butterfield) is living in Vermont with his adoptive mother Harriet (Julianne Nicholson) and adoptive sister Prudence (Nadia Alexander). In December 1987, Jude and his best friend, Teddy (Avan Jogia), spend their time doing drugs and dreaming about moving to New York City to escape their small home town. Jude’s permissive hippy father, Les (Ethan Hawke), lives in New York City where he grows and sells marijuana. Les' girlfriend Diane (Emily Mortimer) has a daughter Eliza (Hailee Steinfeld) who buses to Vermont for New Year's Eve.\n\nTeddy and Jude meet Eliza at the bus station and take her to a New Year's Eve party. Jude is beat up outside the party, while Teddy and Eliza talk and have sex in a locked bathroom after Eliza introduces Teddy to cocaine, which they both snort. When they part for the night, Teddy asks Eliza to find his Straight Edge brother Johnny in New York City and check on him since Johnny doesn't have a phone. Eliza heads back to NYC on the bus while Teddy and Jude head home, stopping to huff Freon. When Harriet awakens she finds Jude unconscious and Teddy dead and frozen after both of them pass out in the yard.\n\nEliza finds Teddy’s half-brother in Alphabet City, Johnny (Emile Hirsch), and discovers he is not only straight edge but also Krishna. She tells him to call home because Teddy is worried. When he calls, his drug addict mom answers and tells him about Teddy's death.\n\nEliza discovers she's pregnant with Teddy's baby, and when she tells Johnny and Jude, they decide to keep it a secret. Even though Johnny is a still closeted gay, he eventually proposes to Eliza out of guilt and loyalty to his deceased half-brother. They tell her mother that the baby is his and that they are going to be married. Since Eliza is under 18 and her mother refuses to sign for her to be legally married, the two have a marriage ceremony in the Hare Krishna temple.\n\nThey borrow Les' van and, because her mother is still against the pregnancy, take Eliza to stay with Harriet while Johnny's band goes on tour. Jude becomes the new guitar player when Rooster, the original guitar player (whom it is implied Johnny has had a secret relationship with) quits. They come back from tour, and Johnny goes back to New York City, leaving Eliza feeling abandoned. She also confides in Jude that she thinks Johnny may be in love with someone else. Jude, while on tour, overhearing a telephone call between Johnny and Rooster, realizes it is Rooster whom Johnny wants to be with. Realizing it is not his secret to tell, he does not tell Eliza but stops feeling guilty for being in love with her. After realizing they care for each other, Jude and Eliza start a relationship.\n\nJude and Eliza take a bus back to New York where they plan to raise the baby. They go to NY to confront Johnny. He reveals he's been in communication with Teddy's biological father, and that he wants the baby to be given to Teddy's father. Eliza is outraged feeling betrayed because she wants to raise the baby and runs out of the apartment into the middle of the Tompkins Square Park Riots, where she goes into labor. She wants Jude to hold her baby boy because she didn't want to hold it in front of a lot of people. As the film ends, Johnny throws Teddy’s ashes into the river with Rooster beside him, while Jude narrates from ten years later about how Eliza is in Brooklyn starting her own family and how he too is going to be a father. The closing shot is of Eliza and Teddy's now 10-year-old son happily playing in a park.",
  "synopsis": null
}