{
  "imdb_id": "tt3329062",
  "tmdb_id": "257133",
  "douban_id": null,
  "title": "Tien Chua (2013)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "Vietnam",
  "version": [
    {
      "runtime": "98 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.9,
  "director": [
    {
      "id": "nm1125750",
      "name": "Thien Do"
    }
  ],
  "writer": [
    {
      "id": "nm1125750",
      "name": "Thien Do",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm2555919",
      "name": "Nguyen Hau",
      "character": ""
    },
    {
      "id": "nm1836665",
      "name": "Jayvee Mai The Hiep",
      "character": "Chien"
    },
    {
      "id": "nm6084136",
      "name": "Phuong Anh Leu",
      "character": "Hien"
    },
    {
      "id": "nm4899968",
      "name": "Khuong Ngoc",
      "character": "Lucky Loc"
    },
    {
      "id": "nm4296367",
      "name": "Van Trang",
      "character": "Quyen"
    }
  ],
  "overview": "Businessman Lucky Loc has finally gained a respectable position in society. However, his winning streak comes to a sudden halt when he pays with \"funny money\" to an unsuspecting salesgirl, Quyen. Believing it to be his lucky charm, he's convinced giving away the bill caused his misfortune. At the same time, Quyen's fortune plummets and she blames the cursed \"funny money\" for it. When Lucky tries to retrieve the bill and Queyen holds it for ransom, Lucky must do his best to survive this increasingly materialistic world, while keeping his soul and sanity intact.",
  "storyline": "A man of dubious background, Lucky Loc has worked his way into respectable society as the owner of a company producing high-end ceremonial gifts to be burned as offerings to the dead. When his luck takes a sudden nosedive, he's convinced that it has to do with a torn money note which he slipped to a salesgirl at a flower shop, knowing local businesses don't accept damaged money. Believing that the same bill is his lucky charm, he scrambles to retrieve it from her. Complications arise when she decides to hold it for ransom. Set in Vietnam, Tien Chua is a social satire about a man struggling to survive the increasingly materialistic world with his soul and sanity intact, or at least partially intact.",
  "plot": null,
  "synopsis": null
}