{
  "imdb_id": "tt3317036",
  "tmdb_id": "272112",
  "douban_id": null,
  "title": "Revelation: The Bride, the Beast & Babylon (2013)",
  "genres": [
    "Documentary",
    "Drama",
    "Fantasy",
    "History",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm3762183",
      "name": "Wayne Leman"
    }
  ],
  "writer": [
    {
      "id": "nm3761961",
      "name": "Doug Batchelor",
      "description": "writer"
    },
    {
      "id": "nm3762337",
      "name": "Jonathan Gifford",
      "description": "co-writer"
    },
    {
      "id": "nm6070280",
      "name": "Wayne Leman",
      "description": "co-writer"
    }
  ],
  "cast": [
    {
      "id": "nm6976610",
      "name": "Alessandro Bianchi",
      "character": "Dr. Alan Parker       (voice)"
    },
    {
      "id": "nm6070284",
      "name": "Ami Garbi",
      "character": "John"
    },
    {
      "id": "nm6070277",
      "name": "Lynn Holmes",
      "character": "Babylon"
    },
    {
      "id": "nm6070282",
      "name": "Laura O'Brien",
      "character": "Bride"
    }
  ],
  "overview": "Going to the very heart of the Bible's most challenging Book, this one hour documentary decodes the visions of Revelation 12 and 17 for everyone to understand. Journeying from the birth of Christ through the Christian era, this amazing video pulls aside the veil of hidden history to reveal the rise of Babylon, the persecution of the bride of Christ, and the real-world identity of the beast.  Educational and inspiring, Revelation delivers the keys to understanding the epic conflict between Christ and Satan and what it means for your life today.",
  "storyline": "The World's Most Mysterious and Controversial Book is Now Unveiled! No other book in the Bible has been more misunderstood or misrepresented than Revelation. But now, that all changes with Revelation: The Bride, The Beast & Babylon! Going to the very heart of the Bible's most challenging book, this 90-minute documentary decodes the visions of Revelation 12 an 17 for everyone to understand. Journeying from the birth of Christ through the Christian era, this amazing video pulls aside the veil of hidden history to reveal the rise of Babylon, the persecution of the bride of Christ, and the real-world identity of the beast. Educational and inspiring, Revelation delivers the keys to understanding the epic conflict between Christ and Satan and what it means for life today.",
  "plot": null,
  "synopsis": null
}