{
  "imdb_id": "tt3313066",
  "tmdb_id": "253299",
  "douban_id": null,
  "title": "Coriolanus (2014)",
  "genres": [
    "Drama",
    "History",
    "War"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "192 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.9,
  "director": [
    {
      "id": "nm1229177",
      "name": "Tim Van Someren"
    }
  ],
  "writer": [
    {
      "id": "nm0000636",
      "name": "William Shakespeare",
      "description": "play"
    }
  ],
  "cast": [
    {
      "id": "nm1089991",
      "name": "Tom Hiddleston",
      "character": "Caius Martius Coriolanus"
    },
    {
      "id": "nm0309693",
      "name": "Mark Gatiss",
      "character": "Menenius"
    },
    {
      "id": "nm2301662",
      "name": "Hadley Fraser",
      "character": "Aufidius"
    },
    {
      "id": "nm0090236",
      "name": "Jacqueline Boatswain",
      "character": "Valeria"
    },
    {
      "id": "nm7509185",
      "name": "Sebastian Croft",
      "character": "Young Martius"
    },
    {
      "id": "nm0208937",
      "name": "Peter De Jersey",
      "character": "Cominius"
    },
    {
      "id": "nm0257917",
      "name": "Alfred Enoch",
      "character": "Titus Lartius"
    },
    {
      "id": "nm0277525",
      "name": "Deborah Findlay",
      "character": "Volumnia"
    },
    {
      "id": "nm0505404",
      "name": "Elliot Levey",
      "character": "Brutus"
    },
    {
      "id": "nm4139073",
      "name": "Lucy Osborne",
      "character": "Herself - Set and Costume designer"
    },
    {
      "id": "nm6066050",
      "name": "Josie Rourke",
      "character": "Herself - Director"
    },
    {
      "id": "nm5878360",
      "name": "Rochenda Sandall",
      "character": "Emsemble"
    },
    {
      "id": "nm0772255",
      "name": "Helen Schlesinger",
      "character": "Sicinia"
    },
    {
      "id": "nm4440305",
      "name": "Mark Stanley",
      "character": "Volscian Lieutenant"
    },
    {
      "id": "nm2171898",
      "name": "Birgitte Hjort Sørensen",
      "character": "Virgilia"
    },
    {
      "id": "nm3614870",
      "name": "Dwane Walcott",
      "character": "Ensemble"
    }
  ],
  "overview": "National Theatre Live will broadcast the Donmar Warehouse’s production of Coriolanus, Shakespeare’s searing tragedy of political manipulation and revenge, with Tom Hiddleston (The Avengers, War Horse (film), BBC's The Hollow Crown) in the title role and Mark Gatiss (Season's  Greetings at the National Theatre, BBC's Sherlock) as Menenius, directed by the Donmar's Artistic Director Josie Rourke.  When an old adversary threatens Rome, the city calls once more on her hero and defender: Coriolanus. But he has enemies at home too. Famine threatens the city, the citizens’ hunger swells to an appetite for change, and on returning from the field Coriolanus must confront the march of realpolitik and the voice of an angry people.",
  "storyline": "Caius Martius Coriolanus is a war hero, banished from his home, seeking to come back.",
  "plot": "In a contemporary day alternate version of Rome, riots are in progress after stores of grain are withheld from citizens and civil liberties are reduced due to a war between Rome and neighbouring Volsci. The rioters are particularly angry at Caius Martius (Ralph Fiennes), a brilliant Roman general whom they blame for the city's problems. During a march, the rioters encounter Martius, who is openly contemptuous and does not hide his low opinion of the regular citizens. The commander of the Volscian army, Tullus Aufidius (Gerard Butler), who has fought Martius on several occasions and considers him a mortal enemy, swears that the next time they meet in battle will be the last. Martius leads a raid against the Volscian city of Corioles and during the siege, with much of Martius's unit being killed, Martius gathers reinforcements and the Romans take the city. After the battle, Martius and Aufidius meet in single combat, which results in both men being wounded but ends when Aufidius' soldiers drag him away from the fight.\n\nMartius returns to Rome victorious and in recognition of his great courage, General Cominius (John Kani) gives him the agnomen of \"Coriolanus\". Coriolanus's mother Volumnia (Vanessa Redgrave) encourages her son to run for consul within the Roman Senate. Coriolanus is reluctant but he eventually agrees to his mother's wishes. He easily wins the Roman Senate and seems at first to have won over the commoners as well due to his military victories. Two tribunes, Brutus (Paul Jesson) and Sicinius (James Nesbitt), are critical of his entrance into politics, fearing that his popularity would lead to Coriolanus taking power away from the Senate for himself. They scheme to undo Coriolanus and so stir up another riot in opposition to him becoming consul. When they call Coriolanus a traitor, Coriolanus bursts into rage and openly attacks the concept of popular rule as well as the citizens of Rome, demonstrating that he still holds the plebeians in contempt. He compares allowing citizens to have power over the senators as to allowing \"crows to peck the eagles\". The tribunes term Coriolanus a traitor for his words and order him banished. Coriolanus retorts that it is he who will banish Rome from his presence: \"There is a world elsewhere\".\n\nAfter being exiled from Rome, Coriolanus seeks out Aufidius in the Volscian capital of Antium and offers to let Aufidius kill him, to spite the country that banished him. Moved by his plight and honoured to fight alongside the great general, Aufidius and his superiors embrace Coriolanus and allow him to lead a new assault on the city, so that he can claim vengeance on the city which he feels betrayed him. Coriolanus and Aufidius lead a Voscilian attack on Rome. Panicked, Rome sends General Titus to persuade Coriolanus to halt his crusade for vengeance; when Titus reports his failure, Senator Menenius (Brian Cox) follows but is also shunned. In response, Menenius, who has seemingly lost all hope in Coriolanus and Rome, commits suicide by a river bank. Finally, Volumnia is sent to meet with her son, along with Coriolanus' wife Virgilia (Jessica Chastain) and his son. Volumnia succeeds in dissuading her son from destroying Rome and Coriolanus makes peace between the Volscians and the Romans alongside General Cominius. When Coriolanus returns to the Volscian border, he is confronted by Aufidius and his men, who now also brand him as a traitor. They call him Martius and refuse to call him by his \"stolen name\" of Coriolanus. Aufidius explains to Coriolanus how he put aside his hatred so that they could conquer Rome but now that Coriolanus has prevented this, he has betrayed the promise between them. For this betrayal, Aufidius and his men attack and kill Coriolanus.",
  "synopsis": "When an old adversary threatens Rome, the city calls once more on her hero and defender: Coriolanus. But famine threatens the city, the citizens hunger swells to an appetite for change, and on returning from the field Coriolanus must confront the march of realpolitik and the voice of an angry people.Josie Rourke directs Shakespeares searing tragedy of political manipulation and revenge, with Tom Hiddleston making his return to the Donmar in the title role.-Taken from the Donmar's website."
}