{
  "imdb_id": "tt3352390",
  "tmdb_id": "368031",
  "douban_id": "26373527",
  "title": "Friend Request (2016)",
  "genres": [
    "Horror",
    "Thriller"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "92 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.4,
  "director": [
    {
      "id": "nm0894207",
      "name": "Simon Verhoeven"
    }
  ],
  "writer": [
    {
      "id": "nm0050722",
      "name": "Matthew Ballen",
      "description": "written by &"
    },
    {
      "id": "nm2279441",
      "name": "Philip Koch",
      "description": "written by &"
    },
    {
      "id": "nm0894207",
      "name": "Simon Verhoeven",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm1486317",
      "name": "Alycia Debnam-Carey",
      "character": "Laura"
    },
    {
      "id": "nm0608440",
      "name": "William Moseley",
      "character": "Tyler"
    },
    {
      "id": "nm1269733",
      "name": "Connor Paolo",
      "character": "Kobe"
    },
    {
      "id": "nm2694584",
      "name": "Brit Morgan",
      "character": "Olivia"
    },
    {
      "id": "nm6964082",
      "name": "Brooke Markham",
      "character": "Isabel"
    },
    {
      "id": "nm0549826",
      "name": "Sean Marquette",
      "character": "Gustavo"
    },
    {
      "id": "nm5553616",
      "name": "Liesl Ahlers",
      "character": "Marina"
    },
    {
      "id": "nm0356101",
      "name": "Shashawnee Hall",
      "character": "Det. Cameron"
    },
    {
      "id": "nm0199447",
      "name": "Susan Danford",
      "character": "Caroline"
    },
    {
      "id": "nm5953245",
      "name": "Lee Raviv",
      "character": "Marina (child)"
    },
    {
      "id": "nm2322286",
      "name": "Nicholas Pauling",
      "character": "Second Officer Dempsey"
    },
    {
      "id": "nm0124880",
      "name": "David Butler",
      "character": "Dr. Markham"
    },
    {
      "id": "nm6964087",
      "name": "Julian Katz",
      "character": "Bully 1"
    },
    {
      "id": "nm6964088",
      "name": "Kiano Janse van Rensburg",
      "character": "Bully 2"
    },
    {
      "id": "nm0332366",
      "name": "Dorothy Ann Gould",
      "character": "Elizabeth Palmer"
    },
    {
      "id": "nm0823216",
      "name": "Kimberleigh Stark",
      "character": "Dean Richards       (as Kimberley Stark)"
    },
    {
      "id": "nm6964089",
      "name": "Wendy Acton Burnell",
      "character": "Tattooed Girl"
    },
    {
      "id": "nm6964086",
      "name": "Julie Summers",
      "character": "Mother Isabel"
    },
    {
      "id": "nm7973179",
      "name": "Nevena Jablanovic",
      "character": "Jogging Girl (Katie)"
    },
    {
      "id": "nm2415533",
      "name": "Jay Anstey",
      "character": "Girl 1"
    },
    {
      "id": "nm0050722",
      "name": "Matthew Ballen",
      "character": "Tired Clerk"
    },
    {
      "id": "nm5339570",
      "name": "Carolyn Forward",
      "character": "Girl 2"
    },
    {
      "id": "nm0208911",
      "name": "Owen De Jager",
      "character": "Janitor"
    },
    {
      "id": "nm8451491",
      "name": "Bill Russell",
      "character": "Cab Driver"
    },
    {
      "id": "nm1541997",
      "name": "Deirdre Wolhuter",
      "character": "Ada Nedifar       (as Deirdre Wohlhuter)"
    },
    {
      "id": "nm1854537",
      "name": "Leon Clingman",
      "character": "Doctor"
    },
    {
      "id": "nm6931901",
      "name": "Roxanne Kalie",
      "character": "Girl 3"
    },
    {
      "id": "nm5019939",
      "name": "Lauren Steyn",
      "character": "Teacher"
    },
    {
      "id": "nm8082114",
      "name": "Chloe Hirschman",
      "character": "Core Group Girl 2"
    },
    {
      "id": "nm8451492",
      "name": "Michelle Nothnagel",
      "character": "Core Group Girl 3"
    }
  ],
  "overview": "Enjoying college life as a popular student, Laura shares everything with her more  than 800 friends on Facebook. But one day, after accepting a friend request from a  social outcast named Marina, Laura’s life is cursed...",
  "storyline": "Popular college student Laura (Alycia Debnam-Carey) has tons of friends, both on Facebook and IRL. She graciously accepts social outcast Marina's (Liesl Ahlers) online friend request, until Marina crosses the line and Laura unfriends her. To everyone's shock, Marina takes her own life in a ritual meant to torment Laura, which appears in a video posted on Laura's profile. Even though it wasn't Laura who posted the video, or other creepy content that begins appearing on her page, her Facebook friend count begins to dwindle as a result. When her real-life friends start dying mysterious, cruel deaths, Laura must figure out how to break the deadly curse before it's too late.",
  "plot": "Laura (Alycia Debnam-Carey) is one of the most popular students at her college and enjoys an active social life with many friends and family members. She is active on social networks and has over 800 friends on Facebook. She lives with three friends, Olivia (Brit Morgan), Isabel (Brooke Markham) and Gustavo (Sean Marquette). She is also close friends with Kobe (Connor Paolo) and is dating Tyler (William Moseley). Laura receives a friend request from a student at her campus, Marina. Seeing her talents in animation, she accepts the request and begins a friendship with the lonely girl. However she soon notices that Marina's Facebook profile is plastered in bizarre and disturbing images and her obsessive behavior begins to make Laura feel uncomfortable. When Laura shares pictures of herself at her birthday dinner – to which Marina was not invited – Marina publicly and angrily confronts her at her college campus. During the quarrel, Laura accidentally pushes Marina and her hood falls off, revealing Marina's hairless head, and she runs away. Marina tries to apologize to Laura who unfriends her on Facebook. Seeing her number of friends once again down to zero, she angrily closes her laptop. That night, Marina records her suicide with her webcam, which automatically uploads the footage to social media.\n\nThe next morning, Laura receives a message from Marina containing the video of her suicide. Later on, it is posted to her Facebook page. Laura is unable to remove the video, and her friend count drops. Left with no choice, she tries to delete her account, but an unknown error occurs. When Kobe and Laura investigate Marina's Facebook page, they realize that the source code where it has been written in is not the normal code.\n\nThat night, Marina adds Gustavo as a friend and posts a distorted picture of his face. He is then terrorized by a spirit, while seeing things that were posted on Marina's page. He is soon killed by a swarm of wasps. The spirit begins killing Laura's friends one by one, posting videos of each friend's death on Laura's Facebook page. Unable to delete the videos or deactivate her account, Laura's Facebook friend count continues to drop. Soon after, Laura finds that she is being stalked by Marina's vengeful spirit, who promises to make her \"lonely\".\n\nLaura hunts down the place where Marina committed suicide in order to destroy the black mirror that turned Marina into an evil spirit. She and Kobe go to Marina's house which was burnt down and attempt to look for her. While there, Kobe sees an ethereal entity come out of the basement, but is saved when Laura bumps into him. She tells him that Marina is not there, but he suggests that they look in the basement.\n\nMarina is not found in the basement, but while searching, Kobe is separated from Laura. She finds him staring into a black mirror. When she turns him around and asks what's wrong, he apologizes and says, 'You can't be lonely if you're dead.' He then stabs her, hoping to kill her in order to save himself and Tyler. However, Laura overpowers him and manages to escape. She then realizes through one of Marina's posts that Marina committed suicide in one of the nearby factories.\n\nMeanwhile, Tyler finds a deranged Kobe looking for Laura. After getting a call, he and Kobe head to the factories as well. Once getting to the factories Laura starts looking for Marina's body. She receives a video call from her mother, who informs that she's been seeing Marina too, and is last seen walking away with a knife in her hand. Laura, seeing everyone she's loved being taken away, cries. Tyler soon finds her, only to get stabbed in the throat by Kobe. Laura escapes Kobe once again but reaches a dead end. However, before Kobe could kill Laura, Marina's wasps start attacking Kobe, killing him.\n\nLaura, feeling dazed, sees an apparition of a seven-year-old Marina. Marina leads Laura to her body and her laptop which transports Laura into one of Marina's earlier posts. Laura is then attacked by Marina.\n\nSome time has passed and there are a fresh batch of students. Laura is seen looking at some girls in the same way that Marina saw Laura and her friends. Laura then faces her computer (previously Marina's computer), is shown to have zero friends, just like Marina before she met Laura. Then her new account &#160;– which shares the same dark and grotesque images as Marina's old account&#160;–  is revealed. She then faces the camera and her eyes turn from green to blue, revealing that Laura has been possessed by the spirit of Marina.",
  "synopsis": "The movie starts in a college psychology classroom. As the students are gathering in their seats, the professor announces to them that one of their classmates, Marina Mills (Liesl Ahlers), has committed suicide over the weekend. All the students are stunned, but most disturbed is a girl named Laura Woodson (Alycia Debnam-Carey).Two weeks earlier.Laura was a normal popular college girl, living with her best friends Olivia (Brit Morgan), Izzy (Brooke Markham), and Gustavo (Sean Marquette). Her boyfriend is Tyler (William Moseley). Laura is also very active on social media, having over 800 friends on Facebook. During lunch, she catches Marina's attention, and she later sends Laura a friend request. Laura sees that Marina has 0 friends on Facebook. However, she finds Marina's drawings and video animations to be intriguing, so she starts to casually hang out with Marina at school.Soon, Marina grows obsessive toward Laura, even photo-shopping herself into one of Laura's selfies. The drawings on her page also get freakier with gruesome and haunting images involving wasps and darkness. Marina sends Laura multiple messages, which start to make her uncomfortable.On Laura's birthday, Marina tries to invite herself to hang out with Laura, to which Olivia and Izzy object to. Laura tells Marina that she's only going out to dinner with Tyler. She ends up at a surprise dinner with all her friends, who take pictures and tag her in them on Facebook. Marina sees them and she gets upset.The next day, Marina angrily confronts Laura in the cafeteria. She even claims to have made her a birthday present that she was working on for two weeks (despite only meeting her around that time). Laura tries to calm Marina down, only for the girl to try and physically attack Laura. She shoves Marina in defense and makes her hood fall back, revealing a burnt bald spot on her head. Marina runs away.That night, Marina desperately tries to apologize to Laura for how she acted. Having had enough, Laura unfriends Marina. After seeing this, Marina hangs herself while setting the place on fire.After Marina's suicide is reported, Laura sees a video of the incident, in which Marina holds her present to Laura (a drawing of Laura) to the camera before crumpling it and hanging/flaming herself. The video uploads itself to Laura's profile, and she is unable to delete it. This causes others to unfriend her. She is even unable to delete her account. Laura asks her friend Kobe (Connor Paolo) for help in undoing the video. When they try looking into it, they see that the code on the video is not like any normal code for other videos.Izzy calls Gustavo (they're dating) as she returns to their dorm. Gustavo then has Marina added to his friends list on Facebook. He sees some freaky imagery on his computer before it shuts off and leaves the screen with his still reflection, even when he's not looking at it. Gustavo then walks into the hallway and sees nothing but what appear to be two young boys with horribly disfigured faces. He runs into the elevator, which goes dark. He takes out a lighter and sees a hand reach for him. Izzy arrives and sees the elevator doors open, revealing Gustavo in a possessed state smashing his head against the walls until he drops dead.Gustavo's friends mourn him, but the elevator footage of his death appears on Laura's Facebook page, leading more people to consider her sick and unfriend her, no matter how much she tries to delete it. Even Izzy, who's been hospitalized due to the shock of seeing her boyfriend die, doesn't want anything to do with Laura. When Laura tries to post a message saying she's not posting the videos, Marina's spirit writes \"u will know what it feels like to be lonely :)\".Laura and Kobe track down Marina's birth records and find out the boarding school where she originally grew up. They visit the place, and Laura learns from the headmistress that Marina was brought there as a child after her mother perished in a fire. She gave birth to Marina right before she died. During her time at the school, Marina was picked on by two boys, both of whom were later found dead with their faces mutilated from wasp stings (the same boys Gustavo saw).Meanwhile, Marina adds Izzy on Facebook. Izzy leaves her room under the illusion that she is alone and wandering around helplessly. She is then trapped in a room by Marina, who possesses Izzy and makes her tear out her hair before slitting her throat.When Laura and Kobe drive back, they accidentally hit Olivia with their car, as she has come under Marina's possession as well and was led to the car's path. In the hospital, Olivia is possessed again when she attacks a detective and takes his gun, which she uses to blow her brains out.Laura and Kobe determine that Marina performed a ritual by staring into a black mirror (her laptop screen) and has been using her spirit to get revenge on Laura. They find out where she previously lived and head to the burnt-down house to find the laptop and destroy it. However, Kobe ends up getting possessed by Marina. He stabs Laura when he figures the hauntings will stop if she's dead. She overpowers Kobe and escapes him.Tyler drives out to the town to find a now manic Kobe trying to find Laura. Unbeknownst to them, she has taken a cab to a factory where she figures Marina killed herself. Laura then gets into a video chat with her mother, who also gets possessed by Marina. She takes a knife to kill herself (off-screen) while Laura is helpless to do anything.Tyler finds Laura, but he is quickly stabbed through the throat by Kobe. He chases after Laura but then gets stung to death by Marina's swarm of wasps. Growing tired, Laura sees an apparition of a young Marina, saying she only wanted to be her best friend. When Laura finds Marina's body and laptop, she is taken into one of her creepy posts, specifically a dark forest. When Laura turns around, Marina's spirit lunges at her.Some time later, Laura is back in school, but with absolutely no friends. She looks upon another group of girls the way Marina looked at her. She looks on her Facebook profile, which has the picture of her and Marina. In the final chilling shot, Laura looks at the audience with dead eyes, indicating Marina has now taken over her body and has doomed her to a life of loneliness."
}