{
  "imdb_id": "tt3341582",
  "tmdb_id": "284729",
  "douban_id": null,
  "title": "Killa (2014)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "107 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.1,
  "director": [
    {
      "id": "nm4075058",
      "name": "Avinash Arun"
    }
  ],
  "writer": [
    {
      "id": "nm5904510",
      "name": "Tushar Paranjape",
      "description": "screenplay"
    },
    {
      "id": "nm5904510",
      "name": "Tushar Paranjape",
      "description": "story"
    },
    {
      "id": "nm3179723",
      "name": "Upendra Sidhaye",
      "description": "dialogue"
    }
  ],
  "cast": [
    {
      "id": "nm1576284",
      "name": "Amruta Subhash",
      "character": "Aruna"
    },
    {
      "id": "nm6096005",
      "name": "Archit Deodhar",
      "character": "Chinu"
    },
    {
      "id": "nm4778779",
      "name": "Parth Bhalerao",
      "character": "Bandya"
    },
    {
      "id": "nm6439302",
      "name": "Gaurish Gawade",
      "character": "Yuvraj"
    },
    {
      "id": "nm6439303",
      "name": "Atharva Upasni",
      "character": "Omkar"
    },
    {
      "id": "nm6439304",
      "name": "Swandand Raikar",
      "character": "Umesh"
    },
    {
      "id": "nm3014046",
      "name": "Shrikant Yadav",
      "character": "Mr. Nivte"
    },
    {
      "id": "nm4434111",
      "name": "Umesh Jagtap",
      "character": "Fisherman (Koli)"
    },
    {
      "id": "nm6439305",
      "name": "Shivalati Bokil",
      "character": "Damle Aaji"
    },
    {
      "id": "nm6474791",
      "name": "Jui Kahate",
      "character": "Swarali"
    },
    {
      "id": "nm5732876",
      "name": "Devendra Gaikwad",
      "character": "Yewale"
    },
    {
      "id": "nm6439307",
      "name": "Bala Kadam",
      "character": "Gawankar"
    },
    {
      "id": "nm6439308",
      "name": "Makrand Saptarishi",
      "character": "Tehsildar"
    },
    {
      "id": "nm4778747",
      "name": "Suraj Satav",
      "character": "Registrar"
    },
    {
      "id": "nm0694900",
      "name": "Savita Prabhune",
      "character": "Mrs. Nivte"
    },
    {
      "id": "nm6439309",
      "name": "Roma Devadhar",
      "character": "Mr. Nivte's Daughter"
    },
    {
      "id": "nm6439310",
      "name": "Anjali Dharu",
      "character": "Class Teacher"
    },
    {
      "id": "nm3720865",
      "name": "Suhas Sirsat",
      "character": "Mathematics Teacher"
    },
    {
      "id": "nm3936755",
      "name": "Dinesh Mapari",
      "character": "Guide at Light House"
    },
    {
      "id": "nm10570602",
      "name": "Ishant Kalunjkar",
      "character": "Prakash Kunte"
    },
    {
      "id": "nm10570603",
      "name": "Vasant Jhangli",
      "character": "Coconut Peeler"
    },
    {
      "id": "nm10570604",
      "name": "Dweep Kachrekar",
      "character": "Kid in Backyard"
    }
  ],
  "overview": "Chinu is having a hard time settling into his new home in the countyside. He and his mother have relocated there from the big city following his father’s death. Chinu is called upon to find his feet; in doing so he distances himself from his mother who is also struggling to cope with the new situation. Both make a terrible mistake – and are forced to realise that they are alone. Perhaps what they both need is another new beginning. (Berlinale)",
  "storyline": "An 11-year-old moves to a small town because of his mother's job transfer. Initially he faces challenges adjusting this place, soon he get to know his classmates who becomes friends to him. He starts enjoying small moments with his friends. Once from school all gang decides to go for a cycle race. All of them reach to a 'Killa' and while exploring 'killa' Chinmay is left behind, sudden rains hit the place and all other friends leave him back there. he searches entire 'killa' for them and returns home very disappointed that no one cares for him. Same time his mom is faces some challenges at work which she is not able to express to Chinmay. Chinmay is also unhappy asking her mom to leave this place and go back to Pune where they came from. Then some point down the line he realizes that those friends cared about him, also how his mom is trying hard to handle all pressures and this little boy.",
  "plot": null,
  "synopsis": "Set in a small coastal town in Konkan, the film is intimately interwoven with forests, animals, a lake and the\nsea. These essential elements become the stage on which young Chinu struggles for acceptance and identity when his mother, who works in a government office gets transferred from a bigger town to a village. His father has recently died and the two are on their own in a small house. Far from his settled world Chinu has a lot on his plate. Local lads seem like unruly delinquents to him when he first encounters them trying to set fire to a puppy. Chinu passes Yuvraj some answers in math class, and gains a friend. His mother, meanwhile, has her own conflicts to face in the local corrupt bureaucracy when shes strong-armed into helping a local building contractor get a project through without bank approval. Far from her family she has her set of struggles and worries about her son.The climax comes early on, in a genuinely spooky scene in the ruins of a British fort, where Chinu undergoes an ordeal that becomes a rite of passage."
}