{
  "imdb_id": "tt3332064",
  "tmdb_id": "266647",
  "douban_id": "25772639",
  "title": "Pan (2015)",
  "genres": [
    "Adventure",
    "Comedy",
    "Family",
    "Fantasy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "111 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm0942504",
      "name": "Joe Wright"
    }
  ],
  "writer": [
    {
      "id": "nm0297229",
      "name": "Jason Fuchs",
      "description": "written by"
    },
    {
      "id": "nm0057381",
      "name": "J.M. Barrie",
      "description": "characters"
    }
  ],
  "cast": [
    {
      "id": "nm0413168",
      "name": "Hugh Jackman",
      "character": "Blackbeard"
    },
    {
      "id": "nm5920962",
      "name": "Levi Miller",
      "character": "Peter"
    },
    {
      "id": "nm1330560",
      "name": "Garrett Hedlund",
      "character": "Hook"
    },
    {
      "id": "nm1913734",
      "name": "Rooney Mara",
      "character": "Tiger Lily"
    },
    {
      "id": "nm2253821",
      "name": "Adeel Akhtar",
      "character": "Sam Smiegel"
    },
    {
      "id": "nm1996829",
      "name": "Nonso Anozie",
      "character": "Bishop"
    },
    {
      "id": "nm1086543",
      "name": "Amanda Seyfried",
      "character": "Mary"
    },
    {
      "id": "nm0121755",
      "name": "Kathy Burke",
      "character": "Mother Barnabas"
    },
    {
      "id": "nm6484968",
      "name": "Lewis MacDougall",
      "character": "Nibs"
    },
    {
      "id": "nm5353321",
      "name": "Cara Delevingne",
      "character": "Mermaids"
    },
    {
      "id": "nm5173289",
      "name": "Tae-joo Na",
      "character": "Kwahu"
    },
    {
      "id": "nm0153048",
      "name": "Jack Charles",
      "character": "Chief"
    },
    {
      "id": "nm0916037",
      "name": "Bronson Webb",
      "character": "Steps"
    },
    {
      "id": "nm4054611",
      "name": "Mike Shepherd",
      "character": "Fernley Trebilcock"
    },
    {
      "id": "nm0100598",
      "name": "Brian Bovell",
      "character": "Long John Standing"
    },
    {
      "id": "nm5339326",
      "name": "Kurt Egyiawan",
      "character": "Murray"
    },
    {
      "id": "nm1835544",
      "name": "Jimmy Vee",
      "character": "Lofty"
    },
    {
      "id": "nm1624261",
      "name": "Paul Hunter",
      "character": "Daisy"
    },
    {
      "id": "nm1872855",
      "name": "Spencer Wilding",
      "character": "Growler"
    },
    {
      "id": "nm4000354",
      "name": "Dean Nolan",
      "character": "Peanut"
    },
    {
      "id": "nm4727217",
      "name": "Giacomo Mancini",
      "character": "Michelangelo"
    },
    {
      "id": "nm0068430",
      "name": "Neil Bell",
      "character": "Baggy"
    },
    {
      "id": "nm4969843",
      "name": "Phill Martin",
      "character": "Goliath"
    },
    {
      "id": "nm2534095",
      "name": "Gabriel Andreu",
      "character": "Matador"
    },
    {
      "id": "nm0752730",
      "name": "Michael Ryan",
      "character": "Silverman"
    },
    {
      "id": "nm4784329",
      "name": "Kavern Batchelor",
      "character": "Skinny Orphan"
    },
    {
      "id": "nm7617904",
      "name": "Orlando Loo Alfred",
      "character": "Yung"
    },
    {
      "id": "nm3615400",
      "name": "Ami Metcalf",
      "character": "Sister Thomas"
    },
    {
      "id": "nm1054648",
      "name": "Amanda Lawrence",
      "character": "Sister Joseph"
    },
    {
      "id": "nm2891780",
      "name": "Tunji Lucas",
      "character": "Tribesman 1"
    },
    {
      "id": "nm6876626",
      "name": "Tomislav English",
      "character": "Tribesman 2"
    },
    {
      "id": "nm1394398",
      "name": "Aaron Monaghan",
      "character": "Robbins"
    },
    {
      "id": "nm2193504",
      "name": "Emerald Fennell",
      "character": "Commander"
    },
    {
      "id": "nm1632762",
      "name": "Amy Morgan",
      "character": "Operator"
    },
    {
      "id": "nm1640779",
      "name": "Harry Lister Smith",
      "character": "Pilot Parker"
    },
    {
      "id": "nm6235008",
      "name": "Nicholas Agnew",
      "character": "Pilot Primrose"
    },
    {
      "id": "nm0307097",
      "name": "Salo Gardner",
      "character": "Older Blackbeard"
    },
    {
      "id": "nm1820980",
      "name": "Jamie Beamish",
      "character": "Not-Dobkins"
    },
    {
      "id": "nm2480113",
      "name": "Tony Allen",
      "character": "Tony Allen"
    },
    {
      "id": "nm6576090",
      "name": "Zak Holland",
      "character": "Miner 12"
    }
  ],
  "overview": "Living a bleak existence at a London orphanage, 12-year-old Peter finds himself whisked away to the fantastical world of Neverland. Adventure awaits as he meets new friend James Hook and the warrior Tiger Lily. They must band together to save Neverland from the ruthless pirate Blackbeard. Along the way, the rebellious and mischievous boy discovers his true destiny, becoming the hero forever known as Peter Pan.",
  "storyline": "An orphan boy (Levi Miller) discovers his destiny as Peter Pan in this vividly realized fantasy, and is whisked away to an enchanted land to battle the fearsome pirate Blackbeard (Hugh Jackman) with the help of the warrior woman Tiger Lily (Rooney Mara)..",
  "plot": "This section's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (May 2016) (Learn how and when to remove this template message)\nNew-born Peter (Levi Miller) is left by his mother Mary (Amanda Seyfried) on the steps of an orphanage in London, an establishment under the care of Mother Barnabas (Kathy Burke). Several years later, during World War II, upon learning that Mother Barnabas is hoarding food for herself, Peter and his best friend Nibs (Lewis MacDougall) try to steal it to distribute amongst themselves and the other orphans but they are caught. In the process, Peter finds a letter written by his mother, declaring her love and assuring Peter they will meet again \"in this world or another\".\n\nIn retaliation for the boys' mischief, Mother Barnabas summons pirates who kidnap Peter, Nibs and several others. Nibs manages to escape but Peter does not. He is captured and taken aboard a flying pirate ship. Following an aerial battle with several Spitfires the ship takes Peter to Neverland, a magical realm beyond space and time, where he is forced to become a slave laborer and mine for Pixum (crystallized Fairy Dust) on behalf of the terrible pirate Blackbeard (Hugh Jackman) who uses it to prevent himself from aging. Peter befriends another miner, named James Hook (Garrett Hedlund). After insulting Blackbeard's men, Peter is forced to walk the plank over the deep mine, but survives by flying. Blackbeard then tells Peter about an old prophecy that a boy who could fly would one day kill him, but Peter refuses to believe he is that boy.\n\nPeter joins Hook and his accomplice, Sam \"Smee\" Smiegel (Adeel Akhtar), stealing one of Blackbeard's flying ships and escaping into the forest. There they are found by the native chief's daughter Tiger Lily (Rooney Mara) and nearly executed but when the natives Chief Great Little Panther (Jack Charles) notices Peter's pan flute pendant, left to him by Mary, and said to belong to their people's greatest hero, the legendary Pan. With the Memory Tree, Tiger Lily tells Peter that many years ago when the natives and the fairies united to fight together against the pirates, the Fairy Prince and the love of Blackbeard's life, Mary fell in love but when Blackbeard discovered them, the Prince took human form to rescue Mary. But as fairies could only live in the form of a human for one day, the Prince sacrificed his life for Mary. Mary was then forced to hide their newborn son Peter in the other world and seek shelter in the Fairy Kingdom when she and the fairies had to retreat. As part of his heritage, Peter has the ability to fly, but is unable to do so because of his lack of faith.\n\nFearful of Blackbeard's punishment, Smee betrays the natives' location to him, and in the ensuing battle, Chief Great Little Panther is murdered by Blackbeard, who also reveals that he killed Peter's mother. Peter is hurt to learn that Tiger Lily had lied to Peter, telling him his mother is alive but she explains that he would have walked away from his destiny if he knew the truth.\n\nPeter, Hook, and Tiger Lily escape in a raft and head to the Fairy Kingdom to enlist their help in defeating the pirates. Along the way, Peter falls into the river and is nearly eaten by giant crocodiles before being rescued by the mermaids, after which he has a vision of Blackbeard accidentally killing Mary as she defended the Fairy Kingdom from his offensive. Despondent over their chances, Hook leaves while Peter and Tiger Lily arrive at the Fairy Kingdom only to be ambushed by Blackbeard who plans to use the fairies vast amount of Pixum to live forever. Blackbeard takes Peter's pan flute pendant, which is the key to the fairy kingdom, opens their gates and launches an attack.\n\nPeter escapes and befriends one of the fairies, named Tinker Bell. Together, they rally the fairies to fight the pirates while Tiger Lily duels Blackbeard. Hook returns on the stolen ship and fights Blackbeard's right-hand man Bishop (Nonso Anozie) until the ship tips over, sending both falling to their deaths. Peter conquers his fears and flies to save Hook, while Blackbeard and his men are overpowered by the fairies. Forced into an abyss, they subsequently fall to their deaths. Smee is the sole survivor having fled during the battle. Peter then sees a vision of Mary, who reaffirms him to be Neverland's savior, Peter Pan. Shortly afterwards, Peter and Hook, now the captain of the Jolly Roger, return to London to rescue Nibs and the other orphans, who become part of Peter's crew, the Lost Boys. In the final scene, Peter and Hook reaffirm their friendship, certain that nothing will ever go wrong between them.",
  "synopsis": "In the opening scene, a young woman named Mary (Amanda Seyfried) brings her baby to the steps of the Lambert Home For Boys in London. She leaves the boy with a note and a necklace of a pan flute. Mary kisses her baby, Peter, and tells him she loves him before leaving.12 years later.Peter (Levi Miller) is still living at the Lambert Home, and he has only one friend, Nibs (Lewis MacDougall). Their time is made miserable by the cruel nun Mother Barnabas (Kathy Burke). Peter figures out that Barnabas is hoarding extra food for herself, so he and Nibs break into her office and uncover her stash of extra food and coins. The boys go into her private records and find Peter's file, which contains a letter from Mary that reaffirms her love for her son and says they will see each other again, in this world or another.While the boys sleep at night, some are snatched up into the air by men coming down on tethers. They were summoned by Barnabas, who raised a pirate flag at the top of the orphanage. Peter sees Nibs being grabbed, so he runs to save his friend. Peter ends up being taken after Barnabas kicks him into the path of one of the pirates. The boys are out on the ship, but Nibs jumps off and lands on the roof. As the ship flies toward the sky, Royal Army planes fly after the ship and shoot at it. The planes retreat once the ship rises above the clouds.Peter ties himself to the ship to keep from falling out. He floats through space and touches Saturn before getting yanked back to the ship. It flies all the way to Neverland. There, the boys are brought before a large quarry where the workers are singing \"Smells Like Teen Spirit\". Atop another floating ship emerges the dreaded pirate Blackbeard (Hugh Jackman). He tells the boys they are digging for fairy dust in the mines.While working, Peter meets James Hook (Garrett Hedlund), an older man and fellow slave worker that's been there as long as he can remember, and that's why he's grumpy and disillusioned. Peter then finds a rock of fairy dust that an older man swipes from him. Peter argues with the man and insults his cohorts, leading to Blackbeard making Peter walk the plank along with two other boys that misbehaved. Blackbeard kicks Peter off the plank, but as he falls, Peter suddenly starts flying, to everyone's surprise, until he drops to the ground.Peter wakes up in a room in Blackbeard's ship. The pirate walks in and tells Peter of a prophet that states that a boy who can fly will fight Blackbeard and kill him. Peter says he doesn't believe in bedtime stories.Hook gets Peter and his accomplice Mr. Smee (Adeel Akhtar) to escape and try to make their way to one of Blackbeard's boats, on the condition that Hook helps Peter find his mother. They ride a cart up to the floating boats, only to get pulled back by Blackbeard's right hand man Bishop (Nonso Anozie). Peter cuts the wire and sends himself, Hook, and Smee toward one of the boats.The three ride the boat into the forest to find the natives. They are caught by a group of the natives, led by Princess Tiger Lily (Rooney Mara). Hook and Smee are almost executed until the Chief (Jack Charles) notices the pan flute around Peter's neck. Because the pan is the symbol of their tribe, the natives bow to Peter. Tiger Lily explains to Peter that his mother fell in love with the fairy prince, which made Blackbeard jealous, though it also means that Peter is part fairy. The natives helped bring Mary to the fairy kingdom to protect her, so that's where Peter can find her. Now, they just want to prove that Peter really is her son, so he needs to fly. However, Peter is unable to recreate the same flight as before, causing him to lose hope.Blackbeard and his men attack the natives after Smee cowardly gives away the location of the heroes. The pirates battle the natives, and Blackbeard ends up killing the Chief. He finds Peter and reveals that he killed Mary. Peter escapes with Hook and Tiger Lily.The three head toward the fairy kingdom on a raft. Peter is devastated to learn that Tiger Lily lied to him about his mother. Suddenly, a large crocodile attacks the group. Peter falls into the water and is dragged to the bottom by the crocodile, until a trio of mermaids (all played by Cara Delevignge) send the croc away and bring Peter back up to the surface. Peter then has a vision of his mother as a warrior, leading the natives and fairies to safety from Blackbeard. He sees Mary fighting Blackbeard until the pirate ran her through with his sword, and he screamed in regret and sorrow. Later, Hook leaves the two because he doesn't want to be there when they lose the battle.Peter and Tiger Lily locate the fairy kingdom, but unfortunately, Blackbeard had followed them. He takes the pan necklace from Peter and uses it as the key to enter the fairy kingdom. He ties the heroes to the ship as they enter. The fairies fly around the good guys, and Peter befriends one such fairy named Tinker Bell. The heroes break free and fight the pirates, with Hook returning on his own ship to join the battle. The three fight the pirates, with Hook taking on Bishop while Tiger Lily fights Blackbeard. Smee escapes on a boat. Hook's ship tilts over, causing Bishop to fall to his death in the abyss, while Hook hangs on. Realizing he won't make it, he lets go. Blackbeard taunts Peter until the boy jumps and flies to rescue Hook. After doing so, the fairies help fight the pirates, sending them off the ships to their doom. The fairies then swarm all over Blackbeard and cause his ship to crash into a wall, plunging it into the abyss, taking Blackbeard with it.A vision of Mary appears to Peter. He still doesn't believe he is the hero that was prophecized, but his mother disagrees and restates her love for her son, calling him her little \"Peter Pan.\" As she disappears, Tiger Lily hugs Peter.The heroes return to London on Hook's new ship, the Jolly Roger, to gather Nibs and the rest of the orphaned boys to become the new Lost Boys, to the anger of Barnabas. As they fly back to Neverland, Peter asks Hook if they'll always be friends. Hook responds: \"Sure. What could go wrong?\""
}