{
  "imdb_id": "tt3300542",
  "tmdb_id": "267860",
  "douban_id": "25757186",
  "title": "London Has Fallen (2016)",
  "genres": [
    "Action",
    "Thriller"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "99 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.9,
  "director": [
    {
      "id": "nm0619836",
      "name": "Babak Najafi"
    }
  ],
  "writer": [
    {
      "id": "nm4950667",
      "name": "Creighton Rothenberger",
      "description": "based on characters created by &"
    },
    {
      "id": "nm4951717",
      "name": "Katrin Benedikt",
      "description": "based on characters created by"
    },
    {
      "id": "nm4950667",
      "name": "Creighton Rothenberger",
      "description": "story by &"
    },
    {
      "id": "nm4951717",
      "name": "Katrin Benedikt",
      "description": "story by"
    },
    {
      "id": "nm4950667",
      "name": "Creighton Rothenberger",
      "description": "screenplay &"
    },
    {
      "id": "nm4951717",
      "name": "Katrin Benedikt",
      "description": "screenplay and"
    },
    {
      "id": "nm0345615",
      "name": "Christian Gudegast",
      "description": "screenplay and"
    },
    {
      "id": "nm3203841",
      "name": "Chad St. John",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0009530",
      "name": "Alon Aboutboul",
      "character": "Aamir Barkawi"
    },
    {
      "id": "nm0958206",
      "name": "Waleed Zuaiter",
      "character": "Kamran Barkawi"
    },
    {
      "id": "nm1513288",
      "name": "Adel Bencherif",
      "character": "Raza Mansoor"
    },
    {
      "id": "nm1304635",
      "name": "Mehdi Dehbi",
      "character": "Sultan Mansoor"
    },
    {
      "id": "nm1159038",
      "name": "Shivani Ghai",
      "character": "Amal Mansoor"
    },
    {
      "id": "nm7961436",
      "name": "Martin Petrushev",
      "character": "UAV Reaper Pilot"
    },
    {
      "id": "nm3799259",
      "name": "Owen Davis",
      "character": "JSOC Officer"
    },
    {
      "id": "nm0124930",
      "name": "Gerard Butler",
      "character": "Mike Banning"
    },
    {
      "id": "nm0001173",
      "name": "Aaron Eckhart",
      "character": "Benjamin Asher"
    },
    {
      "id": "nm1183224",
      "name": "Michael Wildman",
      "character": "Agent Voight"
    },
    {
      "id": "nm0593664",
      "name": "Radha Mitchell",
      "character": "Leah Banning"
    },
    {
      "id": "nm1347017",
      "name": "Lucy Newman-Williams",
      "character": "Aide       (as Lucy Newman Williams)"
    },
    {
      "id": "nm5441137",
      "name": "Julian Kostov",
      "character": "Aide"
    },
    {
      "id": "nm1564367",
      "name": "Stacy Shane",
      "character": "Stern Faced Advisor"
    },
    {
      "id": "nm0236069",
      "name": "Penny Downie",
      "character": "Home Secretary Rose Kenter"
    },
    {
      "id": "nm0930714",
      "name": "Guy Williams",
      "character": "PM Leighton Clarkson"
    },
    {
      "id": "nm1171145",
      "name": "Patrick Kennedy",
      "character": "MI5 Intel John Lancaster"
    },
    {
      "id": "nm0758760",
      "name": "Colin Salmon",
      "character": "Chief Hazard"
    },
    {
      "id": "nm5736097",
      "name": "Terry Randall",
      "character": "Met Police Colleague       (as Terence Randall)"
    },
    {
      "id": "nm0000291",
      "name": "Angela Bassett",
      "character": "Lynne Jacobs"
    },
    {
      "id": "nm0000151",
      "name": "Morgan Freeman",
      "character": "VP Allan Trumbull"
    },
    {
      "id": "nm0335349",
      "name": "Deborah Grant",
      "character": "Doris"
    },
    {
      "id": "nm0687091",
      "name": "Andrew Pleavin",
      "character": "Agent Bronson"
    },
    {
      "id": "nm1893071",
      "name": "Nancy Baldwin",
      "character": "German Chancellor Agnes Bruckner"
    },
    {
      "id": "nm7961438",
      "name": "Madison Lowry",
      "character": "Young Girl"
    },
    {
      "id": "nm0926205",
      "name": "Nigel Whitmey",
      "character": "Canadian PM Robert Bowman"
    },
    {
      "id": "nm0113932",
      "name": "Julia Montgomery Brown",
      "character": "Bowman's Wife"
    },
    {
      "id": "nm3438661",
      "name": "Tsuwayuki Saotome",
      "character": "Japanese PM Tsutomu Nakushima"
    },
    {
      "id": "nm2692900",
      "name": "Sadao Ueda",
      "character": "Driver"
    },
    {
      "id": "nm0316274",
      "name": "Alex Giannini",
      "character": "Antonio Gusto"
    },
    {
      "id": "nm2308101",
      "name": "Elsa Mollien",
      "character": "Viviana Gusto"
    },
    {
      "id": "nm0032439",
      "name": "Philip Delancy",
      "character": "Jacques Mainard"
    },
    {
      "id": "nm4343923",
      "name": "Jean Baptiste Fillon",
      "character": "Steward       (as Jean-Baptiste Fillon)"
    },
    {
      "id": "nm5046656",
      "name": "Kemi-Bo Jacobs",
      "character": "Intel Officer"
    },
    {
      "id": "nm3268224",
      "name": "Simon Harrison",
      "character": "Intel Officer 2"
    },
    {
      "id": "nm0639917",
      "name": "Sean O'Bryan",
      "character": "NSA Ray Monroe"
    },
    {
      "id": "nm0355097",
      "name": "Jackie Earle Haley",
      "character": "DC Mason"
    },
    {
      "id": "nm0001233",
      "name": "Robert Forster",
      "character": "General Edward Clegg"
    },
    {
      "id": "nm0502425",
      "name": "Melissa Leo",
      "character": "Defence Secretary Ruth Macmillan"
    },
    {
      "id": "nm5250672",
      "name": "Simon Connolly",
      "character": "Marine One Pilot 1"
    },
    {
      "id": "nm3247514",
      "name": "Scott Sparrow",
      "character": "Marine One Pilot 2"
    },
    {
      "id": "nm0390306",
      "name": "Ginny Holder",
      "character": "EMT /              MED Dept. Head"
    },
    {
      "id": "nm0066591",
      "name": "Terence Beesley",
      "character": "Fire Dept. Head"
    },
    {
      "id": "nm0941000",
      "name": "Tim Woodward",
      "character": "General"
    },
    {
      "id": "nm4857296",
      "name": "Nikesh Patel",
      "character": "Pradhan"
    },
    {
      "id": "nm2731660",
      "name": "Charlotte Riley",
      "character": "MI6 Jacquelin Marshall"
    },
    {
      "id": "nm1349636",
      "name": "Boyan Anev",
      "character": "Bad Guy       (as Boian Anev)"
    },
    {
      "id": "nm1385922",
      "name": "Bryan Larkin",
      "character": "SAS Lieutenant"
    }
  ],
  "overview": "In London for the Prime Minister's funeral, Mike Banning discovers a plot to assassinate all the attending world leaders.",
  "storyline": "After the British Prime Minister has passed away under mysterious circumstances, all leaders of the Western world must attend his funeral. But what starts out as the most protected event on earth, turns into a deadly plot to kill the world's most powerful leaders and unleash a terrifying vision of the future. The President of the United States, his formidable secret service head and a British MI-6 agent who trusts no one are the only people that have any hope of stopping it.",
  "plot": "Western intelligence services collaborate to identify Pakistani arms dealer and terrorist leader Aamir Barkawi (Alon Moni Aboutboul) as the mastermind behind several terrorist attacks around the world, specifically a devastating hotel bombing in Manila, and authorize an American drone strike against Barkawi's compound, apparently killing Barkawi and his family.\n\nTwo years later, after the death of UK Prime Minister James Wilson, world leaders from the major Western countries, including US President Benjamin Asher (Aaron Eckhart) make plans to attend his funeral services in London. Secret Service agent and Asher's close friend, Mike Banning (Gerard Butler) is assigned by Secret Service Director Lynne Jacobs (Angela Bassett) to oversee the President's schedule there, despite the fact that Banning's wife, Leah (Radha Mitchell), is due to give birth to their child in a few weeks.\n\nAfter arriving via Air Force One at Stansted Airport, Banning pushes the President's arrival forward, directing Marine One to take them to Somerset House and then by car to St Paul's Cathedral. As they arrive, several attacks, coordinated by Barkawi's son Kamran (Waleed Zuaiter), eliminate the leaders of Canada, Germany, Japan, France and Italy by terrorists disguised as Metropolitan Police, the Queen's Guardsmen, and other first responders, damaging several London landmarks. At St Paul's, despite suffering heavy losses, Banning helps get Asher and Jacobs to cover when the disguised terrorists turn on them, and they manage to race back to Somerset House. Marine One takes off with two escorts, but terrorists with Stinger missiles take out the escorts before damaging Marine One, forcing it to crash-land in a park. Though Asher and Banning are fine, Jacobs has been fatally wounded, and she makes Banning promise to get back at the perpetrators before she dies. Banning leads Asher to the London Underground as most of the city's power, including its CCTV, is disabled and its residents take shelter.\n\nUS Vice President Allan Trumbull (Morgan Freeman) and members of the President's staff work with British authorities to determine what has happened, when Trumbull is contacted by Barkawi operating out of Yemen, admitting he is behind the attacks, and threatening to kill millions more if Asher isn't handed to him. They learn that Wilson was poisoned to death to lure the leaders to London. Knowing that Barkawi has spent years planning, Trumbull orders the staff to review Barkawi's known associates to find a lead. He also supports Chief Inspector Kevin Hazard's (Colin Salmon) decision to stand down all first responders, believing that disobeying this order will blow the terrorists' cover. Meanwhile, Banning disables a group of terrorists that followed them to the Underground, and contacts Kamran, who promises that if he captures the President, they will broadcast his execution across the Internet. Banning leads Asher to a nearby MI6 safehouse, pausing at street level long enough to relay a message to Trumbull via satellite monitoring.\n\nBanning and Asher meet MI6 agent Jacqueline \"Jax\" Marshall (Charlotte Riley), who briefs them on the situation. Upon discovering Barkawi's involvement, Asher explains that Barkawi survived the airstrike, with his daughter and son-in-law among the casualties. Jax plays back a message she received from Trumbull regarding extraction, and Banning verifies its authenticity. However, when cameras outside the safehouse pick up a Delta Force team approaching, Banning realizes that they arrived far too quickly, as well as that they're going round the back of the safehouse after finding the front door locked, and believes they are terrorists. Banning has Jax evacuate while he distracts the terrorists long enough to drive off with Asher. They are side-swiped by a truck, and the terrorists drag Asher off to an unknown location. While interrogating a terrorist, Banning is saved by the combined Delta Force/SAS squad who had been en route for extracting the President.\n\nTrumbull's staff discover one London building owned under one of Barkawi's companies, which British intelligence says is under construction but has been drawing an unexpected amount of power with a lack of communication, and come to believe this is where Barkawi's headquarters are. Banning joins the squad as they assault the terrorist-guarded building, and infiltrates the building as Kamran starts to beat up the President. Just before 8:00 PM, Banning arrives at the room Kamran is in, wounds him and rescues Asher, before ordering the SAS commander to blow up the building as he and Asher take shelter in an elevator shaft; the blast wipes Kamran and the other terrorists out. As Asher and Banning are safely escorted out for extraction, Trumbull contacts Barkawi, informs him that they have recovered the President, and that he should look outside. Barkawi is killed by a second drone strike, despite his vows that the war will continue. Meanwhile, after restoring the CCTV access, Jax discovers that Barkawi had been aided by MI5 Intelligence Chief John Lancaster (Patrick Kennedy), and kills him.\n\nTwo weeks after the attack on London, Banning is home spending time with Leah and their newborn child, named Lynne after his deceased boss. He sits in front of his laptop and contemplates sending his letter of resignation. On TV, Trumbull speaks regarding the recent events, leaving an inspiring message that the United States will prevail. This convinces Banning to delete the letter.",
  "synopsis": "The opening scene is set somewhere in Pakistan where terrorist mastermind and financier Aamir Barkawi (Alon Aboutboul) is reportedly responsible for a bombing in Europe. He is throwing a wedding celebration for his daughter at his compound. Barkawi talks with two of his sons about one of them finding a mole, a German agent, in one of their terrorist cells in Lebanon. When he learns that the mole had been killed, he tells his sons to be \"absolute\" with removing the threat (implying to not only kill the spy but kill the spy's whole family as well). As the celebration is underway, an informant working as one of the waiters leaves a text message to the United States government to Barkawi's location. The military located in Nevada launches a drone strike against it just as the informant leaves. The compound blows up, supposedly killing Barkawi along with his family.Two years later.President Benjamin Asher (Aaron Eckhart) and his top Secret Service agent/best friend Mike Banning (Gerard Butler) are jogging together near the White House in Washington (which is still recovering from the terrorist attack in the previous film). Mike returns home where it is revealed that he is currently expecting his first child with his wife Leah (Radha Mitchell). He is hoping to take some time off to spend time with his family and to finish setting up the nursery. She clearly becomes irritated by the number of security cameras in the room that he has installed.In Yemen, we see Barkawi is still alive (but walking with a limp), and he meets with his son Kamran (Waleed Zuaiter). They begin to set in motion plans for revenge.Back in Washington, Asher and Mike are both informed that the British Prime Minister James Wilson has recently passed away. They, along with Asher's staff, including now Vice President Allan Trumbull (Morgan Freeman) and Secret Service Director Lynne Jacobs (Angela Bassett), travel to London to join all the other world leaders for Wilson's funeral. Believing it to be heavily secured, they are proven wrong when several mercenaries under Barkawi's commands initiate an attack, starting with a bomb destroying the Canadian prime minister's leader's limo. Soon, the mercenaries disguised as royal guards and police officers begin opening fire on civilians and other world leaders. The female German chancellor is killed by two assassins at Buckingham Palace before they are killed. The Japanese prime minister and his driver are killed on a bridge when two suicide bombers blow up both support spans and allowing the bridge to fall into the river. The Italian prime minister is killed with his mistress while standing atop Westminister Abbey. The French president is killed in his boat when another suicide bomber sails a barge containing explosives close to the boat. At St. Paul's Cathedral, Mike takes Asher and Jacobs with him to safety while shooting the mercs in the street.Quickly, the terrorists start to hit London's landmarks, including Big Ben and the Tower Bridge over the River Thames, setting off explosives that kill even more people. Mike, Asher, and Jacobs head into a chopper to safety. However, the terrorists launch Stinger ground-to-air missiles at the choppers, taking out the two security choppers before striking the presidential one. The presidential chopper crash-lands to the ground, resulting in Jacobs being fatally impaled. Before dying, she tells Mike to \"make those fuckers pay\". Mike and Asher then go on the run, while being chased by more assassins on motorcycles.Back in Washington, the president's staff sits in horror, fearing that their friends are dead. Mike attempts to contact Trumbull and send a message to let them know that he and Asher are still alive. He and the president are forced to venture to an underground station and after killing the terrorists pursing them, walk on foot through one of the abandoned metro tunnels. As Mike and Asher are running through the tunnels, Asher notes that the terrorists want him dead, and if it must come down to it, he orders Mike to kill him. Mike reluctantly agrees.Back in Washington, Trumbull and his staff receives a threatening call from Barkawi to let them know that he is out for revenge for the death of his family. They are informed that Wilson's autopsy report detected poison in his body, meaning he was intentionally murdered with the plan for all the world leaders to come together to be killed off.With the city on lock-down, Mike and Asher run to the home of MI6 agent Jacqueline \"Jax\" Marshall (Charlotte Riley), whom Mike knows well. Jax gets onto her computer and learns that Barkawi is behind the whole plot. She plays back a message from Trumbull confirming that they received Mike's message and are sending help. On the security cameras, the three see several armed men arrive in what is supposedly the Delta team there to rescue Mike and Asher, until Mike notices that the men are not sweating despite wearing heavy gear. They realize that the terrorists intercepted their message and are there to attack. The terrorists storm in and fire on the three. Mike shoots some of them and manage to kill all of them, with some help from President Asher. Mike and President Asher then take a car and drive through the streets until they are again ambushed by more terrorists, leading to their car being rammed by a truck. Despite being dazed, Mike manages to shoot and kill one of the terrorists who tries to finish him off, but Asher is abducted by the rest of the terrorists who then escape.Asher is taken to a private location where Kamran is setting everything up for him to be publicly executed. He punches Asher several times to make him suffer beforehand. Meanwhile, Mike is already on his way to rescue him with the real Delta team.The terrorists set up the cameras and broadcast it to every network around the world, so it's shown around places like Times Square. Kamran tells Asher to say some final words. Kamran readies his machete to decapitate Asher until Mike bursts in and shoots all but Kamran. He engages in a fistfight with Kamran and lets him know that no matter how many times enemies try to attack America, they'll still be there in a thousand years. Kamran manages to make a run for it. Mike orders the Delta team leader to blow the place up. Mike takes Asher and they jump down a shaft as the place goes up in flames, killing Kamran and the surviving terrorists. The Delta team finds Mike and Asher and reports to the staff that they're alive.Barkawi's compound is located in Yemen. Trumbull calls him to let him know that he's lost. Another drone strike is launched against Barkawi, and this time, he's taken out for good.Mike returns home and is spending time with Leah and their newborn child. He's looking at the letter of resignation to Asher he'd previously written. On TV, Trumbull speaks regarding the recent events, leaving an inspiring message that America will prevail. This convinces Mike to delete the letter."
}