{
  "imdb_id": "tt3300954",
  "tmdb_id": "248065",
  "douban_id": null,
  "title": "Fading West (2013)",
  "genres": [
    "Documentary",
    "Family",
    "Music",
    "Sport"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.7,
  "director": [
    {
      "id": "nm3202984",
      "name": "Matt Katsolis"
    }
  ],
  "writer": [
    {
      "id": "nm1475521",
      "name": "Switchfoot",
      "description": "story"
    }
  ],
  "cast": [
    {
      "id": "nm3052668",
      "name": "Chad Butler",
      "character": "Himself"
    },
    {
      "id": "nm0192915",
      "name": "Tom Curren",
      "character": "Himself"
    },
    {
      "id": "nm0217691",
      "name": "Thomas DeLonge",
      "character": "Himself"
    },
    {
      "id": "nm1472774",
      "name": "Jerome Fontamillas",
      "character": "Himself"
    },
    {
      "id": "nm0286049",
      "name": "Jon Foreman",
      "character": "Himself"
    },
    {
      "id": "nm0286080",
      "name": "Tim Foreman",
      "character": "Himself"
    },
    {
      "id": "nm4825263",
      "name": "Michael Halloran",
      "character": "Himself"
    },
    {
      "id": "nm0532499",
      "name": "Rob Machado",
      "character": "Himself"
    },
    {
      "id": "nm1360806",
      "name": "Chris Shiflett",
      "character": "Himself"
    },
    {
      "id": "nm6055114",
      "name": "Andrew Shirley",
      "character": "Himself"
    }
  ],
  "overview": "Inspired by films including \"Rattle and Hum\" and \"Endless Summer,\" Fading West follows Grammy-winning alternative-rock band Switchfoot as they travel the globe in search of new musical inspiration and perfect waves. Filmed during Switchfoot's 2012 World Tour, Fading West charts the creation of the fivesome's upcoming album in its earliest and most unpredictable stages. As the band visits legendary surf breaks in Australia, New Zealand, Africa, and Bali, brothers Jon and Tim Foreman breathe fresh life into their songs by harnessing the spirit of their surroundings and mining new emotional depths. Part rock documentary, surf film, and travelogue, Fading West offers rare glimpses of the longtime surfers on their boards, captures the frenetic energy of their live shows, and portrays a journey both epic and intimate.",
  "storyline": "Inspired by films including \"Rattle and Hum'' and \"Endless Summer,\" Fading West follows Grammy-winning alternative-rock band Switchfoot as they travel the globe in search of new musical inspiration and perfect waves. Filmed during Switchfoot's 2012 World Tour, Fading West charts the creation of the fivesome's upcoming album in its earliest and most unpredictable stages. As the band visits legendary surf breaks in Australia, New Zealand, Africa, and Bali, brothers Jon and Tim Foreman breathe fresh life into their songs by harnessing the spirit of their surroundings and mining new emotional depths. Part rock documentary, surf film, and travelogue, Fading West offers rare glimpses of the longtime surfers on their boards, captures the frenetic energy of their live shows, and portrays a journey both epic and intimate.",
  "plot": null,
  "synopsis": null
}