{
  "imdb_id": "tt3349728",
  "tmdb_id": "305580",
  "douban_id": null,
  "title": "Ghosting (2016)",
  "genres": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.3,
  "director": [
    {
      "id": "nm4720830",
      "name": "Kevin Alexander Boon"
    }
  ],
  "writer": [
    {
      "id": "nm7144471",
      "name": "James Aden",
      "description": null
    },
    {
      "id": "nm4720830",
      "name": "Kevin Alexander Boon",
      "description": "writer"
    },
    {
      "id": "nm4720830",
      "name": "Kevin Alexander Boon",
      "description": null
    },
    {
      "id": "nm6104321",
      "name": "Gillian Colley",
      "description": null
    },
    {
      "id": "nm6104322",
      "name": "Stephanie Feliciano",
      "description": null
    },
    {
      "id": "nm6104323",
      "name": "Dalena Ly",
      "description": null
    },
    {
      "id": "nm6104324",
      "name": "Christopher Willman-Bunge",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4610949",
      "name": "Michael Mowen",
      "character": "Matt Duncan"
    },
    {
      "id": "nm4135129",
      "name": "Elizabeth Wyld",
      "character": "Charlie Reid"
    },
    {
      "id": "nm6104314",
      "name": "Bex Etter",
      "character": "Lindsay Hoult"
    },
    {
      "id": "nm2157754",
      "name": "Paul Fahrenkopf",
      "character": "Robert Stoltz"
    },
    {
      "id": "nm4569344",
      "name": "Ralph Mauriello",
      "character": "Mr. Vitteli"
    },
    {
      "id": "nm2042618",
      "name": "Khawaja Aziz",
      "character": "Prof. Leto"
    },
    {
      "id": "nm6104316",
      "name": "Michael Baker",
      "character": "Mr. Hoult"
    },
    {
      "id": "nm4720587",
      "name": "Renee Borromeo",
      "character": "Mrs. Hoult"
    },
    {
      "id": "nm3620210",
      "name": "Tiffany Kemp",
      "character": "Susan"
    },
    {
      "id": "nm0472912",
      "name": "Jim Krut",
      "character": "Pastor Adkins"
    },
    {
      "id": "nm6104319",
      "name": "Michael Mann",
      "character": "Shopkeeper"
    },
    {
      "id": "nm3648758",
      "name": "Hillary Mazer",
      "character": "Mrs. Emelia Jackson"
    },
    {
      "id": "nm4720066",
      "name": "Evan Nelson",
      "character": "Orderly"
    },
    {
      "id": "nm6104315",
      "name": "Stephanie O'Brien",
      "character": "Alice Duncan"
    },
    {
      "id": "nm6104318",
      "name": "Allison Petrillo",
      "character": "Florist"
    },
    {
      "id": "nm4720542",
      "name": "Thomas J. Trgovac",
      "character": "Sam Duncan"
    },
    {
      "id": "nm3234110",
      "name": "J.D. Wine",
      "character": "Newscaster"
    }
  ],
  "overview": "The son of a schizophrenic mother and abusive father must unravel the mystery of his frightening visions before he succumbs to madness.",
  "storyline": "One day, while working at a small film processing business to help pay for school, Matt, the son of an alcoholic father and a schizophrenic mother, begins to see the image of a mysterious man in photographs taken by different people in small towns all over the country. When he learns that no one else can see the man, he fears he may have inherited his mother's schizophrenia and sets out to reclaim his sanity by unraveling the supernatural mystery, but instead of leading him out of darkness, his quest takes him into a black labyrinth of true evil.",
  "plot": "Physicists Abby Yates (Melissa McCarthy) and Erin Gilbert (Kristen Wiig) are co-authors of a research book which posits the existence of paranormal phenomena such as ghosts. Erin has disowned the work and become a professor at Columbia University, while Abby continues to study the paranormal at a technical college with eccentric engineer Jillian Holtzmann (Kate McKinnon). Erin learns Abby has republished the book, threatening her bid for tenure at Columbia. She reunites with Abby and, in exchange for Abby removing the book from publication, reluctantly agrees to assist her and Jillian in a paranormal investigation.\n\nThe group witness a malevolent ghost (Bess Rous), renewing Erin's belief in the paranormal. However, a video of their investigation is posted online, and Erin is denied tenure. She joins Abby and Jillian's project, but when a new institute director learns its nature, he fires them. They open an office above a Chinese restaurant and call themselves the \"Conductors of the Metaphysical Examination.\" They build equipment to study and capture ghosts, and hire dimwitted but handsome Kevin Beckman (Chris Hemsworth) as a receptionist.\n\nMTA worker Patty Tolan (Leslie Jones) witnesses a ghost in a subway line and contacts the group. They document the ghost and successfully test Jillian's proton containment laser, but their findings are again dismissed. They continue to develop their technology and advertise their services as what pundits have dubbed the \"Ghostbusters\". Patty joins the team, providing historical knowledge of New York City and a repurposed hearse, \"Ecto-1\".\n\nUnbeknownst to them, the ghosts are being summoned by devices built by Rowan North (Neil Casey), an occultist and mad scientist attempting to bring about the \"apocalypse\". When Rowan plants another device at a live music venue, the Ghostbusters are called in and capture the ghost in front of the audience. When supernatural debunker Dr. Martin Heiss (Bill Murray) challenges the Ghostbusters, the incensed Erin releases the ghost as proof; it throws Heiss out a window, presumably to his death, before escaping. The Ghostbusters are brought to see Mayor Bradley (Andy García) and his loyal secretary, Jennifer Lynch (Cecily Strong), who reveals that the city and the Department of Homeland Security are aware of New York's ghost problem. While privately supporting the team's work, the mayor's office and DHS publicly denounce them as fraudsters.\n\nThe Ghostbusters realize Rowan is planting his devices along ley lines which intersect at the Mercado Hotel in Times Square, a site with a history of paranormal activity, and discover Rowan building a portal to the ghost dimension in the hotel basement. To avoid capture, Rowan deliberately electrocutes himself to death, after which Jillian deactivates the portal. Erin discovers a copy of her and Abby's book among Rowan's possessions, and realizes that he killed himself so that he could become a ghost and command a spirit army. Rowan returns as a powerful ghost, possessing Abby and then Kevin. As Kevin, he opens the portal and releases hundreds of ghosts. The police and DHS are quickly subdued, but the Ghostbusters fight through the army of ghosts to reach the portal.\n\nRowan takes the form of the ghost in the Ghostbusters' logo, grows to enormous height, and attacks the city. The team devises a plan to use Ecto-1's nuclear reactor to close the portal and return the ghosts to their own dimension. The plan succeeds, but Rowan drags Abby into the portal with him; Erin leaps into the portal and rescues her, as Rowan falls and gets completely obliterated by the portal. The mayor's office agrees to secretly fund the Ghostbusters' research while continuing to publicly denounce them as frauds. With new funding, the Ghostbusters move to a better facility, a disused fire house. Despite the mayoral smear campaign (which they ignore), New York lights up with thanks and tributes to the Ghostbusters.\n\nIn a post credits scene, Patty listens to a recording of a ghost encounter and asks the others if they have heard of Zuul.",
  "synopsis": "Matt (MIKE MOWEN) is a first-generation college student working his way through school at a small film processing business a business dying in light of digital photography. Raised by an abusive, alcoholic father (THOMAS TRGOVAC) he cannot confront and a schizophrenic mother (STEPHANIE OBRIEN) he cannot save, Matt struggles to escape the hardships of his life. One day at work, he notices the image of a mysterious man in photographs taken by different people from small towns all over the country a man in a dark coat with a weathered fedora hung over his eyes. When he discovers that no one else can see the man, not even his best friend Charlie (ELIZABETH WYLD), he begins to fear that he has inherited his mothers schizophrenia. His future seems hopeless until he learns that Lindsay (BEX ETTER), a classmate, can also see the man. After some convincing, Lindsay joins forces with Matt and Charlie to help unravel the secret of the mysterious man who disappears from digital photos and photocopies. Their investigation grows serious when Lindsay begins appearing in the photographs and they are ultimately steered to a small town in Maryland, where the mystery of the man in the photographs is unveiled, and to a large farmhouse, where they discover that instead of leading them out of darkness, their journey has led them into a black labyrinth of true evil and forced Matt to confront his greatest fear."
}