{
  "imdb_id": "tt3344922",
  "tmdb_id": "283698",
  "douban_id": null,
  "title": "Hungry Hearts (2014)",
  "genres": [
    "Drama",
    "Romance",
    "Thriller"
  ],
  "country": "Italy",
  "version": [
    {
      "runtime": "109 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm0182459",
      "name": "Saverio Costanzo"
    }
  ],
  "writer": [
    {
      "id": "nm0182459",
      "name": "Saverio Costanzo",
      "description": "written by"
    },
    {
      "id": "nm0291909",
      "name": "Marco Franzoso",
      "description": "novel"
    }
  ],
  "cast": [
    {
      "id": "nm3485845",
      "name": "Adam Driver",
      "character": "Jude"
    },
    {
      "id": "nm2130040",
      "name": "Alba Rohrwacher",
      "character": "Mina"
    },
    {
      "id": "nm0561809",
      "name": "Roberta Maxwell",
      "character": "Anne"
    },
    {
      "id": "nm8996867",
      "name": "Brandon Reiss",
      "character": "Baby"
    },
    {
      "id": "nm8996868",
      "name": "Joshua Reiss",
      "character": "Baby"
    },
    {
      "id": "nm0916617",
      "name": "Jake Weber",
      "character": "Dr. Bill"
    },
    {
      "id": "nm1742739",
      "name": "Victoria Cartagena",
      "character": "Monica"
    },
    {
      "id": "nm1465727",
      "name": "Al Roffe",
      "character": "Marguerito"
    },
    {
      "id": "nm2159112",
      "name": "Geisha Otero",
      "character": "Rosa"
    },
    {
      "id": "nm3865194",
      "name": "Jason Selvig",
      "character": "J"
    },
    {
      "id": "nm0048379",
      "name": "David Aaron Baker",
      "character": "Dr. Jacob"
    },
    {
      "id": "nm1932619",
      "name": "Natalie Gold",
      "character": "Lawyer Jennifer Donadio       (as Nathalie Gold)"
    },
    {
      "id": "nm0931879",
      "name": "Victor Williams",
      "character": "Social Worker"
    },
    {
      "id": "nm1605064",
      "name": "Ginger Kearns",
      "character": "Dana"
    },
    {
      "id": "nm1736370",
      "name": "Quincy Tyler Bernstine",
      "character": "Nurse"
    },
    {
      "id": "nm7275749",
      "name": "Zephyr Sosin",
      "character": "5 Years Old Boy"
    }
  ],
  "overview": "The relationship of a couple who meet by chance in New York City is put to the test when they encounter a life or death circumstance.",
  "storyline": "The relationship of a couple who meet by chance in New York City is put to the test when they encounter a life or death circumstance.",
  "plot": "When Mina (Alba Rohrwacher) and Jude (Adam Driver) first meet, it's under the worst of circumstances; Mina finds herself accidentally trapped in a bathroom with Jude, who is suffering from food poisoning induced diarrhea. Despite this awkward first encounter, the two form a seemingly strong relationship. However when Mina announces that she's going to return to Italy, Jude initiates a sexual encounter that ends with him ejaculating inside of her, despite Mina specifically requesting otherwise. Mina becomes pregnant as a result of the encounter, which further ties her to Jude and prevents her from traveling to Italy. The pregnancy ends up putting a large amount of strain on their relationship since Mina is obsessed with purity and greatly distrusts modern medicine. While Jude wants her to visit an obstetrician he decides to trust Mina's decision to rely more on alternative and traditional medicine, even going so far as to attend a meeting with a psychic, who declares the fetus an Indigo child. Mina does not eat well during her pregnancy, which results in her amniotic fluid drying up. When she goes into labor, she attempts a water birth with a midwife, but after hours, the baby goes into distress and Jude takes her to the hospital against her wishes, where she has a C-section. Once the baby is born Mina begins putting the infant on a vegan diet, which concerns Jude, who begins to secretly go against Mina's parenting techniques. This puts the two parents at odds with one another and Mina begins to further obsess about keeping the child pure, at one point feeding the child an anti-nutrient oil because Jude fed the child some meat. As things progress the relationship continues on a downward spiral that puts the child's well-being and life at risk.\n\nTowards the end of the film, Jude takes the child from the couple's home and brings him to his mother, where he feeds him a proper meal. Mina comes and attempts to sneak away with the child, only for Jude to stop her. As a result, Mia throws herself face first into a door, causing injury. She uses the bruises on her face to convince the police that Jude hit her, and takes the baby back home with her. She happily spends the day with her son at the beach. However, when she returns home and puts the baby to sleep, an unseen person enters the apartment. Mina sits up in bed and watches the person enter the bedroom. The screen then cuts black as a gunshot rings out. Jude is next seen running into the police station, frantically asking where his son is. The baby is unharmed, but Jude breaks down in tears. It turns out that Jude's mother shot and killed Mina, under the belief that Mina was a danger to her grandson, and she would have eventually starved the baby if she lived. In her prison cell, she expresses regret for her actions, but does not regret protecting her grandson and saving him from his mother. The film ends with Jude and his school aged son playing on the beach.",
  "synopsis": null
}