{
  "imdb_id": "tt3380264",
  "tmdb_id": "296690",
  "douban_id": null,
  "title": "Kill Dil (2014)",
  "genres": [
    "Action",
    "Drama",
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "127 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.4,
  "director": [
    {
      "id": "nm1249945",
      "name": "Shaad Ali"
    }
  ],
  "writer": [
    {
      "id": "nm4318159",
      "name": "Nitesh Tiwari",
      "description": "screenplay &"
    },
    {
      "id": "nm6328031",
      "name": "Shreyas Jain",
      "description": "screenplay &"
    },
    {
      "id": "nm6328030",
      "name": "Nikhil Mehrotra",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm3828984",
      "name": "Ranveer Singh",
      "character": "Dev"
    },
    {
      "id": "nm3773554",
      "name": "Ali Zafar",
      "character": "Tutu"
    },
    {
      "id": "nm4495174",
      "name": "Parineeti Chopra",
      "character": "Disha"
    },
    {
      "id": "nm0332871",
      "name": "Govinda",
      "character": "Bhaiyaji"
    },
    {
      "id": "nm0019463",
      "name": "Murad Ali",
      "character": ""
    },
    {
      "id": "nm1249945",
      "name": "Shaad Ali",
      "character": ""
    },
    {
      "id": "nm6856186",
      "name": "Jass Bhatia",
      "character": "Chimsy"
    },
    {
      "id": "nm2240044",
      "name": "Brijendra Kala",
      "character": "Jeweller"
    },
    {
      "id": "nm7110450",
      "name": "Qasim Khallow",
      "character": "Pratty"
    },
    {
      "id": "nm7648624",
      "name": "Ratnesh Mani",
      "character": "Inspector Vijay Chauhan"
    },
    {
      "id": "nm0622186",
      "name": "Alok Nath",
      "character": "Jeewan Sambandh Insurance Owner"
    },
    {
      "id": "nm9714216",
      "name": "Daljeet Sean Singh",
      "character": "Babban Phelwan"
    },
    {
      "id": "nm0802240",
      "name": "Sukhwinder Singh",
      "character": ""
    },
    {
      "id": "nm3056569",
      "name": "Rocky Verma",
      "character": "Snake Ladder Player"
    }
  ],
  "overview": "Once upon a time in North India, two killers – Dev (Ranveer Singh) and Tutu (Ali Zafar) - roamed free. Abandoned when young and vulnerable, Bhaiyaji (Govinda) gave them shelter and… nurtured them to kill! All is normal in their lives until destiny throws free-spirited Disha (Parineeti Chopra) into the mix. What follows is a game of defiance, deception and love.",
  "storyline": "Once upon a time in North India, two killers - Dev and Tutu, roamed free. Abandoned when young and vulnerable, Bhaiyaji gave them shelter and - nurtured them to kill. All is normal in their lives until destiny throws free-spirited Disha into the mix. What follows is a game of defiance, deception and love. Played by Ranveer Singh (Dev), Ali Zafar (Tutu), Parineeti Chopra (Disha) and Govinda (Bhaiyaji), Kill Dil is an entertaining thriller about guns and romance.",
  "plot": "Tutu (Ali Zafar) and Dev (Ranveer Singh) are two orphans who were raised by a local gangster Bhaiyaji (Govinda) to be assassins. Their life takes a turn when they meet Disha (Parineeti Chopra) at a club and she and Dev fall in love with each other. Dev's indifference towards work starts irritating Bhaiyaji, but Tutu defends Dev. When Dev is unable to kill one of their targets, he decides to change his life. This enrages Bhaiyaji and he threatens to kill Dev. Tutu intervenes and suggests Dev to look out for a job but should accompany him every time Bhaiyaji calls them to give killing contracts.\n\nTutu gets Dev a fake MBA degree which helps Dev join an insurance company. Dev and Disha make plans to get married, while Disha is unaware of Dev's past. Bhaiyaji on learning the truth about Dev's job decides to play a trick to get him back. He sends one of his goons, Batuk, to kill Dev and also informs Tutu. He also calls up Disha and tells her about Dev and Tutu's real identity. Just when Batuk is about to kill Dev, Tutu shoots him down in front of Disha. Disha shocked with the reality breaks up with Dev, resulting in Dev again becoming an assassin.\n\nBhaiyaji gives them a fresh contract to kill his arch enemy Baban Pehlwan. Dev and Tutu record a video telling the tale of how they became gangsters and send it to Disha. During a shootout, Dev is again unable to fire the gun and gets shot. Tutu takes him to the hospital, where after an operation, Dev finds Disha waiting for him and they both reconcile. Bhaiyaji gets killed by Baban Pehlwan. Dev and Disha get married while Tutu has a job interview in the same insurance company with a fake MBA degree.",
  "synopsis": null
}