{
  "imdb_id": "tt3335048",
  "tmdb_id": "288585",
  "douban_id": null,
  "title": "Silent Heart (2014)",
  "genres": [
    "Drama"
  ],
  "country": "Denmark",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm0000806",
      "name": "Bille August"
    }
  ],
  "writer": [
    {
      "id": "nm1311535",
      "name": "Christian Torpe",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0639152",
      "name": "Ghita Nørby",
      "character": "Esther"
    },
    {
      "id": "nm0824785",
      "name": "Paprika Steen",
      "character": "Heidi"
    },
    {
      "id": "nm4439530",
      "name": "Danica Curcic",
      "character": "Sanne"
    },
    {
      "id": "nm0344655",
      "name": "Morten Grunwald",
      "character": "Poul"
    },
    {
      "id": "nm1561982",
      "name": "Pilou Asbæk",
      "character": "Dennis"
    },
    {
      "id": "nm0016850",
      "name": "Jens Albinus",
      "character": "Michael"
    },
    {
      "id": "nm0110336",
      "name": "Vigga Bro",
      "character": "Lisbeth"
    },
    {
      "id": "nm6090039",
      "name": "Oskar Sælan Halskov",
      "character": "Jonathan"
    }
  ],
  "overview": "The prestigious Danish filmmaker Bille August, winner of an Academy Award and two Palme d'Or in Cannes, returns with a highly personal drama. Three generations of a family gather over a weekend. The sisters Sanne and Heidi have accepted their terminally-ill mother’s desire to die before her disease worsens; but, as the weekend progresses, their mother's decision becomes harder and harder to deal with, and old conflicts come to the surface.",
  "storyline": "Three generations of a family coming together over a weekend. A sick mother's wish to die before her disease worsens gets harder to handle as old conflicts come to the surface.",
  "plot": "A family of three generations gather over a weekend to say goodbye to Esther (Ghita Nørby) who suffers from an incurable disease, amyotrophic lateral sclerosis, and with the help of her husband Poul (Morten Grunwald) has chosen to pursue euthanasia when the weekend is over. But as the end approaches, the mother's decision becomes more and more difficult to handle for the daughters Heidi (Paprika Steen) and Sanne (Danica Curcic), and old conflicts come to the surface.",
  "synopsis": null
}