{
  "imdb_id": "tt3302498",
  "tmdb_id": "201734",
  "douban_id": null,
  "title": "Emptying the Skies (2013)",
  "genres": [
    "Documentary",
    "Action",
    "Thriller",
    "War"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "78 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.4,
  "director": [
    {
      "id": "nm6238868",
      "name": "Douglas Kass"
    },
    {
      "id": "nm0440797",
      "name": "Roger Kass"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm2199053",
      "name": "Peter Berthold",
      "character": "Himself"
    },
    {
      "id": "nm6177683",
      "name": "Sergio Coen Tanugi",
      "character": "Himself"
    },
    {
      "id": "nm6177687",
      "name": "David Conlin",
      "character": "Himself"
    },
    {
      "id": "nm1676552",
      "name": "Jonathan Franzen",
      "character": "Himself"
    },
    {
      "id": "nm6177682",
      "name": "Martin Hellicar",
      "character": "Himself"
    },
    {
      "id": "nm6177685",
      "name": "Alex Heyd",
      "character": "Himself"
    },
    {
      "id": "nm6177686",
      "name": "Axel Hirschfeld",
      "character": "Himself"
    },
    {
      "id": "nm6177684",
      "name": "Piero Liberati",
      "character": "Himself"
    },
    {
      "id": "nm3684757",
      "name": "Andrea Rutigliano",
      "character": "Himself"
    }
  ],
  "overview": "If you want to impress your dining companions in Cyprus, it's not caviar that you order, but ambelopoulia: a tiny songbird. But as this gripping doc reveals, the cost to bring such delicacies to the table is enormous. Bestselling novelist Jonathan Franzen takes a break from the world of fiction to guide us through an all too horrifying reality: tens of millions of protected migratory songbirds are illegally killed every year. Franzen, a longtime bird lover, accompanies young staffers of the Committee Against Bird Slaughter on their expeditions. With police enforcement in Southern Europe practically non-existent, they risk their lives to rescue trapped birds, and confront hostile poachers. It's a topic that proves a cultural flashpoint -- the Cypriot landowners cannot understand why a bunch of Italians can tell them what to do on their land.",
  "storyline": "Based on a magazine essay written by noted best-selling novelist Jonathan Franzen for 'The New Yorker' and widely republished around the world, 'Emptying the Skies' chronicles the rampant poaching of migratory songbirds in southern Europe. Songbird populations have been drastically declining for several decades, and a number of species face extinction imminently. The film explores the wonder of these tiny globe-flying marvels, millions of which are unlawfully slaughtered each year for large sums on the black market, and follows an intrepid squad of pan-European bird-lovers who risk their lives waging a secret war against poachers, disrupting illegal trapping and freeing as many birds as possible. Jonathan Franzen is executive producer of and featured in the film.",
  "plot": null,
  "synopsis": null
}