{
  "imdb_id": "tt3462880",
  "tmdb_id": "373181",
  "douban_id": null,
  "title": "Wiener Dog Internationals (2015)",
  "genres": [
    "Family"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "92 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm3406916",
      "name": "Kevan Peterson"
    }
  ],
  "writer": [
    {
      "id": "nm3406916",
      "name": "Kevan Peterson",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0000392",
      "name": "Morgan Fairchild",
      "character": "Miss Merryweather"
    },
    {
      "id": "nm0518715",
      "name": "Jason London",
      "character": "Phil Jack"
    },
    {
      "id": "nm0061262",
      "name": "Bryan Batt",
      "character": "Judge Brown"
    },
    {
      "id": "nm4721354",
      "name": "Julian Feder",
      "character": "Danny Jack"
    },
    {
      "id": "nm2965079",
      "name": "Caitlin Carmichael",
      "character": "Bridget Jack"
    },
    {
      "id": "nm3909422",
      "name": "Austin Anderson",
      "character": "Skip Jack"
    },
    {
      "id": "nm3355632",
      "name": "Corsica Wilson",
      "character": "Aunt Jenny"
    },
    {
      "id": "nm5318271",
      "name": "Cynthy Wu",
      "character": "Etsuko"
    },
    {
      "id": "nm3811243",
      "name": "Selah Joy",
      "character": "Ayameko"
    },
    {
      "id": "nm6522218",
      "name": "Emmy Perry",
      "character": "Kitty"
    },
    {
      "id": "nm2493337",
      "name": "Scott Butler",
      "character": "Judge Brown's Assistant"
    },
    {
      "id": "nm1748530",
      "name": "Olga Kay",
      "character": "Darya"
    },
    {
      "id": "nm6785226",
      "name": "Daisy Traina",
      "character": "Superfan"
    },
    {
      "id": "nm1000451",
      "name": "Myriam Blanckaert",
      "character": "French Anchor"
    },
    {
      "id": "nm2066902",
      "name": "Kara Connolly",
      "character": "Newscaster"
    },
    {
      "id": "nm1915289",
      "name": "Linc Hand",
      "character": "Robert Smith"
    },
    {
      "id": "nm5198270",
      "name": "KT Hart",
      "character": "Animal Communicator"
    },
    {
      "id": "nm6165018",
      "name": "David Matthew Jenkins",
      "character": "Race Photographer"
    },
    {
      "id": "nm1402611",
      "name": "Masami Kosaka",
      "character": "Japanese Anchor"
    },
    {
      "id": "nm2184310",
      "name": "Johnny Kostrey",
      "character": "Russian News Anchor"
    },
    {
      "id": "nm0547827",
      "name": "P.J. Marino",
      "character": "Edward the Mechanic"
    },
    {
      "id": "nm6573353",
      "name": "Ezri Mercy Miesner",
      "character": "Trixie /              Shelly"
    },
    {
      "id": "nm5202541",
      "name": "Mila Miesner",
      "character": "Shelly"
    },
    {
      "id": "nm4697564",
      "name": "Alexis Miner",
      "character": "Young Mrs. Jack"
    },
    {
      "id": "nm2213957",
      "name": "Chris Moss",
      "character": "Mr. Bright"
    },
    {
      "id": "nm3339785",
      "name": "Dora Negri-Crutchfield",
      "character": "Baltic Racer"
    },
    {
      "id": "nm5200159",
      "name": "Reggie Racer",
      "character": "Iron Hammer"
    },
    {
      "id": "nm4497805",
      "name": "Melissa Jane Rodriguez",
      "character": "Kitty's Mom"
    },
    {
      "id": "nm0419855",
      "name": "JJ Snyder",
      "character": "Reporter"
    }
  ],
  "overview": "After beating the competition at the nationals, the Jack family prepares for the International World of Wiener Dog Racing. Without parental consent, the kids must sneak off to the races, otherwise their notorious, beloved underdog, Shelly, will have to forfeit her U.S. title at the competition. But the stiff competition leads several of the other countries to get involved in foul play that only the real winners can sniff out!",
  "storyline": "The Jack Family is at it again, as they enter the International World of Wiener Dog Racing. The kids sneak away to enter Shelly in the Internationals, and find themselves caught in a devious plot by Mrs. Merryweather that may change wiener dog races forever! Can little Shelly, the champion dog from the US, really take on the World?",
  "plot": "Danny brings his cancer-surviving son Remi a wiener dog. His wife Dina does not want to deal with caring for the dog, but Danny informs her Remi is mature and old enough to help the two with the responsibilities. Dina brings Wiener-Dog to the vet to get spayed, and on their way, Remi becomes upset. Dina comforts Remi by telling him an embellished story about her childhood dog, which she claims died after giving birth to a litter of stillborn puppies. During Dina and Danny's yoga class, Remi and Wiener-Dog tear up the couch cushions and cover the living room in feathers. Wiener Dog wanders off into the kitchen, and Remi feeds her a chocolate chip granola bar. Wiener-Dog becomes sick and has diarrhea and throws up all over their home and becomes very ill. The next day Danny brings Wiener-Dog to the vet to be euthanised.\n\nAt the vet, veterinary nurse Dawn takes Wiener-Dog from the consultation room before the vet can euthanise her. She brings Wiener-Dog home with her, where she nurses the dog back to life. One day while shopping for pet food, she runs into her old school acquaintance Brandon, who invites her to visit his brother Tommy and his wife April, both with Down syndrome, in Ohio. Dawn agrees, and the two head off to Ohio, where they come across homesick Mexican hitchhikers. Once they arrive in Ohio, Brandon informs his brother that their father had died due to alcoholism. Tommy asks Brandon to stop doing drugs, and Brandon promises he has stopped, even though he was shown injecting drugs earlier in the trip. Dawn offers to leave Wiener-Dog with Tommy and April, who happily accept Dawn's offer. On their way home, Dawn and Brandon talk about their future together, and happily hold hands.\n\nWiener-Dog then arrives with Dave Schmerz, a screenwriting professor who is attempting to get his second screenplay off the ground. One day at work, Schmerz is informed that various students and administration members are complaining about his constant negativity. Schmerz is asked to attend a discussion with a previous student who became a famous film director, who mocks Schmerz’s teaching and encourages the students to drop out. Schmerz creates a bomb and attaches it to Wiener-Dog. Students notice and contact authorities. Dave gets stopped by authorities investigating the incident on the way home and willingly identifies himself.\n\nElderly Nana, who lives with her caregiver Yvette, is Wiener-Dog’s final owner. She names her \"Cancer.\" Nana receives a call from her granddaughter Zoe, who is on her way to visit for the first time in several years, along with her boyfriend Fantasy, a conceptual artist. Once Zoe arrives, she asks for money in order to pay for Fantasy's new art project. Nana agrees to give her the money. While filling out the check, Zoe confides in her Nana, wondering if Fantasy is cheating on her. Once Zoe leaves, Nana goes outside and sits with Wiener-Dog, where she dreams about a younger version of herself coming back to show her what her life could have been if she had been more positive. She wakes up to discover Wiener-Dog has run away. She then spots Wiener-Dog being run over and killed by a truck.\n\nSix months later, a stuffed animatronic Wiener-Dog is displayed in Fantasy's art exhibit.",
  "synopsis": null
}