{
  "imdb_id": "tt3447364",
  "tmdb_id": "320295",
  "douban_id": null,
  "title": "Detective Byomkesh Bakshy! (2015)",
  "genres": [
    "Action",
    "Mystery",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "139 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.7,
  "director": [
    {
      "id": "nm1962313",
      "name": "Dibakar Banerjee"
    }
  ],
  "writer": [
    {
      "id": "nm1257497",
      "name": "Urmi Juvekar",
      "description": "written by &"
    },
    {
      "id": "nm1962313",
      "name": "Dibakar Banerjee",
      "description": "written by"
    },
    {
      "id": "nm0051779",
      "name": "Saradindu Bandopaddhyay",
      "description": "based on the stories and characters created by"
    }
  ],
  "cast": [
    {
      "id": "nm3818286",
      "name": "Sushant Singh Rajput",
      "character": "Byomkesh Bakshy"
    },
    {
      "id": "nm2945270",
      "name": "Anand Tiwari",
      "character": "Ajit Banerjee"
    },
    {
      "id": "nm4173131",
      "name": "Neeraj Kabi",
      "character": "Dr. Anukul Guha /              Yang Guang"
    },
    {
      "id": "nm7072115",
      "name": "Divya Menon",
      "character": "Satyawati"
    },
    {
      "id": "nm3054665",
      "name": "Swastika Mukherjee",
      "character": "Anguri Devi"
    },
    {
      "id": "nm2738962",
      "name": "Meiyang Chang",
      "character": "Kanai Dao"
    },
    {
      "id": "nm1204791",
      "name": "Mark Bennington",
      "character": "Deputy Commissioner Wilkie"
    },
    {
      "id": "nm0452855",
      "name": "Taka Higuchi",
      "character": "Dr. Watanabe       (as Takanori Kikuchi)"
    },
    {
      "id": "nm7072116",
      "name": "Shivam",
      "character": "Sukumar"
    },
    {
      "id": "nm7072117",
      "name": "Kaushik Ghosh",
      "character": "Gajanan Sikdar"
    },
    {
      "id": "nm3424482",
      "name": "Anindya Pulak Banerjee",
      "character": "Prafulla Ray"
    },
    {
      "id": "nm3519074",
      "name": "Arindol Bagchi",
      "character": "Ashwini Babu"
    },
    {
      "id": "nm7072119",
      "name": "Peter Wong",
      "character": "Underboss"
    },
    {
      "id": "nm7072120",
      "name": "Pradipto Kumar Chakraborty",
      "character": "Puntiram"
    },
    {
      "id": "nm7072121",
      "name": "Manoshi Nath",
      "character": "Ruby"
    },
    {
      "id": "nm7072122",
      "name": "Moumita Chakraborty",
      "character": "Leela"
    },
    {
      "id": "nm7072123",
      "name": "Tirtha Mallick",
      "character": "Atanu Chandra Sen"
    },
    {
      "id": "nm7072127",
      "name": "Shaktipada Dey",
      "character": "Nibaran Da"
    },
    {
      "id": "nm3374021",
      "name": "Prasun Gayen",
      "character": "Journalist       (as Prasun Gain)"
    },
    {
      "id": "nm5992648",
      "name": "Aryann Bhowmick",
      "character": "Clinic Boy       (as Aryann Bhaumik)"
    },
    {
      "id": "nm7072130",
      "name": "Nishant Kumar",
      "character": "Factory Watchmen"
    },
    {
      "id": "nm7072126",
      "name": "Prashant Kumar",
      "character": "Factory Watchmen"
    },
    {
      "id": "nm7072128",
      "name": "Sandip Bhattacharya",
      "character": "Officer in Charge"
    },
    {
      "id": "nm7072129",
      "name": "Piyali Ray",
      "character": "Watanabe's Receptionist"
    },
    {
      "id": "nm8732335",
      "name": "Kanwaljeet Singh Banga",
      "character": "Sikh Taxi Driver"
    }
  ],
  "overview": "In a contemporary interpretation of war torn Calcutta during the 1940's, the film follows the first adventure of Byomkesh (Sushant Singh Rajput), fresh out of college, as he pits himself against an evil genius who is out to destroy the world. It's his wits against the most villainous arch criminal the world has seen, in a world of murder, international political intrigue and seduction.",
  "storyline": "\"CALCUTTA 1943 A WAR - A MYSTERY - and A DETECTIVE\" Detective Byomkesh Bakshy is based on the early exploits of India's first true-blue detective, created by Bengali bestseller writer Saradindu Bandyopadhyay. Directed by Dibakar Banerjee, the film is set in the Second World War torn Calcutta during the 1940s and follows the first adventure of Byomkesh Bakshy (Sushant Singh Rajput), fresh out of college, as he pits himself against an evil genius who is out to destroy the world. Using his wits against the most villainous arch criminal the world has seen, in a world of murder, international political intrigue and seduction.",
  "plot": "In 1942 Calcutta in a vicious fight at the Calcutta docks Yang Guang is thought to be killed.\n\nSome time later, in Calcutta, student Byomkesh Bakshy (Sushant Singh Rajput) is approached by a classmate, Ajit (Anand Tiwari), whose father Bhuvan Banerjee, a chemist, has been missing for more than two months. Byomkesh believes that he has been killed and his dead body kept hidden somewhere so that the case remains that of missing person. Initially, Byomkesh refuses to help in finding Ajit's missing father Bhuvan babu and even suggests Bhuvan may be mixed up in dodgy business, at which Ajit angrily slaps him. Byomkesh's girlfriend Leela plans to marry an employed chemistry student instead of him and tells him on the same day. After that Byomkesh finds Ajit and agrees to take a look. He checks Ajit's fathers belongings and is convinced that there is more to it than what meets the eyes. He tries to find out more by going to Bhuvan's lodging home and ask the residents namely Dr. Guha (Neeraj Kabi), Ashwini Babu (Arindol Bagchi) and Kanai Dao (Meiyang Chang) who is an government licensed opium merchant. He also finds Bhuvan's paan box hidden in his room by his roommate Ashwini Babu who seems to be addicted to the betel masala in it. Byomkesh deduces that since Bhuvan did not take his money and other belongings, he was not planning to go anywhere so the most likely scenario is that he must be dead.\n\nByomkesh finds the factory where Bhuvan worked. There he meets an actress, Angoori Devi (Swastika Mukherjee), who offers him a ride home. During the journey, Byomkesh asks her about Bhuvan, but she seems frightened and tries to hide something in her handbag, which is later found out to be blackmail letters addressed to Gajanan Sikdar, a local politician who is the owner of the factory and also a friend of Angoori.\n\nByomkesh deduces, with the help of Dr. Guha, that Bhuvan tried to blackmail Sikdar and was killed by him. He goes back to the factory with Dr. Guha and finds Bhuvan's rotting corpse stuffed inside a machine. Sikdar is brought in by police commissioner Wilkie (Mark Bennington) for questioning. Simultaneously Byomkesh finds some clues which prove that Sikdar is being framed. He immediately goes to the police station and rectifies his mistake, where he is also detained afterwards for impersonating a police-officer previously.\n\nSikdar is freed and Byomkesh follows him home but is stopped by Angoori before entering Sikdar's room. She takes him to another room. He gently rebuffs her but when he goes to meet Sikdar, the latter is already poisoned and dies in front of Byomkesh. Suspicion falls on his rebellious nephew Sukumar who has opened a rival political party and is militant about India's freedom from the British. Meanwhile Dr. Guha manages to vanish but sends Byomkesh an envelope containing the post stamp, indirectly admitting he was blackmailing Sikdar, not Bhuvan Babu.\n\nAfter that Sukumar's sister Satyawati (Divya Menon) pleads with Byomkesh to help her brother, who's driven off earlier in a cab which Byomkesh used to follow Sikdar till his home. Byomkesh finds the Sikh cabbie who takes him to the point he dropped off Sukumar, which turns out to be a clinic of the Japanese dentist Dr. Watanabe. In the clinic the dentist's secretary says Watanabe is at the temple. Byomkesh and Ajit go to the temple, pretending they have a link with Sukumar's political party, but Watanabe is suspicious. Another member of Sukumar's party recognises them and follows them at Watanabe's orders. Byomkesh and Ajit confuses him by changing their costumes and then follow the student back to the dentist's – where they find both the secretary and student brutally murdered with a shadowy character escaping in a car.\n\nByomkesh takes a paper out from the student's pocket which they later find out is a map of Calcutta's river route. They return to the lodgers' house where Byomkesh feels low. He tries some of Bhuvan's betel masala, gets high, and makes a wall-painting of the entire crime. Next day he goes to get his blood tested, as well as a chemical analysis of the masala. It is revealed that his blood had heroin presence confirmed by Leela's chemist husband who says this heroin is very hard to trace and made from opium which Dao, who later is revealed to be an undercover police officer, tells Byomkesh has practically vanished from the city. Also the masala is literally clean, i.e. there is no trace of heroine in it.\n\nByomkesh finds there are two plots together here. The first is the Chinese gang warfare over opium, turned into untraceable heroin by Bhuvan babu's secret formula. The second is of Sukumar's political party being told by the Japanese army that they will land in Calcutta via its river routes and liberate the city from the British. The link between the two deadly plots is the mysterious Yang Guang. Yang Guang is presumed dead in a gang war sometime back, but in light of recent events it is understood that he is very much alive and in Calcutta itself.\n\nMeanwhile, Dr. Guha returns to the lodging house and tells Byomkesh he's a nationalist fighting for India's freedom. He offers Byomkesh a role to play in the struggle and says that the murders were collateral damage. Byomkesh refuses.\n\nLater Byomkesh asks Dao to take him to the Chinese gang which tells him about Guang. Byomkesh divulges some of the facts to commissioner Wilkie and asks him to sound all the air raid sirens of Calcutta at 4 am on Basant Panchami, because he realises that Sukumar and his sister were mere pawns in the plot and they will come in harms way one way or another . He is convinced the Japanese will attack Calcutta through its river routes then and Guang will help them, so that they let him control the hugely rich opium trade, and turn Calcutta into the drug capital of the world.\n\nByomkesh sends Dr. Guha a letter inviting him to the lodging house. Dr. Guha, Sukumar, Watanabe and Satyawati come there, as does Angoori who told Byomkesh she loved Guang from their days together in Rangoon and has been trying to mislead Byomkesh on Guang's orders. She hasn't seen him recently though and doesn't recognise him – not even when Byomkesh reveals Dr. Guha is actually the dreaded Yang Guang.\n\nAngoori tries to stop Guang from helping the Japanese conquer Calcutta but he brutally murders her. The Chinese gang hidden by Byomkesh in the lodging house then attacks and takes away Guang who got distracted by the air sirens going off. Byomkesh, playing a bluff tells the Japanese doctor their game is up and the British army will crush their forces if they try to attack. Watanabe gives up and leaves in a hurry to warn the Japanese army. Byomkesh then tells Ajit that he would like to believe Bhuvan is innocent. On realising the danger of his invention, he tries to prevent it from falling into wrong hands, and gets killed. Byomkesh then proposes marriage to Satyawati, who accepts.\n\nIn the epilogue, Guang manages to kill the entire Chinese gang and – though injured – escapes, promising Byomkesh revenge.",
  "synopsis": "Synopsis as provided by Srijana Mitra Das in the Times of India (4 April 2015):It's 1942 and Calcutta is ruled by the British Raj. Its underworld is ruled by Chinese gangsters smuggling opium from Shanghai. A vicious fight breaks out within one such gang at the Calcutta docks where gangster Yun Gong brutally blinds one rival and is then thought to be killed.Meanwhile, bright student Byomkesh Bakshy (Sushant) is approached by Ajit Banerjee for help in finding his missing father Bhuvan babu. Initially, Byomkesh refuses and even suggests Bhuvan may be mixed up in dodgy business, at which Ajit angrily slaps him. The same day, Byomkesh's girlfriend Leela tells him she's marrying a well-placed chemistry student instead of him.Byomkesh seeks out Ajit and agrees to take his case. He visits Bhuvan's lodging home and meets Dr. Guha and Kanai Dao who legally sells opium. He also finds Bhuvan's beloved paan box is still in his room, hidden by his roommate who's oddly addicted to the paan masala. Byomkesh is convinced Bhuvan has been killed as his box and money are still in his room.Byomkesh visits the Sikdar chemical factory, now shut down, where Bhuvan used to work. There he sees film star Angoori taking a swim. She's amused by him and offers him a ride home. In the car, when he asks if she knows of Bhuvan, she pulls her handbag nervously to herself. In her studio, as she shoots, Byomkesh opens the bag and finds letters from cut-out newspapers, blackmailing the factory owner Sikdar babu, a friend of Angoori's.He's convinced Sikdar has killed Bhuvan when the latter tried to blackmail him. Byomkesh goes back to the factory with Dr. Guha and they pretend to the watchmen that they've come to fix a mouse problem. Poking around in the factory, they find Bhuvan's slashed, decomposed body stuffed into a machine.Sikdar is brought in by police commissioner Wilkie for questioning - but just then, Byomkesh discovers he's wrong and Sikdar is being framed as the newspapers only reach the lodging house at 8:30 AM every day while the blackmail letters were stamped at 7:30 AM at the post office, showing a false detail. Dr. Guha vanishes but sends Byomkesh a note, admitting he was blackmailing Sikdar, not Bhuvan babu.Sikdar is freed and Byomkesh follows him home but is detained by Angoori who tries to kiss him. He gently rebuffs her but when he goes to meet Sikdar, the latter is suddenly poisoned and dies. Suspicion falls on his rebellious nephew Sukumar who has opened a rival political party and is militant about India's freedom from the British. Sukumar's sister Satyawati pleads with Byomkesh to help her brother, who's driven off earlier in a cab used by Byomkesh.Byomkesh finds the Sardarji cabbie Sukumar drove off with, reaching a Japanese dentist Dr. Watnabe's clinic where the secretary says Watanabe is at the temple. Byomkesh and Ajit go to the temple, pretending they have a link with Sukumar's political party, but Watanabe is suspicious. Another member of Sukumar's party recognizes them and follows them at Watanabe's orders. Byomkesh and Ajit change their costumes and then follow the student back to the dentist's - where they find the secretary and student brutally murdered with a shadowy character escaping in a car.Byomkesh takes a paper out from the student's pocket - it's a map of Calcutta's river route. They return to the lodgers' house where Byomkesh feels low. He tries some of Bhuvan babu's paan masala and finds it is laced with heroin. Making a wall-painting of the entire crime, Byomkesh has the heroin presence confirmed by Leela's chemist husband who says this heroin is very hard to trace and made from opium - which Dao, who admits he's an undercover cop, tells Byomkesh has practically vanished from the city.Byomkesh finds there are two plots together here. The first is the Chinese gang warfare over opium, turned into untraceable heroin by Bhuvan babu's secret formula. The second is of Sukumar's political party being told by the Japanese army that they will land in Calcutta via its river routes and liberate the city from the British.The link between the two deadly plots is the mysterious Yun Gong.Meanwhile, Dr. Guha returns to the lodging house and tells Byomkesh he's a nationalist fighting for India's freedom. He offers Byomkesh a role to play in the struggle and says other peoples' murders are the price for this. Byomkesh asks Dao to take him to the Chinese gang which tells him about the deadly Gong. Byomkesh divulges all the facts to commissioner Wilkie and asks him to sound all the air raid sirens of Calcutta at 4 AM on Basant Panchami. He is convinced the Japanese will attack Calcutta through its river routes then and Gong will help them, so that they let him control the hugely rich opium trade.Byomkesh sends Dr. Guha a letter inviting him to the lodging house. Dr. Guha, Sukumar, Watanabe and Satyawati come there, as does Angoori who's told Byomkesh she's loved Gong from their days together in Rangoon and has been trying to mislead Byomkesh on Gong's orders. She hasn't seen him recently though and doesn't recognize him - not even when Byomkesh reveals Dr. Guha is actually the dreaded Gong.Angoori tries to stop Gong from helping the Japanese conquer Calcutta but he brutally murders her. The Chinese gang hidden by Byomkesh in the lodging house then attacks and takes away Gong who gets distracted by the air sirens going off. Byomkesh tells the Japanese doctor their game is up and the British army will crush their forces if they try to attack. He gives up.Byomkesh then tells Satywati he wants to marry her as the price for proving Sukumar's innocence. Meanwhile, Gong manages to kill the entire Chinese gang and escapes - promising Byomkesh revenge."
}