{
  "imdb_id": "tt3451500",
  "tmdb_id": "262697",
  "douban_id": null,
  "title": "Sürgün Inek (2014)",
  "genres": [
    "Comedy"
  ],
  "country": "Turkey",
  "version": [
    {
      "runtime": "122 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.4,
  "director": [
    {
      "id": "nm2375975",
      "name": "Ayhan Özen"
    }
  ],
  "writer": [
    {
      "id": "nm4368616",
      "name": "Serkan Ozturk",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4373784",
      "name": "Ozan Akbaba",
      "character": "Selçuk"
    },
    {
      "id": "nm1699257",
      "name": "Vildan Atasever",
      "character": "Gulay Ogretmen"
    },
    {
      "id": "nm5424658",
      "name": "Ihsan Berk Aydin",
      "character": "Ercan"
    },
    {
      "id": "nm0063400",
      "name": "Iskender Bagcilar",
      "character": "Lawmaker Ayhan       (as Ýskender Baðcýlar)"
    },
    {
      "id": "nm0059941",
      "name": "Cezmi Baskin",
      "character": "Muhtar Sami"
    },
    {
      "id": "nm3807128",
      "name": "Savas Bayindir",
      "character": "Resit"
    },
    {
      "id": "nm0075299",
      "name": "Cahit Berkay",
      "character": "Azrail"
    },
    {
      "id": "nm4873935",
      "name": "Sadi Celil Cengiz",
      "character": "Burak"
    },
    {
      "id": "nm1815460",
      "name": "Erdal Cindoruk",
      "character": "Hasan Yilmaz Sahintürk"
    },
    {
      "id": "nm1855926",
      "name": "Bedia Ener",
      "character": "Sariye"
    },
    {
      "id": "nm0257826",
      "name": "Köksal Engür",
      "character": "Israfil Dede"
    },
    {
      "id": "nm0344348",
      "name": "Yilmaz Gruda",
      "character": "Cebrail Dede"
    },
    {
      "id": "nm4225874",
      "name": "Tolga Güleç",
      "character": "Nazim"
    },
    {
      "id": "nm1698887",
      "name": "Hasan Kaçan",
      "character": "Sevket Cetin"
    },
    {
      "id": "nm0457885",
      "name": "Ugur Kivilcim",
      "character": "Melek Teyze"
    },
    {
      "id": "nm0463953",
      "name": "Esref Kolçak",
      "character": "Mikail Dede"
    },
    {
      "id": "nm3784534",
      "name": "Necip Memili",
      "character": "Imam Ahmet"
    },
    {
      "id": "nm2841302",
      "name": "Ahmet Ilker Okumus",
      "character": "Komutan"
    },
    {
      "id": "nm4368616",
      "name": "Serkan Ozturk",
      "character": "Mufettis Sezgin Icli"
    },
    {
      "id": "nm0655076",
      "name": "Tarik Pabuccuoglu",
      "character": "Kenan"
    },
    {
      "id": "nm3807207",
      "name": "Firat Pasayigit",
      "character": "Kahveci"
    },
    {
      "id": "nm6201969",
      "name": "Sarikiz",
      "character": "Sarikiz"
    },
    {
      "id": "nm5188998",
      "name": "Burak Satibol",
      "character": "Okul Muduru"
    },
    {
      "id": "nm2409214",
      "name": "Ali Savasçi",
      "character": "Hamdi"
    },
    {
      "id": "nm1870668",
      "name": "Hüseyin Soysalan",
      "character": "Dilaver"
    },
    {
      "id": "nm0845578",
      "name": "Sebnem Sönmez",
      "character": "Cemile Cetin"
    },
    {
      "id": "nm1295127",
      "name": "Firat Tanis",
      "character": "Nihat Cetin"
    },
    {
      "id": "nm3669004",
      "name": "Ayhan Tas",
      "character": "Funeral Car Driver"
    },
    {
      "id": "nm1855469",
      "name": "Mine Teber",
      "character": "Hacer"
    },
    {
      "id": "nm3372160",
      "name": "Levent Çimen",
      "character": "Bakkal Fahri"
    },
    {
      "id": "nm2053211",
      "name": "Bülent Çolak",
      "character": "Saffet"
    },
    {
      "id": "nm4605763",
      "name": "Yüksel Ünal",
      "character": "Butcher (Kasap)       (as Yüksel Unal)"
    }
  ],
  "overview": "The year 1997... In the days when people are exiled for their thoughts, now the tables have turned and the freedom of a cow living in the village of Gomalak is in danger.  \"The Exiled Cow\". inspired from a true story, tells the tale of Sarikiz, with its spectacular cast and now meets the audience as the comedy of the century...",
  "storyline": "The year 1997... In the days when people are exiled for their thoughts, now the tables have turned and the freedom of a cow living in the village of Gomalak is in danger.Sevket and Cemile is a decent couple, who love one another, and their cow Sarikiz, very much. The life of this couple turns into a turmoil after their cow destroys the bust of Ataturk. They witness the accident growing into a disaster, growing across the borders of their village. Everybody starts chasing after this cow; from the village head to the bureaucrats, from the soldiers to the elderly men. The issue grows bigger and bigger and everybody, with the smallest possible link, find themselves in a tragicomic situation. The whole thing turns into a comedy show. How will our heroes survive this situation? Will the imprisoned Sarikiz be able to return to her good old days?\"The Exiled Cow\". inspired from a true story, tells the tale of Sarikiz, with its spectacular cast and now meets the audience as the comedy of the ...",
  "plot": "The main cast of Predator. Left to right: Ventura, Black, Schwarzenegger, Duke, Weathers, Landham, and Chaves\nA spacecraft flies near Earth and deposits a bright object which enters the atmosphere. In the Val Verde jungle, Major Alan \"Dutch\" Schaefer and his six-man team, consisting of mercenary Mac Elliot, tracker and recon specialist Billy Sole, support gunner Blaine Cooper, demolitions and explosives expert Jorge \"Poncho\" Ramírez, and radio operator Rick Hawkins, are tasked by the CIA with rescuing an official held hostage by insurgents. CIA agent and liaison Colonel George Dillon, a former commando and an old friend of Dutch's, is assigned to supervise the team despite Dutch's reservations.\n\nThe team discovers the wreckage of a chopper and three skinned corpses, whom Dutch identifies as members of a U.S. Army Special Forces unit he knew personally. They reach the insurgent camp and kill the soldiers, including a Soviet intelligence officer searching through secret CIA documents. Confronted by Dutch, Dillon admits the mission was a setup to retrieve intelligence from captured operatives and that the dead unit disappeared weeks earlier in a failed rescue. After capturing a guerilla named Anna, the group proceeds to extraction, unaware that they are being tracked with thermal imaging by an unseen observer.\n\nAnna escapes and is chased by Hawkins, but they are ambushed by the creature. It spares Anna but kills Hawkins and drags his body away. Dutch organizes a manhunt, during which Blaine is killed by the creature's plasma weapon. An enraged Mac initiates a firefight which wounds the creature, revealing luminescent green blood, but fails to draw it out. The unit regroups and questions Anna, learning that their stalker is a creature locals call \"el demonio que hace trofeos de los hombres\", the demon who makes trophies of men.\n\nThat night, Mac mistakes a wild pig for the creature and kills it. In the confusion, the creature steals Blaine's body, leading Dutch to realize their enemy uses the trees to travel. The next day, an attempt to trap the creature fails, leaving Poncho injured. Mac and Dillon pursue the alien but it outwits and kills them both. It catches up with the others, killing Billy and Poncho and wounding Dutch.\n\nRealizing the creature does not target unarmed prey because there is \"no sport\", Dutch sends Anna to the helicopter unarmed. The creature pursues him through a river, causing its cloaking device to malfunction. Though the creature is only a few feet from Dutch, he does not see him and moves on. Dutch realizes that mud covering his body is masking his heat signature from the creature's thermal sensor.\n\nWhile the creature removes the spinal columns from the bodies, Dutch crafts traps and weapons and lures the creature with a war cry. He disables its cloaking device and inflicts minor injuries, but is cornered. Acknowledging Dutch as a worthy foe, the creature discards its mask and weapon and engages him in hand-to-hand combat. Dutch is almost beaten but crushes the creature under a counterweight. As the creature lies dying, Dutch asks \"What the hell are you?\", but it simply repeats the question in garbled English before activating a self-destruct device, echoing Billy's laughter as the countdown begins. Dutch takes cover just before the self-destruct device explodes in a mushroom cloud. He is picked up by his commander, General Phillips, and finds Anna in the helicopter.",
  "synopsis": "The year 1997... In the days when people are exiled for their thoughts, now the tables have turned and the freedom of a cow living in the village of Gomalak is in danger.Sevket and Cemile is a decent couple, who love one another, and their cow Sarikiz, very much. The life of this couple turns into a turmoil after their cow destroys the bust of Ataturk. They witness the accident growing into a disaster, growing across the borders of their village. Everybody starts chasing after this cow; from the village head to the bureaucrats, from the soldiers to the elderly men. The issue grows bigger and bigger and everybody, with the smallest possible link, find themselves in a tragicomic situation. The whole thing turns into a comedy show. How will our heroes survive this situation? Will the imprisoned Sarikiz be able to return to her good old days?\"The Exiled Cow\". inspired from a true story, tells the tale of Sarikiz, with its spectacular cast and now meets the audience as the comedy of the century..."
}