{
  "imdb_id": "tt3436066",
  "tmdb_id": "297053",
  "douban_id": null,
  "title": "Return of the River (2014)",
  "genres": [
    "Documentary",
    "Drama",
    "History"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "69 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.4,
  "director": [
    {
      "id": "nm6185873",
      "name": "John Gussman"
    },
    {
      "id": "nm6182013",
      "name": "Jessica Plumb"
    }
  ],
  "writer": [
    {
      "id": "nm6182013",
      "name": "Jessica Plumb",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm8813039",
      "name": "Environmental Activists",
      "character": "Themselves"
    },
    {
      "id": "nm8813038",
      "name": "Lower Elwha Kllalam Tribe Ben Charles",
      "character": "Himself"
    },
    {
      "id": "nm8813037",
      "name": "Lower Elwha Klallam Tribe Frances Charles",
      "character": "Himself"
    },
    {
      "id": "nm3774322",
      "name": "Debbe Hirata",
      "character": "(voice)"
    },
    {
      "id": "nm8813040",
      "name": "Scientists",
      "character": "Themselves"
    },
    {
      "id": "nm0000643",
      "name": "Tom Skerritt",
      "character": "Grant Humes       (voice)"
    }
  ],
  "overview": "A documentary on the world's largest dam removal project and its effects on the river ecosystem and surrounding communities.",
  "storyline": "'Return of the River' tells the story the largest dam removal in history, currently unfolding on the Elwha River in Washington State. The film explores an extraordinary community effort to set the river free, and shows an unlikely victory for environmental justice. Told by an ensemble cast of characters, 'Return of the River' offers hope amid grim environmental news, chronicling a dramatic success story that has drawn international attention to the Olympic Peninsula.",
  "plot": "Set in the Northwestern United States in 1875, the film focuses on taciturn widower Matt Calder (Robert Mitchum), who recently has been released from prison after serving time for killing one man while defending another. He arrives in a boomtown tent city in search of his ten-year-old son Mark (Tommy Rettig), who was left in the care of dance hall singer Kay (Marilyn Monroe) after the man who brought him there as Matt had arranged took off for the hills. Matt promises Mark, a virtual stranger to him, the two will enjoy a life of hunting, fishing and farming on their homestead.\nRobert Mitchum with Tommy Rettig in a scene from the film\nKay's fiance, gambler Harry Weston (Rory Calhoun), tells her they must go to Council City to file the deed on a gold mine he won in a poker game. They head downriver on a homemade log raft, and when they encounter trouble in the rapids near the Calder farm, Matt and Mark rescue them. Harry offers to buy Matt's rifle and horse so as to reach Council City by land, and when Matt refuses, Harry knocks Matt unconscious and steals both. Kay chooses to stay behind to take care of Matt and Mark, and the three are stranded in the wilderness.\n\nWhen hostile Indians threaten the farm, the three are forced to escape down the river on Harry's raft. That night they set up camp by the river, and Matt and Kay argue about the wisdom of pursuing Harry. Matt questions why she would choose to marry a man who had endangered a child, and she reminds him Harry never killed a man like he did. Mark overhears their discussion, and Matt is forced to reveal the truth about his past to his son, who is unable to comprehend why his father acted as he did.\n\nAs the three continue their journey, Kay comes to appreciate Matt's bravery and the tender way he cares for both her and Mark. Along the way, they are forced to deal with a series of trials and tribulations, including a mountain lion attack; gold prospectors Sam Benson and Dave Colby, who are after Harry for stealing their claim; and fighting off a second Indian war party.\n\nAfter a difficult ride through the worst of the rapids, the three arrive in Council City and confront Harry. Harry shoots at Matt, forcing Mark to kill Harry with a rifle he is inspecting in the general store, and the boy finally understands why his father had to shoot a man so many years before. Kay finds a job at the local saloon. While she is singing there, Matt arrives to take her back to his farm along with Mark, and she happily leaves with him.",
  "synopsis": null
}