{
  "imdb_id": "tt3457734",
  "tmdb_id": "253255",
  "douban_id": null,
  "title": "Fort Tilden (2014)",
  "genres": [
    "Comedy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "98 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.4,
  "director": [
    {
      "id": "nm3975695",
      "name": "Sarah-Violet Bliss"
    },
    {
      "id": "nm4054218",
      "name": "Charles Rogers"
    }
  ],
  "writer": [
    {
      "id": "nm3975695",
      "name": "Sarah-Violet Bliss",
      "description": "story"
    },
    {
      "id": "nm3975695",
      "name": "Sarah-Violet Bliss",
      "description": "writer"
    },
    {
      "id": "nm3720904",
      "name": "Brian Lannin",
      "description": "story"
    },
    {
      "id": "nm4054218",
      "name": "Charles Rogers",
      "description": "story"
    },
    {
      "id": "nm4054218",
      "name": "Charles Rogers",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm2416507",
      "name": "Bridey Elliott",
      "character": "Harper"
    },
    {
      "id": "nm3631940",
      "name": "Clare McNulty",
      "character": "Allie"
    },
    {
      "id": "nm2654481",
      "name": "Neil Casey",
      "character": "Ebb"
    },
    {
      "id": "nm1130496",
      "name": "Alysia Reiner",
      "character": "Cobble Hill Mom"
    },
    {
      "id": "nm2551886",
      "name": "Reggie Watts",
      "character": "Reggie Watts"
    },
    {
      "id": "nm1969645",
      "name": "Griffin Newman",
      "character": "Sam"
    },
    {
      "id": "nm0769027",
      "name": "Jeffrey Scaperrotta",
      "character": "Russ"
    },
    {
      "id": "nm0114430",
      "name": "Peter Vack",
      "character": "Benji"
    },
    {
      "id": "nm0934983",
      "name": "Mark Wing-Davey",
      "character": "Harper's Dad       (voice)"
    },
    {
      "id": "nm2654402",
      "name": "Will Hines",
      "character": "Abusive Cobble Hill Man"
    },
    {
      "id": "nm3060644",
      "name": "Max Jenkins",
      "character": "Ashley"
    },
    {
      "id": "nm4696553",
      "name": "John Early",
      "character": "John"
    },
    {
      "id": "nm4246505",
      "name": "Evan Hoyt Thompson",
      "character": "Grant"
    },
    {
      "id": "nm6183364",
      "name": "Desireé Nash",
      "character": "Marin"
    },
    {
      "id": "nm2386006",
      "name": "Becky Yamamoto",
      "character": "Amanda"
    },
    {
      "id": "nm1217827",
      "name": "Debargo Sanyal",
      "character": "Samrat"
    },
    {
      "id": "nm3277715",
      "name": "Rob Michael Hugel",
      "character": "Painter with Barrell"
    },
    {
      "id": "nm3378225",
      "name": "Ann Carr",
      "character": "Angry Neighbor"
    },
    {
      "id": "nm6230758",
      "name": "Allyson Kaye Daniel",
      "character": "Cabiria       (voice)"
    },
    {
      "id": "nm2897602",
      "name": "Phoebe Tyers",
      "character": "Naomi       (as Pheobe Tyers)"
    },
    {
      "id": "nm2897188",
      "name": "Claire Tyers",
      "character": "Leia"
    },
    {
      "id": "nm3574809",
      "name": "Elia Monte-Brown",
      "character": "Lucy"
    },
    {
      "id": "nm3268424",
      "name": "Avery Monsen",
      "character": "Concerned Cobble Hill Man"
    },
    {
      "id": "nm6086396",
      "name": "Hallie Haas",
      "character": "Mia"
    },
    {
      "id": "nm6061508",
      "name": "Christine Spang",
      "character": "Sage"
    },
    {
      "id": "nm3940476",
      "name": "Jarreau Carrillo",
      "character": "Cobble Hill iPhone Videographer"
    },
    {
      "id": "nm1200804",
      "name": "Teresa Yenque",
      "character": "Deli Manager"
    },
    {
      "id": "nm2651661",
      "name": "Gladys Nilsen",
      "character": "Ice Coffee Maker"
    },
    {
      "id": "nm4684309",
      "name": "Shacottha Fields",
      "character": "Discount Store Shopper"
    },
    {
      "id": "nm5423860",
      "name": "Michael Guagno",
      "character": "911 Operator       (voice)"
    },
    {
      "id": "nm6230762",
      "name": "Dovid Schwartz",
      "character": "Not a Cab Driver"
    },
    {
      "id": "nm3253820",
      "name": "Ryan Bennett",
      "character": "Guy with Gaping Mouth"
    },
    {
      "id": "nm2719644",
      "name": "Shiva Shankar Bajpai",
      "character": "Flirt"
    },
    {
      "id": "nm4583362",
      "name": "Sarah Burkhalter",
      "character": "Obnoxious Suck Up"
    },
    {
      "id": "nm6230759",
      "name": "Evan McGorty",
      "character": "Bike Pump Boy"
    },
    {
      "id": "nm4054218",
      "name": "Charles Rogers",
      "character": "Idiot 1"
    },
    {
      "id": "nm3975695",
      "name": "Sarah-Violet Bliss",
      "character": "Idiot 2"
    },
    {
      "id": "nm6230760",
      "name": "Colm McEnery",
      "character": "Cobble Hill Baby"
    },
    {
      "id": "nm3628366",
      "name": "Tim Wong",
      "character": "Bike Thief"
    },
    {
      "id": "nm3324499",
      "name": "Richard Millen",
      "character": "Creepy Running Man"
    }
  ],
  "overview": "Twenty-something Brooklynites Allie and Harper are directionless, privileged, and just a tiny bit damaged. All they want is to get to the beach, where a drug-fueled afternoon with cute boys awaits them. Alas, the journey becomes needlessly complicated, as the girls’ bike ride from Williamsburg to Fort Tilden Beach is littered with a barrage of unfriendly circumstances and the realization that their life skills are more limited than they should be.",
  "storyline": "Fort Tilden: New York City's secluded seaside nirvana where, like flies to honey, Brooklyn's hip millennial set flocks on sweltering weekend afternoons for unbridled summertime indulgence. Amidst the vexing stagnation of quarter-life crises, Allie (Clare McNulty) struggles to prepare for the Peace Corps, while Harper (Bridey Elliot) awaits checks from her father to fund her artistic dreams. But the two friends quickly shun responsibilities for the day when a pair of good-looking guys invites them along for a carefree Fort Tilden afternoon. As the two young women board their fixed-gear bicycles and embark on a lengthy journey to the beach, they quickly realize that, akin to their confusing, transitioning lives, they neither know where they're going nor how they plan to get there. The debut feature film of directors Sarah-Violet Bliss and Charles Rogers - and showcasing the comedic versatility of Clare McNulty and Bridey Elliott as Allie and Harper - \"Fort Tilden\" is a hilariously ...",
  "plot": "While at a rooftop gathering for their twin musician friends, roommates Allie (Claire McNulty) and Harper (Bridey Elliot) meet two guys, Russ and Sam. After the boys announce that they will be spending the day at Fort Tilden the girls make plans to meet them and bring them molly.\n\nThe following day, after realizing that the ferries are closed, the girls decide to bike to Fort Tilden and borrow a bike from their upstairs neighbor, Ebb. They pick up the drugs from Harper's friend Benji, who mocks her for being a dilettante who only pretends to be an artist. While riding through Brooklyn Harper has them stop in front of a cheap clothing store. When Allie realizes that she has not brought a bike lock, Harper urges her to simply wrap the chain around the bikes. While standing in line they watch as a boy steals Allie's bike, but because of their hesitation whether to confront him or not he easily makes off with the bike. Harper urges Allie to leave Ebb's bike behind, which she eventually does, covering it in trash so that it will not be stolen.\n\nThe girls call a cab driver who offers to take them to Fort Tilden for a hundred dollars. While in the car Allie grows frustrated because her contact for the Peace Corps, Cabiria, keeps contacting her in order to obtain her information. Giving up on her Harper makes small talk with the driver, who is from Calcutta and mentions having been there. However, after Harper mentions what her father does they are thrown out of the car by the cabbie, who tells her her father is a horrible man and a criminal.\n\nThe girls walk the rest of the way to Fort Tilden, but upon arrival at the beach discover they are at Jacob Riis Park. Wandering around they stumble upon three abandoned kittens whom they decide to rescue. While walking Allie receives a text from Cabiria, who asks her how she is enjoying the beach and Allie realizes that Harper posted a picture of her in her bathing suit on Instagram. Frustrated, the girls abandon the kittens in a trash can, reasoning that they left them better than they found them.\n\nAs they continue to look for Fort Tilden they receive a text from the boys that they are at Jacob Riis. The girls finally return there and on their way finally pass Fort Tilden. Upon arrival at Jacob Riis they see the boys are with two girls who are topless. Reluctantly, Harper and Allie take their tops off too. Despite the fact that the sun is going down Harper pulls Russ into the water where she tries to have sex with him. Meanwhile, Allie discovers through conversation that the girls, Russ and Sam are all in high school. As the four high school friends leave Sam invites Allie to his mom's house. Allie instead goes to Harper in the water and tells her the kids are in high school.\n\nAfterwards Allie and Harper call a cab and go back to their apartment in Williamsburg. On the way Harper calls 911 and tells the operator about the kittens in the trash can. He tells her to take them out as it is about to rain and they will drown. She hangs up on him.\n\nAt home Allie goes to see Ebb and tells him she abandoned his bike, is unwilling to get it, and will probably not be going into the Peace Corps after all. Returning to her apartment she sees Harper having a conversation with her father where she tells him she misses him and asks him how he figured out life at her age. After the conversation ends the two girls curl up with toast and listen to the latest song from their twin musician friends.",
  "synopsis": null
}