{
  "imdb_id": "tt3403352",
  "tmdb_id": "292388",
  "douban_id": null,
  "title": "Patria (2014)",
  "genres": [
    "Drama",
    "History"
  ],
  "country": "Italy",
  "version": [
    {
      "runtime": "88 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.5,
  "director": [
    {
      "id": "nm0267454",
      "name": "Felice Farina"
    }
  ],
  "writer": [
    {
      "id": "nm0195519",
      "name": "Luca D'Ascanio",
      "description": null
    },
    {
      "id": "nm0212611",
      "name": "Enrico Deaglio",
      "description": "book"
    },
    {
      "id": "nm0267454",
      "name": "Felice Farina",
      "description": "adaptation"
    },
    {
      "id": "nm0267454",
      "name": "Felice Farina",
      "description": null
    },
    {
      "id": "nm1148855",
      "name": "Dino Giarrusso",
      "description": "writer"
    },
    {
      "id": "nm3560396",
      "name": "Beba Slijepcevic",
      "description": "writer"
    },
    {
      "id": "nm3560396",
      "name": "Beba Slijepcevic",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0659668",
      "name": "Francesco Pannofino",
      "character": "Salvatore 'Salvo' Brogna"
    },
    {
      "id": "nm0162911",
      "name": "Roberto Citran",
      "character": "Giorgio"
    },
    {
      "id": "nm1559332",
      "name": "Carlo Giuseppe Gabardini",
      "character": "Luca"
    }
  ],
  "overview": null,
  "storyline": "The factory is being shut down and workers are being fired, the umpteenth in the Turin area. Jobs are gone, the identity is gone, certainties are gone. Salvatore Brogna, a worker climbs up the factory tower out of protest or maybe only out of blind rage, threatening to throw himself down. Giorgio, a worker and shop steward whose nature and political beliefs are opposite those of Salvatore, get there to save him from falling. The third one, who is visually impaired and autistic, is a keeper who has been hired as member of a category enjoying special protections and he joins the other two heroically climbing the tower to keep them company. During the night, abandoned by everybody, desperately waiting for some journalists to arrive, these so different points of view on the world review the last thirty years of life of the Country, the years which led them to climb that dangerous tower. Years of wasted occasions, of betrayed hopes, of crimes and massacres, of sudden reversal of majority ...",
  "plot": "Spies from Japan conspire to steal the Channing \"preparedness\" fortune and invade the United States, beginning in New York, then allying themselves with Mexicans across the border. They are stopped by the efforts of munitions factory heiress Patria Channing and U.S. Secret Service agent Donald Parr.",
  "synopsis": null
}