{
  "imdb_id": "tt3425034",
  "tmdb_id": "258322",
  "douban_id": null,
  "title": "Fasten Your Seatbelts (2014)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "Italy",
  "version": [
    {
      "runtime": "110 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm0654858",
      "name": "Ferzan Ozpetek"
    }
  ],
  "writer": [
    {
      "id": "nm0654858",
      "name": "Ferzan Ozpetek",
      "description": "story"
    },
    {
      "id": "nm0654858",
      "name": "Ferzan Ozpetek",
      "description": "screenplay and"
    },
    {
      "id": "nm0739744",
      "name": "Gianni Romoli",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0810738",
      "name": "Kasia Smutniak",
      "character": "Elena"
    },
    {
      "id": "nm2318119",
      "name": "Francesco Arca",
      "character": "Antonio"
    },
    {
      "id": "nm4274759",
      "name": "Filippo Scicchitano",
      "character": "Fabio"
    },
    {
      "id": "nm1968793",
      "name": "Carolina Crescentini",
      "character": "Silvia"
    },
    {
      "id": "nm1150908",
      "name": "Francesco Scianna",
      "character": "Giorgio"
    },
    {
      "id": "nm0797544",
      "name": "Carla Signoris",
      "character": "Anna"
    },
    {
      "id": "nm0723204",
      "name": "Elena Sofia Ricci",
      "character": "Viviana /              Dora"
    },
    {
      "id": "nm0590883",
      "name": "Paola Minaccioni",
      "character": "Egle"
    },
    {
      "id": "nm1323665",
      "name": "Giulia Michelini",
      "character": "Diana"
    },
    {
      "id": "nm1110629",
      "name": "Luisa Ranieri",
      "character": "Maricla"
    },
    {
      "id": "nm8513201",
      "name": "Maria Sole Piccinni",
      "character": "Guenda"
    },
    {
      "id": "nm5675180",
      "name": "Francesca Romana Verzaro",
      "character": "Dott.ssa Paola"
    }
  ],
  "overview": "Elena (Kasia Smutniak) and Antonio (Francesco Arca) seem not to be made for each other. They are too different in terms of character, life choices, worldview, and the way they relate to others. They are total opposites. However, they are overwhelmed by a mutual attraction they're trying hard to avoid; but to which they succumb to. This dramedy on relationships also gets a very credible performance from Paola Miraccione, who plays the tragic, albeit funny, character Egle.",
  "storyline": "Elena (Kasia Smutniak) and Antonio (Francesco Arca) seem not to be made for each other. They are too different in terms of character, life choices, worldview, and the way they relate to others. They are total opposites. However, they are overwhelmed by a mutual attraction they're trying hard to avoid; but to which they succumb to. This dramedy on relationships also gets a very credible performance from Paola Miraccione, who plays the tragic, albeit funny, character Egle.",
  "plot": "This article's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (March 2016) (Learn how and when to remove this template message)\nIn the year 1990, Iqbal Haroon Khan (Jackie Shroff) runs The Great Indian Circus in Chicago, which has fallen on bad times. Anderson's (Andrew Bicknell) bank — Western Bank of Chicago — which has lent money to Iqbal Khan, decides to close down the circus when Khan is unable to repay the loan. Young Sahir (Siddharth Nigam), the little son of Iqbal Khan, pleads with Anderson not to shut down his father's circus, as he and his father would soon be able to turn the corner. But Iqbal Khan's presentation before the bankers and Sahir's pleas don't help. Iqbal Khan commits suicide in front of the heartless Anderson, leaving Sahir devastated.\n\nNow in 2013, Sahir (Aamir Khan) has still not forgotten the high-handedness of the bank and swears revenge. He robs various branches of Western Bank of Chicago, leaving behind a message in Hindi and a clown mask. During the chase, he runs from top to the bottom of the Western Bank of Chicago building. As the police come to the scene, he runs into a van as they begin to surround the vehicle. Sahir jumps out in a BMW K1300R after a little explosion. On the chase, he slides under a truck and pops out to continue. He further kicks a police officer off his patrol motorcycle causing the officer to lose control and crash into a newspaper stand. While beyond that, Sahir continually tries to escape his pursuers and goes into a public parking garage. Then out of nowhere, he uses a steel cable cord like an attachment and rides his bike on it and is nearly knocked down by a train. despite all efforts of law enforcement, the robbery isn't foiled and he successfully gets away.\n\nAs Chicago Police Officer Victoria (Tabrett Bethell) fails to catch him, she calls ACP Jay Dixit (Abhishek Bachchan) and his partner, Ali (Uday Chopra), for help in solving the case. Jay baits Sahir into robbing again by making it known he's on the case and that he believes the thief to be an amateur thereby goading him on. Gathering information from a news channel regarding the plan, Sahir poses as an informant for Jay, and manages to gather information on the bank while giving Jay a lead to follow. Eventually, Sahir robs the bank and escapes, but Jay and Ali follow him. During the pursuit, Sahir nearly knocks Ali and and jumps over Wabash Avenue as the bridge rises, his bike transforms into a jet ski. While on a water pursuit, Jay takes a boat and chases Sahir. After almost knocking off Ali, Sahir is about to reach the next bridge but the police arrives. Sahir dives underwater, then jumps out from the water transforming his jet ski back to his bike. Jay, while hanging on a helicopter ladder, manages to shoot Sahir on the left shoulder before he disappears again.\n\nSahir has a big premiere of a revamped version of The Great Indian Circus, with his female lead acrobat, Aaliya (Katrina Kaif), involving a trick with him disappearing in one place and showing up in another. The show is a success, but afterwards, Jay, Ali, and the police surround him, knowing he's the thief. Jai says the proof will be the gunshot wound, but when Sahir is examined, there is no evidence of a gunshot wound anywhere on his body. Jay and Ali leave while Sahir retires to his dressing room. It is then revealed that Sahir has an autistic twin brother, Samar, who helps him pull off his trick and helps him in planning and pulling of the robberies and it was Samar who sustained the gun-shot wound.\n\nJay is fired from the case, but is encouraged by Ali to prove Sahir's guilt by going rogue. Jay eventually finds out about Samar, and sets about finding a way to corner Sahir. Samar, being mentally challenged, is kept in seclusion by Sahir. However, he allows Samar outdoors once a week, and Jay manages to befriend him during this time in order to perform his plan. Samar has fallen in love with Aaliya after performing with her in the circus, but cannot express it. This leads to a rift between the brothers. Jay tries to take advantage of this, but Sahir finds out and thwarts Jay's plan to stop them.When Sahir comes in the disguise of Samar, Jay reveals his true identity and assuming him to be Samar, tells him to surrender since he can give them justice. When Sahir reveals himself, he ties Jay to the track of a roller coaster and tells him that he used Samar for his own benefit. He switches the roller coaster on but Ali arrives in time to save him from being crushed. He decides the only way to catch the brothers is in the act of robbing. Sahir and Samar pull off their final bank heist, and escape. However, the following day, Jay manages to corner them as they're making their way out of town. They rob on 22 May. Samar is hesitant to run when Aaliya shows up, begging him to stop. Sahir surrenders to Jay, asking him to spare Samar. Jai agrees, but right after, Sahir attempts to jump off the dam. Samar grabs Sahir's hand, refusing to let him go. Sahir begs Samar to let go, saying he can live freely with Aaliya. But Samar says that both of them are born together and should die together. Eventually, the two of them jump off the dam together. Western Bank of Chicago is shut down as a result of the heists, while Aaliya is shown having taken over The Great Indian Circus and still performing for it.",
  "synopsis": null
}