{
  "imdb_id": "tt3480110",
  "tmdb_id": "257951",
  "douban_id": "25825755",
  "title": "Beyond Beyond (2014)",
  "genres": [
    "Animation",
    "Adventure"
  ],
  "country": "Sweden",
  "version": [
    {
      "runtime": "78 min",
      "description": "24fps"
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm2593468",
      "name": "Esben Toft Jacobsen"
    }
  ],
  "writer": [
    {
      "id": "nm2488511",
      "name": "Jannik Tai Mosholt",
      "description": null
    },
    {
      "id": "nm2593468",
      "name": "Esben Toft Jacobsen",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0358390",
      "name": "Gustaf Hammarsten",
      "character": "Johan's father       (voice)"
    },
    {
      "id": "nm0433479",
      "name": "Lennart Jähkel",
      "character": "The Feather King       (voice)"
    },
    {
      "id": "nm0477404",
      "name": "Sissela Kyle",
      "character": "The Captain       (voice)"
    },
    {
      "id": "nm0029264",
      "name": "Leif Andrée",
      "character": "Bill       (voice)"
    },
    {
      "id": "nm5376943",
      "name": "Pelle Falk Krusbæk",
      "character": "Johan       (voice)"
    },
    {
      "id": "nm0250809",
      "name": "Søs Egelind",
      "character": "The Captain /              Bill       (voice)"
    },
    {
      "id": "nm0617960",
      "name": "Flemming Quist Møller",
      "character": "The Feather King       (voice)"
    },
    {
      "id": "nm7342215",
      "name": "Evantubehd",
      "character": "Jonah       (voice) (as Evan From EvanTubeHD)"
    },
    {
      "id": "nm1417647",
      "name": "Jon Heder",
      "character": "Bill       (voice)"
    },
    {
      "id": "nm0000144",
      "name": "Cary Elwes",
      "character": "Jonah's Father       (voice)"
    },
    {
      "id": "nm0221043",
      "name": "Emily Deschanel",
      "character": "The Captain       (voice)"
    },
    {
      "id": "nm0911320",
      "name": "Patrick Warburton",
      "character": "The Feather King       (voice)"
    },
    {
      "id": "nm1024107",
      "name": "Ambyr Childers",
      "character": "Jonah's Mother       (voice)"
    }
  ],
  "overview": "Beyond Beyond is a story about wanting the impossible. A story about a little rabbit boy not old enough to understand the rules of life, who takes up the fight against the most powerful force. While doing so, he learns more and more about life.",
  "storyline": "Beyond Beyond is a story about wanting the impossible. A story about a little rabbit boy not old enough to understand the rules of life, who takes up the fight against the most powerful force. While doing so, he learns more and more about life.",
  "plot": "As Cole shops, an armed robber demands that the cashier, Michael, hand over all the money in the safe. Michael empties the cash register and says that there is no safe in the shop. As the robber becomes increasingly agitated, Cole approaches him, calls him a coward, and dares the robber to shoot him. Michael intercedes and attempts to wrestle the gun away from the robber, only to be shot in the gut. After Cole calls an ambulance, he receives a phone call from a friend who invites him out to drinks. Cole accepts on the condition that it is not a house party.\n\nCole is frustrated to learn that it is a house party, and he goes downstairs to drink alone, where he meets Maya, the host. The two discuss an approaching asteroid. Maya says that modern stress would evaporate in the face of the meaninglessness of certain doom, and Cole says that everything would matter in that circumstance. The two dance to Maya's favorite song and soon begin dating. A series of flashforwards depict life in post-apocalyptic Scotland after the asteroid has arrived as Cole and Maya hide from alien spaceships, mixed with scenes in the present of their relationship leading up to those events.\n\nWhen they discuss children, Cole says he does not want any, and Maya reveals she is incapable. As the asteroid grows closer, Cole asks Maya to marry him. Maya jokingly accepts, and Cole insists that he is serious; now serious, Maya again agrees. Although initially dismissive of the danger, scientists become increasingly worried about a collision. Various missions to divert the asteroid end in failure, putting the world on edge. In the flashforwards, Cole and Maya's relationship deteriorates in the face of their hardship in finding food and shelter.\n\nWhen Maya becomes pregnant, Cole is taken aback and insists that it is cruel to have children in the face of an impending disaster. Maya says that it is a miracle for her to become pregnant, and she keeps the baby despite Cole's insistence that they discuss abortion. In the flashforwards, Cole and Maya are depicted as childless, and their relationship has become strained over the issue, though it is not explained; Cole accuses Maya of blaming him for their hardships and not supporting him, while Maya counters that it is his own self-loathing that is driving them apart. In desperation, they resort to eating baby food they had agreed to save.\n\nIn the present, Michael expresses his dissatisfaction with Cole's refusal to accept responsibility for his wife's pregnancy. In a flashforward, Maya and Cole encounter a survivor by the name of Keith Novac. Novac explains his theory that the aliens have come to purge Earth of overpopulation and leave it a better place for the survivors. He demonstrates his attempts to contact the aliens, and Cole reveals that their missing child is in the care of Maya's parents, whom they suspect to have fled the country. Novac suddenly sneak attacks them both, and the film shifts back to the present time, when Cole and Maya have separated over his opposition to her pregnancy. Maya, who is about to give birth, invites Cole to the hospital.\n\nWhen Cole arrives, Michael confronts him with a pistol and says that Cole has betrayed his own beliefs. In the face of certain death, Michael says that Cole has abdicated all responsibility and treats his life as meaningless. Envious of the potential for hope in Cole's life, Michael shoots him. Novac, a doctor, rushes from the hospital, shoots Michael, and works to save Cole's life. As Cole begins to slip into delirium from his wound, he apparently imagines the various scenes in the flashforwards based on the actions of Novac and Michael. Maya calls Cole on his mobile phone and tells him that the asteroid has missed Earth, and she has given birth to a baby girl. The film ends as Cole lies on a hospital bed, Maya beside him.",
  "synopsis": null
}