{
  "imdb_id": "tt3462676",
  "tmdb_id": "285868",
  "douban_id": null,
  "title": "We Were Wolves (2014)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.0,
  "director": [
    {
      "id": "nm0134112",
      "name": "Jordan Canning"
    }
  ],
  "writer": [
    {
      "id": "nm0134112",
      "name": "Jordan Canning",
      "description": "co-writer"
    },
    {
      "id": "nm0134112",
      "name": "Jordan Canning",
      "description": null
    },
    {
      "id": "nm1122104",
      "name": "Steve Cochrane",
      "description": "co-writer"
    },
    {
      "id": "nm1122104",
      "name": "Steve Cochrane",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm6229700",
      "name": "Sadie Alter",
      "character": "Carrie"
    },
    {
      "id": "nm1222461",
      "name": "Dan Beirne",
      "character": "Paul"
    },
    {
      "id": "nm0007155",
      "name": "Lynda Boyd",
      "character": "Kathleen"
    },
    {
      "id": "nm1122104",
      "name": "Steve Cochrane",
      "character": "Danny"
    },
    {
      "id": "nm4486961",
      "name": "Jayden Greig",
      "character": "Mika Blake"
    },
    {
      "id": "nm1312105",
      "name": "Peter Mooney",
      "character": "Nick"
    },
    {
      "id": "nm1234276",
      "name": "Melanie Scrofano",
      "character": "Jennifer"
    }
  ],
  "overview": "Two estranged brothers return to the family cottage after the death of their father. Over the course of three days they must learn to let go of the man they thought they knew, and accept responsibility for the men they have become.",
  "storyline": "Two estranged brothers return to the family cottage after the death of their father. Over the course of three days they must learn to let go of the man they thought they knew, and accept responsibility for the men they have become.",
  "plot": "The film is narrated by Cayden (Lucas Till), an average teenaged boy approaching the end of high school. During a football game, a rival player headbutts Cayden, causing the latter to become enraged and attack the player with superhuman strength. Cayden later hurts his girlfriend, Lisa (Kaityn Leeb), when the passion of making out causes him to unwillingly transform into a werewolf. Cayden wakes up covered in blood, surrounded by the dismembered bodies of his parents and flees.\n\nCayden becomes a drifter, trying to keep his lycanthropy under control. In a roadside bar, Cayden draws the attention of Wild Joe (John Pyper-Ferguson), who reveals himself to be a werewolf. Wild Joe explains that werewolves come in two types, pure-breds and the bitten. The bitten are more savage and do not give birth to werewolf children. Pure-breds are natural-born werewolves from a small number of werewolf families that came to North America with the early settlers. Cayden has only recently discovered that he was adopted, and Wild Joe confirms that they are both natural werewolves and that Cayden can find out more in a remote town called Lupine Ridge.\n\nCayden travels to Lupine Ridge and goes to a local bar, attracting hostile attention from the small town locals. Cayden is attracted to Angel (Angelina) (Merritt Patterson), the beautiful young owner of the bar. He is eventually driven out of the bar by the locals, and outside meets John Tollerman (Stephen McHattie), who hires Cayden as a farmhand. After working for Tollerman for a while, he heads into town one night and Cayden is approached by a wolf of his bloodline who understands who Cayden is, warning him to leave town and that he is in danger. Cayden's \"cousin\" (Brandon McGibbon) is then killed by Connor (Jason Momoa), the alpha werewolf whom Cayden saw as the ringleader of the patrons in Angel's bar. Cayden runs into Angel and together they witness Connor and his pack eating Cayden's cousin after the murder.\n\nJohn later tells Cayden of his origins, about his werewolf mother, John's niece Lucinda being raped by werewolf Connor. Only John and his wife (Janet-Laine Green) knew about Lucinda's resulting pregnancy, and Lucinda killed herself shortly after Cayden's birth. John also tells him about the uneasy peace between the purebred town wolves and the savage mountain wolves, a pack of bitten werewolves who were created by purebred Connor. The peace comes with the condition that Connor can mate with Angel as he desires a son, not knowing about Cayden.\n\nCayden has started a relationship with Angel and wants to cancel the town's arrangement, but the town werewolves fear what the more bestial mountain werewolves would do in retaliation. Cayden goes to the mountains to confront Connor and reveals who he is, but Connor is skeptical and unleashes his wolves on Cayden. While Cayden is stronger than the individual bitten wolves, he will not use lethal force and is overwhelmed by the pack. He manages to jump off a nearby cliff to escape.\n\nCayden and John form a plan to deal with the mountain pack. Before they can act, Connor kidnaps Angel and readies to mate with her. Cayden kills two of the pack and lures the others into a trap where he and John use explosives to kill them all. When Cayden then beats Connor in single battle, Connor reveals that he and Lucinda were in love; but he created the rape story because Lucinda's father was going to kill her for the relationship.\n\nWild Joe suddenly appears, telling Connor and Cayden that he planned the events all along, killing Cayden's adoptive parents and convincing him to go to Lupine Ridge so that he could kill Connor in revenge for his own past issues with Connor. Wild Joe kills Connor but is killed by Cayden.\n\nCayden decides to leave with Angel to see the world, but he promises John they will be back. John gives him a scroll showing the bloodlines of the pure-bred werewolves to help him find others during their journey.",
  "synopsis": null
}