{
  "imdb_id": "tt3495030",
  "tmdb_id": "325138",
  "douban_id": null,
  "title": "Dum Laga Ke Haisha (2015)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "110 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.5,
  "director": [
    {
      "id": "nm2680506",
      "name": "Sharat Katariya"
    }
  ],
  "writer": [
    {
      "id": "nm2680506",
      "name": "Sharat Katariya",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4731677",
      "name": "Ayushmann Khurrana",
      "character": "Prem Prakash Tiwari"
    },
    {
      "id": "nm6277267",
      "name": "Bhumi Pednekar",
      "character": "Sandhya Verma"
    },
    {
      "id": "nm0592799",
      "name": "Sanjay Mishra",
      "character": "Chandrabhan Tiwari"
    },
    {
      "id": "nm0149441",
      "name": "Sheeba Chaddha",
      "character": "Nain Tara"
    },
    {
      "id": "nm1320935",
      "name": "Alka Amin",
      "character": "Sashi Tiwari"
    },
    {
      "id": "nm1260157",
      "name": "Seema Bhargava",
      "character": "Subhadra Rani       (as Seema Pahwa)"
    },
    {
      "id": "nm6509791",
      "name": "Chandrachoor Rai",
      "character": "Nirmal"
    },
    {
      "id": "nm0764384",
      "name": "Kumar Sanu",
      "character": "Kumar Sanu (Cameo)"
    },
    {
      "id": "nm7156561",
      "name": "Shardul Rana",
      "character": "Samar Verma"
    },
    {
      "id": "nm7212569",
      "name": "Devika Vatsa",
      "character": "NIRMAL'S WIFE DEEPTI       (as Devika Vats)"
    },
    {
      "id": "nm1652170",
      "name": "V.K. Sharma",
      "character": "Raghuveer Nautiyaal       (as Vk Sharma)"
    },
    {
      "id": "nm6358294",
      "name": "Swedha Singh",
      "character": "Female Singer at Mass Wedding"
    },
    {
      "id": "nm5440968",
      "name": "Poorva Neeraj",
      "character": "Lawyer"
    },
    {
      "id": "nm3588052",
      "name": "Mahesh Sharma",
      "character": "Vijay Kumar"
    },
    {
      "id": "nm5376667",
      "name": "Shrikant Verma",
      "character": "Shakha Babu"
    },
    {
      "id": "nm9001191",
      "name": "Deepak Bangwal",
      "character": "RACE OFFICIAL WITH THE TROPHY"
    },
    {
      "id": "nm9001171",
      "name": "Mudrika Gupta",
      "character": "MRIDULA"
    },
    {
      "id": "nm9001168",
      "name": "Anuradha Gupta",
      "character": "JAYA"
    },
    {
      "id": "nm8328758",
      "name": "Poonam Gidwani",
      "character": "Perveen"
    },
    {
      "id": "nm9001184",
      "name": "Suman Pathak",
      "character": "INTERVIEW PANEL"
    },
    {
      "id": "nm9001175",
      "name": "Rekha Badlani",
      "character": "SALES GIRL AT VIJAY'S SHOP"
    },
    {
      "id": "nm7156560",
      "name": "Sanjeeva Vatsa",
      "character": "Madan Pal Verma"
    },
    {
      "id": "nm9001169",
      "name": "Sonali Sharma Anand",
      "character": "HEMA"
    },
    {
      "id": "nm8325534",
      "name": "Umesh Shrivastav",
      "character": "DIVORCE COURT JUDGE"
    },
    {
      "id": "nm9001177",
      "name": "Yogesh Bhatt",
      "character": "SHAKHA BOY"
    },
    {
      "id": "nm9001178",
      "name": "Deepak Sharma",
      "character": "CD SALESMAN"
    },
    {
      "id": "nm9001172",
      "name": "Naman Tiwari",
      "character": "PREM'S NEPHEW 2"
    },
    {
      "id": "nm9001183",
      "name": "Janki Dobhal",
      "character": "RAGHUBIR'S WIFE"
    },
    {
      "id": "nm9001176",
      "name": "Rohan Tiwari",
      "character": "SHAKHA BOY"
    },
    {
      "id": "nm9001188",
      "name": "Raja Diwan",
      "character": "PROPERTY AGENT"
    },
    {
      "id": "nm3195297",
      "name": "Anurag Verma",
      "character": "PERVIN'S LOVER"
    },
    {
      "id": "nm9001189",
      "name": "Pankaj Kumar",
      "character": "SWEEPER"
    },
    {
      "id": "nm7746210",
      "name": "Urmila Kandwal",
      "character": "SHAKHA BABU'S WIFE"
    },
    {
      "id": "nm9001185",
      "name": "Gyaneshwar Shukla",
      "character": "CHIEF GUEST AT RACE"
    },
    {
      "id": "nm9001187",
      "name": "Mukesh Sharma",
      "character": "PREM'S LAWYER"
    },
    {
      "id": "nm9001166",
      "name": "Aneesh Kumar",
      "character": "JIJA1"
    },
    {
      "id": "nm0430802",
      "name": "Master Joshi",
      "character": "Boy on SHAKHA BABU'S SHOULDER"
    },
    {
      "id": "nm8892835",
      "name": "Krishna Dubey",
      "character": "PREM'S NEPHEW 1"
    },
    {
      "id": "nm9001167",
      "name": "Kunal Shamshere",
      "character": "JIJA2"
    },
    {
      "id": "nm9001174",
      "name": "Bk Suyal",
      "character": "PRIEST AT TEMPLE"
    },
    {
      "id": "nm9001179",
      "name": "Anil Kumar",
      "character": "EXAMINATION HALL Invigilator"
    },
    {
      "id": "nm9001173",
      "name": "Akhilesh Narayan",
      "character": "NIRMAL'S FRIEND GOLU"
    },
    {
      "id": "nm9001182",
      "name": "Kailash Kandwal",
      "character": "SCHOOL PRINCIPAL"
    },
    {
      "id": "nm7187455",
      "name": "Kiran Rana",
      "character": "VIJAY'S GIRLFRIEND SUMAN"
    },
    {
      "id": "nm9001190",
      "name": "Abhishek Mandola",
      "character": "ANNOUNCER AT RACE"
    }
  ],
  "overview": "Prem Prakash Tiwari (Ayushmann Khurrana) listening to Kumar Sanu is the film's opening shot. Set in Haridwar, 1990s, the film captures the nascent feel of the town. Prem owns a cassette shop in the local market. His father is keen to get him hitched and the family goes to a local temple to meet Sandhya (Bhumi Pednekar). B.Ed, waiting for a teaching job, the most visible thing about her is her weight. Coming from a patriarchal cognitive set-up, she doesn't fit the quintessential idea of beautiful. And still, the school drop out Prem must marry her because he is incapable of attaining a girl with 'Juhi-Chawla-level-of-looks.' In an elaborate community-wedding ceremony, Prem and Sandhya get married. Their wedding night is uncomfortable with neither treading towards establishing conjugal relations. Prem has in his own reasons and the girl is naturally shy. Next morning on a call, she announces it to a friend and the whole family finds out",
  "storyline": "It is the 1990s, the tape-cassette is dying, CDs will soon be the rage and a regular arranged marriage will turn out to be a perfect mismatch. Prem (Ayushmann Khurrana) is a shy music buff who runs a tape recording shop in Haridwar. Sandhya (Bhumi Pednekar) likes to dance to the band tunes at her own wedding. He has nightmares about drawing a blank at his English exam. She is about to carve a niche for herself as a teacher. But now, they are married and they are supposed to spend a lifetime together - and he is still trying to find balance on their scooter ride together. From overcoming his fear of the English language to dealing with an overbearing father, he discovers that his oversized wife, who he thought was a spanner in his spool, will actually lead him to something quite cool.",
  "plot": "Set in 1995, Prem Prakash Tiwari (Ayushmann Khurrana) owns a cassette shop in the local market of Haridwar. His father is keen on getting him married to an educated but overweight girl Sandhya (Bhumi Pednekar). In spite of not liking her, the school drop out Prem agrees to marry her as he cannot attain a girl with 'Juhi Chawla-level-of-looks.' In addition, the fact that Sandhya is trying to be a school teacher, his family asks him to think of this as a financial help too. Eventually, in an elaborate community-wedding ceremony, Prem and Sandhya get married.\n\nPrem visibly shows his disinterest in the marriage and does not consummate the marriage on the wedding night. While his sister, aunt and mother argue about his non-existent life, Prem leaves for akhara. Friends and seniors make fun of him and he tells them about his anguish. His trainer suggests that he must run away but that is not an option for him. At home, Sandhya tries to get Prem attracted to her. But he is too embarrassed to even walk with her on the street. Prem and Sandhya's relationship continues to remain strained although they share a kiss and have sex on their second night together. Over time, Sandhya's frustration shows; when Prem's aunt brings up a petty topic, the two have a heated exchange of words and she tells them how he does not treat her well.\n\nAmidst all this, a close friend of Prem's gets married. Prem and Sandhya go for the ceremony where due to his excessive drinking and jealousy over his friend's pretty wife, he tells everyone that sleeping with Sandhya feels like hell. Sandhya hears this and slaps him in front of his friends and he slaps her back. The next morning, Sandhya reflects on what she's been through and decides she has had enough and decides to leave Prem. She blames her father-in-law for his lack of respect towards women and not giving his son a proper education. Sandhya's mother tries to pacify her, saying she must return to her husband. But she decides that she can live by herself. Meanwhile, Prem decides to channel his energy into studying and to take his English paper again; he enrolls for the examination. His friends give up on him; after a verbal squabble, they throw him out of the group.\n\nSubsequently, a friend's father opens a competing shop selling music CDs in the same market, clearly affecting their business. Prem's family talks to the shop-owner's family and the discussion ends with Prem's friend challenging him to participate and win the \"Dum Lagao\" contest. (The contest entails him carrying his wife on his shoulders and running an obstacle course.) Meanwhile, Sandhya and Prem reach the court to file divorce. The court decides that the two must spend six months with each other and try to salvage their marriage. Both decide to live together just as a formality but the two begin to get on, as they both start understanding each other. Sandhya gets accepted for a teaching job in Meerut.\n\nPrem's aunt successfully convinces him to participate in the competition and the couple take a last chance to save their marriage. The day arrives and much to the surprise of the society members, Prem and Sandhya join the co-participants. Surprisingly, Prem shoulders the weight of his wife and surges past all other contestants who fall. In the last lap, Sandhya confesses to Prem that she does not want to go to Meerut and wants Prem to let her stay. Prem knows winning this competition is the only way to do this and pushes himself further to eventually win the race.\n\nBut Prem does not let Sandhya get off his back even after the race is over. He takes her back all the way to his house where they seal their love with a kiss.",
  "synopsis": null
}