{
  "imdb_id": "tt3444184",
  "tmdb_id": "252168",
  "douban_id": null,
  "title": "The Man from Macau (2014)",
  "genres": [
    "Action",
    "Comedy",
    "Drama"
  ],
  "country": "Hong Kong",
  "version": [
    {
      "runtime": "93 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.9,
  "director": [
    {
      "id": "nm0939147",
      "name": "Jing Wong"
    }
  ],
  "writer": [
    {
      "id": "nm0939147",
      "name": "Jing Wong",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0000334",
      "name": "Yun-Fat Chow",
      "character": "Ken (Shek Yat-kin) /              Ko Chun       (as Yun Fat Chow)"
    },
    {
      "id": "nm0874866",
      "name": "Nicholas Tse",
      "character": "Cool /              Sai-lang"
    },
    {
      "id": "nm0864779",
      "name": "Chapman To",
      "character": "Karl /              Ngau-ngau"
    },
    {
      "id": "nm1320897",
      "name": "Tian Jing",
      "character": "Officer Luo Ziwen (Mainland Chinese police)"
    },
    {
      "id": "nm1705334",
      "name": "Hu Gao",
      "character": "Mr. Gao (Gao Xiansheng) /              Ko       (as Hugh Gao)"
    },
    {
      "id": "nm0938925",
      "name": "Annie Wu",
      "character": "Susan"
    },
    {
      "id": "nm0401208",
      "name": "Shiu Hung Hui",
      "character": "Benz"
    },
    {
      "id": "nm1018221",
      "name": "Jin Zhang",
      "character": "Gui Yan (Gao's enforcer)"
    },
    {
      "id": "nm0939255",
      "name": "Michael Wong",
      "character": "Officer Lee (Hong-Kong police)"
    },
    {
      "id": "nm3169028",
      "name": "Sammy Sum",
      "character": "Kit (Ken's right-hand man)"
    },
    {
      "id": "nm5328537",
      "name": "Kimmy Fei Tong",
      "character": "Rainbow (Shek Choi-hung)       (as Kimmy Tong)"
    },
    {
      "id": "nm1264535",
      "name": "Philip Ng",
      "character": "Lionel /              Lung"
    },
    {
      "id": "nm1954959",
      "name": "Natalie Yao Meng",
      "character": "Ngau-ngau's fake wife       (as Natalie Meng)"
    },
    {
      "id": "nm4956829",
      "name": "Ran Hu",
      "character": "Gao's girl (Purple)       (as Michelle Hu)"
    },
    {
      "id": "nm0387390",
      "name": "Tony Ho",
      "character": "Ko's assistant"
    },
    {
      "id": "nm0179532",
      "name": "Maria Cordero",
      "character": "Siu Wan (Ken's old flame)"
    },
    {
      "id": "nm0939234",
      "name": "Man-Wai Wong",
      "character": "Mrs. Benz       (as Bonnie Wong)"
    },
    {
      "id": "nm0422623",
      "name": "Philip Keung",
      "character": "Ma Sheung-fat"
    },
    {
      "id": "nm0505013",
      "name": "Winnie Leung",
      "character": "Gao's girl (Red)"
    },
    {
      "id": "nm7205543",
      "name": "Candy Ka-Man Yuen",
      "character": "Gao's girl (Blue)       (as Candy Yuen)"
    },
    {
      "id": "nm6880679",
      "name": "May Ka-Kai Chan",
      "character": "Ken's cousin       (as Siupo Chan) (as Siu-Po)"
    },
    {
      "id": "nm0947153",
      "name": "Fan Wei Yee",
      "character": "Brother Man-tik       (as Chun Tong Wong)"
    },
    {
      "id": "nm2268726",
      "name": "Chi-Ming Yu",
      "character": "Uncle Wah       (as Chi Ming Yu)"
    },
    {
      "id": "nm8584807",
      "name": "Kin-Wang Lee",
      "character": "Ko Fei (Godfrey)       (as Kevin Kin-wang Li)"
    },
    {
      "id": "nm2773956",
      "name": "Tin Chi Law",
      "character": "Pedicab Driver"
    },
    {
      "id": "nm8446553",
      "name": "Peagu Alexandru",
      "character": "Ronaldo"
    },
    {
      "id": "nm3225342",
      "name": "Radford Cheung",
      "character": "Tie Tou (Iron Head)"
    },
    {
      "id": "nm3006062",
      "name": "Andrew Ng",
      "character": "Delegate Thailand"
    },
    {
      "id": "nm6522798",
      "name": "Aaron Boggs",
      "character": "Delegate France"
    },
    {
      "id": "nm1432902",
      "name": "Carlos Tin-Cheung Koo",
      "character": "Officer Ha (Macanese police)       (as Carlos Koo)"
    },
    {
      "id": "nm6322493",
      "name": "Yuki Cheng",
      "character": "Gao's girl (Yellow)       (as Ni Cheng)"
    },
    {
      "id": "nm4235698",
      "name": "Philippe Joly",
      "character": "Delegate America"
    },
    {
      "id": "nm5750206",
      "name": "Xiao Bao",
      "character": ""
    },
    {
      "id": "nm6322494",
      "name": "Yue Chi",
      "character": ""
    },
    {
      "id": "nm6835293",
      "name": "Erica Chui",
      "character": ""
    },
    {
      "id": "nm2677515",
      "name": "Temur Mamisashvili",
      "character": "Gambler"
    },
    {
      "id": "nm1291784",
      "name": "Ji-Ching Tai",
      "character": "Delegate       (as John Tai)"
    },
    {
      "id": "nm1708548",
      "name": "Chi-Wang Wong",
      "character": "(as Chi-Wing Wong)"
    },
    {
      "id": "nm9988851",
      "name": "Chun-Fung Wong",
      "character": "(as Jason Wong)"
    },
    {
      "id": "nm8864496",
      "name": "David Johnson Wood",
      "character": "Crime Boss"
    },
    {
      "id": "nm3587963",
      "name": "Cindy Yuan",
      "character": ""
    }
  ],
  "overview": "The world renowned “Invincible Hand” Ken could identify not only mahjong tiles, but also cards with his fingers which had made him a legend. Upon his retirement as the Chief Security Consultant in Las Vegas, Ken returned to his hometown Macau, where he met his old friend Benz, and Benz’s son Cool and nephew Karl. Both Cool and Karl wanted to follow Ken. Ken claimed that if Cool could successfully cheat him once or win over him, he would then accept Cool as his protégé. Cool’s step brother Lionel, an undercover agent, had disguised his identity in an international gambling mafia which had planned to form an alliance with mafias in illegal gambling from all over the world to control the result of soccer matches. Lionel had recorded the entire conference, with the criminal evidence kept in an imitated eye. The eye was coincidentally given to Rainbow, Ken’s only daughter, which put her in danger. The retired Ken was forced to use his “Magic Hand” once again to uncover the evil plan…",
  "storyline": "The story starts with small-time conman Cool (Nicholas Tse), whose undercover policeman half-brother (Phillip Ng) is murdered by Ko (Gao Hu), the head of an illegal gambling syndicate. Cool seeks the help of \"Magic Hands\" Ken (Chow Yun Fat), a legendary gambler turned casino security consultant, to battle Ko.",
  "plot": "Benz, his son \"Cool\" and nephew Ngau-Ngau are part of a team of vigilantes who rob gangsters at night and distribute the loot to the needy. However, his wife is suffering from cancer and knows nothing of their activities. Unbeknownst to all of them, Benz's stepson Lionel, a police officer, is on a deep undercover assignment as an employee of a multinational company called DOA. It is later revealed that DOA is merely the corporate front of a large criminal syndicate and is run by the ruthless Mr. Ko. Lionel, who had a camera surgically implanted onto a contact lens which he wore so the police could track the syndicate's activities and eventually nab them.\n\nMeanwhile, Benz reunites with his old friend Ken, known as the \"Magic Hand\". Ngau-Ngau becomes infatuated with Ken's daughter Rainbow and is determined to win her affection, even though Ken eventually makes it known that he prefers \"Cool\" to date his daughter and Rainbow repeatedly rebuffs Ngau-Ngau's efforts. Lionel realizes his cover has been blown and hides the contact lens in a stuffed teddy bear at home without his family's knowledge. Ngau-Ngau gives the bear to Rainbow when he and \"Cool\" visit Ken's house. Mr. Ko sends an assassin to Lionel's flat, only to find Benz, who has just returned home. Benz is beaten and tortured and ends up in a coma while Lionel's body is found later, also bearing torture marks.\n\nPolice detectives from China, Hong Kong and Macau decide to enlist the help of Ken to take down the wily and cunning Mr. Ko. Ken challenges Mr. Ko to a gambling match in hopes of provoking him into making a mistake. During the match he discovers that DOA's assassins have attacked his house and Rainbow, \"Cool\" and Ngau-Ngau are inside.\n\nRainbow is put inside a glass tank, which has gas in it. During the match, Ken reveals that he had undergone through a surgery to implant a card sensor into his fingernail which allows the details of a certain card into the person's brain. The people following Mr. Ko start a revolution against him after watching Lionel Messi of Barcelona score against Real Madrid, winning them. After killing them all, Mr. Ko tries finding Ken. Ken starts shooting cards in retaliation. \"Cool\", is revealed to be wearing the mask of one of Mr. Ko's crew, whom had secretly diverted the ship back towards the waters, which police are now making their way to. While making their way towards the top, \"Cool\" and Rainbow meets the Assassin. \"Cool\" and the Assassin fight, which \"Cool\" ends him off with a few punches to his face, making him look like a duck.\n\nMr. Ko starts to escape, only to be met by Ken. Ken now mercilessly shoots cards at Mr. Ko, striking him multiple times. Mr. Ko is later subdued by him, and arrested by the Police.\n\nWhile Ken is doing the disciple rituals with \"Cool\" on the first day of the Lunar New Year at his place, \"Cool\" receives a call from a mysterious someone, who also shows interest to take Cool as his disciple. Ken questions Cool who is more qualified to impart his skills to him. At this moment, the doors swing open. A man in his black suit, playing with his jade ring walks into the scene. \"I believe I am qualified to take him as my disciple.\" This man was no other than God of Gamblers Ko Chun (from the God of Gamblers series) himself.",
  "synopsis": null
}