{
  "imdb_id": "tt3477752",
  "tmdb_id": "328252",
  "douban_id": null,
  "title": "Sweet Home (2015)",
  "genres": [
    "Horror"
  ],
  "country": "Spain",
  "version": [
    {
      "runtime": "80 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.2,
  "director": [
    {
      "id": "nm2111814",
      "name": "Rafa Martínez"
    }
  ],
  "writer": [
    {
      "id": "nm3857756",
      "name": "Ángel Agudo",
      "description": null
    },
    {
      "id": "nm2111814",
      "name": "Rafa Martínez",
      "description": null
    },
    {
      "id": "nm2162103",
      "name": "Teresa de Rosendo",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4201461",
      "name": "Ingrid García Jonsson",
      "character": "Alicia"
    },
    {
      "id": "nm5301342",
      "name": "Bruno Sevilla",
      "character": "Simon"
    },
    {
      "id": "nm1376600",
      "name": "Oriol Tarrida Homedes",
      "character": "El Liquidador       (as Oriol Tarrida 'Tarro')"
    },
    {
      "id": "nm3986484",
      "name": "Eduardo Lloveras",
      "character": "Encapuchado 1"
    },
    {
      "id": "nm4791342",
      "name": "Miguel Ángel Alarcón",
      "character": "Encapuchado 2"
    },
    {
      "id": "nm1524576",
      "name": "Luka Peros",
      "character": "Encapuchado 3"
    },
    {
      "id": "nm0087281",
      "name": "José María Blanco",
      "character": "Sr. Ramón"
    },
    {
      "id": "nm1206701",
      "name": "Leticia Dolera",
      "character": "112 Operator       (voice)"
    },
    {
      "id": "nm2037335",
      "name": "Mariona Perrier",
      "character": "Sra. Carmen"
    }
  ],
  "overview": "A couple decides to spend a romantic evening in a floor of a semi-abandoned building that slip because she works as a consultant for the council house and got the keys. During the evening they discover that a hooded murderer is the only tenant left in the building...and they have become the new target.",
  "storyline": "Alicia is a young real estate broker who stumbles on an old apartment building, where she plans a secret and romantic meeting with her boyfriend Simon. But they don't know, that the lessor has sent some murderers to kill the last remaining tenant. When Alicia and Simon catching them in the act, they are forced to run, hide and fight for their lives.",
  "plot": "This section needs expansion. You can help by adding to it. (February 2015)\nA small film crew visits the old, abandoned mansion of famous artist Ichirō Mamiya, who left several precious frescos inside his house. The team wants to restore and publish the paintings and film a documentary about Mamiya and his arts. The team includes Kazuo (Shingo Yamashiro), his daughter Emi (Nokko), producer Akiko (Nobuko Miyamoto), photographer Taguchi (Ichiro Furutachi) and art restorer Asuka (Fukumi Kuroda). After they enter the mansion, paranormal events betray the presence of a poltergeist. Soon, Asuka is possessed by the infuriated ghost of Lady Mamiya, Ichirō's wife. The team discovers a makeshift grave where a toddler is buried. The boy is Ichirō and Lady Mamiya's son, who fell into the house's incinerator one day and burned alive. Since then, Lady Mamiya's ghost haunts the mansion, killing any trespassers. In the end, only Kazuo, Emi, and Akiko survive, by reuniting Mamiya with her beloved son, and so giving them peace. When Kazuo, Emi, and Akiko leave the mansion, it begins to collapse.",
  "synopsis": null
}