{
  "imdb_id": "tt3430416",
  "tmdb_id": "333555",
  "douban_id": null,
  "title": "Schneider vs. Bax (2015)",
  "genres": [
    "Comedy",
    "Thriller"
  ],
  "country": "Netherlands",
  "version": [
    {
      "runtime": "96 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm0912334",
      "name": "Alex van Warmerdam"
    }
  ],
  "writer": [
    {
      "id": "nm0912334",
      "name": "Alex van Warmerdam",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0212423",
      "name": "Tom Dewispelaere",
      "character": "Schneider"
    },
    {
      "id": "nm0912334",
      "name": "Alex van Warmerdam",
      "character": "Ramon Bax"
    },
    {
      "id": "nm0469083",
      "name": "Maria Kraakman",
      "character": "Francisca"
    },
    {
      "id": "nm0078517",
      "name": "Gene Bervoets",
      "character": "Mertens"
    },
    {
      "id": "nm0539482",
      "name": "Annet Malherbe",
      "character": "Gina"
    },
    {
      "id": "nm0092592",
      "name": "Pierre Bokma",
      "character": "Bolek"
    },
    {
      "id": "nm0305488",
      "name": "Henri Garcin",
      "character": "Gerard"
    },
    {
      "id": "nm2156780",
      "name": "Loes Haverkort",
      "character": "Lucy"
    },
    {
      "id": "nm1235052",
      "name": "Eva van de Wijdeven",
      "character": "Nadine"
    },
    {
      "id": "nm7216007",
      "name": "Ali Zijlstra",
      "character": "Loetje"
    },
    {
      "id": "nm0720642",
      "name": "Mike Reus",
      "character": "Supervisor"
    },
    {
      "id": "nm3417880",
      "name": "Bart Harder",
      "character": "Jules"
    },
    {
      "id": "nm7216005",
      "name": "Fay Bakker",
      "character": "Oldest Daughter"
    },
    {
      "id": "nm7216006",
      "name": "Rosa Bakker",
      "character": "Youngest Daughter"
    },
    {
      "id": "nm7216008",
      "name": "Renzo van Cleemputte",
      "character": "Blind boy"
    }
  ],
  "overview": "On his birthday, a hitman reluctantly takes on the easy task of killing a writer, only to find the job a lot more difficult than expected.",
  "storyline": "Schneider, a hit man, gets a call from Mertens on the morning of his birthday. He has a rush job for Schneider who refuses it, because it is his birthday and he has promised Lucy, his wife, to help her with the preparations for the dinner party. Mertens insists that it is an important matter. Schneider is told that the target is Ramon Bax, a writer. He lives alone in a secluded place. \"It's an easy job. With a little luck you're back home before noon.\" Schneider accepts the assignment. What seems to be a simple job turns out to be more than expected.",
  "plot": "On his birthday, Schneider, a contract killer disguised as a handyman reluctantly takes on the easy task of killing Bax, a novelist who has a substance-abuse problem that could do him in before his rival contract arrives. Mertens, Schneider's boss orders him to grab his rifle and get to work. He insists the job to be done today, adding, “Ramon Bax is a child killer”. Bax who is a total mess is also a pro-hitman under Mertens and forgets he was supposed to kill Schneider that day because, according to Mertens, “Schneider is a child killer”. Bax also has to deal with his younger lover, Nadine and his lecherous father, Gerard. But he is confident because his adversary plays by certain rules and won’t strike when Francisca, his adult depressed daughter is nearby. Both Schneider and Bax know they are being played, but since it's a contract they have a certain obligation. Schneider uses a escort whom he has saved from a pimp to do cover work for him. Francisca who is depressed and frustrated that no one is there to help her, kills her grandfather Gerard when he tries to molest her and hides his body in a nearby swamp. Francisca comes to know her father is a hitman rather than a novelist, and she tries to help him to finish Schneider. Meanwhile Schneider picks up Mertens and props him as a target for Bax. Bax kills Mertens mistakenly. Bax prepares to leave the house since the client is dead and the contract is ne longer valid; he considers this to be valid, in principle, for his colleague Schneider as well. But Schneider considers Bax to be a threat, kills him and hunts down Francisca as she is a witness to his crime. Francisca appears naked before Schneider near the swamp where she killed her grandfather. Schneider leaves her and joins with his family for his Birthday celebration. Francisca appears to be disoriented or free from her problems naked in the swamp.",
  "synopsis": null
}