{
  "imdb_id": "tt3483174",
  "tmdb_id": "256472",
  "douban_id": null,
  "title": "Why Knot (2016)",
  "genres": [
    "Documentary"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm2274557",
      "name": "Dhruv Dhawan"
    }
  ],
  "writer": [
    {
      "id": "nm2274557",
      "name": "Dhruv Dhawan",
      "description": "writer"
    },
    {
      "id": "nm2274557",
      "name": "Dhruv Dhawan",
      "description": null
    }
  ],
  "cast": null,
  "overview": "Why do human beings get married in almost every society in the world? Why do we cheat? Why is monogamy so important to a relationship and why does infidelity cause so much grief?  These are some of the questions acclaimed documentary filmmaker Dhruv Dhawan confronts in his next feature length documentary which explores why human beings evolved cultures of marriage and monogamy that are rife with infidelity.  As he attends various lavish weddings occurring within his family, Dhruv is pestered to follow suit but is haunted by his family’s history of infidelity, as well as his own and embarks on a personal quest to discover the origins of marriage, the reasons for monogamy and the pain of infidelity as he tries to mediate an open relationship with the woman he loves.  Dhruv’s search takes us on a journey into the biology of sex, the history of patriarchy and the politics of monogamy told through the lives of scientists, swingers, adulterers and Dhruv’s own family.",
  "storyline": "Why are love and sex so closely tied together? And what if we try and separate the two? Filmed over the course of 4 ½ years, Why Knot weaves the history of monogamy with the personal story of a filmmaker attempting an open relationship with the woman he loves. When his younger brother in Dubai decides to get married, Dhruv's Indian family begins to pressure him to follow suit; but instead, he turns the camera on them and begins to ask pressing questions to understand why we practice marriage and monogamy in a world rife with infidelity. Capturing histories and perspectives from both the East and the West, Why Knot takes us on a dark and at times hilarious journey through the emotional and intellectual landscape of monogamy, offering deeper insight into a universal conflict between our instincts and our morals.",
  "plot": "William \"Will\" Thacker owns an independent book store, The Travel Book Co. in Notting Hill. He is divorced and shares his house with an eccentric, care-free Welshman named Spike.\n\nWill encounters Hollywood superstar Anna Scott when she enters his shop. Minutes later, they collide in the street and his drink spills on her clothes. Will offers his house nearby for Anna to change. Before leaving, she impulsively kisses him.\n\nDays later, Anna leaves him a message that she is at the Ritz Hotel. Will is mistaken for a journalist—in a panic he claims he works for Horse &amp; Hound, and is made to interview the cast of Anna's new sci-fi film, which he has not seen. Anna calls him back in and says she has cleared her evening for him. Will is exhilarated, before remembering that he is expected at his sister Honey's birthday party; Anna surprises him by saying she will join him as his date.\n\nAt the house of Will's friends Max and Bella, Anna feels at home as she share stories with the small group of birthday party guests. She and Will share a moment in a private garden square. The next day they go to a restaurant, where Will overhears Anna being spoken of in salacious terms and defends her. Anna invites Will to her room at the Ritz, but her American boyfriend, film star Jeff King, has arrived unannounced. Will pretends to be a room-service waiter and Jeff is very dismissive towards him. Anna is apologetic and embarrassed; she thought King had broken up with her. Will realizes he must end things with Anna. Over the next six months, Max and Bella set Will up on a series of blind dates (the last with someone who is \"perfect, absolutely perfect\"), hoping to help him move on from Anna.\nMuch of the filming took place on Portobello Road.\nA distraught Anna appears unexpectedly at Will's doorstep; some pre-stardom nude photos have been published, and she needs a place to hide out. Once she calms down, they spend some time on the rooftop patio rehearsing lines from Anna's next film. Back inside, when she sees a poster of the Marc Chagall painting La Mariée, Anna tells Will that \"it feels like how love should be\". After an amazing day together, Anna goes to him at night and they make love. The next morning, she makes him breakfast in bed and she asks if she can stay. The doorbell rings and they are horrified to find a horde of reporters, alerted by Spike's careless talk at the pub. Spike re-opens the door to be photographed in only his dirty underwear, exacerbating the situation. While Anna gets dressed, she verbally berates Will for what she views as his desire for publicity. He tries to cheer her up, reminding her that the fame is all nonsense, but she tells him the scandal will follow her forever, departing with the statement that she regrets their time together.\n\nSeveral months and seasons pass. At a dinner with his friends, Will discovers that Anna is back in town to make a Henry James film, which Will had previously suggested to her. He visits her location shoot, where Anna sees him and invites him past security. Given headphones to hear the dialogue, Will leaves when he overhears Anna evading questions from her co-star, stating that Will is no one important.\n\nThe next day, Anna comes to the bookshop with a present. Anna admits she still has feelings for him, apologizes for her behaviour months ago and expresses a desire to renew their relationship, admitting that \"the fame thing isn't really that real\" and that despite her stardom, she is \"also just a girl, standing in front of a boy, asking him to love her\". When Will brings up the conversation she had with her co-star on the set she explains that her co-star is a notorious gossiper and she was being discreet but Will turns her down, saying he is unable to handle another inevitable break up, especially considering how big of a star she is and that he would be unable to escape seeing her face if the inevitable breakup happens. She kisses him goodbye and leaves, leaving Will's present behind, which turns out to be the original La Mariée.\n\nWill meets his friends in a restaurant. They take turns supporting his decision to not see her any more and try to make him feel better until Spike enters the restaurant and is told that Will has decided to leave Anna - Spike promptly calls him a \"daft prick\" and lambastes him for turning away the woman he loves. Will and his friends race across London in Max's car to reach her press conference at the Savoy Hotel, where Will, in his Horse &amp; Hound persona, asks two questions that reveal their relationship and his feelings for her, persuading her to stay in the UK \"indefinitely\". She breaks into a dazzling smile. His friends in the audience hug and kiss. A montage shows the two getting married, at two of Anna's movie premieres, then happily sitting on a garden square bench, where Will reads to a heavily pregnant Anna.",
  "synopsis": null
}