{
  "imdb_id": "tt3492568",
  "tmdb_id": "244054",
  "douban_id": null,
  "title": "Scrap Wood War (TV Movie 2014)",
  "genres": [
    "Drama",
    "Family"
  ],
  "country": "Netherlands",
  "version": [
    {
      "runtime": "87 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm1234128",
      "name": "Margien Rogaar"
    }
  ],
  "writer": [
    {
      "id": "nm1234128",
      "name": "Margien Rogaar",
      "description": null
    },
    {
      "id": "nm1375739",
      "name": "Tijs van Marle",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm6244041",
      "name": "Kees Nieuwerf",
      "character": "Ziggy"
    },
    {
      "id": "nm4626817",
      "name": "Julian Ras",
      "character": "Bas"
    },
    {
      "id": "nm6244042",
      "name": "Bart Reuten",
      "character": "Flin"
    },
    {
      "id": "nm6244043",
      "name": "Nijs Vermin",
      "character": "Ronnie"
    },
    {
      "id": "nm6244044",
      "name": "Yuri van Dam",
      "character": "Aaron"
    },
    {
      "id": "nm6244045",
      "name": "Tijn Ras",
      "character": "Mats"
    },
    {
      "id": "nm6244046",
      "name": "Moos van der Meulen",
      "character": "Jeffrey"
    },
    {
      "id": "nm5466120",
      "name": "Noah de Nooij",
      "character": "Leon"
    },
    {
      "id": "nm4256470",
      "name": "Stefan Perrier",
      "character": "Edo"
    },
    {
      "id": "nm6244047",
      "name": "Amy Kitchiner",
      "character": "Elena"
    },
    {
      "id": "nm2045636",
      "name": "Joep van der Geest",
      "character": "DJ Coyoty"
    },
    {
      "id": "nm3831500",
      "name": "Jeroen De Man",
      "character": "Stijn"
    },
    {
      "id": "nm1801994",
      "name": "Mara van Vlijmen",
      "character": "Lotta"
    },
    {
      "id": "nm0273143",
      "name": "Roeland Fernhout",
      "character": "Maarten"
    },
    {
      "id": "nm0469083",
      "name": "Maria Kraakman",
      "character": "Inez"
    },
    {
      "id": "nm1466721",
      "name": "Iwan Walhain",
      "character": "Paul"
    },
    {
      "id": "nm0036940",
      "name": "Carola Arons",
      "character": "Hesther"
    },
    {
      "id": "nm0526999",
      "name": "Bert Luppes",
      "character": "Leraar"
    }
  ],
  "overview": "At their annual summer building club ‘Camp Scrapwood’, best friends Ziggy (12) and Bas (12) find themselves on opposing sides for the first time in their lives. At summer club, best friends Ziggy and Bas (12) are on opposing sides for the first time in their lives. Different secondary schools, different parental expectations and now falling in love with the same girl lead to all-out war between them. They begin to fight. Initially, tougher Bas fights hard, but soon has doubts about the row. Meanwhile, the gentle Ziggy gradually toughens up and becomes determined to win…  A family film about friendship, love, jealousy… and being a boy.",
  "storyline": "Bas and Ziggy are longstanding best (school)mates, but while stronger Bas does wood-shop, smarter Ziggy enters prep-school. The knaves stay friends, but at the usual summer camp 'construction village' each sticks to his new school gang in the tower-building competition, and as girls get involved, really turn on each-other as the prank war escalates. Yet when in trouble, the old friendship takes over again.",
  "plot": "A humanoid alien (Aamir Khan) lands on Earth naked on a research mission in Rajasthan, but is stranded when the remote control of his spaceship is stolen. He manages to get the thief's cassette recorder, a Panasonic RQ-565D. On the same day in Bruges, Jaggu (Anushka Sharma) meets Sarfaraz (Sushant Singh Rajput) and falls in love with him. Jaggu's father (Parikshit Sahni) objects to their relationship because Sarfaraz is a Pakistani Muslim, while Jaggu is a Hindu. He consults godman Tapasvi Maharaj (Saurabh Shukla) who predicts that Sarfaraz will betray Jaggu. Determined to prove them wrong, Jaggu proposes to Sarfaraz, who accepts. She is heartbroken at the wedding chapel when she receives a letter calling off the marriage due to their cultural differences.\n\nJaggu returns to India and becomes a TV reporter. She meets the alien and is intrigued to see him distribute leaflets about the \"missing\" Gods. She saves him when he attempts to take money from a collection box, earning his trust.\n\nThe alien tells her that he is a research scientist from another planet. His people know nothing about dressing, religion or verbal communication. They transfer ideas by holding hands. The alien learned to fit in among humans by wearing clothes and using money stolen from couples having sex in \"dancing cars\".\n\nAfter being accidentally hit by a truck, the alien is befriended by bandmaster Bhairon Singh (Sanjay Dutt), who takes him along with his troop. The alien attempts to learn to communicate by grabbing peoples' hands but people chase him away, believing him to be a pervert. Bhairon takes him to a brothel, where the alien holds a prostitute's (Reema Debnath) hand for six hours and thus learns the Bhojpuri language.\n\nBhairon has a conversation with the alien, and suggests that the thief may be in Delhi. The alien leaves for Delhi. Due to his strange behavior, the people assume he is drunk and call him \"PK\" (pee-kay, Hindi for \"drunk\"). People tell him that only \"God\" can help him find his remote. PK sincerely practices every Indian religion attempting to find \"God\", to no avail. He later discovers that Tapasvi has his remote, who claims it was a gift from God, and refuses to return the remote. Jaggu promises PK that she will recover his remote and he can go back home.\n\nPK conjectures that Tapasvi and other godmen must be dialling a \"wrong number\" to communicate with God, and are therefore advising the public to engage in meaningless rituals. Jaggu encourages the public to expose fraudulent godmen, by sending their videos to her news channel. This \"wrong number\" campaign turns into a popular mass-movement, to the dismay of Tapasvi. Meanwhile, Bhairon finds the thief and contacts PK, telling him that he sold his remote control to Tapasvi, after which PK realises that Tapasvi was actually a fraud all along and that it wasn't a \"wrong number\". Bhairon then informs him that they will come to Delhi, but both die in a terrorist attack. The terrorist attack is later declared by Tapasvi's group to be stated as protecting their Gods.\n\nTapasvi decides to confront PK on-air. Tapasvi asks PK what the \"right number\" is. PK says that \"God that created us all\" is the only concept people should believe in, and that the other \"duplicate Gods\" are created by man. Tapasvi argues, saying that PK is trying to take people away from their Gods and that they will not stand for their Gods being taken away from them either. He claims he has a direct connection to God and refers to his prediction of Sarfaraz's betrayal to try to prove that Muslims are liars, but PK disagrees. PK realises that Sarfaraz did not write the letter. Jaggu contacts the Pakistani Embassy in Belgium where Sarfaraz worked part-time. The embassy tells her that Sarfaraz still loves her, and transfers the line to Sarfaraz, who is now living in Lahore. Jaggu and Sarfaraz reconnect, and Tapasvi is forced to return PK's remote, while also being exposed to the whole of India that he had planned to break Jaggu and Sarfaraz through his \"predictions\".\n\nMeanwhile, PK has fallen in love with Jaggu, but refrains from telling her because she loves Sarfaraz. Having filled multiple audio tapes with her voice alone, he takes two suitcases full of tapes and extra batteries when leaving for home. After his departure, Jaggu publishes a book about him.\n\nOne year later, PK returns to Earth on a new research mission on human nature along with several other aliens (including one played by Ranbir Kapoor).",
  "synopsis": null
}