{
  "imdb_id": "tt3401882",
  "tmdb_id": "345922",
  "douban_id": null,
  "title": "Fist Fight (2017)",
  "genres": [
    "Comedy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "91 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm0007193",
      "name": "Richie Keen"
    }
  ],
  "writer": [
    {
      "id": "nm2448917",
      "name": "Van Robichaux",
      "description": "story &"
    },
    {
      "id": "nm4105248",
      "name": "Evan Susser",
      "description": "story and"
    },
    {
      "id": "nm0339011",
      "name": "Max Greenfield",
      "description": "story"
    },
    {
      "id": "nm2448917",
      "name": "Van Robichaux",
      "description": "screenplay &"
    },
    {
      "id": "nm4105248",
      "name": "Evan Susser",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0206359",
      "name": "Charlie Day",
      "character": "Andy Campbell"
    },
    {
      "id": "nm0001084",
      "name": "Ice Cube",
      "character": "Strickland"
    },
    {
      "id": "nm0605079",
      "name": "Tracy Morgan",
      "character": "Coach Crawford"
    },
    {
      "id": "nm3255459",
      "name": "Jillian Bell",
      "character": "Holly"
    },
    {
      "id": "nm0606487",
      "name": "Dean Norris",
      "character": "Principal Tyler"
    },
    {
      "id": "nm0376716",
      "name": "Christina Hendricks",
      "character": "Ms. Monet"
    },
    {
      "id": "nm3529685",
      "name": "Kumail Nanjiani",
      "character": "Mehar"
    },
    {
      "id": "nm0371660",
      "name": "Dennis Haysbert",
      "character": "Superintendent Johnson"
    },
    {
      "id": "nm0305272",
      "name": "JoAnna Garcia Swisher",
      "character": "Maggie"
    },
    {
      "id": "nm6835961",
      "name": "Alexa Nisenson",
      "character": "Ally"
    },
    {
      "id": "nm0918633",
      "name": "Stephnie Weir",
      "character": "Suzie"
    },
    {
      "id": "nm0005552",
      "name": "Kym Whitley",
      "character": "911 Operator       (as Kym E. Whitley)"
    },
    {
      "id": "nm4847206",
      "name": "Austin Zajur",
      "character": "Neil"
    },
    {
      "id": "nm0200420",
      "name": "Gordon Danniels",
      "character": "Irv"
    },
    {
      "id": "nm5357691",
      "name": "Bill Kottkamp",
      "character": "William"
    },
    {
      "id": "nm3322393",
      "name": "Jose Diaz",
      "character": "Cody"
    },
    {
      "id": "nm4887401",
      "name": "Tim Johnson Jr.",
      "character": "Jordan"
    },
    {
      "id": "nm2280518",
      "name": "Nicholas Alexander",
      "character": "Blake"
    },
    {
      "id": "nm3083350",
      "name": "Charlie Carver",
      "character": "Nathaniel"
    },
    {
      "id": "nm3083571",
      "name": "Max Carver",
      "character": "Daniel"
    },
    {
      "id": "nm5086025",
      "name": "Winston James Francis",
      "character": "Tough Guy"
    },
    {
      "id": "nm4373295",
      "name": "Nolan Bateman",
      "character": "Phil"
    },
    {
      "id": "nm4783331",
      "name": "Jason Charles Hill",
      "character": "Scooter Kid"
    },
    {
      "id": "nm5670328",
      "name": "Ian Gregg",
      "character": "Freddie"
    },
    {
      "id": "nm0007193",
      "name": "Richie Keen",
      "character": "Computer Store Employee"
    },
    {
      "id": "nm1128418",
      "name": "Robert Pralgo",
      "character": "Officer Kheel"
    },
    {
      "id": "nm2689261",
      "name": "Michael Beasley",
      "character": "Officer Rodriguez"
    },
    {
      "id": "nm0741893",
      "name": "Terence Rosemore",
      "character": "Janitor"
    },
    {
      "id": "nm0231879",
      "name": "James Donadio",
      "character": "Janitor"
    },
    {
      "id": "nm7886444",
      "name": "Annie Jacob",
      "character": "Julie"
    },
    {
      "id": "nm7059572",
      "name": "Phi Vu",
      "character": "Scrawny Kid"
    },
    {
      "id": "nm4837701",
      "name": "Ron Caldwell",
      "character": "Scrawny Kid"
    },
    {
      "id": "nm7786314",
      "name": "Elijah B. Moore",
      "character": "Goofy Kid"
    },
    {
      "id": "nm0079925",
      "name": "Karen Beyer",
      "character": "Ally's Teacher"
    },
    {
      "id": "nm2221470",
      "name": "Alisa Harris",
      "character": "Desk Nurse"
    },
    {
      "id": "nm0113158",
      "name": "Brianna Brown",
      "character": "News Reporter"
    },
    {
      "id": "nm3860085",
      "name": "Autumn Dial",
      "character": "Stephanie"
    },
    {
      "id": "nm7724801",
      "name": "Emily Murden",
      "character": "Trisha"
    },
    {
      "id": "nm5405440",
      "name": "Kyanna Simone Simpson",
      "character": "Amber"
    },
    {
      "id": "nm2025632",
      "name": "Peg Thon",
      "character": "Mrs. Davis"
    },
    {
      "id": "nm3590097",
      "name": "Courtney Lauren Cummings",
      "character": "Emma"
    },
    {
      "id": "nm5940984",
      "name": "Khamary Grant",
      "character": "Donald"
    },
    {
      "id": "nm1789135",
      "name": "Rachel Leah Cohen",
      "character": "Mom"
    },
    {
      "id": "nm2707077",
      "name": "Deena Beasley",
      "character": "Mom"
    },
    {
      "id": "nm2705765",
      "name": "Ethan Alexander McGee",
      "character": "Light Board Kid       (as Ethan McGee)"
    },
    {
      "id": "nm5573623",
      "name": "Ryan Boz",
      "character": "Mike"
    },
    {
      "id": "nm5632890",
      "name": "Christian Adam",
      "character": "Joey"
    },
    {
      "id": "nm4539269",
      "name": "Chanel Celaya",
      "character": "Katie"
    },
    {
      "id": "nm7733403",
      "name": "Sean Brosnan",
      "character": "Billy"
    },
    {
      "id": "nm8099229",
      "name": "Walker Stipe",
      "character": "Jock"
    },
    {
      "id": "nm5133511",
      "name": "Caleb Emery",
      "character": "Big Kid"
    },
    {
      "id": "nm5305484",
      "name": "Conphidance",
      "character": "Gangster"
    }
  ],
  "overview": "When one school teacher (Charlie Day) gets the other (Ice Cube) fired, he is challenged to an after-school fight.",
  "storyline": "On the last day of school, right on Senior Prank Day in Roosevelt High, things don't look good for meek English teacher Andy Campbell, who feels exceptionally expendable facing a bleak future in front of severe job cuts, just before the year's new school season. But soon, things will go from bad to worse when feeble Campbell will infuriate the scary hot-headed history teacher Ron Strickland, who in turn, he will challenge him in an old-school, no-holds-barred, mano-a-mano throwdown in front of everybody, in the parking lot after school. Inevitably, now that the fight is on, no excuses, no regrets, and certainly no talking sense into Strickland, is going to save Campbell who needs to face the consequences of his actions and pay the heavy price. After all, snitches get stitches.",
  "plot": "It is the last day before summer vacation at Roosevelt High School, and the students are out of control, devising elaborate senior pranks and creating chaos. Andy Campbell, the school's mild-mannered English teacher, and his fellow faculty members are trying to survive the chaotic day as best they can, but only the history teacher, Ron Strickland, is fierce enough to intimidate the students into behaving. Meanwhile, Campbell is awaiting news of the birth of his second child with his wife Maggie. While teaching, Campbell is pulled aside by his friend, the counselor Holly, to inform him of rumors of downsizing of all departments. Given his pregnant wife and child, this renders Campbell extremely anxious.\n\nAfter preventing Campbell from walking into a paint trap, Strickland asks for his assistance in using an outdated AV system which keeps turning off after a couple of seconds. Campbell catches a student, Neil, secretly using a remote control app on his smartphone to turn off the VCR. An infuriated Strickland grabs the phone and destroys it. Neil, using a classmate's phone, turns the TV off again and it enrages Strickland, who grabs a fire axe and destroys the student's desk, sending the class screaming from the room. Both Campbell and Strickland are brought to Principal Tyler's office to discuss the matter. Strickland warns Campbell to keep his behavior a secret, but after Tyler threatens to fire them both if no one steps forward, Campbell tells the truth, resulting in the loss of Strickland's job. In retaliation, Strickland challenges Campbell to a fist fight after school. Campbell is convinced that he physically does not stand a chance against Strickland, and tries to set matters straight by asking Neil to share a false testimony to Principal Tyler in order to clear Strickland's name and have him reinstated. Neil agrees on the condition that Campbell buy him a MacBook Pro. After doing so, Campbell runs into Maggie and his daughter, Ally, who remind him to arrive promptly that afternoon for Ally's father-daughter talent show. Neil's false account is enough to convince Principal Tyler to reinstate Strickland.\n\nCampbell and Strickland receive an emergency call from Holly. The two meet up with her in a mock United Nations debate room and discover she tricked them into coming there so they could talk through their issues, with Holly acting as mediator. When Campbell tells Strickland that he was able to get him his job back, Strickland is further enraged, stating that Campbell should have told him about this plan before acting, and citing the mishandling of the school system. The fight is still on.\n\nAfter seeking the advice of Holly and Coach Crawford, Campbell resolves to have Strickland removed from the campus before the day's end. As a last resort, Campbell threatens Neil into giving him the drug MDMA. As Principal Tyler finds his Toyota Prius vandalized and parked in the school's lobby. Campbell plants the Molly in Strickland's satchel. Campbell calls the police in the hopes of having Strickland arrested, but the attempt is botched and both teachers are incarcerated. The two teachers share a cell with other inmates, and Campbell goes across the cell and tricks an enormous inmate into giving Strickland a beating, but only when signaled. Campbell then returns to Strickland in order to trick him into giving the signal, but Strickland instead tells Campbell that the fight is called off after everything that they have been through the day. When the inmate nonetheless attacks Strickland, Strickland easily knocks him out, and upon realizing Campbell's actions, declares the fight back on. The two are then released, after the police discover the drug used to frame Strickland was only aspirin.\n\nCampbell heads back to the school to meet up with the school board, Tyler and Superintendent Johnson, but learns that his colleagues have all been fired. Impatient after being told to wait for nearly an hour, Campbell barges into the meeting and learns that he is one of the few to remain at his position. However, Campbell stands his ground and voices his complaints about the public school system not receiving the respect and materials it truly needs. Campbell heads over to Ally's talent show, where Ally's rendition of Big Sean's \"I Don't Fuck with You\" inspires him to take a stand against Strickland.\n\nIn the school parking lot, Campbell and Strickland confront each other, and engage in a heated fight that is dragged throughout the school and sees both men seemingly gaining the upper hand at different moments, before Campbell is ultimately knocked out. Strickland then answers Campbell's phone and learns that Maggie is about to give birth, at which point he decides to drive Campbell to the hospital.\n\nThat summer, Tyler arrives at the Campbell household to tell Campbell that the publicity and public outcry the fight generated has put the Department of Education in a position where they need to put more effort and money toward their schools, and must rehire Campbell and Strickland. Campbell accepts on the condition that his colleagues be reinstated. As the new school year begins, the faculty return to their respective positions. Campbell and Strickland, now best friends, are ready to enforce learning.\n\nIn a post-credits scene, Crawford is seen flirting with the 911 operator, whom Campbell had called earlier in a failed attempt to stop Strickland, in person. After rapping for her, Crawford realizes that he doesn't know her name.",
  "synopsis": "It's the last day for students and staff at Roosevelt High School. The seniors are wild and unruly, setting off pranks on their classmates and teachers. English teacher Andy Campbell (Charlie Day) has his parking spot taken by a student on a scooter, and he is too meek and sensitive to do anything about it. History teacher Ron Strickland (Ice Cube) is the most feared teacher in school. He catches two boys taking a prized bat from the school's cage and replacing it with a computer so they can watch porn. Strickland orders them to put the bat back and leave.Some of the teachers are worried because they have evaluations later that day that will determine the fate of their jobs. Campbell in particular is worried because he and his wife Maggie (JoAnna Garcia Swisher) are expecting their second child. Campbell gets pranked in his class when students draw dicks on his board. He gets pulled out by guidance counselor Holly Grossman (Jillian Bell) to let him know that some of the other English teachers have got fired, so his job might be safe.In the teachers' lounge, Campbell, Holly, and their friend Coach Crawford (Tracy Morgan) discuss the possibility of losing their jobs when one teacher who had worked there for 22 years has just been fired. He prepares to take some stuff from the lounge until Strickland shows up and scares him. Strickland tries to use the new coffee machine while complaining that the school's budget goes to stupid stuff. Campbell shows him how to work the coffee machine, but Strickland doesn't like how the coffee comes out.Campbell catches a student jerking off in the bathroom. He tries to get him to stop but is overheard by drama teacher Ms. Monet (Christina Hendricks). She considers Campbell a pervert following this encounter.On his way to class, Campbell is stopped by Strickland because he needs help in the class with AV equipment. Campbell says he can't and has to go to class, but Strickland stops him before he gets hit with some paint that the students set up as a prank. Campbell then decides to go and help out in the class. Strickland is playing a video on a VCR but notices that the picture will play for a few seconds before turning off. Campbell sees that one student, Neil (Austin Zajur), is playing a prank by using a remote app on his phone to turn the TV off. Strickland takes his phone and smashes it against the chalkboard. As they resume the film, a girl passes her phone to Neil to continue the prank. When he does it again, Strickland leaves the classroom and returns with a fire ax. The students run away freaked out as Strickland swings down on Neil's desk and chops it to bits.Strickland and Campbell are called into Principal Tyler's (Dean Norris) office after he hears about the incident. Strickland tells Campbell they need to stick together as teachers. However, Tyler threatens to fire both of them if he doesn't get a clear answer. Campbell caves and blames Strickland, resulting in Strickland getting fired. As payback, Strickland challenges Campbell to a fight later that day after school.Soon, word spreads around the school that the two teachers will fight each other. People spread rumors around as to why Strickland is so feared. They say he's an ex-cop, Special Forces, or just a plain old crazy killer guy. Holly and Crawford are confident that Strickland is going to kill Campbell with one punch. Campbell tries to do what he can to avoid anything from happening.Ms. Monet approaches Strickland after hearing about the fight. Since she thinks Campbell is a pervert, she suggests to Strickland that he use a knife against Campbell.Campbell tries to get Neil to take his word back on the classroom incident. Neil demands a MacBook Pro in return. Desperate, Campbell rushes to the nearest computer store to get one. He runs into Maggie and their daughter Ally (Alexa Nisenson). Maggie is worried that Campbell is there because he lost his job due to not sticking up for himself, which Ally agrees with. When asked about the computer, Campbell passes it off as a surprise for Maggie. Ally reminds him that he is helping her with a talent show performance later, but instead of their rehearsed dance to a \"Rent\" song, she wants to use a Big Sean song because she is worried about getting bullied by another girl. Campbell agrees and then has to run and get another MacBook.Campbell and Neil tell Tyler that the incident was made up so that Strickland can get his job back. Both Campbell and Strickland are called into the Model UN room for a mediation. Campbell tells Strickland the issue was resolved and he got his job back, but Strickland is even more mad over this since Campbell didn't talk to him about it. The fight is still on.Campbell makes a 911 call to report the impending beatdown. The operators on the other end laugh when Campbell tells them he's a teacher about to get beaten by another teacher.Campbell starts to have a breakdown in his classroom. He falls victim to a prank (literally) when the students put a rope around his feet and use a horse doped up on meth to drag him out of the class and get sprayed with paint. Crawford also gets sprayed as well. Campbell then decides he's had enough and wants to put an end to the nonsense. He plans to set Strickland up by planting drugs in his classroom and getting him arrested.Campbell gets what is believed to be molly from Neil. On his way to Strickland's class, he runs into Tyler, who tells him his evaluation is now at 2:15, right before Ally's show. Campbell plants the drugs in Strickland's class and waits for the cops outside with Holly and Crawford. The drug-sniffing dog fails to sniff the drugs, and the cops leave. Holly takes out a joint, which Campbell grabs and runs into the class with so he can lure the cops back. Strickland is already in the class and knows what Campbell is up to. Campbell lights the joint and brings back the cops plus campus security guard Mehar (Kumail Nanjiani). Both Strickland and Campbell get arrested.In their cell, Campbell blames Strickland for getting them into this mess. Campbell goes over to a large inmate (Winston James Francis) and tells him that Strickland called him a bitch and that he wants to fight him. He tells the big guy to look out for Strickland nodding as the signal. Campbell goes back over to Strickland to instigate things, but Strickland says the fight is off since he only did it to prove a point in that the school doesn't care about what goes on if students are running around uncontrollably, and that Campbell isn't even man enough to fight. When Campbell tries to clarify that the fight is off, Strickland nods, bringing the big inmate over. Strickland realizes that Campbell set them up, so he takes down the big guy with a sleeper hold and tells Campbell the fight is still on. A cop comes over and says the guys are free to go because the molly was really aspirin.It's now 2:00. Campbell rushes back to the school for his evaluation. Crawford comes out and tells Campbell that he, Holly, and Monet have all gotten fired. Campbell is forced to wait outside when it is nearly 2:30, meaning he will be late for Ally's show. Campbell barges into Tyler's office and sees him listening to a story from the superintendent (Dennis Haysbert). Tyler says that they've fired enough teachers for the day and must discuss upcoming changes to the school. When Campbell asks, Tyler says it's none of his business. Campbell finally puts his foot down and tells off Tyler and the superintendent for making him wait outside and trying to hurt the school even more. He tells them they suck at their jobs and he leaves.Campbell rushes to Ally's school and comes in as she has done a pitiful solo performance of the \"Rent\" song. He goes over to Maggie and gets the DJ to play the Big Sean song. Campbell talks to Ally and apologizes for being late. They go out on stage to play the song. What Campbell didn't know is that the song Ally wants to play is \"I Don't Fuck With You\", which Ally directs to her bully, Trisha. Another teacher cuts off the music, but the rest of the kids love Ally's performance. Campbell is proud of her and runs off to the fight.The entire student body is gathered outside for the big fight. Campbell is cheered on for showing up. He faces Strickland and the fight begins. Strickland gets the first punch easily, but Campbell gets back on his feet and gets some good swings in. He bites Strickland's leg and also gets him with a stapler. Strickland uses more force in the fight, but Campbell doesn't stay down. He runs back into the school, and everyone follows. Campbell tackles Strickland to the ground. He then gets a fire extinguisher to spray Strickland and then whacks him over the head with it, taking him down. The students and staff cheer Campbell on as he runs outside, only for Strickland to come back and punch his lights out. Maggie then calls, and Strickland answers the phone. Strickland wakes Campbell up to inform him that Maggie is going into labor. He pulls Campbell up and takes him to the hospital.Campbell goes to Maggie's room to meet with her. He explains everything he's been through that day and that he is finally going to stand up for himself. They then get ready for the baby.Sometime over the summer, the Campbells are having a barbecue with Holly, Crawford, and other friends. Ally is now more popular with the other kids. Tyler shows up and tells Campbell that the fight attracted a lot of attention to the school board, and he must ask both him and Strickland to return to work because his own job now depends on it. Campbell agrees to return on one condition.The final scene takes place on the first day of the new school year. Campbell got Tyler to rehire Holly, Crawford, and Monet. Strickland returns to the job with more respect for Campbell. The two spot a kid picking on another kid, and they both send the first kid to detention. The two then head off to teach their new classes."
}