{
  "imdb_id": "tt3422428",
  "tmdb_id": "245493",
  "douban_id": null,
  "title": "Ezhu Sundara Rathrikal (2013)",
  "genres": [
    "Family"
  ],
  "country": "India",
  "version": [],
  "imdb_rating": 5.0,
  "director": [
    {
      "id": "nm0430485",
      "name": "Lal Jose"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm0226770",
      "name": "Dileep",
      "character": "(as Dilip)"
    },
    {
      "id": "nm3634501",
      "name": "Rima Kallingal",
      "character": ""
    },
    {
      "id": "nm1729382",
      "name": "Murali Gopy",
      "character": ""
    },
    {
      "id": "nm7886994",
      "name": "Parvathy Nambiar",
      "character": ""
    },
    {
      "id": "nm1668938",
      "name": "Arun",
      "character": ""
    },
    {
      "id": "nm5465121",
      "name": "Sekhar Menon",
      "character": ""
    },
    {
      "id": "nm0695595",
      "name": "Praveena",
      "character": ""
    },
    {
      "id": "nm2184443",
      "name": "Tini Tom",
      "character": ""
    }
  ],
  "overview": "Ezhu Sundara Rathrikal narrates the sequence of events that follow the protagonist's bachelor party.",
  "storyline": "Ezhu Sundara Rathrikal is the story of Eby , an ad-film maker. He decided to tie the knot, Suddenly some problem occur on Eby before seven days of his marriage. So he has to solve the problem before his marriage.",
  "plot": "Aby Mathew (Dileep) is an ad film-maker who is about to marry his model Ann (Parvathy Nambiar). Aby throws a bachelors party for his bunch of friends viz. Abid (Harishree Ashokan), Franco (Tiny Tom), Daisy (Praveena) and a few others just seven days before the marriage. Through Abid, Aby learns of his ex-flame Sini's (Reema Kallinga) presence in the same city with whom he had a fall-out just a few days before their marriage. An inebriated Aby decides to go to Sini to invite her for his marriage. Sini talks high of her husband Alex (Murli Gopy), a boxer, with whom she has a son as well. Aby also boasts of his fiancée.The events take an ugly turn when Aby and Sini's paths cross again and again",
  "synopsis": null
}