{
  "imdb_id": "tt3479624",
  "tmdb_id": "278768",
  "douban_id": null,
  "title": "The Cartel (2014)",
  "genres": [
    "Crime",
    "Drama"
  ],
  "country": "Denmark",
  "version": [
    {
      "runtime": "100 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm0098291",
      "name": "Charlotte Sachs Bostrup"
    }
  ],
  "writer": [
    {
      "id": "nm0098291",
      "name": "Charlotte Sachs Bostrup",
      "description": null
    },
    {
      "id": "nm1181671",
      "name": "Henrik Kristensen",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0077944",
      "name": "Anders W. Berthelsen",
      "character": "Lars Halbo"
    },
    {
      "id": "nm1052286",
      "name": "Lene Maria Christensen",
      "character": "Rikke Halbo"
    },
    {
      "id": "nm0843237",
      "name": "Leif Sylvester",
      "character": "Willy Halbo"
    },
    {
      "id": "nm1959495",
      "name": "Gitte Siem",
      "character": "Gretha Halbo"
    },
    {
      "id": "nm6356293",
      "name": "Ludvig Leander Wiedemann",
      "character": "Andreas Halbo"
    },
    {
      "id": "nm3675215",
      "name": "Mai Kirkensgaard",
      "character": "Betty Halbo"
    },
    {
      "id": "nm1046521",
      "name": "Lars Ranthe",
      "character": "Knutte"
    },
    {
      "id": "nm0711292",
      "name": "Benjamin Boe Rasmussen",
      "character": "Allan Svendsen"
    },
    {
      "id": "nm0039168",
      "name": "Jesper Asholt",
      "character": "Carsten Jørgensen"
    },
    {
      "id": "nm0256953",
      "name": "Flemming Enevold",
      "character": "Christian Storgaard"
    },
    {
      "id": "nm0117368",
      "name": "Lars Brygmann",
      "character": "Bo Valentin"
    },
    {
      "id": "nm1315040",
      "name": "Jacob Lohmann",
      "character": "Jørgen Persson       (as Jakob Ulrik Lohmann)"
    },
    {
      "id": "nm0712513",
      "name": "Kurt Ravn",
      "character": "Preben Pedersen"
    },
    {
      "id": "nm1402303",
      "name": "Rasmus Hammerich",
      "character": "Thomas Andersen"
    },
    {
      "id": "nm0697978",
      "name": "Henrik Prip",
      "character": "Erling Nielsen"
    },
    {
      "id": "nm0406514",
      "name": "Kristian Ibler",
      "character": "Keld Toft"
    },
    {
      "id": "nm0711401",
      "name": "Pauli Ryberg",
      "character": "Bragge"
    },
    {
      "id": "nm1036116",
      "name": "Frank Thiel",
      "character": "Nystrøm"
    },
    {
      "id": "nm6356294",
      "name": "Tanya Lund Andersen",
      "character": "Freja"
    },
    {
      "id": "nm0617529",
      "name": "Anders Mårtensson",
      "character": "Skånsk Grossist"
    },
    {
      "id": "nm0406059",
      "name": "Jacob Højlev Jørgensen",
      "character": "Bankrådgiver"
    },
    {
      "id": "nm6356298",
      "name": "Dennis Petersen",
      "character": "Indsatsleder"
    },
    {
      "id": "nm0372918",
      "name": "Morten Hebsgaard",
      "character": "Arbejdstilsynsførende"
    },
    {
      "id": "nm6356295",
      "name": "Simon Bjørn Mosel",
      "character": "Lærling"
    },
    {
      "id": "nm4336189",
      "name": "Johnny Hoffmann Laurberg Fabricius",
      "character": "Maler"
    },
    {
      "id": "nm6356296",
      "name": "Peer Bruun",
      "character": "Tømrer"
    },
    {
      "id": "nm4826998",
      "name": "Jakob Svarre Juhl",
      "character": "Medarbejder, Grossist"
    },
    {
      "id": "nm9991724",
      "name": "Thomas Hou Mandsfeldt",
      "character": "Byder"
    },
    {
      "id": "nm6715046",
      "name": "Kristoffer Falck Primsø",
      "character": "Politimand"
    }
  ],
  "overview": "The successful entrepreneur Lars Halbo returns to Denmark when he inherits the family firm, but when he refuses to cooperate in illegal cartel pricing, his little company comes under heavy pressure.",
  "storyline": "The successful entrepreneur Lars Halbo returns to Denmark when he inherits the family firm, but when he refuses to cooperate in illegal cartel pricing, his little company comes under heavy pressure.",
  "plot": "John \"Breacher\" Wharton is the leader of the Drug Enforcement Administration's Special Operations Team, which consists of James \"Monster\" Murray, Monster's wife Lizzy Murray, Joe \"Grinder\" Philips, Julius \"Sugar\" Edmonds, Eddie \"Neck\" Jordan, Tom \"Pyro\" Roberts, Bryce \"Tripod\" McNeely and \"Smoke\" Jennings.\n\nDuring a raid on a cartel warehouse, Smoke is killed, the team steals $10 million and hides it in the sewer while blowing up the rest to cover their tracks. The money disappears, and their superior Floyd Demel suspends them while the DEA investigates the team for the theft. After several months without any confessions or evidence of their participation, the team is reinstated.\n\nPyro is killed after an unidentified stranger tows his trailer onto a railroad crossing while he is unconscious and is rammed by a train before he could escape. Atlanta Police homicide detective Caroline Brentwood and her partner Darius Jackson are assigned to the case and interrogate Pyro's teammates.\n\nBrentwood notes Neck is aggressively avoiding interrogation, and Breacher accompanies her to Neck's house hopeful he will cooperate. When they arrive, they find him nailed to the ceiling and disemboweled. Brentwood recognizes the execution as the modus operandi of the cartels, leading Breacher to assume the cartel is hunting the team over the stolen money.\n\nBreacher and Brentwood visit Tripod, who left the DEA after being suspended, and find him dead after a shootout in which he killed an assailant Breacher identified as a cartel enforcer. Monster later visits Brentwood, who is suspicious of Breacher. Monster tells her that Breacher's family was kidnapped by the cartels, who videotaped their murders and later sent the tape to Breacher along with the severed body parts of his wife and son. Breacher spent months searching for his family's killers before the team convinced him to move on. Brentwood apologizes to Breacher, and they have sex.\n\nJackson traces the dead enforcer's cellphone to a cartel safe house, which is raided by Breacher and his team, but the enforcers are not there. They are later found dead at the bottom of a river near Tripod's house, and Detective Brentwood realizes that they were killed before Pyro and Neck, meaning someone is framing the cartel for killing their team members.\n\nBreacher reunites the team to tell them what happened, and Lizzy lashes out and reveals she's been having an affair with Sugar. Grinder confides in Brentwood that they stole the money. Breacher and Brentwood meet with Grinder in a local restaurant and Lizzy kills Grinder using a sniper rifle. Lizzy and Sugar have been behind the murders of their teammates. Lizzy is putting together her gear to leave the country with Sugar when Monster figures out she's behind the murders. He destroys Lizzy's passport to prevent her from leaving the country, and Lizzy attacks him with a knife, killing him.\n\nBreacher and Brentwood go to Lizzy's house and find Monster's body stuffed in a refrigerator. Lizzy calls Breacher, pretending to be alone, and arranges a meeting at a parking garage. Breacher goes there with Detective Brentwood, who ducks down in the car, unseen. Lizzy and Sugar ambush Breacher, and Brentwood assists Breacher. Lizzy and Sugar drive away, chased by Breacher and Brentwood. Sugar and Lizzy's car crashes into a tow truck, decapitating Sugar.\n\nBreacher and Brentwood confront a dying Lizzy, who accuses the team of stealing the money behind her back, motivating her to seek revenge. Brentwood is puzzled, assuming Lizzy had stolen the money. Breacher tells the dying Lizzy that he took the money. Lizzy tries to reach for her weapon and Breacher kills her. The local cops arrive and Breacher disappears.\n\nWeeks later, Breacher is in Mexico, where he uses the stolen money to bribe a corrupt police official into helping him identify Brujo, the man who murdered his family. Breacher finds him in a Mexican bar and kills him and others loyal to him in a shootout and he is shot in the chest. Breacher sits at a table, takes a shot of whiskey, lights up one last cigar and smiles as he hears the sirens.",
  "synopsis": null
}