{
  "imdb_id": "tt3469918",
  "tmdb_id": "254323",
  "douban_id": null,
  "title": "Jack (2014)",
  "genres": [
    "Drama"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "103 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm0074163",
      "name": "Edward Berger"
    }
  ],
  "writer": [
    {
      "id": "nm0074163",
      "name": "Edward Berger",
      "description": "screenplay &"
    },
    {
      "id": "nm0611126",
      "name": "Nele Mueller-Stöfen",
      "description": "screenplay"
    },
    {
      "id": "nm0611126",
      "name": "Nele Mueller-Stöfen",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm6222008",
      "name": "Ivo Pietzcker",
      "character": "Jack"
    },
    {
      "id": "nm6222009",
      "name": "Georg Arms",
      "character": "Manuel"
    },
    {
      "id": "nm4533391",
      "name": "Luise Heyer",
      "character": "Sanna"
    },
    {
      "id": "nm0611126",
      "name": "Nele Mueller-Stöfen",
      "character": "Becki"
    },
    {
      "id": "nm1559784",
      "name": "Vincent Redetzki",
      "character": "Jonas"
    },
    {
      "id": "nm0559326",
      "name": "Jacob Matschenz",
      "character": "Philipp"
    },
    {
      "id": "nm2272669",
      "name": "Odine Johne",
      "character": "Kati"
    },
    {
      "id": "nm4097003",
      "name": "Johann Jürgens",
      "character": "Mattes"
    },
    {
      "id": "nm4696667",
      "name": "Atheer Adel",
      "character": "Ophir"
    },
    {
      "id": "nm3069596",
      "name": "Anthony Arnold",
      "character": "Danilo"
    },
    {
      "id": "nm3385513",
      "name": "Amar Saaifan",
      "character": "Marc"
    },
    {
      "id": "nm7679552",
      "name": "Justine Ewerth",
      "character": "Tanja"
    },
    {
      "id": "nm7679553",
      "name": "Celina Rodemann",
      "character": "Mikki"
    },
    {
      "id": "nm7679554",
      "name": "Patrick Sommerburg",
      "character": "Boris"
    },
    {
      "id": "nm7679555",
      "name": "Dolunay Bales",
      "character": "Tay"
    },
    {
      "id": "nm7679556",
      "name": "Leon Fürstenau",
      "character": "Leon"
    },
    {
      "id": "nm7679557",
      "name": "Maurice Martin",
      "character": "Maurice"
    },
    {
      "id": "nm0796557",
      "name": "Michael Sideris",
      "character": "Hausmeister"
    },
    {
      "id": "nm1526525",
      "name": "Daniela Holtz",
      "character": "Sozialarbeiterin"
    },
    {
      "id": "nm2453050",
      "name": "Stefan Miess",
      "character": "Mitarbeiter       (as Stefan Mies)"
    },
    {
      "id": "nm2389717",
      "name": "Johannes Hendrik Langer",
      "character": "Verkäufer"
    },
    {
      "id": "nm1923675",
      "name": "Christian Sengewald",
      "character": "Kunde"
    },
    {
      "id": "nm7679559",
      "name": "Sébastien Jacobi",
      "character": "Peter"
    },
    {
      "id": "nm3645507",
      "name": "Johann Fohl",
      "character": "Polizist"
    },
    {
      "id": "nm0090100",
      "name": "Christian Blümel",
      "character": "Tony"
    },
    {
      "id": "nm1112548",
      "name": "Johannes Naber",
      "character": "Katis Freund"
    },
    {
      "id": "nm5228404",
      "name": "Victor Pape-Thies",
      "character": "Clubber"
    },
    {
      "id": "nm3279560",
      "name": "Moritz Virmond",
      "character": "Bartender"
    },
    {
      "id": "nm7679560",
      "name": "Svenja Liesau",
      "character": "Mattes Freundin"
    }
  ],
  "overview": "Although he is only ten years old, Jack is responsible for himself and his little brother Manuel and this fills him with pride. Their single mother works during the day and often goes out at night. There’s no father in sight. One day, Manuel burns himself with boiling hot water while bathing and Jack is blamed for the incident. It's reason enough for social services to put him in a home where he is dreadfully homesick. He soon gets into trouble and bolts, heading for home. He arrives back, only to find his mother is once again absent. Jack and Manuel roam the city in search of her. They sleep in parks and in an underground car park, run away from the police and encounter adults, some of whom help and others who are indifferent.",
  "storyline": "For JACK (10), having a family is the most important thing in the world. Then, one day, his mother disappears. Together with his younger brother MANUEL (6), he embarks on a journey to find her... the journey of a boy who has learnt from an early age to take responsibility. In the end, his brave and startling decision holds up a mirror to all of us.",
  "plot": "A Baker and his Wife wish for a child but suffer under a curse laid upon the Baker's family by a Witch who found the Baker's father robbing her garden when his mother was pregnant. The Baker's father also stole some beans which caused the Witch's mother to punish her with the curse of ugliness. The Witch offers to lift the curse, but only if the Baker and his Wife obtain four critical items for her: a cow as white as milk, a cape as red as blood, the hair as yellow as corn, and a slipper as pure as gold. The Witch later tells the Baker that she asked him to do this task for her because she is not allowed to touch any of the objects.\n\nThe Witch's demands eventually bring the Baker and his Wife into contact with Jack, who is selling his beloved cow Milky-White and to whom the Baker offers magic beans left him by his father (which were stolen from the Witch) which grow into a large beanstalk; with Red Riding Hood, whose ruby cape the couple notices when she stops to buy sweets on her way to grandmother's house; with Rapunzel, whose tower the Baker's Wife passes in the woods; and with Cinderella, who also runs into the Baker's Wife while fleeing from the pursuing Prince.\n\nAfter a series of failed attempts and misadventures, the Baker and his Wife finally are able to gather the items necessary to break the spell. Meanwhile, each of the other characters receive their \"happy endings\": Cinderella marries the Prince; Jack provides for his mother by stealing riches from the Giant in the sky, and kills the pursuing Giant by cutting down the beanstalk; Little Red Riding Hood and her Grandmother are saved from the Big Bad Wolf; and the Witch regains her youth and beauty after drinking the potion.\n\nHowever, each of the characters learns their \"happily ever after\" is not so happy: the Baker is worried he is a poor father to his newborn baby; the Baker's Wife is temporarily seduced by the Prince; Cinderella is disenchanted by the cheating Prince; and the Witch learns that she has lost her powers with her restored youth and beauty. The growth of a second beanstalk from the last remaining magic bean allows the Giant's Wife to climb down and threaten the kingdom and its inhabitants if they do not deliver Jack in retribution for killing her husband. The characters debate the morality of handing Jack over. In the process, Red Riding Hood's Mother and Grandmother, Jack's Mother, and the Baker's Wife are killed. The characters blame each other for their individual actions that lead to the tragedy, ultimately blaming the Witch for raising the beans in the first place. She curses them for their inability to accept their individual responsibilities and disappears into the ground, summoning a large pit of boiling tar in the process.\n\nThe remaining characters resolve to kill the threatening Giant's Wife, though Cinderella and the Baker try to explain to the distraught Red Riding Hood and Jack the complicated morality of retribution and revenge. The characters lure the Giant's Wife into stepping in the tar pit where she ultimately trips and falls to her death. The Giant's Wife is killed, and the characters move forward with their ruined lives. The Baker, thinking of his Wife, is determined to be a good father. Cinderella decides to leave the Prince and help the Baker, and Jack and Red Riding Hood, now orphans, are living with the Baker and Cinderella. The Baker comforts his son after he begins to cry by telling a story as the movie ends with the Witch's moral, meaning that children can change due to the parent's actions and behaviors.",
  "synopsis": null
}