{
  "imdb_id": "tt3499084",
  "tmdb_id": "253293",
  "douban_id": null,
  "title": "Lady Valor: The Kristin Beck Story (2014)",
  "genres": [
    "Documentary"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.5,
  "director": [
    {
      "id": "nm0381318",
      "name": "Mark Herzog"
    },
    {
      "id": "nm1331050",
      "name": "Sandrine Orabona"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm6586544",
      "name": "Kristin Beck",
      "character": "Herself"
    }
  ],
  "overview": "A former U.S. Navy Seal seeks life, liberty and the pursuit of happiness living life as a transgender woman.",
  "storyline": "In \"Lady Valor\", former U.S. Navy SEAL Christopher Beck embarks on a new mission as Kristin Beck as she lives her life truthfully as a transgender woman. In 2011, after 20 years of service on SEAL Team 1, she retired from service though continued to hide her true identity while working for the United States Government and the Pentagon. In 2013, a year and a half after retirement, Kristin came out publicly through LinkedIn and confirmed her true identity on CNN's Anderson Cooper 360 taking many friends and family by surprise. While many people have been supportive, some in the some in the public have expressed more bigotry than she ever expected. After a lifetime of service, Kristin has learned that her fight for life, liberty, and the pursuit of happiness did not end on the battlefield.",
  "plot": null,
  "synopsis": "In Lady Valor: The Kristin Beck Story, former U.S. Navy SEAL Christopher Beck embarks on a new mission as Kristin Beck. Kristin's journey in search of the American ideals that she protected have a whole new meaning as she lives her life truthfully as a transgender woman.\nKristin served for over 20 years as a member of the elite special forces Navy SEALs on SEAL Team 1 as well as the United States Special Warfare Development Group what many in the public refer to as SEAL Team Six. She retired in 2011 with the rank of Senior Chief and continued high-level clearance work for the United States government and the Pentagon. But Kristin hid her true identity throughout and after her service knowing she would lose it all if anyone were to know her secret. In 2013, a year and a half after retirement, Kristin came out publicly first on LinkedIn and on CNNs Anderson Cooper 360 soon thereafter. Many friends, colleagues and family were taken by surprise.\nThis film brings exclusive interviews from Kristins family and friends about her service, as well as their reactions to her coming out. It also includes exclusive footage of Chris Beck in training and combat. The documentary was filmed only a few months after the AC360 piece had aired, and the truth is still fresh and emotional for those closest to her. While many people have been supportive, some in the public have expressed more bigotry than she ever expected. After a lifetime of service, Kristin has learned that her fight for life, liberty and the pursuit of happiness did not end on the battlefield."
}