{
  "imdb_id": "tt3432552",
  "tmdb_id": "347764",
  "douban_id": null,
  "title": "Goddess of Love (2015)",
  "genres": [
    "Drama",
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "93 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.3,
  "director": [
    {
      "id": "nm1394062",
      "name": "Jon Knautz"
    }
  ],
  "writer": [
    {
      "id": "nm2452551",
      "name": "Alexis Kendra",
      "description": "screenplay"
    },
    {
      "id": "nm1394062",
      "name": "Jon Knautz",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm2452551",
      "name": "Alexis Kendra",
      "character": "Venus"
    },
    {
      "id": "nm1712549",
      "name": "Woody Naismith",
      "character": "Brian"
    },
    {
      "id": "nm1489930",
      "name": "Elizabeth Sandy",
      "character": "Christine"
    },
    {
      "id": "nm3771539",
      "name": "Monda Scott",
      "character": "Chanel"
    },
    {
      "id": "nm6249352",
      "name": "Hugh Westbourne",
      "character": "Jack"
    },
    {
      "id": "nm6225440",
      "name": "Richard Velton",
      "character": "Dr. Michael Brandt"
    },
    {
      "id": "nm6225441",
      "name": "Anna Logan",
      "character": "Victoria /              Dancer"
    },
    {
      "id": "nm2920761",
      "name": "Ray Grady",
      "character": "Johnny"
    },
    {
      "id": "nm6225452",
      "name": "Renda Mishalany",
      "character": "Ballet Instructor"
    },
    {
      "id": "nm6193916",
      "name": "Dale Brandenburg",
      "character": "Man in Train Station"
    },
    {
      "id": "nm4131336",
      "name": "Rachel Alig",
      "character": "Gossip Girl #1"
    },
    {
      "id": "nm2435275",
      "name": "Deana Ricks",
      "character": "Gossip Girl #2"
    },
    {
      "id": "nm6249353",
      "name": "Janet Peters",
      "character": "Homeless Woman"
    },
    {
      "id": "nm4954385",
      "name": "Terrance Wentz",
      "character": "Club Manager"
    },
    {
      "id": "nm6193802",
      "name": "Katrina Elizabeth",
      "character": "Dancer #1"
    },
    {
      "id": "nm6193803",
      "name": "Grace Demarco",
      "character": "Dancer #2"
    },
    {
      "id": "nm7449842",
      "name": "Candice Camille",
      "character": "Dancer #3"
    },
    {
      "id": "nm5098545",
      "name": "Kendall Foote",
      "character": "Cop #1"
    },
    {
      "id": "nm4358720",
      "name": "James Deloy Scott",
      "character": "Cop #2"
    },
    {
      "id": "nm3647827",
      "name": "Will Leon",
      "character": "Douchebag #1"
    },
    {
      "id": "nm4719102",
      "name": "Michael Silva",
      "character": "Douchebag #2"
    },
    {
      "id": "nm4809006",
      "name": "Emily Lawrence",
      "character": "Girl in Restaurant"
    },
    {
      "id": "nm3297990",
      "name": "Steve Craig",
      "character": "Street Guy /              Desert Driver"
    },
    {
      "id": "nm6193917",
      "name": "Xulan Chen",
      "character": "Woman in Train Station"
    },
    {
      "id": "nm5692772",
      "name": "Leonel Claude",
      "character": "Bar /              Club Patron"
    },
    {
      "id": "nm6256751",
      "name": "Arleum Curry",
      "character": "Bar Patron"
    },
    {
      "id": "nm7449843",
      "name": "Shawna De Rosa",
      "character": "Stage Dancer"
    },
    {
      "id": "nm6236123",
      "name": "Erica Elson",
      "character": "Mother"
    },
    {
      "id": "nm5970956",
      "name": "Mariana Elson",
      "character": "Baby"
    },
    {
      "id": "nm2532667",
      "name": "Anna Lillie",
      "character": "Restaurant Patron"
    },
    {
      "id": "nm6248444",
      "name": "Megan Scott",
      "character": "Bar Patron"
    },
    {
      "id": "nm2251279",
      "name": "Matt Shapira",
      "character": "Crack Addict"
    },
    {
      "id": "nm3180820",
      "name": "Mike Valley",
      "character": "Thomas"
    }
  ],
  "overview": "Enter into a baroque vortex of madness when an emotionally unstable woman is shattered after tremendous heartbreak. Brian was the love of Venus’ life and the thought of him having an affair with another woman begins her volatile descent into the dark side of psychosexual insanity.",
  "storyline": "Venus is a gorgeous exotic dancer--who, like a true Goddess of Love--leaves men powerless before her, and their wallets empty. However, when Venus falls for a handsome Australian photographer with the power to have her craving for a fresh start, minute and insignificant changes in his attitude will gradually give way to indifference, exhaustion--and, ultimately--stagnation in their relationship. In the end--betrayed, vulnerable, and torn from the ever-growing hallucinations--Venus will turn to the only person loyal to her: her true inner self; an obscure imitation of an outer shell that demands to be loved. Who shall stand in the way of a goddess?",
  "plot": "Raymond Goodfellow rides on a country road on his motor scooter. His voice over explains, “You can’t control who you love. You can't control who loves you. You can't control where it happens, or when it happens, or why it happens. You can't control any of that stuff.”\n\nThe film flashes back to three months earlier to Ray’s time as a confident, self-centered lounge singer/dart thrower. Ray’s band consists of his friends Fozzie (guitar), Frank (stand-up bass) and the “love of his life” Kelly (drums). Before he joins the band onstage, Ray prays to God asking him for assistance in getting Kelly to love him. Despite Ray’s ongoing affection to her, she seems drawn to Fozzie who, claiming he's genuinely uninterested, is rejecting Kelly’s advances.\n\nAfter Ray’s crowd pleasing performance, he is informed by the bartender that someone has left a package for him. The package contains “love darts.” The instructions for the darts explain that when someone is poked with love dart they are immediately attracted to the first person they see. This attraction lasts for 6 hours. At the end of the 6 hours if the love is meant to last it will, but if the love wasn't meant to be, it won’t.\n\nRay tells Fozzie about the darts and they both agree to have a test run. While the band walks home from a gig, Ray throws a love dart catching a prissy Jersey Girl named Angela. The first man she sees is Ray’s quiet, low-key bandmate Frank. Just as the instructions promised, Angela falls in love with Frank immediately. Ray and Fozzie follow the new couple around. After exactly six hours, Angela appears to still be in love with Frank and Ray declares the darts “effective.”\n\nRay enlists Fozzie’s help in creating the “most romantic six hours” ensuring that Kelly will remain in love with Ray after the love dart’s initial power ends. Fozzie is able to offer several tips, knowing a surprising amount about Kelly and the things that are important to her.\n\nRay goes to Kelly’s house and strikes her with a dart. As promised by the dart’s instructions, she immediately falls in love with him. They go on their date which goes perfectly. Towards the end of the six hours they kiss. When the six hours end, Kelly looks uncomfortable, thanks him for the evening, and leaves. It is clear that the love from the dart did not last.\n\nRay consoles himself by poking one woman after another until he has a whole flock of women (and one man) who are completely in love with him for six hours. During this time all he can do is talk about getting Kelly to fall in love with him again. He even contemplates convincing her that she has diabetes so she has to poke herself with the love darts over and over again.\n\nThe love darts wear off and he is alone again, ready to try his last dart on Kelly one more time. Walking home from another gig with his band, Ray prepares for his final throw at Kelly. Moments before throwing the dart he realizes that his loyal friend Fozzie is really in love with her and that she is really in love with him. Instead of striking Kelly with the dart, he hits Fozzie right as he looks up at Kelly. The two instantly fall in love with each other.\n\nA wiser and less self-centered Ray returns to his apartment. He finds another mysterious box outside his apartment with a note that says “nice work.” He opens the box and finds Cupid’s bow and arrow.\n\nThe film flashes forward to three months in the future at the point the film began. The band continues but without Ray; Angela is the new singer. Frank &amp; Angela and Fozzie &amp; Kelly are still very much in love. Ray is many miles away driving on his motor scooter on the country road his bow and arrow tied to his back. He repeats “you can’t control who you love, or who loves you.” He ends by saying that love doesn’t make sense. He knows all this because “I am the God of Love.”",
  "synopsis": null
}