{
  "imdb_id": "tt3464902",
  "tmdb_id": "254320",
  "douban_id": "20514947",
  "title": "The Lobster (2015)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance",
    "Sci-Fi",
    "Thriller"
  ],
  "country": "Ireland",
  "version": [
    {
      "runtime": "119 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm0487166",
      "name": "Yorgos Lanthimos"
    }
  ],
  "writer": [
    {
      "id": "nm0487166",
      "name": "Yorgos Lanthimos",
      "description": "written by and"
    },
    {
      "id": "nm3328207",
      "name": "Efthymis Filippou",
      "description": "written by as Efthimis Filippou"
    }
  ],
  "cast": [
    {
      "id": "nm0009008",
      "name": "Jacqueline Abrahams",
      "character": "Donkey Shooter"
    },
    {
      "id": "nm0004355",
      "name": "Roger Ashton-Griffiths",
      "character": "Doctor"
    },
    {
      "id": "nm1875238",
      "name": "Jessica Barden",
      "character": "Nosebleed Woman"
    },
    {
      "id": "nm1469236",
      "name": "Olivia Colman",
      "character": "Hotel Manager"
    },
    {
      "id": "nm7114240",
      "name": "Anthony Dougall",
      "character": "70 Year Old Waiter"
    },
    {
      "id": "nm2817543",
      "name": "Sean Duggan",
      "character": "Guard Waiter"
    },
    {
      "id": "nm0268199",
      "name": "Colin Farrell",
      "character": "David"
    },
    {
      "id": "nm7114241",
      "name": "Roland Ferrandi",
      "character": "Loner Leader's Father"
    },
    {
      "id": "nm7114242",
      "name": "James Finnegan",
      "character": "Bald Man"
    },
    {
      "id": "nm7114243",
      "name": "Robert Heaney",
      "character": "Restaurant Waiter"
    },
    {
      "id": "nm3047502",
      "name": "Rosanna Hoult",
      "character": "David's Wife"
    },
    {
      "id": "nm7961172",
      "name": "Jaro",
      "character": "Bob the Dog"
    },
    {
      "id": "nm7961173",
      "name": "Ryac",
      "character": "Bob the Dog"
    },
    {
      "id": "nm0421332",
      "name": "Ashley Jensen",
      "character": "Biscuit Woman"
    },
    {
      "id": "nm7114244",
      "name": "Kathy Kelly",
      "character": "Police Officer 1"
    },
    {
      "id": "nm3987673",
      "name": "Ariane Labed",
      "character": "The Maid"
    },
    {
      "id": "nm1133714",
      "name": "Ewen MacIntosh",
      "character": "Trainer Waiter - Shooting Range"
    },
    {
      "id": "nm7114245",
      "name": "Patrick Malone",
      "character": "Campari Man"
    },
    {
      "id": "nm6296257",
      "name": "Sandra Hayden Mason",
      "character": "Arrested Town Woman       (as Sandra Mason)"
    },
    {
      "id": "nm2384707",
      "name": "Kevin McCormack",
      "character": "Police Officer 2"
    },
    {
      "id": "nm7114246",
      "name": "Ishmael Moalosi",
      "character": "Bandaged Loner"
    },
    {
      "id": "nm6424520",
      "name": "Anthony Moriarty",
      "character": "30 Year Old Waiter"
    },
    {
      "id": "nm5424641",
      "name": "Garry Mountaine",
      "character": "Hotel Manager's Partner"
    },
    {
      "id": "nm7114247",
      "name": "Judi King Murphy",
      "character": "Guest Room 104"
    },
    {
      "id": "nm5973680",
      "name": "Laoise Murphy",
      "character": "New Daughter"
    },
    {
      "id": "nm7114248",
      "name": "Imelda Nagle Ryan",
      "character": "Loner Leader's Mother"
    },
    {
      "id": "nm6543935",
      "name": "Nancy Onu",
      "character": "Hotel Receptionist"
    },
    {
      "id": "nm2639968",
      "name": "Matthew O'Brien",
      "character": "Trapped Loner"
    },
    {
      "id": "nm3878680",
      "name": "EmmaEdel O'Shea",
      "character": "Nosebleed Woman's Best Friend"
    },
    {
      "id": "nm1465326",
      "name": "Angeliki Papoulia",
      "character": "Heartless Woman"
    },
    {
      "id": "nm0000604",
      "name": "John C. Reilly",
      "character": "Lisping Man"
    },
    {
      "id": "nm2244205",
      "name": "Léa Seydoux",
      "character": "Loner Leader"
    },
    {
      "id": "nm0806968",
      "name": "Michael Smiley",
      "character": "Loner Swimmer"
    },
    {
      "id": "nm7114250",
      "name": "Chris Threader",
      "character": "Coach Driver Waiter"
    },
    {
      "id": "nm0001838",
      "name": "Rachel Weisz",
      "character": "Short Sighted Woman"
    },
    {
      "id": "nm0924210",
      "name": "Ben Whishaw",
      "character": "Limping Man"
    }
  ],
  "overview": "In a dystopian near future, single people, according to the laws of The City, are taken to The Hotel, where they are obliged to find a romantic partner in forty-five days or are transformed into beasts and sent off into The Woods.",
  "storyline": "A love story set in a dystopian near future where single people are arrested and transferred to a creepy hotel. There they are obliged to find a matching mate in 45 days. If they fail, they are transformed into an animal and released into the woods.",
  "plot": "David discovers that his wife has left him for another man, and is escorted to a hotel. The hotel manager reveals that single people have 45 days to find a partner, or they will be transformed into an animal; the dog accompanying him is his brother. David chooses to become a lobster, due to their life cycle and his love of the sea. David makes acquaintances with Robert, a man with a lisp, and John, a man with a limp, who become his quasi-friends. John explains that he was injured in an attempt to reconnect with his mother, who had been transformed into a wolf.\n\nThe hotel has many rules and rituals: masturbation is banned, but sexual stimulation by the hotel maid is mandatory, and guests attend dances and watch propaganda extolling advantages of partnership.\n\nRobert is caught masturbating, and the hotel manager burns his fingers in a toaster. Relationships require partners to have a distinguishing trait in common. John is told a woman has arrived with a limp, but he says she limps from an injury that will heal and is not a suitable match.\n\nResidents can extend their deadline by hunting and tranquilizing single people in the forest; each captured \"loner\" earns them a day. On one such hunt, a woman with a fondness for biscuits offers David sexual favors, which he declines. She tells him that if she fails to find a mate, she will kill herself by jumping from a hotel window.\n\nJohn then wins the affections of a woman with constant nosebleeds by purposely smashing his nose in secret. They move to the couples section to begin a month-long trial partnership. David later decides to court a notoriously cruel woman who has tranquilized more loners than anyone else. Their initial conversation is interrupted by the screams of the biscuit-loving woman, who has severely injured herself jumping from a window. Although troubled by the incident, David pretends to enjoy the woman's suffering to gain the heartless woman's interest. He later joins her in a jacuzzi, and she feigns choking; when he does not attempt help, she decides they are a match. The two are shifted to the couples' suite. When David wakes up one morning, he finds she has kicked David's brother (in dog form) to death. When David cries in response, she concludes their relationship is a lie and drags him to the hotel manager to have him punished by turning him into an animal that no one likes. However, he escapes and, with the help of a sympathetic maid, tranquilizes and transforms his partner into an unspecified animal.\n\nEscaping the hotel, David joins the loners in the woods. In contrast to the hotel's rules, they forbid any romance, with mouth mutilation as punishment. The hotel maid is found to be a mole for the loners, planted in the hotel to sabotage it. Soon after her encounter with the leader of the loners, the loners visit the city to get some supplies, where David has a close encounter with a police officer.\n\nMeanwhile, the loners launch a mini-raid to sabotage the hotel's work. David reveals to the nosebleed woman that John has been faking, and he forces David to leave. Other loners hold the hotel manager and her husband at gunpoint, tricking him into shooting his wife to save himself, but the gun is not loaded, leaving the couple to face each other.\n\nSoon David, who is shortsighted, begins a secret relationship with a shortsighted woman. They develop a gestural code for communication. They are taken on another mission to the city, where their affections betray them to their leader. They plan to escape together, but the leader finds the shortsighted woman's journal and discovers her plan to escape with David. She takes the woman to the city, ostensibly to have an operation to cure her shortsightedness, but blinds her instead. In anger, the woman kills the hotel maid, thinking she is killing the leader.\n\nShe tells David about her blindness. He tries to find something else they have in common, but to no avail. He says they'll figure it out, and tells her to continue with their plan. Early the next morning, David overpowers and ties up the leader, leaving her to be eaten by dogs. He and the blind woman escape to the city, stopping at a restaurant. Seeking to reestablish commonality, David goes to the restroom and prepares to blind himself with a steak knife. The blind woman waits at the table for him to return.",
  "synopsis": "Set in the near future in what is presumably Ireland, the film opens with a woman driving down a road until she reaches a field with two small donkeys. She gets out of her car and shoots one of the donkeys until it is dead.We meet David (Colin Farrell) as he checks into the Hotel with his brother, who has been turned into a dog. In the City, people are given 45 days to find a romantic partner or else they are to be turned into an animal of their choice. David meets with the Hotel Manager (Olivia Colman) and says he would like to be turned into a lobster since they live to be 100 years.During breakfast, David observes three women - the Heartless Woman (Angeliki Papoulia), who is said to have no emotions; the Biscuit Woman (Ashley Jensen), who is always seen with a small pack of biscuits; and the Nosebleed Woman (Jessica Barden). David becomes acquainted with two men - Robert (John C. Reilly), who speaks with a lisp; and John (Ben Whishaw), who walks with a limp. Later, during an assembly, John is called up to speak. He says that his father left his mother for another woman, and so she was turned into a wolf and brought to live in a zoo. He would visit her enclosure until he climbed in to give her a hug. The other wolves attacked him, leaving him with his limp, but two wolves stayed still, and he figured one of them was his mother.Throughout their stay, the singles attend dances to meet one another. They are also given extra time by going on hunts and finding \"Loners\" in the woods to tranquilize. The Heartless Woman is said to be the best hunter due to her cold and unfeeling nature. On the bus ride to the hunt, David sits next to the Biscuit Woman, who propositions him and then says she may jump out the window of her room.Masturbation is restricted at the hotel, and so the men can only receive moderate sexual stimulation (without orgasm) from the Maid (Ariane Labed). The Hotel Manager finds out that Robert was masturbating repeatedly, and she forces him to have his fingers burnt in a toaster as punishment. Meanwhile, John pursues the Nosebleed Woman by faking a nosebleed problem by banging his face against something. They eventually fall in love and are moved to a bigger room for the two of them.The Biscuit Woman jumps out her window and is left on the ground, bleeding and screaming in agony. David approaches the Heartless Woman and makes brash comments regarding the Biscuit Woman's demise. They then go into a jacuzzi together. The Heartless Woman pretends to choke on an olive from her martini and when David doesn't try to help her, she decides they are a good match. The two are then moved into the bigger bedroom, though David must continue pretending to be as heartless as she is. They run into John and the Nosebleed Woman, along with a little girl named Elizabeth (Laoise Murphy) assigned to be their daughter. John tells Elizabeth to give David a kiss, but he responds by kicking her in the shin so she can limp like her dad.One morning, the Heartless Woman tells David she killed his brother by kicking him repeatedly. She has blood on her leg. David pretends to be unmoved, but when he sees the dead dog in the bathroom, he starts crying, and the Heartless Woman slaps him for lying. She goes to tell the Hotel Manager, but, with help from the Maid, David tranquilizes the Heartless Woman and drags her into the transformation room to be turned into an unknown animal.David flees from the Hotel and goes into the woods where he meets a group of Loners; a rebel group against the establishment. The Loner Leader (Lea Seydoux) welcomes David, but tells him that any romantic interaction is forbidden and is punishable. David sees one man with bandages on his mouth. He is told that the man was given \"the red kiss\", in which he had his lips cut off, along with another woman who suffered the same fate, and they were forced to kiss each other. The worse punishment is said to be \"the red intercourse\", which one can only imagine as to how it goes.During his stay there, David falls for the Short-Sighted Woman (Rachel Weisz) (who narrates her encounters with David). He wins her over by catching and killing rabbits, and then cooking them in a way specific to her liking. David also encounters Robert, who wants to shoot him and bring him back to the Hotel, but the Short-Sighted Woman knocks him out.The Loners take weekly trips into the city pretending to be couples. David is paired with the Short-Sighted Woman, and they are able to go by as a real couple without trouble. It is also revealed that the Maid is working with the Loner Leader and gathering information from the Hotel.One night, the Loners break into the Hotel while David boards a yacht that John and his new family are in. David tries to break them up, but neither of them want to hear what he has to say, and he leaves the yacht. In the Hotel, the Loner Leader goes into the room of the Hotel Manager and her husband. She holds the Manager at gunpoint and asks her husband if he loves her. He says yes, but when given a gun to shoot her, the husband pulls the trigger, but the gun is empty. The Loners leave the two alone.The Loner Leader notices how close David and the Short-Sighted Woman have become. She then discovers the woman's journal and reads about her plan to escape with David into the City. The Loner Leader and the Maid take the Short-Sighted Woman into the City to have an operation that they claim will cure her vision, but in reality, they have her blinded. The woman is left to defend herself with a knife, which the other two women try to take away from her, but the woman stabs the Maid and leaves her to die.The Short-Sighted Woman eventually tells David about what the Loner Leader did to her. He is unsettled, but decides that he wants to stay with her, and helps her out with her other senses of touch and smell.Later, David attacks the Loner Leader and ties her up. He throws her in an open grave and leaves her to the mercy of some wild dogs.David and the Short-Sighted Woman flee into the City. They go into a restaurant and sit together for a while. David goes into the bathroom and takes a knife with which he attempts to blind himself. We never find out if he goes through with it."
}