{
  "imdb_id": "tt3498918",
  "tmdb_id": "355753",
  "douban_id": null,
  "title": "The Summer House (2014)",
  "genres": [
    "Drama"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm1322402",
      "name": "Curtis Burz"
    }
  ],
  "writer": [
    {
      "id": "nm1322402",
      "name": "Curtis Burz",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2190550",
      "name": "Sten Jacobs",
      "character": "Markus Larsen"
    },
    {
      "id": "nm3951450",
      "name": "Anna Altmann",
      "character": "Christine Larsen"
    },
    {
      "id": "nm4403407",
      "name": "Jaspar Fuld",
      "character": "Johannes Degenhardt"
    },
    {
      "id": "nm4402560",
      "name": "Nina Splettstößer",
      "character": "Elisabeth Larsen"
    },
    {
      "id": "nm1845024",
      "name": "Stephan Bürgi",
      "character": "Christopher Degenhardt"
    },
    {
      "id": "nm6251229",
      "name": "Natascha Zimmermann",
      "character": "Anne Lass"
    },
    {
      "id": "nm6251230",
      "name": "Felix Witzlau",
      "character": "Matthias"
    },
    {
      "id": "nm6251231",
      "name": "Tobias Frieben",
      "character": "Oliver"
    },
    {
      "id": "nm6251232",
      "name": "León Delor",
      "character": "Philipp"
    }
  ],
  "overview": "A haunting portrait of a well-established German family living on the outskirts of Berlin in their ideal world, but are slowly shaken by external influences. It's a subtle portrait of human desire, inner desolation, self-deception and moral decadence.",
  "storyline": "The Larsens are a picture perfect family from the German upper-middle class. They have everything that means comfort and should mean happiness. Business success, a stylish, light-flooded home and a full scholarship for their daughter to study in England. However, the head of the family, Markus, an architect, lives a secret, bisexual double life as his wife Christine and their eleven-year-old daughter Elisabeth drown in unendurable loneliness. Markus realizes that he has a strong yearning for one of his daughter's school friends, Johannes, 12, also the son of his tax penalty-bedeviled business partner, Christopher. He succeeds in getting closer to Johannes and binds the boy to himself with ever-increasing intensity. His wife is desperately aware of the emotional distance of her husband, but only her daughter Elizabeth, reacting to the sexually laden atmosphere, sees through the lies and secrets that she instinctively knows to be an growing, disruptive threat to the entire family. As ...",
  "plot": null,
  "synopsis": null
}