{
  "imdb_id": "tt3449252",
  "tmdb_id": "248808",
  "douban_id": null,
  "title": "Crisis Hotline: Veterans Press 1 (2013)",
  "genres": [
    "Documentary",
    "Short"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "40 min",
      "description": "theatrical"
    }
  ],
  "imdb_rating": 7.4,
  "director": [
    {
      "id": "nm0329651",
      "name": "Ellen Goosenberg Kent"
    }
  ],
  "writer": null,
  "cast": null,
  "overview": "According to the U.S. Department of Veterans Affairs, one veteran dies by suicide in America every 80 minutes. While only 1% of Americans has served in the military, former service members account for 20% of all suicides in the U.S. Based in Canandaigua, NY and open 24 hours a day, 365 days a year, the Veterans Crisis Line receives more than 22,000 calls each month from veterans of all conflicts who are struggling or contemplating suicide. This timely documentary spotlights the traumas endured by America’s veterans, as seen through the work of the hotline’s trained responders. CRISIS HOTLINE captures extremely private moments, where the professionals, many of whom are themselves veterans or veterans’ spouses, can often interrupt the thoughts and plans of suicidal callers to steer them out of crisis.",
  "storyline": "They served their country overseas. Now, many military veterans must turn to the unique services of the Veterans' Crisis Line to help with their own personal and professional traumas at home. This documentary profiles several of the VCL counselors who work the phones of this 24-hour service, providing support, guidance, and hope to active and retired servicemen dealing with emotional, physical and financial troubles.",
  "plot": "The film focuses on the employees who staff the United States Department of Veterans Affairs suicide hotline in Canandaigua, New York. The 44-minute documentary shows the emotional strain the job has on employees (many of whom are veterans, former service members, or military family members), and the deep compassion and devotion they have for veterans in a time of crisis.",
  "synopsis": null
}