{
  "imdb_id": "tt3404158",
  "tmdb_id": "242454",
  "douban_id": null,
  "title": "The Suspect (2013)",
  "genres": [
    "Action",
    "Thriller"
  ],
  "country": "South Korea",
  "version": [
    {
      "runtime": "137 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.9,
  "director": [
    {
      "id": "nm2008414",
      "name": "Shin-yeon Won"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm1322499",
      "name": "Jong-ryol Choi",
      "character": ""
    },
    {
      "id": "nm1508003",
      "name": "Yoo Gong",
      "character": "Ji Dong-cheol"
    },
    {
      "id": "nm3294000",
      "name": "Jae-yoon Jo",
      "character": "Cho       (as Jae-yun Jo)"
    },
    {
      "id": "nm1443295",
      "name": "Sung-ha Jo",
      "character": "NIS director Kim Seok-ho       (as Seong-ha Jo)"
    },
    {
      "id": "nm0453440",
      "name": "Eui-sung Kim",
      "character": ""
    },
    {
      "id": "nm5470717",
      "name": "Seong-gyoon Kim",
      "character": "Lee Gwang-jo"
    },
    {
      "id": "nm1775551",
      "name": "Hee-soon Park",
      "character": "Min Se-hoon"
    },
    {
      "id": "nm4623770",
      "name": "Won Poong-Yeon",
      "character": "Kim Seok-Ho's underling"
    },
    {
      "id": "nm2359794",
      "name": "Da-in Yoo",
      "character": "Choi Kyeong-hee"
    }
  ],
  "overview": "Dong-chul was the best special field agent in North Korea, but he’s abandoned by his government during a mission. While on the run, he looks for his wife and child, who were sold as slaves to China, only to discover their corpses. He soon finds out that his colleague was behind the killing and defects to the South in search of his nemesis. He looks for him during the day, and works as a temp driver at night and as a personal driver for Chairman PARK. One night the chairman is attacked and killed by an assassin, but not before handing over a pair of glasses to Dong-chul. He is now on the run again, accused of the chairman’s murder by the intelligence service, while trying to uncover the secret contained inside the glasses. Little did he know that depending on who ultimately gains control of the secret, it could either become a national threat or treasure.",
  "storyline": "Dong-chul (Gong Yoo) is the best field agent in North Korea - until he is abandoned during a mission, his wife and daughter murdered. Hunted and on the run, torn between grief and vengeance, he takes a job as a night driver for the CEO of a powerful corporation. The chairman is brutally assassinated - but gives Dong-chul a pair of glasses before he dies. Now, he's on the run again. Accused of murder, wanted for treason, and desperate to uncover the volatile national secrets hidden inside the glasses. Dong-Chul wants the truth. And he'll start a war to get it.",
  "plot": "Ji Dong-chul (Gong Yoo) was once one of the top special forces agent in North Korea, but after a change in political power, he was abandoned by his government while on a mission. He goes on the run, seeking his wife and daughter who were sold as slaves to China, only to discover their corpses. When he learns that an ex-colleague was behind their deaths, Dong-chul goes on a vendetta for revenge, defecting to the South to chase his family's killer. Now living incognito, he searches for his nemesis during the day, and at night works as a personal chauffeur for Chairman Park, a business executive with ties to Pyongyang. One night the chairman is attacked and killed by an assassin, but not before handing over a special pair of glasses to Dong-chul. The South Korean intelligence service, a member of which frames Dong-chul for the murder, goes on the hunt for the beleaguered former spy. The manhunt is led by Min Se-hoon (Park Hee-soon), a colonel and drill sergeant with whom Dong-chul shares a past, and Kim Seok-ho (Jo Sung-ha), the director of the NIS. Aided by a feisty documentary filmmaker (Yoo Da-in), Dong-chul goes on the run again while trying to recover top-secret materials that his dying boss sent him to find.",
  "synopsis": null
}