{
  "imdb_id": "tt3422314",
  "tmdb_id": "305641",
  "douban_id": null,
  "title": "The First Line (2014)",
  "genres": [
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "91 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.4,
  "director": [
    {
      "id": "nm6173242",
      "name": "Coerte Voorhees"
    },
    {
      "id": "nm6173243",
      "name": "John Voorhees"
    }
  ],
  "writer": [
    {
      "id": "nm6173242",
      "name": "Coerte Voorhees",
      "description": "written by"
    },
    {
      "id": "nm6173243",
      "name": "John Voorhees",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm4362572",
      "name": "Pantelis Kodogiannis",
      "character": "Andreas"
    },
    {
      "id": "nm0903900",
      "name": "Kassandra Voyagis",
      "character": "Eleni"
    },
    {
      "id": "nm0316284",
      "name": "Giancarlo Giannini",
      "character": "Petros"
    },
    {
      "id": "nm0293550",
      "name": "Paul Freeman",
      "character": "Callum       (rumored)"
    },
    {
      "id": "nm0004248",
      "name": "Georges Corraface",
      "character": "Michel"
    },
    {
      "id": "nm0126250",
      "name": "Michael Byrne",
      "character": "Richard"
    },
    {
      "id": "nm0903901",
      "name": "Yorgo Voyagis",
      "character": "George Kadmos"
    },
    {
      "id": "nm0283754",
      "name": "Spyros Fokas",
      "character": "Fotis"
    },
    {
      "id": "nm2669159",
      "name": "Karim Kassem",
      "character": "Amit"
    },
    {
      "id": "nm1164041",
      "name": "Pigmalion Dadakaridis",
      "character": "Alexis"
    },
    {
      "id": "nm5633565",
      "name": "Vicky Dalli",
      "character": "Newscaster"
    },
    {
      "id": "nm6928333",
      "name": "Kostas Daniilidis",
      "character": "Minister of Energy"
    },
    {
      "id": "nm1058270",
      "name": "Kelly Eleftheriou",
      "character": "Sophia"
    },
    {
      "id": "nm0406373",
      "name": "Michalis Iatropoulos",
      "character": "Mihalis"
    },
    {
      "id": "nm2780135",
      "name": "Dimitris Kapetanakos",
      "character": "Dimitris"
    },
    {
      "id": "nm1232947",
      "name": "Thodoros Katsafados",
      "character": "Theo"
    },
    {
      "id": "nm10145246",
      "name": "Irini Katsarou",
      "character": "Persephone"
    },
    {
      "id": "nm0608130",
      "name": "Giannis Mortzos",
      "character": "Yiannis       (as Yiannis Mortsos)"
    },
    {
      "id": "nm6928334",
      "name": "Evelyn Zanni",
      "character": "Law Firm Secretary"
    }
  ],
  "overview": "Two Athenian attorneys pursue litigation for the return of the Parthenon Marbles. As the bronze statue of Athena Promakhos used to stand guard in front of the Parthenon, both must find the courage to stand in defense of what they love.",
  "storyline": "Two Athenian attorneys pursue litigation against the British Museum for the return of the Parthenon Marbles. Andreas (Pantelis Kodogiannis) returns from New York to his homeland of Greece by invitation of the Director of the Acropolis Museum (Giancarlo Giannini). Andreas partners with his childhood friend and love interest Eleni (Kassandra Voyagis) and takes the case to London. Their efforts are fraught with difficulties including the social destabilization of the economic crisis that plagues Athens. In their pursuit of the return of the stolen artifacts, the spirit of Athina is reinvigorated. As the bronze statue of Athena Promakhos (Athina of the Frontline) used to stand guard in front of the Parthenon, both must find the courage to stand in defense of what they love.",
  "plot": "A group of high school students are in a car together in the night as a storm is brewing. When the storm gets worse, they look up ahead and see a tornado approaching. A girl begs for them to go, but the boy recording on a camera gets out to video tape the tornado. He gets back in the car, but the tornado picks them up before they can escape, killing them all.\n\nIn the town of Silverton, Oklahoma, the local high school senior class is preparing for graduation. The high school's vice-principal, Gary Fuller (Richard Armitage), has asked his two sons, Trey and Donnie, to record messages from the seniors for a time capsule to be opened in 25 years. Elsewhere, Pete (Matt Walsh), a veteran storm chaser, has been attempting to intercept and film tornadoes using a heavily armored Tornado Intercept Vehicle nicknamed Titus, but has come up short all year long. Upon learning of a major line of developing storms, the chasers confer and decide to head for Silverton in hopes of filming tornadoes. After arriving in Silverton, the team discovers that the cell they had been chasing has dissipated, upsetting Pete. As the team reconvenes to determine its next move, the Silverton cell abruptly strengthens, resulting in a hailstorm and tornado. As the team films, the funnel abruptly shifts course and heads for the high school.\n\nAt the high school, the senior students are participating in commencement ceremonies when the weather suddenly sours. Moments later, the tornado sirens sound, and the students are subsequently marshaled into the school building by the head principal and his staff. In the aftermath of the tornado, shaken students emerge from the damaged building to view the destruction, while Gary sets out to rescue his eldest son Donnie, who had gone to an abandoned paper mill to help his friend Katlyn (Alycia Debnam-Carey) with a project; both were subsequently trapped when the tornado brought the building down on them.\n\nAs Pete's storm chase team stops in a small part of town, a tornado takes shape just as Gary and Trey arrive, destroying several buildings. Everyone except Gary and Pete's meteorologist, Allison Stone (Sarah Wayne Callies), make it to safety while the two are almost killed before the twister dissipates. Then, after Gary pleads for help, Pete's team agree to help Gary get to the paper mill. While en route to the mill, another round of erratic tornadoes forms and encircles Pete's team, in the process destroying a residential neighborhood and a car lot. An explosion turns one of the tornadoes into a firenado, which Jacob (Jeremy Sumpter) tries to film, only to be caught up into the storm and is killed. This causes friction between Pete and his team, as Pete's concern seems to be more on collecting data than ensuring his team's safety. After recovering their vehicles, Allison leaves with Gary to continue their trip to the paper mill.\n\nAt the mill, the two trapped students attempt to use their phones to call for help, but the storm's devastation has rendered the phones almost useless. To make matters worse, a water pipe abruptly breaks and begins to flood the hole in which the two are trapped. Injured and at risk of drowning, the two record messages for their loved ones, then prepare for the worst. At the last minute, Gary and Allison arrive and successfully free the two students.\n\nIn the skies above Silverton, a convergence of two large tornadoes results in a colossal EF5 tornado that threatens to level the town. The town's citizens have taken shelter at the school, and Pete's team, however, determines that the school's storm shelter will be inadequate in the face of the monstrous tornado. Unable to alert the school's staff with mobile devices, Pete's team rushes to the school to notify the citizens that they must evacuate. While citizens rush to board school buses to flee the advancing storm, Pete and his team move to track and follow the storm, but the last school bus and a handful of cars are cut off from the retreat due to a downed transmission tower.\n\nIn an attempt to improvise a shelter, the storm chasers and school refugees take cover in a storm drain, but debris from the tornado damages one of the storm grates, compromising the shelter. In an attempt to save lives, Pete hands over his research hard drives to Gary, then sacrifices himself by leaving the shelter to move Titus down to the storm grate, where a combination of the vehicle's weight, ground anchors, and winch cable are used to anchor the storm grate to the concrete face. Titus's equipment proves unable to anchor the vehicle to the ground, and the tornado picks up the vehicle. From the camera turret aboard Titus, Pete observes the funnel of the tornado as the vehicle is lifted above the clouds, and then it crashes back down to the ground, killing him. Shortly thereafter, the EF5 tornado dissipates.\n\nIn the aftermath of the tornado outbreak, the townspeople begin efforts to clean up and rebuild. As Gary's sons move to complete their time capsule film, many of those they interview after the tornadoes express a newfound appreciation for their lives, and a hopeful outlook on life. The last footage shows two local daredevils Donk and Reevis hanging from a tree after they survived the storm.",
  "synopsis": null
}