{
  "imdb_id": "tt3469592",
  "tmdb_id": "294993",
  "douban_id": null,
  "title": "Rise of the Legend (2014)",
  "genres": [
    "Action",
    "Biography",
    "Drama"
  ],
  "country": "Hong Kong",
  "version": [
    {
      "runtime": "131 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm3469952",
      "name": "Roy Hin Yeung Chow"
    }
  ],
  "writer": [
    {
      "id": "nm1644613",
      "name": "Chi-long To",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0005033",
      "name": "Sammo Kam-Bo Hung",
      "character": "Master Lui       (as Sammo Hung)"
    },
    {
      "id": "nm2108643",
      "name": "Eddie Peng",
      "character": "Fei       (as Eddie Peng Yuyan)"
    },
    {
      "id": "nm3437899",
      "name": "Luodan Wang",
      "character": "Chun       (as Wang Luodan)"
    },
    {
      "id": "nm3628606",
      "name": "Boran Jing",
      "character": "Fiery       (as Jing Boran)"
    },
    {
      "id": "nm1179707",
      "name": "Jin Zhang",
      "character": "Wu Long       (as Zhang Jin)"
    },
    {
      "id": "nm2203315",
      "name": "Cho-Lam Wong",
      "character": "Big Tooth       (as Wong Cho Lam)"
    },
    {
      "id": "nm2236400",
      "name": "Junjie Qin",
      "character": "Foon       (as Quin Junjie)"
    },
    {
      "id": "nm3714834",
      "name": "Jia-yi Feng",
      "character": "North Evil       (as Jack Feng)"
    },
    {
      "id": "nm0542677",
      "name": "Byron Mann",
      "character": "Black Crow"
    },
    {
      "id": "nm7243086",
      "name": "Tai-Yu Gao",
      "character": "Wing       (as Gao Taiyu)"
    },
    {
      "id": "nm0504899",
      "name": "Tony Ka Fai Leung",
      "character": "Fei's Father"
    },
    {
      "id": "nm2854802",
      "name": "Angelababy",
      "character": "Orchid"
    },
    {
      "id": "nm6049192",
      "name": "Brian Siswojo",
      "character": "Old Snake"
    },
    {
      "id": "nm2252717",
      "name": "Phat Chan",
      "character": "Fat"
    }
  ],
  "overview": "In 1868 during the late Qing Dynasty, rampant corruption on the Imperial Court inflicts much suffering in people's lives. For years, the Black Tiger’s fearsome boss Lei Gong has been trying to get rid of the leader of the Northern Sea. One of his latest recruits is Fei, a fearless fighter who takes the Northern Sea leader’s head after a fierce fight. Just as Lei Gong believes he has total control of the port, a new gang called the Orphans rises in power. Led by Fei’s childhood friend Huo, the Orphans are out to eliminate all the criminal power from the port…",
  "storyline": "An orphan, whose father has been killed by dark power, attempts to bring justice back to the town.",
  "plot": "Over the years, the tale of Wong Fei Hung’s heroism has transformed him into a revered folk hero and is widely portrayed in modern media. Arguably one of the most recognizable kung fu figures in cinematic history, he is the subject of over 100 films and television series since the 40s. The character is further made famous on the big screen by kung fu superstars Jet Li in the highly successful Once Upon a Time in China series (1991 – 1997) as well as Jackie Chan in Drunken Master I and II (1978, 1994).\n\nWong Fei Hung played by Eddie Peng is a young man at 21 years old who is destined to become a master of his time, and an everlasting legend in the world of martial arts. In 1868 during the late Qing Dynasty, in Guangzhou, two crime factions run the Huangpu Port: The Black Tiger and the Northern Sea. For years, the Black Tiger’s fearsome boss Lei Gong played by Sammo Hung has been trying to get rid of the leader of the Northern Sea. One of his latest recruits is Wong Fei Hung, a fearless fighter who takes the Northern Sea leader’s head after a fierce fight. Recognizing Fei’s talent, Lei Gong makes the young warrior his godson and one of his Four Tigers, the most trusted men in the gang. There is more to young Fei than meets the eye and the truth about his past and the ultimate showdown soon unravels.",
  "synopsis": null
}