{
  "imdb_id": "tt3450900",
  "tmdb_id": "291351",
  "douban_id": null,
  "title": "The Sea of Trees (2015)",
  "genres": [
    "Drama",
    "Fantasy",
    "Mystery"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "110 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm0001814",
      "name": "Gus Van Sant"
    }
  ],
  "writer": [
    {
      "id": "nm2133655",
      "name": "Chris Sparling",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0000190",
      "name": "Matthew McConaughey",
      "character": "Arthur Brennan"
    },
    {
      "id": "nm7322503",
      "name": "Ryoko Seta",
      "character": "Airport Desk Agent"
    },
    {
      "id": "nm5941445",
      "name": "Sienna Tow",
      "character": "Girl in Airport"
    },
    {
      "id": "nm8385196",
      "name": "Naoko Marshall",
      "character": "Flight Attendant"
    },
    {
      "id": "nm4028426",
      "name": "Michiko Tomura",
      "character": "Woman on Train"
    },
    {
      "id": "nm2183900",
      "name": "Yusuke Tozawa",
      "character": "Man on Train"
    },
    {
      "id": "nm3276576",
      "name": "Abe Lee Tsunenori",
      "character": "Taxi Driver       (as Tshunenori Lee Abe)"
    },
    {
      "id": "nm0913822",
      "name": "Ken Watanabe",
      "character": "Takumi Nakamura"
    },
    {
      "id": "nm4472978",
      "name": "Joe Girard",
      "character": "Man at Convenience Store       (as Joseph Girard)"
    },
    {
      "id": "nm8385197",
      "name": "Jazmin Domenech",
      "character": "Young Woman"
    },
    {
      "id": "nm8385198",
      "name": "Luke DeWolfe",
      "character": "Young Man"
    },
    {
      "id": "nm0915208",
      "name": "Naomi Watts",
      "character": "Joan Brennan"
    },
    {
      "id": "nm1051221",
      "name": "Katie Aselton",
      "character": "Gabriella Laforte"
    },
    {
      "id": "nm0221631",
      "name": "Nada Despotovich",
      "character": "Maryanne Wescott"
    },
    {
      "id": "nm2657824",
      "name": "Christopher Tarjan",
      "character": "Gil Cramer"
    },
    {
      "id": "nm0886811",
      "name": "Charles Van Eman",
      "character": "Paul Wescott"
    },
    {
      "id": "nm0635769",
      "name": "Bruce Norris",
      "character": "Dr. Howerton"
    },
    {
      "id": "nm5869894",
      "name": "Joseph Baken",
      "character": "Simon"
    },
    {
      "id": "nm2849998",
      "name": "Jordan Gavaris",
      "character": "Eric"
    },
    {
      "id": "nm1772169",
      "name": "Anna Friedman",
      "character": "Anna"
    },
    {
      "id": "nm3893051",
      "name": "Amanda Collins",
      "character": "Woman at Grocery Store"
    },
    {
      "id": "nm4440308",
      "name": "Jimi Stanton",
      "character": "Mailman"
    },
    {
      "id": "nm1794287",
      "name": "Ikuma Ando",
      "character": "Park Ranger 1"
    },
    {
      "id": "nm4184697",
      "name": "Juzo Yoshida",
      "character": "Park Ranger 2"
    },
    {
      "id": "nm4024978",
      "name": "Owen Burke",
      "character": "Ambulance Tech"
    },
    {
      "id": "nm3185582",
      "name": "Simba Dibinga",
      "character": "Ambulance Tech"
    },
    {
      "id": "nm8385199",
      "name": "Tatsuki Motoyoshi",
      "character": "Park Ranger 3"
    },
    {
      "id": "nm0505934",
      "name": "Richard Levine",
      "character": "Funeral Director"
    },
    {
      "id": "nm0756839",
      "name": "James Saito",
      "character": "Dr. Takahashi"
    },
    {
      "id": "nm4044325",
      "name": "Kiô Ikeda",
      "character": "Male Game Show Host       (as Kioo Ikeda)"
    },
    {
      "id": "nm5021483",
      "name": "Aya Kinoshita",
      "character": "Female Game Show Host"
    },
    {
      "id": "nm2787377",
      "name": "Ai Yoshihara",
      "character": "Mental Health Specialist"
    },
    {
      "id": "nm4114764",
      "name": "Hyunri",
      "character": "Flight Attendant"
    }
  ],
  "overview": "A suicidal American befriends a Japanese man lost in a forest near Mt. Fuji and the two search for a way out.",
  "storyline": "Arthur Brennan treks into Aokigahara, known as The Sea of Trees, a mysterious dense forest at the base of Japan's Mount Fuji where people go to commit suicide. On his journey to the suicide forest, he encounters Takumi Nakamura, a Japanese man who has lost his way after attempting suicide. The two men begin a journey of reflection and survival, which affirms Arthur's will to live and reconnects him to his love for his wife.",
  "plot": "An American man, Arthur Brennan, (Matthew McConaughey) travels to the \"Suicide Forest\" (Aokigahara forest) to kill himself at the base of Mount Fuji in Japan, the site of numerous suicides. There he encounters a Japanese man, Takumi Nakamura, (Ken Watanabe) who wants to kill himself as well, and both men begin a journey of self-reflection and survival.\n\nIt is revealed through flashbacks that Arthur wants to end his life by drug overdose after his wife, Joan, (Naomi Watts) dies. As he is about to take a third pill he hears Takumi struggling. Takumi had slit his wrists for being dishonored at work but misses his wife and child and decides he doesn't want to die. He tried to escape the dense sea of trees but cannot find the trail back. Arthur decides to help him but also ends up disoriented in the forest. They survive falls, flash floods and hypothermia as they try to escape the forest and along the way find others who succeeded in ending their lives. They share their stories together and it's revealed that Arthur is there because of his guilt of how he and his wife treated each other in their marriage. After she becomes sick they rekindle their love and reminisce about a favorite place of hers where she would spend hours amongst the orchids. He says he will take her back there when she's ready to. The doctor tells them she will survive and she is transported by ambulance to a recovery hospital. He follows behind her in his car, talking to her on the phone and jokes with her about not knowing what her favorite color or season is. Before she responds a truck plows into the ambulance killing her. At her funeral he tells the director he didn't really know her even after all the years they were married. He says he overheard her sisters talking and one of them sent her a copy of her favorite book. This is the package Arthur brings with him into the forest.\n\nAfter a night of talking Arthur separates from Takumi in the morning to try to get help. He found a walkie-talkie from a deceased camper and Takumi is too unwell. He promises him that he'll come back. The park rangers catch Arthur's calls and he dramatically makes his way to help but is too weak to let them know that there is another person in the forest. Almost two weeks later Arthur is being evaluated by a psychiatrist before his release and he says he will go back to the forest to find Takumi even though the rangers could not. They found the tent he spoke of but did not find anyone there. The psychiatrist also reveals that there is no one by the name of Takumi Nakamura who has a wife and daughter by those names. There is a camera at the entrance of the forest and Arthur was seen going in and coming out but no one else was seen going in.\n\nArthur returns to the forest and makes his own trail with string and later crumpled paper to mark his way back. He finds the package he left in the forest and also the tent and the coat he covered over Takumi but there is no Takumi. He takes away the coat and under it is a beautiful orchid. He remembers what Takumi said about the forest. He believed it is a form of purgatory and that the spirit of your loved ones go there and are closest during your darkest moments. He opens the package holding her favorite book and it is a copy of Hansel and Gretel. Arthur realizes it was Joan's spirit that helped him find his way out and is helping him heal his guilt to go on without her. Arthur returns to America and brings the orchid with him. While helping a student it's revealed that the names of Takumi's wife and daughter are not names but words that mean yellow and winter. He remembers the last conversation he had with his wife about her favorite color and season. The last scene is Arthur planting the orchid in the garden of Joan's favorite place.",
  "synopsis": "Arthur Brennan (McConaughey) treks into Aokigahara, known as The Sea of Trees, a mysterious dense forest at the base of Japans Mount Fuji where people go to contemplate life and death. Having found the perfect place to die, Arthur encounters Takumi Nakamura (Watanabe), a Japanese man who has also lost his way. The two men begin a journey of reflection and survival, which affirms Arthurs will to live and reconnects him to his love with his wife (Watts)."
}