{
  "imdb_id": "tt3483612",
  "tmdb_id": "339367",
  "douban_id": null,
  "title": "Hamari Adhuri Kahani (2015)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "129 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm1887138",
      "name": "Mohit Suri"
    }
  ],
  "writer": [
    {
      "id": "nm0080315",
      "name": "Mahesh Bhatt",
      "description": null
    },
    {
      "id": "nm2756464",
      "name": "Shagufta Rafique",
      "description": "dialogue"
    }
  ],
  "cast": [
    {
      "id": "nm1431656",
      "name": "Emraan Hashmi",
      "character": "Aarav Ruparel"
    },
    {
      "id": "nm3822770",
      "name": "Rajkummar Rao",
      "character": "Hari Prasad       (as Raj Kumar Yadav)"
    },
    {
      "id": "nm1799038",
      "name": "Vidya Balan",
      "character": "Vasudha"
    },
    {
      "id": "nm1591897",
      "name": "Anil George",
      "character": ""
    },
    {
      "id": "nm3257717",
      "name": "Madhurima Tuli",
      "character": "Avni"
    },
    {
      "id": "nm2368423",
      "name": "Narendra Jha",
      "character": "ACP Patil"
    },
    {
      "id": "nm0023839",
      "name": "Amala Akkineni",
      "character": "Rohini"
    },
    {
      "id": "nm1882579",
      "name": "Zachary Coffin",
      "character": "Journalist"
    },
    {
      "id": "nm3050219",
      "name": "Sara Khan",
      "character": "Naila       (as Sarah Khan)"
    },
    {
      "id": "nm0611663",
      "name": "Suhasini Mulay",
      "character": "Hari's mother"
    },
    {
      "id": "nm1384402",
      "name": "Uday Chandra",
      "character": ""
    },
    {
      "id": "nm4726664",
      "name": "Prabal Panjabi",
      "character": "Apurva"
    },
    {
      "id": "nm1244971",
      "name": "Yatin Karyekar",
      "character": ""
    },
    {
      "id": "nm9556527",
      "name": "Paras Chhabra",
      "character": ""
    },
    {
      "id": "nm2981021",
      "name": "Namit Das",
      "character": "Saanjh Prasad grown up"
    },
    {
      "id": "nm7802963",
      "name": "Mukesh Agrohari",
      "character": ""
    },
    {
      "id": "nm4838493",
      "name": "Armen Grayg",
      "character": "Body guard"
    },
    {
      "id": "nm9813395",
      "name": "Bhuperdra Singh Negi",
      "character": ""
    },
    {
      "id": "nm5389195",
      "name": "Bhavesh Balchandani",
      "character": ""
    },
    {
      "id": "nm5200693",
      "name": "Vivek Ghamande",
      "character": ""
    },
    {
      "id": "nm10662183",
      "name": "Atul Kumar Shukla",
      "character": ""
    },
    {
      "id": "nm7282332",
      "name": "Yogesh Shirke",
      "character": ""
    },
    {
      "id": "nm4836741",
      "name": "Jagmohan",
      "character": ""
    },
    {
      "id": "nm10662184",
      "name": "Amit Sharma",
      "character": ""
    },
    {
      "id": "nm10662182",
      "name": "Krishna Srivastava",
      "character": ""
    },
    {
      "id": "nm10662180",
      "name": "Saurabh Tiwari",
      "character": ""
    },
    {
      "id": "nm10662179",
      "name": "Gaurav Kumar",
      "character": ""
    },
    {
      "id": "nm3877530",
      "name": "Khuahhish",
      "character": ""
    },
    {
      "id": "nm10662181",
      "name": "Mukesh Kumar Pal",
      "character": ""
    },
    {
      "id": "nm2904973",
      "name": "Gary Tantony",
      "character": ""
    },
    {
      "id": "nm9171674",
      "name": "Manish Raj Gupta",
      "character": ""
    }
  ],
  "overview": "Hamari Adhuri Kahaani",
  "storyline": "Hamari Adhuri Kahani (English: Our Incomplete Story) is a 2015 Indian romantic drama directed by Mohit Suri and produced by Mahesh Bhatt under the banner Vishesh Films and Fox Star Studios. The film stars Emraan Hashmi, Vidya Balan, and Rajkummar Rao. It is based on the love story of Bhatt's parents, Nanabhai Bhatt, Shirin Mohammad Ali and his stepmother.",
  "plot": "The movie opens with a woman Vasudha (Vidya Balan) getting off from the bus. At 15&#160;km before the Bastar district, she stumbles and falls down after walking a few steps. An elderly man, Hari, sees a psychiatrist about hallucinations of his wife. He is then recruited by his daughter-in-law, who takes him to his wife's funeral. There, he steals her ashes and leaves a diary for his son.\n\nThe story then jumps to the past, where Vasudha is a single mother whose husband is missing for five years. Bound to traditions, she has been waiting for him since he left her. Vasudha meets Aarav Ruparel (Emraan Hashmi) in one of his hotels, where she works as a floral arranger. He creates a mock fire drill in order to watch the capabilities of the security department. Vasudha comes to save him. He offers her a job in his hotel in Dubai, which she refuses. Despite her refusal Aarav asks her to reconsider the offer. Vasudha gets to know from the police that her husband Hari (Rajkumar Rao) has murdered five American journalists and he is a member of a terrorist group. The police asks her to inform about Hari if he ever visits her. Worried for her son's future, she accepts the offer given by Aarav.\n\nDespite knowing about Vasudha's past and her son, Aarav falls in love with her. Aarav tells Vasudha about his mother, who was a cabaret singer and a single parent and how she fell in love with a man who tried to commit suicide for failing to save them from poverty. Vasudha shuns his feelings saying that she belongs to someone else and leaves. Vasudha meets Aarav's mother on his request where she accepts Aarav's love and both unite. They both spend romantic moments together. Aarav gives a divorce paper to Vasudha before dropping her home. Vasudha then encounters Hari at home, and tells him about Aarav. Hari then storms out in anger where he is arrested by the police and later jailed for being a wanted criminal. Vasudha asks Aarav to save Hari as he is innocent. Aarav tries to save Hari by bribing the home minister who reveals that Hari himself accepted his crime. Vasudha refuses to marry Aarav because Hari's action tells her that he sacrifices his life for them to be together. It is then revealed to Aarav that Hari deliberately accepts his crime so that Vasudha will live in guilt as she will think Hari sacrificed himself for their love. In order to free Vasudha out of her guilt, Aarav travels to Bastar where Hari is accused of killing, to prove Hari's innocent. Aarav meets Father Dayal who explains what happened with the journalists and reveals Hari's innocence. On the way back to Mumbai, Aarav smells the scent of the same flowers which first caused him to meet Vasudha. Following the scent, he goes into the jungle, not knowing that the place has mines. He accidentally steps on one of the mines. Realising his predicament, Aarav smiles just before taking his foot off the mine. Vasudha receives the news of Aarav's death and is shattered. Vasudha leaves Hari, who searches for her for two years. After finding her, she reveals to him that she knows about his fake sacrifice and tells him that she is not afraid of any traditions and boundaries. He warns her that she will come back to him one day. Hari waits for Vasudha twenty-one years in vain.\n\nBack in the present, it is now clear that the woman who gets off the bus is Vasudha and she wanted to be reunited with Aarav where he died. In the end Hari takes Vasudha's ashes to scatter them at the forest of Bastar where Aarav died. Thus Aarav and Vasudha reunite after death.",
  "synopsis": null
}