{
  "imdb_id": "tt3442990",
  "tmdb_id": "309581",
  "douban_id": null,
  "title": "Lila & Eve (2015)",
  "genres": [
    "Crime",
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm0831690",
      "name": "Charles Stone III"
    }
  ],
  "writer": [
    {
      "id": "nm2416916",
      "name": "Pat Gilfillan",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0000182",
      "name": "Jennifer Lopez",
      "character": "Eve Rafael"
    },
    {
      "id": "nm0205626",
      "name": "Viola Davis",
      "character": "Lila"
    },
    {
      "id": "nm0924154",
      "name": "Shea Whigham",
      "character": "Holliston"
    },
    {
      "id": "nm1663252",
      "name": "Chris Chalk",
      "character": "Alonzo"
    },
    {
      "id": "nm0747420",
      "name": "Andre Royo",
      "character": "Skaketti"
    },
    {
      "id": "nm4311291",
      "name": "Will Brittain",
      "character": "Bradley"
    },
    {
      "id": "nm1543989",
      "name": "Aml Ameen",
      "character": "Stephon"
    },
    {
      "id": "nm0855132",
      "name": "Julius Tennon",
      "character": "Ben"
    },
    {
      "id": "nm4519283",
      "name": "Gino Vento",
      "character": "Aza Colon"
    },
    {
      "id": "nm0925232",
      "name": "Michole Briana White",
      "character": "Mae"
    },
    {
      "id": "nm0743931",
      "name": "Yolonda Ross",
      "character": "Patrice"
    },
    {
      "id": "nm2324837",
      "name": "Elisa Perry",
      "character": "Sergeant Talbot"
    },
    {
      "id": "nm3182681",
      "name": "Ian Casselberry",
      "character": "Alejandro"
    },
    {
      "id": "nm5132341",
      "name": "Marisela Zumbado",
      "character": "Joie"
    },
    {
      "id": "nm2539782",
      "name": "Diarra Kilpatrick",
      "character": "Maya"
    },
    {
      "id": "nm1407651",
      "name": "Scott Poythress",
      "character": "Doctor Scott"
    },
    {
      "id": "nm1411388",
      "name": "Rey Hernandez",
      "character": "Ojeda"
    },
    {
      "id": "nm3473606",
      "name": "Atkins Estimond",
      "character": "Jaime"
    },
    {
      "id": "nm3691071",
      "name": "Whitney Goin",
      "character": "Aggie"
    },
    {
      "id": "nm2083649",
      "name": "Merry Jo Cortada",
      "character": "Nita Colon"
    },
    {
      "id": "nm0212278",
      "name": "David de Vries",
      "character": "Chief Parker"
    },
    {
      "id": "nm4559910",
      "name": "Donald J. Koko",
      "character": "TV News Photographer"
    },
    {
      "id": "nm5369072",
      "name": "Darone Okolie",
      "character": "Decoy Club Killer"
    },
    {
      "id": "nm9654602",
      "name": "Robert Hampton",
      "character": "Drug Dealer"
    },
    {
      "id": "nm0597297",
      "name": "Gwendolyn Mulamba",
      "character": "Nurse #1"
    },
    {
      "id": "nm4730779",
      "name": "Maia Moss-Fife",
      "character": "Nurse #2"
    },
    {
      "id": "nm6672485",
      "name": "Tabitha Chappelle",
      "character": "Mothers Support Group"
    },
    {
      "id": "nm6568589",
      "name": "Germaine Brooks",
      "character": "Donelle Peete"
    },
    {
      "id": "nm6002110",
      "name": "Derrick Dee Drake",
      "character": "Police Officer"
    },
    {
      "id": "nm4837701",
      "name": "Ron Caldwell",
      "character": "Justin"
    },
    {
      "id": "nm7290079",
      "name": "Frank Adkinson",
      "character": "Clubgoer"
    },
    {
      "id": "nm6550187",
      "name": "Teddy Williams",
      "character": "Teo"
    },
    {
      "id": "nm4787395",
      "name": "Renne Araujo",
      "character": "Hustler"
    },
    {
      "id": "nm6612678",
      "name": "Keith Ham",
      "character": "Diner Patron"
    },
    {
      "id": "nm6098561",
      "name": "Eric Elijah Rogers",
      "character": "Funeral Mourner"
    },
    {
      "id": "nm4684282",
      "name": "Dawn Young-McDaniel",
      "character": "Trauma Nurse       (as Dawn Young)"
    },
    {
      "id": "nm7459728",
      "name": "Camilo Chimurenga",
      "character": "Club Patron"
    },
    {
      "id": "nm4368392",
      "name": "Emily E. Kelly",
      "character": "Tia"
    },
    {
      "id": "nm6048893",
      "name": "Monaneka Jones",
      "character": "Club Patron"
    },
    {
      "id": "nm3635006",
      "name": "Quinton Garvin",
      "character": "Leo"
    },
    {
      "id": "nm6117911",
      "name": "Anthony R. McClara",
      "character": "Funeral attendant"
    },
    {
      "id": "nm5778914",
      "name": "Louis Raphael Jones",
      "character": "Club Goer"
    },
    {
      "id": "nm4199044",
      "name": "Christopher McCarty",
      "character": "Clubgoer"
    },
    {
      "id": "nm7047576",
      "name": "Miche Collins",
      "character": "Group Member"
    },
    {
      "id": "nm6818324",
      "name": "Jo Anne Amundson",
      "character": "Church Worker"
    },
    {
      "id": "nm6665944",
      "name": "Michael Walker Jr.",
      "character": "Cruz (Alejandro bodyguard)"
    },
    {
      "id": "nm6776502",
      "name": "Fanchon Hopson",
      "character": "Church Worker"
    }
  ],
  "overview": "Lila, a grief-stricken mother reeling from her son’s murder, attends a support group where she meets Eve, who urges her to take matters into her own hands to track down her son’s killers.",
  "storyline": "Lila, a grief-stricken mother reeling from her son's murder, attends a support group where she meets Eve, who urges her to take matters into her own hands to track down her son's killers. They soon embark on a journey of revenge, but also recovery.",
  "plot": "Lila, a single mother living in Atlanta, struggles after the murder of her son Stephon in a drive-by shooting. Faced with indifference from the police force and barely able to take care of herself and her younger son Justin, Lila joins a support group for mothers of murdered children. There, she meets Eve, whose daughter died. Eve sits off to the side without participating. Eve seems less interested in moving on with her life than in seeking revenge.\n\nLila chooses Eve to be her sponsor, and one night, while engaging in therapeutic home redecorating, they find a gun in Justin's book bag. This discovery horrifies Lila but inspires Eve to suggest they investigate Stephon's murder themselves. The two women find someone with the information they seek. When he pulls a gun on them, Eve shoots him dead, and they flee.\n\nWhen it seems as if they have gotten away with the shooting, the two women move up the underworld chain of command to discover who ordered the drive-by. With the death of the drug dealer, Alonzo Troys, who actually pulled the trigger, they come to the attention of Ojeda, the hired gun of the kingpin of the criminal organization. As the bodies begin piling up, Lila becomes increasingly unsure of the morality of their actions, while Eve becomes bolder and more daring. Finally, a rift develops between the two women and Eve suddenly disappears.\n\nAround this time, their actions pique the interest of Detective Holliston, the cop assigned to Lila's case. It appears to be only a matter of time before he puts two and two together and figures out who is behind the killings. Lila and Justin are on the way to school one morning when, while sitting at a stop sign, a van containing armed men drives up beside them. Before the men can shoot, Lila pulls out into traffic and is involved in a car accident. This saves their lives when witnesses aid, stopping the gunmen from finishing them off.\n\nAfter Lila gets out of the hospital, she and Eve make up. They rig Lila's house with explosives and set up a trap to lure local criminal kingpin, Miguel Alejandro, and his henchmen come after her by shooting at his home. After he threatens to kill her, and she drops off Eve, Lila visits Ben, her neighbour. When he questions her about Eve, she shows him pictures from her phone, only to be confused when Eve appears in none of them. During the course of the night, Lila realizes that Eve is a figment of her imagination. Lila has done everything herself and is responsible for all the drug dealers' murders. In a late night conversation in the street, \"Eve\" talks her into finishing the job so she can move on and keep Justin safe.\n\nOjeda poses as a cable installer and breaks into Lila's house. Finding it empty, he invites Alejandro to wait for her arrival at the house. Lila watches them via a laptop's webcam at Ben's house. When Alejandro and another henchman arrive, Lila asks Ben to take care of Justin while she takes care of things at home. Lila walks across the street with Eve and lights a fuse at Eve's urging. When Eve tells her that she cannot stop it, Lila throws herself into the blast. Lila is blown onto the front yard, and the house burns as Ben arrives to take care of her.\n\nDetective Holliston fails to convince his partner, Detective Skaketti, that Lila is responsible. Undeterred, Holliston approaches Lila at a support meeting once she is released from the hospital. When Holliston threatens to take in Ben and Justin if she does not cooperate, the other mothers, who have collected donations to assist Lila, stop her from confessing and volunteer alibis. Holliston recognizes that grieving mothers are a strong alibi and leaves.\n\nBen says goodbye to Justin and Lila as they leave Atlanta for a new life elsewhere. As she is driving down the road, Justin asks his mother if she is okay, and she replies that she will be.",
  "synopsis": null
}