{
  "imdb_id": "tt3437472",
  "tmdb_id": "295031",
  "douban_id": null,
  "title": "Where Was God (2014)",
  "genres": [
    "Drama"
  ],
  "country": "USA",
  "version": [],
  "imdb_rating": 8.4,
  "director": [
    {
      "id": "nm4948755",
      "name": "Chip Rossetti"
    }
  ],
  "writer": [
    {
      "id": "nm4948755",
      "name": "Chip Rossetti",
      "description": null
    },
    {
      "id": "nm5816167",
      "name": "Paul Spite",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3967150",
      "name": "Timothy Paul Taylor",
      "character": "Sgt. A. D. Forrest"
    },
    {
      "id": "nm4948755",
      "name": "Chip Rossetti",
      "character": "T.D. Thomas"
    },
    {
      "id": "nm3894696",
      "name": "Seth Adair",
      "character": "Pastor Thompkins"
    },
    {
      "id": "nm5125652",
      "name": "Diana Schmitt",
      "character": "Parishioner"
    },
    {
      "id": "nm5793629",
      "name": "Jimmy DeTalente",
      "character": "Parishioner"
    },
    {
      "id": "nm3852106",
      "name": "David Ross",
      "character": "Mr. Johnson"
    },
    {
      "id": "nm3925827",
      "name": "Matthew Ulm",
      "character": "Officer Anderson"
    },
    {
      "id": "nm6232258",
      "name": "Justin Weber",
      "character": "Parishioner"
    },
    {
      "id": "nm5075050",
      "name": "Donna Botts",
      "character": "Kathy"
    },
    {
      "id": "nm4988188",
      "name": "Markus Porter",
      "character": "Usher"
    },
    {
      "id": "nm5321553",
      "name": "Bailey Rossetti",
      "character": "Sally, Girl in the Store"
    },
    {
      "id": "nm5782626",
      "name": "Joe Mayse",
      "character": "Officer Smitty"
    },
    {
      "id": "nm5563233",
      "name": "Kaitlin Borst",
      "character": "Stephanie Thompkins"
    },
    {
      "id": "nm5428588",
      "name": "Blake E. Schaefer",
      "character": "Parishioner"
    },
    {
      "id": "nm6198619",
      "name": "Kristi Miller",
      "character": "Ginger Thompkins       (as Kristina-Rose Miller)"
    },
    {
      "id": "nm6232257",
      "name": "Charles Dustin DeLacey",
      "character": "Parishioner"
    },
    {
      "id": "nm2602252",
      "name": "Maria Coleman",
      "character": "Parishioner"
    },
    {
      "id": "nm6232260",
      "name": "David Burris",
      "character": "Police Officer"
    },
    {
      "id": "nm3545254",
      "name": "Mark Clem",
      "character": "Unknown Caller"
    },
    {
      "id": "nm5920161",
      "name": "Jenny Lynn Evans",
      "character": "Parishioner"
    },
    {
      "id": "nm4782042",
      "name": "Chelsea Casanova",
      "character": "Miranda Olsen, Dispatcher"
    },
    {
      "id": "nm5028793",
      "name": "Austin Rawlins",
      "character": "Boy Scout"
    },
    {
      "id": "nm5562846",
      "name": "James Borst",
      "character": "Customer in Store"
    },
    {
      "id": "nm6051169",
      "name": "Jeff Johnson",
      "character": "Customer in Store"
    },
    {
      "id": "nm6232259",
      "name": "Linda K. Ross",
      "character": "Parishioner"
    },
    {
      "id": "nm6233017",
      "name": "Lorraine Johnson",
      "character": "Parishioner"
    },
    {
      "id": "nm5762698",
      "name": "Mary Porter",
      "character": "Parishioner"
    },
    {
      "id": "nm6232256",
      "name": "LouisaMaria Torres",
      "character": "Parishioner"
    },
    {
      "id": "nm6233018",
      "name": "Mary Arnold",
      "character": "Customer in Store"
    }
  ],
  "overview": "May 20, 2013––an EF5 tornado ripped through Moore, OK. The magnitude of devastation measured over eight times greater than the atomic bomb that leveled Hiroshima. As the world watched, one question continued to surface—Where Was God? This story follows several families and individuals who recount the timeline of destruction and share their experiences of the devastating and miraculous events that changed their lives forever.",
  "storyline": "An elderly newcomer to a church visits the pastor in his home, supposedly seeking counseling. He corners the pastor with a gun and a trigger to bombs he's allegedly planted in his home. The elderly man forces the pastor at gunpoint into the basement. He challenges the pastor to either prove God exists or renounce his faith. He tells the pastor if he confesses he's lied, he'll let the pastor live. He's also going to record his confession that he's lied and play it to the congregation. If the pastor can't prove God exists, or refuses to renounce his faith, the newcomer will kill the pastor.",
  "plot": "Josh Wheaton (Shane Harper), an evangelical college student, enrolls in a philosophy class taught by Professor Jeffrey Radisson (Kevin Sorbo), an atheist, who demands his students sign a declaration that \"God is dead\" to pass. Josh is the only student who refuses to sign. Radisson requires Josh to debate the topic with him but agrees to let the class members decide the winner. Josh's girlfriend Kara (Cassidy Gifford) demands Josh either sign the statement \"God is dead\" or drop Radisson's class, because standing up to Radisson will jeopardize their academic future. Kara breaks up with Josh for insisting on confessing his belief in God.\n\nRadisson gives Josh twenty minutes at the end of the first three lecture sessions to argue that God exists. In the first session, Josh presents his evidence that God created the universe. In the second session, Josh argues that macroevolution is not as solid of a theory as it is usually presented. In the first two sessions, Radisson has counter-arguments for some of Josh's points. Ultimately, it comes down to the third and final debate between Radisson and Josh, who again both make compelling points. Josh then halts his line of debate to pose a question to Radisson: \"Why do you hate God?\" After Josh repeats the question twice more, Radisson explodes in rage, confirming he hates God for his mother's death that left him alone despite his prayers. Josh then casually asks Radisson how he can hate someone that does not exist. In the end, Martin (Paul Kwo), a student from China whose father had forbidden him from even talking about God to avoid jeopardizing Martin's brother's chance at overseas study, stands up and says, \"God's not dead.\" Almost the entire class follows Martin's lead, and Radisson leaves the room in defeat.\n\nRadisson dates Mina, an evangelical whom he belittles in front of his fellow atheist colleagues. Her brother Mark (Dean Cain), a successful businessman and atheist, refuses to visit their mother, who suffers from dementia. Mark's girlfriend Amy is a left-wing blogger who writes articles critical of Duck Dynasty. When she is diagnosed with cancer, Mark dumps her. A Muslim student named Ayisha (Hadeel Sittu) secretly converts to Christianity and is disowned by her infuriated father when he finds out.\n\nAfter the final debate, Josh invites Martin to attend a concert by Christian pop rock group the Newsboys. Radisson reads a letter from his late mother, and is moved to reconcile with Mina. Amy confronts the Newsboys in their dressing room, only to ask them to help guide her in converting to Christianity. While on his way to find Mina, Radisson is struck by a car and fatally injured. A reverend waiting at the intersection tends to Radisson and helps him become a Christian as he dies.\n\nThe film's main characters all convene at the Newsboys concert, where they play a video clip of Willie Robertson congratulating Josh. The Newsboys play their song \"God's Not Dead\", dedicating it to Josh.",
  "synopsis": null
}