{
  "imdb_id": "tt3422462",
  "tmdb_id": "352099",
  "douban_id": null,
  "title": "Bangistan (2015)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "135 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.5,
  "director": [
    {
      "id": "nm5883328",
      "name": "Karan Anshuman"
    }
  ],
  "writer": [
    {
      "id": "nm4107081",
      "name": "Puneet Krishna",
      "description": null
    },
    {
      "id": "nm4106454",
      "name": "Sumit Purohit",
      "description": null
    },
    {
      "id": "nm5883328",
      "name": "Karan Anshuman",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm5926431",
      "name": "Saharsh Kumar Shukla",
      "character": "Kaaluram"
    },
    {
      "id": "nm2596365",
      "name": "Jacqueline Fernandez",
      "character": "Rosie"
    },
    {
      "id": "nm5584702",
      "name": "Michalina Olszanska",
      "character": "Welcome Girl"
    },
    {
      "id": "nm1299011",
      "name": "Riteish Deshmukh",
      "character": "Hafeez"
    },
    {
      "id": "nm0788903",
      "name": "Rajesh Sharma",
      "character": "Swami Gaumukhanand Gowswami"
    },
    {
      "id": "nm1122912",
      "name": "Kumud Mishra",
      "character": "Abba /              Guruji"
    },
    {
      "id": "nm3561962",
      "name": "Aakash Dabhade",
      "character": "Sanichara"
    },
    {
      "id": "nm4992002",
      "name": "Pulkit Samrat",
      "character": "Praveen"
    },
    {
      "id": "nm0022758",
      "name": "Tom Alter",
      "character": "The Imam"
    },
    {
      "id": "nm0668640",
      "name": "Cezary Pazura",
      "character": "Tom"
    },
    {
      "id": "nm0089782",
      "name": "Andrzej Blumenfeld",
      "character": "Wilfred"
    },
    {
      "id": "nm1882579",
      "name": "Zachary Coffin",
      "character": "Stanislav the Polish Cop"
    },
    {
      "id": "nm1191646",
      "name": "Arya Babbar",
      "character": "Zulfi"
    },
    {
      "id": "nm0149286",
      "name": "Janusz Chabior",
      "character": "Bobbitsky"
    },
    {
      "id": "nm0439878",
      "name": "Tomasz Karolak",
      "character": "Wilhelm"
    },
    {
      "id": "nm2218624",
      "name": "Marta Zmuda Trzebiatowska",
      "character": "Katherine Polanski"
    },
    {
      "id": "nm1340223",
      "name": "Anna Wendzikowska",
      "character": "Guardian"
    },
    {
      "id": "nm4432942",
      "name": "Sunil Vishrani",
      "character": "Pandit"
    },
    {
      "id": "nm3204740",
      "name": "Chandan Roy Sanyal",
      "character": "Tamim Iqbal"
    },
    {
      "id": "nm4072512",
      "name": "Vaibhav Mathur",
      "character": "Bhogilal"
    },
    {
      "id": "nm0837000",
      "name": "Shivkumar Subramaniam",
      "character": "The Shankaracharya"
    },
    {
      "id": "nm7215248",
      "name": "Manuj Sharma",
      "character": "Omar"
    },
    {
      "id": "nm4938422",
      "name": "Aakash Pandey",
      "character": "Sutradhar"
    },
    {
      "id": "nm3078280",
      "name": "Megh Pant",
      "character": "Haatim"
    },
    {
      "id": "nm2600167",
      "name": "Erika Guntherova",
      "character": "Immigration Officer 1"
    },
    {
      "id": "nm0501712",
      "name": "Jacek Lenartowicz",
      "character": "Polanski"
    },
    {
      "id": "nm8305820",
      "name": "Katarzyna Mos",
      "character": "Cindy"
    },
    {
      "id": "nm7472743",
      "name": "Bilguun Ariunbaatar",
      "character": "Wong"
    }
  ],
  "overview": "Two blundering terrorists with lofty ideologies, but ordinary talent, on a mission to change the world.",
  "storyline": "Bangistan is a whip smart and uproarious satire on fundamentalism and the story of two unlikely terrorists, the antitheses of each other, with a common destructive goal. Concerned by the unrest in the name of religion, Subcontinental leaders of Muslims and Hindus, the Imam and the Shankaracharya, announce that they're attending the International Peace Conference in Krakow in a joint effort to help unite the two religions in perpetual harmony. Rival rabble-rousing ragtag organizations, the Islamist Al-Kaam Tamam and right-wing political party Maa Ka Dal separately recruit and brainwash Hafeez and Praveen to suicide bomb the conference so that they may continue to wield their local influence. After a rigorous, and hilarious, 'training' period the two men switch their religious identities to stay under the radar. Hafeez, the jihadi, masquerades as a conservative Hindu, Ishwarchand; while Praveen, the Hindu soldier, dons the garb of a practicing Muslim, Allahrakha. Focused on the mission,...",
  "plot": "The story revolves around Hafeez Bin Ali (Ritesh Deshmukh) and Praveen Chaturvedi (Pulkit Samrat) both from Bangistan but different nations. Hafeez is number one in his clan for having a big beard and works underground in a restaurant called Fcdonalds. Praveen is a man who shows a lot of respect to his god Guruji and attacks anyone who insults his beloved god. However, both their bosses (both played by Kumud Mishra) encourage them to go to Poland for a mission and hosting the worlds best bombers so the 2 terrorists go. Both Praveen and Hafeez meet in the airport and decide to change their names to Allah Rakha Khan and Ishwarchand Sharma but both get arrested. Although still arrested, they still go to Poland to become bomb experts. The 2 go to local bomb experts as both Allah Rakha and Ishwar go to a Chinese restaurant owner and a potato farmer where Allah Rakha learns that the Chinese restaurant owner speaks Urdu and gives him specific bombs. Ishwarchand goes to the potato farmer Mr. Babinski who is actually a master spy and saboteur and offers him a lot of bombs but Ishwarchand recommends for a cheaper bomb. The 2 of them later fall in love with Rosie (Jacqueline Fernandez) then a love triangle between the 3 begins to spark up. When Rosie's parents anniversary happens they both ask about her religion to which she replies that she doesn't follow any religion as all religions propagate the same thing. Hafeez and Praveen become best friends and while drinking liquor both reveal their original identities. They get embroiled in a fight in which a bomb explodes which Praveen was making it. They get injured in a hospital and get labelled as 'Terrorists'. The North Bangistanis plan and train another suicide bomber Zulfi (Arya Babbar) to create terror since Hafeez's name is out.Hafeez realises that his boss wants to just spread terror in the name of religion and explains Praveen the same but Praveen acts in front of Hafeez that he is with his side but actually he wants the explosion to happen. When both reach the conference he finds Praveen activating the bomb in a washroom and then they get in a fight in which Praveen realises his mistake. At last they both expose the nature of their bosses and people misguided in the name of religion. But the bomb which was placed by Zulfi explodes leaving Hafeez and Praveen injured and then they are regarded as heroes.",
  "synopsis": null
}