{
  "imdb_id": "tt3410408",
  "tmdb_id": "376873",
  "douban_id": null,
  "title": "Rocky Handsome (2016)",
  "genres": [
    "Action",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "119 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.9,
  "director": [
    {
      "id": "nm1723225",
      "name": "Nishikant Kamat"
    }
  ],
  "writer": [
    {
      "id": "nm1937760",
      "name": "Ritesh Shah",
      "description": "adapted by"
    }
  ],
  "cast": [
    {
      "id": "nm1303433",
      "name": "John Abraham",
      "character": "Kabir Ahlawat"
    },
    {
      "id": "nm1723225",
      "name": "Nishikant Kamat",
      "character": "Kevin Ferriera"
    },
    {
      "id": "nm2821544",
      "name": "Sharad Kelkar",
      "character": "Dilip Sangodkar"
    },
    {
      "id": "nm1238336",
      "name": "Teddy Maurya",
      "character": "Luke Ferriera"
    },
    {
      "id": "nm8084458",
      "name": "Diya Chalwad",
      "character": "Naomi"
    },
    {
      "id": "nm2889417",
      "name": "Kazu Patrick Tang",
      "character": "Atilla"
    },
    {
      "id": "nm1599046",
      "name": "Shruti Haasan",
      "character": "Rukshida Kabir Ahlawat"
    },
    {
      "id": "nm8974904",
      "name": "Prashanti Talpankar",
      "character": "Fisherwoman"
    },
    {
      "id": "nm5045936",
      "name": "Nathalia Kaur",
      "character": "Anna       (as Nathalia Pinheiro Kaur)"
    },
    {
      "id": "nm8974905",
      "name": "Paromita Chatterjee",
      "character": "Rich Woman"
    },
    {
      "id": "nm8974906",
      "name": "Akanksha Awasthi",
      "character": "Lady Constable"
    },
    {
      "id": "nm8974907",
      "name": "Viren Vajpayee",
      "character": "Male Constable"
    },
    {
      "id": "nm8974908",
      "name": "Vansh Sanghani",
      "character": "Rich Kid"
    },
    {
      "id": "nm1559847",
      "name": "Jayant Sawarkar",
      "character": "Shop-Owner Uncle"
    },
    {
      "id": "nm4428415",
      "name": "Shiv Kumar Subramaniam",
      "character": "A.C.P. Rebbelo"
    },
    {
      "id": "nm1277705",
      "name": "Uday Tikekar",
      "character": "Maantu"
    },
    {
      "id": "nm3078280",
      "name": "Megh Pant",
      "character": "Football"
    },
    {
      "id": "nm8084459",
      "name": "Shyam Pakakillath",
      "character": "Gun Dealer       (as Syam Pokakillath)"
    },
    {
      "id": "nm6088044",
      "name": "Sanjay Khapre",
      "character": "Jay Pitale"
    },
    {
      "id": "nm2718834",
      "name": "Abhijeet Chavan",
      "character": "Francis"
    },
    {
      "id": "nm7555766",
      "name": "Akash Dabas",
      "character": "Kunal Bathena"
    },
    {
      "id": "nm3722525",
      "name": "Nachiket Purnapatre",
      "character": "Edwin"
    },
    {
      "id": "nm8974909",
      "name": "Ghanshyam Sondagar",
      "character": "Cop at Beach"
    },
    {
      "id": "nm8084460",
      "name": "Kunal Naik",
      "character": "Loan Shark"
    },
    {
      "id": "nm5755762",
      "name": "Gurpreet Saini",
      "character": "Viju Dempo"
    },
    {
      "id": "nm0611663",
      "name": "Suhasini Mulay",
      "character": "Carla Aunty"
    },
    {
      "id": "nm3237860",
      "name": "Sachin Pathak",
      "character": "Ernie's Waiter Sunil"
    },
    {
      "id": "nm3074168",
      "name": "Bobby Bedii",
      "character": "Joaquim"
    },
    {
      "id": "nm8974910",
      "name": "Manju Rawal",
      "character": "Canteen Aunty"
    },
    {
      "id": "nm4432942",
      "name": "Sunil Vishrani",
      "character": "Russian Translator"
    },
    {
      "id": "nm4286839",
      "name": "Sandesh Kulkarni",
      "character": "Debtor"
    },
    {
      "id": "nm6598222",
      "name": "Nora Fatehi",
      "character": "City Club Dancer"
    },
    {
      "id": "nm8974911",
      "name": "Karan Sharma",
      "character": "City Club DJ"
    },
    {
      "id": "nm8974912",
      "name": "Tatiana",
      "character": "City Club Aerial Dancer"
    },
    {
      "id": "nm5852684",
      "name": "Shekar",
      "character": "City Club Smoke Machine Man"
    },
    {
      "id": "nm7481953",
      "name": "Himanshu Joshi",
      "character": "Man on Phone"
    },
    {
      "id": "nm2983553",
      "name": "Ajay Trehan",
      "character": "Mi Officer"
    },
    {
      "id": "nm1205111",
      "name": "Sunil Rodrigues",
      "character": "Assassin Outside Hospital"
    },
    {
      "id": "nm8974913",
      "name": "Dhanvi",
      "character": "Red Frock Girl"
    },
    {
      "id": "nm8974914",
      "name": "Adil",
      "character": "Bagha Kid 1"
    },
    {
      "id": "nm8135995",
      "name": "Bhav Dhulia",
      "character": "Gaming Zone Main Goon"
    },
    {
      "id": "nm7648637",
      "name": "Lakhan Kachole",
      "character": "Gaming Zone Side Goon"
    },
    {
      "id": "nm7641041",
      "name": "Pritesh Shanbhag",
      "character": "Tattoo Parlour Owner"
    },
    {
      "id": "nm8974915",
      "name": "Aditya Bichu",
      "character": "Baga Kid 2"
    },
    {
      "id": "nm1384402",
      "name": "Uday Chandra",
      "character": "Organ Extraction Doctor"
    }
  ],
  "overview": "Rocky Handsome is a loose adaptation of the 2010 Korean film The Man from Nowhere. The film story revolves around John Abraham as Kabir Ahlawat/Rocky Handsome who sets out to take revenge against drug mafia after they kidnapped an eight-year old girl, with whom he shares a special bond. Shruti Haasan played the wife of Kabir Ahlawat as Rukshida.",
  "storyline": "Kabir runs a pawn shop in Goa he befriends his little neighbor Naomi who lives with her drug addict mother Anna.Acp Salgaonkar is after a drug landlord Mantoo who runs the racket with Fereira brothers Kevin and Luke and also deal with organ trafficking.",
  "plot": "The movie is set in a city in Goa, where Kabir \"Rocky\" Ahlawat (John Abraham) lives a quiet life running a pawn shop. His next door neighbor is Anna (Nathalia Kaur), a drug addict and bar dancer. She lives with her little daughter, Naomi, who develops a nurturing relationship with Rocky and affectionately calls him \"Handsome.\" Meanwhile, ACP Dilip from the Anti-Narcotics Department of the police force is after the drug kingpin, Mantoo. Mantoo is supported by two powerful brothers, Kevin and Luke, who not only deal drugs but also control a mass racket in organ harvesting with a professional assassin, Attila.\n\nOne night, Anna and her accomplice steal drugs from Mantoo's henchman, Bigshow. Anna hides the drugs in a camera that she pawns to Rocky. The loss of the consignment enrages Mantoo and he gives Kevin three days to recover the stolen drugs. Luke and Attila reach Anna's place, where Luke tortures Anna for the camera. Attila finds Bigshow already fighting with Rocky for it. Rocky is obliged to hand over the camera to Luke when he tells him that both Naomi and her mother are his captives. Rocky gets a call from Kevin to make a delivery to Mantoo, and promises that in return he will set Anna and Naomi free. Rocky goes to deliver the drugs to Mantoo, where he finds that police had already raided Mantoo's haven. Mantoo flees and Rocky chases him, but he is arrested by police. They are shocked to find Anna's naked body with all her organs harvested in Rocky's car. Kevin brutally murders Mantoo, taking all his organs, and becomes the new drug lord.\n\nDuring interrogation, Rocky escapes from the police station. The police are bewildered by his combat skills and find out that he was a former decorated RAW Agent/Special Forces soldier who retired after his pregnant wife, Rukshida (Shruti Haasan) was murdered. Rocky fights with Attila at a nightclub and is shot, but breaks into a medicine shop and performs an impromptu surgery. He then continues on his journey.\n\nRocky finds and frees several child slaves in a drug-manufacturing plant, and in the process, kills the younger brother, Luke. He tracks down Kevin, who says that he has had Naomi killed. He shows a container that has what he says are her eyes. In a rage, Rocky kills all the gang members, including Attila and Kevin.\n\nAs Rocky prepares to commit suicide out of grief, Naomi emerges. She had been saved by Attila before her eye surgery; he took pity on her because she had been kind to him. The eyes in the container belonged to the gangsters' surgeon, who had been killed by Attila when he saved Naomi. Rocky is arrested but the police allow Naomi to ride with him. Rocky asks if they can stop at a convenience store, where he buys Naomi a backpack and school supplies. He asks her if she can manage until he returns, to which she nods. He then asks her for a hug before he leaves.",
  "synopsis": "Based in a city in Goa, Kabir Ahlawat (John Abraham) lives a quiet life running a pawn shop. His next door neighbor is Anna (Nathalia Kaur), a drug addict and bar dancer. She lives with her little daughter, Naomi, who develops a nurturing relationship with Kabir. Meanwhile, ACP Dilip from the Anti-Narcotics Department of the police force is after the drug kingpin, Mantoo. Mantoo is supported by two powerful brothers, Kevin and Luke, who not only deal drugs but also control a mass racket in organ harvesting with a professional assassin, Attila.One night, Anna and her accomplice steal drugs from Mantoo's henchman, Bigshow. Anna hides the drugs in a camera that she pawns to Kabir. The loss of the consignment enrages Mantoo and he gives Kevin three days to recover the stolen drugs. Luke and his deadly accomplice Attila reach Anna's place, where Luke tortures Anna for the camera. Atilla finds Bigshow already fighting with Kabir for it. Kabir is obliged to hand over the camera to Luke when he tells him that both Naomi and her mother are his captives. Kabir gets a call from Kevin to make a delivery to Mantoo, and promises that in return he will set Anna and Naomi free. Kabir goes to deliver the drugs to Mantoo, where he finds that police had already raided Mantoo's haven. Mantoo flees and Kabir chases him, but he is arrested by police. They are shocked to find Anna's naked body with all her organs harvested in Kabir's car. Kevin brutally murders Mantoo, taking all his organs, and becomes the new drug lord.During interrogation, Kabir escapes from the police station. The police are bewildered by his combat skills and find out that he was a former decorated RAW Agent and Special Forces soldier who retired after his pregnant wife, Rukshida (Shruti Haasan) was murdered. Kabir fights with Attila at a nightclub and is shot, but breaks into a medicine shop and performs an impromptu surgery. He then continues on his journey.Kabir finds and frees several child slaves in a drug-manufacturing plant, and in the process, kills the younger brother, Luke. He tracks down Kevin, who says that he has had Naomi killed. He shows a container that has what he says are her eyes. In a rage, Kabir kills all the gang members, including Atilla and Kevin.As Kabir prepares to commit suicide out of grief, Naomi emerges. She had been saved by Attila before her eye surgery; he took pity on her because she had been kind to him. The eyes in the container belonged to the gangsters' surgeon, who had been killed by Attila when the latter saved Naomi. Kabir is arrested but the police allow Naomi to ride with him. Kabir asks if they can stop at a convenience store, where he buys Naomi a backpack and school supplies. He asks her if she can manage until he returns, to which she nods. He then asks her for a hug before he leaves."
}