{
  "imdb_id": "tt3586930",
  "tmdb_id": "378092",
  "douban_id": null,
  "title": "Kill Kane (2016)",
  "genres": [
    "Crime",
    "Thriller"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "74 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.9,
  "director": [
    {
      "id": "nm3033111",
      "name": "Adam Stephen Kelly"
    }
  ],
  "writer": [
    {
      "id": "nm2886415",
      "name": "Christian Sellers",
      "description": null
    },
    {
      "id": "nm2096009",
      "name": "Andrew Jones",
      "description": null
    },
    {
      "id": "nm3033111",
      "name": "Adam Stephen Kelly",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0005068",
      "name": "Vinnie Jones",
      "character": "Ray Brookes"
    },
    {
      "id": "nm1206755",
      "name": "Nicole Faraday",
      "character": "Kim Brookes"
    },
    {
      "id": "nm2374864",
      "name": "Sebastian Street",
      "character": "DI Shelby"
    },
    {
      "id": "nm2018573",
      "name": "Sean Cronin",
      "character": "Kane Keegan"
    },
    {
      "id": "nm2783114",
      "name": "Dan Richardson",
      "character": "Frank Noonan"
    },
    {
      "id": "nm5703265",
      "name": "Conor Boru",
      "character": "Connor O'Brien"
    },
    {
      "id": "nm7195301",
      "name": "Benjamin Way",
      "character": "Billy Malone"
    },
    {
      "id": "nm4110613",
      "name": "Sarah Alexandra Marks",
      "character": "Victoria Brookes"
    },
    {
      "id": "nm5616071",
      "name": "Michael Bailey",
      "character": "Max Brookes"
    },
    {
      "id": "nm6908335",
      "name": "Mitchell Fisher",
      "character": "Tommy Richards"
    },
    {
      "id": "nm0604732",
      "name": "Jared Morgan",
      "character": "Dr. Regan"
    },
    {
      "id": "nm2794671",
      "name": "Lee Bane",
      "character": "News Reporter /              Police Dispatcher"
    },
    {
      "id": "nm6810919",
      "name": "Finelle Grace Batista",
      "character": "Hospital Patient"
    },
    {
      "id": "nm6009851",
      "name": "Kane Surry",
      "character": "Jamie"
    },
    {
      "id": "nm5486245",
      "name": "Kevin Foster",
      "character": "Bartender"
    }
  ],
  "overview": "A teacher's world is torn apart when his wife and children are brutally murdered at the hands of a ruthless gang. Left for dead and with no one to turn to, he takes matters into his own hands and hits the streets in search of justice.",
  "storyline": "A teacher's world is torn apart when his wife and children are brutally murdered at the hands of a ruthless gang. Left for dead and with no one to turn to, he takes matters into his own hands and hits the streets in search of justice.",
  "plot": "The game opens with a voiceover of Adam 'Kane' Marcus, reading a letter addressed to his daughter Jenny. Kane is traveling to death row after being convicted of manslaughter. Another death row inmate, James Seth Lynch, lets on there will be a breakout. Their truck is involved in a head-on collision by a group of mercenaries. The two are taken to a construction site, where they are confronted by four members of a gang of criminals called The 7, led by The Brothers and their henchmen Carlos (a close friend of Kane) and Mute. They accuse Kane of stealing money from them, and reveal that they have taken his wife and daughter hostage. Kane is given three weeks to retrieve the money or his wife and daughter will be killed.\n\nAfter the meeting with The 7, police officers arrive and the two are forced to shoot their way out of the construction site. Later, Kane explains that he did not steal from The 7, but knows who did, and where they hid it. Kane and Lynch rob a local bank where the money is being kept. Though only half of the money is inside the safe, Kane believes he knows where the other half is. Meanwhile, Lynch, who suffers from periodic episodes of violent psychosis, blacks out and kills all of the hostages after his medication wears off, forcing Kane and Lynch to shoot their way out and flee in a van driven by their getaway driver. Losing the police in the subway after the van crashes, Kane informs Lynch that they need to go to Tokyo to retrieve the other half of the money.\n\nIn Tokyo, the pair go after Retomoto, a Japanese crime lord, by kidnapping his daughter Yoko as ransom. While Kane negotiates with Retomoto over the phone, Lynch accidentally shoots and kills Yoko while trying to stop her from escaping. Kane, Lynch and The 7's hired guns then proceed to escape from Retomoto's hitmen. Kane is furious with Lynch, but he soon realizes that they are out of time, and must return to The 7 with only half of the stolen money.\n\nLynch reveals to Kane that he made a deal with The 7 to ensure his survival as well as a position within The 7, but he is betrayed and knocked unconscious at the construction site where Kane and his family are to be executed. Kane's plea for extra time is denied, as The Brothers and Carlos depart for Havana, leaving Mute to carry out the deed. Kane's wife expresses her disgust with Kane but is executed by Mute before he has a chance to speak to her as promised. Regaining consciousness, Lynch snaps and attacks his kidnappers while Kane beats Mute to death. Kane and Lynch then protect Kane's daughter Jenny from The 7's reinforcements as she cries over her mother's body.\n\nKane buries his wife and decides to finish off The 7 for the sake of his daughter's safety. Kane and Lynch free a group of \"dead men\" from prison: Rific, Thapa and Shelly. These men had been wronged by The 7 and join the duo to get revenge, although Shelly expresses resentment at working with Lynch and suggests that he may have killed his own wife. Before flying to Havana, they return to Tokyo and kill Retomoto, reclaiming the briefcase of money to finance their war with The 7. In Havana, Kane keeps everyone motivated with promises of payment as they track down The Brothers and Carlos. Kane informs Lynch that The 7 profit from assisting factions in civil wars, with Havana supposedly the last job needed for their retirement. They find themselves caught up in an ongoing civil war, joining the Cuban Revolutionary Armed Forces and battling The 7's forces trying to stage a coup d'état. They find Carlos, abandoned by The Brothers. Kane recruits him, and Thapa, no longer trusting Kane, abandons the mission as a result.\n\nThe Dead Men then fight their way through the Venezuelan jungle, and locate The Brothers at their compound. When the Dead Men arrive in the Cuban Jungle of Havana, Shelly demands his pay for helping Kane, that Kane claimed Shelly, Rific and Thapa would get for helping him, Carlos tells Shelly and Rific that there is plenty of heroin in the village that they can take as compensation. Carlos then volunteers to go on ahead and open the gates with an explosive trying to create a diversion, but vanishes inside. This leads Lynch to think that Carlos tricked them all into a trap. Then Kane and Lynch discover over Carlos's radio that The 7 have again captured Jenny. They discover in the compound courtyard Jenny, unharmed and Carlos' corpse. They suddenly get ambushed by The Brothers and their mercenaries, The Elder Brother claims the killing of Carlos, forcing Kane to shoot a mine beside Carlos' corpse and the two then kill The Elder Brother. The Younger Brother however, manages to escape with Jenny and attempts to take off in an airplane.\nFrom left to right: Thapa, Lynch, Kane, Shelly, and Rific.\nKane and Lynch follow in a car and disable the plane's engines before killing the Younger Brother. Jenny then pulls a gun on Kane and blames him for her mother's death. Kane tells her that whether she hates him or not he will get her to safety. Kane is then given the choice of rescuing Rific and Shelly from the village church, who are being pinned down by The 7's mercenaries, or escaping in a helicopter with Jenny and leaving them to die.\n\nIf Kane boards the helicopter with Jenny and leaves Rific and Shelly to die, Jenny will resent her father for leaving his men and tell him that she hates him. As they are escaping in the helicopter, Lynch, on the ground, says to himself, \"I fucking knew it, from the first second I fucking knew it.\"\n\nIn the other ending chapter, Kane chooses to rescue Rific and Shelly, who are trapped in a burning church towering over a village. Kane and Lynch are too late to save Rific, but Shelly is still alive. He feels betrayed despite the rescue attempt. As they escape to the pier, Jenny is shot, and Kane carries her body along. Shelly loses his patience and attempts to escape on one of the boats alone but appears to be killed by an explosion, although his boat is seen leaving the pier. Lynch is shot as he escapes on an undamaged boat with Kane, while Jenny's status is still unknown. The boat drifts slowly with the river, while Kane holds Jenny and whispers to her about the letter he tried to send her.",
  "synopsis": null
}