{
  "imdb_id": "tt3522806",
  "tmdb_id": "278924",
  "douban_id": null,
  "title": "Mechanic: Resurrection (2016)",
  "genres": [
    "Action",
    "Adventure",
    "Thriller"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "98 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm0304541",
      "name": "Dennis Gansel"
    }
  ],
  "writer": [
    {
      "id": "nm1909937",
      "name": "Philip Shelby",
      "description": "screenplay and"
    },
    {
      "id": "nm1912600",
      "name": "Tony Mosher",
      "description": "screenplay"
    },
    {
      "id": "nm0137573",
      "name": "Lewis John Carlino",
      "description": "based upon the characters created by"
    },
    {
      "id": "nm0519154",
      "name": "Rachel Long",
      "description": null
    },
    {
      "id": "nm1909937",
      "name": "Philip Shelby",
      "description": "story"
    },
    {
      "id": "nm4256393",
      "name": "Brian Pittman",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0005458",
      "name": "Jason Statham",
      "character": "Arthur Bishop"
    },
    {
      "id": "nm0004695",
      "name": "Jessica Alba",
      "character": "Gina"
    },
    {
      "id": "nm0000169",
      "name": "Tommy Lee Jones",
      "character": "Max Adams"
    },
    {
      "id": "nm0000706",
      "name": "Michelle Yeoh",
      "character": "Mei"
    },
    {
      "id": "nm1486831",
      "name": "Sam Hazeldine",
      "character": "Crain"
    },
    {
      "id": "nm0127362",
      "name": "John Cenatiempo",
      "character": "Jeremy"
    },
    {
      "id": "nm1821091",
      "name": "Toby Eddington",
      "character": "Adrian Cook"
    },
    {
      "id": "nm0255811",
      "name": "Femi Elufowoju Jr.",
      "character": "Krill"
    },
    {
      "id": "nm4682028",
      "name": "Anteo Quintavalle",
      "character": "Frank"
    },
    {
      "id": "nm4457335",
      "name": "Yayaying Rhatha Phongam",
      "character": "Courier       (as Rhatha Phongam)"
    },
    {
      "id": "nm2000704",
      "name": "Bonnie Zellerbach",
      "character": "Headmistress"
    },
    {
      "id": "nm0861643",
      "name": "Stuart Thorp",
      "character": "Rio Thug #1"
    },
    {
      "id": "nm0476736",
      "name": "Alex Kuzelicki",
      "character": "Rio Thug #2"
    },
    {
      "id": "nm3100183",
      "name": "Brahim Chab",
      "character": "Rio Thug #3       (as Brahim Achabbakhe)"
    },
    {
      "id": "nm1398322",
      "name": "Thomas Kiwi",
      "character": "Rio Thug #4"
    },
    {
      "id": "nm1399271",
      "name": "Andrew Stehlin",
      "character": "Rio Thug #5"
    },
    {
      "id": "nm8346060",
      "name": "Francis Tonkala Tamouya",
      "character": "Slender Psycho (Nuujib)"
    },
    {
      "id": "nm8346061",
      "name": "Tais Rodrigues Dias",
      "character": "Hang Glider"
    },
    {
      "id": "nm4789809",
      "name": "Lynette Emond",
      "character": "Sexy Thai Assistant"
    },
    {
      "id": "nm0691597",
      "name": "Allan Poppleton",
      "character": "Dice Prisoner"
    },
    {
      "id": "nm6254342",
      "name": "Maethi Thapthimthong",
      "character": "Young Contruction Worker"
    },
    {
      "id": "nm8346063",
      "name": "Soji Ikai",
      "character": "Skinny Prisoner"
    },
    {
      "id": "nm3307918",
      "name": "Vithaya Pansringarm",
      "character": "Prison Warden"
    },
    {
      "id": "nm5462652",
      "name": "Chatchawai Kamonsakpitak",
      "character": "Prison Guard       (as Chatchawan Kamonsakpitak)"
    },
    {
      "id": "nm1284482",
      "name": "Atanas Srebrev",
      "character": "Trawler Captain"
    },
    {
      "id": "nm5763203",
      "name": "Yothin Udomsanti",
      "character": "Deckhand"
    },
    {
      "id": "nm1528245",
      "name": "Rachel O'Meara",
      "character": "Leasing Agent"
    },
    {
      "id": "nm0115930",
      "name": "Aaron Brumfield",
      "character": "Adam's Head of Security"
    },
    {
      "id": "nm2314909",
      "name": "Damian Mavis",
      "character": "Adam's Guard"
    },
    {
      "id": "nm8346065",
      "name": "Valentin Velkov",
      "character": "Tearful Employee       (as Valentin Velkon)"
    },
    {
      "id": "nm1212335",
      "name": "Tony Arunah Abbey",
      "character": "Cook's Interview Reporter"
    },
    {
      "id": "nm7121409",
      "name": "Amir Zargham",
      "character": "Pier Worker"
    },
    {
      "id": "nm1408704",
      "name": "Peter Rnic",
      "character": "Pilot"
    },
    {
      "id": "nm5478558",
      "name": "Eoin O'Brien",
      "character": "Merc #1"
    },
    {
      "id": "nm5284397",
      "name": "Alexander Winters",
      "character": "Merc #2"
    },
    {
      "id": "nm8157841",
      "name": "Armin Parvin",
      "character": "Merc #3       (as Amin Parvin)"
    },
    {
      "id": "nm8346066",
      "name": "Yuri Chuchenko",
      "character": "Varna Cop"
    },
    {
      "id": "nm2238248",
      "name": "Natalie Burn",
      "character": "BBC Reporter"
    },
    {
      "id": "nm5574325",
      "name": "Tomer Oz",
      "character": "Adam's Guard"
    }
  ],
  "overview": "Arthur Bishop thought he had put his murderous past behind him when his most formidable foe kidnaps the love of his life. Now he is forced to travel the globe to complete three impossible assassinations, and do what he does best, make them look like accidents.",
  "storyline": "Arthur Bishop, the master assassin who faked his death in hopes of putting that part of his ;life behind him, now lives a quiet life in Rio. But someone who knows who he is shows up and tells him, that if he wants to continue living this life, he will do three jobs for someone. Bishop tries to tell them he has the wrong man but they know who he is and if he won't do the job, they will take him but he gets away. He then goes to a resort in Thailand run by a friend, Mae, where he tries to find out who is looking for him. Later a woman named Gina shows up looking for medical assistance and Mae can't help but notice bruises all over her body. Mae deduces she's a battered woman and when Mae hears her being beaten, Mae asks Bishop to help her. He goes and kills the guy she's with. He kills the man and then sets fire to the boat he's on. But he sees that Gina has a photo of him. He deduces that they one who wants him, sent her. He confronts her and she admits that she works at a children's ...",
  "plot": "After faking his death, Arthur Bishop has been living quietly in Rio de Janeiro with the name Santos. He is approached by Renee Tran, who knows of his true identity and explains her employer wishes for Bishop to kill three targets and stage them as accidents. Seeing her mercenaries waiting nearby, Bishop makes his escape, and flees the country to Thailand. He takes shelter at a resort island beach house of his friend, Mae, and learns that Tran is working for Riah Crain. Bishop and Crain were orphans that grew up together, but later sold to a gangster and trained as warriors. Bishop made his escape and left Crain behind.\n\nSometime later, a bruised woman, Gina Thorne, approaches Mae for first aid before returning to a boat anchored nearby. Mae observes Thorne being beaten by a man aboard the boat and alerts Bishop. Bishop and Mae rescue Thorne from the man, but in the scuffle, the man hits his head on the boat's equipment and dies. Finding no evidence of his identity, Bishop sets the boat ablaze. While Mae tends to Thorne's injuries, Bishop finds that Thorne is also connected to Crain, and believes Crain anticipated Bishop would become romantic with her; Crain would then have kidnapped her to make Bishop take the assassination jobs. When he charges Thorne with his theory, she reveals that Crain threatened the children's shelter in Cambodia that she worked at unless she participated. Over the next few days, Bishop does get to know Thorne better and falls in love, but as expected, Crain's mercenaries soon arrive and abduct the two.\n\nThorne is taken to Crain's private boat, while Bishop is brought to Crain himself, where he coerces him to take the assassination jobs with Thorne's life, providing him with the necessary resources to complete them. The first target of Bishop is a warlord named Krill, who is incarcerated in a Malaysian prison. Bishop travels to Malaysia and gets himself imprisoned to access Krill. Bishop gains Krill’s trust by killing a man already planning on killing Krill. Bishop meets with Krill and kills him and Bishop escapes the prison with the help of Crain's operatives. The next target is Adrian Cook, who runs an underage trafficking ring from Sydney. Bishop manages to bypass the tight security of Cook's penthouse apartment and break the glass bottom of Cook's overhanging pool, plummeting him to his death.\n\nWhile relaying details of the third target, Crain allows Bishop to speak over video to Thorne, who has arranged her setting to allow Bishop to identify the registration number of Crain's boat. Bishop locates the boat and attempts to rescue her, but Crain has caught Thorne's attempt in time and his mercenaries quickly stop the attempt. For his insolence, Crain demands Bishop complete the final assassination in 24 hours, identifying the target as Max Adams, an American arms dealer. While planning the attempt, Bishop recognizes that Crain's targets were his only other major competition in arms dealing. Bishop instead approaches Adams and warns him of Crain's plan, and gets Adams to help. Bishop fakes Adams' death, and reports his success to Crain, who directs him to a meeting point.\n\nThere, Bishop fends off attacks by Crain's mercenaries and makes for Crain's boat parked nearby. He fights off more of Crain's men and discovers the boat is rigged with explosives before rescuing Thorne, placing her in an underwater escape pod. Crain stops him before he can escape, and the two fight. Bishop overpowers him and secures him to the boat, when Crain reveals the explosives are set to go off soon. Instead of diving overboard, Bishop races into the boat, moments before the bombs explode, killing Crain and apparently Bishop.\n\nThorne is rescued and the remains of Crain's boat are salvaged with no other signs of life. Adams watches the operation from afar, and sees that one of the salvaged pieces was the anchor compartment, and monitors video to see Bishop emerge from the compartment several hours later, and then deletes the video to keep Bishop's status secret. Thorne returns to Cambodia and her teaching duties, but later is surprised when Bishop arrives a few days later.",
  "synopsis": "In this sequel, after faking his death, Arthur Bishop (Jason Statham) has been living quietly in Rio de Janeiro as Mr. Santos. One day during lunch, he is approached by a mysterious woman (Yayaying Rhatha Phongam). She states that her employer wishes for Bishop to come out of retirement to kill three targets and stage them as accidents. The woman also brought a group of assassins with her. Bishop takes a picture of her on his phone as she reaches for a gun. He pushes the table against her as the other hitmen approach him. Bishop fights all of them before running onto a tram car. The woman chases him and almost gets him until he makes his escape by jumping on the back of a hang glider.Bishop retreats to a location in Thailand to hideout with help of his friend Mae (Michelle Yeoh) investigates the woman and learns her employer is Riah Crain (Sam Hazeldine), a former childhood friend of Bishop's.By the shore, Bishop sees a beautiful woman, Gina (Jessica Alba). Later at night, on the ocean, Bishop sees a boat and hears Gina sounding like she's being attacked. Bishop heads over to the boat and kills the attacker before bringing Gina back to the shore for safety. Bishop later watches a video of Gina teaching children in Cambodia. When she wakes up, Gina explains that a friend of hers was taken by Crain, and he threatened to harm the children if she didn't do what he wanted. Bishop keeps Gina close and takes her by a bar where Mae works. This brings the two of them closer as they bond, unaware that Crain's men are watching them.Eventually, Crain's men corner Bishop and Gina on the beach. While Bishop fights the hitmen, Gina is taken.Bishop is brought in to meet with Crain after a long absence. Crain has an axe to grind with Bishop after he felt that Bishop abandoned him when Crain needed him. Crain orders Bishop to kill the three targets, or else Gina will die. Bishop reluctantly agrees. The first target is a warlord named Krill (Femi Elufowoju Jr.), who is being kept locked up in a Malaysian prison.Bishop travels to Malaysia and gets himself arrested in order to get in the same building as Krill. While on the inside, Bishop stops a man who was already planning on killing Krill. Later, Bishop meets with Krill inside his little hut by the prison yard. As Krill discusses his plan to rule Africa once he gets out of prison, Bishop sneaks up on him and chokes him with a wooden rod by pressing it against a bar on the window. He sets up the \"accident\" by having Krill sit at his table to appear as though he was in the middle of a prayer. The guards are alerted to the incident and witness Bishop on the security cameras. Bishop creates a bomb that blows a hole through the prison walls. He walks through and jumps into the ocean to escape.Bishop is contacted by Crain through his tablet to speak with Gina. She tells him that he only has 36 hours to kill the next target or she will be eliminated. Crain tells Bishop that the next target is a man named Adrian Cook (Toby Eddington), who runs an underage trafficking ring.Bishop finds Cook's apartment and carefully sets up his trap. Cook goes for a swim in his glass pool outside his apartment while Bishop is hooked to a wire as he scales the building. He uses a device to break the glass in the pool, causing the water to spill out with Cook plummeting to his death. Once again, Bishop makes a clean getaway.Somehow, time has run out for Bishop, and he is forced to kill the last target immediately. The man is Max Adams (Tommy Lee Jones), a billionaire who owns a bunch of submarines. Adams finds Bishop waiting for him in his safe room, but instead of killing him, the two of them get along and decide to work together. Bishop has Adams fake his death by blowing up his equipment and telling Crain that the job is done. They arrange a meeting so Crain can give Gina back. However, Crain is planning to have Bishop killed.Bishop waits for Crain's men as they get off land and head to kill him. He shoots them all dead before heading toward Crain's boat. He shoots, stabs, and blows up more hitmen before getting to Crain. He finds Gina, and they discover that Crain has the boat rigged to explode. Bishop puts her in a chamber to let her escape while he finishes Crain. The two of them go head-to-head and fight as time is running out. Crain pulls Bishop down with the anchor chain, but Bishop manages to pull it off and tie Crain down with the chains. Bishop runs away moments before the boat explodes, killing Crain. Gina resurfaces in the chamber and sees the wrecked boat. She is rescued and treated by paramedics, and she learns there were no survivors.Gina returns to Cambodia to continue teaching. She writes a letter to Mae to let her know she is safe and doing what she loves. Gina is then surprised when Bishop shows up. They embrace.The last scene shows Adams reviewing security footage. He sees that Bishop found a chamber to sneak into before the boat exploded. He got out once that piece of the boat was recovered. Adams laughs and deletes the evidence."
}