{
  "imdb_id": "tt3588082",
  "tmdb_id": "376504",
  "douban_id": null,
  "title": "Steel (2015)",
  "genres": [
    "Drama",
    "Mystery",
    "Romance"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "108 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm1672027",
      "name": "Sven J. Matten"
    }
  ],
  "writer": [
    {
      "id": "nm1672027",
      "name": "Sven J. Matten",
      "description": "written by &"
    },
    {
      "id": "nm1928824",
      "name": "Melissa Kajpust",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0174966",
      "name": "Chad Connell",
      "character": "Daniel"
    },
    {
      "id": "nm5083702",
      "name": "David Cameron",
      "character": "Alexander"
    },
    {
      "id": "nm0476906",
      "name": "Mimi Kuzyk",
      "character": "Aunt Margaret"
    },
    {
      "id": "nm0331341",
      "name": "Tamara Gorski",
      "character": "Barbara"
    },
    {
      "id": "nm5813845",
      "name": "Erik Athavale",
      "character": "Ralph"
    },
    {
      "id": "nm3190354",
      "name": "Jason Wishnowski",
      "character": "Ryan Peters"
    },
    {
      "id": "nm0522979",
      "name": "John B. Lowe",
      "character": "Ned Watson"
    },
    {
      "id": "nm6426705",
      "name": "Sheila Campbell",
      "character": "Attractive Woman"
    },
    {
      "id": "nm3870572",
      "name": "Andrea del Campo",
      "character": "Daniel's Mother"
    },
    {
      "id": "nm0797587",
      "name": "Chris Sigurdson",
      "character": "Daniel's Father"
    },
    {
      "id": "nm6726236",
      "name": "Ben Grocholski",
      "character": "Young Daniel"
    },
    {
      "id": "nm5491338",
      "name": "Maxine Gibson Bruce",
      "character": "Daniel's Sister"
    },
    {
      "id": "nm6536293",
      "name": "Logan Creran",
      "character": "Young Friend"
    },
    {
      "id": "nm3025896",
      "name": "Daryl Dorge",
      "character": "Michael"
    },
    {
      "id": "nm1432614",
      "name": "Tyhr Trubiak",
      "character": "Rock Star"
    },
    {
      "id": "nm2842100",
      "name": "Darren Felbel",
      "character": "Semi-trailer Driver"
    },
    {
      "id": "nm1542824",
      "name": "Ernie Pitts",
      "character": "Truck Driver"
    },
    {
      "id": "nm6726285",
      "name": "Daniel McIntyre-Ridd",
      "character": "Kid"
    },
    {
      "id": "nm1377567",
      "name": "Joanne Rodriguez",
      "character": "Clerk"
    },
    {
      "id": "nm2716722",
      "name": "Gabriel Daniels",
      "character": "Grocery Delivery Guy"
    },
    {
      "id": "nm3647084",
      "name": "Alan Castanaga",
      "character": "Chinese Food Delivery Guy"
    }
  ],
  "overview": "Daniel (30), a successful TV journalist living life in the fast lane, has fallen into a deep depression. His seemingly perfect life suddenly collapses under him when panic attacks force him to deal with himself and his past. Fear, paranoia and desperation appear to get the better of him, people around him are helpless. Daniel, however, won’t give up: he tries to recapture what was once his by creating a second identity for himself, young Alexander (19), with whom he embarks on an extraordinary journey into a painful past.",
  "storyline": "Daniel, a successful TV journalist living life in the fast lane, has fallen into a deep depression. His seemingly perfect life suddenly collapses under him when panic attacks force him to deal with himself and his past. Fear, paranoia and desperation appear to get the better of him, people around him are helpless. Daniel, however, won't give up: he tries to recapture what was once his by creating a second identity for himself, young Alexander, with whom he embarks on an extraordinary journey into a painful past.",
  "plot": "The film is presented in a nonlinear narrative, jumping between the present and past. This is a linear summary of the plot.\n\nThe planet Krypton, unstable from years of industrial mining, faces impending destruction. Jor-El, chief advisor to Krypton's supreme council, recommends a full-scale evacuation of the planet's inhabitants. Before any action can be taken, soldiers led by General Zod, an old friend of Jor-El's, launch an uprising and arrest the councilors. Realizing that Krypton is doomed, Jor-El steals genetic codes sought by Zod and infuses them into the DNA of his infant son, Kal-El – the first naturally born Kryptonian child in centuries. Donning his old armor, Jor-El sacrifices his life to allow his son to escape on a preprogrammed spacecraft. Zod orders the rocket's destruction, only to learn that forces loyal to the council have suppressed the rebellion. In a brief trial, Zod and several of the surviving rebels are convicted of treason and sentenced to the Phantom Zone moments before Krypton explodes.\n\nFollowing Jor-El's coordinates, the ship crash lands on Earth in Smallville, Kansas. A childless couple, Jonathan and Martha Kent, find Kal-El and raise him as their own, naming him Clark. Clark eventually becomes an isolated young man as a result of developing superhuman powers. He then learns his true origins from Jonathan, who urges him to keep his powers hidden. Several years later, Jonathan dies in a tornado while refusing to let Clark rescue him. Burdened with guilt and looking for a new purpose in his life, Clark leaves to travel the world for an extended period of time under several disguises.\n\nSeveral months later, Metropolis, Daily Planet reporter Lois Lane receives an assignment to investigate the discovery of a Kryptonian scout ship in the Canadian Arctic. Disguised as a worker, Clark enters the ship and activates its central computer using a key left by Jor-El, which allows him to communicate with an artificial intelligence modeled after his father. The AI explains that Clark was sent to Earth to guide its people, and presents him with a Kryptonian uniform bearing his family's symbol. While following Clark, Lois inadvertently triggers the ship's security system. Clark uses his powers to rescue Lois before wearing the uniform and testing his flying abilities. Unable to convince supervisor Perry White to publish an article on the incident, Lois tracks down Clark and agrees to keep his secret safe.\n\nEscaping the Phantom Zone, Zod and his crew intercept a transmission from the scout vessel and travel to Earth. Deducing that Kal-El is nearby, they broadcast a global address demanding that he surrender or risk war. Clark meets with the United States Army and agrees to comply, with Lois joining him as a hostage. Zod reveals that he possesses advanced terraforming equipment salvaged from Kryptonian outposts, which he intends to use to transform Earth into a new Krypton. His science officer, Jax-Ur, extracts Clark's genes to create Kryptonian colonists who will annihilate humanity and build a society based on Zod's ideals of genetic purity. With help from Jor-El, Clark and Lois flee and warn the U.S. military, just as Zod orders an invasion.\n\nGiven the codename \"Superman\", Clark destroys the terraforming platform, while his human allies launch a suicide attack, killing Zod's troops. Vowing to eradicate humanity himself, Zod fights Superman, and the two eventually crash into a train station. Zod turns his own heat vision on a group of passengers, which forces Superman to kill him.\n\nSuperman persuades the government to let him act independently, so long as he does not turn against humanity. To allow access to dangerous situations without attracting attention, Clark takes a job as a freelance reporter for the Daily Planet.",
  "synopsis": null
}