{
  "imdb_id": "tt3555534",
  "tmdb_id": "422999",
  "douban_id": null,
  "title": "The Singing Pond (2015)",
  "genres": [
    "Drama",
    "Family",
    "Musical"
  ],
  "country": "Sri Lanka",
  "version": [
    {
      "runtime": "120 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.8,
  "director": [
    {
      "id": "nm6312545",
      "name": "Indika Ferdinando"
    }
  ],
  "writer": [
    {
      "id": "nm6312545",
      "name": "Indika Ferdinando",
      "description": "story"
    },
    {
      "id": "nm6312545",
      "name": "Indika Ferdinando",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm1256745",
      "name": "Jagath Chamila",
      "character": "Uma's boyfriend"
    },
    {
      "id": "nm1413394",
      "name": "Jayani Senanayake",
      "character": "Ukku's Mother"
    },
    {
      "id": "nm2932346",
      "name": "Dayadewa Edirisinghe",
      "character": "Gramasevaka"
    },
    {
      "id": "nm9408069",
      "name": "Hyacinth Wijeratne",
      "character": "School principa'ls Wife"
    },
    {
      "id": "nm9408070",
      "name": "Anjali Wickramasinghe",
      "character": "Upuli"
    },
    {
      "id": "nm9408071",
      "name": "Thishakya Kumaratunga",
      "character": "Ukku"
    },
    {
      "id": "nm5944789",
      "name": "Lucien Bulathsinhala",
      "character": "School Principal"
    },
    {
      "id": "nm2156908",
      "name": "Jayalath Manoratne",
      "character": "Bus Driver"
    },
    {
      "id": "nm6312542",
      "name": "Anasuya Subasinghe",
      "character": "Teacher"
    },
    {
      "id": "nm5824855",
      "name": "Ama Wijesekara",
      "character": ""
    }
  ],
  "overview": "A new teacher, Uma (Anasuya Subasinghe), arrives at a school with her first appointment in a remote village near Dambulla in Sri Lanka. The school has few students, with only the principal (Lucian Bulathsinghala) and Uma as the teacher. With the help of Uma the pupils gradually start to dream of bigger things than they ever imagined.  One day Upuli, a blind girl, shares her unseen dream with school friends Sukiri and Ukkun. It gradually becomes the dream throughout the village. The children and Uma encounter perils in their venture to realise this dream. The children of the school start to focus on something they have never seen before. This target gives rise to a small revolution.",
  "storyline": "One day, a new teacher, Uma, arrives at a primary school in a remote little village in Sri Lanka. With Uma's help, her little pupils learn not to be afraid of dreaming big. One morning, little Upuli, who is blind, shares her unseen dream with her friends. It becomes the unseen dream, not only in the eyes of the little ones, but also in the eyes of the entire village. The perils that the children and Uma encounter in their venture to realize this dream, and their determination to triumph, is portrayed through the innocence of childhood and the harsh reality of village life. This single dream gives rise to a little revolution, stirring up the quiet village, as it has never experienced before.",
  "plot": null,
  "synopsis": null
}