{
  "imdb_id": "tt3503460",
  "tmdb_id": "358644",
  "douban_id": null,
  "title": "Embers (2015)",
  "genres": [
    "Drama",
    "Sci-Fi"
  ],
  "country": "Poland",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.3,
  "director": [
    {
      "id": "nm1452752",
      "name": "Claire Carré"
    }
  ],
  "writer": [
    {
      "id": "nm1116340",
      "name": "Charles Spano",
      "description": "written by &"
    },
    {
      "id": "nm1452752",
      "name": "Claire Carré",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0728762",
      "name": "Jason Ritter",
      "character": "Guy"
    },
    {
      "id": "nm2147605",
      "name": "Iva Gocheva",
      "character": "Girl"
    },
    {
      "id": "nm3036925",
      "name": "Greta Fernández",
      "character": "Miranda"
    },
    {
      "id": "nm0806613",
      "name": "Tucker Smallwood",
      "character": "Teacher"
    },
    {
      "id": "nm3194762",
      "name": "Karl Glusman",
      "character": "Chaos"
    },
    {
      "id": "nm5959123",
      "name": "Silvan Friedman",
      "character": "Boy"
    },
    {
      "id": "nm3210935",
      "name": "Roberto Cots",
      "character": "Father"
    },
    {
      "id": "nm0000663",
      "name": "Dominique Swain",
      "character": "Woman in the Long Dress"
    },
    {
      "id": "nm2693382",
      "name": "Matthew Goulish",
      "character": "Guardian"
    },
    {
      "id": "nm2623692",
      "name": "Kirsten Kairos",
      "character": "Computer"
    },
    {
      "id": "nm7053372",
      "name": "Arianna Messner",
      "character": "Running Girl"
    },
    {
      "id": "nm3809777",
      "name": "Ryan Czerwonko",
      "character": "Man In the Parka"
    },
    {
      "id": "nm7156015",
      "name": "Nathaniel Andrew",
      "character": "Man with the Flare"
    },
    {
      "id": "nm1568438",
      "name": "Derrick Aguis",
      "character": "Man With the Pipe"
    },
    {
      "id": "nm2535266",
      "name": "Sundance",
      "character": "Horse"
    },
    {
      "id": "nm5493505",
      "name": "Brandon Bowens",
      "character": "Survivor"
    },
    {
      "id": "nm6739982",
      "name": "Janice Culver",
      "character": "Survivor"
    }
  ],
  "overview": "After a global neurological epidemic, those who remain search for meaning and connection in a world without memory. Five interwoven stories each explore a different facet of life without memory in a future that has no past.",
  "storyline": "In a dystopian future, an unidentified virus has caused a neurological disease of global proportions, decimating the majority of the earth's population. Little by little, as we observe the lives of a handful of survivors who still remain relatively unharmed by this illness, we understand their struggle to hopelessly attach to their former way of life, where even the simplest of affairs require great effort to be accomplished. Ultimately, as the last remaining souls suffer from varying degrees of memory loss, the urgent and paramount need to move forward with their lives will become an arduous task and a fierce battle with the inevitable.",
  "plot": "Rhea Woodley (Constance Crawley) and her husband Martin (Arthur Maude) have a baby, but the child dies soon after birth, and Rhea's doctor tells her that she cannot risk another pregnancy. Devastated, Rhea becomes withdrawn, and Martin, who is continuing to live an active life, begins to show interest in Rhea's lively cousin Maysie Stafford (Nell Franzen). Wesley Strange (William Carroll), a former suitor of Rhea's, shows up unexpectedly, and when he observes Martin and Maysie flirting, he tells Rhea about it, hoping to drive the Woodleys apart. Rhea still loves Martin, but she fears that she can now no longer meet his needs, so she offers him a divorce, hoping that he can find happiness with her cousin. However, Martin still loves Rhea and declines her offer. Desperate to make Martin happy, Rhea next arranges for him to catch her faking a fondness for Wesley. Taken in by the ruse, Martin finally agrees to a divorce. Maysie then moves in to take over Martin's household, and Rhea, instead of taking up with Wesley, moves to a sanitarium, where she falls deeper and deeper into depression. Realizing that Rhea is fast losing the will to live, her doctor finds her an orphaned infant to care for, and the baby gives Rhea new meaning to her life. Martin meanwhile stumbles across Rhea's diary at his house and learns from it that she never really cared for Wesley Strange and that when he saw them together it was all a ruse to get him to agree to a divorce. He rushes to the sanitarium to be by Rhea's side, and when he finds her with the baby, the couple reconcile when they realize that they still love each other.",
  "synopsis": null
}