{
  "imdb_id": "tt3550902",
  "tmdb_id": "346079",
  "douban_id": null,
  "title": "6 Ways to Die (2015)",
  "genres": [
    "Crime",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "103 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.1,
  "director": [
    {
      "id": "nm3279528",
      "name": "Nadeem Soumah"
    }
  ],
  "writer": [
    {
      "id": "nm3279528",
      "name": "Nadeem Soumah",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0005068",
      "name": "Vinnie Jones",
      "character": "John Doe"
    },
    {
      "id": "nm0000407",
      "name": "Vivica A. Fox",
      "character": "Veronica Smith"
    },
    {
      "id": "nm0000663",
      "name": "Dominique Swain",
      "character": "Steph Garcia"
    },
    {
      "id": "nm0000499",
      "name": "Bai Ling",
      "character": "June Lee"
    },
    {
      "id": "nm7023408",
      "name": "Richard Amezcua",
      "character": "Himself - Cartel Bodyguard       (archive footage) (credit only)"
    },
    {
      "id": "nm0910561",
      "name": "Michael Rene Walton",
      "character": "Sonny 'Sundown' Garcia"
    },
    {
      "id": "nm0001744",
      "name": "Tom Sizemore",
      "character": "Mike Jones"
    },
    {
      "id": "nm1507804",
      "name": "Luis Fernandez-Gil",
      "character": "El Jefe"
    },
    {
      "id": "nm2213461",
      "name": "Chris Jai Alex",
      "character": "Frank Casper"
    },
    {
      "id": "nm1352774",
      "name": "Jose Rosete",
      "character": "Marcus"
    },
    {
      "id": "nm0781728",
      "name": "Melissa Mars",
      "character": "Olivia"
    },
    {
      "id": "nm2164099",
      "name": "Jeff Galfer",
      "character": "Hunter"
    },
    {
      "id": "nm5251840",
      "name": "Marco Silvestri",
      "character": "Teenage John Doe"
    },
    {
      "id": "nm5117164",
      "name": "Vinny Silva",
      "character": "Teenage Sundown"
    },
    {
      "id": "nm3418803",
      "name": "Sandra Valladares",
      "character": "Teenage Sophia"
    },
    {
      "id": "nm5826962",
      "name": "Nicholas Small",
      "character": "Ten Year Old John Doe"
    },
    {
      "id": "nm6307257",
      "name": "Hailey Makae Pratti",
      "character": "Ten Year Old Sophia"
    },
    {
      "id": "nm1036787",
      "name": "Kinga Philipps",
      "character": "Agent Carter"
    },
    {
      "id": "nm0229930",
      "name": "Peter Dobson",
      "character": "Detective Wilcox"
    },
    {
      "id": "nm2457729",
      "name": "David Villada",
      "character": "Camacho"
    },
    {
      "id": "nm4157844",
      "name": "David Saucedo",
      "character": "Rosco"
    },
    {
      "id": "nm6019128",
      "name": "Alejandro Barrios",
      "character": "Camron"
    },
    {
      "id": "nm0813954",
      "name": "David Sommer",
      "character": "Tyler"
    },
    {
      "id": "nm5048661",
      "name": "Serag Mohamed",
      "character": "Agent Franco"
    },
    {
      "id": "nm0625194",
      "name": "Brad Nelson",
      "character": "Marco"
    },
    {
      "id": "nm4402732",
      "name": "Justin Bigelli",
      "character": "Drug Dealer 1"
    },
    {
      "id": "nm2728709",
      "name": "Chris Serafin",
      "character": "Drug Dealer 2"
    },
    {
      "id": "nm6249158",
      "name": "Gene Freeman",
      "character": "Drug Dealer 3"
    },
    {
      "id": "nm0817647",
      "name": "Scott Speiser",
      "character": "Rob"
    },
    {
      "id": "nm3840420",
      "name": "Jamie Miller",
      "character": "Chelsea"
    },
    {
      "id": "nm5761449",
      "name": "Tommy Gunns",
      "character": "John Doe's Father"
    },
    {
      "id": "nm5927132",
      "name": "America Del Sol",
      "character": "Sophia's Mother"
    },
    {
      "id": "nm3547393",
      "name": "Eric Pierce",
      "character": "John"
    },
    {
      "id": "nm5767294",
      "name": "Brandon Menald",
      "character": "Ricky"
    },
    {
      "id": "nm3839258",
      "name": "Kate Boyer",
      "character": "Sara Plummer"
    },
    {
      "id": "nm5535500",
      "name": "Prince Shah",
      "character": "Sundown Enforcer 1"
    },
    {
      "id": "nm4689598",
      "name": "Huseyin Kurtuldu",
      "character": "Sundown Enforcer 6"
    },
    {
      "id": "nm2789241",
      "name": "Ido Mor",
      "character": "Arab Mobster 1       (voice)"
    },
    {
      "id": "nm1594495",
      "name": "Hugh Mun",
      "character": "Khaled       (voice)"
    },
    {
      "id": "nm3223554",
      "name": "Robert Rexx",
      "character": "Mexico Thug"
    },
    {
      "id": "nm3889901",
      "name": "Hamid Savalanpour",
      "character": "Bartender"
    },
    {
      "id": "nm5913829",
      "name": "Ivana Villada",
      "character": "Pool Guest       (as Ivana Radetich)"
    }
  ],
  "overview": "Sonny \"Sundown\" Garcia is the top cocaine distributor in the United States, which has made him a very rich and powerful man. It has also made him plenty of enemies. John Doe is just such a man. A nameless man of mystery, John lives to see Sundown not just dead, but to suffer six meaningful losses before his death—his fortune, his freedom, his love, his reputation, his most valuable possession and, finally, his life. John hires six hit-men, each one assigned to inflict one of the six meaningful losses upon Sundown.",
  "storyline": "Sonny \"Sundown\" Garcia is the top North American narcotics distributor for the Colombian cartels. He has created the most efficient and productive distribution pipeline since the era of the Cocaine Cowboys. John Doe is a man of mystery. His identity and history are unknown. All we know is that he wants Sundown dead and six feet under. But before he does so, he wants to make Sundown feel every thing that he felt, suffer every thing that he suffered and lose everything that he lost. To exact his revenge, John Doe hires 6 contractors from the criminal underworld with individual specialties, to execute his plan. John wants 6 things taken from Sundown: his freedom, his love, his reputation, his most valuable possession, his money and finally, his life. Sundown's life is quickly and efficiently turned to a living hell. His bank account is wiped clean. His wife disappears. His loyalties are put to the test. Systematically, Sundown's entire life is being wiped out, ending with his successful ...",
  "plot": "In 1882, in the town of Old Stump, Arizona, a cowardly sheep farmer named Albert Stark (Seth MacFarlane) is dumped by his girlfriend Louise (Amanda Seyfried) as a result of his withdrawal from a gunfight. He prepares to leave for San Francisco, believing that the frontier offers nothing for him. Meanwhile, infamous outlaw Clinch Leatherwood (Liam Neeson) robs and kills an old prospector (Matt Clark) for a gold nugget. He orders his right-hand man Lewis (Evan Jones) to escort his wife Anna (Charlize Theron) to Old Stump to lie low while he continues his banditry. Lewis and Anna arrive in Old Stump under the guise of two siblings intending to build a farm, but Lewis is arrested after shooting the Pastor's (John Aylward) son (Dylan Kenin) in a saloon. During the ensuing fight, Albert saves Anna from being crushed to death by two of the brawlers, and the two become close friends. They attend a county fair where Louise's new boyfriend, the haughty Foy (Neil Patrick Harris), challenges Albert to a shooting contest. Albert is defeated, but Anna steps in and defeats Foy. Foy mocks Albert, who angrily challenges Foy to a duel in a week's time. Anna then spends the week teaching Albert how to shoot.\n\nDuring a barn dance the night before the duel, Anna slips Foy a Mickey. After leaving the dance, Albert and Anna kiss before heading home. Upon breaking out of jail and murdering the sheriff, Lewis witnesses the kiss and reports it to Clinch. On the day of the duel, Foy arrives late and goes into convulsions from the laxative he had unknowingly drunk. Albert, who has decided that Louise is not worth fighting for, once again forfeits the duel. He retires to the saloon, but Clinch arrives and demands to know who kissed his wife. When no one comes forward, Clinch shoots a nearby cowboy (Ryan Reynolds). He reveals that Anna is his wife and threatens to continue killing unless his wife's lover duels him at noon the next day. Clinch later forces Anna to reveal Albert's name and then prepares to have sex with her, but she knocks him unconscious and escapes.\n\nAnna returns to Albert's farm, where he angrily shouts at her for lying to him. Clinch pursues Anna to the farm; Albert helps her escape, then escapes himself. While fleeing, he is captured by a tribe of Apache Indians, who threaten to burn him alive. The Indians spare him when he reveals that he can speak their language. They give him a bowl of peyote, which sends him flashing back to his birth and through painful events of his childhood before making him realize that he loves Anna. Meanwhile, Clinch recaptures Anna in town, in front of Edward's (Giovanni Ribisi) house. Albert returns to Old Stump and confronts Clinch. He wounds Clinch with a bullet poisoned with rattlesnake venom before his own gun is shot out of his hand, but he manages to stall until Clinch fatally succumbs to the poison. Louise attempts to win back Albert, but he rejects her and instead happily enters a relationship with Anna. Albert also receives a bounty for killing Clinch and uses the money to buy more sheep.\n\nLater at the Fair, the proprietor of a racially charged shooting game called \"Runaway Slave\" asks who would like to take a shot. Django (Jamie Foxx) steps up and shoots the man while commenting that \"people die at the fair\".",
  "synopsis": null
}