{
  "imdb_id": "tt3544112",
  "tmdb_id": "369557",
  "douban_id": null,
  "title": "Sing Street (2016)",
  "genres": [
    "Comedy",
    "Drama",
    "Music",
    "Romance"
  ],
  "country": "Ireland",
  "version": [
    {
      "runtime": "106 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.0,
  "director": [
    {
      "id": "nm0138809",
      "name": "John Carney"
    }
  ],
  "writer": [
    {
      "id": "nm0138809",
      "name": "John Carney",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm6916321",
      "name": "Ferdia Walsh-Peelo",
      "character": "Conor"
    },
    {
      "id": "nm5801651",
      "name": "Kelly Thornton",
      "character": "Ann"
    },
    {
      "id": "nm0448204",
      "name": "Maria Doyle Kennedy",
      "character": "Penny"
    },
    {
      "id": "nm2930503",
      "name": "Jack Reynor",
      "character": "Brendan"
    },
    {
      "id": "nm0318821",
      "name": "Aidan Gillen",
      "character": "Robert"
    },
    {
      "id": "nm2498053",
      "name": "Ian Kenny",
      "character": "Barry"
    },
    {
      "id": "nm7860900",
      "name": "Ben Carolan",
      "character": "Darren"
    },
    {
      "id": "nm7860901",
      "name": "Percy Chamburuka",
      "character": "Ngig"
    },
    {
      "id": "nm7603308",
      "name": "Mark McKenna",
      "character": "Eamon"
    },
    {
      "id": "nm0943614",
      "name": "Don Wycherley",
      "character": "Brother Baxter"
    },
    {
      "id": "nm0449048",
      "name": "Des Keogh",
      "character": "Brother Barnabas"
    },
    {
      "id": "nm3912874",
      "name": "Kian Murphy",
      "character": "Mick Mahon"
    },
    {
      "id": "nm4860644",
      "name": "Dolores Mullally",
      "character": "Dinner Lady"
    },
    {
      "id": "nm2377903",
      "name": "Lucy Boynton",
      "character": "Raphina"
    },
    {
      "id": "nm0687692",
      "name": "Marcella Plunkett",
      "character": "Eamon's Mum"
    },
    {
      "id": "nm8302510",
      "name": "Vera Nwabuwe",
      "character": "Ngig's Mum"
    },
    {
      "id": "nm7874348",
      "name": "Conor Hamilton",
      "character": "Larry"
    },
    {
      "id": "nm4625381",
      "name": "Karl Rice",
      "character": "Garry"
    },
    {
      "id": "nm6874698",
      "name": "Tony Doyle",
      "character": "Wayne"
    },
    {
      "id": "nm0568362",
      "name": "Keith McErlean",
      "character": "Barry's Dad"
    },
    {
      "id": "nm4113743",
      "name": "Peter Campion",
      "character": "Evan"
    },
    {
      "id": "nm5322546",
      "name": "Lydia McGuinness",
      "character": "Miss Dunne"
    },
    {
      "id": "nm4969183",
      "name": "Kyle Bradley Donaldson",
      "character": "5th Former"
    },
    {
      "id": "nm8302511",
      "name": "Paul Gibbons",
      "character": "Exam Supervisor"
    },
    {
      "id": "nm4956846",
      "name": "Eva-Jane Gaffney",
      "character": "Jacinta"
    },
    {
      "id": "nm0736237",
      "name": "Paul Roe",
      "character": "Surveyor"
    }
  ],
  "overview": "A boy growing up in Dublin during the 1980s escapes his strained family life by starting a band to impress the mysterious girl he likes.",
  "storyline": "This is the beginning of the eighties, and everybody is moving to the beat of the Pop music, as the brand-new concept of the music video appears on television for the first time. However, in Dublin, Conor--a teenager with a sensitive heart--is trying to deal with a tense family relationship, reconnect with his older brother, while dealing with the hostile environment in his new public school. And then, one day, he sees her. Tall, with long chestnut hair, a buttery complexion, and big, dark eyes; an enigmatically beautiful girl standing in front of his school's gate, indolently observing people passing by. But, who is she, and how could a boy ever get noticed by such a distant girl? That's easy. He would form a band. Surprisingly, with every lyric Conor writes, the gap narrows, and with every song he plays, her heart fills with affection. In the end, before a sea of opportunities lying ahead of them, what will the future hold for a brave love like this?",
  "plot": "In south inner-city Dublin in 1985, Robert Lawlor (Aidan Gillen) is struggling with his architecture practice and his marriage, and drinks and smokes to excess. At a family meeting, he announces that in order to save money he is taking his youngest son Conor (Ferdia Walsh-Peelo) out of his expensive fee-paying school and moving him to a free state-school, Synge Street CBS, which Robert asserts is of equally high repute. Conor's elder brother Brendan (Jack Reynor) ribs him about the change as well as about the state of the family unit.\n\nConor appears in school on the first day in his new uniform, but without the regulation black shoes. The school principal Br. Baxter (Don Wycherley), takes him to task for this despite Conor’s pleas of being unable to afford new black shoes, eventually forcing him to complete the day shoeless. The shoe problem is resolved by painting the shoes black using paint from the art room. An encounter with the school bully, Barry (Ian Kenny) introduces Conor to Darren (Ben Carolan), an ally and budding entrepreneur. When Conor tells the beautiful aspiring model, Raphina (Lucy Boynton), in order to impress her, that he needs a model for a music video his band is making, Darren agrees to manage the outfit and introduces him to multi-instrumentalist Eamon (Mark McKenna )\n\nThe band practise in Eamon's living room, playing a bunch of 1980s covers. Conor however has a sibling-induced epiphany when Brendan encourages him to drop the covers and develop the band's own style. He begins writing original songs with Eamon. The band film their first music video for their song \"The Riddle of the Model\", wearing a motley assortment of often comical costumes, with Raphina acting as ingenue and makeup artist. Raphina gives Conor the name \"Cosmo\", which she says is more in keeping with his new band's image and the band continues to write and record new songs. After spending the day filming a music video for a new song, Conor and Raphina kiss and exchange confidences. Conor also manages to stand up to Barry by pointing out the insignificance of his life as well as his own, which greatly upsets Barry.\n\nAt home Robert and Penny (Maria Doyle Kennedy)'s marriage is falling apart, while Raphina and Cosmo's relationship blossoms. Cosmo takes Raphina out to Dalkey Island in his granddad's motor cruiser. Here they view the car ferry leaving Dún Laoghaire for Britain and discuss Raphina's dream of leaving Ireland for London.\n\nCosmo, Raphina, and the band then prepare to film a \"Back to the Future\" inspired music video for their new song, \"Drive It Like You Stole It,\" but Cosmo is disheartened when Raphina fails to show up. Later, she reveals that she was set to leave for London with her boyfriend that day, but he abandoned her. Deeply hurt by her lack of disclosure and becoming even more offended by her nonchalance, Cosmo breaks up with Raphina. Because of the break-up, along with his family's problems, Cosmo finds difficulty in writing or playing music, but Brendan urges Cosmo to carry on so that at least he can escape his small-town doldrums and make a better future for himself. An opportunity arises for the band to play live at an end of year party at school. Cosmo manages to strike a friendship with Barry, offering him the chance to be the band's roadie and escape the physically and emotionally abusive relationship he has with his alcoholic father, which he accepts.\n\nCosmo prepares a new song, \"Brown Shoes,\" mocking Baxter, which the band perform as an encore while distributing homemade masks of Baxter’s face. Raphina arrives before the band finishes their song and reconciles with Cosmo, and both of them leave the party and the school in uproar. After secretly saying his goodbyes to his family later that night, Cosmo and Raphina persuade Brendan to drive them to Dalkey so they can escape in the motor cruiser and head to London. Brendan agrees and drives them to the harbour, where Brendan and Cosmo exchange an emotional embrace. Cosmo and Raphina sail out to sea, following the ferry across the rough Irish Sea to a new life in London. Brendan watches them disappear into the distance and cheers, overjoyed that his younger brother has left to go on to greater things.\nDedication\n\nThe film's closing titles include the dedication \"For brothers everywhere\".",
  "synopsis": "Set in Dublin, Ireland in the year 1985, 15-year-old Conor Lalor (Ferdia Walsh-Peelo) is in his bedroom strumming his guitar. He overhears his parents Robert (Aiden Gillen) and Penny (Maria Doyle Kennedy) arguing, which he mimics in his song lyrics.Conor joins his parents and siblings Brendan (Jack Reynor) and Ann (Kelly Thornton) down in the kitchen for a family meeting. Due to recent financial struggles, Robert announces that he and Penny are putting Conor in a free state school as opposed to paying for his current school. Brendan, a dropout/stoner, makes snarky comments regarding the situation.Conor begins his new term at Synge Street CBS. He meets the school's principal, Brother Baxter (Don Wycherley), who tells him they have a strict black shoe policy, and Conor only owns brown ones. Conor later comes across the local bully Barry (Ian Kelly), who holds a slingshot at his face in the bathroom and forces him to dance. When he tells Conor to dance in his underwear, Conor refuses. During lunch, Conor buys a chocolate bar and gets it taken by Barry, who punches Conor in the eye. This leads to Conor meeting Darren (Ben Carolan).As the two leave school, Conor spots a pretty girl across the street. Darren says she has no interest in any of the boys at school. Conor approaches her to say hello and introduces himself. She introduces herself as Raphina (Lucy Boynton), and she says she's a model. Conor asks her to be in a video for his band. Raphina asks him to sing a song. Not knowing anything, he sings two bars from \"Take On Me\" by a-Ha. Raphina agrees to be in the video. Conor then runs back to Darren and says they need to form a band.Darren takes Conor to meet Eamon (Mark McKenna), a kid who is skilled at most instruments, but he settles on playing the bass guitar. Next, the boys recruit Ngig (Percy Chamburuka) to play the keyboard. Two more kids, Larry (Conor Hamilton) and Garry (Karl Rice), round out the band. Darren acts as the band's manager. They decide to call themselves \"Sing Street\". They first start by playing a cover of Duran Duran's \"Rio\". Conor plays it for Brendan, who says it's crap. He encourages his brother to write original songs to find their own style.Inspired, Conor (with help from Eamon) writes the band's first original song, \"The Riddle of the Model\", which is obviously inspired by Raphina. He records a demo and gives a tape to Raphina so she knows what to expect for the video. The band later gathers to shoot the video for the song, with Raphina arriving to do make-up for the boys. Barry and his dad pass them, with the dad joking that Barry should join the band. When he tells his dad to piss off, he gets smacked in the face. After the shoot, Conor gives Raphina a ride home on his bike. He learns that she is seeing an adult man, and she lives at a home for girls since her parents are out of the picture.Conor wears make-up to school and dyes the front of his hair blonde. Brother Baxter tells him to take the make-up off in his personal bathroom. When Conor leaves his office, Baxter grabs him and pulls him into the bathroom and violently washes the make-up off the boy.After school, Conor meets up with Raphina and the boys to make another video for their song \"A Beautiful Sea\". Raphina also decides to call Conor \"Cosmo\" to fit with the band. The gang heads by the ocean for the shoot. Cosmo tells Raphina to pretend to jump into the water, but she does it for real, and he jumps after her when she says she can't swim. He then kisses her for the first time.As Cosmo spends more time with Raphina, he learns that her dad died in a car accident, and her mom has been in and out of the local mental hospital for manic depression. She convinces Cosmo to lead his life as \"happy-sad\", meaning that it's okay to accept the \"shittiness\" in the world and go on with life and make art. Cosmo takes this philosophy to school when Barry threatens him again, but Cosmo coolly brushes him off and heads to class.Cosmo, Darren, and Eamon see a sign at school for a dance where they can play a gig with the band. The boys all agree, and they get to rehearsing while also preparing for their midterms.Cosmo goes to find Raphina and asks her to join him on an adventure. They take his grandfather's motorboat to Dalkey Island where they share tea and cookies. They spot the ferry headed to England. Cosmo then kisses Raphina again.At home, Robert and Penny announce that they are splitting up, as Penny has fallen in love with her boss, citing Robert's neglect as a husband as one reason. She will be moving in with the boss, while Robert says he will get himself an apartment. Although it was expected, Brendan doesn't take the news well, telling Cosmo that he used to have ambitions to be someone, but has now resigned himself to being a stoner. He smashes his record player in anger.The band practices the video for their song \"Drive It Like You Stole It\" at the gym in school. Cosmo looks for Raphina to show up, but she never does. In Cosmo's head, he imagines the video going like an American prom night with a 50's theme (like in the film \"Back to the Future\"). All the students are dancing, and Raphina shows up. Baxter does backflips across the floor. Robert and Penny show up, happily dancing and still in love. Brendan shows up with a neat haircut and tidy clothes. But the song ends, and Raphina still hasn't shown up.Cosmo goes to the girls home to look for Raphina, but he is told by one of her housemates that she left the previous night for London with her boyfriend. Not long after, Cosmo spots Raphina returning to the home with a bruise on her cheek. The two go to the park where Raphina says that she left her boyfriend and he struck her, but she claims she deserved it. When she states that she might as well just work at a McDonald's and how she is just like her mother (no ambitions, hanging out with a schoolboy), Cosmo leaves her alone.The night of the dance arrives, and the band wins over the students. They have even got Barry to be their roadie. They play a great show until Cosmo says they will play a slow song. Most of the other students head to the back of the gym, but the couples dance together. For their final song, the band plays \"Brown Shoes\", which is for people like Baxter and all the other bullies the kids encounter. Cosmo hands out masks of Baxter's face to the other students. Raphina shows up as the band is playing the song to an excited crowd. Cosmo joins Raphina after the show.The two run home to Brendan and convince him to drive them to their grandfather's boat so that Cosmo and Raphina can head out to London. Despite not knowing anyone, they will rely on Raphina's headshots and Cosmo's tapes and videos to get them some work. Brendan agrees to drive them there. Before leaving, Cosmo goes into his parents' room. Robert is sleeping on the floor. Cosmo tells his sleeping mother goodbye and that he loves her.The three arrive by the ocean. Brendan says goodbye to his brother and tells Raphina to take care of him. As they leave, Brendan watches them ride away and cheers them on. It starts pouring rain, but the two manage to come across the ferry to England. With that, they proceed to follow it."
}