{
  "imdb_id": "tt3552042",
  "tmdb_id": "366764",
  "douban_id": null,
  "title": "Showboy (2014)",
  "genres": [
    "Short",
    "Drama"
  ],
  "country": "Australia",
  "version": [
    {
      "runtime": "15 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.3,
  "director": [
    {
      "id": "nm4638573",
      "name": "Samuel Leighton-Dore"
    }
  ],
  "writer": [
    {
      "id": "nm4638573",
      "name": "Samuel Leighton-Dore",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm4235904",
      "name": "Lucas Pittaway",
      "character": "Julian Maxwell"
    },
    {
      "id": "nm0447848",
      "name": "Malcolm Kennard",
      "character": "Rob Maxwell       (as Mal Kennard)"
    },
    {
      "id": "nm6308579",
      "name": "Richie Finger",
      "character": "Madame Clitora"
    },
    {
      "id": "nm5207695",
      "name": "Stephanie King",
      "character": "Poppy"
    },
    {
      "id": "nm2098046",
      "name": "Matt Levett",
      "character": "Asher"
    },
    {
      "id": "nm4515374",
      "name": "Airlie Dodds",
      "character": "Girl"
    },
    {
      "id": "nm6780145",
      "name": "JayR Tinaco",
      "character": "Drag Queen"
    }
  ],
  "overview": "After the unexpected death of his mother, a young football player, Julian Maxwell, finds himself struggling to support his depressed, unemployed father while fighting to keep safe the secret he once shared with his mother: He's not only gay, but performs drag shows. SHOWBOY is a film about family, loss and the exploration of freedom and sexuality in the face of affliction.",
  "storyline": "After the unexpected death of his mother, a young football player, Julian Maxwell, finds himself struggling to support his depressed, unemployed father while fighting to keep safe the secret he once shared with his mother: He's not only gay, but performs drag shows. SHOWBOY is a film about family, loss and the exploration of freedom and sexuality in the face of affliction.",
  "plot": "In 1951, in Belleville, New Jersey, Tommy DeVito, narrating the story, introduces the audience to himself, Tommy's brother Nicky, and their friend Nick Massi, who perform together as The Variety Trio, and to a barber's son, 16-year-old Frankie Castelluccio, already well known in the neighborhood for his singing voice. Frankie has the admiration of Genovese Family mobster Angelo \"Gyp\" DeCarlo, who takes a personal interest in him.\n\nOne night, the group attempts a robbery of a safe, for which the police later arrest them. In court, Frankie is let off with a warning but Tommy is sentenced to six months in prison. After his release, Tommy reunites the group and adds Frankie as lead singer. Frankie changes his professional name to Frankie Vally, and then Frankie Valli. At a performance, Frankie is entranced by a woman named Mary Delgado. He takes her to dinner, and they are soon married.\n\nThe group, now called \"The Four Lovers,\" is in need of a songwriter after Nicky leaves. Tommy's friend Joe Pesci tells him about a talented singer-songwriter, Bob Gaudio, and invites him to hear the group perform. Gaudio, now narrating, is impressed with Valli's vocals and agrees to join.\n\nThe band, having recorded several demos, attempts to attract interest, with little success. One day in New York City, producer Bob Crewe signs them to a contract. However, they quickly realize that it only allows them to perform back-up vocals for other acts (as The Romans and The Topix). Crewe says that the group does not have a distinctive image or sound yet. Inspired by a bowling alley sign, the guys rename themselves \"The Four Seasons,\" and sing a new song Gaudio has written, \"Sherry\", to Crewe, who agrees to record it.\n\n\"Sherry\" quickly becomes a commercial success, followed by two more, \"Big Girls Don't Cry\" and \"Walk Like a Man\". However, before an appearance on The Ed Sullivan Show, Valli is approached by mobster Norman Waxman, a loan shark for one of the other Five Families, who claims that Tommy owes him $150,000. Frankie goes to DeCarlo, who gets Waxman to allow the group to pay the debt, which turns out to be considerably larger. Tommy must go to work for the mob's associates in Las Vegas until it is paid. Nick, irritated by Tommy's irresponsibility, not being involved in the group's decisions, and never being able to see his family, also leaves the group.\n\nForced to tour constantly to pay the debt, the band hires a set of studio musicians and becomes Frankie Valli and the Four Seasons, with Gaudio now acting only as songwriter and producer. Valli learns from his now ex-wife Mary that his daughter, Francine, now a drug addict, has escaped from home. Valli tracks her down and regrets not acting as a better father for her when she was growing up. He also arranges for Gaudio to offer her singing lessons and for Crewe to cut a demo for her.\n\nA few years later, the group has finally paid off Tommy's debt. However, this coincides with the news of Francine's death by drug overdose. Frankie and Mary both grieve for their daughter. Gaudio composes a new number for Valli to sing, his first as a solo artist. Frankie is at first hesitant, as he is still in mourning, but eventually agrees. The piece, \"Can't Take My Eyes Off You\", becomes a commercial success.\n\nIn 1990, the original Four Seasons are to be inducted into the Rock and Roll Hall of Fame. The quartet performs \"Rag Doll\" onstage, their first performance together in over twenty years. The music fades as the four men take turns addressing the audience. Tommy, in an ironic twist, now works for Joe Pesci, who has gone on to become an Oscar-winning actor. Nick claims to have no regrets about leaving the group, enjoying the time he spends with his family. Bob has retired to Nashville, Tennessee. Lastly, Frankie finally takes over the narration, stating that the best time he had during his time with the Four Seasons was before their success, \"when everything was still ahead of us and it was just four guys singing under a street lamp.\"",
  "synopsis": null
}