{
  "imdb_id": "tt3521134",
  "tmdb_id": "267480",
  "douban_id": null,
  "title": "The Look of Silence (2014)",
  "genres": [
    "Documentary",
    "Biography",
    "History"
  ],
  "country": "Denmark",
  "version": [
    {
      "runtime": "103 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.3,
  "director": [
    {
      "id": "nm1484791",
      "name": "Joshua Oppenheimer"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm7851420",
      "name": "Adi Rukun",
      "character": "Himself, brother of murdered Ramli Rukun"
    },
    {
      "id": "nm7851425",
      "name": "M.Y. Basrun",
      "character": "Himself, former commander of a civilian militia"
    },
    {
      "id": "nm7851421",
      "name": "Amir Hasan",
      "character": "Himself, former leader of death squad       (archive footage)"
    },
    {
      "id": "nm7851422",
      "name": "Inong",
      "character": "Himself, former leader the village death squad"
    },
    {
      "id": "nm7851423",
      "name": "Kemat",
      "character": "Himself, survivor from Snake River massacre"
    },
    {
      "id": "nm1484791",
      "name": "Joshua Oppenheimer",
      "character": "Himself       (voice) (as Josh)"
    },
    {
      "id": "nm7851424",
      "name": "Amir Siahaan",
      "character": "Himself, former commander of Snake River death squads"
    },
    {
      "id": "nm1259617",
      "name": "Ted Yates",
      "character": "Himself, reporter, NBC News       (archive footage)"
    }
  ],
  "overview": "A family that survives the genocide in Indonesia confronts the men who killed one of their brothers.",
  "storyline": "An Indonesian man with a communist background named Ramli was brutally murdered when the \"Communist\" purge occurred in 1965. His remaining family members lived in fear and silence until the making of this documentary. Adi, a brother of his, decided to revisit the horrific incident and visited the men who were responsible for the killings and one survivor of the purge. These meetings uncovered sadistic details of the murders and exposed raw emotions and reactions of the killers' family members about what happened in the past - much to Adi's disappointment.",
  "plot": null,
  "synopsis": "Through Oppenheimers footage of perpetrators of the 1965 Indonesian genocide, a family of survivors discovers how their son was murdered, as well as the identities of the killers. The documentary focuses on the youngest son, an optometrist named Adi, who decides to break the suffocating spell of submission and terror by doing something unimaginable in a society where the murderers remain in power: he confronts the men who killed his brother and, while testing their eyesight, asks them to accept responsibility for their actions. This unprecedented film initiates and bears witness to the collapse of fifty years of silence."
}