{
  "imdb_id": "tt3544048",
  "tmdb_id": "267091",
  "douban_id": null,
  "title": "A Year in Champagne (2014)",
  "genres": [
    "Documentary"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "82 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm0447842",
      "name": "David Kennard"
    }
  ],
  "writer": [
    {
      "id": "nm0447842",
      "name": "David Kennard",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm10767539",
      "name": "Xavier Gonet",
      "character": "Champagne Maker"
    },
    {
      "id": "nm6299985",
      "name": "Martine Saunier",
      "character": ""
    }
  ],
  "overview": "The exploding cork. Endless tiny bubbles floating up and up in the glass. An indulgence. A celebration. A seduction. A triumph. This is the essence of Champagne, isn’t it?  But it’s not just bubbles in a glass that makes the wine, or the mystique. Only sparkling wine produced within the boundaries of the Champagne region is truly “Champagne.” At first glance, the region is not an obvious source of romance. Champagne’s history is grim and bloody, swept by war and destruction from Attila the Hun to the filthy trenches of WWI and the Nazi depredations of WWII. The environment for winemaking is desperately hard — northerly latitude, chalky soil, copious rain, frost, rot. Yet it’s these difficulties that help make the wine unique.",
  "storyline": "Renowned wine importer Martine Saunier returns as our guide in the second installment in a trilogy of wine films. Here we get a rare glimpse behind the scenes into the real Champagne through six houses, from small independent producers to the illustrious houses of Gosset and Bollinger. In the vineyard, 2012 threatened to be 'the year of all our fears.' But most Champagne is not just the product of a specific year and its weather. Signature house styles are creations that happen behind closed doors and in the miles of cellars beneath Champagne. Pull back the curtain and see how the people of a cold, tough land with a grim history triumph in producing the drink of joy, seduction and celebration.",
  "plot": null,
  "synopsis": null
}