{
  "imdb_id": "tt3500500",
  "tmdb_id": "273603",
  "douban_id": null,
  "title": "Threesome (2014)",
  "genres": [
    "Comedy",
    "Horror",
    "Romance"
  ],
  "country": "Thailand",
  "version": [
    {
      "runtime": "113 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm2565292",
      "name": "Tanwarin Sukkhapisit"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm6253274",
      "name": "Steven Foorer",
      "character": "Poel"
    },
    {
      "id": "nm2859946",
      "name": "Witwisit Hiranyawongkul",
      "character": ""
    },
    {
      "id": "nm5058727",
      "name": "Arpa Pawilai",
      "character": "Som"
    },
    {
      "id": "nm5444431",
      "name": "Chaiyapol Jullian Poupart",
      "character": "Hrang"
    },
    {
      "id": "nm1316012",
      "name": "Theeradanai Suwannahom",
      "character": ""
    },
    {
      "id": "nm5160415",
      "name": "Pawinee Wiriyachaikit",
      "character": ""
    }
  ],
  "overview": "Arpa Pawilai is appealingly cast as Som, an ordinary young woman who works as a movie make-up artist. Her longtime live-in boyfriend Rang (Chaiyapol Julien Poupart) is also in the business. But the handsome musclebound prop guy – always wearing tight, biceps-baring vest T-shirts – captures many adoring eyes, like that slutty actress, but also his straight-acting gay boss (Akarin Akaranithimethara) and just about anyone else with a pulse. Som has about had it with Rang being distracted by all the flirting. She's finally pushed to the brink when she arrives home to find him drunk and passed out in bed after being taken advantage of by the predatory Catwoman. She kicks Rang out and then goes to her apartment rooftop, which is of course the first place any heartbroken young woman should go. She stands at the precipice only to be held back at the last instant by a neighbor guy named Ple who's been hanging creepily around (Steven Fuhrer)...",
  "storyline": null,
  "plot": "Due to an administrative error two male college students, the shy and intellectual Eddy (Josh Charles) and the All-American jock Stuart (Stephen Baldwin), end up with a female roommate. The university thought that Alex (Lara Flynn Boyle) was a man (based on her name) and thus the three students are forced to live with each other until the university can move Alex to a female residence hall.\n\nAlex falls in love and tries unsuccessfully to seduce Eddy; Eddy falls in love with Stuart; and Stuart is in love with Alex. The trio become good friends and scare off anyone who tries to seduce the other. Eventually, Alex, Stuart and Eddy agree to have an actual threesome that seems to destroy the friendship, and raises the possibility that Alex might have become pregnant.\n\nAfter the threesome, they start to drift apart. Three weeks later the semester ends and Alex moves to an apartment and Eddy gets a single dorm. Eddy (who acts as the film's narrator) eventually finds a boyfriend, Stuart finds happiness in a monogamous relationship with a woman, and Alex remains single. While they now only see each other for lunch occasionally, they do not seem to regret the friendship they had while in college.",
  "synopsis": null
}