{
  "imdb_id": "tt3579082",
  "tmdb_id": "266723",
  "douban_id": null,
  "title": "Latitudes (2014)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "Brazil",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.3,
  "director": [
    {
      "id": "nm1806027",
      "name": "Felipe Braga"
    }
  ],
  "writer": [
    {
      "id": "nm1806027",
      "name": "Felipe Braga",
      "description": null
    },
    {
      "id": "nm4266178",
      "name": "Teodoro Poppovic",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0103797",
      "name": "Alice Braga",
      "character": "Olivia"
    },
    {
      "id": "nm0210655",
      "name": "Daniel de Oliveira",
      "character": "José"
    },
    {
      "id": "nm1280636",
      "name": "Michel Noher",
      "character": "Edoardo"
    },
    {
      "id": "nm2755731",
      "name": "Elisa Volpatto",
      "character": "Aline"
    }
  ],
  "overview": "Olívia, a fashion executive, and José, a photographer, gets together in Paris, having casual sex and talking a little about relationships. And, in some days, they meet again in another city. And another one. And another... Latitudes is a trip around the world, the love and the poem of living.",
  "storyline": "'Latitudes', a modern love story shot in 8 different countries, tells the story of Olivia (Alice Braga) and Jose (Daniel de Oliveira), two travellers who have one-night stands in legendary hotels every time they meet accidentally as they wander around the world on business trips. At first an idealised, secretive relationship by two jet-setters, the story becomes one of how to cope with all the real life challenges waiting for the two outside the hotel room.",
  "plot": "The film follows the encounters and separations of a couple, who are always in high standard hotels, train stations and airports in Latin America, Europe and Asia. In the movie, Alice Braga is Olivia, a fashion editor who travels the world searching for trends, and Daniel de Oliveira is José, a renowned photographer who travels the world doing editorials.",
  "synopsis": null
}