{
  "imdb_id": "tt3560492",
  "tmdb_id": "294651",
  "douban_id": null,
  "title": "Pale Moon (2014)",
  "genres": [
    "Drama"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "126 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.0,
  "director": [
    {
      "id": "nm2469894",
      "name": "Daihachi Yoshida"
    }
  ],
  "writer": [
    {
      "id": "nm1928599",
      "name": "Mitsuyo Kakuta",
      "description": "based on the novel by"
    },
    {
      "id": "nm4764567",
      "name": "Kaeko Hayafune",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0594533",
      "name": "Rie Miyazawa",
      "character": "Rika Umezawa"
    },
    {
      "id": "nm1257423",
      "name": "Sôsuke Ikematsu",
      "character": "(as Sosuke Ikematsu)"
    },
    {
      "id": "nm1728524",
      "name": "Juri Ihata",
      "character": "Bank co-worker"
    },
    {
      "id": "nm0410902",
      "name": "Renji Ishibashi",
      "character": ""
    },
    {
      "id": "nm0462050",
      "name": "Satomi Kobayashi",
      "character": ""
    },
    {
      "id": "nm0464912",
      "name": "Yoshimasa Kondô",
      "character": ""
    },
    {
      "id": "nm0848948",
      "name": "Seiichi Tanabe",
      "character": ""
    },
    {
      "id": "nm1328291",
      "name": "Mayumi Tenkô",
      "character": "Mitsuko Osanai"
    },
    {
      "id": "nm2623363",
      "name": "Yûko Ôshima",
      "character": "(as Yûko Ohshima)"
    }
  ],
  "overview": "Daily, Rika Umezawa battles a nagging sense of emptiness and dissatisfaction. She works a tiring job, comes home to an unappreciative husband and has little opportunity to enjoy life. But things change when office gossip about affairs and embezzlement inspire Rika to do the unthinkable. Soon, Rika finds herself filling the void with a university student named Kota and the millions entrusted to her by clients. Is her newfound lifestyle the key to happiness? And if so, how long can it last?",
  "storyline": "A mellow drama following the moral decline of a housewife turned bank employee who embezzles a fortune from her customers and indulges in an affair with a younger man. Set in 1994, shortly after the burst of Japan's economic bubble.",
  "plot": "Alan Ladd and Jean Arthur\nShane (Alan Ladd), a skilled, laconic gunfighter with a mysterious past, rides into an isolated valley in the sparsely settled state of Wyoming, some time after the Civil War. At dinner with local rancher Joe Starrett (Van Heflin) and his wife Marian (Jean Arthur), he learns that a war of intimidation is being waged on the valley's settlers. Though they have claimed their land legally under the Homestead Acts, a ruthless cattle baron, Rufus Ryker (Emile Meyer), has hired rogues and henchmen to harass them and drive them out of the valley. Starrett offers Shane a job, and he accepts.\n\nAt the town's general store, Shane and other homesteaders are loading up supplies. Shane enters the saloon adjacent to the store, where Ryker's men are drinking, and orders a soda pop for the Starretts' son, Joey (Brandon deWilde). Chris Calloway (Ben Johnson), one of Ryker's men, throws a shot of whiskey on Shane's shirt. \"Smell like a man!\" he taunts. Shane doesn't rise to the bait and leaves to the taunts of Ryker's men who believe that he is a coward. On the next trip to town Shane takes the empty bottle of soda pop that Joey was going to return to Grafton, the owner of the store and the adjacent saloon. Calloway again taunts Shane and provokes him. Finally, Shane orders two shots of whiskey, pours one on Calloway's shirt and throws the other in his face, then knocks him to the ground. A brawl ensues; Shane prevails, with Starrett's help. Ryker declares that the next time they meet, \"the air will be filled with gun smoke.\"\n\nJoey is drawn to Shane, and to his gun. Shane shows him how to wear a holster and demonstrates his shooting skills; but Marian interrupts the lesson. Guns, she says, are not going to be a part of her son's life. Shane counters that a gun is a tool, no better nor worse than a hoe or axe, and as good or bad as the man using it. Marian retorts that the valley would be better off if there weren't any guns in it—including Shane's.\n\nJack Wilson (Jack Palance), an unscrupulous gunfighter working for Ryker, deliberately provokes Frank \"Stonewall\" Torrey (Elisha Cook, Jr.), a hot-tempered ex-Confederate homesteader. \"Them rebs are all Southern trash,\" Wilson says. \"You're a low-down, lyin' Yankee,\" responds Torrey. \"Prove it,\" Wilson replies—and when the inexperienced farmer goes for his gun, shoots him dead. Fear spreads through the valley. At Torrey's funeral, there is talk of giving in to Ryker and moving on; but after they unite to fight a fire set by Ryker's men, the settlers find new determination and resolve to continue the fight against Ryker's evil ambitions.\n\nRyker invites Starrett to a meeting at the saloon to negotiate a settlement—and then orders Wilson to kill him when he arrives. Calloway, unable to tolerate Ryker's treachery any longer, warns Shane of the double-cross. Starrett says no matter, he will shoot it out with Wilson, and asks Shane to look after Marian and Joey if he dies. Shane says he must go instead, because Starrett is no match for Wilson in a gunfight. Starrett is adamant, and Shane is forced to knock him unconscious. A distraught Marian asks Shane why he is doing this. For her, he replies, and her husband and son, and all the other decent people who want a chance to live in peace in the valley.\n\nAs Shane rides to town, Joey follows him on foot. At the saloon, Shane tells Ryker he cannot prevail, because times have changed; cattle barons and gunfighters are both relics of the Old West. Then he turns to Wilson: \"I hear you're a low-down Yankee liar,\" he says. \"Prove it,\" replies Wilson, and draws. Shane beats him to the draw, then shoots Ryker too, as he draws a hidden gun. Before Ryker's brother Morgan, concealed in a dark balcony overhead, can shoot Shane in the back, Joey shouts a warning, and Shane kills Morgan as well.\n\nShane tells Joey to go home and tell his mother that the settlers have won, that there are no more guns in the valley. As Joey reaches out, blood drips onto his hands; Shane's left arm hangs limply at his side as he mounts his horse. In an iconic closing scene, Shane rides out of town, slumped forward in his saddle, ignoring Joey's desperate cries of \"Shane! Come back!\"",
  "synopsis": null
}