{
  "imdb_id": "tt3565264",
  "tmdb_id": "257423",
  "douban_id": null,
  "title": "Thegidi (2014)",
  "genres": [
    "Crime",
    "Mystery",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "126 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.8,
  "director": [
    {
      "id": "nm6322451",
      "name": "P. Ramesh"
    }
  ],
  "writer": [
    {
      "id": "nm6322451",
      "name": "P. Ramesh",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm5654463",
      "name": "Ashok Selvan",
      "character": "Vetri"
    },
    {
      "id": "nm3817633",
      "name": "Janani Iyer",
      "character": "Madhusree"
    },
    {
      "id": "nm1957308",
      "name": "V. Jayaprakash",
      "character": "Inspector Raghuram"
    },
    {
      "id": "nm3264948",
      "name": "Jayakumar",
      "character": "Sailesh"
    },
    {
      "id": "nm6106360",
      "name": "Kaali Venkat",
      "character": "Nambi       (as Kaali)"
    },
    {
      "id": "nm6332085",
      "name": "Pradeep K Vijayan",
      "character": "Sadagoppan       (as Pradeep Nair)"
    },
    {
      "id": "nm6340759",
      "name": "Rajan Iyer",
      "character": ""
    },
    {
      "id": "nm1688033",
      "name": "Kavithalaya Krishnan",
      "character": ""
    },
    {
      "id": "nm6340761",
      "name": "Sai Prashanth",
      "character": "Kamalakannan"
    },
    {
      "id": "nm6340762",
      "name": "Rekha Suresh",
      "character": "Rukmani"
    },
    {
      "id": "nm6340763",
      "name": "Shanu",
      "character": ""
    },
    {
      "id": "nm6340764",
      "name": "Ashrita",
      "character": "Vidhya"
    },
    {
      "id": "nm6340765",
      "name": "Soundar Rajan",
      "character": ""
    },
    {
      "id": "nm6106361",
      "name": "'Pizza' Venkatesh",
      "character": ""
    },
    {
      "id": "nm6340766",
      "name": "Sivakumar",
      "character": "Madhavan"
    },
    {
      "id": "nm6340767",
      "name": "'Winner' Ramachandran",
      "character": ""
    },
    {
      "id": "nm6340768",
      "name": "Saravanan",
      "character": "Sankaran"
    },
    {
      "id": "nm6340769",
      "name": "Pulipandi",
      "character": "Dileepan"
    },
    {
      "id": "nm6340770",
      "name": "Kumarasamy",
      "character": "Vetri's Father"
    },
    {
      "id": "nm6340771",
      "name": "Muthuraman",
      "character": ""
    },
    {
      "id": "nm6340772",
      "name": "Karuvayan",
      "character": ""
    }
  ],
  "overview": "Vettri joins a detective agency and is assigned a series of subjects to observe. He falls in love with Madhusree, one of his targets, and just when everything seems to be going fine, Vettri's subjects start dying mysteriously. Can he save Madhu before it is too late?",
  "storyline": "Vetri (Ashok Selvan) has a keen observational skill who after studying criminology joins a private detective agency in Chennai and his passion for work keeps him going till he meets a new \"subject\" Madhu (Janani Iyer). He starts liking her but realizes that she is in danger and now the hunter becomes the hunted.",
  "plot": "Vetri (Ashok Selvan) studies criminology course and possesses great observation skills, and this makes his professor Govardhan (Rajan Iyer) to insist him taking up a detective job. Vetri gets a job in a private detective agency and leaves to Chennai to meet his professor and get blessings. He joins the detective agency and his bosses are Sadagoppan (Pradeep Nair) and Sailesh (Jayakumar). Vetri stays with his close friend Nambi (Kaali Venkat).\n\nVetri is given a task of collecting information about a few people by following them secretly. He does his job with great passion and loves it to the maximum. Meanwhile, he meets Madhusree (Janani Iyer) and develops an attraction towards her immediately. Vetri gets all the information about the three guys assigned to him and submits the reports to his bosses.\n\nVetri’s next assignment is to gather information about Madhu. Vetri is excited on this and starts following her. Despite a rule that detectives are not allowed to get in touch with the persons they follow, Vetri is tempted to get introduced to Madhu. Vetri introduces himself as a jobseeker to Madhu and they become good friends. Slowly love blossoms between the two.\n\nSuddenly, one of the guys, about whom Vetri has gathered some information, is killed mysteriously. Vetri meets his bosses and request the client details of those who requested to follow him but they convince him giving some reasons. Similarly one more guy is also killed. Now Vetri’ doubts increase seeing the sequence of murders. Vetri calls up the third person he has followed before and wants to meet him. But the third person is also killed while he is on the way to meet Vetri.\n\nVetri worries fearing Madhu’s death as she was his next assignment and decides to protect her. Police while investigating finds that Vetri was the last person who called the third person before death and comes for investigation. Madhu gets shocked knowing that Vetri is a detective and thinks that he pretended as loving her to get some info.\n\nVetri meets inspector Raghuram (Jayaprakash) and informs all the happenings. Raghuram and Vetri try to visit the detective agency but are surprised to see that there is no such agency existing in the address. No one knows about the whereabouts of the detective agency and its founders.\n\nVetri thinks of any clue and remembers his bosses’ frequenly mentioning a name. He finds out that it is a hotel located in the outskirts of Chennai and decides to go there believing he could get some info. To his surprise, Sailesh comes to the hotel. Once Sailesh goes into the hotel, Vetri tries searching for any clues in the car and finds out a courier. Vetri notes down the address mentioned in the courier and runs away before Shailesh comes back.\n\nMeanwhile, Sailesh understands that Vetri has searched his car and he rushes to his home to destroy all the evidences. Sailesh shreds many papers in his home. Vetri comes to the place and fights with Sailesh. When Sailesh is about to kill Vetri, Raghuraman comes to the spot and shoots Sailesh. Raghuraman and Vetri conduct search in Sailesh’s home and a finds a number. They believe it to be an insurance policy and begin investigation. Raghuraman tracks down the insurance company that has issued the policy and both visit the company with hope of finding some truth.\n\nOn enquring with the clerk (Kavithalaya Krishnan), they find that the number is a life insurance policy taken by one of the persons who got killed and the sum insured is Rs.1 Crore. They are shocked to know that the insurance money was collected the person’s father as all the three people who got killed had no parents or relatives.\n\nSuddenly Vetri sees that the insurance company branch manager is none other than Sadagopan. Vetri and Raghuram traps Sadagopan and understands the truth. Sadagopan’s real name is Poornachandran and is the manager of the insurance company. He goes through the details of all the policy holders (insured by the employers) and targets people who have no parents or relatives.\n\nPoornachandran uses his power to forge a policy taken in favour of those people. Sailesh, his friend kills the insured person and they collect the money from the insurance agency. To Vetri’s shock, his professor Govardhan is also a part of the crime and he goes to collect the money as the insured’s father. Above all, it was Govardhan who has informed about Vetri’s observation skills to Poornachandran and asking him to recruit as a detective and use for their needs.\n\nVetri feels bad thinking about his professor as he had respected him a lot before. But Govardhan says that he and his ailing mother have suffered a lot and the society didn’t help which made him to choose this path. Govardhan apologizes to Vetri and commits suicide. Vetri and Raghuram believe that the professor’s actual name in Vallabha (as Poornachandran and Sailesh keep referring to this name often).\n\nLife is smooth for Vetri as he has united with Madhu and lives with his family. But one day, he receives a phone call from Vallabha suddenly and Vetri gets shocked knowing that there is someone above his professor Govardhan who is behind all the crimes. The movie ends here setting a path for a sequel.",
  "synopsis": null
}