{
  "imdb_id": "tt3590416",
  "tmdb_id": "410556",
  "douban_id": null,
  "title": "Global Baba (2016)",
  "genres": [
    "Thriller"
  ],
  "country": "India",
  "version": [],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm2124532",
      "name": "Manoj Tiwari"
    }
  ],
  "writer": [
    {
      "id": "nm4423914",
      "name": "Vishal Vijay Kumar",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2690647",
      "name": "Pankaj Tripathi",
      "character": "Damru       (as Pankaj Tripathy)"
    },
    {
      "id": "nm4191182",
      "name": "Sandeepa Dhar",
      "character": "Bhavana"
    },
    {
      "id": "nm0457410",
      "name": "Ravi Kishan",
      "character": "Jacob"
    },
    {
      "id": "nm1358872",
      "name": "Abhimanyu Singh",
      "character": "Chillam Pehlwaan /              Global Baba"
    },
    {
      "id": "nm4456506",
      "name": "Leena Balodi",
      "character": "Mother at Baba's Place"
    },
    {
      "id": "nm6199208",
      "name": "Vishwa Bhanu",
      "character": "Social Activist"
    },
    {
      "id": "nm6350506",
      "name": "Sanjay Mishra",
      "character": "Bhola Pandit"
    }
  ],
  "overview": "A conman finds refuge in becoming a baba and carries out his various criminal activities under the guise. A policeman, a journalist and politicians get entangled in his Web of deceit.",
  "storyline": "A conman finds refuge in becoming a baba and carries out his various criminal activities under the guise. A policeman, a journalist and politicians get entangled in his Web of deceit.",
  "plot": null,
  "synopsis": "Global Baba is a social-satire, which through an extremely interesting and entertaining series of story-events lays forth before us some of the treacherous ways through which a lot of con-men in the guise of religious gurus wins blind faiths of gullible masses. It is also a deft & realistically crafted political thriller, which exposes the infamous nexus of religion and politics.Global Baba, tells the story of Chillam Pehelwan, a seasoned criminal who after losing protection of his political bosses, takes refuge in the world of religion. Within no time Chillam Pehelwan as Global Baba manages to attract such a massive following of blind devotees that he becomes almost invincible & uncontrollable for anyone daring to challenge his insatiable greed for power.The rational minded and ethical thinking minority of his opponents, gets a chance to contain this monster of a monk only when he plans to step out from the sensitive & secure domain of religion to the domain of electoral politics. How these handful of right thinking people stage a brilliant charade to expose the true face of this Godzilla of a God-man, makes a thoroughly entertaining and a thrilling climax to the story of Global Baba."
}