{
  "imdb_id": "tt3569788",
  "tmdb_id": "240865",
  "douban_id": null,
  "title": "Naan Sigappu Manithan (2014)",
  "genres": [
    "Action",
    "Drama",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "149 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm3595665",
      "name": "Thiru"
    }
  ],
  "writer": [
    {
      "id": "nm3595665",
      "name": "Thiru",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1953187",
      "name": "Vishal",
      "character": "Indran"
    },
    {
      "id": "nm5068044",
      "name": "Lakshmi Menon",
      "character": "Meera"
    },
    {
      "id": "nm4710376",
      "name": "Iniya",
      "character": "Kavitha"
    },
    {
      "id": "nm0764853",
      "name": "Saranya Ponvannan",
      "character": "Indran's Mother"
    },
    {
      "id": "nm1957308",
      "name": "V. Jayaprakash",
      "character": "Meera's Father"
    },
    {
      "id": "nm4698683",
      "name": "Sunder Ramu",
      "character": "Indran's Friend"
    },
    {
      "id": "nm3388887",
      "name": "Jagan",
      "character": "Indran's Friend"
    },
    {
      "id": "nm8584044",
      "name": "Chethan Cheenu",
      "character": "Aravind"
    },
    {
      "id": "nm1228414",
      "name": "Pyramid Natarajan",
      "character": ""
    },
    {
      "id": "nm4278537",
      "name": "Jayabalan",
      "character": ""
    },
    {
      "id": "nm6928254",
      "name": "Prinz Nithik",
      "character": "Guna"
    },
    {
      "id": "nm5822279",
      "name": "Nisha Krishnan",
      "character": ""
    }
  ],
  "overview": "Indran suffers from narcolepsy, a sleep disorder that makes him fall asleep at the slightest excitement. He meets Meera and they fall in love but one night, they are attacked by unknown persons. Indran panics and goes into sleep, while Meera is raped. Indran must rely hard on his wits to find the assailants and overcome his condition get his revenge.",
  "storyline": "Indran (Vishal) is a boy suffering from Narcolepsy since childhood. It is a rare neurological disorder that affects the control of sleep and he falls asleep at any point of time when he experience any extreme form of excitement or emotion. Indran has 10 specific desires in life which he wants to fulfill. He is aided by his friends (Jagan and Sundar Ramu) as he ventures forth to fulfill his life ambitions, egged on by his loving and caring mother (Saranya Ponvannan). Indran meets Meera (Lakshmi Menon) daughter of a rich business man (Jayaprakash) and her curiosity in him slowly turn into love. But her dad fears that Indran cannot lead a happy married life and will not be able to make him a grand-father. But the brave girl takes an extreme step to help her lover overcome his disorder. However fate intervenes cruelly as she is brutally gang raped in front of Indran who is on sleep-mode. Whether Indran identifies the real culprits forms the rest of the plot.",
  "plot": "In the middle of the night, Indhiran (Vishal), accompanied by his two friends, Sathish (Jagan) and Karuna (Sunder Ramu), purchases a gun illegally from a local gangster. Back home, Indhiran stares at his wishlist and recalls his past.\n\nSince childhood, Indhiran has been suffering from narcolepsy, a rare disorder, which makes him fall asleep whenever his emotions reach an extreme and hinders him from living an ordinary life. He needs to be accompanied all the time, companies hesitate to hire him, although he has excelled in academics, and he cannot impregnate women since he would fall asleep during sex. However, he can still hear whatever is being said when he is sleeping.\n\nIndhiran creates a list with 10 goals he wants to achieve on his own. One day, he ventures out alone, which was one of his goals. When he is almost hit by a vehicle while crossing the road, his fear mounts and he falls asleep in the middle of the road. A passerby (Mayilsamy) makes him pose as an orphaned corpse and gathers money from onlookers for his burial. Meera (Lakshmi Menon), who passes by, takes pity and shells out almost five grands.\n\nShe later meets Indhiran in a mall and falls unconscious, seeing him alive. After clearing up the misunderstanding, they start dating and fall for each other.Meera makes one of the dreams of Indhiran come true (i.e.)getting a kiss from a beautiful woman by kissing him. But Meera's father opposes their marriage as Indhiran cannot give birth to a child. Meera urges Indhiran to find a way how he could stay awake. It dawns on Indhiran that he had never fallen asleep while taking a shower. Believing that her father will accept Indhiran only when his potency is proved, Meera and Indhiran have sex underwater in their pool, resulting in Meera becoming pregnant.\n\nOn a late night drive, Meera and Indhiran find themselves in an under-construction bridge. Their car is hit by another and the shock makes Indhiran doze. Meera is brutally attacked by four thugs. Indhiran can hear the entire incident but remains asleep. Meera falls into coma and her baby has been aborted. A heartbroken Indhiran vows to exact revenge on the perpetrators.\n\nThe narrative moves back to the present. Deciding to venge all by himself, Indhiran fails to testify to the police. To safeguard himself from any sudden shock, he buys a portable audio player and uses it with full volume. Enquiring Meera's friends, Indhiran first suspects Karthik (Rishi), a rich but ill-mannered guy, whose marriage proposal was rejected by Meera. Indhiran confronts him, but he feigns ignorance about the incident.\n\nIndhiran remembers that it were four persons, with one of them named Sekhar, and Sekhar's ringtone, while the police finds out that the offenders rode a red car. Indhiran stumbles upon a red car in a petrol bunk and enquires the driver who claims that the car was with a mechanic named Sekhar on the day the crime took place. At the workshop, he spots the mechanic who tries to abscond, recognising Indhiran, and a chase ensues leading them to a building under construction. Informed by Sathish, Karuna arrives there and kills Sekhar. He then slits himself and is admitted for treatment. Karuna then recollects.\n\nMarried to Karuna for two years, Kavitha (Iniya) was dissatisfied with her drunkard husband; she begins an affair with Aravind, a rich friend of Karuna. He spends a lot of money on buying her expensive gifts. Indhiran gains knowledge of this and advises Kavitha against it. It turns out that Karuna, to realise his ambitions of running a business in US, had been using his wife to manipulate Aravind. Citing Indhiran's confrontation, Kavitha bluffed to Aravind that if Karuna gets to know about the affair, he would kill them both. She suggested that the only way to solve it once and for all is to arrange the amount of ₹ 20 million Karuna needs to settle in the states. With him gone, they could enjoy being together. Aravind agreed to finance Karuna out of his lust for her.\n\nLater, when Karuna and Kavitha are celebrating their success, Indhiran drops by unexpectedly. They mess up; Indhiran suspects them and informs Aravind who confronts the couple. When Aravind realizes that he had been cheated, he hits Kavitha in a fit of rage and she dies. Infuriated, Karuna retaliated and kills Aravind. Karuna arranges for disposing them with the help of the thugs and lies to Indhiran that Kavitha has eloped with Aravind. Since he assumed that Indhiran was responsible for the death of Kavitha, Karuna had planned to take revenge by making him suffer the same way and requested the thugs to rape Indhiran's girlfriend, Meera.\n\nThe remaining thugs insist Karuna to bring Indhiran to the same place where Sekhar was killed. Finding out that it was Karuna who had killed Sekhar, they beat him up. The thugs then remove the audio player from Indhiran who gets an adrenaline rush and dozes off. While the thugs are assaulting him, one of them breaks a water pump which splashes water all over and awakens Indhiran. He kills them all and finally Karuna too. Indhiran tells that he had seen Karuna killing Sekhar but had come with him only to locate the other thugs.\n\nWith all his wishes fulfilled, he has a new wish that he would make Meera recover soon. The final scene shows Indhiran hugging Meera who is tearful hearing him which shows that she is definitely recovering.",
  "synopsis": null
}