{
  "imdb_id": "tt3526706",
  "tmdb_id": "314220",
  "douban_id": null,
  "title": "Chevalier (2015)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "Greece",
  "version": [
    {
      "runtime": "105 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm0718125",
      "name": "Athina Rachel Tsangari"
    }
  ],
  "writer": [
    {
      "id": "nm3328207",
      "name": "Efthymis Filippou",
      "description": null
    },
    {
      "id": "nm0718125",
      "name": "Athina Rachel Tsangari",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1030470",
      "name": "Yiorgos Kendros",
      "character": "The Doctor"
    },
    {
      "id": "nm2424804",
      "name": "Panos Koronis",
      "character": "Yorgos"
    },
    {
      "id": "nm0609999",
      "name": "Vangelis Mourikis",
      "character": "Josef"
    },
    {
      "id": "nm2810482",
      "name": "Makis Papadimitriou",
      "character": "Dimitris       (as Efthymis Papadimitriou)"
    },
    {
      "id": "nm0701566",
      "name": "Yorgos Pirpassopoulos",
      "character": "Yannis       (as Giorgos Pyrpassopoulos)"
    },
    {
      "id": "nm1648391",
      "name": "Sakis Rouvas",
      "character": "Christos"
    },
    {
      "id": "nm2630267",
      "name": "Yannis Drakopoulos",
      "character": "The Waiter       (as Giannis Drakopoulos)"
    },
    {
      "id": "nm0650512",
      "name": "Nikos Orfanos",
      "character": "The Captain"
    },
    {
      "id": "nm0680038",
      "name": "Kostas Filippoglou",
      "character": "The Cook"
    },
    {
      "id": "nm5069878",
      "name": "Katerina Vrana",
      "character": "Skype Woman"
    }
  ],
  "overview": "In the middle of the Aegean Sea, six men on a fishing trip on a luxury yacht decide to play a game. During this game, things will be compared. Things will be measured. Songs will be butchered, and blood will be tested. Friends will become rivals and rivals will become hungry. But at the end of the journey, when the game is over, the man who wins will be the best man. And he will wear on his smallest finger the victory ring: the Chevalier.",
  "storyline": "In the middle of the Aegean Sea, six men on a fishing trip on a luxury yacht decide to play a game. During this game, things will be compared. Things will be measured. Songs will be butchered, and blood will be tested. Friends will become rivals and rivals will become hungry. But at the end of the journey, when the game is over, the man who wins will be the best man. And he will wear on his smallest finger the victory ring: the Chevalier.",
  "plot": "Six men, The Doctor, Yorgos, Josef, Dimitris, Yannis and Christos are enjoying a fishing trip on the Aegean Sea in a luxury yacht. All the men are related either professionally or personally; The Doctor works with and mentors Christos, the former boyfriend of his daughter Anna. Yannis is the Doctor's son-in-law and Dimitris is Yannis' brother. Josef and Yorgos are partners who are close friends with the Doctor.\n\nThe final night before they head out on a multi-day journey back to Athens they play a game in which one player thinks of a person on the boat and the others must ask metaphorical questions such as what type of animal or fruit the person would be in order to guess the person the player is thinking of. Josef is offended when Yorgos guesses he is the person in question that resembles a pineapple. Josef correctly guesses that the person who is a pineapple is the cabin boy. In a huff, Yorgos quits playing saying that Josef isn't the best, he is only the person who is best at that particular game.\n\nTrying to decide on an alternate game to play Christos suggests they play a game he played the previous year called Chevalier. In Chevalier the men set up tasks for them all to perform and whoever wins the most rounds wins a Chevalier signet ring. Yorgos agrees to play, but only if the men compete for who is the best in general, meaning that they will not only judge each other on tasks but on their personality and habits with anything and everything up for grabs. The only one with a Chevalier ring is the Doctor, but as he refuses to lend his ring to the winner, they decide that a ring will be purchased when the group arrives in Athens.\n\nThe men immediately begin to judge each other on how they sleep, what they wear, how they drink their coffee. Each contestant also selects a competition for all of the men to compete in including who can clean the fastest, and who can skip stones the best. For his competition Yannis chooses to have the men take pictures of their penis fully erect to judge who has the largest one. Only Joseph is unable to achieve an erection, becoming upset.\n\nOnce docked at Athens the men decide to stay onboard for several more days to fully complete their competition. The doctor draws blood for each of the men but Dmitris refuses to have his blood taken which loses him points in the competition. Christos is upset to discover he has cholesterol. During dinner Dimitris prepares a performance of Lovin' You which he lipsynchs to. Wanting to encourage his brother Yannis lights sparklers and dances behind him on the dock. After the performance the Doctor coldly rebukes Yannis for being careless with the sparklers. Becoming enraged Yannis lashes out at the Doctor accusing him of disliking him because his daughter Anna is infertile. He then mocks Christos telling him that Anna shared his sexual inadequacies with Yannis and together they make fun of him. Christos is distraught and attacks Yannis and the two men must be separated.\n\nBefore the final competition Yorgos prepares a speech where he tells the men that he is shared a special moment with all of them during the trip. He then cuts his hand and asks the men to become blood brothers with him. All the men refuse, except Dimitris who agrees to the blood pact. Rather then slitting his hand, he pulls down his pants and cuts his upper butt cheek before grabbing Yorgos hand and clasping it to him to make them blood brothers.\n\nIn the kitchen the cook and his assistant begin to play Chevalier against one another, with the assistant docking points from his employer because he is balding.\n\nOutside the men, having finally finished the game, debark from the boat and head to their cars to go home. Yorgos climbs on his motorbike, with the chevalier ring gleaming on his hand.",
  "synopsis": null
}