{
  "imdb_id": "tt3547616",
  "tmdb_id": "355279",
  "douban_id": null,
  "title": "All Is Well (2015)",
  "genres": [
    "Adventure",
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "126 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.9,
  "director": [
    {
      "id": "nm1084488",
      "name": "Umesh Shukla"
    }
  ],
  "writer": [
    {
      "id": "nm1084488",
      "name": "Umesh Shukla",
      "description": "story"
    },
    {
      "id": "nm5046012",
      "name": "Sumit Arora",
      "description": "dialogue &"
    },
    {
      "id": "nm5378778",
      "name": "Niren Bhatt",
      "description": "dialogue"
    }
  ],
  "cast": [
    {
      "id": "nm0438501",
      "name": "Rishi Kapoor",
      "character": "Bhajanlal Bhalla"
    },
    {
      "id": "nm0045393",
      "name": "Abhishek Bachchan",
      "character": "Inder Bhalla"
    },
    {
      "id": "nm1821791",
      "name": "Asin",
      "character": ""
    },
    {
      "id": "nm0665554",
      "name": "Supriya Pathak",
      "character": "Pammi /              Parminder Bhalla"
    },
    {
      "id": "nm4269474",
      "name": "Mohammed Zeeshan Ayyub",
      "character": "Cheema"
    },
    {
      "id": "nm9904342",
      "name": "Steven a Dsouza",
      "character": "Dhaba Guy       (as Sardar Dhaba guy)"
    },
    {
      "id": "nm9767719",
      "name": "Daljeet Singh Gujral",
      "character": "Mama's son"
    },
    {
      "id": "nm0467868",
      "name": "Kaizaad Kotwal",
      "character": ""
    },
    {
      "id": "nm10354758",
      "name": "Arun Raj",
      "character": "Surjan"
    },
    {
      "id": "nm0848308",
      "name": "Tiku Talsania",
      "character": "Dhingra"
    },
    {
      "id": "nm3822788",
      "name": "Herry Tangiri",
      "character": "Mohit       (as Herry Tangri)"
    },
    {
      "id": "nm10084521",
      "name": "Sunita Verma",
      "character": "Chachi"
    },
    {
      "id": "nm4853598",
      "name": "Sumeet Vyas",
      "character": "Ronny"
    }
  ],
  "overview": "A road trip, undertaken by Rishi Kapoor and Abhishek Bachchan, is later joined by their mother.",
  "storyline": "A musician finds himself on the run from a group of thugs with his friend and his estranged parents.",
  "plot": "The film starts off with Inder Bhalla (Abhishek Bachchan), an aspiring song composer getting kicked out of his house by his father, Bhajanglal (Rishi Kapoor). Bhajanglal runs a bakery that doesn't really \"run\". He wants Inder to work at the bakery, but due to Inder's ambitions on becoming a successful song composer, he clearly refuses. Bhajanglal finds this an insult and sends Inder out of his house thinking that he is arrogant and selfish. This makes Inder hate his father forever but somewhere inside his soul, Bhajanglal still has love for his son. Inder travels to Thailand with his friend Ronny (Sumeet Vyas) who is also an ambitious song composer. Inder misses his mother, Pammi Bhalla (Supriya Pathak) but hasn't talked to her in many years. Suddenly, Inder gets a phone call from Cheema (Mohammed Zeeshan Ayyub).\n\nCheema lies to Inder that his father has sold his bakery and wants him to get his share. Unknown to this lie, Inder leaves everything and flies back to India. At the airport he hugs his girlfriend Nimmi (Asin) goodbye, little knowing that she is also travelling to India on the same flight. When Inder and Nimmi reach India they catch the same taxi as Nimmi wants to visit Inder's place. Inder drops Nimmi at his place and then goes to visit Cheema. There he sees his father has been abducted by Cheema and his goons. Inder comes to learn of the real truth that over the years his father borrowed lots of money from Cheema due to house needs but couldn't return it. Cheema warns that if he wants himself and his father to stay alive then he'd better arrange money. Inder and Bhajanglal go home to think of something. There, Inder finds out that his mother is suffering from Alzheimer's disease and Bhajanglal sent her to an ashram. Inder thinks that his father was very selfish but he hasn't learnt the truth yet.\n\nInder, Bhajanglal, Pammi and Nimmi take a road trip to try to run away from Cheema. They go to a bank on their way and want to take Pammi's brother's money, that Pammi has the actual right to. Bhajanglal is made to sign the form due to Pammi's memory loss. There, Inder learns that his father has divorced his mother. This makes his hatred towards his dad increase. Bhalanglal tells Inder that it wasn't his fault and a dark truth was behind his and Pammi's divorce. After restituting what he has learnt, Inder realises that his father was always innocent and starts loving him again. Inder sell all his songs that he had composed to pay back Cheema, gets his parents married again, marries Nimmi, and renovates his father's bakery. The film ends with Inder, Nimmy, Bhajanglal and Cheema (now their friend) working at the bakery and making lots of money.",
  "synopsis": null
}