{
  "imdb_id": "tt3546114",
  "tmdb_id": "286817",
  "douban_id": null,
  "title": "Anatomy of a Love Seen (2014)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "80 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.0,
  "director": [
    {
      "id": "nm3742962",
      "name": "Marina Rice Bader"
    }
  ],
  "writer": [
    {
      "id": "nm3742962",
      "name": "Marina Rice Bader",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm3165623",
      "name": "Sharon Hinnendael",
      "character": "Zoe Peterson"
    },
    {
      "id": "nm3458185",
      "name": "Jill Evyn",
      "character": "Mal Ford"
    },
    {
      "id": "nm1265337",
      "name": "Constance Brenneman",
      "character": "Anne Pasternak"
    },
    {
      "id": "nm3742962",
      "name": "Marina Rice Bader",
      "character": "Kara Voss"
    },
    {
      "id": "nm1822616",
      "name": "Kieran Valla",
      "character": "Kieran Scardovi"
    },
    {
      "id": "nm3618924",
      "name": "Alexandria Storm",
      "character": "Alex Smith"
    },
    {
      "id": "nm2834506",
      "name": "Justin Kane",
      "character": "Justin da Silva"
    }
  ],
  "overview": "From Writer/Director Marina Rice Bader (Executive Producer Elena Undone, A Perfect Ending) comes this film within a film that explores love in all its painful and messy glory.  Six months ago Zoe and Mal fell for each other while filming a love scene, which led to an intense, whirlwind affair, followed by a devastating breakup. Soon after their split, things get complicated when the two have to meet on set once more to re-shoot that fateful sequence.",
  "storyline": "Exploring love, in all its painful and messy glory. Six months ago actresses Zoe and Mal fell for each other at exactly the same moment in time while filming a love scene. After five blissful months together, Zoe was decimated when Mal walked away. Three miserable weeks later, a very lucrative network broadcast deal was in the works. They only had one request: Re-shoot the love scene. Welcome to the set.",
  "plot": "Zoe (Sharon Hinnendael) and Mal (Jill Evyn) meet while filming a movie where they're cast as lovers. They end up falling in love in the process and all seems to go well until months later when Mal abandons her lover just when Zoe's career starts to really take off. While it appears that Mal had little reason to leave her lover, the truth is that Mal was formerly an addict and is afraid that Zoe will leave her so she left Zoe before this could happen. The two end up being drawn back together when they're called back by Kara (Marina Rice Bader) to re-shoot their love scene.",
  "synopsis": null
}