{
  "imdb_id": "tt3560704",
  "tmdb_id": "257314",
  "douban_id": null,
  "title": "A Woman as a Friend (2014)",
  "genres": [
    "Comedy"
  ],
  "country": "Italy",
  "version": [
    {
      "runtime": "88 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.3,
  "director": [
    {
      "id": "nm0894787",
      "name": "Giovanni Veronesi"
    }
  ],
  "writer": [
    {
      "id": "nm0894787",
      "name": "Giovanni Veronesi",
      "description": "story"
    },
    {
      "id": "nm0894787",
      "name": "Giovanni Veronesi",
      "description": "screenplay &"
    },
    {
      "id": "nm0158323",
      "name": "Ugo Chiti",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0209948",
      "name": "Fabio De Luigi",
      "character": "Francesco"
    },
    {
      "id": "nm0144377",
      "name": "Laetitia Casta",
      "character": "Claudia"
    },
    {
      "id": "nm1779438",
      "name": "Valentina Lodovini",
      "character": "Lia"
    },
    {
      "id": "nm1335782",
      "name": "Valeria Solarino",
      "character": "Anna"
    },
    {
      "id": "nm0769335",
      "name": "Monica Scattini",
      "character": "Elga"
    },
    {
      "id": "nm2575030",
      "name": "Geppi Cucciari",
      "character": "Cecilia"
    },
    {
      "id": "nm0316271",
      "name": "Adriano Giannini",
      "character": "Giovanni"
    },
    {
      "id": "nm1662583",
      "name": "Virginia Raffaele",
      "character": "Patrizia"
    },
    {
      "id": "nm0514108",
      "name": "Antonia Liskova",
      "character": "Linda"
    },
    {
      "id": "nm3933829",
      "name": "Miriam Dalmazio",
      "character": "Giulia"
    },
    {
      "id": "nm1283860",
      "name": "Flavio Montrucchio",
      "character": "Luca"
    },
    {
      "id": "nm9501794",
      "name": "Vittoria Amore",
      "character": "Portinaia"
    },
    {
      "id": "nm7257145",
      "name": "Luigi Angiuli",
      "character": "Signor Leo"
    },
    {
      "id": "nm9711336",
      "name": "Cinzia Marseglia",
      "character": "Signora capelli bianchi"
    },
    {
      "id": "nm3063097",
      "name": "Antonella Bavaro",
      "character": "Dottoressa"
    },
    {
      "id": "nm1421567",
      "name": "Giannicola Resta",
      "character": "Direttore"
    },
    {
      "id": "nm1227354",
      "name": "Gennaro Diana",
      "character": "Police Officer"
    },
    {
      "id": "nm6346127",
      "name": "Vito Mancini",
      "character": "Police Officer"
    },
    {
      "id": "nm9384161",
      "name": "Antonio Loiacono",
      "character": "Poliziotto aeroporto"
    },
    {
      "id": "nm0765411",
      "name": "Alessandra Sarno",
      "character": "Guardia"
    },
    {
      "id": "nm3527022",
      "name": "Lia Cellamare",
      "character": "Segretaria Francesco"
    },
    {
      "id": "nm10966752",
      "name": "Alberto Mangiacavallo",
      "character": "Sindaco"
    },
    {
      "id": "nm0867924",
      "name": "Chiara Torelli",
      "character": "Segretario"
    },
    {
      "id": "nm1005885",
      "name": "Giuseppe Fusco",
      "character": "Consigliere"
    },
    {
      "id": "nm4381474",
      "name": "Alessandro Intini",
      "character": "Dottore"
    },
    {
      "id": "nm3503436",
      "name": "Vito Signorile",
      "character": "Giudice"
    }
  ],
  "overview": "Francis and Claudia are good friends . He is a lawyer, she is veterinary doctor. Among them there are no secrets , until John arrives. Claudia decides to marry him. Francis realizes that friendship between man and women is more complicated.",
  "storyline": "Francis and Claudia are good friends . He is a lawyer, she is veterinary doctor. Among them there are no secrets , until John arrives. Claudia decides to marry him. Francis realizes that friendship between man and women is more complicated.",
  "plot": "Carly, an attorney, has just started a relationship with Mark, a man she had sex with eight weeks earlier. She is upset when Mark tells her he has to go out of town but decides to go over to his house to seduce him. She is horrified to meet Mark's wife, Kate, whom she'd assumed to be Mark's housekeeper. While initially hostile, the two women befriend one another. Kate then discovers that he is seeing another woman, whom she initially believes to be Carly, but both she and Carly discover that Mark is seeing a third woman, Amber.\n\nCarly and Kate travel to the beach, where Kate has a run-in with Amber, and the two women inform her that Mark has been cheating on all of them. All three women then decide to take revenge on him together. They spike Mark's drinks with estrogen to swell his nipples and a laxative to cause him to defecate heavy diarrhea; and add hair-removal cream into his shampoo. In the course of carrying out their pranks, they discover that Mark has been embezzling money from various companies at his workplace. Meanwhile, Carly begins to connect romantically with Kate's brother Phil. In addition, Amber confides to Carly that she is seeing someone else as well. However, their camaraderie begins to fall apart when Kate finds herself falling in love with Mark again after an investor's dinner. Carly exposes Mark's fraud, upsetting Kate.\n\nLater, when Mark goes to the Bahamas on a supposed business trip, Kate decides to follow him there and expose him. She finds Carly and Amber at the airport, who explain that Mark has been using Kate as the owner of the companies he defrauded, which would—were his fraud to be discovered—result in her going to prison. Kate also finds out that Mark has been seeing yet another woman: someone he has met on this trip. This, and the possibility of facing prison, motivates her to take action with the help of Carly's legal expertise.\n\nWhen Mark returns from vacation, he visits Carly at her office. He is locked in the clear glass conference room by Carly's assistant and friend, Lydia, and is shocked to see all three women sitting together. They proceed to confront him with his infidelities and embezzlement. With Carly as her attorney, Kate presents divorce papers and a list of their assets. She reveals that she has returned the embezzled money to the companies, which saves him from prison time and leaves Mark bankrupt, much to his shock and hysterical outrage. Additionally, his business partner Nick arrives and fires Mark. In his anger and rush to leave, he smashes into the glass office. Severely injured with ripped clothes, Mark excuses himself from the women. He then finds his car being towed away and receives a punch in the face from Carly's father, Frank. Appreciating Kate's honesty, Nick offers her the chance to take over Mark's job.\n\nIn the film's epilogue, Carly and Phil fall in love, and the couple are expecting a child. Amber is in a relationship with Frank. Kate works as a CEO with Mark's former business partners, with the company making a profit under her leadership.",
  "synopsis": null
}