{
  "imdb_id": "tt3586652",
  "tmdb_id": "283730",
  "douban_id": null,
  "title": "Fuck Me to the Moon (2013)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "67 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm3785547",
      "name": "Quanah Takahata"
    },
    {
      "id": "nm5194476",
      "name": "Hirohito Takino"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm4010612",
      "name": "Shoko Akiyama",
      "character": "Kaguya"
    },
    {
      "id": "nm4024850",
      "name": "Chavetaro Ishizaki",
      "character": ""
    },
    {
      "id": "nm2919270",
      "name": "Kuniaki Nakamura",
      "character": ""
    },
    {
      "id": "nm5511223",
      "name": "Takashi Ogawa",
      "character": ""
    }
  ],
  "overview": "Do you play music during having sex? Do you remember the tunes? With the nerd-techno unit Mikeneko Homeless's music, this movie makes you laugh and cry, and give you an erection! Two dowdy men make music for their threesome sex with Kaguya, a girl from the moon. This is the real \"Tale of Princess Kaguya\", her crime and sex!",
  "storyline": null,
  "plot": "Fourteen-year-old Annie Cameron lives in suburban Chicago. On her birthday, her parents give her a laptop. When she meets Charlie in an online chat room, she establishes an instant connection with him. At first, Charlie states that he is 16 years old. Over time, as the two bond by sending phone text messages and through instant messaging, he bumps his age up to 18, 20, then 25. Annie is taken aback at first, but comes to believe that the two of them are in love.\n\nAfter two months of communicating electronically, Charlie invites Annie to meet him at the mall. While her parents are dropping off Annie's brother at college, Annie goes to the mall and awaits her first face-to-face meeting with Charlie. When he appears, she discovers that he is a man in his 40s. Annie is upset at first, but he charms her into going with him to a motel. Charlie then has her try on some lingerie which he bought for her and begins to touch her inappropriately. When she tells him no, he pushes her down onto the bed and rapes her, and even films the assault.\n\nAt school, Brittany, Annie's best friend, deduces Annie had sex, as she had seen her and Charlie that day at the mall. Brittany is concerned about this and notifies the school administration. The police arrive and depart with Annie, drawing unwanted attention from fellow students at her high school. These actions initiate an FBI investigation. The FBI have Annie contact Charlie, in an attempt to identify him, but he figures out the ruse and breaks off contact with her before the FBI can trace his location.\n\nAnnie's father, Will, starts his own investigation, by taking up the services of a private investigation firm in New Jersey and even stealing a collection of his daughter's chat conversations with Charlie from the FBI. The private investigation proves fruitless, as it is discovered Charlie encrypts his IP address so his location shows up as the Czech Republic. His relationship with his daughter and his wife, Lynn, starts to become alienating, and he questions his work at an advertising firm, which uses provocative advertisements involving teenagers.\n\nAnnie still believes Charlie loves her, and is angry at Brittany and her parents. A few more days pass, and although Charlie has not been identified, DNA evidence proves he has sexually abused several other young girls. After seeing pictures of Charlie's other victims, she feels betrayed, and finally admits to herself that she was raped.\n\nThe next day, Annie tries to move on with her life by participating in her school's volleyball game. There, Will sees a man in the crowd taking pictures, whom Will recognizes as a registered sex offender. Will violently confronts him - who turns out to be the father of one of Annie's teammates. The assaulted man chooses not to press charges for fear that he will be outed as a sex offender to his family. Will apologizes to the man but Annie feels humiliated. At home, Annie confronts her father, and insists that she wants to move on with her life.\n\nAnnie hears from Brittany about a website in which people are belittling the fact that she was raped and posting photo manipulations of her in pornographic poses, as well as revealing her phone number and address. She locks herself in the bathroom and attempts suicide by overdosing with pills, but Will saves her life. Brittany spends the night to keep her company, mending their broken friendship. Annie wakes up early the next day, and discovers her father sitting outside in the freezing cold weather. He pleads for her forgiveness, even though he believes he does not deserve it. Annie starts to cry and then embraces him.\n\nAs the credits roll, a home video reveals Charlie to be a high school physics teacher named Graham Weston, a married father with a young son.",
  "synopsis": null
}