{
  "imdb_id": "tt3569782",
  "tmdb_id": "270766",
  "douban_id": null,
  "title": "Jigarthanda (2014)",
  "genres": [
    "Action",
    "Crime",
    "Drama",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "171 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.5,
  "director": [
    {
      "id": "nm5366274",
      "name": "Karthik Subbaraj"
    }
  ],
  "writer": [
    {
      "id": "nm5366274",
      "name": "Karthik Subbaraj",
      "description": "story"
    },
    {
      "id": "nm5366274",
      "name": "Karthik Subbaraj",
      "description": "writer"
    },
    {
      "id": "nm5366274",
      "name": "Karthik Subbaraj",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1413459",
      "name": "Siddharth",
      "character": "Karthik"
    },
    {
      "id": "nm5654277",
      "name": "Bobby Simha",
      "character": "Assault Sethu       (as Simhaa)"
    },
    {
      "id": "nm5068044",
      "name": "Lakshmi Menon",
      "character": "Kayalvizhi"
    },
    {
      "id": "nm0621937",
      "name": "Nassar",
      "character": "Mukesh       (as Nasser)"
    },
    {
      "id": "nm4861046",
      "name": "Aadukalam Naren",
      "character": "Sundar       (as Narein)"
    },
    {
      "id": "nm5626435",
      "name": "Guru Somasundaram",
      "character": "Muthu Sir"
    },
    {
      "id": "nm5369429",
      "name": "Karunakaran",
      "character": "Oorni"
    },
    {
      "id": "nm3905156",
      "name": "Sangili Murugan",
      "character": "Pottikadai Annachi"
    },
    {
      "id": "nm0304265",
      "name": "Delhi Ganesh",
      "character": "Karthik's Father"
    },
    {
      "id": "nm0024302",
      "name": "Ambika",
      "character": "Kayalvizhi's Mother"
    },
    {
      "id": "nm6678944",
      "name": "Sudha",
      "character": "Karthik's Mother"
    },
    {
      "id": "nm5408984",
      "name": "Bagavathi Perumal",
      "character": "Film Unit Member"
    },
    {
      "id": "nm5408510",
      "name": "Rajkumar",
      "character": "Karthik's Friend"
    },
    {
      "id": "nm6678966",
      "name": "Vinodhini Vaidynathan",
      "character": "Widowed Woman"
    },
    {
      "id": "nm6670078",
      "name": "Ramachandran",
      "character": "Rasu"
    },
    {
      "id": "nm6327438",
      "name": "Soundara Raja",
      "character": "Soundar"
    },
    {
      "id": "nm6678945",
      "name": "Kaalaiyan",
      "character": ""
    },
    {
      "id": "nm4717390",
      "name": "Thennavan",
      "character": "Sekhar"
    },
    {
      "id": "nm1563842",
      "name": "Bala Singh",
      "character": "Shanmugam"
    },
    {
      "id": "nm1559782",
      "name": "Ajay Ratnam",
      "character": "Police officer"
    },
    {
      "id": "nm6678946",
      "name": "Senthil Kumaran",
      "character": ""
    },
    {
      "id": "nm5654096",
      "name": "Anthony Dasan",
      "character": "Sethu sidekick       (as Andony Dasan)"
    },
    {
      "id": "nm4043111",
      "name": "Vijay Sethupathi",
      "character": "Himself"
    },
    {
      "id": "nm4274575",
      "name": "Vetrimaaran",
      "character": "Special Appearance"
    },
    {
      "id": "nm6674676",
      "name": "Ramachandran Durairaj",
      "character": ""
    },
    {
      "id": "nm6046822",
      "name": "Gajaraj",
      "character": "Uncle /              journalist"
    },
    {
      "id": "nm5650589",
      "name": "Nalan Kumarasamy",
      "character": "Karthik fellow contest"
    },
    {
      "id": "nm6106368",
      "name": "Munishkanth",
      "character": ""
    }
  ],
  "overview": "When Karthik is given a task by his producer to come up with a gripping gangster flick infested with a heavy dosage of violence, he focuses on Sethu, a ruthless gangster surrounded by quirky yet scary henchmen. Karthik discreetly tries his best to find out about Sethu to develop a film script, but fails miserably in all his attempts. However when he finally gets the chance to gain an insight into Sethu's life, disaster strikes as he gets caught in the mêlée following the discovery of a mole within Sethu's gang.",
  "storyline": "When Karthik is given a task by his producer to come up with a gripping gangster flick infested with heavy dosage of violence, he focuses on Sethu, a ruthless gangster surrounded by quirky yet scary henchmen. Karthik discreetly tries his best to find out about Sethu to develop a film script, but fails miserably in all his attempts. However when he finally gets the chance to gain an insight into Sethu's life, disaster strikes as he gets caught in the mêlée following the discovery of a mole within Sethu's gang.",
  "plot": "Karthik Subramani (Siddharth) is a short-film maker and aspires to make a feature film. He participates in a talent search program (like Naalaya Iyakkunar) and is in the semi-final round. The show’s two judges include a highbrow film director (Nassar) who trashes Karthik’s attempt at film-making and a profit-oriented producer (Aadukalam Naren) who riles against the director, and declares that Karthik made the best film among the contestants. Though the director eliminates karthik from the contest,the producer offers to produce a film with Karthik as the director and both the judges storm out of the show. The next day, the producer is annoyed that Karthik took his words seriously and came to meet him. He is uninterested in the script that Karthik wants to film, and instead suggests that he wants to make a gangster film along the style of Nayagan, Thalapathi, The Godfather etc. Karthik takes this suggestion to heart and sets his mind on documenting the life of a gangster and making a film script out of it.\n\nWith help from his journalist uncle (Gajaraj), Karthik finds out about \"Assault\" Sethu (Bobby Simha), a ruthless gangster in Madurai city, and decides that he will make a film about the life of Sethu. He travels to Madurai and enlists the help of a reluctant college friend Oorani (Karunakaran) to conduct surveillance on Sethu and his men. Since Karthik and Oorani are afraid of approaching Sethu directly, they plot to develop contacts with two of Sethu’s top henchmen. They also try to obtain information from an old shopkeeper (Sangili Murugan) who has been around since Sethu was a kid. To get closer to Sethu, Karthik also puts up an act of reciprocating the love of Kayalvizhi (Lakshmi Menon), whose mom (Ambika) cooks for Sethu. Because of their various attempts to seek information about Sethu, they arouse the suspicion of Rasu (Ramachandran Durairaj), Sethu’s right-hand man, who puts an underling, Sounder (Senthil Kumaran) to watch Karthik and Oorani. Sounder becomes good friends with Karthik, and Karthik uses his trust to plant a wireless microphone in a music player that he lends to Sounder. In a quick turn of events, Sounder is busted as a mole for an opposing gang and is killed. Sethu finds out the tap placed in the music player that Sounder was carrying and quickly locates Karthik and Oorani. When about to die at the hands of Sethu, Karthik confesses that he was spying on Sethu so that he could make a movie about his life, along the lines of Nayakan and Thalapathi. Sethu is enamored by the prospect of his life being portrayed on the big screen and initiates Karthik and Oorani into his gang so that they can document his life. He and his gang members boast of their crimes and take Karthik along for their gang activities. Karthik gleefully documents everything and is ecstatic that he has a fantastic story in hand for his debut movie. When he is ready to leave Madurai with all the information that he ever needed Kayal discovers that Karthik used her for information and is vengeful. Sethu invites him for a send-off party. During the partying, Kayal remarks that Sethu himself should act as the main character in the gangster film about his life. Sethu takes this seriously and threatens Karthik to direct the film with Sethu playing himself on screen. Distraught at the sudden turn of events, Karthik tries to flee out of Madurai but is caught by Sethu’s gang. They also kidnap the producer of Karthik’s film and force them both to make the gangster movie.\n\nKarthik reluctantly agrees but soon finds that Sethu and his men cannot act in front of a camera. He hires an acting coach Muthu (Guru Somasundaram), who sets up a rigorous teaching schedule for Sethu and his men. After a period of training, Muthu thinks that while others are hopeless, Sethu has at least a sliver of acting talent. Production of the movie commences and Karthik becomes quite frustrated with Sethu’s acting ineptitude. Still, he perseveres with the movie and has Muthu coach Sethu in emotional crying scenes in between breaks. Finally, the production is wrapped. Sethu and his men are on cloud nine and create a great fanfare for the movie’s release. The movie releases and during the first show, Sethu gets the shock of his life. Realizing that a serious gangster movie featuring Sethu would be a disaster, Karthik had surreptitiously changed the story of the film into a comedy. He edits and dubs over Sethu’s voice in such a way that the movie shows Sethu as a guy who achieves everything in life by crying. The movie’s title A. Kumar is revealed to be Azhuguni (Crybaby) Kumar and not Assault Kumar as Sethu had thought. The movie receives a tremendous response from the audience who leave theatres in tears after laughing their guts out. Sethu is mad at being made a fool to the world and searches for Karthik. However, Karthik and the rest of the crew go into hiding in anticipation of Sethu’s wrath.\n\nWhile searching for Karthik and his crew, Sethu encounters events that make him realize that the fear that people have for him does not equal respect. He finds that by making people laugh inadvertently through his movie, he had earned true respect than respect by fear. In a final face-off, Sethu and Karthik meet each other by accident, he's on his way to deliver the video recordings of Sethu’s boastful confessions to the police. Sethu pardons Karthik in a dramatic way and Karthik chooses to put Sethu’s past behind him and let him seek a new life. They each go on to pursue a different path in the film industry. However, there is a twist in the tale. Karthik acquires a taste for Sethu's power and begins using his gang to extract call sheets of leading actors for his films.",
  "synopsis": null
}