{
  "imdb_id": "tt3577624",
  "tmdb_id": "321751",
  "douban_id": null,
  "title": "A Perfect Day (2015)",
  "genres": [
    "Comedy",
    "Drama",
    "War"
  ],
  "country": "Spain",
  "version": [
    {
      "runtime": "106 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm0508208",
      "name": "Fernando León de Aranoa"
    }
  ],
  "writer": [
    {
      "id": "nm0508208",
      "name": "Fernando León de Aranoa",
      "description": "writer and"
    },
    {
      "id": "nm1402066",
      "name": "Diego Farias",
      "description": "collaborating writer"
    },
    {
      "id": "nm1369071",
      "name": "Paula Farias",
      "description": "novel"
    }
  ],
  "cast": [
    {
      "id": "nm0001125",
      "name": "Benicio Del Toro",
      "character": "Mambrú"
    },
    {
      "id": "nm0000209",
      "name": "Tim Robbins",
      "character": "B"
    },
    {
      "id": "nm1385871",
      "name": "Olga Kurylenko",
      "character": "Katya"
    },
    {
      "id": "nm0858048",
      "name": "Mélanie Thierry",
      "character": "Sophie"
    },
    {
      "id": "nm1426138",
      "name": "Fedja Stukan",
      "character": "Damir"
    },
    {
      "id": "nm6360450",
      "name": "Eldar Residovic",
      "character": "Nikola"
    },
    {
      "id": "nm0530365",
      "name": "Sergi López",
      "character": "Goyo"
    },
    {
      "id": "nm2101030",
      "name": "Nenad Vukelic",
      "character": "Nikola's Grandfather"
    },
    {
      "id": "nm0840436",
      "name": "Morten Suurballe",
      "character": "UN Official at the Briefing"
    },
    {
      "id": "nm0854676",
      "name": "Ben Temple",
      "character": "UN Official's Assistant"
    },
    {
      "id": "nm0275513",
      "name": "Frank Feys",
      "character": "UN Official at the Well"
    },
    {
      "id": "nm0110313",
      "name": "Ivan Brkic",
      "character": "Store Owner"
    },
    {
      "id": "nm4470796",
      "name": "Antonio Franic",
      "character": "Soldier at the Storage"
    },
    {
      "id": "nm0623127",
      "name": "Goran Navojec",
      "character": "Bosnian NGO Driver"
    },
    {
      "id": "nm7974618",
      "name": "Dragica Stojkovic",
      "character": "Cow Lady"
    },
    {
      "id": "nm0340762",
      "name": "Goran Grgic",
      "character": "Commander at the Checkpoint"
    },
    {
      "id": "nm3364029",
      "name": "Slaven Spanovic",
      "character": "Soldier at the Checkpoint"
    },
    {
      "id": "nm0347742",
      "name": "Mate Gulin",
      "character": "Local Old Man"
    },
    {
      "id": "nm2952873",
      "name": "Darko Peric",
      "character": "Water Seller"
    },
    {
      "id": "nm2210570",
      "name": "Jaime Menéndez",
      "character": "UN Soldier 1"
    },
    {
      "id": "nm7974619",
      "name": "Javier Díaz Castromil",
      "character": "UN Soldier 2"
    },
    {
      "id": "nm7974620",
      "name": "Totti Milan",
      "character": "UN Soldier 3"
    },
    {
      "id": "nm3494337",
      "name": "Tim Verardi",
      "character": "UN Soldier 4"
    },
    {
      "id": "nm7974621",
      "name": "Zvonimir Okic",
      "character": "Teenager with the Gun"
    },
    {
      "id": "nm7555313",
      "name": "David Hadzic",
      "character": "Teenager 1"
    },
    {
      "id": "nm7974622",
      "name": "Amar Rahic",
      "character": "Teenager 2"
    },
    {
      "id": "nm7974623",
      "name": "Tvurko Zrncic",
      "character": "Teenager 3"
    },
    {
      "id": "nm8032357",
      "name": "Vulcan",
      "character": "Tyson"
    }
  ],
  "overview": "Film about a group of aid workers trying to resolve a crisis in an armed conflict zone in the Balkans.",
  "storyline": "A group of aid workers work to resolve a crisis in an armed conflict zone.",
  "plot": "In December 1941, American expatriate Rick Blaine is the proprietor of an upscale nightclub and gambling den in Casablanca. \"Rick's Café Américain\" attracts a varied clientele: Vichy French and German officials; refugees desperate to reach the still-neutral United States; and those who prey on them. Although Rick professes to be neutral in all matters, it is later revealed he ran guns to Ethiopia during its war with Italy and fought on the Loyalist side in the Spanish Civil War.\nFrom left to right: Henreid, Bergman, Rains and Bogart\nPetty crook Ugarte shows up and boasts to Rick of \"letters of transit\" obtained by murdering two German couriers. The papers allow the bearers to travel freely around German-controlled Europe and to neutral Portugal, and are thus almost priceless to the refugees stranded in Casablanca. Ugarte plans to sell them at the club that night, and asks Rick to hold them. Before he can meet his contact, he is intercepted by the local police under the command of Captain Louis Renault, an unabashedly corrupt Vichy official. Ugarte dies in custody without revealing that he entrusted the letters to Rick.\n\nAt this point, the reason for Rick's bitterness—former lover Ilsa Lund—walks into his establishment. Upon spotting Rick's friend and house pianist, Sam, Ilsa asks him to play \"As Time Goes By.\" Rick storms over, furious that Sam has disobeyed his order never to perform that song, and is stunned to see Ilsa. She is accompanied by her husband, Victor Laszlo, a renowned fugitive Czech Resistance leader. They need the letters to escape to America to continue his work. German Major Strasser has come to Casablanca to see that Laszlo does not succeed.\n\nWhen Laszlo makes inquiries, Ferrari, a major underworld figure and Rick's friendly business rival, divulges his suspicion that Rick has the letters. In private, Rick refuses to sell at any price, telling Laszlo to ask his wife the reason. They are interrupted when Strasser leads a group of officers in singing \"Die Wacht am Rhein.\" Laszlo orders the house band to play \"La Marseillaise.\" When the band looks to Rick, he nods his head. Laszlo starts singing, alone at first, then patriotic fervor grips the crowd and everyone joins in, drowning out the Germans. In retaliation, Strasser has Renault close the club.\nBogart and Bergman\nThat night, Ilsa confronts Rick in the deserted café. When he refuses to give her the letters, she threatens him with a gun, but then confesses that she still loves him. She explains that when they met and fell in love in Paris in 1940, she believed her husband had been killed attempting to escape from a concentration camp. Later, while preparing to flee with Rick from the imminent fall of the city to the German army, she learned that Laszlo was alive and in hiding. She left Rick without explanation to nurse her sick husband.\n\nRick's bitterness dissolves. He agrees to help, letting her believe that she will stay with him when Laszlo leaves. When Laszlo unexpectedly shows up, having narrowly escaped a police raid on a Resistance meeting, Rick has waiter Carl spirit Ilsa away. Laszlo, aware of Rick's love for Ilsa, tries to persuade him to use the letters to take her to safety. When the police arrest Laszlo on a minor, trumped-up charge, Rick persuades Renault to release him by promising to set him up for a much more serious crime: possession of the letters. To allay Renault's suspicions, Rick explains that he and Ilsa will be leaving for America. When Renault tries to arrest Laszlo as arranged, Rick forces him at gunpoint to assist in their escape. At the last moment, Rick makes Ilsa board the plane to Lisbon with her husband, telling her that she would regret it if she stayed—\"Maybe not today, maybe not tomorrow, but soon and for the rest of your life.\"\n\nStrasser, tipped off by Renault, drives up alone. Rick kills him when he tries to intervene. When policemen arrive, Renault pauses, then orders them to \"round up the usual suspects.\" Renault suggests to Rick that they join the Free French in Brazzaville. As they walk away into the fog, Rick says, \"Louis, I think this is the beginning of a beautiful friendship.\"",
  "synopsis": null
}