{
  "imdb_id": "tt3572740",
  "tmdb_id": "284606",
  "douban_id": null,
  "title": "Prelude to Axanar (2014)",
  "genres": [
    "Short",
    "Action",
    "Drama",
    "Sci-Fi"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "21 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.5,
  "director": [
    {
      "id": "nm1501183",
      "name": "Christian Gossett"
    }
  ],
  "writer": [
    {
      "id": "nm1501183",
      "name": "Christian Gossett",
      "description": null
    },
    {
      "id": "nm7419291",
      "name": "Arnold Montey",
      "description": null
    },
    {
      "id": "nm5754507",
      "name": "Alec Peters",
      "description": "story"
    },
    {
      "id": "nm5754507",
      "name": "Alec Peters",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0368745",
      "name": "Richard Hatch",
      "character": "Commander Kharn"
    },
    {
      "id": "nm0865302",
      "name": "Tony Todd",
      "character": "Admiral Marcus Ramirez"
    },
    {
      "id": "nm0894690",
      "name": "Kate Vernon",
      "character": "Captain Sonya Alexander"
    },
    {
      "id": "nm0381117",
      "name": "J.G. Hertzler",
      "character": "Admiral Samuel Travis"
    },
    {
      "id": "nm0334048",
      "name": "Gary Graham",
      "character": "Ambassador Soval"
    },
    {
      "id": "nm5754507",
      "name": "Alec Peters",
      "character": "Captain Kelvar Garth"
    },
    {
      "id": "nm1039206",
      "name": "Orion Acaba",
      "character": "Professor John Gill"
    },
    {
      "id": "nm2571980",
      "name": "Steven Jepson",
      "character": "Admiral Slater"
    }
  ],
  "overview": "Prelude to Axanar is a short film that will give viewers a historical look at the events leading up to the Battle of Axanar, the central event of the film Axanar. The short is a historical look at the battle of Axanar, filmed like a History Channel special. Each character will give a different view of the war with the Klingons leading up to the final confrontation that will be chronicled in Axanar, which will be released later this year. Prelude will tell viewers about the war and what it meant to each side. Figures from both sides will talk about how the war started, how the Klingons were better prepared for war, how Starfleet built their fleet, and how the war was fought from both the Federation and Klingon perspectives. You will hear from Robert April talk about building the Enterprise, Starfleet Admiral Ramirez talk about building the Starfleet, Garth of Izar telling the story of his rise to fame and Kharn, the Klingon Supreme Commander give the Klingon view of the war.",
  "storyline": "Prelude to Axanar is an independent project that discusses the war between the Federation and the Klingon Empire leading up to the Battle of Axanar. Figures from both sides discuss how the war began, how the Klingons were better prepared for war, how the Federation built their Starfleet, and how the war was fought from both the Federation and Klingon views. Robert April discusses building the USS Enterprise, Admiral Ramirez discusses building the Starfleet, Garth of Izar discusses his rise to fame, and the Klingon supreme warlord Kharn gives the Klingon view of the war.",
  "plot": "The film is presented as an episode of a Federation documentary pertaining to the Four Years War with the Klingon Empire, narrated by noted historian John Gill (who appeared in \"Patterns of Force\") and featuring interviews of actual participants on both sides. It begins on Stardate 2241.03, two decades before the original series, with the war's opening battle at Arcanis IV, a prosperous Federation colony along the Klingon border. The Klingons, who did not consider the Federation to be a worthy adversary, maintained the initiative for the first six months of the war, with a number of victories under the leadership of their supreme commander, Kharn. The Vulcan diplomatic delegation under Ambassador Soval (who appeared in Enterprise), overseeing negotiations with the Klingons, are left with little room to maneuver.\n\nIn response to the losses suffered in the war, Starfleet appoints a new Commander-in-Chief, Admiral Marcus Ramirez, who pledges in a fleet-wide broadcast to defend \"the dream of the Federation\" against the Klingons' commitment to its destruction. Ramirez oversees the creation of the Ares-class cruisers, Starfleet's first warships, to counter the Klingons' mainstay, the D6 battlecruiser. The introduction of the Ares turns the tide against the Klingons, who begin to give Starfleet its due as a worthy opponent, and particularly take notice of Garth of Izar (who appeared in \"Whom Gods Destroy\"), the captain of the prototype U.S.S. Ares.\n\nTo counter the Ares cruisers, the Klingons order the construction of a newer and more advanced battlecruiser, the D7, that would restore the Klingons' technical and military advantage. In response, Starfleet begins developing their own next-generation heavy cruiser, the Constitution-class, but construction falls behind schedule. To gain more time to finish their new heavy cruiser, Starfleet approves a plan proposed by Garth to fight the Klingons at Axanar, the planet where Kharn's spies have reported the Constitution prototypes (revealed to be the Constitution and the Enterprise) are being built. The film ends on Stardate 2245.1, just before the battle at Axanar, when the first three D7s enter the war.",
  "synopsis": "The movie is presented as an episode of a Federation documentary pertaining the Four Years War with the Klingon Empire, narrated by famous historian John Gill and featuring interviews of actual participants on both sides. It begins on Stardate 2241.03, twenty years before the original series, with the war's opening battle at Arcanis IV, a prosperous Federation colony along the Klingon border. The Klingons, who did not consider the Federation to be a worthy adversary, maintained the initiative for the first six months of the war, with a number of victories under the leadership of their supreme commander, Kharn. The Vulcan diplomatic delegation under Ambassador Soval, overseeing negotiations with the Klingons, are left with little room to maneuver.In response to the losses suffered in the Four Years War, Starfleet appoints the new Commander-In-Chief, Admiral Marcus Ramirez, who pledges in a fleet-wide broadcast to defend the dream of the Federation against the Klingons' commitment to its destruction. Ramirez oversees the construction of the Ares-class starship, Starfleet's first warships, to counter the Klingons' mainstay, the D6 battle cruiser. The introduction of the Ares-class starship turns the tide against the Klingons, who begin to give Starfleet its due as a worthy opponent, and particularly take notice of Kelvar Garth (aka Garth of Izar), the captain of the prototype USS Ares.To counter the Ares-class starships, the Klingons order the construction of the new and more advanced battle cruiser, the D7, that would restore the Klingons' technical and military advantage. In response, Starfleet begins developing their own next-generation heavy cruiser, the Constitution-class starship, but construction falls behind schedule. To gain more time to finish their new heavy cruiser, Starfleet approves a plan by Garth to fight the Klingons at Axanar, the planet where Kharn's spies have reported the Constitution prototypes (revealed to be the USS Constitution and the USS Enterprise) are being built. The movie ends on Stardate 2245.1, just before the battle of Axanar, when the first three D7 cruisers enter the war."
}