{
  "imdb_id": "tt3568002",
  "tmdb_id": "356332",
  "douban_id": null,
  "title": "The Witness (2015)",
  "genres": [
    "Documentary",
    "Biography",
    "Crime",
    "Mystery"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "89 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm0003833",
      "name": "James D. Solomon"
    }
  ],
  "writer": [
    {
      "id": "nm6325578",
      "name": "William Genovese",
      "description": "narration written by"
    },
    {
      "id": "nm1527140",
      "name": "Russell Greene",
      "description": "narration written by"
    },
    {
      "id": "nm0722431",
      "name": "Gabriel Rhodes",
      "description": "narration written by"
    },
    {
      "id": "nm0003833",
      "name": "James D. Solomon",
      "description": "narration written by"
    }
  ],
  "cast": [
    {
      "id": "nm1840381",
      "name": "Shannon Beeby",
      "character": "Herself"
    },
    {
      "id": "nm1393671",
      "name": "Kitty Genovese",
      "character": "Herself       (archive footage)"
    },
    {
      "id": "nm6325578",
      "name": "William Genovese",
      "character": "Himself"
    },
    {
      "id": "nm7124874",
      "name": "Catherine Pelonero",
      "character": "Herself"
    }
  ],
  "overview": "A brother's journey to unravel the truth about the mythic death and little known life of Kitty Genovese, who was reportedly murdered in front of 38 witnesses and has become the face of urban apathy.",
  "storyline": "Bill Genovese's decade-long journey to unravel the truth about the mythic death and little-known life of his sister, Kitty, who was reportedly stabbed in front of 38 witnesses and became the face of urban apathy. THE WITNESS begins in 2004 when The Times questions its original story: the number of witnesses, what they observed, the number of attacks. None was more affected by the story than Bill. He vowed not to be like the 38, volunteered for Vietnam, and lost both legs. What if Kitty's mythic story is an urban myth? Breaking his family's half-century of silence, Bill seeks to find the truth confronting the witnesses, the killer, their families and his own. THE WITNESS is about bearing witness, loss and forgiveness, and what we owe each other.",
  "plot": "This article's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (January 2016) (Learn how and when to remove this template message)\nLu Xiaoxing (Yang Mi) is a rookie cop when one night, goes to a night club to find her adoptive brother (Liu Ruilin) and bring him back home to chastise him for acting up, getting expelled from school, and pursuing a frivolous dream of being a singer. He objects and as they argue, her brother messes with the car's pedals and sends the car flying off the overpass, leaving Xiaoxing bloody on the ground and the car totaled, along with her brother.\n\nThree years later, following the effects of the accident, Xiaoxing is living life as a blind woman with her guide dog, Cong Cong. She tries unsuccessfully to persuade her former police academy senior to allow her another chance at being an officer. Defeated, Xiaoxing goes back home when she receives a call from her mother later on, asking her to go back to the family house now up for sale, to look through the old things and keep anything she might decide she wants. Xiaoxing goes through the house when afterwards, her mother asks her to go the memorial concert that her brother's band is playing in honor of his third year death anniversary. Upset and unable to come to terms with the idea, Xiaoxing leaves the house, determined to call a taxi and go home.\n\nAs it slowly becomes dark and Xiaoxing waits anxiously in the pouring rain for a taxi, she is soon the only one left there when suddenly, a taxi drives up, offering her a ride back to her apartment. Upon getting in, she immediately realizes strange things, like the odd smell in the car and the unusually luxurious leather seats for a taxi. The driver offers her a warm coffee, which she accepts, but as she struggles to open it, he insists he help her. They fight over opening the coffee and the driver, momentarily distracted, crashes. Xiaoxing is startled and manages to fight off the driver who attempts to restrain her. She hears him drive off hastily and Xiaoxing is left in the rain, unable to comprehend the recent events.\n\nAt the police station, she reports her experience to the head of police, Captain Lu (Wang Jingchun), and proves her prowess at identifying various aspects of a person despite the Captain's initial doubts about her credibility due to her lack of eyesight. He agrees to help her find the taxi driver. After a reward is posted for any eyewitnesses, it attracts the attention of juvenile Linchong (Lu Han), who claims to have seen the accident and insists that the car was not a taxi, but a Golf 6 model. Due to his rude behavior and nonchalant teenage attitude, the captain opts to believe Xiaoxing, who still believes she got into a taxi after claiming she heard the driver start the meter. Nevertheless, when Linchong is suddenly tailed by the taxi driver and nearly killed, Captain Lu and Xiaoxing begin to take his word seriously. Linchong, still stubborn, leaves the hospital after a few days when he sees Xiaoxing getting on a bus and a man getting on behind her. Immediately recognizing the danger, Linchong calls Xiaoxing and asks her to put on her earphones and turn on her video camera to film her surroundings so he might be rescue her. Her tailer notices and manages to get her to get off at the next stop, however, Xiaoxing pepper sprays him before taking off with her guide dog. Her disability makes escaping difficult though and in a struggle to get away, her dog is killed before the police arrive.\n\nThe search now begins as Captain Lu has put two and two together, connecting Xiaoxing's driver to the man behind a series of missing women in the city. The police unit notice that all the missing women had disappeared after being set up for a date on the \"Let's Meet\" dating app and do some digging on the usernames of the male they were to meet. Linchong, now eager to aid the case and avenge Xiaoxing, notices the usernames are all lyrics from the same song and so determines the perpetrator's next username will be another lyric. It is then revealed that the man had a younger sister who, after their affluent parents' death, went out frivolously and met men through dating apps every night. Her older brother, angered, had insisted she stop her nonsense and accidentally killed her in the tussle following. Vengeful and determined to teach women a lesson, he began murdering women who used the same app his younger sister did.\n\nWhen a new username pops up and the police department recognizes it as lyric from the song, they trace the owner of the account to someone called Tang Qian, actually the dead sister of Tang Zhen (Zhu Yawen), a plastic surgeon, who is one and the same with the driver. At the same time, Xiaoxing brings Linchong, who she has begun to see as her late brother, to the old family home to show him everything. She reveals that she is the older sister of the dead singer Linchong greatly admires. Meanwhile, Captain Lu arrives at the property that the police identified as the Tang residence and engages Tang Zhen in a fight. Captain Lu is injured and Tang Zhen leaves to pay Xiaoxing a visit.\n\nXiaoxing finally comes face to face with the killer and he offers her a proposal: since they are so similar to the other, both having loved and lost a sibling, why don't they die together and end their miserable existence. However, Linchong appears and attacks Tang Zhen, giving Xiaoxing some time to reconsider her actions. Tang Zhen overpowers Linchong and hands Xiaoxing a match, asking her to set the both of them on fire. She refuses and instead, burns the room to run away. In a fury and half burnt, Tang Zhen chases after her, but she swings her brother's old guitar at him and incapacitates him for good before the police arrive.\n\nA year later, Xiaoxing is at the memorial concert that was planned for her brother and Linchong is onstage performing her brother's song, signifying their happy ending.",
  "synopsis": null
}