{
  "imdb_id": "tt3511596",
  "tmdb_id": "325173",
  "douban_id": null,
  "title": "Close Range (2015)",
  "genres": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "country": "USA",
  "version": [],
  "imdb_rating": 4.9,
  "director": [
    {
      "id": "nm0282708",
      "name": "Isaac Florentine"
    }
  ],
  "writer": [
    {
      "id": "nm1720703",
      "name": "Chad Law",
      "description": "written by"
    },
    {
      "id": "nm1360971",
      "name": "Shane Dax Taylor",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0012078",
      "name": "Scott Adkins",
      "character": "Colton MacReady"
    },
    {
      "id": "nm0157915",
      "name": "Nick Chinlund",
      "character": "Sheriff Jasper Calloway"
    },
    {
      "id": "nm1021721",
      "name": "Caitlin Keats",
      "character": "Angela Reynolds"
    },
    {
      "id": "nm4395604",
      "name": "Madison Lawlor",
      "character": "Hailey Reynolds"
    },
    {
      "id": "nm9025381",
      "name": "Ramezani Javad",
      "character": ""
    },
    {
      "id": "nm0673637",
      "name": "Tony Perez",
      "character": "Fernando Garcia"
    },
    {
      "id": "nm0478403",
      "name": "Jake La Botz",
      "character": "Walt Reynolds"
    },
    {
      "id": "nm5520932",
      "name": "Anthony L. Fernandez",
      "character": "Lobo"
    },
    {
      "id": "nm0356013",
      "name": "Randy Hall",
      "character": "Deputy Wyatt"
    },
    {
      "id": "nm3268924",
      "name": "Scott Evans",
      "character": "Deputy Logan"
    },
    {
      "id": "nm3425146",
      "name": "Jeremy Marinas",
      "character": "Cruz"
    },
    {
      "id": "nm4985969",
      "name": "Ray Diaz",
      "character": "Victor Garcia"
    },
    {
      "id": "nm1842221",
      "name": "Julien Cesario",
      "character": "Ignacio"
    },
    {
      "id": "nm5661603",
      "name": "Matt Ramirez",
      "character": "Aguilar"
    },
    {
      "id": "nm4832724",
      "name": "Jimmy Chhiu",
      "character": "Zavala"
    },
    {
      "id": "nm4786218",
      "name": "Bryan Cartago",
      "character": "Montez"
    },
    {
      "id": "nm2976758",
      "name": "Robert Dill",
      "character": "Reina"
    },
    {
      "id": "nm5418135",
      "name": "Umar Khan",
      "character": "Sesma"
    },
    {
      "id": "nm4549857",
      "name": "Nicholas Verdi",
      "character": "Ramos"
    },
    {
      "id": "nm4950184",
      "name": "Marc Canonizado",
      "character": "Rodriguez"
    },
    {
      "id": "nm2359285",
      "name": "Craig Henningsen",
      "character": "Pablo"
    },
    {
      "id": "nm2319418",
      "name": "George Crayton",
      "character": "Ortiz"
    },
    {
      "id": "nm2832723",
      "name": "Anis Cheurfa",
      "character": "Eduardo"
    },
    {
      "id": "nm2326268",
      "name": "Chad Guerrero",
      "character": "Perez"
    },
    {
      "id": "nm1928456",
      "name": "Mario Perez",
      "character": "Elevator Mexican #1"
    },
    {
      "id": "nm0272961",
      "name": "Eddie J. Fernandez",
      "character": "Elevator Mexican #2"
    },
    {
      "id": "nm3594724",
      "name": "Melita Camilo",
      "character": "Dancer #1"
    },
    {
      "id": "nm9605150",
      "name": "Natalya",
      "character": "Dancer #2"
    },
    {
      "id": "nm2187079",
      "name": "Holland Diaz",
      "character": "Federale #1"
    },
    {
      "id": "nm2372966",
      "name": "Dennis Ruel",
      "character": "Federale #2"
    },
    {
      "id": "nm4417721",
      "name": "Daniel Graham",
      "character": "Mexican Thug"
    },
    {
      "id": "nm5987347",
      "name": "Cristina Segovia",
      "character": ""
    }
  ],
  "overview": "A rogue soldier turned outlaw is thrust into a relentless fight with a corrupt sheriff, his obedient deputies, and a dangerous drug cartel in order to protect his sister and her young daughter.",
  "storyline": "After unwittingly making off with a mysterious flash drive during the rescue of his young niece from a powerful drug cartel, Colton MacReady is thrust into a relentless fight to save his family as the cartel descends upon his sister's home in search of it and their own brand of south-of-the-border justice. In tow is a corrupt local sheriff and his crew of deputies, ensuring that help won't be coming any time soon. What ensues is a non-stop assault, a blow-by-blow survival marathon for Colton to protect his loved ones and save his own life while keeping the drive from falling back into the wrong hands.",
  "plot": null,
  "synopsis": "In Judicial Power buidling in Hermosillo, Sonora, Mexico; former soldier Colt Macready kills the henchmen on his path and rescues his niece, Hailey, who was kidnapped by Señor Fernando \"El Jefe\" Garcia's men. After that, Colt retrieves the flash drive and kills a remaining henchman kill and the two security guards. Colt brought Hailey to her home in Arizona.A sheriff named Jasper Calloway, who works for Garcia, receives a call from him told to Jasper to detain Hailey's dad and Angela's wife, Walt Reynolds, for stealing a money from Garcia and he also saying that Colt killed his men. Garcia then kills his own nephew for letting this happen. Now Garcia is in vengeance, the henchmen prepares to go to Walt's in Arizona.Walt arrives at his home and confronts Angela for calling Colt. Shortly, they heard the sheriff vehicles are coming on their residence. Colt immediately hides in the bankhouse just as the two sheriff vehicles arrives. Jasper then detains Walt and asks Angela for Colt's whereabouts. When Angela lying to Jasper, Walt shouts that Colt is hiding in the bankhouse to the sheriffs. As the two sheriffs searching the bankhouse, Colt attacks the both and escapes with the car. Jasper orders the both sheriffs to chase Colt. After the ensuing car chase of Colt and the two sheriffs, they immobilized the Colt's car and rams onto it. The both sheriffs chase him on foot.Garcia's convoy finally arrives at Walt's residence. Upon arriving, Garcia shoots Walt in the head after he made an apology on him for what he done while the two henchmen named Reina and Cruz, ordered by Garcia, searching Colt for the drive. Garcia's men held Angela and Hailey a hostage inside their house.Meanwhile, the both sheriffs catch Colt but is killed by Reina and Cruz. After the ensuing exchanging gunfires and attacking between them, Colt eventually killed them both. As he walk out from the hills, another two henchmen, Lobo and Aguillar, arrives. He manages to kill Aguillar and he asks Lobo about the content of the drive which is bank accounts before Colt kills him. Colt races back to the residence.After seeing Jasper drives away from the residence, Colt kills one of the henchmen. Upon Garcia seeing his henchman dead, the henchmen held Angela and Hailey hostage and Garcia threatens to kill his niece if Colt don't surrender himself. Colt manage to overpowers them, causing the long standoff between them. Angela joins the standoff against the other men. While it ensues, Hailey calls the state police, only the operator redirects to Jasper. In the process, Angela is shot in the right shoulder while Colt and the henchman are fighting.After Colt managed to kill some henchmen, he told Angela and Hailey to escape from the house safely, but they are confronted by Garcia, however, upon Jasper arrives at the residence, he fatally shoots Garcia. Now Jasper reveals himself as the real mafia boss. After Colt kills all the henchmen, he shoots Jasper. Colt makes Jasper a choice: a handcuff or a shotgun. When Jasper made a choice by picking a shotgun, Colt quickly kills him.Later, before Colt leave the residence, he keeps the flash drive to Angela. Colt leaves the residence as the state police arrives and drives to unknown destination."
}