{
  "imdb_id": "tt3530418",
  "tmdb_id": "254011",
  "douban_id": null,
  "title": "The Huntresses (2014)",
  "genres": [
    "Action",
    "Comedy"
  ],
  "country": "South Korea",
  "version": [
    {
      "runtime": "107 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.5,
  "director": [
    {
      "id": "nm6288580",
      "name": "Jae-Hyun Park"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm0351710",
      "name": "Ji-won Ha",
      "character": "Jin-ok"
    },
    {
      "id": "nm2584975",
      "name": "Ye-won Kang",
      "character": "Hong-don"
    },
    {
      "id": "nm3745929",
      "name": "Ga-in Son",
      "character": "Gabi"
    },
    {
      "id": "nm6288581",
      "name": "Sang-uk Ju",
      "character": ""
    },
    {
      "id": "nm2944077",
      "name": "Chang-Seok Ko",
      "character": ""
    },
    {
      "id": "nm7676538",
      "name": "Ji-hye Kwak",
      "character": ""
    },
    {
      "id": "nm8167688",
      "name": "Hee-Seok Lee",
      "character": "Hong-Dan's husband"
    },
    {
      "id": "nm1997077",
      "name": "Dong-bin Park",
      "character": ""
    }
  ],
  "overview": "Set in the Joseon Period, three beautiful musketeers fight against a powerful group who tries to overturn the royal family and gain absolute power. The leader of the Beautiful Three Musketeers is Jin-Ok (Ha Ji-Won), a smart and righteous woman. Hong-Dan (Gang Ye-Won) is the only married woman among the three women. Ga-Bi (Son Ga-In) is the youngest among the musketeers and excels at fighting.",
  "storyline": "Adventure of 3 korean female warrior, Jin-Ok, Hong-Dan and Ga-Bi as the three most legendary bounty hunters in the Joseon dynasty.",
  "plot": "The intelligent and talented martial arts swordswoman Jin-ok (Ha Ji-won), housewife and fighter Hong-dan (Kang Ye-won), and Ga-bi (Son Ga-in), the youngest of the trio: These three women are the Joseon dynasty's top bounty hunters, and they never fail to capture a target, no matter the criminal or the crime. They set out on a secret mission commissioned by the king to search for the stauroscope, and in doing so, prevent a powerful group from gaining absolute power and overturning the royal family.",
  "synopsis": null
}