{
  "imdb_id": "tt3544082",
  "tmdb_id": "311291",
  "douban_id": "25839662",
  "title": "45 Years (2015)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "91 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm0354091",
      "name": "Andrew Haigh"
    }
  ],
  "writer": [
    {
      "id": "nm3807555",
      "name": "David Constantine",
      "description": "short story \"In Another Country\" and"
    },
    {
      "id": "nm0354091",
      "name": "Andrew Haigh",
      "description": "adaptation"
    }
  ],
  "cast": [
    {
      "id": "nm0001648",
      "name": "Charlotte Rampling",
      "character": "Kate Mercer"
    },
    {
      "id": "nm0183822",
      "name": "Tom Courtenay",
      "character": "Geoff Mercer"
    },
    {
      "id": "nm0416524",
      "name": "Geraldine James",
      "character": "Lena"
    },
    {
      "id": "nm0920185",
      "name": "Dolly Wells",
      "character": "Sally"
    },
    {
      "id": "nm0796287",
      "name": "David Sibley",
      "character": "George"
    },
    {
      "id": "nm0018723",
      "name": "Sam Alexander",
      "character": "Chris The Postman"
    },
    {
      "id": "nm3355471",
      "name": "Richard Cunningham",
      "character": "Mr Watkins"
    },
    {
      "id": "nm3892357",
      "name": "Hannah Chalmers",
      "character": "Travel Agent"
    },
    {
      "id": "nm4238222",
      "name": "Camille Ucan",
      "character": "Café Waitress"
    },
    {
      "id": "nm0942782",
      "name": "Rufus Wright",
      "character": "Jake"
    }
  ],
  "overview": "There is just one week until Kate Mercer's 45th wedding anniversary and the planning for the party is going well. But then a letter arrives for her husband. The body of his first love has been discovered, frozen and preserved in the icy glaciers of the Swiss Alps. By the time the party is upon them, five days later, there may not be a marriage left to celebrate.",
  "storyline": "Kate and Geoff Mercer are planning to celebrate their 45th wedding anniversary with dozens of friends. The event is to take place soon in the community hall of Norwich, the town near which they live. A week before the party, Geoff receives a letter which, although he tries to hide it, obviously troubles him. When his wife asks him what is going on, Geoff tells her that the body of Katya, his first great love who disappeared fifty years before in the Alps, has just been found in a melting glacier. From then on, Geoff starts behaving more and more strangely and for the first time after so many years Kate asks herself who the man she married so long ago really is.",
  "plot": "The film takes place across six days, marked by intertitles.\n\nFive years after retirees Kate and Geoff Mercer had to cancel their 40th wedding anniversary because of his heart bypass surgery, the comfortably-off, childless, Norfolk couple are now planning to celebrate their 45th anniversary with dozens of friends at the Assembly House in Norwich.\n\nA week before the party, Geoff receives a letter from Switzerland telling him that the body of Katya, his lover in the early 1960s, has become visible in a melting glacier where she fell into a crevasse on their hike with a guide over five decades ago. Memories rush back to him and he realizes he has forgotten much of what little German he used to know and that he would need a dictionary to fully understand all that the letter says.\n\nKate has known about Katya since the time Geoff and Kate met later in the 1960s and is initially unconcerned by Geoff's controlled disquiet. \"I can hardly be cross about something that happened before we even existed...\" she says, but after a pause adds \"Still...\".\n\nThe next day Kate helps Geoff find his old German-English dictionary. Soon, Geoff's conduct begins to show that there is more on his mind than he says. Among other things, he tries to keep from Kate that he is beginning to take steps to fly to Switzerland without her to see Katya's body, which he imagines preserved in the now-transparent ice, still looking youthful.\n\nProdded by Kate, Geoff talks about his relationship with Katya and thoughts evoked by the discovery of her body. He tells Kate that he and Katya had pretended to be married in order to be able to share a room in the more puritanical early 1960s. Because of this, the Swiss authorities consider him to be Katya's next of kin. Kate is troubled by the revelation.\n\nAs the days pass and preparations for the party continue, Geoff continues to be moody and takes up smoking, which both had given up in the past. One night, Geoff climbs into the attic to look at his memorabilia of Katya and only reluctantly shows Kate a picture of Katya when she insists. Kate starts to ponder all of her life with Geoff and their possibly rebound relationship, and even begins \"to smell Katya's perfume\" in every room.\n\nWhile Geoff is attending a reunion luncheon at the plant from which he retired, Kate, neglecting their dog's jittery barking at the ladder, climbs up into the attic to see what things her husband may be keeping there. She finds Geoff's scrapbook filled with memorabilia from his life with Katya, including pressed flowers from their last hike. And then she finds a carousel slide projector, loaded with images of Switzerland and Katya, next to a makeshift screen to view them. One slide shows Katya with her hand on top of her protruding abdomen, indicating Katya was pregnant at the time of her death.\n\nKate takes up smoking again, too, and confronts Geoff about his feelings for Katya without revealing what she saw in the attic. Geoff promises that their marriage will \"start again,\" which he begins by bringing her tea to bed and making breakfast for her the next morning.\n\nThey attend their anniversary party in the historical Grand Hall. Kate is constrained, distracted, and remains impassive during Geoff's speech in which he professes his love for Kate, while saying \"the choices we make in our youth are most important\" and bringing himself to tears, just as Kate's friend Lena has predicted men always do at weddings and anniversaries. Geoff and Kate dance, but she moves rigidly in his embrace. As they dance, after initially being sober and serious, Geoff begins to become more playful. As the dance ends and Kate realizes the meaning of this wedding song, Geoff raises their hands together in the air. Kate yanks her arm down after a few seconds and Geoff, apparently oblivious, dances away. The final close-up isolates Kate amid the crush of people on the dance floor as mixed emotions play across her face.",
  "synopsis": null
}