{
  "imdb_id": "tt3547098",
  "tmdb_id": "289864",
  "douban_id": null,
  "title": "Second Opinion: Laetrile at Sloan",
  "genres": [
    "Documentary",
    "Biography",
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "76 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.3,
  "director": [
    {
      "id": "nm1619378",
      "name": "Eric Merola"
    }
  ],
  "writer": [
    {
      "id": "nm1619378",
      "name": "Eric Merola",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm6302989",
      "name": "Robert Good",
      "character": "Himself"
    },
    {
      "id": "nm6302975",
      "name": "Ben Moss",
      "character": "Himself"
    },
    {
      "id": "nm6302972",
      "name": "Martha Moss",
      "character": "Herself"
    },
    {
      "id": "nm6302983",
      "name": "Melissa Moss",
      "character": "Herself"
    },
    {
      "id": "nm6302991",
      "name": "Ralph Moss",
      "character": "Himself"
    },
    {
      "id": "nm6302987",
      "name": "Lloyd Old",
      "character": "Himself"
    },
    {
      "id": "nm6302981",
      "name": "Alec Pruchnicki",
      "character": "Himself"
    },
    {
      "id": "nm6302974",
      "name": "Chester Stock",
      "character": "Himself"
    },
    {
      "id": "nm6302986",
      "name": "Kanematsu Sugiura",
      "character": "Himself"
    },
    {
      "id": "nm6302988",
      "name": "Lewis Thomas",
      "character": "Himself"
    }
  ],
  "overview": "The story of a young science-writer at Memorial Sloan-Kettering Cancer Center, who risked everything by blowing the whistle on a massive cover-up involving a promising cancer therapy.",
  "storyline": "The story of a young science-writer at Memorial Sloan-Kettering Cancer Center, who risked everything by blowing the whistle on a massive cover-up involving a promising cancer therapy.",
  "plot": null,
  "synopsis": "The War On Cancer, launched in the early 1970s, set the stage for a massive influx of new ideas in fighting the disease of cancer. Memorial Sloan-Kettering Cancer Center, America's leading cancer research center at the time, was assigned the task of testing an unconventional therapy called Laetrile in an effort to curb the publics false hope in the alleged quack therapy.Ralph W. Moss PhD, a young and eager science writer, was hired by Sloan-Ketterings public relations department in 1974 to help brief the American public on the centers contribution to the War On Cancer. One of his first assignments was to write a biography about Dr. Kanematsu Sugiura, one of the Centers oldest and leading research scientists as well as the original co-inventor of chemotherapy.While meeting with this iconic scientist to pen a biography on his 60-year career atSloan-Kettering, Moss discovered that Sugiura had been studying this quack remedy in laboratory mice, and with unexpectedly positive results. Shocked and bewildered, Moss reported back to his superiors what he had discovered, only to be met with backlash and denial from Sloan-Ketterings leaders on what their own leading scientist had found. Fueled by respect and admiration for SugiuraRalph W. Moss attempted to publicize the truth about Sugiuras findings. And after all diplomatic approaches failed, Moss lived a double life, working as a loyal employee at Sloan-Kettering while also recruiting fellow employees to help anonymously leak this information to the American publicthrough a newly formed underground organization they calledSecond Opinion."
}