{
  "imdb_id": "tt3516028",
  "tmdb_id": "286880",
  "douban_id": null,
  "title": "The Passenger (2012)",
  "genres": [
    "Crime",
    "Drama"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "61 min",
      "description": ""
    },
    {
      "runtime": "72 min",
      "description": "original"
    }
  ],
  "imdb_rating": 4.6,
  "director": [
    {
      "id": "nm3478746",
      "name": "Tor Iben"
    }
  ],
  "writer": [
    {
      "id": "nm3478746",
      "name": "Tor Iben",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm4630400",
      "name": "Niklas Peters",
      "character": "Nick"
    },
    {
      "id": "nm4835473",
      "name": "Lynn Femme",
      "character": "Lilli"
    },
    {
      "id": "nm4261817",
      "name": "Urs Stämpfli",
      "character": "Phillip"
    },
    {
      "id": "nm6359011",
      "name": "Maxim Albert",
      "character": "Marco"
    },
    {
      "id": "nm4861694",
      "name": "Annina Nusko",
      "character": "Lisa"
    },
    {
      "id": "nm6359012",
      "name": "Bastian Scheibe",
      "character": "Max"
    },
    {
      "id": "nm6775314",
      "name": "Stefano Lago",
      "character": "Fotomodel"
    },
    {
      "id": "nm6775315",
      "name": "Evelyn Marwehe",
      "character": "Galleristin"
    },
    {
      "id": "nm4649612",
      "name": "Torsten Poggensee",
      "character": "Dr. Mabuse"
    },
    {
      "id": "nm6775316",
      "name": "Thary Plast Ic",
      "character": "Transvestit       (as Thary Plast IC)"
    },
    {
      "id": "nm3983116",
      "name": "Julia Felicitas Maleika Seele",
      "character": "Lost Girl"
    },
    {
      "id": "nm3300509",
      "name": "Selam Tadese",
      "character": "Schauspielschüler"
    },
    {
      "id": "nm4590222",
      "name": "Valentina Bianda",
      "character": "Schauspielschüler"
    },
    {
      "id": "nm5157282",
      "name": "Ronan Favereau",
      "character": "Schauspielschüler       (as Ronan Favereau-Berthelo)"
    },
    {
      "id": "nm8628840",
      "name": "Cedrik Etti",
      "character": "Schauspielschüler"
    },
    {
      "id": "nm8628841",
      "name": "Chris Heil",
      "character": "Schauspielschüler"
    },
    {
      "id": "nm8628842",
      "name": "Sebastian Hettel",
      "character": "Schauspielschüler"
    },
    {
      "id": "nm8328437",
      "name": "Hester Wonschick",
      "character": "Party-People"
    },
    {
      "id": "nm8628843",
      "name": "Hans Storck",
      "character": "Party-People"
    },
    {
      "id": "nm8628844",
      "name": "David Neifer",
      "character": "Party-People"
    },
    {
      "id": "nm8628845",
      "name": "Timm Peltner",
      "character": "Party-People"
    },
    {
      "id": "nm8628846",
      "name": "Lilo Klinkenberg",
      "character": "Party-People"
    },
    {
      "id": "nm8628847",
      "name": "Julian Rais",
      "character": "Party-People"
    },
    {
      "id": "nm8628848",
      "name": "René Paulokat",
      "character": "Party-People"
    },
    {
      "id": "nm6137973",
      "name": "Daniela Todorova",
      "character": "Party-People"
    },
    {
      "id": "nm5089975",
      "name": "Nicolas Dinkel",
      "character": "Party-People"
    },
    {
      "id": "nm8628849",
      "name": "Rona Beckelmann",
      "character": "Party-People"
    },
    {
      "id": "nm8628850",
      "name": "Laurens Friedl",
      "character": "Party-People"
    },
    {
      "id": "nm6775313",
      "name": "Nura Laguerta",
      "character": "Yasmin"
    },
    {
      "id": "nm8628851",
      "name": "Amet Jonah",
      "character": "Kassierer"
    },
    {
      "id": "nm2558375",
      "name": "Bernd S. Rositzka",
      "character": "Kommissar       (as Bernd Rositzka)"
    },
    {
      "id": "nm8628852",
      "name": "Sascha Bluhm",
      "character": "Polizist #1"
    },
    {
      "id": "nm8628853",
      "name": "Murat Üü",
      "character": "Polizist #2"
    },
    {
      "id": "nm8628854",
      "name": "Seyit Karakayoun",
      "character": "Can Arslan"
    },
    {
      "id": "nm0065251",
      "name": "Peter Beck",
      "character": "Regisseur"
    },
    {
      "id": "nm4403852",
      "name": "Sinan Hancili",
      "character": "Stefan"
    },
    {
      "id": "nm8628855",
      "name": "Frank Burczynski",
      "character": "Martial-Arts-Trainer"
    },
    {
      "id": "nm8628856",
      "name": "Lucian Heinzmann",
      "character": "Martial-Arts-Fighter"
    },
    {
      "id": "nm8628857",
      "name": "Karin Wieckhorst",
      "character": "Dinner-Gäste"
    },
    {
      "id": "nm8628859",
      "name": "Karin Flothmann",
      "character": "Dinner-Gäste"
    },
    {
      "id": "nm8628858",
      "name": "Stefanie von der Lippe",
      "character": "Dinner-Gäste"
    },
    {
      "id": "nm0951649",
      "name": "Thomas Zacher",
      "character": "Dinner-Gäste"
    },
    {
      "id": "nm4639945",
      "name": "Mario Schollenberger",
      "character": "Dinner-Gäste"
    },
    {
      "id": "nm8628860",
      "name": "Samuel Coulmas",
      "character": "Hostel-Leiche"
    },
    {
      "id": "nm1738234",
      "name": "Felix Lehrmann",
      "character": "Albtraum-Leiche"
    },
    {
      "id": "nm6359014",
      "name": "Ingo Roobe",
      "character": "Peer"
    },
    {
      "id": "nm6359015",
      "name": "Elisabeth Seidl",
      "character": "Emma"
    }
  ],
  "overview": "In the provocative new drama from the director of THE VISITOR, sexual and moral boundaries are put to the test when a handsome stranger begins to infiltrate the lives of two artists. While searching for a condo in Berlin for his father, Nick meets Philipp, a young talented photographer and a gorgeous actress named Lilli. There is instant chemistry and both are easily seduced by Nick's charms. Lilli and Philipp begin to explore their relationship with the sexy visitor, succumbing to their passionate affections for him which intensifies their volatile emotional and physical bonds. But what Philipp and Lilli don't realize is that they are being lured into Nick's manipulative..and deadly, love game.",
  "storyline": "In the provocative new drama from the director of The Visitor, sexual and moral boundaries are put to the test when a handsome stranger begins to infiltrate the lives of two artists. While searching for a condo in Berlin for his father, Nick meets Philipp, a young talented photographer and a gorgeous actress named Lilli. There is instant chemistry and both are easily seduced by Nick's charms. Lilli and Philipp begin to explore their relationship with the sexy visitor, succumbing to their passionate affections for him which intensifies their volatile emotional and physical bonds. But what Philipp and Lilli don't realize is that they are being lured into Nick's manipulative... and deadly, love game.",
  "plot": "David Locke (Jack Nicholson) is a television journalist making a documentary film on post-colonial Africa. To finish the film, he is in the Sahara desert seeking to meet with and interview rebel fighters involved in Chad's civil war. Struggling to find rebels to interview, he is frustrated when his Land Rover gets hopelessly stuck on a sand dune. After a long walk through the desert back to his hotel, a thoroughly glum Locke discovers that an Englishman, Robertson (Charles Mulvehill), who has also been staying there and with whom he had struck up a friendship, has died overnight at the hotel.\n\nLocke decides to switch identities with Robertson; he is tired of his work, his marriage and his life, and sees an opportunity for a fresh start. Posing as Robertson, Locke reports his own death at the front desk, where the hotel manager mistakes Locke for Robertson, and the plan goes off without a hitch.\n\nIn London, Locke's wife Rachel (Jenny Runacre) has been having an affair. She feels guilt-ridden and torn when she is informed of her husband's death. She approaches Locke's friend, Martin (Ian Hendry), a producer at the BBC, in an attempt to get in touch with Robertson so that she may learn more about her husband's last days. Meanwhile, \"Robertson\" (Locke) has flown off to Europe with the dead man's belongings, including his appointment book.\n\nLocke soon learns that Robertson was gunrunning for the rebels whom, as a reporter, Locke had been trying to contact in the desert. When he goes to check out an airport locker listed in Robertson's diary, Locke is tracked down by the rebels' point man in Europe. He is there to complete the weapons sale. Since neither man has ever seen the other before, Locke's false identity is not revealed, and he hands the men the documents from Robertson's locker, and receives the first down-payment for the set up arms deal with Robertson before his death.\n\nLater Locke accidentally spots Martin on a street in Barcelona, as the latter tries to track Robertson down on behalf of Rachel. Locke backtracks and at this point bumps into an architecture student (Maria Schneider) while trying to hide nearby. He asks her to fetch his belongings from the hotel, so he won't be seen there by Martin who camped out to catch up with \"Robertson\". Martin overhears that she is collecting Locke's baggage, and requests him to take her to meet \"Robertson\". She manages to evade him, and join with Locke who leaves off Barcelona. They become lovers, and later, while trying to explain his rather odd behaviour, Locke confesses that he has stolen a dead man's identity.\n\nLocke is flush with cash from the down payment on the arms he cannot deliver, yet he is drawn to keep the meetings listed in Robertson's note book. In the meantime, Rachel has received his left behind belongings, which were returned from Africa. Having heard from Martin of his unsuccessful chase of the elusive \"Robertson\", Rachel is shocked as she opens Locke's passport, to see Robertson's photo pasted inside. Having realised why \"Robertson\" was so elusive, Rachel now heads off to Spain to track down Locke, who is in flight from the Spanish police, brought in by Rachel to track Robertson. The student girl is however loyal to Locke and helps him to evade, providing rational advice, but Locke sends her away, intending to reunite later in Tangiers.\n\nReaching the Gloria hotel in the Spanish town of Osuna, province of Seville, Locke finds out that the girl has already booked them a double room, but then again he persuades her that she better leave. Taking her time, she wander the dusty parking out, while the rebel agents in pursuit of Robertson arrive at the hotel. There Locke's assassination takes place, mostly off screen, in long take, ending with a single heard gun shot. The rebels leave the scene minutes before the police arrive with Rachel, to find Locke motionless in bed. There his wife says to the police agents, she \"never knew\" the dead man, while the student girl identifies him as Robertson.",
  "synopsis": null
}