{
  "imdb_id": "tt3531824",
  "tmdb_id": "328387",
  "douban_id": null,
  "title": "Nerve (2016)",
  "genres": [
    "Action",
    "Adventure",
    "Crime",
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "96 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm1160962",
      "name": "Henry Joost"
    },
    {
      "id": "nm1413364",
      "name": "Ariel Schulman"
    }
  ],
  "writer": [
    {
      "id": "nm6290393",
      "name": "Jeanne Ryan",
      "description": "novel"
    },
    {
      "id": "nm0789366",
      "name": "Jessica Sharzer",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0731075",
      "name": "Emma Roberts",
      "character": "Vee"
    },
    {
      "id": "nm2002649",
      "name": "Dave Franco",
      "character": "Ian"
    },
    {
      "id": "nm2007030",
      "name": "Emily Meade",
      "character": "Sydney"
    },
    {
      "id": "nm1851028",
      "name": "Miles Heizer",
      "character": "Tommy"
    },
    {
      "id": "nm0000496",
      "name": "Juliette Lewis",
      "character": "Nancy"
    },
    {
      "id": "nm4733752",
      "name": "Kimiko Glenn",
      "character": "Liv"
    },
    {
      "id": "nm0420384",
      "name": "Marc John Jefferies",
      "character": "Wes"
    },
    {
      "id": "nm0446622",
      "name": "Machine Gun Kelly",
      "character": "Ty"
    },
    {
      "id": "nm6891629",
      "name": "Brian Marc",
      "character": "J.P."
    },
    {
      "id": "nm5368452",
      "name": "Ed Squires",
      "character": "Chuck"
    },
    {
      "id": "nm2943328",
      "name": "Rightor Doyle",
      "character": "Bergdorf Salesman"
    },
    {
      "id": "nm3722959",
      "name": "Josh Ostrovsky",
      "character": "Dirt Beard"
    },
    {
      "id": "nm6779895",
      "name": "Eric D'Alessandro",
      "character": "Hype Boi"
    },
    {
      "id": "nm2387237",
      "name": "Arielle Vandenberg",
      "character": "Bergdorf Sales Lady"
    },
    {
      "id": "nm4759657",
      "name": "Jonny Beauchamp",
      "character": "Gatekeeper"
    },
    {
      "id": "nm4148126",
      "name": "Samira Wiley",
      "character": "Hacker Kween"
    },
    {
      "id": "nm8301135",
      "name": "Albert Sidoine",
      "character": "Clarence"
    },
    {
      "id": "nm8301136",
      "name": "Chris Breslin",
      "character": "Bergdorf Security Guard"
    },
    {
      "id": "nm1948402",
      "name": "Wesley Volcy",
      "character": "Taxi Cab Driver"
    },
    {
      "id": "nm6548909",
      "name": "Damond McFarland",
      "character": "Derrick"
    },
    {
      "id": "nm2655834",
      "name": "Deema Aitken",
      "character": "Robbie"
    },
    {
      "id": "nm1826988",
      "name": "Michael Drayer",
      "character": "Officer McMillan"
    },
    {
      "id": "nm8301138",
      "name": "Earl W. Mayers",
      "character": "Security Guard"
    },
    {
      "id": "nm5625456",
      "name": "Diana Kolsky",
      "character": "Times Square Girlfriend"
    },
    {
      "id": "nm6153385",
      "name": "Murf Meyer",
      "character": "Times Square Boyfriend       (as Matthew Meyer)"
    },
    {
      "id": "nm7038091",
      "name": "Michal Birnbaum",
      "character": "Town Crier"
    },
    {
      "id": "nm7754793",
      "name": "Ryan Forsythe",
      "character": "Watcher at Dorilton"
    },
    {
      "id": "nm3861068",
      "name": "Kim Ramirez",
      "character": "Senior Sales Woman"
    },
    {
      "id": "nm5756907",
      "name": "Noam Tomaschoff",
      "character": "Cop"
    },
    {
      "id": "nm8301140",
      "name": "Phyllis Barasch",
      "character": "Bergdorf Lady"
    },
    {
      "id": "nm8301141",
      "name": "Chloe Wise",
      "character": "Player /              Watcher"
    },
    {
      "id": "nm2931325",
      "name": "Casey Neistat",
      "character": "Player /              Watcher"
    },
    {
      "id": "nm8301142",
      "name": "Sarah Shtern",
      "character": "Player /              Watcher"
    },
    {
      "id": "nm8301143",
      "name": "Miya Strauss",
      "character": "Player /              Watcher"
    },
    {
      "id": "nm8301144",
      "name": "Aris Schwabe",
      "character": "Player /              Watcher"
    },
    {
      "id": "nm8301145",
      "name": "Chet Dillon",
      "character": "Player /              Watcher"
    },
    {
      "id": "nm8301146",
      "name": "Jerami Goodwin",
      "character": "Player /              Watcher"
    },
    {
      "id": "nm8301147",
      "name": "Julia Barasch",
      "character": "Player /              Watcher"
    },
    {
      "id": "nm8301148",
      "name": "Amanda Bard",
      "character": "Player /              Watcher"
    },
    {
      "id": "nm8301149",
      "name": "Marli Sachs",
      "character": "Player /              Watcher"
    },
    {
      "id": "nm5291179",
      "name": "Govinda Angulo",
      "character": "Player /              Watcher"
    },
    {
      "id": "nm8301151",
      "name": "Zoe Katagas",
      "character": "Player /              Watcher"
    },
    {
      "id": "nm8301152",
      "name": "Ella Katagas",
      "character": "Player /              Watcher"
    },
    {
      "id": "nm8301153",
      "name": "Luna Miccoli",
      "character": "Player /              Watcher"
    },
    {
      "id": "nm7854191",
      "name": "Philip Embury",
      "character": "Player /              Watcher"
    },
    {
      "id": "nm6581462",
      "name": "Amoni B.",
      "character": "Watcher"
    },
    {
      "id": "nm5511420",
      "name": "Murphy Betancourt",
      "character": "Gas Mask Watcher"
    },
    {
      "id": "nm4233343",
      "name": "Ryan Burton",
      "character": "Game Watcher"
    },
    {
      "id": "nm6517139",
      "name": "Marko Caka",
      "character": "Spider-Man Watcher"
    },
    {
      "id": "nm7030776",
      "name": "Dillon Mathews",
      "character": "Watcher"
    },
    {
      "id": "nm5307909",
      "name": "Cameron McIntosh",
      "character": "Watcher"
    }
  ],
  "overview": "'Nerve' is about an online dare game, in which people give participants anonymous dares for money. The participants compete with each other to win the grand prize as the dares get tougher. Things get worse when the tasks get increasingly dangerous and lives are at stake.",
  "storyline": "'Nerve' is about an online dare game, in which people give participants anonymous dares for money. The participants compete with each other to win the grand prize as the dares get tougher. Things get worse when the tasks get increasingly dangerous and lives are at stake.",
  "plot": "High school senior Venus \"Vee\" Delmonico (Emma Roberts) longs to leave her home, Staten Island, for college, but is afraid to tell her mother (Juliette Lewis) about her admission to California Institute of the Arts, as the mother is still grieving from the death of Vee's brother.\n\nVee's friend Sydney (Emily Meade) becomes popular in Nerve: an online reality game where people either enlist online as \"players\" or pay to watch as \"watchers\". Players accept dares from watchers, receiving money rewards. Sydney and her other friends chastise Vee's unadventurous nature. When Vee refuses to talk to her crush J.P., Sydney approaches J.P. herself and reveals that Vee is interested in him. J.P. rebuffs her, and Vee walks away embarrassed.\n\nFurious, Vee signs up as a player on Nerve. The game collects her personal data and explains the three rules: all dares must be recorded on the player's phone, earned money will be revoked if a player fails or \"bails\" a dare, and a player must not report the game to law enforcement. In addition, the top two most-watched players will compete in a highly sought-after final round. Her first dare is to kiss a stranger at a diner for five seconds. Vee kisses Ian (Dave Franco), who is reading Vee's favorite book (Virginia Woolf's \"To the Lighthouse\"). He starts dancing around the diner and sings to her on a dare, revealing that he's playing too. The watchers then dare Ian to take her into the city, believing they make a good couple.\n\nIn the city Vee is dared to try on an extremely expensive dress and meets Ian in the dressing room who has also been dared to try on formal attire. On returning to the changing rooms Vee and Ian find their clothes have been stolen and their next dare has started which is to leave the store. Vee and Ian run out of the store in their underwear and on returning to Ian's motorbike find a bag of clothes paid for by watchers. Vee is then dared to get a tattoo chosen by Ian, Ian draws out a tattoo and refuses to show Vee. When Vee becomes impatient, Ian distracts her with Wu-Tang Clan's C.R.E.A.M. on the radio, one of her brother's favorite songs. Vee raps along with the song until the finished tattoo is revealed to be a lighthouse. Ian's next dare is to trust Vee and is supposed to ride his motorbike through the city blindfolded at 60 mph, using Vee to steer his body; once completed, the couple kisses. Vee and Ian are soon among Nerve's top players under a short space of time. Jealous at Vee's rise of popularity on Nerve, Sydney accepts a dare to walk across a ladder suspended between two buildings. Whilst performing the dare, she drops her phone and due to her becoming scared, bails out and loses the game.\n\nIan takes Vee to Sydney's party and Vee catches her in bed with J.P. After arguing with Sydney, Vee receives and completes a dare to finish Sydney's dare. Vee's friend Tommy (Miles Heizer) reveals that he was watching Ian's profile; Ian had accepted a dare to make Vee and Sydney fight. Vee realizes how dangerous Nerve is and reports the game to the police, but they do nothing. As punishment, all money is drained from Vee's bank account, and her mother's. She is then attacked by elite player Ty (Machine Gun Kelly) in order to keep her in the game.\n\nAfter waking up in an abandoned site, she finds Ian, who confesses that he and Ty were players before, until their friend was killed in a dare. When they tried to alert the authorities, their families' jobs, bank accounts, and identities were confiscated, trapping them in the secret third category of the game: \"prisoners\". Vee is now a prisoner too, and only the winner of the final round can regain their identity.\n\nVee, Tommy, and Sydney recruit Tommy's computer hacker friends to alter the game's online code, although it is impossible to shut down Nerve as all the watchers act as a server to the game. After hanging from a crane for five seconds - which was the same dare that killed his friend - Ian too earns a spot in the finals in order to protect Vee. During the finals, which take place in an abandoned stadium, Vee and Ian are each given a revolver: one must shoot the other to win. Ian offers to throw the competition, but Ty jumps from the audience and takes Ian's place. Vee criticizes the watchers, whose identity are concealed behind masks and tells them to show \"nerve\" at who they are and reveal themselves. The watchers then cast a vote regarding if Ty should kill Vee. The majority vote is \"yes\", and Ty shoots Vee.\n\nTommy and his hackers modify Nerve's source code to decrypt the watcher's code names and send them a message: \"You are an accessory to murder\". All watchers immediately log out of Nerve, closing down Nerve's servers and effectively ending the game once and for all. Vee is unharmed; she and Ty had staged her murder to scare the watchers into disbanding Nerve. Everyone's money and identities are restored.\n\nA few months later, Vee and Sydney have reconciled, Vee and Ian are a couple, and Vee is attending California Arts. Ian reveals that his real name is Sam.",
  "synopsis": "Venus \"Vee\" Delmonico (Emma Roberts) is a high school senior living on Staten Island. She surfs the web and gets a Facebook notification from her crush, J.P. (Brian Marc), who tagged her in a photo that she took. Vee gets a Skype chat invitation from her friend Sydney (Emily Meade). Syd mentions a game called 'Nerve' that is about to launch for the next 24 hours. The game involves \"watchers\" and \"players\" - the players are given dares to do in exchange for money, while the watchers pay to watch everything happen. Syd has signed on to play and encourages Vee to join her, but she declines.Vee wants to go away for college but is worried about leaving her mom Nancy (Juliette Lewis) behind all by herself. It's been years since Vee's brother died, and neither of them have really gotten over it.At school, Vee takes photos for the yearbook, but most of them feature J.P. She joins her friends Tommy (Miles Heizer), Liv (Kimiko Glenn) and Wes (Marc John Jeffries) at a pep rally. Syd gives Liv her phone to record her dare. She joins her fellow cheerleaders and moons the entire school. Her dare is complete.The gang later goes out to eat. Syd keeps trying to get Vee to join Nerve since Vee never takes risks. They see J.P. sitting with his buddies. Syd decides to go over and talk to J.P. for her. She asks him if he would be interested in going out with Vee, but J.P. says she's not his type. Upset, Vee leaves and goes home. She logs onto Nerve and is told the rules before she makes a move. Dares must be recorded on the players' phones, and if they bail or fail, they lose their money. Also, nobody can snitch on Nerve, or it'll end very badly. Vee decides to become a player. Immediately, Nerve starts to obtain all of Vee's personal information.Vee calls Tommy to take her to a diner for her first dare. She must kiss a stranger for five seconds to get $100. The clock is ticking as she hesitates to pick someone. She spots a guy named Ian (Dave Franco) reading her favorite book, Virginia Woolf's \"To The Lighthouse\". Vee kisses him while Tommy records. The dare is done. Vee goes over to Tommy, who is more annoyed than anything (he secretly likes Vee). When she turns around, Ian is gone. He is then spotted going all around the diner singing and putting on a grand performance as part of his dare. He goes to Vee's table, and she is dared to go to the city with him for $200. Although uncertain at first, Vee joins Ian on his motorcycle, leaving Tommy behind.Vee and Ian make it into the city and part ways. She then gets a new dare to try on a couture dress. Vee tries it on and then finds Ian in the same store trying on a suit. When they go back into their dressing rooms, they find all of their stuff is gone. The next dare for both of them is to leave the store. They remove their clothes and leave in their underwear. A bunch of watchers record them as they leave. They find the clothes from the store on Ian's motorcycle for them to keep. Their phones then buzz for the next dare. Before they head out, a player named Ty (Machine Gun Kelly) passes them and comments on their dares, and he also implies that he personally knows Ian.Tommy stays at the diner and decides to watch what Vee is doing. He gets in touch with his hacker friend Azhar (Samira Wiley) and asks for \"a ticket to Aruba\". Azhar thinks it's risky, but she sends him a code for access to a site called Aruba. Tommy discovers past videos of Ian playing Nerve a year earlier. He stole the motorcycle and was hanging from a crane with two other guys.Syd is going around the city with Liv and Wes to continue her dares while gaining more followers. She becomes displeased when she learns Vee is catching up to her watcher count.Vee and Ian go to a tattoo parlor. Ian draws a secret tattoo for Vee to get. It turns out to be a lighthouse as a nod to her favorite book.Nancy then notices that money is being transferred into her and Vee's joint account. She calls Tommy to ask what's going on. Tommy, unable to snitch, says Vee got a job and is having money transferred to her account.Vee and Ian then ride a carousel. Syd and her friends watch at a house party. Vee talks about joining Nerve to get Syd off her back, claiming that she always makes it look like Vee is insecure when it's really Syd that is insecure, and how she always has guys come over when her parents are away. Hurt, Syd seeks out a new dare. She encounters Ty at the party, who suggests that she team up with him. Syd declines. Ian then suggests to Vee that they go to the party.Syd gets really drunk and is then dared to walk across a ladder from one apartment to the next. It's especially terrifying for Syd because she's afraid of heights. After making it halfway, Syd slips and drops her phone. She bails out of Nerve.Vee and Ian arrive at the party. Syd takes the chance to call Vee out on what she said, leading to a huge fight between them, leaving Syd humiliated. Vee decides to complete Syd's dare and she walks across the ladder almost effortlessly. When she goes back to make up with Syd, she finds her making out with J.P. Vee then learns that Ian was dared to go to the party to get Vee and Syd to fight. Angered, Vee decides to tell the cops. Ian runs after her and pleads with her not to do that, but she doesn't listen. Vee sees a cop and tells him about Nerve, but he does nothing. Nancy then calls Vee and says all the money in their account has been taken. Now alone, Vee comes across Ty, who says he has to win the game, and he knocks her out cold.Vee wakes up in a freight container with \"SNITCHES GET STITCHES\" painted on the walls. A TV in the container turns on with a computer voice telling Vee that because she snitched, Nerve now controls her life, family, and future. The only way for her to escape is to win the game. She gets out of the container and is told to get on the ferry. She runs into Ian, who explains to her that like him, she is now a prisoner of the game. For Ian, it happened a year earlier when he, Ty, and a third guy named Robbie were dared to hang from a crane. Robbie slipped and fell to his death. Ian and Ty went to the cops, but Nerve ruined their lives and took away his money and his father's job. Ian says he will do a dare that places him ahead of Ty so that he and Vee can make it to the finals.Vee meets up with Tommy and Syd, where she reconciles with both of them. They get in touch with certain people as part of a plan. Meanwhile, Ian takes a dare in which he must hang from a crane with one hand for five seconds. He succeeds and advances to the final. Vee goes through the city and must pick up a package, which turns out to be a loaded gun.Vee and Ian make it to an arena in front of over a hundred watchers for the final round. Tommy and Syd meet up with Azhar to hack into Nerve's server, and Nancy meets with them there to watch the final round. The dare involves Vee and Ian having to shoot each other. Ian tells Vee to shoot him so she can win. Vee refuses. Ty appears and says he will shoot one of them. The watchers cheer him on. Vee decides to take the shot over Ian. As everyone records, she calls everyone out on wanting to watch someone die for the sake of their entertainment. Nerve then decides to put Vee's life to a vote. The majority votes YES for her to get shot. Ty fires the gun, and Vee goes down in Ian's arms. Every watcher then has their names exposed and a message notifying them that they are accessories to murder, with the option to sign out. Everyone does, allowing Azhar to crash Nerve's server and shut it down for good. Vee then reveals she was alive, having orchestrated the whole thing with Ty involved (he fired a blank).Everything goes back to normal, and Azhar makes it so that Vee and Nancy get their money back. Vee and Ian (who says his real name is Sam) decide to pursue a relationship. They share a kiss as the sun rises on a new day."
}