{
  "imdb_id": "tt3545504",
  "tmdb_id": "337260",
  "douban_id": null,
  "title": "Valley of Knights",
  "genres": [
    "Adventure",
    "Family",
    "Fantasy"
  ],
  "country": "Norway",
  "version": [
    {
      "runtime": "93 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.3,
  "director": [
    {
      "id": "nm5447175",
      "name": "Thale Persen"
    }
  ],
  "writer": [
    {
      "id": "nm0345674",
      "name": "Lars Gudmestad",
      "description": "story"
    },
    {
      "id": "nm0995943",
      "name": "Harald Rosenløw-Eeg",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm6472997",
      "name": "Stella Stenman",
      "character": "Mira       (as Stella Irene Stenheim Stenman)"
    },
    {
      "id": "nm2096866",
      "name": "Bjarte Tjøstheim",
      "character": "Anton /              Roy"
    },
    {
      "id": "nm0609240",
      "name": "Tone Beate Mostraum",
      "character": "Sara"
    },
    {
      "id": "nm3161495",
      "name": "Vetle Qvenild Werring",
      "character": "Kevin"
    },
    {
      "id": "nm1178594",
      "name": "Kyrre Hellum",
      "character": "Snerk"
    },
    {
      "id": "nm6472995",
      "name": "Emma Rebecca Storvik",
      "character": "Eiril"
    },
    {
      "id": "nm0473156",
      "name": "Herborg Kråkevik",
      "character": "Iris"
    },
    {
      "id": "nm7119015",
      "name": "Maria Brandshaug",
      "character": "Mugg       (as Maria Rudic Brandshaug)"
    },
    {
      "id": "nm1954234",
      "name": "Simon Lay",
      "character": "Nick"
    },
    {
      "id": "nm1499601",
      "name": "Silje Marie Korsnes",
      "character": "Miranda"
    },
    {
      "id": "nm7119016",
      "name": "Emilie Alsaker",
      "character": "Isabel       (as Emilie Alsaker Synnes)"
    },
    {
      "id": "nm7119017",
      "name": "Kalle Hennie",
      "character": "Lat"
    },
    {
      "id": "nm3664153",
      "name": "André Eriksen",
      "character": "Lut"
    },
    {
      "id": "nm2064587",
      "name": "Nils Jørgen Kaalstad",
      "character": "Farmer"
    },
    {
      "id": "nm6472999",
      "name": "Elyas Mohammed Salim",
      "character": "Fnugg       (as Elyas Salim)"
    },
    {
      "id": "nm7346680",
      "name": "Oliver Eidem Nyeng",
      "character": "Fnugg's Friend #1"
    },
    {
      "id": "nm9502222",
      "name": "Kaja Emilie Stenseth",
      "character": "Fnugg's Friend #2"
    },
    {
      "id": "nm7119018",
      "name": "John Eckhoff",
      "character": "Messenger"
    },
    {
      "id": "nm2961935",
      "name": "Rudi Simmons",
      "character": "Unhealthy Prison Guard"
    },
    {
      "id": "nm4679395",
      "name": "Linn-Jeanethe Kyed",
      "character": "Doctor"
    }
  ],
  "overview": "An evil lord, eager to rule the Valley of Knights, steals a magic suit of armor and is determined to hunt down the young queen for the missing part, the snow-making glove. But two courageous kids from our world are coming to her rescue.",
  "storyline": "There has been three years since Eiril was forced to close the portal between our world and Ridderdalen (Knight Valley) to keep evil away, and thereby she also parted herself from her best friend Kevin, with whom she restored Christmas in Ridderdalen. Now it's Christmas time again, and a deeply unhappy Kevin is still working hard to find another portal to Ridderdalen, while Eiril - whom in the meantime has become queen in the kingdom where Kevin is still celebrated by the people, known as the ''King of Christmas'' - is still as inconsolable, and Kevin's little sister Mira is working on putting her princess dreams behind. Their parents is struggling financially and fighting with each other, and there is not good times for the Grans, who might have to cancel yet another Christmas celebration. But then the evil lord Snerk stumbles upon a highly powerful magical armor, and now all he needs is Eiril's magic snow glove to complete it. Eiril is forced to escape - and by doing that, she ...",
  "plot": "Hidetora Ichimonji, a powerful though now elderly warlord, decides to divide his kingdom among his three sons: Taro, Jiro, and Saburo. Taro, the eldest, will receive the prestigious First Castle and become leader of the Ichimonji clan, while Jiro and Saburo will be given the Second and Third Castles. Hidetora is to retain the title of Great Lord and Jiro and Saburo are to support Taro.\n\nSaburo, however, points out that Hidetora is foolish if he expects his sons to be loyal to him, reminding him that even Hidetora had previously used the most ruthless methods to attain power. Hidetora infers the comments to be subversive, and when his servant Tango comes to Saburo's defense, he exiles both men. Fujimaki, a visiting warlord who had witnessed these events agrees with Saburo's frankness, and invites him to take his daughter's hand in marriage.\n\nFollowing the division of Hidetora's lands between his remaining two sons, Taro's wife Lady Kaede begins to urge her husband to usurp control of the entire Ichimonji clan. When Taro demands Hidetora renounce his title of Great Lord, Hidetora then storms out of the castle and travels to Jiro's castle, only to discover that Jiro is only interested in using Hidetora as a titular pawn.\n\nHidetora and his retinue then leave Jiro's castle as well without any clear destination. Eventually Tango appears with provisions but to no avail. Tango then tells Hidetora of Taro's new decree: death to whoever aids his father. At last Hidetora takes refuge in the Third Castle, abandoned after Saburo's forces followed their lord into exile. Tango does not follow him.\n\nShortly thereafter, Hidetora and his samurai retinue are besieged militarily by Taro and Jiro's combined forces. In a short but violent siege, virtually all defenders are slaughtered as the Third Castle is set alight. Solitarily, Hidetora succumbs to madness and wanders away from the burning castle. As Taro and Jiro's forces storm the castle, Taro is killed by a bullet shot by Jiro's general, Kurogane.\n\nHidetora is discovered wandering in the wilderness by Tango who is still loyal to him and who stays to assist Hidetora. In his madness, Hidetora is haunted by horrific visions of the people he destroyed in his quest for power. They take refuge in a peasant's home only to discover that the occupant is Tsurumaru, the brother of Lady Sué, Jiro's wife. Tsurumaru had been blinded and left impoverished after Hidetora took over his land and killed his father, a rival lord.\n\nWith Taro dead, Jiro becomes the Great Lord of the Ichimonji clan, enabling him to move into the First Castle. Upon Jiro's return from battle, Lady Kaede, who doesn't seem to be fazed by Taro's death, blackmails Jiro into having an affair with her, and she becomes the power behind his throne. Kaede demands that Jiro kill Lady Sué and marry her instead. Jiro orders Kurogane to do the deed, but he refuses, warning Jiro that Kaede means to ruin the entire Ichimonji clan. Kurogane then warns Sué and Tsurumaru to flee.\n\nTango, still watching over Hidetora with Kyoami, encounters two ronin who had once served as spies for Jiro. Before he kills them both, one of the ronin tells him that Jiro is considering sending assassins after Hidetora. Alarmed, Tango rides off to alert Saburo. Hidetora becomes even more insane and runs off into a volcanic plain with a frantic Kyoami in pursuit.\n\nSaburo's army crosses back into Jiro's territory to find him. News also reaches Jiro that two rival lords allied to Saburo (Ayabe and Fujimaki) have also entered the territory, forcing Jiro to hastily mobilize his army. At the field of battle, the two brothers accept a truce, but Saburo becomes alarmed when Kyoami arrives to tell of his father's descent into insanity. Saburo goes with Kyoami to rescue his father and takes 10 warriors with him; Jiro sends several gunners to follow Saburo and ambush them both.\n\nJiro then orders an attack on Saburo's much smaller force. Saburo's army retreats into the woods for cover and fires on Jiro's forces, frustrating the attack. In the middle of the battle a messenger arrives with news that a rival warlord, Ayabe, is marching on the First Castle, forcing Jiro's army to hastily retreat. Saburo then finds Hidetora in the volcanic plain; Hidetora partially recovers his sanity, and begins repairing his relationship with Saburo. However, one of the snipers Jiro had sent after Saburo's small group shoots and kills Saburo. Overcome with grief, Hidetora dies. Fujimaki and his army arrive to witness Tango and Kyoami lamenting the death of father and son.\n\nMeanwhile, Tsurumaru and Sué arrive at the ruins of a castle but inadvertently leave behind the flute that Sué previously gave Tsurumaru when he was banished. She gives a picture of Amida Buddha to him for company while she attempts to retrieve the missing flute. It is when she returns to Tsurumaru's hovel to retrieve it that she is ambushed and killed by Jiro's assassin.\n\nMeanwhile, Ayabe's army pursues Jiro's army to the First Castle and commences a siege. When Kurogane hears that Lady Sué has been finally murdered by one of Jiro's men, Kurogane confronts Kaede. She admits her perfidy and to her plotting to exact blood revenge against Hidetora and his Ichimonji clan for having destroyed her family years before. Enraged, Kurogane finally snaps and decapitates Kaede. Jiro, Kurogane, and all Jiro's men subsequently die in the battle with Ayabe's army that follows.\n\nA solemn funeral procession is held for Saburo and Hidetora. Meanwhile, left alone in the castle ruins, Tsurumaru accidentally drops, and loses, the Amida Buddha image Sué had given to him. The film ends with a distance shot of Tsurumaru, alone, silhouetted, atop the ruins.",
  "synopsis": null
}