{
  "imdb_id": "tt3506970",
  "tmdb_id": "253535",
  "douban_id": null,
  "title": "1983 (2014)",
  "genres": [
    "Family",
    "Sport"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "138 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.7,
  "director": [
    {
      "id": "nm6261619",
      "name": "Abrid Shine"
    }
  ],
  "writer": [
    {
      "id": "nm3350549",
      "name": "Bipin Chandran",
      "description": null
    },
    {
      "id": "nm6261619",
      "name": "Abrid Shine",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4028885",
      "name": "Nivin Pauly",
      "character": "Rameshan"
    },
    {
      "id": "nm1792604",
      "name": "Anoop Menon",
      "character": "Vijay Menon"
    },
    {
      "id": "nm0558593",
      "name": "Joy Mathew",
      "character": "Gopi Aashaan"
    },
    {
      "id": "nm6264784",
      "name": "Nikki Galrani",
      "character": "Manjula"
    },
    {
      "id": "nm6684208",
      "name": "Srinda Ashab",
      "character": "Susheela"
    },
    {
      "id": "nm1955570",
      "name": "Saiju Kurup",
      "character": "Pappan"
    },
    {
      "id": "nm6740245",
      "name": "Sanju Sivram",
      "character": "Babukuttan"
    },
    {
      "id": "nm3440031",
      "name": "Dinesh Nair",
      "character": "Ambrose Saji"
    },
    {
      "id": "nm3164291",
      "name": "Kalabhavan Prachod",
      "character": "Mantle Johnny"
    },
    {
      "id": "nm6697626",
      "name": "Neeraj Madhav",
      "character": "Prahaladan"
    },
    {
      "id": "nm6995812",
      "name": "Shibu Maradu",
      "character": "Mani"
    },
    {
      "id": "nm6995811",
      "name": "Binoy Antony",
      "character": "Basheer"
    },
    {
      "id": "nm1668938",
      "name": "Arun",
      "character": ""
    },
    {
      "id": "nm6788941",
      "name": "Shereej K. Basheer",
      "character": "Varkey"
    },
    {
      "id": "nm8344748",
      "name": "Gokulan",
      "character": "Kuttan"
    },
    {
      "id": "nm3065296",
      "name": "Jacob Gregory",
      "character": "Sachin"
    },
    {
      "id": "nm7898733",
      "name": "Jayashankar",
      "character": ""
    },
    {
      "id": "nm5672432",
      "name": "Jiya",
      "character": "Freddy"
    },
    {
      "id": "nm6995813",
      "name": "Sui Joseph",
      "character": "Chandru"
    },
    {
      "id": "nm6995816",
      "name": "Aryan Katuria",
      "character": "Boy in Cricket Academy"
    },
    {
      "id": "nm6995815",
      "name": "Tarush Katuria",
      "character": "Boy in Cricket Academy"
    },
    {
      "id": "nm0579772",
      "name": "Valsala Menon",
      "character": ""
    },
    {
      "id": "nm1550800",
      "name": "Ambika Mohan",
      "character": ""
    },
    {
      "id": "nm6995817",
      "name": "Deepika Mohan",
      "character": "Manjula's Aunt"
    },
    {
      "id": "nm1032596",
      "name": "Seema G. Nair",
      "character": "Rameshan's Mother"
    },
    {
      "id": "nm7972075",
      "name": "Sajan Palluruthy",
      "character": "Commentator"
    },
    {
      "id": "nm3654496",
      "name": "Nandu Poduval",
      "character": ""
    },
    {
      "id": "nm1340094",
      "name": "Sachin Tendulkar",
      "character": "Himself       (archive footage)"
    },
    {
      "id": "nm6995814",
      "name": "Karthik Thejus",
      "character": "Boy in Cricket Academy"
    },
    {
      "id": "nm6995810",
      "name": "Nandhan Unni",
      "character": "Navas"
    },
    {
      "id": "nm1269875",
      "name": "Priyanka Upendra",
      "character": "Pushpalatha       (as Priyanka)"
    }
  ],
  "overview": "A family drama that revolves around cricket, it will centre on the character Rameshan played by Nivin Pauly and his memories from 1983 when India won its first World Cup under Kapil Dev to 2013.",
  "storyline": "The story of Rameshan who has a huge craze for Cricket, and his final attempt to realize his cricket dream through his son.",
  "plot": "In 1980, Cuban refugee Antonio \"Tony\" Montana (Al Pacino) arrives in Miami, Florida, where he is sent to a refugee camp with his best friend Manny Ribera (Steven Bauer) and their associates Angel (Pepe Serna) and Chi-Chi (Ángel Salazar). The four are released from the camp in exchange for assassinating a former Cuban government official at the request of wealthy drug dealer Frank Lopez (Robert Loggia), and they are given green cards. They become dishwashers in a diner.\n\nFrank's henchman Omar Suarez (F. Murray Abraham) gives the group the opportunity to purchase cocaine from Colombian dealers, but the deal collapses. Angel is dismembered with a chainsaw, while Manny and Chi-Chi rescue Tony and kill the Colombians. Suspecting that Omar betrayed them, Tony and Manny insist on personally delivering the recovered drugs and money to Frank. During their meeting, Tony is attracted to Frank's girlfriend Elvira Hancock (Michelle Pfeiffer). He and Manny are hired to work for Frank.\n\nMonths later, Tony visits his mother Georgina (Míriam Colón) and younger sister Gina (Mary Elizabeth Mastrantonio), of whom he is fiercely protective. Disgusted by his life of crime, Georgina throws Tony out. Manny comments on Gina's beauty before being warned by Tony to stay away from her. Frank sends Tony and Omar to Bolivia to meet with cocaine kingpin Alejandro Sosa (Paul Shenar). Tony negotiates a deal without Frank's approval, angering Omar, who leaves to contact Frank. Sosa claims that Omar is a police informant and then has Tony witness as a beaten Omar is hanged from a helicopter. Tony vouches for Frank's organization, so Sosa agrees to the deal, parting with a warning that Tony should never betray him.\n\nBack in Miami, Frank is infuriated by Omar's demise and the unauthorized deal struck by Tony, prompting Tony to establish his own organization. At a nightclub, corrupt detective Mel Bernstein (Harris Yulin) attempts to extort money from Tony in return for police protection and information. Tony angers Frank further by openly pursuing Elvira in the club. Gina is also there, and Tony notices her dancing and being groped by a man. Hit men attempt to assassinate Tony, but he escapes from the club. Tony, Manny, and Chi-Chi go to Frank's office, certain that his former boss sent both Bernstein and the assassins. At gunpoint, Frank confesses to his involvement and begs for his life, but he and Bernstein are killed.\n\nTony marries Elvira and becomes the dealer of Sosa's supplies. He builds a multimillion-dollar empire, living in a vast, heavily guarded estate. By 1983, however, Tony becomes paranoid as he and Elvira excessively consume cocaine. His money launderer demands a greater percentage, while Manny grows resentful of Tony taking sole credit for their success. A sting by federal agents results in Tony being charged with money laundering and tax evasion. Sosa offers to use his government connections to keep Tony out of jail, but only if Tony first assassinates a journalist intending to expose Sosa. Later, Tony pushes Manny and Elvira further away by publicly blaming the former for his arrest and the latter of being infertile because of her excessive drug use. He travels without them to New York City, where Sosa's henchman, Alberto, plants a bomb on the journalist's car. However, the intended victim is unexpectedly accompanied by his wife and children, so Tony calls off the mission. Alberto insists on continuing, but Tony kills him.\n\nTony goes looking for Manny and Gina who are now married. After killing Manny, Tony returns to his mansion, where he buries his face in a large mound of cocaine. While Sosa's men invade the mansion and kill Tony's men, a drugged Gina accuses Tony of wanting her for himself and wounds him. One of Sosa's men then kills her and is killed by Tony. After failing to open the door for Chi-Chi who is killed upon arrival, Tony turns a grenade-launcher-equipped M-16 on Sosa's men, mowing down many. Tony is repeatedly shot, but continues to fight until he is fatally shot from behind with a shotgun. His body falls into a fountain below, in front of a statue reading \"The World is Yours.\"",
  "synopsis": null
}