{
  "imdb_id": "tt3510480",
  "tmdb_id": "284514",
  "douban_id": null,
  "title": "Spy Time (2015)",
  "genres": [
    "Action",
    "Comedy"
  ],
  "country": "Spain",
  "version": [
    {
      "runtime": "93 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.1,
  "director": [
    {
      "id": "nm1027519",
      "name": "Javier Ruiz Caldera"
    }
  ],
  "writer": [
    {
      "id": "nm3281140",
      "name": "Fernando Navarro",
      "description": "screenplay &"
    },
    {
      "id": "nm2054281",
      "name": "Pablo Alén",
      "description": "screenplay &"
    },
    {
      "id": "nm2856376",
      "name": "Breixo Corral",
      "description": "screenplay"
    },
    {
      "id": "nm7582705",
      "name": "Manuel Vázquez Gallego",
      "description": "based on the characters created by as Vázquez"
    }
  ],
  "cast": [
    {
      "id": "nm0002181",
      "name": "Imanol Arias",
      "character": "Anacleto"
    },
    {
      "id": "nm1273697",
      "name": "Quim Gutiérrez",
      "character": "Adolfo"
    },
    {
      "id": "nm1411610",
      "name": "Alexandra Jiménez",
      "character": "Katia"
    },
    {
      "id": "nm2015004",
      "name": "Berto Romero",
      "character": "Martín"
    },
    {
      "id": "nm1693112",
      "name": "Carlos Areces",
      "character": "Vázquez"
    },
    {
      "id": "nm0351053",
      "name": "Eduardo Gómez",
      "character": "Mac el Molécula"
    },
    {
      "id": "nm3168183",
      "name": "Dani El Rojo",
      "character": "Joe el Carnicero"
    },
    {
      "id": "nm0349427",
      "name": "Emilio Gutiérrez Caba",
      "character": "Jefe"
    },
    {
      "id": "nm0658041",
      "name": "Rossy de Palma",
      "character": "Madre de Katia"
    },
    {
      "id": "nm1526347",
      "name": "Sílvia Abril",
      "character": "Secretaria       (as Silvia Abril)"
    },
    {
      "id": "nm0179069",
      "name": "José Corbacho",
      "character": "Agente veterano       (as Jose Corbacho)"
    },
    {
      "id": "nm0119174",
      "name": "Andreu Buenafuente",
      "character": "Agente veterano"
    },
    {
      "id": "nm0786477",
      "name": "Toni Sevilla",
      "character": "Padre Katia"
    },
    {
      "id": "nm0097760",
      "name": "Gilbert Bosch",
      "character": "O'Hara"
    },
    {
      "id": "nm8079125",
      "name": "Qihui Zhu",
      "character": "Chino"
    },
    {
      "id": "nm8079126",
      "name": "Daniel Arias",
      "character": "Adolfo 12-14 años"
    },
    {
      "id": "nm8079127",
      "name": "Daniel Ripollés",
      "character": "Adolfo 6 años"
    },
    {
      "id": "nm1449383",
      "name": "Jaskaran Brady",
      "character": "Guarda prisión       (as Jaskaran Santino Brady)"
    },
    {
      "id": "nm3801140",
      "name": "Abdelali El Aziz",
      "character": "Árabe 1"
    },
    {
      "id": "nm8079128",
      "name": "Ulises",
      "character": "Árabe 2"
    },
    {
      "id": "nm1614513",
      "name": "Sebi Alcaraz",
      "character": "Jefe de bomberos"
    },
    {
      "id": "nm6587863",
      "name": "Iván Valentín",
      "character": "Segurata Disco"
    },
    {
      "id": "nm2952879",
      "name": "Lluís Subirós",
      "character": "Preso 1"
    },
    {
      "id": "nm2457182",
      "name": "José Antonio Marín",
      "character": "Preso       (as Pancho Marín)"
    },
    {
      "id": "nm8419087",
      "name": "Oscar Pérez",
      "character": "Matón"
    },
    {
      "id": "nm2808344",
      "name": "Jordi Font",
      "character": "Matón"
    },
    {
      "id": "nm8419088",
      "name": "Xavier Ribas",
      "character": "Matón"
    },
    {
      "id": "nm8419089",
      "name": "Eugeni Fusté",
      "character": "Matón"
    },
    {
      "id": "nm8419090",
      "name": "Jaime Conesa",
      "character": "Matón"
    },
    {
      "id": "nm5334514",
      "name": "Carmelo Quiroga",
      "character": "Sicario"
    },
    {
      "id": "nm1766145",
      "name": "Juan Navarro",
      "character": "Sicario"
    },
    {
      "id": "nm5772575",
      "name": "Juan Carlos Lopez",
      "character": "Sicario"
    },
    {
      "id": "nm8419091",
      "name": "Akira Hirano",
      "character": "Sicario"
    },
    {
      "id": "nm3001847",
      "name": "Oscar González",
      "character": "Sicario"
    },
    {
      "id": "nm4150387",
      "name": "Txema Lorente",
      "character": "Sicario"
    },
    {
      "id": "nm1376600",
      "name": "Oriol Tarrida Homedes",
      "character": "Sicario       (as Oriol Tarrida)"
    },
    {
      "id": "nm8419092",
      "name": "Sara Leal",
      "character": "Transeúnte"
    },
    {
      "id": "nm4411585",
      "name": "Marc Padró",
      "character": "Transeúnte"
    },
    {
      "id": "nm8419094",
      "name": "Xavi Delapura",
      "character": "Ladrón Electromarket"
    },
    {
      "id": "nm2007317",
      "name": "Carles Curt",
      "character": "Ladrón Electromarket"
    },
    {
      "id": "nm8419095",
      "name": "Bea Álvarez",
      "character": "Amiga Katia disco"
    },
    {
      "id": "nm4202568",
      "name": "Nuria Landete",
      "character": "Amiga Katia disco"
    },
    {
      "id": "nm2174207",
      "name": "Vicky Mullor",
      "character": "Amiga Katia disco"
    },
    {
      "id": "nm8419093",
      "name": "Muhammad Anis",
      "character": "Paquistaní"
    },
    {
      "id": "nm5116970",
      "name": "Marta Rama",
      "character": "Amiga Katia disco"
    },
    {
      "id": "nm8419096",
      "name": "Iago Valcarcel",
      "character": "Niño estación"
    },
    {
      "id": "nm3749785",
      "name": "Daniel Arias",
      "character": "Adolfo 12 /              13 años       (credit only)"
    }
  ],
  "overview": "Adolfo, a thirty something security guard, is going through a bad patch. Not only his lifetime girlfriend has just to finished with him to be a guy with no ambition but, moreover, he becomes the target of a series of thugs led by Vázquez, a dangerous criminal who has just escaped from jail. Also he discovers that his father has a double identity. He is not a farmer engaged in the production of cold meat – as Adolfo has believed all his life, but Anacleto, a secret agent who is a bit down and the man who locked Vázquez up in jail thirty years ago. Adolfo will have to leave his comfort zone and work with his father, the person that Adolfo get on worse with in the world to survive the revenge of Vazquez and while, between shootouts and chases, trying to get his girlfriend back.",
  "storyline": "Adolfo, a thirty something security guard, is going through a bad patch. Not only his lifetime girlfriend has just to finished with him to be a guy with no ambition but, moreover, he becomes the target of a series of thugs led by Vázquez, a dangerous criminal who has just escaped from jail. Also he discovers that his father has a double identity. He is not a farmer engaged in the production of cold meat - as Adolfo has believed all his life, but Anacleto, a secret agent who is a bit down and the man who locked Vázquez up in jail thirty years ago. Adolfo will have to leave his comfort zone and work with his father, the person that Adolfo get on worse with in the world to survive the revenge of Vazquez and while, between shootouts and chases, trying to get his girlfriend back.",
  "plot": "Susan Cooper (Melissa McCarthy) is a 40-year-old, single, desk-bound CIA employee who remotely assists her partner, field agent Bradley Fine (Jude Law), on a mission. Fine accidentally kills arms dealer Tihomir Boyanov as he sneezes during a confrontation before extracting the location of a suitcase nuke from him. Susan uncovers evidence that Rayna (Rose Byrne), Boyanov's daughter, has contacted Sergio De Luca (Bobby Cannavale), a suspected broker with ties to various terrorist groups, so Fine infiltrates her home. However, Rayna shoots Fine dead, while Susan watches helplessly online, then reveals that she knows the identities of the agency's top agents, including Rick Ford (Jason Statham) and Karen Walker (Morena Baccarin). Susan, who is almost certainly unknown to Rayna, volunteers to track her. (She was a top trainee agent, albeit over ten years ago.) When her boss, Elaine Crocker (Allison Janney), reluctantly agrees, the ultra macho Ford quits in disgust.\n\nWith her best friend Nancy (Miranda Hart) providing intelligence, Susan goes to Paris undercover. That night, Ford shows up and tells Susan she will fail because of her inexperience. The next morning, Susan discovers that De Luca's office has burned down. She finds a photo of a man standing next to the fire. Ford appears, argues with Susan again and leaves. Susan sees the man in the photo follow him and switch his backpack with another one containing a bomb while Ford is distracted. Susan warns Ford in time and pursues the man into an abandoned building. During the ensuing fight, he falls to his death. When she checks the man's video camera, Susan learns that De Luca is going to Rome.\n\nIn Rome, Susan meets her contact Aldo (Peter Serafinowicz). She follows Sergio into a casino, where she saves Rayna's life. Rayna brings Susan into her inner circle and takes Susan on her private plane to Budapest. In mid-flight, the steward kills Rayna's bodyguard and pilots, but Susan subdues him. Rayna believes Susan to be a CIA agent, but Susan convinces her that she was hired by Boyanov to protect his daughter.\n\nIn Budapest, Susan meets Nancy, who was sent by Crocker. After being shot at, Susan pursues and catches up with the would-be assassin: Karen, who sold Rayna the names of the other agents. She tries to shoot Susan, but an unknown sniper kills her. Susan, Nancy and Aldo accompany Rayna to a party to meet Rayna's contact. That turns out to be Lia (Nargis Fakhri), the woman who distracted Ford in Paris. Nancy creates a diversion (by pretending to be a crazed fan of guest performer 50 Cent) so that Susan can try to apprehend Lia unnoticed. Because of Ford's inopportune intervention, however, Lia runs off. Susan chases after her. After a brutal fight, as Susan is about to kill Lia, she is instead killed by Fine, who earlier faked his death and is now Rayna's lover and associate.\n\nRayna imprisons Susan and Aldo in a bunker. Later, Fine reveals to Susan that he is trying to gain Rayna's trust to locate the nuke, and he was the one who killed Karen. Susan and Aldo escape. At De Luca's mansion, Fine, Rayna and Sergio wait for Solsa Dudaev (Richard Brake), head of an al-Qaeda-funded terrorist group. Susan convinces Rayna and Deluca that, even though she works for the CIA, she will do anything to protect Fine, admitting that she loves him. Dudaev gives De Luca a suitcase full of diamonds, and Rayna produces the device. De Luca has Dudaev and his men killed, then reveals his plan to sell the device to another buyer (though they also intend to bomb New York City), before pointing his gun at Rayna. Ford distracts him, allowing Susan to kill his men. Sergio escapes to his helicopter with the device and the diamonds, but Susan grabs onto the landing gear. In the ensuing struggle, Susan throws the diamonds and the device into a lake below. De Luca attempts to shoot Susan, but Nancy, following in another helicopter, shoots him in the back before he can. He grabs on to Susan's necklace (a gift from Fine), but she releases the catch and De Luca falls out of the helicopter to his death.\n\nThe nuke is retrieved by the CIA, and Rayna is arrested. Ford, to Susan's surprise, compliments her on her job. Crocker tells Susan that she will remain a field agent, and that her next assignment will take her to Prague to infiltrate a drug smuggling ring. Fine invites Susan to dinner, but she instead opts for a night out with Nancy.\n\nThe next morning, Susan wakes up in bed next to Ford and screams. It is implied that they slept together, and Ford says that she loved it.",
  "synopsis": null
}