{
  "imdb_id": "tt3520418",
  "tmdb_id": "291272",
  "douban_id": null,
  "title": "We Are Still Here (2015)",
  "genres": [
    "Horror"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm0313295",
      "name": "Ted Geoghegan"
    }
  ],
  "writer": [
    {
      "id": "nm0313295",
      "name": "Ted Geoghegan",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0186225",
      "name": "Barbara Crampton",
      "character": "Anne Sacchetti"
    },
    {
      "id": "nm2426419",
      "name": "Andrew Sensenig",
      "character": "Paul Sacchetti"
    },
    {
      "id": "nm0547273",
      "name": "Lisa Marie",
      "character": "May Lewis"
    },
    {
      "id": "nm0275244",
      "name": "Larry Fessenden",
      "character": "Jacob Lewis"
    },
    {
      "id": "nm0548449",
      "name": "Monte Markham",
      "character": "Dave McCabe"
    },
    {
      "id": "nm0316808",
      "name": "Susan Gibney",
      "character": "Maddie"
    },
    {
      "id": "nm4276526",
      "name": "Michael Patrick Nicholson",
      "character": "Harry Lewis       (as Michael Patrick)"
    },
    {
      "id": "nm5367114",
      "name": "Kelsea Dakota",
      "character": "Daniella"
    },
    {
      "id": "nm2173693",
      "name": "Guy Gane",
      "character": "Lassander Dagmar       (as Guy Gane III)"
    },
    {
      "id": "nm2233462",
      "name": "Elissa Dowling",
      "character": "Eloise Dagmar"
    },
    {
      "id": "nm4602226",
      "name": "Zorah Burress",
      "character": "Fiona Dagmar"
    },
    {
      "id": "nm6290115",
      "name": "Marvin Patterson",
      "character": "Joe the Electrician"
    },
    {
      "id": "nm6286332",
      "name": "Connie Neer",
      "character": "Cat McCabe"
    },
    {
      "id": "nm6290118",
      "name": "Samantha Buckman",
      "character": "Buffalo Bill's Waitress"
    },
    {
      "id": "nm6290116",
      "name": "Richard Barry",
      "character": "Paramedic 1"
    },
    {
      "id": "nm6290117",
      "name": "Edward Prunella",
      "character": "Paramedic 2"
    },
    {
      "id": "nm3632159",
      "name": "Jill Burress",
      "character": "Margaret-Ann (Townsperson)"
    },
    {
      "id": "nm3641723",
      "name": "Paul Burress",
      "character": "Billy Dee (Townsperson)"
    },
    {
      "id": "nm6290120",
      "name": "Michael Conolly",
      "character": "Chester (Townsperson)"
    },
    {
      "id": "nm3730578",
      "name": "Dave MacLean",
      "character": "Reggie (Townsperson)"
    },
    {
      "id": "nm6290087",
      "name": "Jay Rogowski",
      "character": "Lem (Townsperson)"
    },
    {
      "id": "nm6290089",
      "name": "Jess Sabatini",
      "character": "Beth (Townsperson)       (as Jessica Sabatini)"
    },
    {
      "id": "nm6290119",
      "name": "Craig Simmons",
      "character": "Jethro (Townsperson)"
    },
    {
      "id": "nm1824746",
      "name": "John Torrani",
      "character": "Townsperson"
    }
  ],
  "overview": "After the death of their college age son, Anne and Paul Sacchetti relocate to the snowswept New England hamlet of Aylesbury, a sleepy village where all is most certainly not as it seems. When strange sounds and eerie feelings convince Anne that her son's spirit is still with them, they invite an eccentric, New Age couple to help them get to the bottom of the mystery.",
  "storyline": "After their teenage son is killed in a car crash, Paul (Andrew Sensenig) and Anne (Barbara Crampton) move to the quiet New York countryside to try to start a new life for themselves. But the grieving couple unknowingly becomes the prey of a family of vengeful spirits that reside in their new home, and before long they discover that the seemingly peaceful town they've moved into is hiding a terrifyingly dark secret. Now they must find a way to overcome their sorrow and fight back against both the living and dead as the malicious ghosts threaten to pull their souls - and the soul of their lost son - into hell with them.",
  "plot": "In 1979, after the tragic death of their son Bobby in a car accident, Anne (Barbara Crampton) and Paul Sacchetti (Andrew Sensenig) have decided to move to a new home in rural New England in the hopes that it will bring them some closure. Paul especially hopes that it will be therapeutic for Anne, as the death has hit her particularly hard and caused her to spiral into a deep depression. However, as soon as they arrive Anne starts claiming that Bobby is present in the house and a neighbor named Cat (Connie Neer) covertly warns them to leave the house. The house itself is also the focus of some controversy in the area, as it was built in the 1800s by the Dagmar family as a funeral home. The Dagmars were reportedly run out of the village after the townspeople discovered that they were swindling their customers by selling the corpses and burying empty caskets.\n\nUndeterred, Anne invites her friends May and Jacob Lewis (Lisa Marie and Larry Fessenden), as they are both spiritualists and could help contact Bobby, as well as explain the strange supernatural occurrences happening in the house. Upon their arrival the two couples go out to eat, during which time the Lewises' son Harry (Michael Patrick) arrives with his girlfriend Daniella (Kelsea Dakota) - Soon after arriving Harry is killed by an apparition on the basement stairs while Daniella watches. She flees the house in horror and drives away, only to be killed a short distance away. The Lewises and the Sacchettis head home, after which Cat's husband Dave (Monte Markham) arrives at the restaurant, murders a waitress, and then angrily discusses the Dagmar house with the restaurant's bartender, revealing that the house needs to feed every 30 years or the evil beneath it will search out fresh souls, potentially destroying the town.\n\nJacob eventually manages to convince a reluctant Paul to hold a seance with him while their wives are out. This ends with Jacob becoming possessed by the spirit of Lassander Dagmar (Guy Gane III), who reveals that they were never run out of town, rather the villagers used him and his family as a sacrifice to the evil under their home. Lassander, overcome with rage, then causes Jacob to kill himself. His wife May tries to flee, only to be killed by Dave, who has come to the house with the other townspeople, determined to give the darkness under the home what it wants. The Sacchettis then hear the voice of their son Bobby urging them to leave the house, and flee upstairs as Dave and the townspeople begin breaking into and entering the house. The spirits of the Dagmar family then proceed to violently murder every one of the townspeople in the house until only Dave, Paul, and Anne remain. Still intending to sacrifice them, Dave tries to kill Anne and Paul, but before he can do so, he is killed by Lassander's spirit. As Paul and Anne stare at the carnage around them, the spirits of the family depart from the house, finally satisfied with their revenge. Still believing her son is in the home, Anne dazedly walks into the house's cellar, followed moments later by her husband. As he peers down the stairs, Paul smiles slightly, then says \"Hey Bobby\".",
  "synopsis": null
}