{
  "imdb_id": "tt3590858",
  "tmdb_id": "421512",
  "douban_id": null,
  "title": "Urban & the Shed Crew (2015)",
  "genres": [
    "Drama"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "112 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm4692370",
      "name": "Candida Brady"
    }
  ],
  "writer": [
    {
      "id": "nm4692370",
      "name": "Candida Brady",
      "description": null
    },
    {
      "id": "nm6351156",
      "name": "Bernard Hare",
      "description": null
    },
    {
      "id": "nm6351157",
      "name": "Tiffany Sharp",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm6027109",
      "name": "Fraser Kelly",
      "character": "Urban"
    },
    {
      "id": "nm0035514",
      "name": "Richard Armitage",
      "character": "Chop"
    },
    {
      "id": "nm0295484",
      "name": "Anna Friel",
      "character": "Greta"
    },
    {
      "id": "nm6390427",
      "name": "Charlie Heaton",
      "character": "Frank"
    },
    {
      "id": "nm6390428",
      "name": "Jonathan Payne",
      "character": "Skeeter"
    },
    {
      "id": "nm6390429",
      "name": "Liam Ainsworth",
      "character": "Sparky"
    },
    {
      "id": "nm6390430",
      "name": "Olivia Downie Hullah",
      "character": "Molly"
    },
    {
      "id": "nm6390431",
      "name": "Olivia Tomlinson",
      "character": "Kara"
    },
    {
      "id": "nm6390432",
      "name": "Oscar Rogers",
      "character": "Sam"
    },
    {
      "id": "nm3489966",
      "name": "Nadine Mulkerrin",
      "character": "Amber       (as Nadine Rose Mulkerrin)"
    },
    {
      "id": "nm5524639",
      "name": "Ellie Rooney-West",
      "character": "TLS"
    },
    {
      "id": "nm0607403",
      "name": "Neil Morrissey",
      "character": "Doc"
    },
    {
      "id": "nm1346163",
      "name": "Curtis Flowers",
      "character": "COD"
    },
    {
      "id": "nm1161086",
      "name": "Phil Rowson",
      "character": "Policeman 1"
    },
    {
      "id": "nm0816186",
      "name": "Darren Southworth",
      "character": "Policeman 2"
    },
    {
      "id": "nm0238776",
      "name": "Kathryn Drysdale",
      "character": "Madge"
    },
    {
      "id": "nm5949474",
      "name": "Ryan Ward",
      "character": "Burner Brown"
    },
    {
      "id": "nm0461837",
      "name": "Bobby Knutt",
      "character": "Old Man"
    },
    {
      "id": "nm0303219",
      "name": "Terry Dalloway",
      "character": "Burley Neighbour 1"
    },
    {
      "id": "nm0683672",
      "name": "Jacqueline Pilton",
      "character": "Alison"
    },
    {
      "id": "nm0515987",
      "name": "Gabrielle Lloyd",
      "character": "Senior Social Worker"
    },
    {
      "id": "nm5324035",
      "name": "Jamie-Lee O'Donnell",
      "character": "Reporter"
    },
    {
      "id": "nm1623644",
      "name": "Mark Stratton",
      "character": "Desk Officer"
    },
    {
      "id": "nm1236749",
      "name": "Peter Foster",
      "character": "Sergeant"
    },
    {
      "id": "nm7224652",
      "name": "Bill Blackwood",
      "character": "Bob - Drunk"
    },
    {
      "id": "nm3633825",
      "name": "Rob Jarman",
      "character": "Police Driver 1"
    },
    {
      "id": "nm2738134",
      "name": "Matt Sherrin",
      "character": "Police Driver 2"
    },
    {
      "id": "nm6066682",
      "name": "Pete Szoradi",
      "character": "Local"
    }
  ],
  "overview": "A hard living, disillusioned, ex social worker becomes the unlikely savior to an anarchic gang of joy-riding, drug taking, thieving, out of control, care home runaway kids.",
  "storyline": "Based on Bernard Hare's Orwell nominated memoir Urban and The Shed Crew. 11 year old Urban's been running away from care since he was 5, (6 care, 8 foster homes in 6 years), he's Britain's most runaway child...When he can't find his mum, he sleeps rough on the streets, or in a shed with other runaways, The Shed Crew'. He's never known a dad, just his mentally ill, addict mum, Greta. So when she meets Chop, the first decent bloke they've ever known, Urban feels hope for the first time. For Chop, the once idealistic ex-social worker, it's a chance of redemption. He takes the broken family in, helps Greta., teaches Urban and his brother Frank lessons in life. But the family's new found happiness is all too fleeting as Greta's propensity to self-destruct proves too strong...leaving Urban to cope with the fallout the only way he knows how.",
  "plot": "Sometime in the 21st century, a series of crop blights on Earth threatens humanity's survival. Joseph Cooper, a widowed former NASA pilot, runs a farm with his father-in-law, son Tom, and daughter Murphy, who believes her bedroom is haunted by a poltergeist. Living in a post-truth society (Cooper is reprimanded at school for telling Murphy that the Apollo missions did indeed happen), Cooper encourages Murphy to carefully observe and record what she sees. They realize that a pattern of dust on the floor is created by gravity variations and are able to decode it as a set of geographic coordinates.\n\nCooper and Murphy follow them to a secret facility, where Cooper's former professor, Dr. Brand, continues to operate NASA in secrecy after it was officially defunded. Brand reveals that a wormhole which appeared near Saturn opens a pathway to a distant galaxy with potentially habitable planets. Twelve volunteers traveled through it, each assessing a planet's suitability as humanity's new home. Volunteers Miller, Edmunds and Mann have sent back encouraging data from planets near a black hole called Gargantua. Brand recruits Cooper to pilot the spaceship Endurance, carrying 5,000 frozen embryos for a \"Plan B\": to colonize a habitable planet to ensure humanity's survival. The only option for the majority of mankind to survive is his continued work on a \"Plan A\" – a gravitational theory for propulsion that would allow a mass exodus from Earth. Cooper agrees to go, upsetting Murphy who feels abandoned.\n\nCooper's crew consists of scientists Romilly, Doyle, Brand's daughter Amelia, and robots TARS and CASE. Traversing the wormhole, they use a lander to investigate Miller's planet, where time is severely dilated (one hour equals seven years on Earth). Finding only wreckage from the expedition, Amelia retrieves Miller's data just before a gigantic tidal wave hits, killing Doyle and water-logging the engines. After returning to Endurance, they discover that 23 years have elapsed on Earth.\n\nMurphy, now an adult scientist, has been assisting Dr. Brand with his research. On his deathbed, he admits to her that he never considered Plan A feasible; Plan B was the only plan. In a recorded video session Murphy notifies Amelia of her father's death, accusing her and Cooper of abandoning Earth. However, believing the equations can be solved, she continues working on a solution to Plan A, knowing she needs more data on gravitational singularities.\n\nWith limited fuel, the crew chooses Mann's planet over Edmunds' as the next stop, since Mann is still transmitting. Mann assures the crew that the frozen planet is habitable despite its ammonia-laden atmosphere. However, he soon attempts to kill Cooper, revealing that he falsified data in the hope of being rescued. Stealing Cooper's lander, he heads for Endurance while Romilly is killed by a booby trap set by Mann. Amelia rescues Cooper and they race to Endurance in a second lander. Mann attempts a dangerous manual docking operation and is killed in the attempt, severely damaging the Endurance in the process. Cooper uses the lander to stabilize the ship.\n\nCASE warns Cooper that Endurance is slipping toward Gargantua's pull. Cooper decides to use Gargantua as a gravitational slingshot to propel the ship toward Edmunds' planet. To shed weight, Cooper and TARS jettison themselves toward the black hole, so that Amelia and CASE can complete \"Plan B\". Slipping past the event horizon, Cooper and TARS find themselves inside a tesseract, which resembles a stream of bookshelves capable of peering into Murphy's bedroom at different periods in her life. Cooper surmises that the tesseract and wormhole were created to enable communication with Murphy and that he was her \"ghost\" all along. Using the second-hand on the watch he gave her before he left, Cooper relays the quantum data Murphy needs to solve the gravitational equation.\n\nFollowing a turbulent ejection, Cooper awakens in a space habitat orbiting Saturn. He reunites with an aged Murphy, who is nearing death. At Murphy's request, Cooper and TARS leave to rejoin Amelia on Edmunds' habitable planet, where she is preparing a new human colony.",
  "synopsis": "It's been described as a tale of heroin and cement, set in Britain's underclass in the 90s.Twelve-year old Urban Grimshaw is Britain's most runaway child, he's even been on TVs Crimewatch. His mother is a junkie and his father might as well be dead. He can't read or write, and he doesn't go to school. His average day is spent sitting around a bonfire with his mates smoking drugs and stealing cars. When he meets his mother's new friend Chop, a 37 year old, disillusioned, ex-social worker also living on society's margins, on one of Leeds roughest estates, the two become firm friends.But even Chop with his own penchant for drink, drugs and hard living is shocked by the state of Urban's life. After much soul searching he resolves to clean up his own act and save the kid. But as their friendship deepens, Urban introduces him to the Shed Crew the anarchic gang of kids aged between ten and fourteen years who spend their time joy-riding, thieving, and engaging in drugs and sex. It is only then that we see exactly how long the road to civilization really is.When ex-social worker Bernard Hare turned his startling experiences with a group of young delinquents into a novel it was described as one of the year's most compelling and best selling books. Urban and the Shed Crew is a stunning piece of ethnography described by The Guardian as moving but never sanctimonious, another City of God, this time for Britain rather than Brazil."
}