{
  "imdb_id": "tt3696218",
  "tmdb_id": "380436",
  "douban_id": null,
  "title": "Von glücklichen Schafen (2015)",
  "genres": [
    "Drama"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "96 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm0845608",
      "name": "Kadir Sözen"
    }
  ],
  "writer": [
    {
      "id": "nm0845608",
      "name": "Kadir Sözen",
      "description": "story"
    },
    {
      "id": "nm0845608",
      "name": "Kadir Sözen",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm1735235",
      "name": "Narges Rashidi",
      "character": "Elmas"
    },
    {
      "id": "nm0299811",
      "name": "Benno Fürmann",
      "character": "Klaus"
    },
    {
      "id": "nm6458090",
      "name": "Jascha Baum",
      "character": "Can"
    },
    {
      "id": "nm2414404",
      "name": "Vedat Erincin",
      "character": "Opa"
    },
    {
      "id": "nm6458091",
      "name": "Marlene Metternich",
      "character": "Sevgi"
    },
    {
      "id": "nm3304257",
      "name": "David Hürten",
      "character": "Stefan"
    },
    {
      "id": "nm4411920",
      "name": "Pauline Fuchs",
      "character": "Claudia"
    },
    {
      "id": "nm0830105",
      "name": "Hans Martin Stier",
      "character": "Priester"
    },
    {
      "id": "nm0256660",
      "name": "Erhan Emre",
      "character": "Musiker"
    },
    {
      "id": "nm0856917",
      "name": "Anna Thalbach",
      "character": "Lehrerin"
    }
  ],
  "overview": null,
  "storyline": "The perfect world of a small family breaks, when Can discover that his mother works in a brothel. In a maelstrom of anger, guilt and despair Mother and son are forced to forgive himself.",
  "plot": null,
  "synopsis": "Elmas lebt mit ihren beiden Kindern Can und Sevgi zusammen. Auf sich allein gestellt arbeitet Elmas hart dafür, ihren Kindern eine heile Welt zu bieten. Doch die Idylle zerbricht, als der 16jährige Can herausfindet, dass seine Mutter als Prostituierte arbeitet. Er reagiert hilflos und aggressiv. Aber auch Elmas ist am Boden zerstört und klammert sich in ihrer Verzweiflung an ihre Tochter Sevgi. Doch Can flieht kurzerhand mit Sevgi zu ihrem Opa. Elmas steht nun vollkommen alleine da. Sie fällt in ein tiefes Loch, sie hat in den vergangenen Jahren ausschließlich für ihre Kinder gelebt. Nur langsam begreift sie, dass sie sich selbst vergeben und ihr Leben in den Griff bekommen muss, um ihre Familie und sich selbst retten zu können. Sie zieht einen Schlussstrich unter die Prostitution, sucht sich eine neue Arbeit und lernt wieder Freude am Leben zu haben - unabhängig von ihren Kindern. Mit viel Geduld gelingt es dem Opa, Can seiner Mutter wieder näher zu bringen. Dabei kommt es zu einem verhängnisvollen Missverständnis. Voller Zorn zündet Can das Bordell an, in dem Elmas tätig war.Elmas konfrontiert Can mit seiner Tat und gewinnt das emotionale Kräftemessen mit ihrem Sohn. Can und Sevgi kommen zu ihr zurück, die Familie ist auf dem Weg, einen Neuanfang zu schaffen. Da stellt Elmas ehemaliger Arbeitgeber sie vor die Wahl: Entweder arbeitet sie wieder für ihn als Prostituierte, um den Schaden am Bordell zu begleichen, oder er wird Can vernichten. Es kommt zu einem Kampf, Elmas wird schwer verletzt. Es folgen Tage des Bangens um ihr Leben, in denen der Opa und seine Enkel bei Elmas wachen..."
}