{
  "imdb_id": "tt3659388",
  "tmdb_id": "286217",
  "douban_id": "25864085",
  "title": "The Martian (2015)",
  "genres": [
    "Adventure",
    "Drama",
    "Sci-Fi"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "144 min",
      "description": ""
    },
    {
      "runtime": "151 min",
      "description": "extended cut"
    }
  ],
  "imdb_rating": 8.0,
  "director": [
    {
      "id": "nm0000631",
      "name": "Ridley Scott"
    }
  ],
  "writer": [
    {
      "id": "nm1206844",
      "name": "Drew Goddard",
      "description": "screenplay"
    },
    {
      "id": "nm1083982",
      "name": "Andy Weir",
      "description": "book"
    }
  ],
  "cast": [
    {
      "id": "nm0000354",
      "name": "Matt Damon",
      "character": "Mark Watney"
    },
    {
      "id": "nm1567113",
      "name": "Jessica Chastain",
      "character": "Melissa Lewis"
    },
    {
      "id": "nm1325419",
      "name": "Kristen Wiig",
      "character": "Annie Montrose"
    },
    {
      "id": "nm0001099",
      "name": "Jeff Daniels",
      "character": "Teddy Sanders"
    },
    {
      "id": "nm0671567",
      "name": "Michael Peña",
      "character": "Rick Martinez"
    },
    {
      "id": "nm0000293",
      "name": "Sean Bean",
      "character": "Mitch Henderson"
    },
    {
      "id": "nm0544718",
      "name": "Kate Mara",
      "character": "Beth Johanssen"
    },
    {
      "id": "nm1659221",
      "name": "Sebastian Stan",
      "character": "Chris Beck"
    },
    {
      "id": "nm0377336",
      "name": "Aksel Hennie",
      "character": "Alex Vogel"
    },
    {
      "id": "nm0252230",
      "name": "Chiwetel Ejiofor",
      "character": "Vincent Kapoor"
    },
    {
      "id": "nm0938950",
      "name": "Benedict Wong",
      "character": "Bruce Ng"
    },
    {
      "id": "nm4496875",
      "name": "Mackenzie Davis",
      "character": "Mindy Park"
    },
    {
      "id": "nm2255973",
      "name": "Donald Glover",
      "character": "Rich Purnell"
    },
    {
      "id": "nm2945137",
      "name": "Nick Mohammed",
      "character": "Tim Grimes"
    },
    {
      "id": "nm3481199",
      "name": "Shu Chen",
      "character": "Zhu Tao"
    },
    {
      "id": "nm0304708",
      "name": "Eddy Ko",
      "character": "Guo Ming"
    },
    {
      "id": "nm0162281",
      "name": "Enzo Cilenti",
      "character": "Mike Watkins"
    },
    {
      "id": "nm0034877",
      "name": "Jonathan Aris",
      "character": "Brendan Hatch"
    },
    {
      "id": "nm6052308",
      "name": "Gruffudd Glyn",
      "character": "Jack"
    },
    {
      "id": "nm4130316",
      "name": "Geoffrey Thomas",
      "character": "U.S. President"
    },
    {
      "id": "nm7608065",
      "name": "Yang Haiwen",
      "character": "Chinese Flight Director"
    },
    {
      "id": "nm5777030",
      "name": "Tsogtsaikan Narantsogt",
      "character": "Wen Jiang       (as Narantsogt Tsogtsaikhan)"
    },
    {
      "id": "nm1340370",
      "name": "Brian Caspe",
      "character": "Timer Controller"
    },
    {
      "id": "nm1295966",
      "name": "Matt Devere",
      "character": "Satcon"
    },
    {
      "id": "nm1808061",
      "name": "Mike Kelly",
      "character": "Launcher Interface"
    },
    {
      "id": "nm0650433",
      "name": "Szonja Oroszlán",
      "character": "Launch Control       (as Szonja Oroszlan)"
    },
    {
      "id": "nm1333649",
      "name": "Greg De Cuir",
      "character": "Capcom       (as Greg De Cuir Jr.)"
    },
    {
      "id": "nm2852393",
      "name": "Mark O'Neal",
      "character": "Guidance"
    },
    {
      "id": "nm0512897",
      "name": "Peter Linka",
      "character": "Telemetry"
    },
    {
      "id": "nm0360426",
      "name": "Declan Hannigan",
      "character": "Comms"
    },
    {
      "id": "nm6928944",
      "name": "Peter Schueller",
      "character": "NASA Break Room Worker"
    },
    {
      "id": "nm5543734",
      "name": "Waleska Latorre",
      "character": "Vincent's Secretary"
    },
    {
      "id": "nm5017926",
      "name": "Frederik Pleitgen",
      "character": "CNN Reporter"
    },
    {
      "id": "nm1089077",
      "name": "Nikolett Barabas",
      "character": "Reporter 1       (as Nikolett Barabás)"
    },
    {
      "id": "nm2419609",
      "name": "Karen Gagnon",
      "character": "Reporter 2"
    },
    {
      "id": "nm1584324",
      "name": "Lili Bordán",
      "character": "Reporter 3       (as Lili Bordan)"
    },
    {
      "id": "nm1591872",
      "name": "Charlie Gardner",
      "character": "Robert Lewis"
    },
    {
      "id": "nm3287060",
      "name": "Nóra Hörich",
      "character": "Vogel's Wife       (as Nora Hörich)"
    },
    {
      "id": "nm2366949",
      "name": "Kamilla Fátyol",
      "character": "Marissa Martinez"
    },
    {
      "id": "nm2594200",
      "name": "Yang Liu",
      "character": "Chinese Translator"
    },
    {
      "id": "nm7608068",
      "name": "Xue Xuxing",
      "character": "Ming's Secretary"
    },
    {
      "id": "nm0726490",
      "name": "Richard Rifkin",
      "character": "JPL Store Man"
    },
    {
      "id": "nm4788175",
      "name": "Nick Wittman",
      "character": "JPL White Room Worker       (as Nicholas Wittman)"
    },
    {
      "id": "nm6893778",
      "name": "Balázs Medveczky",
      "character": "JPL White Room Worker"
    },
    {
      "id": "nm1008636",
      "name": "Ben O'Brien",
      "character": "JPL Pathfinder Team"
    },
    {
      "id": "nm1488880",
      "name": "Scott Alexander Young",
      "character": "JPL Pathfinder Team       (credit only)"
    },
    {
      "id": "nm4412040",
      "name": "Jason Ryan",
      "character": "JPL Pathfinder Team"
    },
    {
      "id": "nm6481091",
      "name": "James Dougherty",
      "character": "JPL Pathfinder Team"
    }
  ],
  "overview": "During a manned mission to Mars, Astronaut Mark Watney is presumed dead after a fierce storm and left behind by his crew. But Watney has survived and finds himself stranded and alone on the hostile planet. With only meager supplies, he must draw upon his ingenuity, wit and spirit to subsist and find a way to signal to Earth that he is alive.",
  "storyline": "During a manned mission to Mars, Astronaut Mark Watney is presumed dead after a fierce storm and left behind by his crew. But Watney has survived and finds himself stranded and alone on the hostile planet. With only meager supplies, he must draw upon his ingenuity, wit and spirit to subsist and find a way to signal to Earth that he is alive. Millions of miles away, NASA and a team of international scientists work tirelessly to bring \"the Martian\" home, while his crewmates concurrently plot a daring, if not impossible, rescue mission. As these stories of incredible bravery unfold, the world comes together to root for Watney's safe return.",
  "plot": "In 2035, the crew of the Ares III mission to Mars is exploring Acidalia Planitia on Martian solar day (sol) 18 of their 31-sol expedition. A strong dust storm threatens to topple their Mars Ascent Vehicle (MAV), forcing them to abort their mission. During the evacuation, astronaut Mark Watney is struck by debris and lost in the storm; the last telemetry from his suit indicates no signs of life. With Watney believed dead, and the storm worsening by the second, mission commander Melissa Lewis orders the crew to take off and return to their orbiting vessel, Hermes.\n\nWatney awakens after the storm to a low oxygen warning and makes his way to the \"Hab\" (short for \"habitat\"), the crew's base of operations. He removes the piece of antenna which destroyed his suit's biomonitor and lodged in his torso by performing self-surgery. He begins a video diary and realizes that his only chance of rescue is to rendezvous with the Ares IV crew at the Schiaparelli crater, 3,200 kilometres (2,000&#160;mi) away in four years. His immediate concern is there will not be enough food to survive that long. Watney, being a botanist, improvises a farm inside the Hab utilizing Martian soil fertilized with human waste, water produced by extracting hydrogen from leftover rocket fuel, and potatoes intended for Thanksgiving dinner. He also begins to modify the only functional rover for longer journeys in preparation for the long distance travel.\n\nBack on Earth, NASA holds a funeral for him. While reviewing satellite photos of Mars, satellite planner Mindy Park sees evidence of Watney's activities and realizes he has survived. NASA administrator Teddy Sanders has public relations director Annie Montrose and mission director Vincent Kapoor release the news. Despite the objections of Hermes flight director Mitch Henderson, Sanders decides not to inform the Ares III crew, believing it would distract them.\n\nWatney takes the rover to retrieve the Pathfinder probe, which fell silent in 1997. Using the lander's camera, he establishes rudimentary communication with Earth. NASA instructs Watney to modify the rover to link with Pathfinder so they can communicate via text. Watney becomes angry when he learns that the crew has not been told of his survival, and Sanders authorizes Henderson to inform them.\n\nHenderson and JPL director Bruce Ng prepare a space probe to deliver enough food to last Watney until Ares IV's arrival. When the Hab's airlock malfunctions and explosively decompresses and destroys Watney's crop, Sanders orders the team to speed up the supply mission by skipping the safety inspections. However, an oversight causes the destabilization and subsequent explosion of the rocket shortly after liftoff.\n\nThe China National Space Administration offers NASA the Taiyang Shen, a classified booster rocket that can carry a payload to Mars. Meanwhile, JPL astrodynamicist Rich Purnell devises a trajectory to divert Hermes back to Mars for a rescue more than two years earlier, using the Chinese booster to resupply Hermes for an additional eighteen months. Sanders rejects the plan, refusing to risk the crew, but Henderson surreptitiously sends the details to Hermes. The crew unanimously vote for the plan, and NASA — powerless to stop them — resupplies Hermes as it uses Earth's gravity to slingshot back to Mars.\n\nWatney begins the 90-sol journey to Schiaparelli and the pre-positioned Ares IV MAV. To rendezvous with Hermes, Watney removes many components from the MAV, including the nose cone, to lighten it. The MAV, however, does not reach the needed speed and altitude, so Lewis is forced to use maneuvering thrusters to change course and explosive decompression of Hermes's internal atmosphere to reduce speed. When even that is not enough, Commander Lewis uses a Manned Maneuvering Unit, but still cannot reach Watney. Watney pierces the glove of his pressure suit and uses the escaping air to propel himself towards Lewis, effectively rescuing him after being alone for 543 Sols on Mars.\n\nAfter returning to Earth, Watney becomes a survival instructor for astronaut candidates. Five years later, on the occasion of the Ares V mission launch, those involved in Watney's rescue have begun new lives.",
  "synopsis": "At the landing site of the shuttle Ares III, Acidalia Planitia, Mars, at a time in the near future, the crew of the Hermes; including Commander Melissa Lewis (Jessica Chastain), botanist Mark Watney (Matt Damon), IT guru Beth Johanssen (Kate Mara), pilot Rick Martinez (Michael Peña), flight surgeon Chris Beck (Sebastian Stan), and navigator and chemist Alex Vogel (Aksel Hennie); are gathering samples before re-entering their living facility, the HAB.The crew learns that a storm is approaching. The storm's intensity and high winds lead Commander Lewis to order a mission abort. Watney argues for waiting it out and brings up the rear as the crew heads toward the MAV (Mars Ascent Vehicle), the ship that will take them back to the orbiting Hermes, in their suits. Heavy winds and sand gusts surround them. A satellite dish breaks off and strikes Watney, knocking him out of sight of the rest of the crew. Lewis tries to guide the others to find Watney, but visibility is very poor and the storm is way too strong for them. They head back into the MAV without Watney and lift off. The pilot, Martinez, is barely able to keep the rocket from toppling but the launch from the planet is successful.Back on Earth, NASA Director Teddy Sanders (Jeff Daniels) holds a press conference to announce that while the Hermes crew succeeded in leaving Mars, Mark Watney was lost, and he is declared dead.Watney wakes up on Mars on what is Sol 21 (mission day 21) after the storm has passed. His oxygen is depleting rapidly, so he makes his way back to the habitat station. He's been impaled by part of an antenna, which still protrudes from his abdomen; the combination of the antenna and his own blood sealed the suit just enough to keep most of his air from leaking out. In a painful procedure, Watney pulls the antenna out, uses forceps to fish out a piece that broke off in the wound, then staples the wound shut.He sits down to make a video log, where he outlines the situation: he's alive, but he can't contact Earth or Hermes; it'll be four years before the next manned mission is launched; and with the food supply in the habitat meant for him and the other five crew members, he has almost a year's worth of food, or a little longer if he rations. Therefore, Watney determines that he has to grow three years' worth of food on a planet where nothing grows. Luckily for him, he's a botanist and devises a plan to grow potatoes.At NASA in Houston, Texas, Sanders has just returned from a memorial service for Mark Watney, where he spoke about Watney's dedication to exploration. Mars Mission Director Vincent Kapoor (Chiwetel Ejiofor) talks to Sanders about getting satellite time to locate Watney's body. Sanders refuses on the grounds that the satellite feeds are public and broadcasting pictures of Watney's corpse would be a political and budgetary disaster for NASA. Later, engineer Mindy Park (Mackenzie Davis) meets with Kapoor after she discovers evidence of activity in satellite photos of the Ares III site (low-resolution images apparently taken in a routine fly-by): the solar panels have been cleaned and the rover has moved. They bring in Sanders and Director of Media Relations Annie Montrose (Kristen Wiig) to show them that Watney is still alive.A few sols (Martian days) later, inside the habitat, Watney has planted potatoes using Martian soil and vacuum-sealed packets of the crew's feces as fertilizer (to his disgust). Needing more water for the potato crop, he burns hydrazine rocket fuel; a byproduct of the reaction is water. On his first attempt to ignite the hydrazine, he causes a moderate explosion, singeing his clothing and hair. Watney notes that this explosive tendency is the reason that NASA does not use pure hydrogen. As he continues to work on his food supply, he keeps going with the video logs and decides to use a rover to make it to the Schiaparelli crater that will be the landing site for Ares IV in four years. Since the battery-powered rover can't cover the whole distance, he modifies it, adding solar cells and an extra battery. To conserve battery power, the pod of plutonium used to get the crew to Mars in their original spacecraft serves as a heat source in the cabin.Watney uses the rover to find a Pathfinder probe that stopped transmitting in 1997; he hopes to use it to get in touch with NASA. He digs the old probe out of the sand, spreads its solar panels to charge the batteries, and discovers that it still works. Using hand-written signs for the Pathfinder's camera, he is able to send a message to NASA confirming that he is alive. Kapoor is able to receive the message because he and colleagues at the Jet Propulsion Lab (JPL), who built the Pathfinders, have pulled another Pathfinder out of storage, rounded up the engineers who worked on it, and got it working again. They manage to communicate with Watney, first by panning the Mars Pathfinder's camera to point at 'yes' or 'no' signs when Watney asks if his signal is being received, and then by panning around a hexadecimal clock that Watney has scratched out on the ground around his Pathfinder. NASA uses this system to tell him how to hack the rover's operating system so it can transmit text back to Earth. When Watney, finally able to type his messages chat-style, asks how the Hermes crew took the news that he wasn't dead, Kapoor regretfully tells him that the crew hasn't been told. Watney responds with obscenities (which are broadcast all over the world).Watney's story becomes a worldwide sensation. His communications with NASA are logged, and at the request of PR Director Annie Montrose he uses the Pathfinder's camera to take a spacesuited selfie (in a two-thumbs-up Fonzie pose) which Montrose doesn't like because she can't see his face. Kapoor reminds her that Mark can't remove his helmet near the camera, which is outside the HAB.Meanwhile, the crew aboard Hermes has spent the last couple of months quietly flying back toward Earth while keeping in touch with their loved ones. The flight director of Ares III, Mitch Henderson (Sean Bean), contacts the crew and informs them that Watney is alive, and that NASA has kept it from them for the last two months so as to not distract them from their mission. The news only makes them angry and guilt-ridden, but Henderson tells them that Watney has stressed repeatedly that it wasn't their fault and they had reason to believe that he was dead.The folks at NASA determine that they can reach Watney by Sol 868. The food he's growing plus the rations in the HAB will run out in a bit over 900 days. Sanders frets that the margin of error is too small.Back on Mars, things begin to go bad for Watney when the habitat's worn-out airlock explosively decompresses, throwing the airlock some distance while he's inside it and causing his helmet to crack and leak. He uses duct tape to seal the cracks and stumbles back to the habitat to discover his potato crop frozen and dead. With less food, he now figures he can last only a little more than 300 Sols, or slightly longer if he rations.NASA and JPL work overtime and quickly launch a probe to resupply Watney. To make their launch window they bypass routine inspections, and moments after launching, the probe's trajectory shifts severely and it swerves off course and explodes. Meanwhile in China, two directors from the Chinese National Space Administration, Zhu Tao (Chen Shu) and Guo Ming (Eddy Ko), witness the explosion and discuss helping NASA by offering their classified booster rocket technology to launch a supply craft. Guo Ming asks Zhu Tao why NASA has not already asked for their help and Zhu Tao reminds him that it is a top secret program that NASA would not have any knowledge of. They decide that in the interests of international scientific co-operation, they will contact NASA and offer their booster rocket.Rich Purnell (Donald Glover) an eccentric and absent-minded but brilliant astrodynamicist, devises a plan to accelerate the returning Hermes around Earth, gaining a gravitational boost and sending it back to Mars to get Watney. The Chinese rocket will resupply the Hermes for its extended voyage. Sanders vetoes this plan because it risks the lives of the five Hermes crew members and will extend their mission by hundreds of days, but Henderson secretly sends the plan and Purnell's course calculations to the crew. The crew talks it over; they understand that the surreptitious arrival of the plan means that NASA brass have rejected the idea. They assume that if they go back to Mars, the two military members, Lewis and Martinez, will be court-martialed for mutiny and the three civilians will never be allowed to fly another mission. Lewis calls for a unanimous vote, and they all agree to go back for Watney. Johanssen hacks the Hermes computers to prevent NASA from taking control and they change course, sending a cryptic message to Houston: \"Rich Purnell is a steely-eyed missile man.\"Sanders is angry with Henderson, who he assumes sent the plan to Hermes. Henderson doesn't deny, but will not confirm his actions either. Sanders explains that his priority is for NASA to keep flying, but Congress is very sensitive to public opinion and the bad publicity that would result if Purnell's plan failed would likely reduce NASA's budget for years to come. He asks for Henderson's resignation when the mission is over. Then he's forced to announce that NASA is sending Hermes back to Mars to rescue Watney.Seven months pass on Mars. Watney has lost a lot of weight, has grown a lot of facial hair, and his teeth are rotting. He's started losing hope in his survival and rescue. He records a video log asking Commander Lewis to let his parents know of his fate. NASA sends him instructions to make extensive modifications to the rover, which Watney bemusedly performs. He packs up the rover and leaves the Ares III site; having spent 461 sols there; and heads for the Ares IV MAV, which was dropped on Mars well ahead of the Ares IV mission. It's a 3200-kilometer drive across a trackless and inhospitable Martian landscape. He stops every day for 13 hours to sleep and re-charge the rover's batteries with solar panels. During his excursion, he reasons that Mars is legally international waters; that is, it's subject to maritime law because it can't be claimed by any country on Earth. As he has not gotten explicit permission from NASA to take the MAV, and cannot get permission until after taking off, commandeering the MAV will make him a space pirate. He would like to be called \"Captain Blondbeard.\" Mark also pontificates about how he's the first person to see the Martian landscape that he travels across and seems to be quite in awe of it.After the Hermes has swung around Earth and collected the supplies, they travel back to Mars. NASA and the rest of the world watch with anticipation; with 12 minutes' delay, no one on Earth can help by radio. Watney has to remove 5000 kg of weight from the MAV to make it light enough to reach Hermes' orbit. He jettisons most of the seats, all the navigation and control systems, and replaces the nose-cone airlock, a crucial structural piece, with a tarp.Martinez, flying the MAV by remote control, launches Watney into orbit. The MAV comes up too low to reach the Hermes spaceship. Vogel constructs a quickly-made sugar and oxygen explosive to blow the front hatch and cause escaping air to slow the huge ship down so they can match speeds and still get to Watney. Lewis herself decides to use the EVA MMA suit with a tether to reach Watney, but she can't get close enough. Watney punctures the palm of his glove to propel himself toward Lewis with the escaping air jet. (\"Like Ironman!\" he says gleefully.) He has very little control, so he misses her. However, he runs into the tether, which his momentum causes to wind around himself and Lewis, and the crew is able to reel them in. Lewis announces to NASA that they have Watney, and people all over the world cheer. (Crowds have gathered in Houston, Times Square, Beijing, and elsewhere, anxiously waiting to hear whether the rescue worked.) The crew hugs Watney and jokes about the stench resulting from his lack of showering for many months.Back on Earth about one year later, Watney begins Day 1 as an instructor to aspiring astronauts. He tells them of his struggle on Mars, confirming that he did in fact grow food using his own excrement and humorously says he doesn't want to discuss that aspect of the mission again. He tells them that if things should go south for them, they can either accept their fate or start solving problems, because that's how you survive; by overcoming one problem after another.During the closing credits, we see the characters years later as they watch the launch of Ares V, in which Martinez is the commander. Kapoor, Montrose, Park, and Sanders watch from NASA along with Guo Ming & Zhu Tau. Henderson is retired and golfing with his son. Lewis watches at home with her husband, while Vogel is at home with his family. Beck and Johanssen have gotten married and watch from the hospital with their new baby."
}