{
  "imdb_id": "tt3660078",
  "tmdb_id": "345628",
  "douban_id": null,
  "title": "Taxi (2015)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm0014050",
      "name": "Kerstin Ahlrichs"
    }
  ],
  "writer": [
    {
      "id": "nm3096281",
      "name": "Karen Duve",
      "description": "screenplay"
    },
    {
      "id": "nm3096281",
      "name": "Karen Duve",
      "description": "novel"
    }
  ],
  "cast": [
    {
      "id": "nm2043211",
      "name": "Rosalie Thomass",
      "character": "Alex Herwig"
    },
    {
      "id": "nm0227759",
      "name": "Peter Dinklage",
      "character": "Marc"
    },
    {
      "id": "nm6872949",
      "name": "Leonardo Arivelo",
      "character": "Iwan"
    },
    {
      "id": "nm7628443",
      "name": "Michael Darlinger",
      "character": "Taxi Driver (dayshift)"
    },
    {
      "id": "nm1449783",
      "name": "Stipe Erceg",
      "character": "Dietrich"
    },
    {
      "id": "nm10332495",
      "name": "Carlotta Franke",
      "character": "Child"
    },
    {
      "id": "nm2481137",
      "name": "Carolyn Genzkow",
      "character": "Prostitute"
    },
    {
      "id": "nm0343743",
      "name": "Mechthild Großmann",
      "character": "Taxifunkerin"
    },
    {
      "id": "nm0347856",
      "name": "Eisi Gulp",
      "character": "Alcoholic"
    },
    {
      "id": "nm3168012",
      "name": "Özgür Karadeniz",
      "character": "Mergolan"
    },
    {
      "id": "nm10332508",
      "name": "Christian Krähnke",
      "character": "Punk"
    },
    {
      "id": "nm1573308",
      "name": "Ferris M.C.",
      "character": "Pimp       (as Sascha Reimann)"
    },
    {
      "id": "nm0540804",
      "name": "Leslie Malton",
      "character": "Alex' Mother"
    },
    {
      "id": "nm0006801",
      "name": "Antoine Monot Jr.",
      "character": "Taximörder"
    },
    {
      "id": "nm9423160",
      "name": "Frederike Oster",
      "character": "Barfrau Dschungel"
    },
    {
      "id": "nm0670700",
      "name": "Henning Peker",
      "character": "Monkey Wrangler"
    },
    {
      "id": "nm0737465",
      "name": "Armin Rohde",
      "character": "Drunkard"
    },
    {
      "id": "nm0770914",
      "name": "Tobias Schenke",
      "character": "Udo 377"
    },
    {
      "id": "nm3089940",
      "name": "Marion Gretchen Schmitz",
      "character": "Frau Georg"
    },
    {
      "id": "nm2583479",
      "name": "Jannik Schümann",
      "character": "Alex' Brother Manfred"
    },
    {
      "id": "nm10332509",
      "name": "Handan Sengel-Trapp",
      "character": "Mergolan's wife"
    },
    {
      "id": "nm0821177",
      "name": "Robert Stadlober",
      "character": "Rüdiger"
    },
    {
      "id": "nm7159855",
      "name": "Abderrafii Tahiri",
      "character": "Friend of Alex's Brother"
    },
    {
      "id": "nm2470832",
      "name": "Stephan Tölle",
      "character": "Hans Georg"
    },
    {
      "id": "nm1516996",
      "name": "Thando Walbaum",
      "character": "Colored Taxi Driver"
    },
    {
      "id": "nm1824783",
      "name": "Christopher Weiß",
      "character": "Marc's Friend"
    },
    {
      "id": "nm3348280",
      "name": "Till Valentin Winter",
      "character": "Computer Nerd"
    }
  ],
  "overview": "Hamburg, mid 80s, Alex is a cabby. The sound is hard, pubs are dark and loud, people constantly argue about anything and everything, people smoke all the time, and not just cigarettes. Alex wants love and freedom and sleeps with Dietrich. It's far from being love, but the sex is okay. With Marc, a little person full of dignity, she finds more than that. The rest is struggles with her passengers, the indifferent and the doomed, brutes as other nuisances. This sort of life could go on and on, Alex could drive away from her own life and in doing so lose Marc and not getting rid of Dietrich. Wouldn't there be a small monkey with the same invincible desire for freedom as hers.",
  "storyline": "Hamburg, mid 80s, ALEX is a cabby. The sound is hard, pubs are dark and loud, people constantly argue about anything and everything, people smoke all the time, and not just cigarettes. Alex wants love and freedom and sleeps with DIETRICH. It's far from being love, but the sex is okay. With MARC, a little person full of dignity, she finds more than that. The rest is struggles with her passengers, the indifferent and the doomed, brutes as other nuisances. This sort of life could go on and on, Alex could drive away from her own life and in doing so lose Marc and not getting rid of Dietrich. Wouldn't there be a small monkey with the same invincible desire for freedom as hers.",
  "plot": "Taxi portrays director Jafar Panahi as he courses through the streets of Tehran while pretending to be a share taxi driver. He wants to hear a piece of his passengers' life and declines any payment for the services. His earliest passengers include a conservative-minded man who supports capital punishment and a woman supporting its abolition, a pirated video vendor named Omid who once lent foreign films not available in the country to Panahi, an injured man and his wife who both insist on recording a last will due to their panic, and a pair of superstitious old women wanting to release their goldfishes to a holy spring.\n\nEventually, Panahi picks up his niece Hana at her school. She discusses about filmmaking and wants Panahi's advice on creating a short film for a school project; her teacher has said about several rules on creating films in Iran, including the avoidance of siahnamayi, or portraying a dark image about the country. However, Hana's teacher also stated that people should create film as they see fit. The two stop near a coffeehouse where Panahi meets with a family friend he has not seen for 7 years. The latter inquires about a burglary he recently experienced and his dilemma of not informing the authorities about the thieves, whom he personally knows, as they are poor and have nothing else to lose. Meanwhile, Hana films a case of siahnamayi herself when she spots a boy who steals money from a couple of newlyweds and refuses to return them.\n\nFinally, Panahi and Hana meet with Nasrin Sotoudeh, a human rights lawyer about to see the imprisoned Ghoncheh Ghavami and possibly convince her to give up her hunger strike. While adjusting her seat, Hana stumbles upon a purse belonging to one of the old women with the goldfishes. Sotoudeh decides to leave early so Panahi can deliver the purse, but not before giving him a rose as a goodwill for filmmakers. Panahi and Hana proceed to the springs and are able to return the purse; at the same time as this happens, a pair of thieves ransack the taxi, before the film cuts off.",
  "synopsis": null
}