{
  "imdb_id": "tt3681474",
  "tmdb_id": "402206",
  "douban_id": null,
  "title": "Embedded (2016)",
  "genres": [
    "Drama"
  ],
  "country": "Australia",
  "version": [
    {
      "runtime": "82 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.0,
  "director": [
    {
      "id": "nm0786601",
      "name": "Stephen Sewell"
    }
  ],
  "writer": [
    {
      "id": "nm0786601",
      "name": "Stephen Sewell",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1916003",
      "name": "Laura Gordon",
      "character": "Madeline"
    },
    {
      "id": "nm1646739",
      "name": "Nick Barkla",
      "character": "Frank"
    },
    {
      "id": "nm1230774",
      "name": "Marcus Johnson",
      "character": "Porter"
    },
    {
      "id": "nm4346649",
      "name": "Ryan Harrison",
      "character": "Lance Corporal Jackson"
    },
    {
      "id": "nm5271436",
      "name": "Rosie Lourde",
      "character": "Jade"
    },
    {
      "id": "nm3560073",
      "name": "Lauren Dillon",
      "character": "Nurse Hendrika Lund"
    },
    {
      "id": "nm3143457",
      "name": "Mansoor Noor",
      "character": "Aashir"
    },
    {
      "id": "nm3411428",
      "name": "Ford Sarhan",
      "character": "Ghalib"
    },
    {
      "id": "nm5576564",
      "name": "Deji Adiatu",
      "character": "Sekou"
    },
    {
      "id": "nm7273004",
      "name": "Peter Barac",
      "character": "Kalifa"
    },
    {
      "id": "nm4766021",
      "name": "John Michael Burdon",
      "character": "Sheik's Brother"
    },
    {
      "id": "nm7232424",
      "name": "Keoni Davis",
      "character": "Young Villager"
    },
    {
      "id": "nm7534257",
      "name": "Sierra Davis",
      "character": "Young Villager"
    },
    {
      "id": "nm1880753",
      "name": "Kit Fortune",
      "character": "Private Murphy"
    },
    {
      "id": "nm6795916",
      "name": "Kyle Charles Gannon",
      "character": "Private Hayes"
    },
    {
      "id": "nm6723394",
      "name": "Petar Gatsby",
      "character": "Pimp"
    },
    {
      "id": "nm4272394",
      "name": "Warren Paul Glover",
      "character": "Night club patron"
    },
    {
      "id": "nm0403599",
      "name": "Geoff Hurst",
      "character": "Soldier"
    },
    {
      "id": "nm7273005",
      "name": "Jermal Ibrahim-Haas",
      "character": "The Boy"
    },
    {
      "id": "nm1863720",
      "name": "Steve Jaggi",
      "character": "Doctor Sandberg"
    },
    {
      "id": "nm7534258",
      "name": "Casey Kaseske",
      "character": "Young Villager"
    },
    {
      "id": "nm7534253",
      "name": "Nathan Kincaid",
      "character": "Soldier"
    },
    {
      "id": "nm7534254",
      "name": "Tash Ncube",
      "character": "Villager"
    },
    {
      "id": "nm7272882",
      "name": "Cameron Pascoe",
      "character": "Private Thompson"
    },
    {
      "id": "nm0679832",
      "name": "Peter Phelps",
      "character": "Cassidy"
    },
    {
      "id": "nm7534259",
      "name": "Keala Pringley",
      "character": "Young Villager"
    },
    {
      "id": "nm7534260",
      "name": "Tiana Pringley",
      "character": "Young Villager"
    },
    {
      "id": "nm7223985",
      "name": "Dominic Russell",
      "character": "Private Nelson"
    },
    {
      "id": "nm6785605",
      "name": "Carma Sharon",
      "character": "Crazy Lady in Market"
    },
    {
      "id": "nm7534255",
      "name": "Marona Tanner",
      "character": "Villager"
    },
    {
      "id": "nm4123730",
      "name": "Melissa Thompson",
      "character": "Night club girl"
    },
    {
      "id": "nm3538254",
      "name": "Khanh Trieu",
      "character": "Mystic"
    },
    {
      "id": "nm7534256",
      "name": "Ebube Uba",
      "character": "Villager"
    },
    {
      "id": "nm6094841",
      "name": "Taddeh Vartanians",
      "character": "Kadar"
    },
    {
      "id": "nm7272883",
      "name": "Shane Williams",
      "character": "Private Foster"
    },
    {
      "id": "nm4491332",
      "name": "Lee Woodford",
      "character": "Army Veteran"
    },
    {
      "id": "nm2271576",
      "name": "Jak Wyld",
      "character": "Sergeant Henderson"
    }
  ],
  "overview": "Frank (Nick Barkla, The Secret Life of Us) meets Madaline (Laura Gordon, Saw V) at a cocktail party held at a World Bank conference. He's a foreign correspondent whose recent work in Mali has left him traumatised. As the erotic connection between Frank and Madaline deepens, each gradually reveal secrets from their past that could have deadly consequences. The sensual, politically charged Embedded is an exciting anomaly in Australian cinema, marking a promising directorial debut for Sewell.",
  "storyline": null,
  "plot": "On July 2, 1996, an enormous alien mothership that has one fourth the mass of the Moon enters orbit around Earth, deploying 36 smaller spacecraft, each 15 miles (24&#160;km) wide, that take positions over some of Earth's major cities and military bases. David Levinson, an MIT-trained satellite technician, decodes a signal embedded in the global satellite transmissions that he determines is a timer counting down to a coordinated attack. With the help of his former wife, White House Communications Director Constance Spano, Levinson, and his father Julius, gain access to the Oval Office and warn President Thomas J. Whitmore that the aliens are hostile. Whitmore orders large-scale evacuations of New York City, Los Angeles, and Washington D.C., but it is too late; the timer reaches zero and the ships activate devastating directed-energy weapons, killing millions. Whitmore, the Levinsons, and a few others narrowly escape aboard Air Force One as the capital is destroyed along with other locations over which the ships are positioned.\n\nOn July 3, international leaders begin ordering individual counterattacks. Their aviation forces attack destroyer ships positioned above the ruins of the cities, but they are protected by force fields. Each destroyer launches a swarm of attack fighters, which wipe out the human fighter squadrons. Captain Steven Hiller, a pilot with the USMC squadron VMFA-314 based out of Marine Corps Air Station El Toro, survives by luring his attacker to the enclosed spaces of the Grand Canyon and sacrificing his plane, forcing the alien to crash-land. He subdues the injured alien pilot and flags down a convoy of refugees, hitching a ride with former combat pilot Russell Casse. They transport the unconscious alien to nearby Area 51 where Whitmore's group has landed. Through Secretary of Defense Albert Nimzicki, they learn that a faction of the government has been involved in a UFO conspiracy since 1947, when one of the invaders' attack fighters crashed in Roswell. Area 51 houses the refurbished alien fighter and three alien corpses recovered from the crash.\n\nWhen eccentric scientist Brackish Okun examines the alien captured by Hiller, it regains consciousness and attacks. It telepathically invades Okun's mind and uses his vocal cords to communicate with Whitmore before launching a psychic attack against him. Whitmore sees visions of the alien's plans: their entire civilization travels from planet to planet, exterminating all indigenous life and harvesting the planet of all natural resources. After Secret Service agents and military personnel kill the alien, Whitmore reluctantly authorizes a nuclear attack; a B-2 Spirit fires a nuclear cruise missile at an alien destroyer positioned above Houston, but the ship remains intact.\n\nOn July 4, Levinson demonstrates that the key to defeating the aliens lies in deactivating their force fields, and devises a way to do so by uploading a computer virus into the mothership. He proposes using the refurbished alien fighter to implement the plan, which Hiller volunteers to pilot. The two are able to implant the virus and deploy a nuclear weapon on board the mothership. With military pilots in short supply, Whitmore enlists the help of volunteers with flight experience, including Casse, and leads an attack on a destroyer ship bearing down on Area 51. With the alien's shields deactivated, the fighters are able to inflict damage but their supply of missiles is quickly exhausted. As the destroyer prepares to fire on the base, the last missile, equipped on Casse's plane, jams, and Casse decides to sacrifice his own life. He flies his plane kamikaze-style into the directed-energy weapon port, which results in an explosion that destroys the ship. Human resistance forces around the world successfully destroy the other craft using this vulnerability. As humankind is rejoicing in victory, Hiller and Levinson return to Area 51 unharmed and reunite with their families. They and military officers nearby accompany Whitmore and his daughter in watching the wreckage from the mothership burn up, resembling a fireworks display as it enters Earth's atmosphere.",
  "synopsis": null
}