{
  "imdb_id": "tt3676656",
  "tmdb_id": "265237",
  "douban_id": null,
  "title": "Bye Bye Barcelona (2014)",
  "genres": [
    "Documentary"
  ],
  "country": "Spain",
  "version": [
    {
      "runtime": "55 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm2679571",
      "name": "Eduardo Chibás Fernández"
    }
  ],
  "writer": [
    {
      "id": "nm2679571",
      "name": "Eduardo Chibás Fernández",
      "description": "writer as Eduardo Chibás"
    }
  ],
  "cast": null,
  "overview": "Bye Bye Barcelona is a documentary about a city and its relation to tourism , on the difficult coexistence between Barcelona the city and Barcelona the tourist destination",
  "storyline": "A documentary about the consequences of the tourism industry on the local life in Barcelona.",
  "plot": "Vicky (Rebecca Hall) and Cristina (Scarlett Johansson) visit Barcelona for the summer, staying with Vicky's distant relative Judy (Patricia Clarkson) and her husband Mark (Kevin Dunn). While the two are great friends, Vicky is practical and traditional in her approach to love and commitment and is engaged to the reliable Doug (Chris Messina), whereas Cristina imagines herself to be a nonconformist, spontaneous but unsure of what she wants from life or love.\n\nAt an art exhibition, Cristina is intrigued by artist Juan Antonio (Javier Bardem), who Judy says has suffered a violent relationship with his ex-wife. Later, he brazenly approaches the two women to invite them to join him right away for the weekend in the city of Oviedo, in a small plane he flies himself, for sight-seeing, fine eating and drinking, and hopefully, love-making. Cristina is won over by the offer almost at once, but Vicky is unimpressed and reluctant; she however eventually decides to accompany her friend anyway, mainly to watch over her.\n\nAt the end of their first day, Vicky refuses to join Juan Antonio in his hotel room, citing her fidelity to Doug, but Cristina accepts his invitation immediately. Before the love-making starts, Cristina suddenly falls ill with digestive complaints, and is put to bed, with food poisoning. Vicky and Juan Antonio proceed to spend the weekend together alone while they wait for Cristina to recuperate. Vicky gradually changes her opinion of Juan Antonio as he tells her about his tumultuous relationship with his former wife, María Elena (Penélope Cruz). Vicky accompanies him to visit his father, an old poet, and then becomes deeply moved by a Spanish guitar performance later that evening. She finally succumbs to Juan Antonio's advances as they walk through a grove of trees in the dark. The next day, with Cristina recovered, the three of them fly back to Barcelona.\n\nFeeling guilty, Vicky does not mention the incident to Cristina, and the two begin to grow apart. Vicky starts throwing herself into her studies while Cristina and Juan Antonio take up a relationship. Cristina then moves in with Juan Antonio and begins to discover more about his past. After learning that María Elena attempted to kill herself, Juan Antonio brings her to his home, where Cristina already lives. After some defiance, the two women grow fond of each other. Cristina realizes that the ex-spouses are still in love, and María Elena suggests that Cristina may be the element that can give balance and stability to their relationship. All three become romantically involved with one another.\n\nIn the meantime, Vicky is joined in Spain by an enthusiastic Doug and the two get married. When Cristina describes her new life with Juan Antonio to Vicky, Vicky becomes secretly jealous, and after a few other awkward moments, she realizes she is unsatisfied in her married life and is still attracted to Juan Antonio. Learning that Judy is similarly unhappy in her marriage, she confides to her, and Judy, who sees her younger self in Vicky, decides to bring Juan Antonio and Vicky together. Meanwhile, Cristina becomes restless and at some point decides to leave Juan Antonio and María Elena; without her, their relationship quickly falls apart again.\n\nAs the summer winds to a close, Judy arranges for Juan Antonio and Vicky to meet at a party. Juan Antonio begs Vicky to meet him again privately before leaving Spain, which she finally accepts, lying to Doug in the process. At his home, Juan Antonio seduces and wins Vicky over again, but they are interrupted by María Elena who bursts in with a gun, firing wildly as Juan Antonio tries to calm her. Vicky gets shot in the hand in the process, and leaves, shouting they are insane and she could never live like this. She confesses the entire story to Cristina, who never realized how Vicky felt about Juan Antonio, and wishes she could have helped her. Doug, Vicky and Cristina return to America; Doug never learns what truly happened, Vicky goes back to her married life, and Cristina is back where she started, but unsure of what she wants from life or love.",
  "synopsis": "Bye Bye Barcelona es un documental acerca de una ciudad y su relación con el turismo, acerca de la difícil convivencia entre Barcelona, barceloneses, el turismo y los turistas. Es un documental que expone, de la mano de algunos de sus residentes, los graves efectos que tiene el turismo masivo en la ciudad condal. Es un documental que puedes ver entero, o por capítulos y a tu ritmo, y que no pretende otra cosa que servir de contrapunto a la tan repetida idea de que con el turismo ganamos todos. Este es un documental sobre lo que perdemos. Barcelona no es una gran metrópolis, pero puede presumir de ser la cuarta ciudad con mayor turismo de Europa tras tres grandes capitales como Londres, Paris y Roma. Su puerto es el que más cruceros recibe de Europa y del Mediterráneo. Los barceloneses han visto cómo en escasamente una década, la cantidad de turistas se ha triplicado y cómo la economía ha girado hacia el servicio turístico y ha sabido explotar exitosamente un patrimonio construido por generaciones anteriores.\nA nadie se le escapa que el turismo es una fuente de ingreso enorme para Barcelona y para algunos de sus ciudadanos, que no tienen reparo en traer a cada vez más y más turistas sin pensar en las graves consecuencias que ello conlleva. Se han perdido espacios emblemáticos de la ciudad en favor de un turismo masivo, que cada vez desgasta y ocupa más. A espacios perdidos como la Rambla, el Barri Gòtic o el Born, últimamente se le han unido la Barceloneta, Sagrada Familia, y el Park Güell, cuya exagerada explotación llevó a su cierre, sin atender a los deseos de su donante.\n¿Realmente vale la pena perder todo esto?"
}