{
  "imdb_id": "tt3608848",
  "tmdb_id": "267433",
  "douban_id": null,
  "title": "NOW: In the Wings on a World Stage (2014)",
  "genres": [
    "Documentary"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    },
    {
      "runtime": "60 min",
      "description": "TV"
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm1151687",
      "name": "Jeremy Whelehan"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm0000228",
      "name": "Kevin Spacey",
      "character": "Richard Duke of Gloucester"
    },
    {
      "id": "nm0025972",
      "name": "Maureen Anderman",
      "character": "Duchess of York"
    },
    {
      "id": "nm1969113",
      "name": "Stephen Lee Anderson",
      "character": "Sir Richard Ratcliffe"
    },
    {
      "id": "nm2205243",
      "name": "Jeremy Bobb",
      "character": "Sir William Catesby /              Second Murder"
    },
    {
      "id": "nm2080557",
      "name": "Nathan Darrow",
      "character": "Lord Grey /              Henry, Earl of Richmond"
    },
    {
      "id": "nm0254879",
      "name": "Jack Ellis",
      "character": "Lord Hastings"
    },
    {
      "id": "nm0006522",
      "name": "Haydn Gwynne",
      "character": "Queen Elizabeth"
    },
    {
      "id": "nm1030244",
      "name": "Chukwudi Iwuji",
      "character": "Duke of Buckingham"
    },
    {
      "id": "nm2782163",
      "name": "Isaiah Johnson",
      "character": "Lord Rivers /              Scrivener"
    },
    {
      "id": "nm0428121",
      "name": "Gemma Jones",
      "character": "Queen Margaret"
    },
    {
      "id": "nm5809216",
      "name": "Andrew Long",
      "character": "King Edward IV /              Bishop of Ely"
    },
    {
      "id": "nm2223614",
      "name": "Katherine Manners",
      "character": "Young Richard Duke of York"
    },
    {
      "id": "nm0005222",
      "name": "Sam Mendes",
      "character": "Director of Richard III"
    },
    {
      "id": "nm1821321",
      "name": "Howard W. Overshown",
      "character": "Brackenbury /              Lord Mayor of London"
    },
    {
      "id": "nm1470656",
      "name": "Simon Lee Phillips",
      "character": "Sir James Tyrell /              Duke of Norfolk"
    },
    {
      "id": "nm6370681",
      "name": "Gary Powell",
      "character": "First Murderer /              Sir Frances Lovel"
    },
    {
      "id": "nm3956318",
      "name": "Michael Rudko",
      "character": "Lord Stanley"
    },
    {
      "id": "nm2118257",
      "name": "Annabel Scholey",
      "character": "Lady Anne"
    },
    {
      "id": "nm2972423",
      "name": "Gavin Stenhouse",
      "character": "Marquess of Dorset"
    },
    {
      "id": "nm1488442",
      "name": "Hannah Stokely",
      "character": "Young Edward Prince of Wales"
    },
    {
      "id": "nm1695365",
      "name": "Chandler Williams",
      "character": "George - Duke of Clarence"
    }
  ],
  "overview": "Kevin Spacey, Sam Mendes and the Bridge Project Company go on the road in NOW: in the Wings on a World Stage. In over 200 performances, and across 3 continents, Kevin and the troupe reveal some of the most intimate moments behind the scenes of their staging of Shakespeare's classic tragedy, \"Richard III.\" Their story and experiences weave around, and reflect on, excerpts from the play from their various locations, from Epidaurus to Doha, and provides a great opportunity for those who have never experienced Spacey on stage to witness his immerse and captivating interpretation of Richard III. NOW chronicles the first collaboration between Spacey and Mendes since both won Academy Awards® for their work on American Beauty.",
  "storyline": "Kevin Spacey, Sam Mendes and the Bridge Project Company reveal some of the most intimate moments behind the scenes of their staging of Richard III.",
  "plot": null,
  "synopsis": "NOW: In the Wings on a World Stage takes us along with twenty British and American actors on a whirlwind ten month international tour of Richard III, led by Kevin Spacey in the title role, and directed by Sam Mendes. The film follows Mendes Bridge Project the first transatlantic theatre company as the play takes shape and unfolds for us in spellbinding excerpts from the stage production as it travels through nine cities. As we discover Spacey's revelatory performance as the power-mad Richard destroying his family and everyone in his path, we also see him demonstrate how, in leading this troupe of actors his leadership helps to unify and bring the best out of the group.The film offers us a privileged look at the process of putting a play together, and plunges us into the hustle and bustle of the goings-on behind the curtain. This intimacy is enhanced by our introduction to every member of the company, as they share their thoughts about acting their roles, their personal lives, and what the play and the tour means to them.The film is a study in contrasts: the transatlantic actors have varying training, experience levels, and ages; the cities and cultures they encounter are exotic and diverse, with a vivid clash between ancient civilizations like Beijing and Doha and the futuristic architecture of their theatres; the play itself is staged by Mendes with sets and costumes that are a mélange of the old and the new; and the world tour itself is a throwback to a grand theatrical tradition that may be fading away.Spacey and Mendes, who collaborated so memorably on American Beauty, for which they won Academy Awards® for Best Actor and Director, and for which the film won Best Picture, now work together for the first time since then on the stage, a medium they both cherish. Those who only know Spacey through his commanding, but realistic acting style currently showcased in his stunning turn as Frank Underwood in House of Cardswill get a rare opportunity to see an audacious, swing-for-the-fences Spacey who playfully engages in real time with massive audiences from vastly differing cultures.The word now epitomizes what makes the theatre unique among all the artist is a living thing that only exists in the moment and the voyage of the cast and crew parallels that. While NOW: In the Wings on a World Stage reveals the transitory nature of an actors existence, few who watch it will question why people devote their lives to the profession."
}