{
  "imdb_id": "tt3608930",
  "tmdb_id": "291356",
  "douban_id": null,
  "title": "In a Valley of Violence (2016)",
  "genres": [
    "Action",
    "Crime",
    "Drama",
    "Thriller",
    "Western"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "104 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm1488800",
      "name": "Ti West"
    }
  ],
  "writer": [
    {
      "id": "nm1488800",
      "name": "Ti West",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0000160",
      "name": "Ethan Hawke",
      "character": "Paul"
    },
    {
      "id": "nm0000237",
      "name": "John Travolta",
      "character": "Marshal"
    },
    {
      "id": "nm3920288",
      "name": "Taissa Farmiga",
      "character": "Mary-Anne"
    },
    {
      "id": "nm0710447",
      "name": "James Ransone",
      "character": "Gilly"
    },
    {
      "id": "nm2394794",
      "name": "Karen Gillan",
      "character": "Ellen"
    },
    {
      "id": "nm0403947",
      "name": "Toby Huss",
      "character": "Harris"
    },
    {
      "id": "nm0634121",
      "name": "Tommy Nohilly",
      "character": "Tubby"
    },
    {
      "id": "nm0275244",
      "name": "Larry Fessenden",
      "character": "Roy"
    },
    {
      "id": "nm8533699",
      "name": "Michael Davis",
      "character": "Dollar Bill"
    },
    {
      "id": "nm0128330",
      "name": "James Cady",
      "character": "Bartender"
    },
    {
      "id": "nm1218607",
      "name": "Burn Gorman",
      "character": "Priest"
    },
    {
      "id": "nm3151489",
      "name": "K. Harrison Sweeney",
      "character": "William T. Baxter"
    },
    {
      "id": "nm6134568",
      "name": "Jumpy",
      "character": "Abby"
    }
  ],
  "overview": "The story of a drifter named Paul who arrives in a small town seeking revenge on the thugs who murdered his friend. Sisters Mary Anne and Ellen, who run the town's hotel, help Paul in his quest for vengeance.",
  "storyline": "A mysterious stranger and a random act of violence drag a town of misfits and nitwits into the bloody crosshairs of revenge.",
  "plot": "A drifter named Paul (Ethan Hawke) and his dog, Abbie, make their way towards Mexico through the desert of the Old West. They encounter a drunken priest (Burn Gorman), who is attempting to get to the nearby town of Denton. The priest holds Paul at gunpoint in order to steal his horse, but Paul has Abbie attack him; the drifter then takes the priest's bullets and water canteen, and goes on his way. Surveying the area, Paul decides to cut through Denton in order to get supplies and reduce their journey time.\n\nIn the local tavern, Paul meets Deputy Gilly Martin (James Ransone), who challenges the drifter to a fight when Paul ignores his attempt to start conversation. In order to coax him out of the tavern, Gilly approaches Abbie, but Paul comes out and punches him before he can touch the dog. Gilly's fiancée Ellen (Karen Gillan) rushes to his aid as Paul makes his way into the town's hotel. The young innkeeper, Ellen's sister Mary-Anne (Taissa Farmiga), is overjoyed to hear about him injuring Gilly, and draws Paul and Abbie a bath as thanks.\n\nLater, Paul finds the Marshal, Gilly's father Clyde Martin (John Travolta), waiting for him in the inn's lobby. The Marshal identifies Paul as an ex-soldier with the U.S. Army, and requests he leave Denton and never return. Before Paul moves on, Mary-Anne gives him a picture to remember her by. That night, Paul and Abbie are found by Gilly and his cohorts, who label him an Army deserter and traitor. They proceed to murder the dog and push Paul off a cliff. An injured Paul awakens the next day, buries Abbie and swears revenge. On his way back to the town, Paul again encounters the priest and steals his mule.\n\nBack in Denton, Mary-Anne shelters Paul at her father's house and offers her help. She begs Paul to take her away from the town once he has exacted his revenge. He refuses, telling her that he left his wife and daughter alone after enlisting and never intends to go back to them. At the hotel, Ellen has Mary-Anne draw Roy (Larry Fessenden) a bath, but Paul interrupts to slash his throat. The Marshal is alerted to the situation and has the men prepare for battle. He orders Gilly to keep the women safe, and Gilly accuses Mary-Anne of aiding the drifter. In an effort to get him to stay in the inn, Ellen tells Gilly that she is pregnant.\n\nOn the roof of the jailhouse, Paul executes Harris (Toby Huss) when he is unable to make him shoot at Tubby (Tommy Nohilly) and the Marshal. Inside the jailhouse, Tubby is unable to deal with the bloodshed and throws down his gun. The Marshal pleads with him to get away from the window, just as Paul shoots Tubby in the back. The Marshal agrees to leave his weapons inside so that they can talk. Gilly then comes out to end Paul's killing spree, but the Marshal refuses to get out of the way. The two proceed to shoot at each other through the Marshal, killing him.\n\nPaul, hit in the thigh by a bullet, hides in a barn. When Gilly enters, Paul slips a noose over his head from above and hangs him. Paul then lets Gilly drop and Paul beats his face with Gilly's own boot and, just as Gilly attempts to stab Paul, Mary-Anne shoots him in the back. As Mary-Anne and Paul make their way back to the inn, Ellen discovers Gilly's body and screams. The priest then wanders back through Denton and Paul suggests that he should stay this time.",
  "synopsis": null
}