{
  "imdb_id": "tt3672840",
  "tmdb_id": "300168",
  "douban_id": "25823833",
  "title": "Dragon Blade (2015)",
  "genres": [
    "Action",
    "Adventure",
    "Drama",
    "Fantasy",
    "History"
  ],
  "country": "China",
  "version": [
    {
      "runtime": "127 min",
      "description": ""
    },
    {
      "runtime": "103 min",
      "description": "USA cut"
    }
  ],
  "imdb_rating": 6.1,
  "director": [
    {
      "id": "nm0496752",
      "name": "Daniel Lee"
    }
  ],
  "writer": [
    {
      "id": "nm0496752",
      "name": "Daniel Lee",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0000329",
      "name": "Jackie Chan",
      "character": "Huo An"
    },
    {
      "id": "nm0000131",
      "name": "John Cusack",
      "character": "Lucius"
    },
    {
      "id": "nm0004778",
      "name": "Adrien Brody",
      "character": "Tiberius"
    },
    {
      "id": "nm2184859",
      "name": "Si Won Choi",
      "character": "Yin Po"
    },
    {
      "id": "nm3391237",
      "name": "Peng Lin",
      "character": "Cold Moon"
    },
    {
      "id": "nm6355871",
      "name": "Mika Wang",
      "character": "Xiu Qing"
    },
    {
      "id": "nm4763789",
      "name": "Yang Xiao",
      "character": "Captain"
    },
    {
      "id": "nm4763863",
      "name": "Taili Wang",
      "character": "Rat"
    },
    {
      "id": "nm1796011",
      "name": "Tin Chiu Hung",
      "character": "Red Sun       (as Sammy Hung)"
    },
    {
      "id": "nm2682046",
      "name": "Shaofeng Feng",
      "character": "General Huo Qubing"
    },
    {
      "id": "nm1801800",
      "name": "Sharni Vinson",
      "character": "Lady Crassus"
    },
    {
      "id": "nm1645509",
      "name": "Lorie Pester",
      "character": "Parthian Queen"
    },
    {
      "id": "nm0232475",
      "name": "Xiangdong Xu",
      "character": "Secretary       (as Xiang Dong Xu)"
    },
    {
      "id": "nm3218962",
      "name": "Qing Xiu",
      "character": "Wolf"
    },
    {
      "id": "nm3398435",
      "name": "Sung-jun Yoo",
      "character": "Cougar       (as Steve Yoo)"
    },
    {
      "id": "nm5574325",
      "name": "Tomer Oz",
      "character": "Huo An General"
    },
    {
      "id": "nm1488865",
      "name": "Vanness Wu",
      "character": "Christian"
    },
    {
      "id": "nm1157324",
      "name": "Kar Yan Lam",
      "character": "Karena       (as Karena Lam)"
    },
    {
      "id": "nm6457516",
      "name": "Jozef Waite",
      "character": "Publius"
    },
    {
      "id": "nm0068709",
      "name": "Ned Bellamy",
      "character": "Octavius"
    },
    {
      "id": "nm4708473",
      "name": "Jim Bennett",
      "character": "Stallus       (as James Ambrose Bennett)"
    },
    {
      "id": "nm4975017",
      "name": "Paul Philip Clark",
      "character": "Tullus"
    },
    {
      "id": "nm4235698",
      "name": "Philippe Joly",
      "character": "Decimus"
    },
    {
      "id": "nm6038807",
      "name": "Joel Adrian",
      "character": "Sertor       (as Joel Adrian Slaatto)"
    },
    {
      "id": "nm2069815",
      "name": "Danny Salay",
      "character": "Paullus       (as Daniel John Salay)"
    },
    {
      "id": "nm3100183",
      "name": "Brahim Chab",
      "character": "Titus       (as Brahim)"
    },
    {
      "id": "nm6640222",
      "name": "Scotty Bob Cox",
      "character": "Falco"
    },
    {
      "id": "nm9640626",
      "name": "Michael Duchet",
      "character": "Quitus"
    },
    {
      "id": "nm10511856",
      "name": "Su Hang",
      "character": "Mongolian Warrior"
    },
    {
      "id": "nm5666529",
      "name": "Ivan Kotik",
      "character": "Roman Soldier"
    },
    {
      "id": "nm1045925",
      "name": "Drago Lazetich",
      "character": "War Soldier"
    },
    {
      "id": "nm8274144",
      "name": "Shaoting Li",
      "character": "Lieutenant"
    },
    {
      "id": "nm7812542",
      "name": "Chutian Liu",
      "character": "Student"
    },
    {
      "id": "nm5191768",
      "name": "Jianwei Liu",
      "character": "Ma Chuang       (as Jian-Wei Liu)"
    },
    {
      "id": "nm7558581",
      "name": "Raphael Ollivier",
      "character": "Roman Soldier"
    },
    {
      "id": "nm0669648",
      "name": "David Peck",
      "character": "Agrippa"
    },
    {
      "id": "nm2053173",
      "name": "Ian Powers",
      "character": "Hostus"
    },
    {
      "id": "nm4744299",
      "name": "Kyle Shapiro",
      "character": "Roman Captain"
    },
    {
      "id": "nm6634162",
      "name": "Emrah Yilmaz",
      "character": "Kroraina General"
    }
  ],
  "overview": "Huo An, the commander of the Protection Squad of the Western Regions, was framed by evil forces and becomes enslaved. On the other hand, a Roman general escapes to China after rescuing the Prince. The heroic duo meet in the Western Desert and a thrilling story unfolds.",
  "storyline": "When corrupt Roman leader Tiberius arrives with a giant army to claim the Silk Road, Huo An and his group of trained warriors teams up with an elite legion of defected Roman soldiers led by General Lucius to maintain the delicate balance of power in the region. To protect his country and his new friends, Huo An gathers the warriors of thirty-six ethnic nations together to fight Tiberius in an incredible epic battle.",
  "plot": "In northwest China, 48 BC, a security company under Han China's current government called The Silk Road Protection Squad is committed towards stopping battles and promoting the idea of peace. Huo An (Chan), the captain, successfully averts a battle between the Indians and Huns. The group returns to their unnamed home city, where Huo An's gentle Uyghur wife Xiuqing (Mika Wang) serves as a schoolteacher for orphans. However, the government uncovers evidence that someone in the group is corrupt, causing the entire group to be sentenced to construction work at Wild Geese Gate, a ruined fortress. Once they arrive, the group pays respects at the shrine of a fallen Chinese general. They originally were child-slaves of Hun descent, but the general had later rescued them.\n\nNot long after, Wild Geese Gate is threatened by a legion from the Roman Empire in need of water and supplies, among which is a blind boy named Publius (Jozef Waite). After a stale-mated duel between Huo An and Lucius (Cusack), the Roman general, the latter agrees not to assault the city in return for being let inside. The legion uses its superior engineering skills to speed up the construction work, an act which boosts the morale and happiness of the inhabitants, who are divided among several different races, such as Chinese, Uighur, and Turkic. Huo An returns the favor by sending men to assist Lucius's envoys in reaching the Parthian Empire. A celebration is later held and Huo An is made an honorary centurion.\n\nLucius reveals that he and Publius are fleeing from Publius's brother Tiberius (Brody), a corrupt soldier who murdered their consul father and blinded Publius so Tiberius could become consul. As Tiberius approaches with 100,000 soldiers, Huo An insists on helping Lucius, pointing out that Tiberius is a threat to the Silk Road in its entirety. Shortly after Huo An leaves to find reinforcements, the corrupt group member from earlier sends Chinese soldiers to murder Huo An's wife and attack Wild Geese Gate. The legion is imprisoned in the non-Chinese trading city of Kroran, where Tiberius has chosen to camp. Tiberius proceeds to murder Publius.\n\nHuo An and the few loyal Chinese soldiers travel to Kroran, pretending to surrender, but once they are inside, they destroy the Roman legion's cages. However, they are unable to free Lucius, who is about to be burned to death in a special solitary cell. Huo An fires an arrow and kills Lucius before the fire gets him. As Huo An's and Lucius's soldiers are surrounded, the armies of several other races arrive and fight against Tiberius, including the Indians, Huns, Uighurs, and Turkics, all of whom are determined to preserve the Silk Road's safety. However, even their combined forces are unable to gain the upper hand. Finally, the envoys from earlier return with a massive host of Parthians, who had signed a special treaty with Publius's father and who intend to avenge his memory. Tiberius's soldiers lose their will to fight. Huo An challenges Tiberius to a duel and kills him.\n\nUpon hearing about the bravery of Lucius's legion, the Chinese emperor grants them the right to establish their own city, which they choose to name Regum. They accept Huo An as their commander, and Huo An, in turn, honors the deceased Chinese general by relocating the shrine to that city. As the centuries go on, the city fades from collective memory. However, in the modern day, a team of Asian American archaeologists stumble upon the site and uncover the dual Chinese and Latin inscriptions.",
  "synopsis": null
}