{
  "imdb_id": "tt3625970",
  "tmdb_id": "286805",
  "douban_id": null,
  "title": "Dark Dungeons (Video 2014)",
  "genres": [
    "Short",
    "Drama",
    "Fantasy",
    "Horror"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "40 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.1,
  "director": [
    {
      "id": "nm3613396",
      "name": "L. Gabriel Gonda"
    }
  ],
  "writer": [
    {
      "id": "nm1497211",
      "name": "Jack Chick",
      "description": "comic"
    },
    {
      "id": "nm6421224",
      "name": "JR Ralls",
      "description": "screenplay as Ralls Jr."
    }
  ],
  "cast": [
    {
      "id": "nm4247622",
      "name": "Alyssa Kay",
      "character": "Debbie"
    },
    {
      "id": "nm6421226",
      "name": "Anastasia Higham",
      "character": "Marcie"
    },
    {
      "id": "nm1662586",
      "name": "Tracy Hyland",
      "character": "Mistress Frost"
    },
    {
      "id": "nm3316545",
      "name": "Trevor Cushman",
      "character": "Mike"
    },
    {
      "id": "nm6421223",
      "name": "Jonathan Crimeni",
      "character": "Nitro"
    },
    {
      "id": "nm3453668",
      "name": "Kaleb Hagen-Kerr",
      "character": "Preacher"
    },
    {
      "id": "nm6421225",
      "name": "David Anthony Lewis",
      "character": "Professor"
    },
    {
      "id": "nm5411094",
      "name": "Shane Barnett",
      "character": "Tiamet       (voice)"
    },
    {
      "id": "nm2723853",
      "name": "Scott C. Brown",
      "character": "Shadowy Figure"
    },
    {
      "id": "nm3204134",
      "name": "Troy Butcher",
      "character": "Demon"
    },
    {
      "id": "nm4066598",
      "name": "B Austin Davis",
      "character": "Demon"
    },
    {
      "id": "nm1832969",
      "name": "Christian Doyle",
      "character": "Shadowy Figure"
    },
    {
      "id": "nm3588601",
      "name": "Shani Drake",
      "character": "Nitro's Entourage"
    },
    {
      "id": "nm6553563",
      "name": "Bryan Head",
      "character": "Demon"
    },
    {
      "id": "nm5846161",
      "name": "James Herbert",
      "character": "Tiamet       (voice)"
    },
    {
      "id": "nm3872641",
      "name": "Jerry Holkins",
      "character": "Tiamet       (voice)"
    },
    {
      "id": "nm1831420",
      "name": "Brian S. Lewis",
      "character": "Shadowy Figure       (as Brian Lewis)"
    },
    {
      "id": "nm7924330",
      "name": "David Anthony Lewis",
      "character": "Professor"
    },
    {
      "id": "nm1875938",
      "name": "Kyle Mahoney",
      "character": "Tiamet       (voice)"
    },
    {
      "id": "nm4407268",
      "name": "Trin Miller",
      "character": "Shadowy Figure"
    },
    {
      "id": "nm4688958",
      "name": "Chris Newell",
      "character": "Demon       (as Christopher Newell)"
    },
    {
      "id": "nm5846164",
      "name": "Martin Smith",
      "character": "Demon"
    },
    {
      "id": "nm1392106",
      "name": "Matt Vancil",
      "character": "Shadowy Figure"
    }
  ],
  "overview": "Two college students are seduced into the evil cult of role playing games.",
  "storyline": "Two college students are seduced into the evil cult of role playing games.",
  "plot": "The Empire of Izmir has long been a divided land, ruled by the Mages, an elite group of magic users. An evil mage named Profion (Jeremy Irons) attempts to create a sceptre that allows him to control Gold Dragons. His attempt to control a captive golden dragon fails, and he is forced to kill it. The dragon bleeds into the river, causing it to catch fire, which many inhabitants notice, including a pair of thieves, Ridley (Justin Whalin) and Snails (Marlon Wayans).\n\nLater, Profion and the Council talk about the controversial views of Empress Savina (Thora Birch), who wants to give rights to non-mages in Izmir. Meanwhile, Ridley and Snails break into the magic school to steal valuables, but are caught by Marina (Zoe McLellan). She is distracted when the Library wizard is held hostage and interrogated by Profion's henchmen, Damodar (Bruce Payne) for information on where the map to the magic sceptre that controls Red Dragons is. After refusing to talk, Damodar kills him. Marina gets the map and travels through a portal to escape, accidentally taking the thieves with her. After crashing into a pile of garbage, they meet a dwarf named Elwood (Lee Arenberg), who ends up joining Ridley, Snails and Marina escaping through the sewer.\n\nDamodar puts a price on Marina, Ridley, Snails and Elwood's heads and, after letting Profion know that the protagonists got away, Profion creates a tentacled monster inside Damodar's head. The protagonists hide in a tavern and read the map that Ridley and Marina get sucked into. Damodar and his henchmen attack Elwood and Snails, but they manage to get away with the map. Ridley and Marina exit the map and all decide to work together to find the sceptre. They apparently have to find a red ruby called the \"Eye of the Dragon\" that can open the door to a tomb where the red sceptre rests. The ruby is located in a den of thieves that is led by Xilus (Richard O'Brien) who'll give the protagonists the \"Eye of the Dragon\" if Ridley solves a maze of booby traps. Ridley manages to get the \"Eye of the Dragon\" when Damodar arrives to capture him and his friends. Marina is captured while Ridley, Snails and Elwood escape, meeting an elf named Norda (Kristen Wilson) who works for Empress Savina and informs the Empress about Profion's plans to get the Red Dragon sceptre. Meanwhile, Damodar interrogates Marina, using the tentacles in his head to gain her knowledge.\n\nRidley and Snails break into the castle to rescue Marina, while Norda and Elwood stay behind. Ridley and Snails split up and Ridley finds Marina, but Snails is confronted and killed by Damodar when he throws the map to his comrades. Ridley becomes enraged at Damodar and attacks him, but Damodar disarms him and stabs him in the left shoulder with his own sword. In the confusion Marina grabs some magic dust and uses a magic portal to escape with Ridley, leaving the corpse of Snails behind. During the council meeting, Profion and Empress Savina battle over the domination of Izmir.\n\nMeanwhile, an elf (Tom Baker) heals Norda's soldiers and Ridley, and Marina tries to help Ridley get over the death of Snails, but Ridley angrily rebukes her. After an argument in which Marina convinces Ridley that Snails didn't die in vain, they become love interests. Ridley uses the \"Eye of the Dragon\" to finally get the Red Dragon sceptre, which is held by a skeleton that comes to life and warns Ridley that \"anyone who wields the power of the rod shall suffer a horrible fate\", but Damodar arrives to steal the sceptre and brings it to Profion, where Ridley, Marina and Elwood follow.\n\nThey travel back to the Empress' castle where Gold dragons controlled by the Empress are battling the Mages below. Profion uses the Red Dragon sceptre to summon Red dragons, which battle the Gold dragons and slowly begin to win the fight. Ridley comes across Damodar, duels him with his new magic sword and then kills him, sending his body off the castle wall, and then, after a confrontation with Profion, Ridley destroys the sceptre and a Gold dragon eats Profion.\n\nRidley later visits Snails's grave, where Snail's engraved name disappears, and Norda teleports Ridley to a place where \"your friend awaits you\", along with herself, Marina and Elwood.",
  "synopsis": null
}