{
  "imdb_id": "tt3646288",
  "tmdb_id": "272519",
  "douban_id": null,
  "title": "Aal (2014)",
  "genres": [
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "111 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.0,
  "director": [
    {
      "id": "nm6405577",
      "name": "Ananda Krishnan"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm4776159",
      "name": "Vidharth",
      "character": "Amir"
    },
    {
      "id": "nm5937577",
      "name": "Hardika Shetty",
      "character": "Meenakshi"
    }
  ],
  "overview": "A man returns from vacation to find that his family has been kidnapped. He is handed over a cell phone, the caller on which gives him a set of instructions that he must follow to save his family. However, he soon realizes that he has been implicated in a bombing.",
  "storyline": "Aamir (Viddharth), a college professor in Sikkim, befriends Rizwan, a student who is targeted by other students because he is a Muslim, and makes him stay in his own place. We get to know about Aamir's family and his Hindu lover Meenakshi (Hardika). However, their love affair comes out in the open and that is why Aamir is in Chennai. However, upon his arrival at the airport, he is met by mysterious helmet-wearing men who give a phone and order him to speak. A mysterious man tells him that he has kidnapped his family, who he will let live, if Aamir does the tasks he sets him. Having no other alternative, Aamir accepts this order, which leads him into a situation from where there is no backing out. Can Aamir, who has become a puppet in the hands of a shady operator, find courage within to shape his own destiny?",
  "plot": "It is about the life of an ordinary man facing an extraordinary situation in a single day. The story starts in Sikkim and travels with a grip towards the climax in Chennai. The film screens about how the youngsters are brought to the terrorism. Amir(Vidharth) is an intelligent professor, who has already been in love with Meenakshi(Hardika Shetty), who works in Sikkim, when he visits back to Chennai he is backmailed to join a terrorist organization that would holds captive his family and lover. Then the extraordinary things happen in one day. Aal received good reviews from the critics, but failed in box office sales.",
  "synopsis": null
}