{
  "imdb_id": "tt3687398",
  "tmdb_id": "277546",
  "douban_id": null,
  "title": "The Runner (2015)",
  "genres": [
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.6,
  "director": [
    {
      "id": "nm0823133",
      "name": "Austin Stark"
    }
  ],
  "writer": [
    {
      "id": "nm0823133",
      "name": "Austin Stark",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0000115",
      "name": "Nicolas Cage",
      "character": "Colin Pryce"
    },
    {
      "id": "nm0005299",
      "name": "Sarah Paulson",
      "character": "Kate Haber"
    },
    {
      "id": "nm0001228",
      "name": "Peter Fonda",
      "character": "Rayne Pryce"
    },
    {
      "id": "nm0001567",
      "name": "Connie Nielsen",
      "character": "Deborah Pryce"
    },
    {
      "id": "nm0682495",
      "name": "Wendell Pierce",
      "character": "Frank Legrand"
    },
    {
      "id": "nm0061262",
      "name": "Bryan Batt",
      "character": "Mark Lavin"
    },
    {
      "id": "nm0077512",
      "name": "Christopher Berry",
      "character": "Hal Provich"
    },
    {
      "id": "nm2234564",
      "name": "Ciera Payton",
      "character": "Lucy Hall"
    },
    {
      "id": "nm0499791",
      "name": "Fredric Lehne",
      "character": "Senator Owens"
    },
    {
      "id": "nm1664127",
      "name": "James Moses Black",
      "character": "Dr. Haleman"
    },
    {
      "id": "nm1251245",
      "name": "Donna Duplantier",
      "character": "Bernadette Richards"
    },
    {
      "id": "nm4221471",
      "name": "Brooke Hoover",
      "character": "Maryellen Briggs"
    },
    {
      "id": "nm2624568",
      "name": "Darcel White Moreno",
      "character": "Alyssa"
    },
    {
      "id": "nm8431862",
      "name": "Kerry Kahill",
      "character": "Lt. Jenn Wyman"
    },
    {
      "id": "nm0114177",
      "name": "Marcus Lyle Brown",
      "character": "Chris Wilcox"
    },
    {
      "id": "nm3672453",
      "name": "Wanetah Walmsley",
      "character": "Layla"
    },
    {
      "id": "nm5593149",
      "name": "Cullen Tonry",
      "character": "Kate's Son (Robby)"
    },
    {
      "id": "nm2621487",
      "name": "Michael Aaron Santos",
      "character": "Bryan"
    },
    {
      "id": "nm3627254",
      "name": "Cree Kelly",
      "character": "Brooke Davis       (as Christine Kelly)"
    },
    {
      "id": "nm2830113",
      "name": "Chris Papavasiliou",
      "character": "Bill Musgrave"
    },
    {
      "id": "nm8363573",
      "name": "Wilbert Williams",
      "character": "Oysterman"
    },
    {
      "id": "nm0664505",
      "name": "Lawton Paseka",
      "character": "George Litbern"
    },
    {
      "id": "nm8431881",
      "name": "Ashley Arpell",
      "character": "Waitress"
    },
    {
      "id": "nm2445532",
      "name": "James Yeargain",
      "character": "Kingfish Blogger"
    },
    {
      "id": "nm8431884",
      "name": "John Eyez",
      "character": "Terrence Hall"
    },
    {
      "id": "nm5311266",
      "name": "Rhonda Johnson Dents",
      "character": "Housekeeper       (as Rhonda Dents)"
    },
    {
      "id": "nm2503042",
      "name": "Mary O'Rourke",
      "character": "Lavin's Assistant"
    },
    {
      "id": "nm2958419",
      "name": "Thomas Francis Murphy",
      "character": "Shrimper"
    },
    {
      "id": "nm3859945",
      "name": "Ian Hoch",
      "character": "Jason Hale"
    },
    {
      "id": "nm1885015",
      "name": "Judd Lormand",
      "character": "Dan Smith"
    },
    {
      "id": "nm1305056",
      "name": "Lara Grice",
      "character": "Nurse"
    },
    {
      "id": "nm6243329",
      "name": "Moses Millman",
      "character": "Kate's Older Son (Sam)"
    },
    {
      "id": "nm5301939",
      "name": "Yanina Hope",
      "character": "TV Journalist"
    },
    {
      "id": "nm2684369",
      "name": "Kerry Cahill",
      "character": "Lt. Wyman"
    },
    {
      "id": "nm5764195",
      "name": "Ashley Arpel Greenwald",
      "character": "Waitress       (as Ashley Arpel)"
    },
    {
      "id": "nm5857646",
      "name": "Joseph Oliveira",
      "character": "Oil rig worker"
    }
  ],
  "overview": "In the aftermath of the BP oil spill, an idealistic but imperfect New Orleans politician (Nicolas Cage) finds his plans of restoration unraveling as his own life becomes contaminated with corruption, scandal and deceit.",
  "storyline": "In the aftermath of the 2010 BP oil spill, an idealistic but flawed politician is forced to confront his dysfunctional life after his career is destroyed in a sex scandal.",
  "plot": "A male teenager wakes up inside an underground elevator with no memory of his identity. A group of male youths greet him in a large grassy area they call the \"Glade\" enclosed by tall, stone walls. The boys (\"Gladers\") have formed a rudimentary society with each assuming specialized tasks. Their leader, Alby, says that every boy eventually recalls his name but not his past. The boy learns that a vast Maze surrounding them may be the only way out. During the day, designated Runners search the Maze for an escape route, returning before nightfall when the entrance closes. No one has ever survived a night in the Maze.\n\nWhile in a competition with another boy named Gally, the boy suddenly remembers his name: Thomas. The next day, he is attacked by Ben, a Runner delirious from being stung by a Griever – deadly techno-organic creatures that roam the Maze at night. Ben is forced into the Maze and left to die, as there is no cure for his condition. Alby and Minho, the lead Runner, later retrace Ben's steps inside the Maze. Minho reappears at dusk dragging Alby, who is stung, but they are unable to reach the closing entrance in time. Thomas runs into the Maze to help, leaving all three trapped. During an ensuing encounter with a Griever, Thomas lures it into a closing passageway, crushing it to death. The trio manages to survive the night and returns to the Glade the next morning.\n\nThe first ever girl – Teresa – arrives in the elevator with a note in her hand: \"She's the last one EVER.\" She doesn't remember her past but recognizes Thomas, though he cannot remember her. Thomas, Minho, and others enter the Maze, locate the Griever corpse, and remove a beeping mechanical device from inside it. Gally claims Thomas has jeopardized the fragile peace between the youths and the Grievers and wants him punished, but Newt, the group's second-in-command, instead designates Thomas as a Runner. Minho shows Thomas a hand-constructed model of the Maze based on previous exploration. The Maze's numbered sections open and close in a regular sequence. Thomas realizes that the device corresponds to a section within the Maze.\n\nThe device has two syringes filled with an unknown substance. One is used on Alby, and he recovers from the Griever sting. Minho and Thomas venture back into the Maze with the device and discover a possible exit. That night, the Maze entrance does not close while others open, letting Grievers pour in. A massacre ensues as the Gladers struggle to fight back or hide. Zart, Clint and several others are killed, while Alby sacrifices himself, telling Thomas to \"get them out.\"\n\nAfterwards, Gally attacks Thomas and blames him for everything that happened. Thomas, who has had disconnected memory flashes since arriving, stabs himself with a severed Griever stinger in an attempt to revive his memory. The others inject him with the last anti-venom. Unconscious, he recalls that he and Teresa worked for the organization that created the Maze, W.C.K.D.; the boys have unknowingly been test subjects for an experiment. Thomas awakens and shares this information with Newt, Minho, Chuck, and Teresa. Thomas then exposes himself and Teresa, confessing that they worked with W.C.K.D. and studied the boys for years.\n\nMeanwhile, Gally has taken command and intends to sacrifice Thomas and Teresa to the Grievers to restore the peace. Several Gladers form a group and free them. They approach the Maze in an attempt to find an escape, while Gally and a few others refuse to leave. Fighting Grievers as they go, several Gladers are killed. The survivors eventually enter a laboratory strewn with corpses. In a video recording, a woman named Ava Paige explains that the planet has been devastated by a massive solar flare, followed by a pandemic of a deadly virus called the Flare. The teens learn that they were part of an experiment studying for a cure. Paige shoots herself as the lab is attacked by armed men.\n\nGally suddenly appears with a gun, delirious from being stung by a Griever. He insists they must stay in the Maze and aims at Thomas. Minho kills Gally, who fatally shoots Chuck as he shielded Thomas. Masked armed men rush in and take the group to a helicopter. The helicopter flies over a vast desert wasteland and approaches a ruined city. The scene ends with the supposedly dead Ava Paige meeting unnamed people in a room. Paige notes that the experiment is successful and that the survivors are now entering Phase Two.",
  "synopsis": null
}