{
  "imdb_id": "tt3668084",
  "tmdb_id": "330408",
  "douban_id": null,
  "title": "Forget and Forgive (TV Movie 2014)",
  "genres": [
    "Thriller"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "87 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.2,
  "director": [
    {
      "id": "nm0239477",
      "name": "Tristan Dubois"
    }
  ],
  "writer": [
    {
      "id": "nm0053377",
      "name": "Doug Barber",
      "description": null
    },
    {
      "id": "nm1156122",
      "name": "James Phillips",
      "description": "as James Taylor Phillips"
    }
  ],
  "cast": [
    {
      "id": "nm0737533",
      "name": "Elisabeth Röhm",
      "character": "Anna Walker"
    },
    {
      "id": "nm0750353",
      "name": "Tygh Runyan",
      "character": "Derek Wregget"
    },
    {
      "id": "nm0621034",
      "name": "Neil Napier",
      "character": "Tate Walker"
    },
    {
      "id": "nm1659389",
      "name": "Vivien Endicott Douglas",
      "character": "Emily Walker       (as Vivien Endicott-Douglas)"
    },
    {
      "id": "nm3674712",
      "name": "Mal Dassin",
      "character": "Nick"
    },
    {
      "id": "nm5470212",
      "name": "Katy Grabstas",
      "character": "Ingrid Gabor"
    },
    {
      "id": "nm0165067",
      "name": "Richard Clarkin",
      "character": "Clay Russo"
    },
    {
      "id": "nm0078847",
      "name": "Claudia Besso",
      "character": "Dr. Kim Boyd"
    },
    {
      "id": "nm4152992",
      "name": "Raphael Grosz-Harvey",
      "character": "Styles"
    },
    {
      "id": "nm0601210",
      "name": "Frank Moore",
      "character": "George Shelton"
    },
    {
      "id": "nm1799534",
      "name": "Karine Dion",
      "character": "Lori Hayes"
    },
    {
      "id": "nm0143456",
      "name": "Julian Casey",
      "character": "Jack Paxton"
    },
    {
      "id": "nm0255331",
      "name": "Toni Ellwand",
      "character": "Nurse Fran"
    },
    {
      "id": "nm7144968",
      "name": "Andrew Di Bello",
      "character": "Calum"
    },
    {
      "id": "nm3996513",
      "name": "Olivier Surprenant",
      "character": "Hooker"
    },
    {
      "id": "nm4376574",
      "name": "Ziad Ghanem",
      "character": "Alvarez"
    },
    {
      "id": "nm3622342",
      "name": "Isabelle Giroux",
      "character": "Waitress"
    },
    {
      "id": "nm1013185",
      "name": "Stephen Mwinga",
      "character": "Man in Handcuffs"
    }
  ],
  "overview": "After being left for dead, Anna Walker awakes in the hospital to find she has full blown amnesia.",
  "storyline": "After being left for dead, Anna Walker awakes in the hospital to find she has full blown amnesia.",
  "plot": "Like its predecessor, Left 4 Dead 2 is set in the aftermath of a worldwide pandemic of an infectious disease known as the \"Green Flu\", which rapidly transforms humans into zombie-like creatures and mutated forms that demonstrate extreme aggression towards non-infected (much like the infected in 28 Days Later). Few humans are immune to the disease, still carrying the infection but showing no symptoms. The Civil Emergency and Defense Agency (CEDA) and the U.S. military create safe zones to attempt to evacuate as many American survivors as possible. Left 4 Dead 2 introduces four new Survivors—Coach, Ellis, Nick, and Rochelle, who are immune to the disease and have individual back stories that are provided through character dialogue. While the game is intended as a continuation of the original, occurring one week after the first game begins, Valve decided to create a new group of Survivors due to the change in location. Like the first game, the five campaigns in Left 4 Dead 2 are set across a story arc, set in the Southern United States, which starts in Savannah, Georgia, and ends in New Orleans, Louisiana. The four Survivors have to fight their way through hordes of Infected, using safehouses along the way to rest and recuperate in order to reach extraction points.\nCharacters\n\nLeft 4 Dead 2 features a new cast of human Survivors, which include: Coach (voiced by Chad Coleman), a portly high-school football coach with a bad knee (although it does not affect gameplay); Nick (voiced by Hugh Dillon), a cold and sarcastic gambler and con artist; Rochelle (voiced by Rochelle Aytes), a low-level production assistant reporting on the evacuation for a local television station; and Ellis (voiced by Eric Ladin), a friendly (and rather talkative) mechanic who often talks about his friend Keith and their many misadventures. In addition to the four playable characters, Left 4 Dead 2 also features a supporting character in the form of Virgil (voiced by Randall Newsome), a Cajun boat captain, who appears (voice only) in the game's final three campaigns.\nStory\nThe amusement park in the campaign Dark Carnival\nThe Sacrifice DLC campaign takes place before the main events of Left 4 Dead 2; and after the events of The Sacrifice comic. The original survivors of Left 4 Dead—Bill, Francis, Louis, and Zoey—arrive at the portside town of Rayford, in order to search for a boat that can take them to the Florida Keys. After finding an adequate sailboat, the Survivors have to manually start up generators in order to lift a bridge for their boat to pass through. One Survivor (canonically Bill) sacrifices himself in order to kick-start a generator once it gives out, so that the others may reach safety. This is the end of Bill's story in the Left 4 Dead video game series.\n\nLeft 4 Dead 2 opens in Dead Center (set in Savannah, Georgia), where the four Survivors find themselves abandoned on a hotel roof by rescue helicopters. They decide to head for the local mall, where a second CEDA evacuation point is located. After a brief encounter with a gun store owner, Whitaker (voiced by Dayton Callie), the Survivors discover that the mall is overrun, with all CEDA agents having become either dead or infected as well. Ellis helps the group use a stock car to bust out of the mall and travel towards New Orleans, rumored to be the last standing city in America.\n\nThe Passing DLC campaign takes place between Dead Center and Dark Carnival, and after the events of The Sacrifice campaign. The Survivors of L4D2 arrive at the bridge in Rayford, where they meet Francis, Louis, and Zoey. As they need to cross the bridge to proceed, the Survivors need to find another way across to refill the generator with gas. After fighting their way through a wedding reception (complete with a Witch bride), the streets, and a historic under-the-river tour, they meet up again with the original Survivors, who help by covering for the group while they fill the generator and lowering the bridge once it's full.\n\nAt the start of the Dark Carnival campaign, the four Survivors find the highway ahead completely blocked by ditched vehicles, and are forced to travel on foot through an abandoned (but still-operating) amusement park. After navigating their way to the park stadium, Coach devises a plan to use a large-scale light show used by a rock band, The Midnight Riders, in order to signal a helicopter pilot for rescue.\n\nAfter being rescued, they later discover that their pilot has been Infected. When the pilot starts attacking them, Nick is forced to kill him (echoing a similar situation in Left 4 Dead), causing the chopper to crash into a bayou, the setting for Swamp Fever. Working their way through the swamps, the group comes across a crashed airplane, dead military paratroopers, and isolated swamp villages which had held out against the Infected but were eventually overrun. After spending the morning fighting through the swamp, the group arrives at a plantation mansion and make radio contact with Virgil, a Cajun boat captain who can assist them; however, his boat begins to run low on diesel fuel on the way to New Orleans. As a tumultuous rainstorm approaches (the titular Hard Rain of the subsequent campaign), the Survivors go ashore at Ducatel, Mississippi; make their way through an abandoned (and Witch-infested) sugarcane mill to a gas station to get diesel fuel, and return to signal Virgil with an improvised \"flare\".\n\nIn the final campaign, The Parish, Virgil drops the group off at New Orleans, where the military appears to be evacuating civilians across a bridge. On the way there, the four discover the city overrun with Infected, and that the military is actually leaving the city before it is destroyed by an air strike. The group manages to reach the bridge, where they make contact with the military. Judging from their dialogue, the military pilots suspect the Survivors to be \"carriers\", similar to the original Survivors of Left 4 Dead. After securing their rescue helicopter, the Survivors lower and cross the bridge, escaping on the helicopter just as the bridge is destroyed. While the Survivors' fate is left unclear after this point, Chet Faliszek, the game's writer, back in 2009 said that the military is taking survivors to cruise ships in the Caribbean in an attempt to escape the infection.",
  "synopsis": null
}