{
  "imdb_id": "tt3681440",
  "tmdb_id": "263497",
  "douban_id": null,
  "title": "Yaamirukka Bayamey (2014)",
  "genres": [
    "Comedy",
    "Horror"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "125 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm6442103",
      "name": "Deekay"
    }
  ],
  "writer": [
    {
      "id": "nm6442103",
      "name": "Deekay",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4935635",
      "name": "Krishna Sekhar",
      "character": "Kiran"
    },
    {
      "id": "nm4276346",
      "name": "Rupa Manjari",
      "character": "Kiran's Girlfriend"
    },
    {
      "id": "nm5369429",
      "name": "Karunakaran",
      "character": "Sharath"
    },
    {
      "id": "nm4250039",
      "name": "Oviya",
      "character": "Sharanya"
    },
    {
      "id": "nm6442104",
      "name": "Aadhav Kannadasan",
      "character": "Kamal"
    },
    {
      "id": "nm6484967",
      "name": "Anaswara",
      "character": "Land Owner"
    },
    {
      "id": "nm1759353",
      "name": "Nalinikanth",
      "character": "Old Man"
    },
    {
      "id": "nm1416319",
      "name": "Mayilsamy",
      "character": "Brother"
    },
    {
      "id": "nm3163756",
      "name": "Bose Venkat",
      "character": "Arunachalam"
    },
    {
      "id": "nm6334521",
      "name": "Namo Narayana",
      "character": "Hotel Guest"
    },
    {
      "id": "nm4787137",
      "name": "Mahanadhi Shankar",
      "character": "Durai"
    },
    {
      "id": "nm4439446",
      "name": "Sona Heiden",
      "character": "Sona"
    },
    {
      "id": "nm3482331",
      "name": "Devipriya",
      "character": "Arunachalam's Wife"
    },
    {
      "id": "nm6489056",
      "name": "Balaji Mohan",
      "character": "Durai's Son"
    },
    {
      "id": "nm6489057",
      "name": "Rayil Ravi",
      "character": ""
    },
    {
      "id": "nm6489058",
      "name": "Yogi Babu",
      "character": ""
    },
    {
      "id": "nm6615501",
      "name": "Daniel Annie Pope",
      "character": ""
    }
  ],
  "overview": "Kiran gets his dad's property and decides to turn it into a hotel. Intriguingly, all the customers who come to stay there, dies inexplicably. What's happening?",
  "storyline": "A fictional hill resort is the milieu, where a con couple Kiran (Kreshna) along with his girlfriend (Rupa Manjari) inherits a spooky looking dilapidated mansion and they move in, and decide to run a hotel there. They meet the caretaker (Karunakaran) and his sister (Oviya) who joins them in running the desolate property. Weird looking guests who check-in die mysteriously and the four member gang bury them in the backyard, till they realize that there is something eerie about the place. Strange and inexplicable things begin to happen and soon it turns fatal. Very soon, a mysterious fifth character enters their life. Is it a supernatural element?",
  "plot": "Kiran (Kreshna) is a television telemarketer, who gets into trouble after one of his products has an opposite effect than what was intended, on the son of a local thug. That is also precisely the moment when he discovers that his ‘real’ father left him a bungalow on an estate in a small town. He cons the son of the don, escapes with the money along with his girlfriend Smitha (Rupa Manjari), renovates the run down mansion into a hotel with the help of a local caretaker Sharath (Karunakaran) who was under the care of Kiran's father before and his bombshell sister Saranya (Oviya). Customers begin trickling in, but strangely most of them wind up dead. Baffled, Kiran tries to uncover the mystery behind the deaths, which eventually leads him to believe that the house is haunted. His suspicions are confirmed when things start going awry in the house, indicating some supernatural presence and when he discovers that the people who checked in to his hotel were all previous owners of the land and interestingly all dead themselves. They soon go to seek help from brother Adaikalam, who is actually a cheat. They kidnap him and bring him to the house. The foursome catch an old man inside the house assuming he is a thief. However, the old man says that he and the others will die if they leave the hotel. He narrates that the house was haunted by a ghost - Mohini (Anaswara Kumar) who would kill the owner of the house. Soon the ghost starts to possess the people in the house and attacks Kiran. The gang is finally cornered with no chance of escape. It is said that they would die by midnight. Hearing someone banging on the door, Kiran opens the door to find the don, his son and his thugs. The don asks for the house in return for the money he conned from him. Feeling pity for them, Kiran warns them about the spirit. Not listening to Kiran, the don forces him to sign the papers for the house. Kiran and his friends are let go and they see the spirits of the previous owners on their way out. Just as they go out, they find the don and his thugs outside. Knowing that the ghost has killed the don's group since it is midnight, Kiran and his group walk away.",
  "synopsis": null
}