{
  "imdb_id": "tt3697270",
  "tmdb_id": "319193",
  "douban_id": null,
  "title": "Of Girls and Horses (2014)",
  "genres": [
    "Drama"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "82 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.4,
  "director": [
    {
      "id": "nm0872331",
      "name": "Monika Treut"
    }
  ],
  "writer": [
    {
      "id": "nm0872331",
      "name": "Monika Treut",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm2243601",
      "name": "Ceci Chuh",
      "character": "Alex"
    },
    {
      "id": "nm3048027",
      "name": "Alissa Wilms",
      "character": "Kathy"
    },
    {
      "id": "nm1314773",
      "name": "Vanida Karun",
      "character": "Nina"
    },
    {
      "id": "nm2482543",
      "name": "Ellen Grell",
      "character": "Christine"
    },
    {
      "id": "nm6909931",
      "name": "Ulrike Ehlers",
      "character": ""
    },
    {
      "id": "nm6909932",
      "name": "Peter Möller Ehlers",
      "character": ""
    },
    {
      "id": "nm6909933",
      "name": "Anna Ehlers",
      "character": ""
    },
    {
      "id": "nm6909934",
      "name": "Kevin Ehlers",
      "character": ""
    },
    {
      "id": "nm6909935",
      "name": "Marvin Ehlers",
      "character": ""
    },
    {
      "id": "nm6909936",
      "name": "Louise Foos",
      "character": ""
    },
    {
      "id": "nm6909937",
      "name": "Manfred Geier",
      "character": ""
    },
    {
      "id": "nm6909938",
      "name": "Volker Ingwersen",
      "character": ""
    },
    {
      "id": "nm6909939",
      "name": "Franziska Jung",
      "character": ""
    },
    {
      "id": "nm6909940",
      "name": "Lena Kirch",
      "character": ""
    },
    {
      "id": "nm6909941",
      "name": "Alina Meyer",
      "character": ""
    },
    {
      "id": "nm6909942",
      "name": "Doris Hansen",
      "character": ""
    },
    {
      "id": "nm6909943",
      "name": "Carmina Burana",
      "character": "Horse Carmina"
    },
    {
      "id": "nm6909944",
      "name": "Cornetto",
      "character": "Horse Cornetto"
    },
    {
      "id": "nm6909945",
      "name": "Jesar",
      "character": "Horse Jessar"
    },
    {
      "id": "nm6909946",
      "name": "Tessa",
      "character": "Horse Tessa"
    },
    {
      "id": "nm6909947",
      "name": "Sissi",
      "character": "Horse Sissi"
    }
  ],
  "overview": "A troubled teen finds love during a summer spent at a horse ranch.",
  "storyline": "Alex is a 16-year-old misfit and high school dropout. In a final attempt to set Alex straight, her adoptive mother signs her up for an internship at a farm where Alex meets thirty-something Nina, a riding instructor who is taking a break from her partner Christine and their life in the city. Although Alex initially hates being stuck on the farm, she gradually connects with the horses. When upper-class Kathy arrives for a vacation, Alex dislikes her immediately. But as the days slowly drift by, the girls form a friendship, and when they are left alone one weekend things spin out of control.",
  "plot": "In the remote Icelandic valley, there is not much to do other than observe the horses, the neighbors, and the neighbors' horses with binoculars. Undisturbed, the stallions and mares do what nobody else in the valley dares to even talk about: love. However, there is still a feeling of love among some of the valley dwellers. Kolbeinn (Ingvar Eggert Sigurðsson) and Solveig's (Charlotte Bøving) attempts at love are the subject of much interest for the valley dwellers.\n\nMeanwhile, Vernhardur (Steinn Ármann Magnússon), who has a weakness for liquor, makes a name for himself on a Russian fishing vessel with the sailor Gengis (Kash Erden Baater). There is often disagreement about the riding routes between Grimur (Kjartan Ragnarsson) and Egill (Helgi Björnsson); Grimur generally prefers the classic routes on horseback, whereas Egill prefers riding through rough terrain on his tractor. Jóhanna (Sigríður María Egilsdóttir), on the other hand, has nothing to say concerning her mare Raudka. One day, she encounters an injured old man. The religious Juan Camillo (himself) is seeking God on a high spiritual level.\n\nAbove all, all the people in the valley share a love of their horses, and eventually come to understand one another.",
  "synopsis": "Alex is 16, a misfit, a drop-out, a failure. She uses drugs; she cuts herself. She has been sent by her despairing adoptive mother to a farm in northern Germany. At first, Alex hates this remote place and the demanding job of looking after the horses. But under the tutelage of Nina, a 30-something taking a break from city life and her partner, Christine, Alex gradually comes to form a bond with the animals in her charge.\nThen Kathy arrives at the farm to take a holiday, bringing her own, beautiful horse with her. Alex takes an instant dislike to this privileged newcomer. Slowly, though, the barriers between the two are broken down and Kathy finds herself smitten by the streetwise and energetic Alex. The pair starts horsing around, larking about on the mudflats, until one weekend, when theyre alone at the farm, things spiral out of control. A coming-of-age story with girls and horses, under the lowering skies of northernmost Germany, by the ocean and close to the Danish border."
}