{
  "imdb_id": "tt3619102",
  "tmdb_id": "368256",
  "douban_id": null,
  "title": "Condemned (2015)",
  "genres": [
    "Horror"
  ],
  "country": null,
  "version": [
    {
      "runtime": "83 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.5,
  "director": [
    {
      "id": "nm3033391",
      "name": "Eli Morgan Gesner"
    }
  ],
  "writer": [
    {
      "id": "nm3033391",
      "name": "Eli Morgan Gesner",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2365157",
      "name": "Dylan Penn",
      "character": "Maya"
    },
    {
      "id": "nm4230210",
      "name": "Ronen Rubinstein",
      "character": "Dante"
    },
    {
      "id": "nm2131379",
      "name": "Genevieve Hudson-Price",
      "character": "Alexa"
    },
    {
      "id": "nm6407813",
      "name": "Honor Titus",
      "character": "Loki"
    },
    {
      "id": "nm6407812",
      "name": "Kevin Smith Kirkwood",
      "character": "Roxy"
    },
    {
      "id": "nm1935905",
      "name": "Lydia Hearst",
      "character": "Tess"
    },
    {
      "id": "nm0009016",
      "name": "Jon Abrahams",
      "character": "Vince"
    },
    {
      "id": "nm0950953",
      "name": "Perry Yung",
      "character": "Cookie"
    },
    {
      "id": "nm0582257",
      "name": "Johnny Messner",
      "character": "Gault"
    },
    {
      "id": "nm0312217",
      "name": "Jordan Gelber",
      "character": "Big Foot"
    },
    {
      "id": "nm0158207",
      "name": "Anthony Chisholm",
      "character": "Shynola"
    },
    {
      "id": "nm3109702",
      "name": "Michael DeMello",
      "character": "Murphy"
    },
    {
      "id": "nm0198804",
      "name": "Nick Damici",
      "character": "Hoobler"
    },
    {
      "id": "nm0703363",
      "name": "Tuffy Questell",
      "character": "Alejandro       (as Americo 'Tuffy' Questell)"
    },
    {
      "id": "nm3033391",
      "name": "Eli Morgan Gesner",
      "character": "Junior CDC Agent"
    },
    {
      "id": "nm0318703",
      "name": "Michel Gill",
      "character": "Senior CDC Agent"
    },
    {
      "id": "nm1826988",
      "name": "Michael Drayer",
      "character": "Officer Thomas"
    },
    {
      "id": "nm4277887",
      "name": "Kea Ho",
      "character": "Kea Ho (Pop Star)"
    }
  ],
  "overview": "Fed up with her parents' bickering, poor-little-rich-girl Maya (Dylan Penn) moves in with her boyfriend who is squatting in an old, condemned building on Manhattan's Lower East Side. With neighbors that are meth heads, junkies and degenerates, this depraved hell hole is even more toxic than it appears: After a virus born from their combined noxious waste and garbage infects the building's residents, one by one, they succumb to a terrifying pathogen that turns them into bloodthirsty, rampaging killers and transforms their building into a savage slaughterhouse.",
  "storyline": "Fed up with her parents' bickering, poor-little-rich-girl Maya (Dylan Penn) moves in with her boyfriend who is squatting in an old, condemned building on Manhattan's Lower East Side. With neighbors that are meth heads, junkies and degenerates, this depraved hell hole is even more toxic than it appears: After a virus born from their combined noxious waste and garbage infects the building's residents, one by one, they succumb to a terrifying pathogen that turns them into bloodthirsty, rampaging killers and transforms their building into a savage slaughterhouse.",
  "plot": "Distraught over her parents' constant fighting, Maya moves in with her boyfriend, Dante, a struggling musician in New York City. Maya, who used to live in a wealthy neighborhood, is initially reluctant to even enter the condemned building in which Dante lives, but he convinces her to give it a chance. Dante explains that Shynola, the superintendent, still lives there, so it has basic plumbing and electricity service. Besides Shynola, the inhabitants include Alexa and Loki, Dante's roommates; Roxy and Big Foot, a transgender prostitute and her pimp; Tess and Vince, formerly-hip junkies; Cookie, who operates a meth lab; Gault and Murphy, death metal S&amp;M fetishists; and Hoobler, a recluse nobody has met.\n\nAlthough Maya gets along with most of the residents, she runs afoul of Gault, who threatens her for her naivety, which he says could bring the attention of the police and cause a raid. After Loki showers, his roommates initially believe him to be sick, but his apparent fever becomes worse, driving him to hallucinate and act erratically. Maya attempts to call the authorities for help, but when Gault objects, Dante quickly stops her, accidentally destroying her cell phone. Maya and Dante notice the other inhabitants exhibit bizarre, aggressive behavior. Years of poor plumbing have mixed together toxic chemicals, infected drug paraphernalia, and diseased human refuse, and the building's tap water now causes violent psychosis.\n\nCookie steps out to deliver a new batch of drugs, bolting the doors closed behind him. Two incompetent NYPD officers accidentally kill him, leaving the building's inhabitants trapped. Dante enlists Vince to help search for Loki, who has disappeared. At the same time, Alexa becomes violent, and Maya knocks out Big Foot when he attacks Roxy. After showing signs of infection, Vince stabs several people, and Tess aggressively rants about gentrification to Maya before being killed by Big Foot. As Vince and Big Foot attack each other, Maya escapes and reunites with Dante. The two search for uninfected people to help them but encounter only more violence and mayhem as their former friends kill each other.\n\nMurphy chases them into a bathroom, but he dies to his lover, Gault. Maya escapes through a small hole in the wall and retrieves a weapon for Dante. After fighting past Gault, Dante becomes stuck in rotted flooring and urges Maya to flee the approaching Gault. Dante falls through the floor, leaving Maya alone to confront Gault, who alternately expresses remorse and threatens to kill her. Hoobler, dressed in a hazmat suit, suddenly appears and kills Gault. As Hoobler urges Maya to contact the authorities, Loki kills him and chases her into the hole to the sewers Dante fell through.\n\nDante and Maya flee further into the sewers, but Dante's injured foot slows them down. Dante confronts Loki, killing him but becoming infected in the process. As he grows increasingly hostile toward Maya, she runs to a sewer grate and calls for help. The cops who accidentally killed Cookie earlier see her, and she blacks out. When she comes to, she is in a hospital. She cries out for Dante, hallucinating horrific imagery that involves the attending doctors, and they restrain her. While she struggles violently and threatens to kill them, a CDC official orders the entire block to be quarantined. As two earlier cops discuss their own heroism, Dante is seen roaming the sewers.",
  "synopsis": null
}