{
  "imdb_id": "tt3688406",
  "tmdb_id": "311539",
  "douban_id": null,
  "title": "A Christmas Horror Story (2015)",
  "genres": [
    "Fantasy",
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "99 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm0367538",
      "name": "Grant Harvey"
    },
    {
      "id": "nm0387541",
      "name": "Steven Hoban"
    },
    {
      "id": "nm0837977",
      "name": "Brett Sullivan"
    }
  ],
  "writer": [
    {
      "id": "nm3014258",
      "name": "Jason Filiatrault",
      "description": "uncredited"
    },
    {
      "id": "nm0444339",
      "name": "James Kee",
      "description": null
    },
    {
      "id": "nm4452130",
      "name": "Sarah Larsen",
      "description": null
    },
    {
      "id": "nm0852298",
      "name": "Doug Taylor",
      "description": null
    },
    {
      "id": "nm2100946",
      "name": "Pascal Trottier",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0000638",
      "name": "William Shatner",
      "character": "Dangerous Dan"
    },
    {
      "id": "nm0125579",
      "name": "George Buza",
      "character": "Santa"
    },
    {
      "id": "nm1353738",
      "name": "Rob Archer",
      "character": "Krampus"
    },
    {
      "id": "nm5046516",
      "name": "Zoé De Grand Maison",
      "character": "Molly"
    },
    {
      "id": "nm4495030",
      "name": "Alex Ozerov",
      "character": "Ben"
    },
    {
      "id": "nm3651929",
      "name": "Shannon Kook",
      "character": "Dylan"
    },
    {
      "id": "nm5046593",
      "name": "Amy Forsyth",
      "character": "Caprice Bauer"
    },
    {
      "id": "nm0164068",
      "name": "Jeff Clarke",
      "character": "Taylor"
    },
    {
      "id": "nm0634409",
      "name": "Michelle Nolden",
      "character": "Diane"
    },
    {
      "id": "nm0391738",
      "name": "Adrian Holmes",
      "character": "Scott"
    },
    {
      "id": "nm1583978",
      "name": "Olunike Adeliyi",
      "character": "Kim       (as Oluniké Adeliyi)"
    },
    {
      "id": "nm7645230",
      "name": "Orion John",
      "character": "Will"
    },
    {
      "id": "nm0012586",
      "name": "A.C. Peterson",
      "character": "Big Earl       (as Alan C. Peterson)"
    },
    {
      "id": "nm4007171",
      "name": "Percy Hynes White",
      "character": "Duncan       (as Percy Hynes-White)"
    },
    {
      "id": "nm0174766",
      "name": "Corinne Conley",
      "character": "Aunt Edda"
    },
    {
      "id": "nm0724995",
      "name": "Julian Richings",
      "character": "Gerhardt"
    },
    {
      "id": "nm1266485",
      "name": "Debra McCabe",
      "character": "Marta       (as Debra Lynne McCabe)"
    },
    {
      "id": "nm1706592",
      "name": "Joe Silvaggio",
      "character": "Jingles /              Troll Changeling"
    },
    {
      "id": "nm0028319",
      "name": "Damir Andrei",
      "character": "Principal Herod"
    },
    {
      "id": "nm2970078",
      "name": "Jessica Clement",
      "character": "Grace"
    },
    {
      "id": "nm2553849",
      "name": "Ken Hall",
      "character": "Shiny Elf"
    },
    {
      "id": "nm5732451",
      "name": "Korina Rothery",
      "character": "Sparkles Elf"
    },
    {
      "id": "nm2640246",
      "name": "Jonny Caines",
      "character": "Wire Elf       (as Jonathan H. Caines)"
    },
    {
      "id": "nm1792551",
      "name": "Brad Bennett",
      "character": "Chomping Elf"
    },
    {
      "id": "nm5772518",
      "name": "Catherine Fan",
      "character": "Army Chop Elf       (as Kathy Fan)"
    },
    {
      "id": "nm0068932",
      "name": "Dan Belley",
      "character": "Jumping Elf"
    },
    {
      "id": "nm5230560",
      "name": "Paige Moyles",
      "character": "Sobbing Teen"
    },
    {
      "id": "nm1571190",
      "name": "Glen Gaston",
      "character": "Middle Aged Man"
    },
    {
      "id": "nm1226422",
      "name": "Eric Woolfe",
      "character": "Foreman Elf"
    }
  ],
  "overview": "Christmas is supposed to be a time of joy, peace and goodwill. But for some folks in the small town of Bailey Downs, it turns into something much less festive.",
  "storyline": "High school students investigate a mysterious homicide that occurred the prior holiday season, a couple notices their young son is acting strangely after a snowy forest trip to cut down a traditional tree and one family are stalked through a winter wonderland by Krampus, the Xmas demon. Meanwhile at the North Pole, Santa is fending off zombie elves.",
  "plot": null,
  "synopsis": "Dangerous Dan (William Shatner) is an alcoholic radio DJ stuck pulling a long shift at the small town Bailey Downs radio station during Christmas Eve. During his broadcast, a series of four untitled stories are witnessed concurrently:First storyDylan (Shannon Kook), Ben (Alex Ozerov), and Molly Simon (Zoé De Grand Maison) are three teenagers who have decided to break into their school, which used to be a convent, in order to investigate two murders that occurred in the school's basement the year prior. Their friend, Caprice (Amy Forsyth), was supposed to go, but she instead has to go with her parents out of town. The three of them end up getting locked in the basement. Molly becomes possessed after witnessing a bloody ghost and tries to seduce the others. When Dylan refuses her, Molly kills him. Ben agrees to have sex and after the act is finished, the ghost leaves Molly's body. Upon waking Molly, reveals that the ghost is actually a pregnant teenager who died many years ago when the school was a convent after the convent's nuns gave her a gruesome surgery to remove the baby. The ghost is only interested in having someone give birth to her child and if someone refuses, they're murdered explaining last year's deaths. Despite impregnating Molly, the ghost sees Ben holding a weapon which the ghost views a threat, and the ghost kills him. The ghost then unlocks the door and allows Molly to leave.Second storyScott (Adrian Holmes) is a police officer, but this doesn't stop him from going into woods owned by \"Big Earl\" (Alan C. Peterson) with his family to illegally chop down a Christmas tree for his family. During the trek, Scott's son Will (Orion John) wanders off and is lost. He and his wife Kim (Olunike Adeliyi) manage to find Will inside of a tree and are overjoyed to find him. This joy is short lived after Will begins to act strangely, culminating in Big Earl contacting the family to warn them that Will is actually a changeling; a clone of the original Will. After the changeling kills Scott, Kim brings the changeling to Big Earl, who states that he's unable to help her find her son because it is up to the changelings. This ultimately ends with Kim shooting Big Earl, who was actually the changeling's abusive master. Finally free, the changeling returns to his home and frees Will allowing him to go home with his mother Kim.Third storyCaprice and her younger brother Duncan (Percy Hynes White) are traveling with their bickering and verbally abusive parents in order to visit their elderly Aunt Etta (Corrine Conley). During their visit, Etta tells them about the mythological creature Krampus (Rob Archer), which frightens Caprice especially after Duncan purposely misbehaves in an attempt to irritate Etta's caretaker, Gerhardt (Julian Richings). Their parents decide to take the children home at Etta's insistence but on the way the family ends up getting into a car accident, making it necessary for them to walk. Aware that they were being hunted by Krampus because they acted badly, the family members take refuge in a church where they confessed their sins in belief that Krampus will leave them if they do so. However, they are killed off one by one until only Caprice remains. Caprice manages to flee to Great-Aunt Etta's house. She is successful in killing Krampus who transforms into Gerhardt. It's revealed that he transformed into Krampus due to his anger over the family's actions and that Etta was fully aware that this would happen. Furious, Caprice's anger causes her to transform into Krampus and she attacks Etta.Fourth storyWhile preparing for a busy Christmas at his North Pole castle, Santa Claus (George Buza) discovers that all of his elves and his wife Martha have turned into zombies after one of the infected elves dies following a fit of rage. He manages to kill them all, but is then forced to fight against Krampus in the stables. However, during the battle, it's revealed that \"Santa\" is actually a Mall Santa named Norman (who was an earlier guest on Dangerous Dan's radio show) that had a psychotic break while working overtime that caused him to see regular mall goers as zombies during the Christmas Food Drive. This whole 'Santa' segment is actually taking place in Norman's mind. The police arrive and manage to gun him down just as he's about to kill \"Krampus\", revealed to be the mall's manager, Mr. Taylor. This is the disturbance at the mall that Dangerous Dan has been mentioning through his broadcast."
}