{
  "imdb_id": "tt3601350",
  "tmdb_id": "381275",
  "douban_id": null,
  "title": "Eva Hesse (2016)",
  "genres": [
    "Documentary",
    "Biography",
    "History"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "108 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.4,
  "director": [
    {
      "id": "nm0197744",
      "name": "Marcie Begleiter"
    }
  ],
  "writer": [
    {
      "id": "nm0197744",
      "name": "Marcie Begleiter",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0004757",
      "name": "Selma Blair",
      "character": "Eva Hesse       (voice)"
    },
    {
      "id": "nm0000837",
      "name": "Bob Balaban",
      "character": "Wilhelm Hesse       (voice)"
    },
    {
      "id": "nm1171145",
      "name": "Patrick Kennedy",
      "character": "Sol Lewitt       (voice)"
    },
    {
      "id": "nm1641243",
      "name": "Julia-Maria Köhler",
      "character": "Eva Hesse       (voice)"
    },
    {
      "id": "nm0770967",
      "name": "Ernst August Schepmann",
      "character": "Wilhelm Hesse       (voice)"
    },
    {
      "id": "nm1411809",
      "name": "Michael Che Koch",
      "character": "Sol Lewitt       (voice)"
    },
    {
      "id": "nm8079560",
      "name": "Tom Doyle",
      "character": "Himself"
    },
    {
      "id": "nm0624943",
      "name": "Werner Nekes",
      "character": "Himself"
    }
  ],
  "overview": "German American artist Eva Hesse (1936 – 1970) created her innovative art in latex and fiberglass in the whirling aesthetic vortex of 1960s New York. Her flowing forms were in part a reaction to the rigid structures of then-popular minimalism, a male-dominated movement. Hesse’s complicated personal life encompassed not only a chaotic 1930s Germany, but also illness and the immigrant culture of New York in the 1940s. One of the twentieth century’s most intriguing artists, she finally receives her due in this film, an emotionally gripping journey with a gifted woman of great courage.",
  "storyline": "A superstar in the art world, but little known outside, why does Eva Hesse continue to excite passions? This brilliant, gifted and visionary woman of 1960s NY survives personal chaos while creating work that changes the profile of art history. Along with creating a significant and deeply influential body of work during her short life, her story overlaps some of 20th century's most intriguing moments: Germany in the 1930's, New York's Jewish culture of immigration in the 1940's and the art scene in Manhattan and Germany in the 1960's. Hesse, one of the most important 20th century artists is finally revealed in this character-driven film, an emotionally gripping and inspiring journey with an artist of uncommon talent, a woman of extraordinary courage.",
  "plot": null,
  "synopsis": null
}