{
  "imdb_id": "tt3675676",
  "tmdb_id": "318131",
  "douban_id": null,
  "title": "The Spectacular Jihad of Taz Rahim (2015)",
  "genres": [
    "Comedy",
    "Crime",
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "128 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.5,
  "director": [
    {
      "id": "nm5514366",
      "name": "Raghav Murali"
    }
  ],
  "writer": [
    {
      "id": "nm5089537",
      "name": "Ria Mahtab",
      "description": null
    },
    {
      "id": "nm5514366",
      "name": "Raghav Murali",
      "description": null
    },
    {
      "id": "nm4380308",
      "name": "Rahsaan Noor",
      "description": "as Rahsaan Islam"
    }
  ],
  "cast": [
    {
      "id": "nm3967480",
      "name": "Monica Dogra",
      "character": "Sabrina Jiwan"
    },
    {
      "id": "nm4380308",
      "name": "Rahsaan Noor",
      "character": "Taz       (as Rahsaan Islam)"
    },
    {
      "id": "nm2265118",
      "name": "Kal Parekh",
      "character": "Nick Patel"
    },
    {
      "id": "nm2178489",
      "name": "Sorab Wadia",
      "character": "Mo Khan"
    },
    {
      "id": "nm4941563",
      "name": "Sana Serrai",
      "character": "Meera"
    },
    {
      "id": "nm1693718",
      "name": "Marc Goldberg",
      "character": "Roy Kellogg"
    },
    {
      "id": "nm0516518",
      "name": "Gerrard Lobo",
      "character": "Imran"
    },
    {
      "id": "nm2048869",
      "name": "Farah Bala",
      "character": "Yasmina"
    },
    {
      "id": "nm3302754",
      "name": "Lipica Shah",
      "character": "Natasha"
    },
    {
      "id": "nm6839218",
      "name": "Subhan Chowdhury",
      "character": "Ali Uncle"
    },
    {
      "id": "nm6839233",
      "name": "Nikita Chaudhry",
      "character": "Sameera"
    },
    {
      "id": "nm4918660",
      "name": "Kabir Chopra",
      "character": "Asad"
    },
    {
      "id": "nm6839234",
      "name": "Heidi Li",
      "character": "Sophie"
    },
    {
      "id": "nm6319153",
      "name": "Lis Locascio",
      "character": "Chloe       (as Lisa LoCascio)"
    },
    {
      "id": "nm6793373",
      "name": "Christina Cabral",
      "character": "Cindy"
    }
  ],
  "overview": "A Yo Yo Singh wannabe desi rapper is arrested and blackmailed by the NYPD into becoming an undercover police informant.",
  "storyline": "The Spectacular Jihad of Taz Rahim, starring Monica Dogra (Aamir Khan's Dhobi Ghat) and Rahsaan Islam (Bengali film Simanaheen), is a hip-hop themed English and Hindi language Bollywood Crime Dramedy based on true acts in the secret NYPD and FBI operation in the War on Terror. A Yo Yo Singh wannabe desi rapper is arrested and blackmailed by the NYPD into becoming an undercover police informant.",
  "plot": "Sabrina Jiwan (Monica Dogra) is filming a news piece about a Muslim informant who was encouraged by the NYPD to entrap his victims. She proceeds to interview the informant, Taz Rahim (Rahsaan Noor), where he discloses his story.\n\nSix months earlier, Taz was a struggling rapper living in Jackson Heights, New York, an immigrant Indian neighborhood. To make ends meet he sells marijuana and is one day arrested by an undercover cop (Kal Parekh). Around the same time, Sabrina receives permission from Mo Khan (Sorab Wadia) to make a documentary about his congressional campaign. Later he is revealed to have impregnated his mistress.\n\nAfter spending a few days incarcerated, Taz meets with the undercover cop, whose real name is Nick Patel. Nick threatens to deport Taz unless he agrees to work as a Muslim informant. Taz proceeds to get involved with the neighborhood mosque under the guise that he is trying to turn his life around. While working with his new friends, Taz’s path collides with Sabrina's. On the recommendation of Ali Uncle, Sabrina decides to hire Taz as an intern for her documentary.\n\nAs time passes on, discussions prompted by Taz concern his friends at the mosque. They decide to report to the NYPD and Nick Patel that they believe Taz is a terrorist planning a terror attack. News of accusation spreads through the community and Mo asks Sabrina to fire Taz from her documentary. Nick is also thinking about removing Taz from the operation after the embarrassment but Taz is able to convince Nick to give him one more chance. Taz then convinces Ali Uncle to talk to Mo about giving Taz another chance. In a private discussion, Mo requests Taz to murder his mistress.\n\nTaz feels that he has enough evidence to arrest Mo but is rebuted by Nick, whom wants to arrest Mo for terrorism not murder. Nick encourages Taz to pretend to move forward with Mo’s request in an attempt to uncover real terrorist activities. Unsure whom to trust, Taz moves forward with the plot to murder Mo’s mistress and then goes missing.\n\nNick begins to feel the heat from his superiors and interviews Sabrina about Taz’s disappearance and his connection to the murders of two women at a local strip club. Sabrina does not have any information. Later she is confronted by Taz on the street where he reveals the truth to Sabrina that he is being framed by Mo. Eventually, she is convinced of Taz’s innocence and she plans to help him gain his freedom by having him confess to being an informant.\n\nBack in the present, Sabrina releases her interview with Taz. In a final showdown, Taz is able to get Mo arrested with an admission of guilt and the help of Nick. In the end, it is revealed that Taz faked the murder of Mo’s mistress in an effort to put pressure on Nick to arrest Mo. Taz now has his freedom but is scarred by all things he did to let people down in his life.",
  "synopsis": null
}