{
  "imdb_id": "tt3644730",
  "tmdb_id": "356186",
  "douban_id": null,
  "title": "Heaven on Earth (2015)",
  "genres": [
    "Comedy",
    "Drama",
    "Music",
    "Romance"
  ],
  "country": "Sweden",
  "version": [
    {
      "runtime": "134 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.6,
  "director": [
    {
      "id": "nm0689392",
      "name": "Kay Pollak"
    }
  ],
  "writer": [
    {
      "id": "nm1856981",
      "name": "Carin Pollak",
      "description": null
    },
    {
      "id": "nm0689392",
      "name": "Kay Pollak",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0043466",
      "name": "Axelle Axell",
      "character": "Florence"
    },
    {
      "id": "nm0071078",
      "name": "Björn Bengtsson",
      "character": "Jonas"
    },
    {
      "id": "nm0259144",
      "name": "Eric Ericson",
      "character": "Verner"
    },
    {
      "id": "nm0266182",
      "name": "Niklas Falk",
      "character": "Stig"
    },
    {
      "id": "nm0334689",
      "name": "Björn Granath",
      "character": "Bjelke"
    },
    {
      "id": "nm0356516",
      "name": "Frida Hallgren",
      "character": "Lena"
    },
    {
      "id": "nm0361574",
      "name": "Thomas Hanzon",
      "character": "Bruno"
    },
    {
      "id": "nm0433479",
      "name": "Lennart Jähkel",
      "character": "Arne"
    },
    {
      "id": "nm0530605",
      "name": "Ylva Lööf",
      "character": "Siv"
    },
    {
      "id": "nm1939580",
      "name": "Jakob Oftebro",
      "character": "Axel"
    },
    {
      "id": "nm7605511",
      "name": "Astrid Froede Othelius",
      "character": "Marie"
    },
    {
      "id": "nm0663126",
      "name": "Catherine Parment",
      "character": ""
    },
    {
      "id": "nm0678535",
      "name": "Lasse Pettersson",
      "character": "Erik"
    },
    {
      "id": "nm0706717",
      "name": "Mikael Rahm",
      "character": "Holmfrid"
    },
    {
      "id": "nm1483716",
      "name": "Maria Sid",
      "character": "Helena"
    },
    {
      "id": "nm1727951",
      "name": "André Sjöberg",
      "character": "Tore"
    }
  ],
  "overview": "A life-affirming story about how the power of love, music and dance can change people. This is a standalone sequel to \"As it is in Heaven\" by director Kay Pollak.",
  "storyline": "A group of people live in the small village \"Ljusåker\" in the most northern part of Sweden. When the choir director, world-renowned conductor Daniel Dareus, dies, he leaves his choir and the love of his life behind, the beautiful soprano Lena, who also is expecting their child.",
  "plot": "Vibrant Chand (Preity Zinta) is a young bride leaving her home in Ludhiana, Punjab, India, for Brampton, Ontario, Canada, where her husband Rocky (Vansh Bhardwaj) and his very traditional family await her arrival. Everything is new and unfamiliar to Chand including the quiet and shy Rocky who she meets for the first time at the Arrivals level of Pearson Airport. Chand approaches her new life and land with equanimity and grace, and at times the wide-eyed optimism of hope—her first snowfall is a tiny miracle of beauty, and the roar of Niagara Falls creates the excitement of new beginnings.\n\nBut soon optimism turns to isolation as the family she has inherited struggles beneath the weight of unspoken words, their collective frustration becoming palpable. No one feels the pressure more than Rocky, weighed down by familial obligations. A controlling mother who can’t let him go, a sweet but ineffectual father, and a sister whose two children and unemployed husband are also a burden. All live with Rocky and Chand in a two-bedroom house in the suburbs of Toronto. To make matters worse, Rocky is expected to find the money to bring his extended family to Canada. Unable to express his anger, he finds other ways to release it and it’s Chand who bears the brunt of his repressed rage.\n\nTrapped in a world she cannot comprehend and unable to please her husband, Chand is desperate. Hope comes in the form of Rosa (Yanna McIntosh), a tough and savvy Jamaican woman who works alongside Chand in a factory where immigrant women from all over the world clean and press dirty hotel laundry. Rosa sees past the make-up that covers Chand’s bruised face. Realizing Chand has nowhere to turn, Rosa gives her a magical root advising her “to put it in whatever the bastard drinks.” The root is supposed to seduce the one who takes it, making them fall hopelessly in love with the person who gives it to them. Chand’s attempts with the magic root lead to surreal incidents and her life gradually begins to mirror an Indian fable involving a King Cobra. As the lines between fantasy and reality converge, Chand and Rocky come face to face with each other and themselves. Eventually, Chand comprehends all the surreal episodes in her life and upon separation from her husband decides to go back to India.",
  "synopsis": null
}