{
  "imdb_id": "tt3612936",
  "tmdb_id": "331113",
  "douban_id": null,
  "title": "The Night Watchmen (2015)",
  "genres": [
    "Drama"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm0427136",
      "name": "Pierre Jolivet"
    }
  ],
  "writer": [
    {
      "id": "nm0427136",
      "name": "Pierre Jolivet",
      "description": "screenplay dialogue"
    },
    {
      "id": "nm0584770",
      "name": "Simon Michaël",
      "description": "scenario consultant"
    },
    {
      "id": "nm3709364",
      "name": "Simon Moutairou",
      "description": "scenario consultant"
    }
  ],
  "cast": [
    {
      "id": "nm0332709",
      "name": "Olivier Gourmet",
      "character": "Franck"
    },
    {
      "id": "nm0094993",
      "name": "Valérie Bonneton",
      "character": "Mylène"
    },
    {
      "id": "nm3207271",
      "name": "Marc Zinga",
      "character": "Ketu"
    },
    {
      "id": "nm0359331",
      "name": "Thierry Hancisse",
      "character": "Etienne"
    },
    {
      "id": "nm3259962",
      "name": "Jean-François Cayrey",
      "character": "Antoine"
    },
    {
      "id": "nm1180836",
      "name": "Paco Boublard",
      "character": "Le Bouclé"
    },
    {
      "id": "nm1354491",
      "name": "Nader Boussandel",
      "character": "Ahmed"
    },
    {
      "id": "nm1204852",
      "name": "Vincent Debost",
      "character": "Denis"
    },
    {
      "id": "nm6954654",
      "name": "Yassine Douighi",
      "character": "Chad"
    },
    {
      "id": "nm2968221",
      "name": "Guerassim Dichliev",
      "character": "Algas"
    },
    {
      "id": "nm2245673",
      "name": "Soufiane Guerrab",
      "character": "Ziad"
    },
    {
      "id": "nm1922676",
      "name": "Julie Ferrier",
      "character": "Jeanne"
    },
    {
      "id": "nm1327729",
      "name": "Bénabar",
      "character": "Pedro"
    },
    {
      "id": "nm2309655",
      "name": "Clémence Aubry",
      "character": "Hôtesse restaurant"
    },
    {
      "id": "nm6954655",
      "name": "Adama Bathily",
      "character": "Le copain de Chad"
    },
    {
      "id": "nm4127394",
      "name": "Elia Blanc",
      "character": "Fils du pharmacien"
    },
    {
      "id": "nm6954656",
      "name": "Anaïs Cailleret",
      "character": "Maître d'hôtel restaurant"
    },
    {
      "id": "nm6954657",
      "name": "Aurélien Carrera",
      "character": "Fils Mylène"
    },
    {
      "id": "nm6278478",
      "name": "Judith Chatry",
      "character": "Employée banque"
    },
    {
      "id": "nm5605150",
      "name": "Noémie Chicheportiche",
      "character": "Caissière banque"
    },
    {
      "id": "nm2212438",
      "name": "Amélie Duval",
      "character": "Infirmière"
    },
    {
      "id": "nm1045274",
      "name": "Yves Espargilière",
      "character": "Voisin Ketu"
    },
    {
      "id": "nm5670615",
      "name": "Grégory Gaule",
      "character": "Brancardier"
    },
    {
      "id": "nm1451965",
      "name": "Benjamin Gauthier",
      "character": "Bocquet"
    },
    {
      "id": "nm0346983",
      "name": "Patrice Guillain",
      "character": "Policier parking"
    },
    {
      "id": "nm6954658",
      "name": "Christian Guyonnet",
      "character": "Ambulancier"
    },
    {
      "id": "nm5158004",
      "name": "Adrien Hagège",
      "character": "Assistant dentaire"
    },
    {
      "id": "nm6954659",
      "name": "Jean-Pierre Hallier",
      "character": "Cendeur armurerie"
    },
    {
      "id": "nm3295636",
      "name": "Olivier Jacquet",
      "character": "Patron magasin Phone"
    },
    {
      "id": "nm0427136",
      "name": "Pierre Jolivet",
      "character": "Homme centre social"
    },
    {
      "id": "nm5493356",
      "name": "Stylane Lecaille",
      "character": "Enfant du Bouclé"
    },
    {
      "id": "nm1050161",
      "name": "Thierry Perkins-Lyautey",
      "character": "Médecin hôpital"
    },
    {
      "id": "nm2820813",
      "name": "Jean-Marc Magnoni",
      "character": "Flic parking"
    },
    {
      "id": "nm3193390",
      "name": "Gary Mihaileanu",
      "character": "Jeune rue Paris"
    },
    {
      "id": "nm6406793",
      "name": "Marlene Philibert",
      "character": "Secrétaire médicale"
    },
    {
      "id": "nm1665410",
      "name": "Antoine Régent",
      "character": "Policier centre social"
    },
    {
      "id": "nm2275877",
      "name": "Xavier Rigault",
      "character": "Pharmacien"
    },
    {
      "id": "nm4323561",
      "name": "Sandra Rosinsky",
      "character": "Serveuse restaurant branché"
    },
    {
      "id": "nm1745905",
      "name": "Elodie Roy",
      "character": "Femme du Bouclé"
    },
    {
      "id": "nm4856470",
      "name": "Axelle Simon",
      "character": "Brigitte"
    },
    {
      "id": "nm6954660",
      "name": "Bala Sow",
      "character": "Employé centre social"
    },
    {
      "id": "nm4699791",
      "name": "Stella Trotonda",
      "character": "Fille de Mylène"
    }
  ],
  "overview": "Times have changed a lot for Franck who is a night watchman. About a decade ago he was a specialized worker. Today he feels bored but would jump at any chance to prove his bravery and courage.",
  "storyline": "Times have changed a lot for Franck who is a night watchman.About a decade ago he was a specialized worker. Today he feels bored but would jump at any chance to prove his bravery and courage.",
  "plot": "The \"Minutemen,\" a team of costumed crime fighters, was formed in 1939 in response to a rise in costumed gangs and criminals; the \"Watchmen\" was similarly formed decades later. Their existence has dramatically affected world events: Doctor Manhattan's powers have helped the United States win the Vietnam War, and given the West a strategic advantage over the Soviet Union, which by 1985 threatens to escalate the Cold War into a nuclear war. Growing anti-vigilante sentiment leads to masked crime-fighters being outlawed. While many of the heroes retire, Dr Manhattan and The Comedian operate as government-sanctioned agents, and Rorschach continues to operate outside the law.\n\nWhile investigating the murder of government agent Edward Blake, Rorschach discovers that Blake was the Comedian, and theorizes that someone may be attempting to eliminate former costumed heroes. He warns his retired comrades— Daniel Dreiberg (Nite Owl II), Dr Manhattan, and the latter's lover Laurie Jupiter (Silk Spectre II). Dr Manhattan ignores Rorschach, and Dreiberg is skeptical, but relays this information to vigilante-turned-billionaire Adrian Veidt (Ozymandias), who also dismisses it.\n\nFollowing a backlash, Dr Manhattan exiles himself to Mars, giving the Soviet Union the confidence to invade Afghanistan. Rorschach's theory appears to be justified when Veidt narrowly avoids an assassination attempt, and Rorschach finds himself framed for the murder of a former villain named Moloch. When Rorschach is arrested, his identity is revealed to be Walter Kovacs, and he is sent to jail. Jupiter goes to stay with Dreiberg after breaking up with Manhattan. The two become lovers and decide to come out of retirement. After helping Rorschach break out of prison, Jupiter is confronted by Manhattan, who transports her to Mars. As he probes her memories, he discovers that she is Blake's daughter, and realizes the miracle of her life, created in spite of her parents' turbulent relationship. He then returns to Earth with her.\n\nInvestigating the conspiracy, Rorschach and Dreiberg discover that Veidt is behind everything. Rorschach records his suspicions in his journal, which he drops off at the publication office of the New Frontiersman, a right-wing tabloid. Rorschach and Dreiberg confront Veidt at his Antarctic retreat. Veidt admits to being responsible for Blake's murder, Manhattan's exile, Rorschach's framing, and his own assassination attempt, which he staged to divert suspicion. He explains that his plan is to unify the United States and the Soviet Union by destroying the world's main cities with exploding energy reactors infused with energy from Manhattan. Rorschach and Dreiberg attempt to stop him, but Veidt subdues them both and reveals that his plan has already been set into motion: the reactors have been detonated, and the energy signatures are recognized as Manhattan's.\n\nJupiter and Manhattan arrive in a destroyed New York City and determine that Veidt is responsible. They teleport to his base, causing him to retreat and attempt to kill Manhattan. Unsuccessful, he shows them a televised news report in which Nixon states that the United States and Soviet Union have allied against their new \"common enemy\": Dr Manhattan. Although his allies realize that revealing the truth would only disrupt this new peace, Rorschach refuses to compromise, and attempts to return to America to expose Veidt. Manhattan intervenes, and Rorschach demands that Manhattan kill him to keep him from revealing the truth. Manhattan complies.\n\nManhattan shares a final kiss with Jupiter before departing permanently to another galaxy, while an enraged Dreiberg attacks Veidt, who makes no effort to defend himself. Nevertheless, he defends his actions, claiming that for world peace to be possible, there had to be sacrifice. Dreiberg rejects his logic declaring that Veidt has deformed and mutilated humanity. Dreiberg and Jupiter return to New York with plans to continue fighting crime. Later, an editor of the New Frontiersman tells a young employee that, as the world is at peace, there is nothing to report on. The editor gives the employee permission to print the contents of a collection of crank mailings, among which is Rorschach's journal.",
  "synopsis": null
}