{
  "imdb_id": "tt3603406",
  "tmdb_id": "262229",
  "douban_id": null,
  "title": "Mateo (2014)",
  "genres": [
    "Drama"
  ],
  "country": "Colombia",
  "version": [
    {
      "runtime": "86 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm2810916",
      "name": "Maria Gamboa"
    }
  ],
  "writer": [
    {
      "id": "nm6365524",
      "name": "Adriana Arjona",
      "description": "co-writer"
    },
    {
      "id": "nm6365524",
      "name": "Adriana Arjona",
      "description": null
    },
    {
      "id": "nm2810916",
      "name": "Maria Gamboa",
      "description": "writer"
    },
    {
      "id": "nm2810916",
      "name": "Maria Gamboa",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm5385664",
      "name": "Carlos Hernández",
      "character": "Mateo"
    },
    {
      "id": "nm2367051",
      "name": "Felipe Botero",
      "character": ""
    },
    {
      "id": "nm6365523",
      "name": "Samuel Lazcano",
      "character": ""
    },
    {
      "id": "nm6365522",
      "name": "Miriam Gutiérrez",
      "character": "Made"
    }
  ],
  "overview": "At the impressionable age of 16, young Mateo faces a dilemma about the direction his life will take when his corrupt uncle asks him to infiltrate a local Barrancabermeja theatre group to uncover its members' political activities.",
  "storyline": "The healing power of art weakens violence in Colombia. Mateo, 16, collects extortion money from shopkeepers in Barrancabermeja on behalf of his uncle, a local crime boss. He uses his pay to help out his mother, who accepts the ill-gotten money out of need. To prove his worth, Mateo agrees to infiltrate a local theatre group in order to uncover its members' political activities. As he becomes enthralled with the creative lifestyle of the troupe, his uncle escalates demands on him to produce incriminating information on the actors. Under pressure, Mateo must make difficult choices. Throughout this story composed from real life experiences, Mateo and his mother find their dignity as they face the perils of doubting the established hierarchy of Colombia's armed conflict.",
  "plot": null,
  "synopsis": null
}