{
  "imdb_id": "tt3646322",
  "tmdb_id": "403724",
  "douban_id": null,
  "title": "Angel's Bounty (2015)",
  "genres": [
    "Comedy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.0,
  "director": [
    {
      "id": "nm3277857",
      "name": "Lee Fleming"
    }
  ],
  "writer": [
    {
      "id": "nm3277857",
      "name": "Lee Fleming",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm5493803",
      "name": "Sonia Alexandria",
      "character": "Evelyn"
    },
    {
      "id": "nm6441484",
      "name": "Michael Baszler",
      "character": "Card trick victim"
    },
    {
      "id": "nm3036514",
      "name": "Alastair Bayardo",
      "character": "Ethan"
    },
    {
      "id": "nm6550580",
      "name": "Melissa Briscoe",
      "character": "Diner Waitress"
    },
    {
      "id": "nm7179780",
      "name": "Charles Cha",
      "character": "Solo Domino Player"
    },
    {
      "id": "nm5414373",
      "name": "Nicole Coile",
      "character": "Rusty Trombone Waitress"
    },
    {
      "id": "nm5051646",
      "name": "Erin Cote",
      "character": "Waitress"
    },
    {
      "id": "nm2496092",
      "name": "Timothy Coultas",
      "character": "Jordan"
    },
    {
      "id": "nm5212061",
      "name": "Andrew Dane",
      "character": "News Reporter"
    },
    {
      "id": "nm3981122",
      "name": "Colin Dillon",
      "character": "Mikey"
    },
    {
      "id": "nm6550583",
      "name": "Sarah Elizabeth-Marie",
      "character": "Female Card Trick Victim"
    },
    {
      "id": "nm7170227",
      "name": "Joe Fortin",
      "character": "Henchman #1"
    },
    {
      "id": "nm7236411",
      "name": "M.E. Foster",
      "character": "Barry"
    },
    {
      "id": "nm3125951",
      "name": "J.P. Giuliotti",
      "character": "Tommy Briggs"
    },
    {
      "id": "nm6550576",
      "name": "Travis Gray",
      "character": "Nigel"
    },
    {
      "id": "nm5242255",
      "name": "Justin Hayes",
      "character": "Justin"
    },
    {
      "id": "nm2435303",
      "name": "Mackenzie Horras",
      "character": "Leasing Agent"
    },
    {
      "id": "nm7170226",
      "name": "Quincy Kuykendall",
      "character": "Joey"
    },
    {
      "id": "nm4444742",
      "name": "Shawn Lawrence",
      "character": "Frankie Ward"
    },
    {
      "id": "nm5211684",
      "name": "Bryan Mathews",
      "character": "Wannabe Comic"
    },
    {
      "id": "nm3364718",
      "name": "Lorraine Montez",
      "character": "Ruth"
    },
    {
      "id": "nm6586557",
      "name": "Shelby Poe",
      "character": "Young Angel"
    },
    {
      "id": "nm3070804",
      "name": "Matthew Ralston",
      "character": "Mr. Hampton"
    },
    {
      "id": "nm3417217",
      "name": "Ben Reynolds",
      "character": "Hillbilly #2"
    },
    {
      "id": "nm6550577",
      "name": "Ashley Salazar",
      "character": "LA Waitress"
    },
    {
      "id": "nm7236410",
      "name": "Nick Semensky",
      "character": "Henchman #2"
    },
    {
      "id": "nm6550578",
      "name": "Beth Semingson",
      "character": "Barista"
    },
    {
      "id": "nm6550579",
      "name": "Jon Semingson",
      "character": "Truck Driver"
    },
    {
      "id": "nm3427498",
      "name": "Mitch Shelman",
      "character": "Hillbilly #1"
    },
    {
      "id": "nm3525714",
      "name": "Kristen Springer",
      "character": "Angel sommers"
    },
    {
      "id": "nm6550581",
      "name": "Chris Stordahl",
      "character": "Isabelle"
    },
    {
      "id": "nm3726078",
      "name": "Gene Thorkildsen",
      "character": "Charlie Sommers"
    },
    {
      "id": "nm3744795",
      "name": "Andrew Tribolini",
      "character": "Carl"
    }
  ],
  "overview": "A cynical and burnt-out Los Angeles bounty hunter (Angel Sommers) spends her days surrounded by liars, gamblers, misogynists and other social deviants. And those are just her co-workers. When a contract comes in that's big enough to fund her dreams of leaving the bounty hunting game and opening her own business, she jumps at the opportunity. The only problem is, the contract is for Tommy Briggs...the man responsible for her father's murder over a decade ago.",
  "storyline": "Angel's Bounty is a dark, comedic tale that follows cynical and burnt-out Los Angeles bounty hunter, Angel Sommers. Angel spends her days surrounded by liars, gamblers, misogynists and other social deviants. And those are just her co-workers. When a contract comes in that's big enough to fund her dreams of leaving the bounty hunting game and opening her own business, she jumps at the opportunity. The only problem is, the contract is for Tommy Briggs...the man responsible for her father's murder over a decade ago.",
  "plot": "During the American Civil War, mercenary Angel Eyes interrogates former Confederate soldier Stevens, whom Angel Eyes is contracted to kill, about Bill Carson, a fugitive who stole a cache of Confederate gold. Stevens offers Angel Eyes $1,000 to kill Baker, Angel Eyes's employer. Angel Eyes accepts the contract, and kills Stevens as he leaves. Angel Eyes returns to Baker for his fee, then shoots Baker, fulfilling his contract with Stevens. Meanwhile, Mexican bandit Tuco Ramírez is rescued from three bounty hunters by \"Blondie\", who delivers him to the local sheriff to collect his $2,000 bounty. As Tuco is about to be hanged, Blondie severs Tuco's noose by shooting it, and sets him free. The two escape on horseback and split the bounty in a lucrative money-making scheme. They repeat the process in another town for more reward money. Blondie grows weary of Tuco's complaints, and abandons him penniless in the desert. A vengeful Tuco tracks Blondie to a town being abandoned by Confederate troops. As he prepares to have Blondie hang himself, Union forces shell the town, allowing Blondie to escape. Following an arduous search, Tuco recaptures Blondie and force-marches him across a desert until Blondie collapses from dehydration. As Tuco prepares to shoot him, he sees a runaway carriage. Inside is a delirious Bill Carson, who promises Tuco $200,000 in Confederate gold, buried in a grave in Sad Hill Cemetery. Tuco demands to know the name on the grave, but Carson collapses from thirst before answering. When Tuco returns with water, Carson has died and Blondie, slumped next to him, reveals that Carson recovered and told him the name on the grave before dying. Tuco, who now has strong motivation to keep Blondie alive, gives him water and takes him to a nearby frontier mission to recover.\n\nAfter Blondie's recovery, the two leave in their Confederate uniforms, only to be captured by Union soldiers and remanded to the POW camp of Batterville. At roll call, Tuco answers for \"Bill Carson,\" getting the attention of Angel Eyes, now a disguised Union sergeant at the camp. Angel Eyes tortures Tuco, who reveals the name of the cemetery, but confesses that only Blondie knows the name on the grave. Realizing that Blondie will not yield to torture, Angel Eyes offers him an equal share of the gold and a partnership. Blondie agrees and rides out with Angel Eyes and his gang. Tuco is packed on a train to be executed, but escapes.\nThe iconic Mexican standoff, with Tuco seen on the left, Angel Eyes in the middle, and Blondie on the right. The scene is accompanied by Ennio Morricone's \"The Trio\".\nBlondie, Angel Eyes, and his henchmen arrive in an evacuated town. Tuco, having fled to the same town, takes a bath in a ramshackle hotel and is surprised by Elam, a bounty hunter searching for him. Tuco shoots Elam, causing Blondie to investigate the gunshots. He finds Tuco, and they agree to resume their old partnership. The pair kill Angel Eyes's men, but discover that Angel Eyes himself has escaped.\n\nTuco and Blondie travel to Sad Hill, now held by Union troops on one side of a strategic bridge against the advancing Confederate troops. Blondie decides to destroy the bridge to disperse the two armies to allow access to the cemetery. As they wire the bridge with explosives, Tuco suggests they share information, in case one person dies before he can help the other. Tuco reveals the name of the cemetery, while Blondie says \"Arch Stanton\" as the name of the grave. After the bridge explodes, the armies disperse, and Tuco steals a horse and rides to Sad Hill to claim the gold for himself. He finds Arch Stanton's grave and begins digging. Blondie arrives and encourages him at gunpoint to continue. A moment later, Angel Eyes surprises them both. Blondie opens Stanton's grave, revealing just a skeleton. Blondie states that he lied about the name on the grave, and offers to write the real name of the grave on a rock. Placing it face-down in the courtyard of the cemetery, he challenges Tuco and Angel Eyes to a three-way duel.\n\nThe trio stare each other down. Everyone draws, and Blondie shoots and kills Angel Eyes, while Tuco discovers that his own gun was unloaded by Blondie the night before. Blondie reveals that the gold is actually in the grave beside Arch Stanton's, marked \"Unknown.\" Tuco is initially elated to find bags of gold, but Blondie holds him at gunpoint and orders him into a hangman's noose beneath a tree. Blondie binds Tuco's hands and forces him to stand balanced precariously atop an unsteady grave marker while he takes half the gold and rides away. As Tuco screams for mercy, Blondie returns into sight. Blondie severs the rope with a rifle shot, dropping Tuco, alive but tied up, onto his share of the gold. Tuco curses loudly while Blondie rides off into the horizon.",
  "synopsis": null
}