{
  "imdb_id": "tt3626076",
  "tmdb_id": "363846",
  "douban_id": null,
  "title": "Rodina (2015)",
  "genres": [
    "Drama"
  ],
  "country": "Russia",
  "version": [
    {
      "runtime": "110 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm1458108",
      "name": "Pyotr Buslov"
    }
  ],
  "writer": [
    {
      "id": "nm2421809",
      "name": "Andrey Migachev",
      "description": null
    },
    {
      "id": "nm2588793",
      "name": "Aleksey Shipenko",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4705505",
      "name": "Lyubov Aksyonova",
      "character": "Eva"
    },
    {
      "id": "nm4968198",
      "name": "Sergey Badyuk",
      "character": "Timur"
    },
    {
      "id": "nm1428293",
      "name": "Pawan Chopra",
      "character": "Svyashchennik"
    },
    {
      "id": "nm1215228",
      "name": "Pyotr Fyodorov",
      "character": "Makar"
    },
    {
      "id": "nm3351128",
      "name": "Yevgeniy Kartashov",
      "character": "Pavel, starshiy leytenant"
    },
    {
      "id": "nm1874211",
      "name": "Kirill Käro",
      "character": ""
    },
    {
      "id": "nm1450429",
      "name": "Maksim Lagashkin",
      "character": ""
    },
    {
      "id": "nm0527945",
      "name": "Pasha D. Lychnikoff",
      "character": "Kosmos"
    },
    {
      "id": "nm1459463",
      "name": "Andrey Merzlikin",
      "character": "Mitya"
    },
    {
      "id": "nm0596461",
      "name": "Seydulla Moldakhanov",
      "character": "Miyamoto"
    },
    {
      "id": "nm7274000",
      "name": "Valentina Pugachyova",
      "character": ""
    },
    {
      "id": "nm1468457",
      "name": "Aleksandr Robak",
      "character": ""
    },
    {
      "id": "nm0810632",
      "name": "Andrey Smolyakov",
      "character": "Garri"
    },
    {
      "id": "nm5453953",
      "name": "Anastasiya Stezhko",
      "character": "Lena"
    },
    {
      "id": "nm0842962",
      "name": "Vladimir Sychyov",
      "character": ""
    },
    {
      "id": "nm4778066",
      "name": "Jay Thakkar",
      "character": "Raamish"
    },
    {
      "id": "nm0901552",
      "name": "Ekaterina Volkova",
      "character": ""
    }
  ],
  "overview": "Igor, a Russian oligarch gets into a heated argument with Eva, his estranged daughter whilst traveling on his private jet. Igor orders the plane to land. As the plane touches down Eva disappears into the Goan jungle. Thus begins Igor's desperate search for his only daughter. A search that will bring him and Eva into contact with various characters who in turn are trying to find their own paths through life. Makar, a guy from Novosibirsk, who is desperately searching for enlightenment. Alexey and Kristina are ending their marriage here, while Dimon and Lenya are raising hell and pushing Goa to its partying limits. Kosmos the Guru (\"just don't call him that\") dispenses the chemicals that in a bat of an eyelid will take you to an alternate reality. There are different destinies here. There are a myriad of people. But all of them have one Motherland, which is easy not to love as long it is close to you",
  "storyline": "Igor, a Russian oligarch gets into a heated argument with Eva, his estranged daughter whilst traveling on his private jet. Igor orders the plane to land. As the plane touches down Eva disappears into the Goan jungle. Thus begins Igor's desperate search for his only daughter. A search that will bring him and Eva into contact with various characters who in turn are trying to find their own paths through life. Makar, a guy from Novosibirsk, who is desperately searching for enlightenment. Alexey and Kristina are ending their marriage here, while Dimon and Lenya are raising hell and pushing Goa to its partying limits. Kosmos the Guru (\"just don't call him that\") dispenses the chemicals that in a bat of an eyelid will take you to an alternate reality. There are different destinies here. There are a myriad of people. But all of them have one Motherland, which is easy not to love as long it is close to you.",
  "plot": "Season 1\n\n1993. Anna Zimina is a FSB officer recently recalled from Beirut after angering the Lebanese government. Anna is liked and trusted by her mentor Mikhail Volskiy and tolerated by her boss Bagmet. During her assignment in Lebanon, she hearing a rumor from one of her contacts in Beirut that a Russian military officer has been \"turned.\"\n\nIn 1999, Anna learns that a Russian Army Alpha Force team in Chechnya has found Russian Marine Corps major Alexey Bragin, who had been believed killed in 1993. While the rest of the FSB and the political establishment believe Bragin to be a war hero, Anna is worried that he has been recruited and brainwashed by Chechen chief Bin Jalid to act as a sleeper agent. She begins an illegal audio and video surveillance of Bragin's home hoping to catch him at something to prove her suspicions correct.\n\nThe surveillance reveals the difficulties Bragin has upon his return home. Believing him dead, his wife Yelena had developed a relationship with Bragin's younger brother Dmitry that beyond the affair, was moving towards Dmitry moving in with the family. Bragin must now adjust to life at home with his wife and two children, 12-year-old Vanya and the troubled and self-destructive 16-year-old Katya. His readjustment is complicated by his erratic behavior and his difficulty being physically intimate with his wife. Unbeknownst to his family or Anna, Bragin converted to Islam during his captivity, and prays daily in his storage in private. Flashbacks also show that he has not been entirely truthful about his captivity. However, the surveillance by Anna uncovers no incriminating evidence and is eventually shut down.\n\nFrustrated, Anna decides to continue the surveillance all by herself. Anna and Alexey meets at pub and get drunk. They meet again when one of Bragin's former jailers is captured and Bragin is brought in to observe the interrogation. Bragin convinces Bagmet to allow him to have a moment to confront his former jailer, but the meeting ends violently. Later, the prisoner is found to have committed suicide. Anna believes Bragin killed him. She arranges for polygraphs for all those who had access to the prisoner. Bragin passes, but Anna suspects he is lying when he is able to deny that he has been unfaithful to his wife.\n\nMeanwhile, an asset of Anna's who works as a courtesan for a Qatari prince contacts Anna with photo of Bin Jalid meeting with the prince. Shortly afterwards, she is murdered and an expensive necklace given to her by the prince is stolen. Suspecting that the necklace is being used to fund a terrorist operation, the FSB tracks the funds to a local couple, who have purchased a home near the Kremlin. After being tipped off by an anonymous contact, they are go on the run where the husband is killed and the wife tries to escape to Estonia where she is captured by Mikhail.\n\nBragin, having discovered that his wife was having an affair with his brother, meets Anna and they go to her family's lakefront cabin. They have sex, but Bragin becomes suspicious after Anna inadvertently says the brand name of the tea he usually drinks. Bragin finds a loaded gun in the house and confronts Anna, who admits her suspicions. Bragin admits to having been converted to Islam by Bin Jalid, whom he met while being held captive. He explains that Jalid was kind to him and that he came to \"love\" the terrorist leader, but denies working for Chechen terrorists. Anna receives a call from Mikhail, indicating that a woman has identified the terrorist as Yuri Khamzin, Bragin's Scout Sniper partner, who even Bragin had believed to be dead. Anna profusely apologizes to Bragin, claiming that she has real feelings for him, but he angrily returns to his family.\n\nAs the FSB begins tracking Yuri Khamzin, Bragin has a surprise meeting with the State Duma member, Oleg Basov, who recruits Bragin to join his Party. Bragin then makes contact with Bin Jalid, revealing that he really is, in fact, a terrorist and spy for the Chechen. Flashbacks show that Bragin had been taken out of captivity by Jalid in order to teach his son, Mussa, to speak Russian. Bragin came to love the boy and when he was killed in a Russian military attack, Bragin vowed revenge on his own country. Bragin meets with a local tailor who gives him a suicide vest. All seems to be going according to plan, but his odd behavior begins to worry his daughter.\n\nBragin is asked to attend an event where Oleg Basov will announce his intention to run for the presidency. At the event (taking part in the Red Square), Yuri Khamzin assassinates one of Basov's aides, forcing all the dignitaries, including Bragin, to flee into Lenin's Mausoleum. Realizing that Bragin is likely working with Khamzin, Anna attempts to contact the FSB. Bragin tries to detonate his suicide vest but it malfunctions. He repairs it and is about to try again when he receives a phone call from his daughter Katya, who begs him to come home. He is unable to go through with his mission. Meanwhile, a special force finds Yuri Khamzin and shoots him to death. Later, Bragin meets with Anna, who apologizes for suspecting him of terrorism, he warns her to stay away from him and his family from now on.\n\nAfterwards, Mikhail talks to doctor near the hospital room to prepare Anna for electroconvulsive therapy (ECT). The doctors begin the ECT, which induces a seizure in Anna.",
  "synopsis": null
}