{
  "imdb_id": "tt3647434",
  "tmdb_id": "390608",
  "douban_id": null,
  "title": "The Abolitionists (2016)",
  "genres": [
    "Documentary",
    "Crime",
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.7,
  "director": [
    {
      "id": "nm0281983",
      "name": "Darrin Fletcher"
    },
    {
      "id": "nm0858624",
      "name": "Chet Thomas"
    }
  ],
  "writer": [
    {
      "id": "nm0858624",
      "name": "Chet Thomas",
      "description": null
    },
    {
      "id": "nm1178323",
      "name": "Mike Chenoweth",
      "description": null
    },
    {
      "id": "nm0281983",
      "name": "Darrin Fletcher",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm8171798",
      "name": "Dutch Turley",
      "character": "Himself"
    },
    {
      "id": "nm8171799",
      "name": "Jaron Tree",
      "character": "Himself"
    },
    {
      "id": "nm8171803",
      "name": "Andrew Tashjian",
      "character": "Himself"
    },
    {
      "id": "nm4587882",
      "name": "Tim Ballard",
      "character": "Himself"
    },
    {
      "id": "nm0390229",
      "name": "Laurie Holden",
      "character": "Herself"
    },
    {
      "id": "nm5860930",
      "name": "Mark Mabry",
      "character": "Himself"
    },
    {
      "id": "nm6851827",
      "name": "Krista Rykert",
      "character": "Herself"
    }
  ],
  "overview": "Former Special Agent Tim Ballard has spent over a decade rescuing children from child sex tourism both domestically and overseas before he leaves, founds his own organization and begins saving the large majority of children that fell out of the purview of the US. This is the story about the lost children and the attempt to investigate and liberate them from around the world.",
  "storyline": "On December 10th, 2013 Special Agent Tim Ballard turned in his Homeland Security badge and resigned from his employment with the United States government. He had spent over a decade rescuing children from child sex tourism both domestically and overseas. Though his job was difficult, he was proud that his country was one of very few in the world who was actually doing anything about this problem. However, mired in red tape and bureaucracy, Tim left to begin saving the children that he saw falling out of the purview of the US government. These children constitute over 90% of the children lost to child sex slavery and he could do nothing to help them while in the employment of the US government. This is a story about the lost children and the OURrescue.com jump team's exploits as they investigate and liberate enslaved children from around the world.",
  "plot": null,
  "synopsis": null
}