{
  "imdb_id": "tt3696192",
  "tmdb_id": "283827",
  "douban_id": null,
  "title": "Singh Is Bliing (2015)",
  "genres": [
    "Action",
    "Comedy"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "141 min",
      "description": ""
    },
    {
      "runtime": "113 min",
      "description": "Television Cut\n            Zee.One\n            PAL"
    }
  ],
  "imdb_rating": 5.4,
  "director": [
    {
      "id": "nm0222150",
      "name": "Prabhudheva"
    }
  ],
  "writer": [
    {
      "id": "nm3870757",
      "name": "Chintan Gandhi",
      "description": "dialogue"
    },
    {
      "id": "nm8527461",
      "name": "Sahar Quaze",
      "description": "dialogue"
    }
  ],
  "cast": [
    {
      "id": "nm0474774",
      "name": "Akshay Kumar",
      "character": "Raftaar Singh"
    },
    {
      "id": "nm3367112",
      "name": "Amy Jackson",
      "character": "Sara Rana"
    },
    {
      "id": "nm1069034",
      "name": "Lara Dutta",
      "character": "Emily"
    },
    {
      "id": "nm1946407",
      "name": "Kay Kay Menon",
      "character": "Mark"
    },
    {
      "id": "nm0013159",
      "name": "Rati Agnihotri",
      "character": "Raftaar's mother"
    },
    {
      "id": "nm1127958",
      "name": "Yograj Singh",
      "character": "Raftaar's father"
    },
    {
      "id": "nm1004887",
      "name": "Pradeep Singh Rawat",
      "character": "Kirpal Singh"
    },
    {
      "id": "nm4376717",
      "name": "Anil Charanjeett",
      "character": "Pompy       (as Anil Mange)"
    },
    {
      "id": "nm3193983",
      "name": "Arfi Lamba",
      "character": "Pappi"
    },
    {
      "id": "nm0004431",
      "name": "Kunal Kapoor",
      "character": "Mr. Rana- Sara's Father"
    },
    {
      "id": "nm1302330",
      "name": "Murli Sharma",
      "character": "Boxer"
    },
    {
      "id": "nm7150470",
      "name": "Boiangiu Alma",
      "character": "Singer"
    },
    {
      "id": "nm7058295",
      "name": "George Burcea",
      "character": "Right Hand"
    },
    {
      "id": "nm5906575",
      "name": "Ahran Chaudhary",
      "character": "Boxer       (as Aaran Chaudhary)"
    },
    {
      "id": "nm4151794",
      "name": "Durgesh Raje",
      "character": "Journalist at Mayor's office"
    },
    {
      "id": "nm1568052",
      "name": "Kuldeep Sharma",
      "character": "Chacha of Akshay Kumar"
    },
    {
      "id": "nm2167838",
      "name": "Mahru Sheikh",
      "character": "Sara's Mother"
    },
    {
      "id": "nm1905056",
      "name": "Yuri Suri",
      "character": "Mark's Father"
    }
  ],
  "overview": "Singh Is Bling is an upcoming Bollywood action comedy film directed by Prabhu Deva and produced by MetroNet Multimedia (P) Ltd., under Grazing Goat Pictures.The film stars Akshay Kumar and Kriti Sanon in lead roles.  It also marks the return of Akshay Kumar in a Punjabi Sardar character, after the 2008 comedy film Singh is Kinng. Expected to release on 31st July 2015, Singh is Bling is the second actor-director collaboration between Kumar and director Prabhu Deva after their successful 2012 film Rowdy Rathore.",
  "storyline": "Raftaar Singh (Akshay) spends his days whiling his time away dancing and jumping through fire hula-hoops at fairs in Bassi Pathana in Punjab. While his father (Yograj Singh) is tired of his ways, his mother (Rati Agnihotri) caters to his appetite with home-cooked jalebis, before the former asks Raftaar to choose a path for himself. Either get married to a certain Sweety, or move to Goa and work under his father's friend. Considering the first option unimaginable, Raftaar chooses the second.",
  "plot": "Raftaar Singh (played by Akshay Kumar) is a nice and fun-loving man but he is uneducated. His mischievous character even kept his parents worried about him. Raftaar eventually gets thrown out of his home by his father who also gives him an ultimatum; if he wants to come back, either he must get into business with his (father's) friend in Goa or get married to Navjot's daughter, Sweety. Raftaar chooses the former option as he doesn't like her since she was fat. The film goes on to show the story of Sara who lives in a different part of the world, in Romania. Sara Rana has lost her mother but hopes that she is still alive. Her father, Mr. Rana, did not make the right choices in life and is known to be in the mafia. Mark, a mafia leader wants to marry Sara but gets rejected by her as well as his own father. An angry Mark kills his father and goes on a hunt for Sara but she manages to escape to Goa.\n\nRaftaar meets his boss Kirpal Singh (his father's friend) and he successfully gets a job to take care of Sara for the time she is in India but the problem is that he doesn't speak or understand English and Sara does not understand Hindi. Raftaar lies that he knows English in the fear that he could get fired. Raftaar and his friends meet Sara at the airport. Raftaar then hires a translator, Emily. Sara meets Raftaar's boss and feels safe but presumes Raftaar to be a bad guy. Sara soon finds out that Raftaar is in fact a good guy, when she sees him helping a woman who was being bothered by a bunch of bad guys. These angry goons were in search of Raftaar but end up getting beaten by Sara.\n\nEmily is shocked to see that Sara can fight. Sara warns Emily not to tell about the incident to Raftaar. Raftaar's friends and Sara get kidnapped soon by the same goons. Raftaar in an effort to save them fights a few goons but unfortunately gets badly beaten, Sara later helps them and fights all the goons away. Seeing Raftaar's good side, she begins to fall for him. Raftaar's boss feels happy with his job and soon becomes a successful businessman with his help. When Mark learns that Sara is in Goa he sends his men to bring her back. His men reach and try to catch her but she manages to escape with Raftaar in a car; but unfortunately the car gets hit. Raftaar gets beaten up, but later fights them all except a lady who is later beaten up by Sara. Raftaar then decides to take Sara to his own home as per his boss' advice.\n\nSara goes to Punjab with Raftaar and meets his parents. She reminisces her childhood by seeing Raftaar and her mother together. Sara feels really happy after staying with Raftaar in Punjab for a few days. Raftaar's father speaks to her about Raftaar's goodness and asks Sara what is the relatiosnhip between her and Raftaar. She finally reveals that she is in love with Raftaar. Emily also had earlier handed responsibility to Raftaar to find Sara's lost mother. She tells Raftaar the final location and Raftaar returns to Goa with Sara. Sara goes to an old house where she used to live and has a flashback of her childhood, but later feels heartbroken as she thinks that she won't find her mother anymore. Sara then decides to go back to Romania and says that she would never return. Raftaar feels heartbroken seeing her leave after failing to tell Sara his feelings.\n\nSara returns to Romania, she receives news that her father was shot when he refused his daughter's hand in marriage with Mark. She meets his father who is alive but admitted in a hospital. Raftaar successfully finds Sara's mother and brings her to Romania, who is reunited with her husband and her daughter Sara. Sara finally confesses her love to Raftaar. Raftaar is happy and decides to marry Sara. Raftaar informs his mother and purchases cake, a bouquet of flowers and new clothes and goes to church but is angered when he finds that Sara is about to marry Mark. Sara refuses to marry Mark when she sees Raftaar there. Mark challenges Raftaar for a fight, Raftaar accepts and fights him and his men, Raftaar manages to beat Mark and his men but unfortunately gets shot without realizing it. Sara here gets worried that Raftaar will die but he soon wakes up after remembering the lessons taught by his father and resumes the fighting with Mark. Raftaar is able to beat the mafia and Mark, who dies after saying \"You're too good, Sardaar (Chieftain)\" but leaves Raftaar hanging by the side of a bridge. Sara and Raftaar confess their love to each other. Raftaar is saved and returns to Punjab and celebrates his happiness with his friends, family and Sara. The film ends with the song \"Singh and Kaur\" in which Raftaar and Sara Rana perform together.",
  "synopsis": null
}