{
  "imdb_id": "tt3613416",
  "tmdb_id": "259173",
  "douban_id": null,
  "title": "Show! (2013)",
  "genres": [
    "Documentary"
  ],
  "country": "Czech Republic",
  "version": [
    {
      "runtime": "69 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm3245483",
      "name": "Bohdan Bláhovec"
    }
  ],
  "writer": [
    {
      "id": "nm3245483",
      "name": "Bohdan Bláhovec",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm6458071",
      "name": "Michal Mertl",
      "character": "Himself"
    },
    {
      "id": "nm1184272",
      "name": "Monika Absolonová",
      "character": "Herself"
    },
    {
      "id": "nm1289594",
      "name": "Michal David",
      "character": "Himself"
    },
    {
      "id": "nm0331872",
      "name": "Karel Gott",
      "character": "Himself"
    },
    {
      "id": "nm1768280",
      "name": "Lou Fanánek Hagen",
      "character": "Himself"
    },
    {
      "id": "nm3296523",
      "name": "Ondrej Havel",
      "character": "Himself"
    },
    {
      "id": "nm3334770",
      "name": "Bohous Josef",
      "character": "Himself"
    },
    {
      "id": "nm0719298",
      "name": "Filip Renc",
      "character": "Himself"
    },
    {
      "id": "nm0738261",
      "name": "Dara Rolins",
      "character": "Herself"
    }
  ],
  "overview": "A surprisingly intimate portrait of how the dream of running one’s own business can take on monstrous contours. Managed by the father of one of the singers, over the course of five years the girl band 5Angels had reached the gates of pop fame. But it is a path paved not only with the songs of Michal David, but also with the dogged determination of a man who loses any notion of where his role as manager ends and his role as parent begins. An emotionally moved Karel Gott, five angelic girls, and one overly involved father, thanks to whom the behind-the-scenes pre-Christmas atmosphere melts away just as rapidly as the fat should disappear from the belly. “A singer can’t be a lard bucket!”",
  "storyline": "A surprisingly intimate portrait of how the dream of running one's own business can take on monstrous contours. Managed by the father of one of the singers, over the course of five years the girl band 5Angels had reached the gates of pop fame. But it is a path paved not only with the songs of Michal David, but also with the dogged determination of a man who loses any notion of where his role as manager ends and his role as parent begins.",
  "plot": null,
  "synopsis": null
}