{
  "imdb_id": "tt3692652",
  "tmdb_id": "331392",
  "douban_id": null,
  "title": "Eloise (2016)",
  "genres": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "89 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm0499215",
      "name": "Robert Legato"
    }
  ],
  "writer": [
    {
      "id": "nm0096319",
      "name": "Christopher Borrelli",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2003700",
      "name": "Chace Crawford",
      "character": "Jacob Martin"
    },
    {
      "id": "nm0244630",
      "name": "Eliza Dushku",
      "character": "Pia Carter"
    },
    {
      "id": "nm1040365",
      "name": "Brandon T. Jackson",
      "character": "Dell Richards"
    },
    {
      "id": "nm0126260",
      "name": "P.J. Byrne",
      "character": "Scott Carter"
    },
    {
      "id": "nm0001598",
      "name": "Robert Patrick",
      "character": "Dr. H.H. Greiss"
    },
    {
      "id": "nm0286171",
      "name": "Nicole Forester",
      "character": "Genevieve Martin"
    },
    {
      "id": "nm8880694",
      "name": "Camille Bresie Cooke",
      "character": "Nurse Carter"
    },
    {
      "id": "nm8880695",
      "name": "Art Beer",
      "character": "Arlen Davies"
    },
    {
      "id": "nm2052217",
      "name": "Ricky Wayne",
      "character": "Detective Frazier"
    },
    {
      "id": "nm0457723",
      "name": "Annie Kitral",
      "character": "Administrator"
    },
    {
      "id": "nm1773272",
      "name": "Milica Govich",
      "character": "Nurse Fletcher"
    },
    {
      "id": "nm1195301",
      "name": "Dan Lemieux",
      "character": "Orderly 1"
    },
    {
      "id": "nm3897496",
      "name": "Matt Philliben",
      "character": "Orderly 2"
    },
    {
      "id": "nm3535606",
      "name": "Big Ron Lyons",
      "character": "Orderly 3"
    },
    {
      "id": "nm0503234",
      "name": "John Lepard",
      "character": "Doctor"
    },
    {
      "id": "nm3672326",
      "name": "Anthony Bowden",
      "character": "Urban Explorer 1"
    },
    {
      "id": "nm8880696",
      "name": "Schuyler Whitesell",
      "character": "Urban Explorer 2"
    },
    {
      "id": "nm8880697",
      "name": "Josh Aspiranti",
      "character": "Familiar Orderly"
    },
    {
      "id": "nm4238316",
      "name": "Andrew Huff",
      "character": "Ragged Man"
    },
    {
      "id": "nm4161356",
      "name": "Anton Bassey",
      "character": "Fire Marshall"
    },
    {
      "id": "nm4432494",
      "name": "Mark Rademacher",
      "character": "Garage Owner"
    },
    {
      "id": "nm3561899",
      "name": "Jordan Trovillion",
      "character": "Garage Girl"
    },
    {
      "id": "nm3020898",
      "name": "Tim Holmes",
      "character": "Huge Orderly"
    },
    {
      "id": "nm2949309",
      "name": "Paul W. Smith",
      "character": "Interviewer"
    },
    {
      "id": "nm8880698",
      "name": "Alan Cohen",
      "character": "Security Officer"
    },
    {
      "id": "nm1045106",
      "name": "Mary Jo Cuppone",
      "character": "Staff Doctor       (as Marijo Cuppone)"
    },
    {
      "id": "nm4169783",
      "name": "Lawanda Starr Nance",
      "character": "Nurse       (as Lawanda Nance)"
    },
    {
      "id": "nm1632166",
      "name": "Jim Porterfield",
      "character": "Past Security Officer"
    },
    {
      "id": "nm1677751",
      "name": "Dan John Miller",
      "character": "The Patient"
    },
    {
      "id": "nm5322492",
      "name": "Alastar Dimitrie",
      "character": "Student 1"
    },
    {
      "id": "nm2795743",
      "name": "Tiren Jhames",
      "character": "Isaan Martin"
    },
    {
      "id": "nm6557824",
      "name": "Sofia Tepper",
      "character": "Young Pia       (as Sophia Tepper)"
    },
    {
      "id": "nm8880699",
      "name": "Jeremy Pastoria",
      "character": "Young Scott"
    },
    {
      "id": "nm2314252",
      "name": "Jessica Ashley",
      "character": "Candy Striper"
    },
    {
      "id": "nm5313857",
      "name": "Sandro Rodriguez",
      "character": "Orderly 4"
    },
    {
      "id": "nm5220590",
      "name": "John Dickerson",
      "character": "Old Patient"
    },
    {
      "id": "nm3255742",
      "name": "Steven Hauptman",
      "character": "Fireman"
    },
    {
      "id": "nm5784446",
      "name": "Zack Lessner",
      "character": "Firefighter lessner"
    }
  ],
  "overview": "Four friends break into an abandoned insane asylum in search of a death certificate which will grant one of them a large inheritance. However, finding it soon becomes the least of their worries in a place haunted by dark memories.",
  "storyline": "Set in a defunct insane asylum known as 'Eloise,' four friends break into the abandoned institution in hopes of finding a death certificate, which will grant one of them the rights to a sizable inheritance. While inside the asylum, the group not only finds that Eloise houses a horrifying history but also the truth about their own tragic pasts.",
  "plot": null,
  "synopsis": "We open with pictures and audio about the real Eloise asylum and the fire that destroyed the building in 1982. The first scene shows a woman named Pia in an asylum being questioned by a detective. The detective shows Pia some pictures and tells her that they found her brother and friend's deceased bodies, but don't know where her friend Jacob is. Jacob is working on a car and is contacted by an attorney to let him know his father has passed away. After meeting with the attorney, Jacob is told he is going to to get 1.2 million dollars, but he has to prove that an unknown aunt has passed away also. Jacob finds out that even though his dad had cancer, the cancer didn't kill him he decided to take his own life. Jacob goes to his father's house and retrieves a weird box containing various items and a drawing of an old Chevy. While looking through the contents, an unknown person has broken into the house. Jacob goes into his father's room where he committed suicide and is startled by his friend Dell. Dell steals a pocket watch, and then they go to a bar to hang out. Pia is the bartender and makes Jacob buy a round for the whole bar because it's his birthday. Dell tells Jacob that he needs 20 grand, and Jacob agrees to help him if Dell agrees to help Jacob get his aunt's records. When Jacob goes to the asylum to pick up the records, he noticed it's been sent to the annex building. He would need a court order to get the rest of the records which could take six to seven months. After bribing the clerk he leaves, she types up an admission to the asylum for Jacob. Jacob accidentally backs up into a shopping cart filled with trash bags. He apologizes to the homeless man, but the guy doesn't say a word. Jacob and Dell decide to break into the annex building, but they don't know exactly where the room is located. They look up a guy named Scott who has blueprints to the buildings. They meet up at Scott's house, who is obsessed with the building. When they are talking about to breaking into the building Pia walks in revealing she is actually Scott's sister.\nAfter breaking in, they hear a bang from a police officer. He walks in and shines his flashlight around and then leaves after not finding anything. They find the annex room, and it's loaded with hundreds of filing cabinets. They don't know where to start in this huge room, and while walking around Scott disappears. Dell drops the pocket watch he stole earlier, and it shows a flashback of orderlies punching patients. Pia walks past the maternity ward, and after a flashback of nurses holding babies it cuts back to Pia seeing a child holding a box. Scott uses his infrared camera and sees human figures. While looking through patient files, we see flashbacks of the patients being forced to face their fears and shock therapy. Scott sees pictures of himself on the wall, and then orderlies forcing him onto a bed. This causes him to fall over crashing through the floor onto a gurney waiting below with orderlies pushing it. Jacob find his aunt's records, and Dell sees the pocket watch behind a locked door. He knocks out the glass to unlock the door, making him cut his hand. After stealing a bunch of medication, he accidentally pours LSD onto his hand instead of peroxide. This causes him to hallucinate, and after seeing visions he pulls out a gun. Scott is then shown being forced onto a bed by doctors and nurses from the past and then the doctor proceeds to hammer a sharp tool into his eye. Dell shoots at hallucinations and then finds himself in a locked room filled with dead bodies. After accidentally breaking a water line, the room begins to fill with water and hands begin to drag him down killing him. Jacob and Pia look for Scott and begin to hear music and visions of an art class from the past. They see their own drawings on the wall, and patients begin to fight with the staff cheering them on. When they snap back to the present they see who they assume is Scott and chase him down the halls. This leads to them finding Scott's dead body and the homeless guy from earlier. Suddenly they are back in the past with the staff chasing them around the asylum. We see the doctor lecture to a bunch of onlookers explaining fears. Jacob is seen strapped to a gurney with his biggest fear being claustrophobia and is forced into a morgue drawer. Pia is scared of injections, and is then punctured many times. Pia frees herself and runs from the staff, she finds a nurse uniform and casually walks through the hospital looking for Jacob. She finds and releases Jacob from the drawer. They accidentally run into Gertrude Martin's room and notice that she is pregnant and about to give birth on Jacob's birthday. After realizing Gertrude is actually his mother, he walks into her room and tells her he is Jacob from present day. Gertrude whispers into the nurses ear, and the nurse promises that baby Jacob would be given to her brother so he wouldn't be raised in the asylum. Baby Jacob is then placed into the box from the beginning, and the little girl is shown to be a young Pia. Young Pia is instructed to deliver baby Jacob. The doctor is shown to be Jacob's father, and then slaps Pia's mother for hiding baby Jacob. Jacob knows the fire was started on this day, but he decides to make the fire bigger by pouring chemicals everywhere. After starting the fire and everyone runs out Jacob is pulled back into hospital, but Pia flashes back to the present. Back in present time the building in on fire, and Pia is distraught about her brother and friends being killed. Pia is shown in a ward from the beginning looking at pictures. Flash back to the past with the father happy that he finally got his son back and a nurse with Jacob's birth certificate checking off that he was born but is now dead."
}