{
  "imdb_id": "tt3685622",
  "tmdb_id": "321666",
  "douban_id": null,
  "title": "600 Miles (2015)",
  "genres": [
    "Drama",
    "Thriller"
  ],
  "country": "Mexico",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.5,
  "director": [
    {
      "id": "nm2239581",
      "name": "Gabriel Ripstein"
    }
  ],
  "writer": [
    {
      "id": "nm2239581",
      "name": "Gabriel Ripstein",
      "description": null
    },
    {
      "id": "nm0411517",
      "name": "Issa López",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0000619",
      "name": "Tim Roth",
      "character": "Hank Harris"
    },
    {
      "id": "nm2946712",
      "name": "Kristyan Ferrer",
      "character": "Arnulfo Rubio"
    },
    {
      "id": "nm6460152",
      "name": "Alan Carlson",
      "character": "Gun Show Exhibitor"
    },
    {
      "id": "nm2415604",
      "name": "Mónica Del Carmen",
      "character": "Mamá Rubio"
    },
    {
      "id": "nm1899694",
      "name": "Jim Hayes",
      "character": "Gun Show shopper"
    },
    {
      "id": "nm0646114",
      "name": "Craig Hensley",
      "character": "Gunstore Owner 5       (as Craig Oldfather)"
    },
    {
      "id": "nm2084963",
      "name": "Noé Hernández",
      "character": "Martín"
    },
    {
      "id": "nm1126370",
      "name": "Harris Kendall",
      "character": "Greta"
    },
    {
      "id": "nm3679148",
      "name": "Greg Lutz",
      "character": "Willy"
    },
    {
      "id": "nm2344277",
      "name": "Orlando Moguel",
      "character": "Bacacho"
    },
    {
      "id": "nm6291579",
      "name": "Deirdre Moylan",
      "character": "Gun Shop Customer"
    },
    {
      "id": "nm8290279",
      "name": "Lisa Piikkila",
      "character": "Surplus store cashier"
    },
    {
      "id": "nm6293096",
      "name": "Peyton Nikole Piper",
      "character": "Local in courtyard"
    },
    {
      "id": "nm7113969",
      "name": "Danny K. Ray",
      "character": "(as Danny Ray)"
    },
    {
      "id": "nm2838343",
      "name": "Fausto Olmos Rentería",
      "character": "Comprador Armas Show"
    },
    {
      "id": "nm7944093",
      "name": "Cale Rush",
      "character": "Gun Store Kid"
    },
    {
      "id": "nm6336793",
      "name": "Keegan J. Rush",
      "character": "Gun Shop Kid"
    },
    {
      "id": "nm4158370",
      "name": "Tad Sallee",
      "character": "Gun Show Exhibitor"
    },
    {
      "id": "nm0781299",
      "name": "Julian Sedgwick",
      "character": "Ray Wilson"
    },
    {
      "id": "nm1138362",
      "name": "Harrison Thomas",
      "character": "Carson"
    }
  ],
  "overview": "Arnulfo Rubio smuggles weapons from Arizona to Mexico for a drug cartel, but he is being investigated by agent Harris. When agent Harris blows his covers, he and Arnulfo end up in a journey where he will be the hostage of this young criminal.",
  "storyline": "With the hidden compartments of his SUV crammed with assault weapons, the young Sinaloan and low-level firearms smuggler, Arnulfo Rubio, attempts to cross the Mexican border, only to catch the eye of the veteran ATF agent, Hank Harris. However--not knowing what to do when he manages to turn the tables on Harris--Rubio decides to drive from America back to Mexico, to turn the captive over to the cartel. Now, the lives of the two men become inextricably intertwined--and as they head to a very dangerous place--the bitter adversaries will have to trust each other to make it out of there alive. Can they return to the United States in one piece?",
  "plot": "Arnulfo Rubio smuggles weapons for a Mexican cartel. He is using an American associate, who buys the weapons in the United States for him. During one of the weapons purchases, ATF agent Hank Harris attempts to apprehend Arnulfo, but is surprised and knocked out by Arnulfo's American partner, who flees the scene immediately. A panicked Arnulfo restrains the unconscious Hank and loads him into a secret compartment of his SUV, driving over the border into Mexico with him. There, he lets Hank sit on the backseat, still handcuffed, while he drives to his hometown.\n\nDuring the drive, they get into a roadblock set up by a different cartel. They are almost killed by the enforcers when they notice that a handcuffed American is in the car, but Hank is able to negotiate free passage by mentioning the names of several cartel members and assuring that he is doing business with them.\n\nWhile driving further, Hank and Arnulfo begin to talk to each other and get closer, with Hank mentioning that his wife has died from a stroke 6 months ago and that they were unable to have children.\n\nWhen they arrive, Arnulfo takes Hank to his uncle, a cartel member, and tries to explain that Hank could be useful to them with his knowledge of cartel information. His uncle, furious because Arnulfo created trouble by bringing an American government employee to him, ignores his explanation. He demands that Arnulfo kill Hank. When Arnulfo cannot bring himself to do it, his uncle attempts to shoot Hank, only to be shot and killed himself at the last second by Arnulfo.\n\nHank and Arnulfo try to flee the country, with Hank calling some associates to arrange a safe extraction to the United States. They wait at the house of another of Arnulfo's uncles for Hank's associates. But the uncle secretly has alerted the cartel, who send enforcers to catch and/or kill both. Hank is able to flee the house while Arnulfo is caught. But Hank returns, shoots and kills the enforcers and flees with Arnulfo.\n\nSomewhere in the desert in the border country between Mexico and the United States, Hank lets Arnulfo get out of the car and drives away, leaving Arnulfo surprised and confused.\n\nThe film ends with a domestic scene at Hank's home which shows that, in contrast to what he told Arnulfo, Hank's wife is still alive and it is implied that he has children.",
  "synopsis": null
}