{
  "imdb_id": "tt3668162",
  "tmdb_id": "268660",
  "douban_id": null,
  "title": "Bangalore Days (2014)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "171 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.3,
  "director": [
    {
      "id": "nm3250747",
      "name": "Anjali Menon"
    }
  ],
  "writer": [
    {
      "id": "nm3250747",
      "name": "Anjali Menon",
      "description": "dialogue"
    },
    {
      "id": "nm3250747",
      "name": "Anjali Menon",
      "description": "screenplay"
    },
    {
      "id": "nm3250747",
      "name": "Anjali Menon",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2601111",
      "name": "Nazriya Nazim",
      "character": "Divya /              Kunju"
    },
    {
      "id": "nm4028885",
      "name": "Nivin Pauly",
      "character": "Krishnan P.P. /              Kuttan"
    },
    {
      "id": "nm4921260",
      "name": "Dulquer Salmaan",
      "character": "Arjun /              Aju"
    },
    {
      "id": "nm1335704",
      "name": "Fahadh Faasil",
      "character": "Shivadas"
    },
    {
      "id": "nm2527173",
      "name": "Parvathy Thiruvothu",
      "character": "Sarah       (as Parvathi Menon)"
    },
    {
      "id": "nm1589340",
      "name": "Isha Talwar",
      "character": "Meenakshi"
    },
    {
      "id": "nm3383930",
      "name": "Nithya Menon",
      "character": "Natasha       (as Nithya Menen)"
    },
    {
      "id": "nm1427780",
      "name": "Kalpana",
      "character": "Kuttan's Mother"
    },
    {
      "id": "nm0683477",
      "name": "Maniyanpilla Raju",
      "character": "Prakashan       (as Maniyampilla Raju)"
    },
    {
      "id": "nm0695595",
      "name": "Praveena",
      "character": "Divya's Mother"
    },
    {
      "id": "nm1066795",
      "name": "Vijayaraghavan",
      "character": "Kuttan's Father"
    },
    {
      "id": "nm7328054",
      "name": "Sijoy Varghese",
      "character": "Coach"
    },
    {
      "id": "nm6325282",
      "name": "Sajid Yahiya",
      "character": "Storm Riderz Rider"
    },
    {
      "id": "nm0693092",
      "name": "Prathap Pothen",
      "character": "Francis"
    },
    {
      "id": "nm1110573",
      "name": "Vinaya Prakash",
      "character": "Natasha's Mother       (as Vinaya Prasad)"
    },
    {
      "id": "nm7711918",
      "name": "Paris Laxmi",
      "character": "Michelle"
    },
    {
      "id": "nm7909121",
      "name": "Ajith",
      "character": "Astrologer"
    },
    {
      "id": "nm7807992",
      "name": "Gautam Pisharody",
      "character": "Fayyaz"
    },
    {
      "id": "nm2459678",
      "name": "Krishna Prasad",
      "character": "Kuttan's Uncle"
    },
    {
      "id": "nm9969854",
      "name": "Rekha",
      "character": "Sarah's Mother       (as Rekha)"
    },
    {
      "id": "nm7909122",
      "name": "Sharan",
      "character": "Advocate"
    },
    {
      "id": "nm1196428",
      "name": "Sagar Shiyas",
      "character": "Narayanan"
    }
  ],
  "overview": "A fun roller coaster ride about three young people, Aju, Divya and Kuttan who are cousins, reach Bangalore to dream, discover &amp; explore!",
  "storyline": "Bangalore Days begins with an intro from Kuttan (Nivin Pauly) introducing himself and his cousins namely Divya (Nazriya) and Aju (Dulquer) who share a very friendly relationship right from the childhood.They get separated after their schooling but are reunited at Bangalore after the marriage of Divya to Das. The story revolves around how their life turns at Bangalore.",
  "plot": "The story revolves around three cousins, Divya 'Kunju' Prakash (Nazriya Nazim), Krishnan 'Kuttan' P.P. (Nivin Pauly) and Arjun 'Aju' (Dulquer Salmaan), who have shared a close bond since their childhood. Kuttan is a software engineer whose heart and soul is back home in his village. Arjun, whose parents are divorced, is a bike mechanic who lives his life on his own terms. Divya has completed her graduation and aspires to do her Master of Business Administration from Indian Institutes of Management but is compelled to get married to workaholic corporate executive Shivadas 'Das' (Fahadh Faasil) because of her parents' astrologer's suggestions. After their wedding, Divya moves to Bangalore as Das is settled there. Kuttan does the same for his job while Arjun joins a biker gang as a mechanic in the same city.\n\nDivya feels emotionally alone as her husband Das continues to ignore her. Her only solace is the time she gets to spend with her cousins Aju and Kuttan. Naive Kuttan, who wanted a traditional, modest, saree-clad girl for a wife, falls in love with an air hostess called Meenakshi (Isha Talwar) on the Bangalore to Kochi flight. They date and Kuttan changes from a reserved and shy person to a trendy person to impress her. But his dreams are shattered when her ex-boyfriend arrives at her flat and he realizes that she was only trying to get back with him. He breaks off his relationship with her.\n\nDivya and Das's personal life keeps falling into despair. After an argument one day, Divya, upon inspecting a room in their apartment that Das never lets anyone enter, is shocked to find it filled with photos, knick-knacks and possessions of a strange girl (Nithya Menon). In horror of not having a place in Das's heart and life, she leaves Das and returns home to Kerala in sorrow, with Kuttan. There they are still pulled into despair as Kuttan's father has abandoned his rich family and gone for a permanent pilgrimage, willing all his wealth and its rights to Kuttan and his sister. Kuttan has to bring his mother to Bangalore, after she convinces him to.\n\nArjun was a bike racer but due to a foul incident, he is forced to serve a one-year ban from racing. He falls for a radio jockey named Sarah (Parvathy) but when he finally meets her in person, he finds that she is a paraplegic. He starts to like her attitude and starts to follow her. They became good friends but Arjun is saddened when he learns that Sarah is to leave for Australia on a university scholarship.\n\nMeanwhile, as Divya and Das are in a middle of getting a divorce. Arjun learns that a few years back, Das was an ex-bike racer. He then went by the name Shiva and is a leader of his biker gang. Shiva had given up on racing after he was involved in an accident that killed his love Natasha Francis (Nithya Menon). Upon knowing what happen, Divya decides to return to Bangalore and takes up her MBA while remaining in the same house as Das. She gradually win over by a repentant Das and arranges for him to meet Natasha's parents. After the meeting, Das is able to let go of his past. Divya forgives him and they get their marital life on track.\n\nKuttan's mom gets to know about the urban Indian culture with her neighbours and after 3 months decides to visit her daughter in Oklahoma, USA.\n\nIn the airport, Kuttan and his mom see Meenakshi, who will be an air hostess in Kuttan's mom's flight to London. Meenakshi approaches Kuttan and reveals that her relationship with the old boy friend has broken permanently and she will be waiting for his call. Just seconds after that, Kuttan goes by and talks with her. Though what he says is not revealed, it is clear that he replied in the negative and he tells his mom to go to the flight.\n\nArjun gets a chance to race on the same day that Sarah has to leave for Australia. With Divya, Kuttan, and Das cheering for him, he wins the race. After the race, Arjun realizes how important Sarah is to him and that meeting her changed his life. He asks her not to leave for Australia. Sarah forgoes her scholarship to stay with him in Bangalore. In the end, Kuttan gets married to his neighbour in Bangalore, a foreigner named Michelle (Paris Laxmi), a European Bharathanatyam dancer. Who has embraced the culture of Kerala. The film ends with Divya, Das, Arjun, and Sarah breaking into their room and all of them posing for a photo.",
  "synopsis": null
}