{
  "imdb_id": "tt3627726",
  "tmdb_id": "344870",
  "douban_id": null,
  "title": "Three Times Moving: A Time to Lie (2014)",
  "genres": [
    "Short",
    "Drama"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "9 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm2357750",
      "name": "Lee Neville"
    }
  ],
  "writer": [
    {
      "id": "nm2357750",
      "name": "Lee Neville",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm6357220",
      "name": "Jane Hogan",
      "character": "Julie"
    },
    {
      "id": "nm2357750",
      "name": "Lee Neville",
      "character": "Adam"
    },
    {
      "id": "nm6357221",
      "name": "Danielle Little",
      "character": "Anna"
    }
  ],
  "overview": "In the second in a trilogy of short films that follow Time Stops Moving  and Time Always Moving, and continue where Three Times Moving:  The Kiss Through Time left off- Anna confronts Julie on her  contradictory lies and love for Adam.  Starring Jane Hogan as “Julie”, Lee Neville as “Adam” and  Danielle Little as “Anna”.",
  "storyline": "In the second in a trilogy of short films that follow Time Stops Moving and Time Always Moving, and continues where Three Times Moving: The Kiss Through Time left off- Anna confronts Julie on her contradictory lies and love for Adam.",
  "plot": "Benjamin Franklin Gates is an American historian, cryptologist, and treasure hunter. As a child, his grandfather John told him of a story that Charles Carroll of Carrollton passed on a secret to their ancestor in 1832 of a fabled national treasure hidden in America by the Founding Fathers and Freemasons. The clue leading to the treasure is the phrase “The secret lies with Charlotte”. While Ben is convinced by the story, his sceptical father Patrick dismisses it as nonsense.\n\nThirty years later, Ben leads an expedition with Ian Howe, and his friend, Riley Poole, a computer expert, to find the Charlotte, a ship lost in the Arctic, which holds the first clue to finding the national treasure. They find a meerschaum pipe, which has a clue implying the next is on the Declaration of Independence. When Ian suggests they steal it, a fight ensues, and the group split in two.\n\nBen and Riley report the potential theft of the Declaration to the FBI and Dr. Abigail Chase of the National Archives, but Abigail dismisses their claim. Ben decides to steal the document himself from the Archives’ preservation room during a gala event. Obtaining Abigail’s fingerprints, Ben successfully obtains the Declaration but is spotted by Ian’s group just as they break in to steal it. Ben tries to leave via the gift shop but has to buy the Declaration when the clerk mistakes it for a souvenir copy. Abigail, suspecting something is astray, pursues Ben and takes back the document. Ian kidnaps her, but Ben and Riley rescue Abigail, tricking Ian by leaving behind a purchased copy of the Declaration. FBI Agent Sadusky begins tracking Ben down.\n\nGoing to Patrick’s house, the trio study the Declaration and discover a Ottendorf cipher written in invisible ink. The message refers to the Silence Dogood letters written by Benjamin Franklin. Patrick formerly owned them but donated them to the Franklin Institute. Using a school boy to acquire the letters’ key words, Ben, Riley, and Abigail discover a message pointing to the bell tower of Independence Hall. They find a hidden cache containing a pair of glasses with multiple coloured lenses, which, when used to read the back of the Declaration reveal a clue pointing to the Trinity Church.\n\nThe group are chased by Ian’s associates. Ben is arrested by the FBI, while Abigail and Riley lose the Declaration to Ian. However, Abigail convinces Ian to help them rescue Ben in exchange for the next clue. Ian agrees, arranging a meeting at the USS Intrepid where they help Ben evade the FBI.\n\nIan returns the Declaration and asks for the next clue, but when Ben remains coy, Ian reveals he has kidnapped Patrick as a hostage. They travel to the Trinity Church where they find an underground passage but it appears to lead to a dead end lit by a lone lantern. Patrick claims it is referencing to the Midnight Ride of Paul Revere, pointing Ian to the Old North Church in Boston. Ian leaves the Gates trapped in the chamber, heading for Boston. Patrick reveals the clue was a fake. They find a notch which the meerschaum pipe fits into, opening a large chamber containing the treasure. Ben contacts Sadusky, actually a Freemason, surrendering the Declaration and the treasure’s location in exchange for clemency. Ian is later arrested when Ben tips the FBI off.\n\nLater, Ben and Abigail have started a relationship, while Riley is somewhat upset that Ben turned down the 10% finder's fee for the treasure and accepting a much smaller amount that still has netted them all significant wealth.",
  "synopsis": null
}