{
  "imdb_id": "tt3612970",
  "tmdb_id": "347478",
  "douban_id": null,
  "title": "The Apaches (2015)",
  "genres": [
    "Drama"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm1715453",
      "name": "Nassim Amaouche"
    }
  ],
  "writer": [
    {
      "id": "nm1715453",
      "name": "Nassim Amaouche",
      "description": "dialogue"
    },
    {
      "id": "nm1715453",
      "name": "Nassim Amaouche",
      "description": "screenplay"
    },
    {
      "id": "nm0117572",
      "name": "Guillaume Bréaud",
      "description": "dialogue"
    },
    {
      "id": "nm0117572",
      "name": "Guillaume Bréaud",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm1715453",
      "name": "Nassim Amaouche",
      "character": "Samir"
    },
    {
      "id": "nm0244707",
      "name": "André Dussollier",
      "character": "Jean"
    },
    {
      "id": "nm0144377",
      "name": "Laetitia Casta",
      "character": "Jeanne"
    },
    {
      "id": "nm0054403",
      "name": "Djemel Barek",
      "character": "Le père de Samir"
    },
    {
      "id": "nm7541082",
      "name": "Alexis Clergeon",
      "character": "L'enfant"
    },
    {
      "id": "nm3588186",
      "name": "Kamel Labroudi",
      "character": "Karim"
    },
    {
      "id": "nm7541083",
      "name": "Mohand Taferka",
      "character": "Le vieux chef"
    },
    {
      "id": "nm0337246",
      "name": "Hammou Graïa",
      "character": "Belkacem"
    },
    {
      "id": "nm7541084",
      "name": "Moussa Brahimi",
      "character": "Le chef du conseil"
    },
    {
      "id": "nm0951976",
      "name": "Abbes Zahmani",
      "character": "Arezki"
    },
    {
      "id": "nm7541085",
      "name": "Mustapha Belabbas",
      "character": "Akli"
    },
    {
      "id": "nm0846705",
      "name": "Afida Tahri",
      "character": "La belle-mère de Samir"
    },
    {
      "id": "nm0632447",
      "name": "Ahcène Nini",
      "character": "Le patron du Djurdjura"
    },
    {
      "id": "nm7373754",
      "name": "François-Xavier Phan",
      "character": "Le réparateur hi-fi"
    },
    {
      "id": "nm0721469",
      "name": "Dominique Reymond",
      "character": "Dr. Reymond"
    },
    {
      "id": "nm7541086",
      "name": "Abdel Bousdraoui",
      "character": "Le patron du vidéoclub"
    },
    {
      "id": "nm3274096",
      "name": "Rabah Nait Oufella",
      "character": "Le serveur du Lounès"
    },
    {
      "id": "nm3766691",
      "name": "Kamel Laadaili",
      "character": "Djibril, l'entraîneur de boxe"
    },
    {
      "id": "nm7541087",
      "name": "Nora Amaouche",
      "character": "Nora"
    },
    {
      "id": "nm7541088",
      "name": "Ismaël Oubajjit",
      "character": "Nassim"
    },
    {
      "id": "nm7541089",
      "name": "Marc Jacob",
      "character": "Le livreur de bière"
    },
    {
      "id": "nm0584800",
      "name": "Béatrice Michel",
      "character": "La tante de Samir"
    },
    {
      "id": "nm1285506",
      "name": "Laurent Pons",
      "character": "Le client du bar du père"
    },
    {
      "id": "nm7541090",
      "name": "Fadhma N'Soumer",
      "character": "La vieille Apache"
    },
    {
      "id": "nm0102516",
      "name": "Serge Bozon",
      "character": "Le narrateur       (voice)"
    },
    {
      "id": "nm5368373",
      "name": "Ismaël Ouazzani",
      "character": "Djudjura"
    },
    {
      "id": "nm7715369",
      "name": "Abdelkader Hoggui",
      "character": "Un joueur de dominos"
    }
  ],
  "overview": null,
  "storyline": "A young French-Algerian man lured by a dubious \"family\" lawyer into making an occult business deal within a similarly marginalized setting: one of Paris's largest and most diverse Kabyle communities. Having been drawn into the family bar business by his estranged father, Samir still agonizes over the memory of his late mother, while falling in love with a beautiful and mysterious single mom.",
  "plot": "Several children play on a farm while a tea party is prepared. As the farmer drives his tractor through the field where the children are playing, While her friends follow behind, Kim jumps up onto the trailer, pretends the tractor is a train, and shoots at it. The tractor makes a turn, and she falls off and is run over, to the horror of the other children. At their school, the teacher removes Kim's name tag from a storage peg.\n\nThe children play in the fields again as their parents leave for the tea party. The boys want to play football, but the game changes to kick the can instead. While hiding from Danny, Tom decides to balance on the top of a fence overlooking a slurry pit and falls in. Nobody hears his cries for help, and he suffers a quick death by drowning. The village children are given a day off because of his death, and the class teacher removes the items from Tom's desk.\n\nAs their parents prepare the children's party, they play at being cavalry and later Apaches. When the game concludes, the children wander into an equipment shed and find a bottle that contains an unnamed chemical. Danny suggests they drink it to celebrate their victories. Michael points out that the can may contain a dangerous chemical, and they discuss whether it is poisonous. They agree to mime-drink the liquid, but Sharon accidentally swallows some of it. She seems fine once she spits it out, but later she becomes sick. In the middle of the night, she wakes up in excruciating pain, screaming and crying and calling for her mother. In the next scene, her mother is seen clearing out her now-dead daughter's bedroom with a close-up of her now empty bed. Danny comments that he does not understand why adults drink, and his parents pour whisky from a bottle identical to that of the poisonous chemical.\n\nThe remaining children play in the fields, and Michael narrowly avoids being run over by a tractor like Kim. As they pretend to be the stars of Starsky and Hutch, Michael accidentally dislodges a heavy iron gate that crushes Robert. The remaining two children stare the lifeless body shocked as more people arrive for the party. Danny sets off on his own to find more children, and finds farm workers on their break. Danny requests to sit on their tractor, and they agree as long as he is careful. As he pretends to drive a racing car, he accidentally releases the handbrake and crashes the tractor, presumably snapping his neck. His parents mourn his loss in his empty bedroom.\n\nDanny's coffin is buried as the vicar commits him to the ground, and the mourners move on to the wake. Danny continues his narration after his death, and talks calmly about his family all arriving for the \"party\" being prepared earlier in the film. Michael, also present, is revealed to be Danny's cousin – the only child not to have been killed by his own reckless behavior, despite Danny having described Michael as \"daft\". Danny's voice fades into a ghostly echo as he sadly says he wishes he could have gone to the party.\n\nClosing credits show a long list of real children who had died in actual farm accidents in the year before the film was made.",
  "synopsis": null
}