{
  "imdb_id": "tt3658772",
  "tmdb_id": "373314",
  "douban_id": null,
  "title": "Misconduct (2016)",
  "genres": [
    "Crime",
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "106 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.3,
  "director": [
    {
      "id": "nm0989941",
      "name": "Shintaro Shimosawa"
    }
  ],
  "writer": [
    {
      "id": "nm1899220",
      "name": "Simon Boyes",
      "description": null
    },
    {
      "id": "nm0556573",
      "name": "Adam Mason",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0241049",
      "name": "Josh Duhamel",
      "character": "Ben Cahill"
    },
    {
      "id": "nm0000164",
      "name": "Anthony Hopkins",
      "character": "Arthur Denning"
    },
    {
      "id": "nm0000199",
      "name": "Al Pacino",
      "character": "Charles Abrams"
    },
    {
      "id": "nm1404408",
      "name": "Alice Eve",
      "character": "Charlotte Cahill"
    },
    {
      "id": "nm0015196",
      "name": "Malin Akerman",
      "character": "Emily Hynes"
    },
    {
      "id": "nm0496932",
      "name": "Byung-Hun Lee",
      "character": "The Accountant"
    },
    {
      "id": "nm0005466",
      "name": "Julia Stiles",
      "character": "Jane Clemente"
    },
    {
      "id": "nm1412974",
      "name": "Glen Powell",
      "character": "Doug Fields"
    },
    {
      "id": "nm0114177",
      "name": "Marcus Lyle Brown",
      "character": "Joe Bilson"
    },
    {
      "id": "nm3159868",
      "name": "Leah McKendrick",
      "character": "Amy"
    },
    {
      "id": "nm0549815",
      "name": "Chris Marquette",
      "character": "Giffords       (as Christopher Marquette)"
    },
    {
      "id": "nm3680560",
      "name": "Skye P. Marshall",
      "character": "Hatty"
    },
    {
      "id": "nm0930707",
      "name": "Gregory Alan Williams",
      "character": "Richard Hill"
    },
    {
      "id": "nm6642071",
      "name": "Jason Gibson",
      "character": "Graham"
    },
    {
      "id": "nm1994245",
      "name": "Nathan Moore",
      "character": "Lawrence       (as Nathan J. Moore)"
    },
    {
      "id": "nm2258570",
      "name": "Chris J. Fanguy",
      "character": "Cop #2       (as Chris Fanguy)"
    },
    {
      "id": "nm4005031",
      "name": "Jaiden Kaine",
      "character": "Doctor Hughes"
    },
    {
      "id": "nm5915334",
      "name": "Milla Bjorn",
      "character": "Susie"
    },
    {
      "id": "nm2576700",
      "name": "Nicholas X. Parsons",
      "character": "Paramedic"
    },
    {
      "id": "nm4299246",
      "name": "John W. Houghtaling",
      "character": "Lawyer       (as John Houghtling II)"
    },
    {
      "id": "nm0268899",
      "name": "Alexandra Fatovich",
      "character": "Elizabeth"
    },
    {
      "id": "nm0303316",
      "name": "Jeff Galpin",
      "character": "Sergeant"
    },
    {
      "id": "nm0352513",
      "name": "Rio Hackford",
      "character": "Guy"
    },
    {
      "id": "nm7702095",
      "name": "Elizabeth Buzbee",
      "character": "Katy"
    },
    {
      "id": "nm7347077",
      "name": "Anthony Buzbee Jr.",
      "character": "Bus Boy       (as Anthony Buzbee Jr.)"
    },
    {
      "id": "nm1975249",
      "name": "Eric Shepherd",
      "character": "Mr. Donovan"
    },
    {
      "id": "nm6911735",
      "name": "Julia Bailey",
      "character": "Jenny       (as Julia Sundstrom Sandstrom)"
    },
    {
      "id": "nm7145176",
      "name": "Lisa Salzer",
      "character": "ER Nurse       (as Lisa L. Salzer)"
    },
    {
      "id": "nm1591432",
      "name": "Clay Chamberlin",
      "character": "ER Cop"
    },
    {
      "id": "nm2587636",
      "name": "Catherine Kim Poon",
      "character": "ER Nurse #2       (as Catherine Poon)"
    },
    {
      "id": "nm2963701",
      "name": "Sara Fletcher",
      "character": "911 Operator"
    },
    {
      "id": "nm1962880",
      "name": "Bradley Fletcher",
      "character": "Dr. Kroner       (as Brad Fletcher)"
    }
  ],
  "overview": "An ambitious lawyer finds himself caught in a power struggle between a corrupt pharmaceutical executive and his firm’s senior partner. When the case takes a deadly turn, he must race to uncover the truth before he loses everything.",
  "storyline": "When an ambitious young lawyer takes on a big case against a powerful and ruthless executive of a large pharmaceutical company, he soon finds himself involved in a case of blackmail and corruption.",
  "plot": "Arthur Denning (Hopkins) is the owner of a major pharmaceutical firm. He is very controlling of his girlfriend Emily Hynes (Åkerman), and she is physically intimidated by his security guards. She is abducted, and Denning is sent photos of her bruised face. He is ordered to go to an art gallery with the ransom. When a man approaches him, Denning attacks him, only to find out later that he was the gallery owner.\n\nBefore her abduction, Hynes reaches out to her ex-boyfriend Ben Cahill (Duhamel). Over drinks, she hints at Denning's abuse and some dirt she has on him. Back at her apartment, she shows Cahill files that she has stolen from Denning's laptop that reveal his criminal behavior during drug trials. She attempts to seduce Cahill. Later, she convinces a stranger to beat her up for the photo that she sends to Denning.\n\nCahill uses the information from Hynes to pitch a class action lawsuit to his boss Charles Abrams (Pacino). Denning settles the suit for $400 million, provided that the stolen documents are returned to him.\n\nCahill is stunned to find Hynes dead in her apartment. With a bottle of pills in her hand, and a lethal cocktail of drugs in her system, her death is suspicious but possibly just a suicide. A short time later, her body turns up in Cahill's home. Convinced he is being framed, he confronts Denning who is amused at Cahill's passion, but assures him that he had nothing to do with it.\n\nA hitman kidnaps Cahill and his wife Charlotte (Eve). Cahill manages to overpower and kill him. When he inspects the hitman's files he realizes that the villain of the piece is actually Abrams, who has been Denning's attorney for years. The settlement was all just an elaborate way of protecting Denning from criminal liability.\n\nCahill submits the hitman's files to the police who arrest Abrams. Before he can be taken into custody, Abrams grabs an officer's gun and commits suicide.\n\nAs Cahill packs for a move to a new house, he notices that some of his wife's clothing smells like Hynes' perfume. He asks her what happened between the two of them. Charlotte confesses that she confronted Hynes about her involvement with her husband. They had an argument in which Charlotte hit Hynes, causing her to fall and hit her head. Though Charlotte is a nurse, she did not help her and staged the scene for the police.",
  "synopsis": "Denning is a rich CEO of a giant pharma company, where Emily works as a secretary. Their professional relationship turns into personal one and now Emily is too afraid of threatening Denning to end the relationship. Denning's company is now a days in news questioning deaths due to clinical trials. Emily is suddenly missing and worried Denning hires private investigators to bring her back home safe. Denning receives Emily's blood-faced picture on his cell phone and a threat that if money is not received, she dies.\nMeanwhile, Emily reunites with her classmate Ben, who is a lawyer and he soon finds that she has confidential data about manipulating clinical trials by Denning's pharma company. Ben decides to take big risk to handle this high-profile corporate corruption case, ignoring his friend Doug's warning. Emily gives stolen data to Ben and he contacts famous lawyer Charles Abrams, who hires him for big remuneration, seeing that Ben has strong evidences.Ben's wife Charlotte, who works double shifts as a nurse and aspire to spend time with Ben. One night in a club, a hit-man warns Ben to leave the case and then Emily embraces Ben in Charlotte's presence.\nCharlotte senses that there is something going on between Ben and Emily.One day, Emily is found dead in her apartment seemingly looking a suicide, after she gets a man to hit her and to take a blood-faced picture in her cell phone. Ben visits Emily's place and found her dead with a bottle of drugs in her hand and a cell phone, text of which displays a demand for 2.5 million dollars at 1 pm at Octivia Art Gallery. Denning messes up the plan leaving his investigators in shock and suspicion.Ben confesses to Charlotte about Emily and how she was found dead and they decide to act normal as if nothing happened to avoid police trouble. Ben decided to follow that text message in Emily's phone to get some clue at Art Gallery. At the gallery, Ben and Denning glances each other.Denning settles the class-action against him for a ransom and buy backs evidences.That hit-man attacks Emy, Emily's neighbor and makes Charlotte and Ben hostages. Ben kills the hit-man and rescues Charlotte. Ben realizes now that actually Charles has played the game and hired the hit-man. He contacts police and confronts Charles but Charles kills himself before police could arrest him.Only when happy ending is near, and Ben returns home; Charlotte confesses that she had decided not to save her life when she pushed Emily and she got head injury leading to death and she did it to eliminate someone between her and Ben."
}