{
  "imdb_id": "tt3779844",
  "tmdb_id": "368926",
  "douban_id": null,
  "title": "The Open (2015)",
  "genres": [
    "Drama",
    "Sci-Fi",
    "Sport"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "103 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm6436847",
      "name": "Marc Lahore"
    }
  ],
  "writer": [
    {
      "id": "nm6436847",
      "name": "Marc Lahore",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm3485153",
      "name": "James Northcote",
      "character": "Ralph"
    },
    {
      "id": "nm6546769",
      "name": "Maia Levasseur-Costil",
      "character": "Stéphanie"
    },
    {
      "id": "nm3506633",
      "name": "Pierre Benoist",
      "character": "André"
    }
  ],
  "overview": "War is global. Yet Stéphanie (n°4, WTA) and André are preparing their Open... without any tennis balls. They believe in it. So much that they could even convince Ralph, a guerilla from the plain, to lay down his gun... and take up his racket.",
  "storyline": "War is global. Yet Stéphanie (n°4, WTA) and André are preparing their Open... without any tennis balls. They believe in it. So much that they could even convince Ralph, a guerilla from the plain, to lay down his gun... and take up his racket.",
  "plot": "When the young hermaphrodite Cynthia (Gaea Gaddy) meets Gen (Tempest Crane) and Jay (Jendeen Forberg), a couple recovering from plastic surgery, she learns of Pandrogyny, in which two people merge their facial features in order to reflect their evolution from separate identities into one unified entity.\n\nInspired by this, Cynthia abandons her husband and suburban life to embark on a road trip with Gen through the remnants of 20th century America.\n\nSimultaneously, a young transman, Syd (Morty Diamond), meets a young punk man, Nick (Daniel Luedtke). After having sex with one another, and someone born of the opposite sex for the first time, Syd and Nick find themselves falling into love, a love that forces them to confront how hormone treatments have forever changed sex and relationships.\n\nNot science fiction, but American reality, OPEN brings together a cast of real hermaphroditic, pandrogynous, and transpeople to create a revealing look at the pioneers of the new human experience, and the emerging possibilities for humanity at the dawn of a new millennium.",
  "synopsis": null
}