{
  "imdb_id": "tt3748718",
  "tmdb_id": "335909",
  "douban_id": null,
  "title": "Ride the Thunder (2015)",
  "genres": [
    "History"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "105 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.4,
  "director": [
    {
      "id": "nm6514465",
      "name": "Fred Koster"
    }
  ],
  "writer": [
    {
      "id": "nm6514465",
      "name": "Fred Koster",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0089340",
      "name": "Eric St. John",
      "character": "John Ripley"
    },
    {
      "id": "nm0383226",
      "name": "Joseph Hieu",
      "character": "Le Ba Binh"
    },
    {
      "id": "nm6392127",
      "name": "Pierre Nguyen",
      "character": "Hoa"
    },
    {
      "id": "nm7253010",
      "name": "Steve Son Nguyen",
      "character": "Dong"
    },
    {
      "id": "nm7253011",
      "name": "Megatran Roy",
      "character": "Head Prison Guard"
    },
    {
      "id": "nm4089701",
      "name": "Alan Vo Ford",
      "character": "Prison Camp Teacher"
    },
    {
      "id": "nm7253013",
      "name": "Tran Lynn",
      "character": "Cam"
    },
    {
      "id": "nm5627680",
      "name": "Ajax Maharlika",
      "character": "Prison Guard #2"
    },
    {
      "id": "nm6629066",
      "name": "Amy Loy",
      "character": "Moline Ripley"
    },
    {
      "id": "nm6820191",
      "name": "Toan Doran",
      "character": "Binh's Father"
    },
    {
      "id": "nm7253014",
      "name": "Taylor Chuck",
      "character": "Bar Thug Leader"
    },
    {
      "id": "nm2672980",
      "name": "John H. Euber",
      "character": "Bartender"
    },
    {
      "id": "nm7253015",
      "name": "Baker Les",
      "character": "Colonel"
    },
    {
      "id": "nm7253016",
      "name": "Paul T. Morris",
      "character": "Bar Singer"
    },
    {
      "id": "nm7253017",
      "name": "Gillaspy Greg",
      "character": "MC Ripley's Speech"
    },
    {
      "id": "nm7253018",
      "name": "Mikami Brian",
      "character": "Prison Guard"
    },
    {
      "id": "nm7253019",
      "name": "Botkin Evan",
      "character": "Marine at Bar"
    },
    {
      "id": "nm7253020",
      "name": "Botkin Andrew",
      "character": "Marine at Bar"
    },
    {
      "id": "nm7253021",
      "name": "Scarry Lynette",
      "character": "Waitress"
    },
    {
      "id": "nm7253022",
      "name": "Sneller Jonathan",
      "character": "Bar Thug"
    },
    {
      "id": "nm7253023",
      "name": "Norman Martinez",
      "character": "Ripley's Radio Operator"
    },
    {
      "id": "nm7253024",
      "name": "Maika Mikami",
      "character": "Young Vietnamese Marine"
    },
    {
      "id": "nm7253025",
      "name": "Ruby Laurie",
      "character": "Colonel Wife"
    },
    {
      "id": "nm7253026",
      "name": "Mattson Cameron Keolinonokahikina",
      "character": "Young Binh"
    },
    {
      "id": "nm5773921",
      "name": "Mark Laursen",
      "character": "Bar Thug"
    },
    {
      "id": "nm7253087",
      "name": "Ikeda Kaylee",
      "character": "Binh's Daughter"
    }
  ],
  "overview": "A look a Vietnam from the perspectives of a US Marine adviser and a Vietnamese Marine left behind.",
  "storyline": "A look at Vietnam from the perspectives of a U.S. Marine adviser, and a Vietnamese Marine who was left behind.",
  "plot": "Luke Collins (Scott Eastwood) is a bull rider on the Professional Bull Riders (PBR) tour, who is seriously injured one night while performing. A year later after recovering, he starts riding again and meets Sophia Danko (Britt Robertson) after she attends the show. She is an art lover living at a sorority house with an internship secured in New York City. On the way home from their first date, they spot a car crash in the woods and help rescue an older man who is stuck inside. Sophia also pulls a wicker box from the vehicle.\n\nWhile in the hospital, Sophia continuously visits the man she and Luke rescued, Ira Levinson (Alan Alda). He explains that there are letters in the box, which he wrote as a teenager, and she offers to read them to him. They tell the story of how he met his late wife, Ruth (Oona Chaplin), on April 10, 1940. Their stories start to interweave. Luke finds an old photograph of Ira and Ruth that fell out of the box in his car and takes it to him at the hospital. In flashbacks, Ruth tells a young Ira that she wants a big family and, eventually, he proposes to her before leaving to fight in World War II. However, Ira is shot during an attack and is later informed by the doctor that he can no longer have children, news that causes distance between him and Ruth when he returns; as he knows how much she wants to be a mother. They decide to make it work regardless and move in together, decorating the house with many paintings that he and Ruth love.\n\nLuke continues riding bulls, no matter the risk of being hurt again, while he and Sophia fall in love. Ira is now out of the hospital and has been moved to a nursing home, where Sophia continues to visit. She gets a call from her boss in New York asking her to attend an art exhibit in Charlotte the following week, which she invites Luke to. While they're there, Luke makes a rude comment to Sophia's boss, which causes an argument between them. They talk about how their worlds are so different and Luke doesn't feel that their romance will work out because of it. Back home, Sophia goes to Ira for advice. He then tells the story of how they made their situation work. Ruth was a school teacher who became very attached to a young boy named Daniel McDonald in her class. Because Daniel lives with his uncaring half-brother and his wife, she and Ira begin taking him in as their own and Ruth later decides to officially adopt him as her son, but his hardhearted relatives wouldn't allow it.\n\nMeanwhile, Luke injures himself again, causing him to be rushed to the hospital. As Sophia is leaving for New York, she gets a call and goes to see him. Luke is advised not to ride again but refuses to accept that his career is over. Following an argument, Luke and Sophia break up. In flashbacks, Ira and Ruth also break up because she can't see a life with him without children in their future. However, weeks later, Ruth returns and they confess their love for one another. One morning, now eighty years old, Ira wakes up to find Ruth has died in her sleep. He boxes up all of the paintings they collected together to sell them at an auction. One night, a woman knocks on his door claiming to be the wife of Daniel McDonald, the child they almost adopted when they were younger, to inform him that Daniel, who later became an astronomer in Britain, has died. She gives him a portrait of Ruth that Daniel had painted and the photograph Daniel had kept of Ira and Ruth (the one Luke found in his car the day of the crash) with a message on the back that reads: \"Ruth Levinson, third grade teacher. She told me I could be anything I wanted to be when I grew up\". Daniel became a professor of astronomy in memory of his favorite teacher.\n\nSophia continues her studies at Wake Forest and Luke continues to ride bulls. One day, they are both contacted by Ira's attorney, (Sophia receives a phone call while in class; Luke opens a letter after a difficult ride) to inform them that Ira has died and that there will be an auction held for the paintings. Luke wins his last ride and wins the championship bull cup, but feels disappointed because Sophia isn't there with him. He then decides to go to the auction, where he buys the first painting, Daniel's portrait of Ruth. Sophia and Luke talk, and he tells her he won't ride anymore because what he really wants is to be with her. While they kiss, an uproar breaks out in the auction room. Luke is informed that he is now the owner of all of Ira's paintings since Ira left a message in his will stating that whoever bought the portrait would get them all since it was the most important one to him, making Luke very wealthy in the process.\n\nOne year later, Luke and Sophia, now married, have built a museum dedicated to Ira and Ruth and their paintings. Luke takes Sophia to the old college where Ira and Ruth used to spend their wedding anniversary. They sit under exactly the same tree and read Ira's letters together.",
  "synopsis": null
}