{
  "imdb_id": "tt3786680",
  "tmdb_id": "272076",
  "douban_id": null,
  "title": "National Theatre Live: The Curious Incident of the Dog in the Night",
  "genres": [
    "Drama"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "160 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.3,
  "director": [
    {
      "id": "nm2765738",
      "name": "Marianne Elliott"
    }
  ],
  "writer": [
    {
      "id": "nm0352738",
      "name": "Mark Haddon",
      "description": "novel"
    },
    {
      "id": "nm3366953",
      "name": "Simon Stephens",
      "description": "adaptation"
    }
  ],
  "cast": [
    {
      "id": "nm2008435",
      "name": "Luke Treadaway",
      "character": "Christopher Boone"
    },
    {
      "id": "nm0193657",
      "name": "Niamh Cusack",
      "character": "Siobhan"
    },
    {
      "id": "nm0728795",
      "name": "Paul Ritter",
      "character": "Ed"
    },
    {
      "id": "nm0908070",
      "name": "Nicola Walker",
      "character": "Judy"
    },
    {
      "id": "nm0835939",
      "name": "Una Stubbs",
      "character": "Mrs. Alexander"
    },
    {
      "id": "nm0245093",
      "name": "Sophie Duval",
      "character": "Mrs. Shears /              Others"
    },
    {
      "id": "nm0796594",
      "name": "Nicholas Sidi",
      "character": "Mr. Shears /              Others"
    },
    {
      "id": "nm1521606",
      "name": "Matthew Barker",
      "character": "Mr. Thompson /              Others"
    },
    {
      "id": "nm3325330",
      "name": "Rhiannon Harper-Rafferty",
      "character": "Punk Girl /              Others"
    },
    {
      "id": "nm0911575",
      "name": "Howard Ward",
      "character": "Reverend Peters /              Others"
    }
  ],
  "overview": "Christopher, fifteen years old, has an extraordinary brain – exceptional at maths while ill-equipped to interpret everyday life. When he falls under suspicion of killing Mrs Shears' dog Wellington, he records each fact about the event in the book he is writing to solve the mystery of the murder. But his detective work, forbidden by his father, takes him on a frightening journey that upturns his world.",
  "storyline": "Christopher, fifteen years old, has an extraordinary brain - exceptional at maths while ill-equipped to interpret everyday life. When he falls under suspicion of killing Mrs Shears' dog Wellington, he records each fact about the event in the book he is writing to solve the mystery of the murder. But his detective work, forbidden by his father, takes him on a frightening journey that upturns his world.",
  "plot": "The play involves a significant reworking of the source material. Rather than present the story in the first-person narrative as the original novel did, the play is presented as a reading of Boone's own writing, read aloud in segments by his teacher. The result is that the play is presented as a play-within-a-play.\n\nThe play, set in Swindon and London is about a 15-year-old amateur detective named Christopher John Francis Boone who is a mathematical genius. He appears to have an unspecified autism spectrum disorder that is variously described as either autism or Asperger's Syndrome, although the condition is never explicitly stated in the play. The titular curious incident is the mystery surrounding the death of a neighbour's dog found speared by a garden fork.\n\nWhile searching for the murderer of the dog, he encounters resistance from many neighbours, but mostly from his father, Ed Boone. Christopher argues to himself that many rules are made to be broken, so he continues to search for an answer; he compares himself to Sherlock Holmes. When he discovers that his father killed the dog, Christopher fears for his own life and travels to London to find and live with his mother, who his father had told him had died. He encounters many problems during the journey, but is welcomed by his mother. However, the road to his ambitions leads him back to Swindon, where he wants to pass important mathematics tests. Everything seems to be an obstacle, but Christopher is eventually reunited with his father and this improves his own future.\n\nIn a short scene after the curtain call, Christopher reappears to solve a mathematics problem posed earlier in the play.",
  "synopsis": null
}