{
  "imdb_id": "tt3750692",
  "tmdb_id": "334895",
  "douban_id": null,
  "title": "Survival Instinct (2016)",
  "genres": [
    "Action",
    "Horror",
    "Thriller"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "75 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.1,
  "director": [
    {
      "id": "nm1497680",
      "name": "Steve Lawson"
    }
  ],
  "writer": [
    {
      "id": "nm1497680",
      "name": "Steve Lawson",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm6516475",
      "name": "Andrew Coughlan",
      "character": "Weaver"
    },
    {
      "id": "nm6516476",
      "name": "Helen Crevel",
      "character": "Stacey"
    },
    {
      "id": "nm6516471",
      "name": "Isabella Nash",
      "character": ""
    },
    {
      "id": "nm1437387",
      "name": "Glenn Salvage",
      "character": "Mike       (voice)"
    },
    {
      "id": "nm6516472",
      "name": "Sam Smith",
      "character": "Rex"
    },
    {
      "id": "nm3247166",
      "name": "Jay Sutherland",
      "character": "Thom"
    }
  ],
  "overview": "Taking its cue from classic survival-thrillers such as 'Duel' and 'Deliverance', 'Survival Instinct' is a fast-paced edge-of-your seat thriller with a strong female lead and a plausible, morally-ambiguous villain.",
  "storyline": "Taking its cue from classic survival-thrillers such as 'Duel' and 'Deliverance', 'Survival Instinct' is a fast-paced edge-of-your seat thriller with a strong female lead and a plausible, morally-ambiguous villain.",
  "plot": "In the midst of a zombie outbreak and shortly after the death of Daryl Dixon's father, Will Dixon, Daryl and his half-uncle Jess Collins escape their mountain shelter in Cabot Ridge to gather supplies in the nearby town of Sedalia. During the scavenger hunt for fuel, Daryl meets Jimmy Blake, the last standing police officer of Sedalia who requests that Daryl find radio batteries to call for help, in exchange for sniper support. In a nearby gas station, Daryl meets Warren Bedford, who gives fuel to Daryl under the condition he join the group. The quartet then escapes with the newly acquired fuel, this time heading to Pemberton.\n\nUpon entering Pemberton, Jess continues to get weaker from a bite he suffered in the mountains, and the truck they took is about to die out. At the campgrounds, Daryl meets deputy Lee, who gives Daryl a shotgun and asks him to look for a park ranger in order to get car keys to another vehicle. When looking for the ranger, Daryl hears a girl calling for help over a radio. Daryl also finds that the ranger has turned into a walker already. In the aftermath, Jess succumbs to the bite and reanimates.\n\nShortly after arriving at a town called Fontana to look for his brother Merle Dixon, Daryl hears gunshots from a building. When Daryl enters a diner, two survivors are being surrounded by walkers, which Daryl kills before talking to them. A woman called Scout and her partner Noah who was injured by an unknown sniper asks Daryl to check the movie theater for another survivor named Mia in exchange for one of their bags of supplies. After finding Mia alive, Daryl returns to the diner for the bag only to realize that Scout and Noah ran off to Memorial Hospital with the bags, yet gives him keys to another car. When Daryl arrives at the police station, the unknown shooter was revealed to be Merle, who was trying to protect himself from U.S. soldiers attempting to bring him to prison. Merle joins the group and demands to go to a bar called Jake's as their next destination.\n\nWhen Daryl questions Merle's reason to go to Jake's, Merle tells him he kept something of Daryl's at the bar. After arriving at the bar, Merle instructs Daryl to stay by the car but Daryl goes and looks for his brother anyway. It is revealed that Merle really went back to get revenge on the gang that sold him out and took Daryl's crossbow. Merle attacks some of them in the bar, until the rest of the gang comes back and knocks Daryl out, taking all of his equipment and supplies. However, an undead gang member has Daryl's crossbow. Daryl takes the crossbow and continues to look for Merle, the gang, and his missing equipment. Afterwards, Daryl finds out that Merle had gone missing while the entire gang was killed and eaten by walkers.\n\nBefore leaving, Daryl runs into Scout who's real name is Anna Turner and contacts her father John, a sheriff, and plans on meeting at the evacuation point at Palmetto Estates. After arriving at Danvers research lab for the serum (a supposed cure), Daryl fights his way through the lab and finds a woman named Sheila Schneider, who was a member of the Archer Creek Dam group. Sheila tells Daryl that the serum is just a fairy tale, and there is no cure. The lab is locked down by the automatic security system and Daryl tells Anna to flip the alarm switch, which actually ends up accidentally triggering the alarm. After escaping the lab, Daryl and Anna go to Sherwood to gather information about the evacuation. Daryl later says goodbye to Anna when she and her father find each other and drive away.\n\nWhile scavenging the area, Daryl finds two elderly survivors, Terry Harrison and his wife, who is bedridden and in bad condition. Harrison is taking care of his wife, though he is concerned for his daughters, Amy and Andrea. He tells Daryl to find Aiden, who was in charge of signaling an evacuation helicopter. He also asks Daryl to get antibiotics from the pharmacy to ease his wife's suffering. Daryl finds Aiden's wife, Jane, who tells Daryl to look for her husband in the pharmacy. Daryl finds Aiden who has apparently twisted his ankle, stuck on the roof of the pharmacy. Aiden tells Daryl that, to signal the evac chopper, he must retrieve his bag from a garage, as the bag has flares that can be used to signal the helicopter. Daryl retrieves and brings it to Aiden, who starts the evacuation. Daryl then returns to the neighborhood where Terry, his wife, and Jane are located. When he arrives, Aiden tells Daryl the choppers have arrived but instead they only grab Aiden and takeoff despite his pleas to wait for the others. Daryl is forced to choose between them as both of their houses are under attack by walkers. The survivor that Daryl chooses to save then tells him that the last evacuation site is Atlanta, at the Firesign Stadium.\n\nDaryl and his remaining survivors continue to the stadium but find it overrun by walkers. Daryl tries to reach various helicopters, but they take off before he can get on, until only one is left, which is problematically surrounded by walkers. Daryl holds off the horde with an M2 Browning mounted on a Humvee that is driven by Merle, who returns. After defending the helicopter, Daryl attempts to get on but is held back by Merle, who tells him the pilot was bitten. The survivors, who have already boarded the helicopter, are left to their fates.",
  "synopsis": null
}