{
  "imdb_id": "tt3717016",
  "tmdb_id": "309924",
  "douban_id": null,
  "title": "After the Ball (2015)",
  "genres": [
    "Comedy"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "101 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.9,
  "director": [
    {
      "id": "nm0308498",
      "name": "Sean Garrity"
    }
  ],
  "writer": [
    {
      "id": "nm1383745",
      "name": "Jason Sherman",
      "description": "screenplay &"
    },
    {
      "id": "nm2169801",
      "name": "Kate Melville",
      "description": "screenplay and"
    },
    {
      "id": "nm1383745",
      "name": "Jason Sherman",
      "description": "story"
    }
  ],
  "cast": [
    {
      "id": "nm0234668",
      "name": "Portia Doubleday",
      "character": "Kate Kassell /              Nate"
    },
    {
      "id": "nm0343082",
      "name": "Marc-André Grondin",
      "character": "Daniel"
    },
    {
      "id": "nm0636562",
      "name": "Chris Noth",
      "character": "Lee Kassell"
    },
    {
      "id": "nm0000452",
      "name": "Lauren Holly",
      "character": "Elise"
    },
    {
      "id": "nm2087783",
      "name": "Natalie Krill",
      "character": "Tannis"
    },
    {
      "id": "nm1965525",
      "name": "Anna Hopkins",
      "character": "Simone"
    },
    {
      "id": "nm2284527",
      "name": "David Michael",
      "character": "Maurice"
    },
    {
      "id": "nm0476906",
      "name": "Mimi Kuzyk",
      "character": "Bella Shapiro"
    },
    {
      "id": "nm0744690",
      "name": "Carlo Rota",
      "character": "Richard"
    },
    {
      "id": "nm0595110",
      "name": "Colin Mochrie",
      "character": "Colin Frost"
    },
    {
      "id": "nm3282535",
      "name": "Michael Mancini",
      "character": "Receptionist"
    },
    {
      "id": "nm3501697",
      "name": "Lola Tash",
      "character": "Polly"
    },
    {
      "id": "nm1900057",
      "name": "Deena Aziz",
      "character": "Couture Executive"
    },
    {
      "id": "nm4891867",
      "name": "Sasha Lipskaia",
      "character": "Russian Model"
    },
    {
      "id": "nm3908878",
      "name": "Henry Kwok",
      "character": "Ron Sakamoto"
    },
    {
      "id": "nm2604833",
      "name": "Rebecca Croll",
      "character": "Mother Shopping"
    },
    {
      "id": "nm5633847",
      "name": "Emma Elle Paterson",
      "character": "Daughter Shopping"
    },
    {
      "id": "nm3111496",
      "name": "Sabrina Campilii",
      "character": "Nervous Girl /              Jennifer"
    },
    {
      "id": "nm4489783",
      "name": "Jade Hassouné",
      "character": "Sales Associate"
    },
    {
      "id": "nm4152992",
      "name": "Raphael Grosz-Harvey",
      "character": "Male Customer"
    },
    {
      "id": "nm6481128",
      "name": "Lucien Bergeron",
      "character": "Urinal Man"
    },
    {
      "id": "nm3145825",
      "name": "Francis Vachon",
      "character": "Taxi Driver"
    },
    {
      "id": "nm6481129",
      "name": "Jeehye Jung",
      "character": "Kate's Model"
    },
    {
      "id": "nm3605009",
      "name": "Chris Wilding",
      "character": "Designer Imitating Kate"
    },
    {
      "id": "nm3907801",
      "name": "Moe Jeudy-Lamour",
      "character": "Security Guard #1       (as Moe Jeudy Lamour)"
    },
    {
      "id": "nm3810859",
      "name": "Matt Langton",
      "character": "Security Guard #2"
    }
  ],
  "overview": "After the Ball, a retail fairy tale set in the world of fashion. Kate's dream is to design for couturier houses. Although she is a bright new talent, Kate can't get a job. No one trusts the daughter of Lee Kassell, a retail guru who markets clothes \"inspired\" by the very designers Kate wants to work for. Who wants a spy among the sequins and stilettos? Reluctantly, Kate joins the family business where she must navigate around her duplicitous stepmother and two wicked stepsisters. But with the help of a prince of a guy in the shoe department her godmother's vintage clothes and a shocking switch of identities, Kate exposes the evil trio, saves her father's company -- and proves that everyone can wear a fabulous dress.",
  "storyline": "After the Ball, a retail fairy tale set in the world of fashion. Kate's dream is to design for couturier houses. Although she is a bright new talent, Kate can't get a job. No one trusts the daughter of Lee Kassell, a retail guru who markets clothes \"inspired\" by the very designers Kate wants to work for. Who wants a spy among the sequins and stilettos? Reluctantly, Kate joins the family business where she must navigate around her duplicitous stepmother and two wicked stepsisters, but with help from a prince of a guy in the shoe department, a god-brotherly gay pal in the design office, her godmother's vintage clothes, and a shocking switch of identities, Kate exposes the evil trio, saves her father's company, and proves that everyone can wear a fabulous dress.",
  "plot": "Oakland Athletics general manager Billy Beane is upset by his team's loss to the New York Yankees in the 2001 postseason. With the impending departure of star players Johnny Damon, Jason Giambi, and Jason Isringhausen to free agency, Beane needs to assemble a competitive team for 2002, but must overcome Oakland's limited payroll.\n\nDuring a visit to the Cleveland Indians, Beane meets Peter Brand, a young Yale economics graduate with radical ideas about how to assess players' value. Beane tests Brand's theory by asking whether he would have drafted him (out of high school), Beane having been a Major League player before becoming general manager. Though scouts considered Beane a phenomenal prospect, his career in the Major Leagues was disappointing. After some prodding, Brand admits that he would not have drafted him until the ninth round and surmised that Beane would probably have accepted a scholarship to Stanford instead. Impressed, Beane hires the inexperienced Brand to be the Athletics assistant general manager.\n\nOakland team scouts are first dismissive and then hostile towards Brand's non-traditional sabermetric approach to scouting players. Most notably, Grady Fuson aggressively confronts Beane, causing him to be fired. Grady then takes to the radio airwaves and doubts the team's future. Rather than relying on the scouts' experience and intuition, Brand selects players based almost exclusively on their on-base percentage (OBP). Beane signs the ones Brand suggests, such as unorthodox submarine pitcher Chad Bradford, past-his-prime outfielder David Justice, and injured Scott Hatteberg. Beane also faces opposition from Art Howe, the Athletics' manager, who does not agree with the new philosophy. With tensions already high between the two due to a contract dispute, Howe disregards Beane's and Brand's strategy and plays a lineup he prefers.\n\nEarly in the season, the Athletics fare poorly, leading critics to dismiss the new method as a failure. Beane convinces the owner to stay the course. He trades away the lone traditional first baseman, Carlos Peña, to force Howe to use Hatteberg at that position, threatening to make similar deals if Howe won't cooperate. The A's win 19 consecutive games, tying for the longest winning streak in American League history. Beane's young daughter implores him to go to a game against the Kansas City Royals, where Oakland is already leading 11–0 after the third inning and appears set to win a record-breaking 20th game in a row. Like many baseball players, Beane is superstitious and avoids games in progress, but upon hearing how well the game is going on the radio, he decides to go. Beane arrives in the fourth inning, only to watch the team falter and eventually allow the Royals to even the score at 11. Finally, the A's do win, on a walk-off home run by Hatteberg.\n\nAfter celebrating that, however, the A's again lose in the postseason, this time to the Minnesota Twins. Beane is disappointed, believing nothing short of a championship should be considered a success. He is contacted by the owner of the Boston Red Sox, who realizes that the sabermetric model is the future of baseball. Beane declines an opportunity to be GM of the Red Sox, despite the $12.5 million salary, which would have made him the highest-paid general manager in sports history. He returns to Oakland, while an epilogue reveals that two years later, the Red Sox won the 2004 World Series, using the model pioneered by the Athletics.",
  "synopsis": null
}