{
  "imdb_id": "tt3797868",
  "tmdb_id": "330483",
  "douban_id": null,
  "title": "The Choice (2016)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "111 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm0441839",
      "name": "Ross Katz"
    }
  ],
  "writer": [
    {
      "id": "nm1032743",
      "name": "Bryan Sipe",
      "description": "screenplay"
    },
    {
      "id": "nm0817023",
      "name": "Nicholas Sparks",
      "description": "novel"
    }
  ],
  "cast": [
    {
      "id": "nm0907548",
      "name": "Benjamin Walker",
      "character": "Travis"
    },
    {
      "id": "nm1954240",
      "name": "Teresa Palmer",
      "character": "Gabby"
    },
    {
      "id": "nm1192254",
      "name": "Maggie Grace",
      "character": "Steph"
    },
    {
      "id": "nm1275259",
      "name": "Alexandra Daddario",
      "character": "Monica"
    },
    {
      "id": "nm0929489",
      "name": "Tom Wilkinson",
      "character": "Shep"
    },
    {
      "id": "nm0919991",
      "name": "Tom Welling",
      "character": "Ryan"
    },
    {
      "id": "nm1842786",
      "name": "Jesse C. Boyd",
      "character": "Matt"
    },
    {
      "id": "nm2851132",
      "name": "Brad James",
      "character": "Ben"
    },
    {
      "id": "nm2713973",
      "name": "Noree Victoria",
      "character": "Liz"
    },
    {
      "id": "nm2738196",
      "name": "Anna Enger Ritch",
      "character": "Megan       (as Anna Enger)"
    },
    {
      "id": "nm7899930",
      "name": "Lou Lou Safran",
      "character": "Katie"
    },
    {
      "id": "nm6166740",
      "name": "Vance Griswold",
      "character": "Jesse"
    },
    {
      "id": "nm0723365",
      "name": "Brett Rice",
      "character": "Dr. McCarthy"
    },
    {
      "id": "nm2214493",
      "name": "Ashley LeConte Campbell",
      "character": "Maryanne McCarthy"
    },
    {
      "id": "nm0085994",
      "name": "Sharon Blackwood",
      "character": "Cora"
    },
    {
      "id": "nm0832303",
      "name": "Marty Stonerock",
      "character": "Alice Vandy"
    },
    {
      "id": "nm0783343",
      "name": "Diane Sellers",
      "character": "Jackie"
    },
    {
      "id": "nm0280409",
      "name": "Wilbur Fitzgerald",
      "character": "Mr. Holland"
    },
    {
      "id": "nm0924568",
      "name": "Callan White",
      "character": "Mrs. Holland"
    },
    {
      "id": "nm0445876",
      "name": "Brett Kelley",
      "character": "Steph's Fiancé"
    },
    {
      "id": "nm4424140",
      "name": "Caity Brewer",
      "character": "Pretty Girl"
    },
    {
      "id": "nm3307733",
      "name": "Lori Lail Marette",
      "character": "Woman"
    },
    {
      "id": "nm6904974",
      "name": "Sophia Grillo",
      "character": "Server"
    },
    {
      "id": "nm0302975",
      "name": "Joseph Gallison",
      "character": "Distinguished Man       (as Joe Gallison)"
    },
    {
      "id": "nm1170125",
      "name": "Veda Wilson",
      "character": "Churchgoer"
    },
    {
      "id": "nm0341097",
      "name": "Simone Griffeth",
      "character": "Distinguished Woman"
    },
    {
      "id": "nm7899931",
      "name": "Bolt",
      "character": "Moby"
    },
    {
      "id": "nm7899932",
      "name": "Gracie",
      "character": "Molly"
    }
  ],
  "overview": "The Choice tells the story of a long love affair that begins when Travis Parker and Gabby Holland first met as neighbors in a small coastal town and end up pursuing a relationship that neither could have foreseen. It spans a decade and traces the evolution of a love affair that is ultimately tested by life’s most defining events.",
  "storyline": "In a small coastal town, the veterinarian Travis Shaw works with his father Shep and is very close to his beloved sister Steph. Travis is very successful with the women and dates Monica every now and then. When the resident Gabby Holland moves to the next door house, she initially believes he is a pretentious man. But when her boyfriend Ryan MacCarthy, who is fellow doctor in the same hospital where she works, needs to travel to another city, Gabby and Travis have a relationship and fall in love with each other. Out of the blue, Ryan returns and proposes to marry her. Now Gabby has to make a choice between her two loves.",
  "plot": "Travis Shaw is a playboy, living in small coastal town Wilmington, NC. He has an on-off relationship with Monica. His next door neighbor, Gabby Holland, is a medical student who is in a relationship with a fellow doctor, Ryan McCarthy. One night, after Travis holds a barbecue with his closest friends and sister, Steph, at his home, Gabby angrily goes over to Travis' home to complain about the loud music, and how his dog, Moby, might have impregnated her dog, Molly, to which Travis denies but proposes she visit the veterinary clinic with Molly.\n\nGabby visits the veterinary clinic the next day, only to find out that Travis works there as a veterinarian, and that his father owns and runs the clinic as well. Travis and Gabby start to bond through home dinners and boat trips with Travis' friends and Steph, who also continually teases him about Gabby. Travis also helps Molly when she gives birth to 3 puppies in Gabby's home. With Ryan out of state overseeing a new hospital opening, Gabby and Travis end up spending more time together, starting a relationship.\n\nAs Ryan returns ahead of schedule and arranges a dinner between his parents and Gabby, Travis sees them having dinner and walks over to their table to say hi, and as he leaves, Gabby runs after Travis and they argue about what their relationship really meant during Ryan's absence. Travis declares his love for Gabby multiple times, however Gabby replies by saying she does not know what she want. Unsure of her feelings, Gabby tells Travis that their relationship wasn't necessarily serious and ends up accepting Ryan's marriage proposal, while Travis gets back together with Monica.\n\nAfter some time, Monica breaks up with Travis telling him that she knows about him and Gabby, and that he should fight for her because they love each other. Travis rushes to the hospital, only to find out from Ryan that Gabby has left, breaking off her engagement with Ryan, following which Ryan punches Travis out of anger. Travis then drives over to Gabby's family home to find her, and after mistakenly confessing his love to an elderly couple he had thought to be Gabby's parents (while Gabby's parents are standing right behind Travis), Gabby's parents encourage Travis to propose to Gabby, to Gabby's surprise. Gabby's mother gives Travis Gabby's grandmother's ring, to which he uses to propose to Gabby, who finally says yes.\n\nThey marry and over the course of the next few years, Travis and Gabby have a son and a daughter and become a happy family.\n\nOne evening during a storm, after a dinner to which Travis has failed to show up again due to a work emergency at the clinic, Gabby drives back home extremely sad to be stood up again and is involved in a terrible car accident. She survives but is now in a coma. Travis is wrecked with guilt and has to make the choice, whether or not to take her off life support as was stated in her wishes. Steph, now married and pregnant as well, finds Travis talking to his mother's grave and tells him to follow his heart no matter what other people say.\n\nOne night, a bad storm nearly destroys their home, and the next morning, Travis goes through the wreckage of the storm, looking for the wind chime which Gabby hung on her home porch. The next morning, he sees Moby stuck on a wooden platform in the lake, and when he goes to get Moby, Moby indicates he has found the wind chime stuck on the wooden platform. Travis then collects wooden parts from the wreckage, and goes to his island to build a small gazebo at the spot where he and Gabby once sat, looking at the moon and stars. Travis hangs the wind chime on the gazebo. As he sits there, the wind chime suddenly starts to ring loudly against the wind, and Travis rushes back to the hospital, fearing the worst. As he arrives in Gabby's hospital room, he enters to see that Gabby has awakened from her coma, and tell him 'You're late.'\n\nTravis takes Gabby home where she is welcomed by their two children, and Steph's newborn child. To make up for missing their dinner date, Travis prepares a romantic dinner in the front yard where as the children are cooking dinner, Gabby tells Travis that she heard everything he said when she was in the coma, and that he saved her. The last shot is of Travis and Gabby, with their two children sitting on the porch on the island, looking up at the moon and stars.",
  "synopsis": "The film opens seven years prior to the current events in the story. Travis Shaw (Benjamin Walker) is a charming young man from the south who appeals to all women, but he is casually seeing a woman named Monica (Alexandra Daddario).At night, Travis meets his new neighbor Gabby Holland (Teresa Palmer) when she complains about his music being too loud. She also complains that Travis's dog Moby has possibly knocked up her dog Molly. Gabby seems to be the only one that does not fall for Travis's charm, though his sister Stephanie (Maggie Grace) can see that he's interested.Gabby is a doctor at a hospital while Travis works with his father Dr. Shep (Tom Wilkinson) at the vet clinic. Shep can also see the awkward chemistry between them.Travis and Monica are at a fair together and run into Gabby and her boyfriend Ryan (Tom Welling). Travis is visibly displeased.Over time, Travis and Gabby develop a friendship as he brings her along with his friends on their trips by the lake. Travis helps Gabby when Molly has her puppies while Ryan is away on a trip. Gabby attends church with Travis where Shep is preaching. He later talks to Gabby about how this day would have been his wife's 57th birthday. She died of cancer when Travis was 14, and Shep turned to God after the event.Gabby goes over to Travis's home as they discuss what to do with the puppies. They start to bicker with one another, annoyed at each other but with an obvious sexual tension. Quickly, the two cannot hide their attraction for one another, and they begin to kiss and eventually make love for the first time.Ryan eventually returns from his trip and goes back to spending time with Gabby, leaving Travis upset. He tells Gabby how much he loves her but knows he cannot separate her and Ryan. Gabby writes a letter to Travis saying that she told Ryan about the affair and that he angrily broke it off with her but then proposed. Meanwhile, Monica tells Travis she knows how he feels about Gabby, and while she is upset, she knows he must still go after what his heart wants.Travis goes to Gabby's home and asks her parents for their blessing. The two seem pleased to consider Tom as a son-in-law, but nobody listens to what Gabby has to say in regards to the situation. Her mom gives Travis a ring that belonged to Gabby's grandmother, and Travis proposes with it. Gabby says no and he keeps asking and asking until she relents and says yes.Travis and Gabby are married, and they have two kids over the next seven years. However, Travis has been busy with work lately and has missed a few dates. On one such date night, Gabby leaves the restaurant after thinking Travis stood her up. Her car is struck by another on the road, leaving her in a coma. Travis is told that he has 90 days to let Gabby wake up or she may never recover and may be forced off life support. This leaves Travis with a difficult choice.Travis visits Gabby frequently at the hospital and reaffirms his love for her continuously. He receives support from Stephanie and their dad, but Travis worries that he will lose Gabby for good.One afternoon, Travis takes his boat out on the lake. He goes by the lake house and sees the wind chimes blowing. Somehow, this encourages him to run to the hospital where he sees that Gabby is awake. He goes to his wife and kisses her.Travis sets up an outdoor dinner to make it up to Gabby for missing their last date. She tells him she heard every word he said to her about how much he loves her. Travis jokes that if Moby never made a move on Molly, they never would have met.The film ends with Travis and Gabby taking their kids by the lake to stare up at the moon."
}