{
  "imdb_id": "tt3715320",
  "tmdb_id": "282984",
  "douban_id": null,
  "title": "Irrational Man (2015)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm0000095",
      "name": "Woody Allen"
    }
  ],
  "writer": [
    {
      "id": "nm0000095",
      "name": "Woody Allen",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0001618",
      "name": "Joaquin Phoenix",
      "character": "Abe Lucas"
    },
    {
      "id": "nm1297015",
      "name": "Emma Stone",
      "character": "Jill Pollard"
    },
    {
      "id": "nm1369571",
      "name": "Joe Stapleton",
      "character": "Professor"
    },
    {
      "id": "nm7437351",
      "name": "Nancy Carroll",
      "character": "Professor"
    },
    {
      "id": "nm7437352",
      "name": "Allison Gallerani",
      "character": "Braylin Student"
    },
    {
      "id": "nm6617420",
      "name": "Brigette Lundy-Paine",
      "character": "Braylin Student"
    },
    {
      "id": "nm7437353",
      "name": "Katelyn Semer",
      "character": "Braylin Student"
    },
    {
      "id": "nm0014483",
      "name": "Betsy Aidem",
      "character": "Jill's Mother"
    },
    {
      "id": "nm0680392",
      "name": "Ethan Phillips",
      "character": "Jill's Father"
    },
    {
      "id": "nm3284401",
      "name": "Jamie Blackley",
      "character": "Roy"
    },
    {
      "id": "nm7437354",
      "name": "Leah Anderson",
      "character": "Student Giving Directions"
    },
    {
      "id": "nm0687560",
      "name": "Paula Plum",
      "character": "College President"
    },
    {
      "id": "nm0318481",
      "name": "Nancy Giles",
      "character": "President's Assistant"
    },
    {
      "id": "nm0833225",
      "name": "Henry Stram",
      "character": "Cocktail Party Guest"
    },
    {
      "id": "nm4801913",
      "name": "Geoff Schuppert",
      "character": "Cocktail Party Guest"
    },
    {
      "id": "nm0000205",
      "name": "Parker Posey",
      "character": "Rita Richards"
    },
    {
      "id": "nm0677680",
      "name": "Robert Petkoff",
      "character": "Paul Richards"
    },
    {
      "id": "nm6828209",
      "name": "Alex Dunn",
      "character": "Student in Classroom"
    },
    {
      "id": "nm5977057",
      "name": "Ron Chez",
      "character": "Professor in Cafeteria"
    },
    {
      "id": "nm0382671",
      "name": "Tamara Hickey",
      "character": "Professor in Cafeteria"
    },
    {
      "id": "nm0902394",
      "name": "Sophie von Haselberg",
      "character": "April"
    },
    {
      "id": "nm4101208",
      "name": "Ben Rosenfield",
      "character": "April's Friend"
    },
    {
      "id": "nm3402816",
      "name": "Michael Goldsmith",
      "character": "April's Friend"
    },
    {
      "id": "nm4770294",
      "name": "Lindsey McWhorter",
      "character": "April's Friend"
    },
    {
      "id": "nm2993517",
      "name": "Meredith Hagner",
      "character": "April's Friend"
    },
    {
      "id": "nm6811849",
      "name": "Jaime Rosenstein",
      "character": "April's Friend       (as Jamie Rosenstein)"
    },
    {
      "id": "nm1581522",
      "name": "Susan Pourfar",
      "character": "Carol"
    },
    {
      "id": "nm1675596",
      "name": "Gary Wilmes",
      "character": "Carol's Friend"
    },
    {
      "id": "nm0048379",
      "name": "David Aaron Baker",
      "character": "Carol's Friend"
    },
    {
      "id": "nm3494672",
      "name": "Nancy Villone",
      "character": "Carol's Friend"
    },
    {
      "id": "nm3515533",
      "name": "Christine Mascott",
      "character": "Waitress"
    },
    {
      "id": "nm0447376",
      "name": "Tom Kemp",
      "character": "Judge Thomas Spangler"
    },
    {
      "id": "nm6828210",
      "name": "Britt Faulkner",
      "character": "Student in Classroom"
    },
    {
      "id": "nm0713720",
      "name": "Marina Re",
      "character": "Amusement Park Attendant"
    },
    {
      "id": "nm0686042",
      "name": "David Pittu",
      "character": "Faculty Meeting Professor"
    },
    {
      "id": "nm0954397",
      "name": "Mark Zeisler",
      "character": "Radio Announcer"
    },
    {
      "id": "nm1348981",
      "name": "Adrienne Taylor",
      "character": "Cellist"
    },
    {
      "id": "nm0071416",
      "name": "Tina Benko",
      "character": "TV Announcer"
    },
    {
      "id": "nm6656179",
      "name": "Kate McGonigle",
      "character": "Ellie Tanner"
    },
    {
      "id": "nm10533807",
      "name": "Nate Luis Silva",
      "character": "College student"
    }
  ],
  "overview": "On a small town college campus, a philosophy professor in existential crisis gives his life new purpose when he enters into a relationship with his student.",
  "storyline": "A new philosophy professor arrives on a small town campus near Newport, Rhode Island. His name, Abe Lucas. His reputation : bad. Abe is said to be a womanizer and an alcoholic. But what people do not know is that he is a disillusioned idealist. Since he has become aware of his inability to change the world, he has indeed been living in a state of deep nihilism and arrogant desperation. In class, he only goes through the motions and outside he drinks too much. But as far as sex is concerned, he is just a shadow of himself now: depression is not synonymous with Viagra! For all that, he can't help being attracted to one of his students, pretty and bright Jill Pollard. He enters into a relationship with her which remains platonic, even if Jill would not say no to more. The situation remains unchanged for a while until, one day, in a diner, Abe and Jill surprise a conversation that will change the course of their lives dramatically...",
  "plot": "At the small-town fictional New England college campus of Braylin, philosophy professor Abe Lucas (Joaquin Phoenix) is experiencing an existential crisis and is depressed to the point of drinking excessively. Despite this, he immediately catches the eye of two women: chemistry professor Rita Richards (Parker Posey), and Jill Pollard (Emma Stone), one of his students. Jill has a serious boyfriend and lives with her parents. Rita is apparently married and living with her husband. Abe chooses to sleep with Rita but is careful to have only a platonic relationship with Jill. Abe's depression becomes even more apparent when he fails to have an erection during his first sexual experience with Rita.\n\nAt lunch, Abe and Jill overhear a conversation; a woman says she will lose her children in a custody battle because of a seemingly unethical judge in family court. Abe is troubled by the injustice and, without telling Jill, decides to help the woman by murdering the judge. Abe reasons he's unlikely to be caught because he isn't involved in the case and, therefore, won't be suspected. Abe steals a key to the college's chemistry lab from Rita where he procures cyanide. He then discovers one of the judge's routines: an early morning jog followed by sipping a cup of orange juice on a bench in the local park. Abe puts the poison in an identical cup and exchanges the cups surreptitiously on the bench while the judge is reading a newspaper. He subsequently dies from cyanide poisoning. Abe feels reborn upon learning of the judge's death. He tells himself that he has finally done something worthwhile with his life by ridding the world of one evil man. Consequently, his mood improves dramatically. Abe and Jill's friendship then blossoms into a romance but Jill says nothing to her boyfriend, Roy (Jamie Blackley). However, Roy strongly suspects Jill is in love with Abe and breaks up with her.\n\nDespite Abe's careful planning, Jill and Rita, who are friendly, begin to suspect Abe's involvement in the murder after piecing together a few clues, such as the missing key and Abe's unexpected presence in the chemistry lab where a student spotted him. Rita decides that even if he is guilty, she wants to leave her husband and live with Abe in Europe, something Abe had been planning to do after the murder. Consumed with curiosity, Jill enters Abe's house through an open window while he's out and finds incriminating notes.\n\nJill confronts Abe and accuses him of the murder. Abe then admits his guilt and explains his motive. Jill decides to break off their relationship but promises not to turn him in. However, after an innocent man is accused of the crime, she presses Abe to go to the police, warning him that otherwise she will report him. Abe, who has only recently started enjoying life, is determined to stay out of jail. He attempts to kill Jill by pushing her into an elevator shaft, but he stumbles backward and falls down the shaft instead, dying instantly. Jill then begins repairing her life. Her first step is to reconcile with Roy.\n\nThe film ends with Jill gazing out to sea while standing on a beach and reflecting on her experiences with Abe.",
  "synopsis": null
}