{
  "imdb_id": "tt3797142",
  "tmdb_id": "292191",
  "douban_id": null,
  "title": "Bachelor Night (2014)",
  "genres": [
    "Comedy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "88 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.4,
  "director": [
    {
      "id": "nm3965248",
      "name": "Maximilian Elfeldt"
    },
    {
      "id": "nm4535705",
      "name": "Jeff Newman"
    }
  ],
  "writer": [
    {
      "id": "nm3965248",
      "name": "Maximilian Elfeldt",
      "description": "screenplay"
    },
    {
      "id": "nm3764663",
      "name": "Brian Misakian",
      "description": "screenplay"
    },
    {
      "id": "nm4535705",
      "name": "Jeff Newman",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm3700198",
      "name": "Andrew Bongiorno",
      "character": "Adrian"
    },
    {
      "id": "nm6455550",
      "name": "Skyler Yeast",
      "character": "Derek"
    },
    {
      "id": "nm1850901",
      "name": "Phillip Andre Botello",
      "character": "Frank"
    },
    {
      "id": "nm4390445",
      "name": "Lenny Hernandez",
      "character": "Mitchell"
    },
    {
      "id": "nm5363540",
      "name": "Heather Paige Cohn",
      "character": "Sienna"
    },
    {
      "id": "nm4953520",
      "name": "Samantha Stewart",
      "character": "Casey"
    },
    {
      "id": "nm4611003",
      "name": "Melissa Mensah",
      "character": "Amber"
    },
    {
      "id": "nm6161985",
      "name": "Anna Beletzki",
      "character": "Tatyana"
    },
    {
      "id": "nm3163113",
      "name": "Megan Albertus",
      "character": "Amanda"
    },
    {
      "id": "nm0409529",
      "name": "Louis Iacoviello",
      "character": "Boslov"
    },
    {
      "id": "nm2731219",
      "name": "Michael Ark",
      "character": "Dmitri"
    },
    {
      "id": "nm0512182",
      "name": "Amy Lindsay",
      "character": "Mary"
    },
    {
      "id": "nm0714560",
      "name": "Jeff Rector",
      "character": "Jack Rabbit"
    },
    {
      "id": "nm4535705",
      "name": "Jeff Newman",
      "character": "Bartender"
    },
    {
      "id": "nm3714882",
      "name": "Shawn Rougeron",
      "character": "Providence"
    },
    {
      "id": "nm4131336",
      "name": "Rachel Alig",
      "character": "Lauren"
    },
    {
      "id": "nm6346453",
      "name": "Magdalena Tcherno",
      "character": "Sue"
    },
    {
      "id": "nm6710783",
      "name": "Charlotte Richards",
      "character": "Officant"
    },
    {
      "id": "nm3163300",
      "name": "Angelica Ng",
      "character": "Alex"
    },
    {
      "id": "nm1273748",
      "name": "James Kwong",
      "character": "Officer 2 /              Male Stripper"
    },
    {
      "id": "nm4135437",
      "name": "Vincent van Hinte",
      "character": "Manager Wedding Chapel"
    },
    {
      "id": "nm6710784",
      "name": "Julie Abate",
      "character": "Background stripper"
    },
    {
      "id": "nm6710785",
      "name": "Sean Alston",
      "character": "Background person"
    },
    {
      "id": "nm6710786",
      "name": "Rose Anzuree",
      "character": "Background stripper"
    },
    {
      "id": "nm6710787",
      "name": "Brandon Baker",
      "character": "Background person"
    },
    {
      "id": "nm6169865",
      "name": "Tim Crowe",
      "character": "Background"
    },
    {
      "id": "nm6710788",
      "name": "Kristle Dayton",
      "character": "Background person"
    },
    {
      "id": "nm6710789",
      "name": "Diana Diaz",
      "character": "Background person"
    },
    {
      "id": "nm4387733",
      "name": "Ben Eisen",
      "character": "Background person"
    },
    {
      "id": "nm1834432",
      "name": "Sarah Fowlie",
      "character": "Background person"
    },
    {
      "id": "nm6382416",
      "name": "Dina Freberg",
      "character": "Background person"
    },
    {
      "id": "nm2512972",
      "name": "Laurie Giles",
      "character": "Background person"
    },
    {
      "id": "nm5464634",
      "name": "David Glick",
      "character": "Background person"
    },
    {
      "id": "nm6710790",
      "name": "Sara Grace",
      "character": "Background person"
    },
    {
      "id": "nm6710791",
      "name": "Amberly Hall",
      "character": "Background person"
    },
    {
      "id": "nm5056321",
      "name": "Patrick Jemerigbe",
      "character": "Background person"
    },
    {
      "id": "nm6710792",
      "name": "Patrick Francis Kalaau",
      "character": "Background person"
    },
    {
      "id": "nm2762342",
      "name": "Canon Kelly",
      "character": "Background person"
    },
    {
      "id": "nm6710793",
      "name": "Lauren Kelly",
      "character": "Background person"
    },
    {
      "id": "nm4571850",
      "name": "Mariah Kraft",
      "character": "Background person"
    },
    {
      "id": "nm6936468",
      "name": "Evan Michael Lee",
      "character": "Background person"
    },
    {
      "id": "nm4958033",
      "name": "Vanessa Sheri",
      "character": "Stripper"
    }
  ],
  "overview": "When a bachelor party and a bachelorette party cross paths in Vegas, only the best man and maid of honor can save their friends from a night of epic \"mistakes.\"",
  "storyline": "When a bachelor party and a bachelorette party cross paths in Vegas, only the best man and the maid of honor can save their friends from a night of epic \"mistakes.\"",
  "plot": "Jimmie Shannon (Chris O'Donnell) wants to be a bachelor forever: a wild 'Mustang', free and never tied down. Eventually though, after three years he proposes to his girlfriend Anne (Renée Zellweger), in the most romantic restaurant in town—only he spoils the special occasion with a very crude approach. Anne is going to Greece for an assignment when Jimmie discovers his crazy and heavily grouchy grandfather James Shannon (Peter Ustinov) has died and left him the family business, all his assets, and $100 million. But Jimmie can only have it if he is married by 6:05 p.m. on his 30th birthday, which happens to be the next day. He, his friend Marco (Artie Lange), and his grandfather's two friends and colleagues (Ed Asner and Hal Holbrook) must find a bride in the next few hours. With a priest (James Cromwell) in tow, they begin.\n\nJimmie proposes to Anne again, but she is able to see his core reticence, and leaves for Greece. Jimmie, unable to give up inheriting the money due to the lives that would be ruined if the family business closes, decides to pursue ex-girlfriends to propose to. Meanwhile, Anne has second thoughts and returns to her apartment, which she shares with her sister Natalie (Marley Shelton). Natalie talks Anne into going home to go visit their parents in Napa for the night.\n\nJimmie, on his desperate quest, opens a shoebox full of photos of old girlfriends, and begins to track them down one by one. First he sees Stacey (Rebecca Cross), an oil futures trader, who, as it turns out, is engaged already. Second is Zoe (Stacy Edwards), a clingy window dresser. When Jimmie goes to see her, just after promising he'd never leave her for another woman, he runs off after a woman in the street whom he thinks is Anne (which turns out not to be). He returns to find Zoe has set a mannequin on fire in effigy of him. He also strikes out with a melodramatic opera singer (Mariah Carey) and a tough-as-nails cop (Jennifer Esposito). Soon his list is depleted, but his last choice accepts— brittle, chain-smoking socialite Buckley (Brooke Shields), who detests Jimmie but wants his money to prop up her waning family fortune. As the priest tries to conduct the ceremony, she gradually learns the other conditions of the will: she and Jimmie must have children within five years, spend no more than one night apart per month, and need to stay married for at least ten years. Horrified, she drives off in a convertible.\n\nAnne misses Jimmie and heads back to the city. Trying to locate Jimmie, she calls Marco to arrange dinner with Jimmie. Desperate, Marco had earlier placed an ad for a bride in the newspaper. He figures a few women will show up at the appointed time and church for the offer.\n\nAs everyone scrambles to help Jimmie save the family business, Jimmie realizes the \"effect\" of marriage, as the kindly priest reveals how he took on the priesthood after his beloved wife died, and that he was proud to be married and produce a wonderful family in the process.\n\nRealizing that he truly loves Anne and is ready to 'take the plunge', Jimmie, after being up all night, rests in the church where Marco had promised to deliver a bride. He awakens to find hundreds of women dressed as brides waiting for him. After trying to settle the women down, Marco lies and says it was all a prank. This angers them, and they try to rip the two men to shreds. Marco reveals that Anne is on her way back, so Jimmie flees to the train station, ordering a cake on the way. He makes it there after being chased by hundreds of 'brides'. He finds Anne in the train, but she has discovered a newspaper with its front page asking, \"Would you marry this man for $100 million?\" with Jimmie's picture beside. She is upset, but he professes his love for her and they reconcile.\n\nNatalie finds a discarded wedding dress in the station, and Anne puts it on in the bathroom. She opens the door to see hundreds of would-be brides run past, chasing Jimmie. Jimmie flees through the streets of San Francisco. He eventually climbs up a flight on a fire escape ladder and shouts for Anne, as the would-be brides gather en masse below. The priest begins to conducts the ceremony over a loudspeaker from inside a police car, causing many 'brides' to attack the car, and chaos ensues. Anne, in the crowd, makes her way through and up to Jimmie. Natalie yells at everybody to \"Shut up!\". Anne convinces the other women to be happy and let it be her day.\n\nThe priest finishes the ceremony by pronouncing them husband and wife, to cheers from all, and Jimmie and Anne kiss. She then tosses her bouquet into the teeming crowd below.",
  "synopsis": null
}