{
  "imdb_id": "tt3731562",
  "tmdb_id": "293167",
  "douban_id": null,
  "title": "Kong: Skull Island (2017)",
  "genres": [
    "Action",
    "Adventure",
    "Fantasy",
    "Sci-Fi"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "118 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm3611349",
      "name": "Jordan Vogt-Roberts"
    }
  ],
  "writer": [
    {
      "id": "nm0319659",
      "name": "Dan Gilroy",
      "description": "screenplay and"
    },
    {
      "id": "nm1440919",
      "name": "Max Borenstein",
      "description": "screenplay"
    },
    {
      "id": "nm0309691",
      "name": "John Gatins",
      "description": "story and"
    },
    {
      "id": "nm0319659",
      "name": "Dan Gilroy",
      "description": "story"
    },
    {
      "id": "nm0178260",
      "name": "Merian C. Cooper",
      "description": "original story &"
    },
    {
      "id": "nm0908624",
      "name": "Edgar Wallace",
      "description": "original story"
    }
  ],
  "cast": [
    {
      "id": "nm1089991",
      "name": "Tom Hiddleston",
      "character": "James Conrad"
    },
    {
      "id": "nm0000168",
      "name": "Samuel L. Jackson",
      "character": "Preston Packard"
    },
    {
      "id": "nm0488953",
      "name": "Brie Larson",
      "character": "Mason Weaver"
    },
    {
      "id": "nm0000604",
      "name": "John C. Reilly",
      "character": "Hank Marlow"
    },
    {
      "id": "nm0000422",
      "name": "John Goodman",
      "character": "Bill Randa"
    },
    {
      "id": "nm3659660",
      "name": "Corey Hawkins",
      "character": "Houston Brooks"
    },
    {
      "id": "nm0651159",
      "name": "John Ortiz",
      "character": "Victor Nieves"
    },
    {
      "id": "nm1320897",
      "name": "Tian Jing",
      "character": "San"
    },
    {
      "id": "nm1527905",
      "name": "Toby Kebbell",
      "character": "Jack Chapman /              Kong"
    },
    {
      "id": "nm4207146",
      "name": "Jason Mitchell",
      "character": "Mills"
    },
    {
      "id": "nm0924154",
      "name": "Shea Whigham",
      "character": "Cole"
    },
    {
      "id": "nm3287038",
      "name": "Thomas Mann",
      "character": "Slivko"
    },
    {
      "id": "nm3082341",
      "name": "Eugene Cordero",
      "character": "Reles"
    },
    {
      "id": "nm1476601",
      "name": "Marc Evan Jackson",
      "character": "Landsat Steve"
    },
    {
      "id": "nm4311291",
      "name": "Will Brittain",
      "character": "Young Marlow /              Marlow's Son"
    },
    {
      "id": "nm2032193",
      "name": "Miyavi",
      "character": "Gunpei Ikari"
    },
    {
      "id": "nm0420955",
      "name": "Richard Jenkins",
      "character": "Senator Willis"
    },
    {
      "id": "nm2085100",
      "name": "Allyn Rachel",
      "character": "Secretary O'Brien"
    },
    {
      "id": "nm0853079",
      "name": "Robert Taylor",
      "character": "Athena Captain"
    },
    {
      "id": "nm0175415",
      "name": "James M. Connor",
      "character": "General Ward       (voice) (as James Michael Connor)"
    },
    {
      "id": "nm3042755",
      "name": "Thomas Middleditch",
      "character": "Jerry       (voice)"
    },
    {
      "id": "nm1004776",
      "name": "Brady Novak",
      "character": "Base Guard"
    },
    {
      "id": "nm2463498",
      "name": "Peter Karinen",
      "character": "Chinook Pilot"
    },
    {
      "id": "nm2460943",
      "name": "Brian Sacca",
      "character": "Chinook Co-Pilot"
    },
    {
      "id": "nm1554650",
      "name": "Joshua Funk",
      "character": "Seismic Soldier"
    },
    {
      "id": "nm0540409",
      "name": "Daniel F. Malone",
      "character": "Boat Captain       (as Daniel Malone)"
    },
    {
      "id": "nm8530579",
      "name": "Glenn 'Kiwi' Hall",
      "character": "Boat Captain"
    },
    {
      "id": "nm6711085",
      "name": "Garreth Hadfield",
      "character": "Crew Chief"
    },
    {
      "id": "nm7904436",
      "name": "Shannon Brimelow",
      "character": "Kamikaze Pilot"
    },
    {
      "id": "nm8169489",
      "name": "Jon Quested",
      "character": "Dead Pilot"
    },
    {
      "id": "nm5896273",
      "name": "Korey Williams",
      "character": "Sunglasses Pilot"
    },
    {
      "id": "nm1399960",
      "name": "Dat Phan",
      "character": "Bar Thug"
    },
    {
      "id": "nm5318271",
      "name": "Cynthy Wu",
      "character": "Thug's Girlfriend"
    },
    {
      "id": "nm0447925",
      "name": "Beth Kennedy",
      "character": "Marlow's Wife"
    },
    {
      "id": "nm3215060",
      "name": "Bryan Chojnowski",
      "character": "Chicago Taxi Driver"
    },
    {
      "id": "nm1024953",
      "name": "Terry Notary",
      "character": "Kong"
    }
  ],
  "overview": "Explore the mysterious and dangerous home of the king of the apes as a team of explorers ventures deep inside the treacherous, primordial island.",
  "storyline": "A washed up monster chaser convinces the U.S. Government to fund a trip to an unexplored island in the South Pacific. Under the guise of geological research, the team travels to \"Skull Island\". Upon arrival, the group discover that their mission may be complicated by the wildlife which inhabits the island. The beautiful vistas and deadly creatures create a visually stunning experience that is sure to keep your attention.",
  "plot": "In 1944, two pilots—one American and the other Japanese—parachute onto an island in the South Pacific after a dogfight. They both engage in close combat, with the Japanese pilot gaining the upper hand. All of a sudden, a large behemoth monster, interrupts the fight, causing both soldiers to flee.\n\nIn 1973, former British Special Air Service Captain James Conrad is hired by government agent Bill Randa to guide an expedition to map out \"Skull Island\". Randa also recruits the Sky Devils, a helicopter squadron led by Lieutenant Colonel Preston Packard (Samuel L. Jackson) and prominently made up of his right-hand, Major Jack Chapman and Captain Earl Cole to escort them to the island. The group is soon joined by pacifist photojournalist Mason Weaver, who plans to expose it believing it's a corrupt military op.\n\nArriving on Skull Island, Packard's men begin dropping explosives developed by seismologist Houston Brooks to determine if the ground is hollow, despite Conrad's objections. The helicopters are suddenly attacked by a 100 foot-tall bipedal gorilla known as \"Kong\", and many are destroyed, with the survivors split into two groups. The survivors' only hope for rescue is a resupply team that will meet them at the island's northern end in three days time. Randa reveals his affiliation to the secret government organization Monarch to Packard and the expedition's true purpose to acquire proof of the existence of forgotten monsters.\n\nPackard and his remaining men bury their dead comrades and begin searching for the missing members of the expedition, including Chapman. Along the way, they overcome an attacking Daddy long-legs. Meanwhile, Conrad, Weaver, Brooks, biologist San Lin, soldier Reg Slivko and Landsat employee Victor Nieves, among others, run into a large buffalo-like creature, discovering that Kong isn't the only monster that dwells on the island. The group then encounters the local Iwi natives and meet Hank Marlow, revealed to be the missing pilot who crash-landed on the island in 1944 with the Japanese pilot. Marlow explains that Kong is the island's guardian and is worshipped as a god by the natives for protecting them from the Skullcrawlers, reptilian underground monsters who have slaughtered Kong's ancestors, leaving him as the last of his kind. Marlow reveals Kong only attacked the helicopters to prevent the bombs from awakening the largest of the Skullcrawlers, the \"Big One\". Miles away, Chapman witnesses Kong wrestle and kill a large squid, causing him to flee into the woods, where he is eaten by a Skullcrawler.\n\nConrad's group sets off down the river in a boat recovered by Marlow, where they are beset by pterosaur-like creatures, killing Nieves. The survivors manage to connect with Packard, who insists on searching for Chapman. Marlow reluctantly leads both Conrad and Packard's team to the Forbidden Zone, a forgotten battleground between Kong's ancestors and Skullcrawlers. The same Skullcrawler that ate Chapman attacks the group, devouring Randa and killing many soldiers before Weaver kills it by triggering an explosion. A vengeful Packard blames Kong for the deaths of his men and retrieves seismic explosives to lure Kong into a trap and kill him, while Conrad resolves to lead the non-military personnel back to the boat so they can rendezvous with the resupply team.\n\nWhile scouting the path ahead, Conrad and Weaver encounter Kong up-close and personal, and resolve to save him, a sentiment that Marlow shares. Packard's trap incapacitates Kong, and he orders his men to set explosives around the fallen creature. Before he can finish the ape off, Conrad's group arrives and a standoff ensues. Conrad and Weaver convince the other soldiers to spare Kong, but Packard furiously refuses, now seeking vengeance for his fallen men. The group is suddenly attacked by the Big One, an Alpha Skullcrawler dubbed \"Ramarak\". The group flees, while Packard tries to detonate the explosives. Kong recovers and kills him. Injured, Kong is overpowered by Ramarak, who then chases the survivors as they race towards the shore. Cole is killed when his suicide attempt on Ramarak fails, cornering the humans in the process. Kong returns to rescue them and, aided by the humans, successfully kills Ramarak by ripping its gut out through its mouth. Weaver is violently thrown into a river by an explosion, but is then rescued by Kong. With the Skullcrawler defeated, Kong allows the surviving humans to leave. Sometime afterward, Marlow returns home and is reunited with his wife and meets his son for the first time.\n\nIn a post-credits scene, Conrad and Weaver are detained and interrogated by Monarch and Skull Island expedition survivors Brooks and Lin. They inform them that Kong is not the only monster to roam the world. They are then shown archive footage of cave paintings depicting Godzilla, Rodan, Mothra, and King Ghidorah.",
  "synopsis": "In the year 1944, somewhere over the South Pacific, Lieutenant Hank Marlow (Will Brittain) lands with his parachute on an island after his plane crashes. Another soldier, Gunpei Ikari (Miyavi), lands. Marlow draws his gun on Ikari and shoots but misses. Ikari takes out his gun and chases after Marlow. They run into the forest and fight when they go by a cliff. Ikari nearly impales Marlow with his sword, but Marlow pulls it away. Ikari then has Marlow on the ground and nearly kills him before a gigantic ape hand appears. The two men then see the ape (Terry Notary) rise above them.In 1973, in Washington D.C., government official Bill Randa (John Goodman) and geologist Houston Brooks (Corey Hawkins) arrive to meet with Senator Willis (Richard Jenkins) to receive funding for an expedition to a recently discovered location called Skull Island. Willis isn't too keen on the idea, but Randa goads him into relenting. Before leaving, Randa tells Willis he also would like a military escort.The Sky Devils squadron are gathered on their last day before they can finally go home. Led by Colonel Preston Packard (Samuel L. Jackson), they include Captain Earl Cole (Shea Whigham), Slivko (Thomas Mann), Reles (Eugene Cordero), Glenn Mills (Jason Mitchell), and Jack Chapman (Toby Kebell), who is Packard's right hand man. Packard receives the call for the expedition and gladly accepts the job.Randa and Brooks go to a bar and find a former British Special Air Service captain named James Conrad (Tom Hiddleston) to be their tracker. Conrad is confronted by two bar patrons who believe he cheated in a game of pool, but he easily subdues the men. Randa is immediately impressed, telling Brooks they've found their guide. Conrad sits with Randa and Brooks to hear their plan. When he hears their offer, he demands more money and points out that there's a good chance that the trip will get them killed for reasons involving severe weather conditions or predatory creatures.Inside a darkroom, anti-war photographer Mason Weaver (Brie Larson) is developing some photos she took of the conflict in Vietnam. She gets a call to join the expedition and she arrives at the base to meet with Packard and his men, plus a team of scientists from the company Landsat, including Brooks' fellow geologist San Lin (Jing Tian) and Landsat employees Victor Nieves (John Ortiz) and Steve (Marc Evan Jackson). Weaver has reservations about the mission and thinks the military is planning something bad. Brooks goes over the mission and what they hope to find on Skull Island.The team sails into the ocean before taking choppers to the island. They must pass through clouds that produce hurricane-like conditions but are able to find a high-pressure pocket that they believe will be a safer route. After a turbulent ride through the storm, the choppers fly across the area. Weaver takes some pictures while the soldiers begin dropping seismic charges into the ground, setting off explosions. Almost immediately, a tree is thrown through one of the choppers, sending it crashing to the ground. The team then sees Kong towering over them. He sends another tree through a chopper before grabbing a few more and smashing them into the ground. The surviving team members are separated once they hit the ground. Amidst the flames burning from the remains of the choppers, Packard stares up at Kong, who looks down back at him.Packard confronts Randa at gunpoint and demands to know what really brought them there. Randa admits that he had known about the existence of monsters like Kong for a while, and he is seeking proof for his organization, Monarch.Conrad, Weaver, Brooks, Lin, Slivko, and Nieves are grouped together while Randa, Packard, Mills, Cole, and other soldiers set out to look for Chapman, as he is equipped with enough ammunition that Packard intends to use against Kong. As the soldiers walk through a bamboo forest forest, one soldier suddenly stops, a bamboo tree has impaled him through the mouth. Above them is a giant spider that starts attacking them. Mills is pulled up by the webbing, and the rest of the soldiers start cutting its legs off. Mills cuts himself loose, and Packard shoots the spider to death.Chapman is by himself near a river. He sees Kong walking through the river to tend to a wound he sustained from the choppers' gunfire. Kong drinks from the river and then finds a giant octopus. He tangles with it, fighting off its tentacles before he starts to eat it. He then drags the octopus carcass away.Conrad's group is cornered by a tribe of natives. As they try to defend themselves, out comes an older Marlow (now played by John C. Reilly). He assures both groups that they are not harmful to each other and then invites the group past the wall. Marlow explains to the group that he's been there for the last 28 years and has learned a lot about the natives and the island itself. Kong is like a god to them, as he has been protecting them from the creatures that dwell beneath the earth and have been killing off the natives for centuries, as well as Kong's own family. Marlow calls them \"Skull Crawlers\". They stayed underground until the explosions from the seismic charges woke them up. If anything happens to Kong, the Skull Crawlers will dominate the island. He also suggests that the Skull Crawlers that have come to the surface are just juveniles and that a much larger one exists.Still alone, Chapman walks through the forest and sits on a log. The log turns out to be a giant insect. Chapman shoots at it, but the creature does not retaliate. As the creature leaves, Chapman is killed by a Skull Crawler.Conrad tells Marlow that they plan to make it to their rendezvous point on the north side of the island within three days so that they may be rescued. Marlow says that it cannot be done in three days on foot, so he agrees to guide them the right way. He bids the natives farewell and takes the crew on a boat. Shortly after riding away, Nieves is snatched up by carnivorous birds and is torn apart midair.Along the way, Weaver sees a huge water buffalo stuck under a crashed chopper. She tries lifting it up to free the buffalo, only for Kong to show up and pull the chopper off. He stares down at Weaver briefly and leaves. She appears more awed by him than terrified.Marlow leads the group into The Forbidden Zone, which is a former battleground between Kong's ancestors and the Skull Crawlers. The enormous remains of Kong's family lie among the field. A Skull Crawler appears, forcing the group to hide. The Skull Crawler then spits out Chapman's skull and dog tags, which Conrad notices. Packard and his men come around the same area. Randa is taking pictures and is then snatched up and eaten by a Skull Crawler. Another beast shows up and starts to attack and pull victims in with its tongue. The groups continue their battle with the Skull Crawlers plus a wave of the carnivorous birds. Marlow takes out the sword that belonged to Ikari and slashes through several of the birds before handing it over to Conrad. Weaver kills one by tossing a lighter into a hole that produces fumes, which is ignited and sets the creature on fire.After the fight, they regroup. Packard is still set on looking for Chapman. Conrad shows Packard Chapman's dog tags to confirm his demise. Still, Packard wants to look for Chapman's ammunition stash so that they can kill Kong; he is hellbent on revenge for the deaths of his men, despite the objections of Marlow, Conrad, and Weaver.That night, Packard gathers explosives and lays a trap for Kong. Meanwhile, Conrad and Weaver encounter the beast, but Weaver approaches him cautiously. She places her hand on his face and he is gentle. However, Packard lures Kong toward him and ignites the fuel along the water, singeing and burning Kong's fur. Kong stomps on Steve and kills another man in the chaos before collapsing. Packard then gets ready to set off some explosives, but Conrad and Weaver try to stop him. They convince the other soldiers that they need Kong to keep the Skull Crawlers out. The soldiers turn on Packard, who remains defiant. Just then, the biggest Skull Crawler bursts out of the ground, forcing the group to run. Packard stays behind to detonate the explosives, but Kong crushes him under his fist.The survivors then head toward the shore as the main Skull Crawler pursues them. Cole stays behind to sacrifice himself with the explosive devices he has strapped to himself. However, the monster tail-whips Cole into a wall and he blows up anyway. The Skull Crawler heads toward the group until Kong returns and smashes into the beast. Kong uses a ship's propeller attached to a length of anchor chain to would the beast, finally slashing it on the throat. The best isn't dead and attacks again. Weaver takes a flare gun and hits the Skull Crawler in the face with it. Kong grabs the Skull Crawler and hurls him into the wall, accidentally knocking Weaver into the river. Kong pulls Weaver out and still fights the Skull Crawler. He rams his fist down the monster's throat and pulls out its guts. Kong then places Weaver down next to Conrad before leaving.Shortly after, the survivors (Conrad, Weaver, Marlow, Brooks, Lin, Mills, Slivko, and Reles) depart on the boat, and three choppers show up to get them. In the distance, Kong keeps a lookout to continue protecting his territory. He pounds his fist and lets out a roar.As the credits begin, we see video footage of Marlow finally returning home to Chicago where he sees his wife again and finally meets his adult son. He then sits down to watch a Cubs game with a hot dog and a beer.After the credits, Conrad and Weaver are being held in an interrogation room by Monarch. Entering the room are Brooks and Lin, who tell the two that Kong was never the only monster out there and that this world did not always belong to humankind. Brooks pulls out some files, including a map of Tokyo, before putting on a slideshow. The slides show another crew coming across cave drawings of other monsters - Mothra, King Ghidorah, Rodan and Godzilla himself. The last thing we hear are the combined roars of Kong and Godzilla."
}