{
  "imdb_id": "tt3754976",
  "tmdb_id": "285841",
  "douban_id": null,
  "title": "Elephant Song (2014)",
  "genres": [
    "Drama"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "110 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm0082748",
      "name": "Charles Binamé"
    }
  ],
  "writer": [
    {
      "id": "nm3888232",
      "name": "Nicolas Billon",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0339304",
      "name": "Bruce Greenwood",
      "character": "Dr. Toby Greene"
    },
    {
      "id": "nm0230859",
      "name": "Xavier Dolan",
      "character": "Michael Aleen"
    },
    {
      "id": "nm0005251",
      "name": "Carrie-Anne Moss",
      "character": "Olivia"
    },
    {
      "id": "nm0618960",
      "name": "Guy Nadon",
      "character": "Dr. Craig Jones"
    },
    {
      "id": "nm0272173",
      "name": "Colm Feore",
      "character": "Dr. James Lawrence"
    },
    {
      "id": "nm0001416",
      "name": "Catherine Keener",
      "character": "Nurse Susan Peterson"
    },
    {
      "id": "nm6532883",
      "name": "Gianna Corbisiero",
      "character": "Florence Da Costa"
    },
    {
      "id": "nm1120797",
      "name": "Cindy Sampson",
      "character": "Christelle"
    },
    {
      "id": "nm0206479",
      "name": "Larry Day",
      "character": "Sergeant Taylor"
    },
    {
      "id": "nm6532880",
      "name": "Melody Godin-Cormier",
      "character": "Amy Greene"
    },
    {
      "id": "nm6532882",
      "name": "Mark Donker",
      "character": "Jakobus Aleen       (as Marc Donker)"
    },
    {
      "id": "nm0390775",
      "name": "Matt Holland",
      "character": "Bruce"
    },
    {
      "id": "nm10267362",
      "name": "Enrique Pérez-Mesa",
      "character": "Marcus"
    },
    {
      "id": "nm10267363",
      "name": "Ethan Bolduc",
      "character": "Michael, 5 Years Old"
    },
    {
      "id": "nm10267364",
      "name": "Germano Santana",
      "character": "Michael, 7 Years Old"
    },
    {
      "id": "nm10267365",
      "name": "Malluly Hernandez",
      "character": "Dresser"
    },
    {
      "id": "nm10267366",
      "name": "Yurenia Martin",
      "character": "Dresser"
    },
    {
      "id": "nm10267367",
      "name": "Anthony Oseyeau",
      "character": "Phineas"
    },
    {
      "id": "nm0521688",
      "name": "Alison Louder",
      "character": "Sarah"
    },
    {
      "id": "nm10267368",
      "name": "Serge Tanguay",
      "character": "Humming Police"
    },
    {
      "id": "nm5452984",
      "name": "Rebecca Miville-Deschênes",
      "character": "Rachel"
    }
  ],
  "overview": "A psychiatrist is drawn into a complex mind game when he questions a disturbed patient about the disappearance of a colleague.",
  "storyline": "It's January, 1966 at St. Christina's Psychiatric Hospital in Northwestern Ontario. Dr. Toby Greene and Nurse Susan Peterson are individually being interviewed by Dr. Craig Jones, one of the hospital's administrators, about the incident that occurred just before Christmas, the day that their colleague, Dr. James Lawrence, inexplicably did not show up for work. As Dr. Lawrence disappeared the day before during a session with one of his regular patients, a young man named Michael Aleen, the belief among some is that Michael may have had something to do with Dr. Lawrence's disappearance. That day, Dr. Greene took over Dr. Lawrence's patient-load, which included a session with Michael to try and discover if he indeed had some nefarious role in Dr. Lawrence's disappearance. Dr. Greene did not know Michael at all, and was unable to read his case file before meeting with Michael. Regardless, Dr. Greene believed he could read Michael and glean as much from his lies as from his truths. ...",
  "plot": "Toby Green (Bruce Greenwood), an independent psychiatrist who is gradually drawn into a psychological mind game by Michael (played by Xavier Dolan), whom he is interviewing about the disappearance of Green's colleague Dr. Lawrence (Colm Feore). Michael, a disturbed young man, the son of an opera singer and a distant father he has only seen once, has an aura of charm about himself and displays signs of rationality and intelligence that draws the doctor deeper into the plot despite warnings by nurse Susan Peterson (Catherine Keener) to keep a distance from the patient.\n\nDr. Green is assigned to investigate Michael's involvement as Michael draws the doctor into his plot by convincing him not to read his files, but rather form his own opinion based on what Michael has to offer in explanations. Michael continues revealing his troubled experiences with parents. The elephant connection is from his sole meeting with his father in a nature reserve, when the father kills an elephant in front of his son. The incident traumatizes the very young Michael, as does his mother's cold attitude and her distancing herself from him for a singing career. Michael claimed he \"killed his mother\" by refusing to call an ambulance for her and instead sang to her the \"elephant song\" until she died on the floor.\n\nMichael discusses the circumstances of his forced stay in the hospital, hinting at improper doctor-patient relationships involving him and his supervising doctor, and a bizarre love-hate relationship with the head nurse Susan Peterson. Michael's ploys also include an attempt to negotiate his early release from hospital in return to divulging the circumstances of Dr. Lawrence's disappearance. Dr. Lawrence surfaces alive after the note he left is delivered to Dr. Green, and Michael convinces the investigating doctor to hand him a box of chocolates as reward. Strongly allergic to chocolate, Michael dies in the hands of the doctor and the head nurse after eating several. Adrenaline shots and resuscitation attempts fail to save Michael's life.",
  "synopsis": "An eminent psychiatrist vanishes from his office; the last person to see him is a troubled patient named Michael. The hospital director, Dr Greene, is called in to interview Michael. Miss Peterson, the head nurse, understands all too well the devastating loss that still haunts Dr Greene and warns him to steer clear of this particular patient to no avail. Michael prattles on about elephants and opera (with the occasional hint of murder and foul play) and lures the hospital director into a devious trap. Dr Greenes redemption will come at a hefty price..."
}