{
  "imdb_id": "tt3735686",
  "tmdb_id": "340595",
  "douban_id": null,
  "title": "Women He's Undressed (2015)",
  "genres": [
    "Documentary",
    "Biography"
  ],
  "country": "Australia",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.0,
  "director": [
    {
      "id": "nm0000788",
      "name": "Gillian Armstrong"
    }
  ],
  "writer": [
    {
      "id": "nm0860367",
      "name": "Katherine Thomson",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0744778",
      "name": "Ann Roth",
      "character": "Herself"
    },
    {
      "id": "nm0000404",
      "name": "Jane Fonda",
      "character": "Herself"
    },
    {
      "id": "nm8162720",
      "name": "Marc Eliot",
      "character": "Himself"
    },
    {
      "id": "nm8162719",
      "name": "Eric Sherman",
      "character": "Himself"
    },
    {
      "id": "nm4428491",
      "name": "William J. Mann",
      "character": "Himself, movie historian"
    },
    {
      "id": "nm0552039",
      "name": "Catherine Martin",
      "character": "Herself"
    },
    {
      "id": "nm0157319",
      "name": "David Chierichetti",
      "character": "Himself"
    },
    {
      "id": "nm0540795",
      "name": "Leonard Maltin",
      "character": "Himself"
    },
    {
      "id": "nm0618966",
      "name": "Deborah Nadoolman",
      "character": "Herself       (as Deborah Nadoolman Landis)"
    },
    {
      "id": "nm0929452",
      "name": "Michael Wilkinson",
      "character": "Himself"
    },
    {
      "id": "nm0057199",
      "name": "Kym Barrett",
      "character": "Herself"
    },
    {
      "id": "nm8162717",
      "name": "Larry McQueen",
      "character": "Himself"
    },
    {
      "id": "nm0041181",
      "name": "Colleen Atwood",
      "character": "Herself"
    },
    {
      "id": "nm0001450",
      "name": "Angela Lansbury",
      "character": "Herself"
    },
    {
      "id": "nm5572898",
      "name": "Scotty Bowers",
      "character": "Himself, author of 'Full Service: My Adventures in Hollywood and the Secret Sex Lives of the Stars'"
    },
    {
      "id": "nm8552001",
      "name": "Jean H. Mathison",
      "character": "Herself, William Haines' longtime assistant"
    },
    {
      "id": "nm8162718",
      "name": "Barbara Warner Howard",
      "character": "Herself"
    },
    {
      "id": "nm4254181",
      "name": "June Dally-Watkins",
      "character": "Herself"
    },
    {
      "id": "nm8552002",
      "name": "Jane Gosden",
      "character": "Herself"
    },
    {
      "id": "nm0650673",
      "name": "Orry-Kelly",
      "character": "Himself       (archive footage)"
    },
    {
      "id": "nm8162716",
      "name": "Janet Fowler",
      "character": "Herself"
    },
    {
      "id": "nm0319696",
      "name": "Darren Gilshenan",
      "character": "Orry-Kelly"
    },
    {
      "id": "nm0447992",
      "name": "Deborah Kennedy",
      "character": "Florence Kelly"
    },
    {
      "id": "nm2167513",
      "name": "Louis Alexander",
      "character": "Young Orry"
    },
    {
      "id": "nm0940346",
      "name": "David E. Woodley",
      "character": "William Kelly"
    },
    {
      "id": "nm4375415",
      "name": "Nathaniel Middleton",
      "character": "The Lover"
    },
    {
      "id": "nm0185123",
      "name": "Lara Cox",
      "character": "Ginger Rogers"
    },
    {
      "id": "nm7277821",
      "name": "Kelly Ann Doll",
      "character": "Showgirl       (as Kelly-Ann Doll)"
    },
    {
      "id": "nm0283801",
      "name": "Laurie Foell",
      "character": "Nurse"
    },
    {
      "id": "nm0562792",
      "name": "Ted Maynard",
      "character": "Jack Warner       (voice)"
    },
    {
      "id": "nm0188766",
      "name": "Jeanette Cronin",
      "character": "Bette Davis       (voice)"
    },
    {
      "id": "nm0178833",
      "name": "Tyler Coppin",
      "character": "Walter Plunkett /              Jimmy Fidler /              Sergeant       (voice)"
    },
    {
      "id": "nm0330765",
      "name": "Sandy Gore",
      "character": "Hedda Hopper /              Louella Parsons       (voice)"
    },
    {
      "id": "nm6397058",
      "name": "Paige Walker",
      "character": "Kay Francis       (voice)"
    },
    {
      "id": "nm0687120",
      "name": "Louella Pleffer",
      "character": "Glamorous Girl"
    },
    {
      "id": "nm2301323",
      "name": "Gracie Otto",
      "character": "Glamorous Girl"
    },
    {
      "id": "nm2691266",
      "name": "Gillian Cooper",
      "character": "Glamorous Girl"
    },
    {
      "id": "nm7132190",
      "name": "Madelyn Beckett",
      "character": "Glamorous Girl"
    },
    {
      "id": "nm7277823",
      "name": "Natasha Gammell",
      "character": "Glamorous Girl"
    },
    {
      "id": "nm6331820",
      "name": "Anna Cahill",
      "character": "Glamorous Girl"
    },
    {
      "id": "nm7277825",
      "name": "Jessica Power",
      "character": "Glamorous Girl"
    },
    {
      "id": "nm7277826",
      "name": "Anna Horton",
      "character": "Glamorous Girl"
    },
    {
      "id": "nm7309526",
      "name": "Pavarotti",
      "character": "Orry's Dog"
    },
    {
      "id": "nm0000026",
      "name": "Cary Grant",
      "character": "Himself       (archive footage)"
    },
    {
      "id": "nm0912491",
      "name": "Jack L. Warner",
      "character": "Himself       (archive footage)"
    }
  ],
  "overview": "Women He's Undressed is a cinema length documentary that explores the life of Australia's most prolific costume designer. Until now Orry-Kelly has been unacknowledged in his country of birth and pretty well forgotten in the adopted country of his greatest success. During the boom years of Hollywood he was the costume designer on an astonishing 282 motion pictures. He designed for the stars like Marilyn Munroe, Bette Davis, Humphrey Bogart, Rosalind Russell, Errol Flynn and many more of the immortals. His films included Some Like It Hot, Casablanca, An American in Paris and Now, Voyager. Orry-Kelly (Jack to his friends) won three Academy Awards and was nominated for a fourth. Orry-Kelly was Head of Warner Brothers Costume Department during the richest period of American film, the establishment of the dream factory and its effect on mass culture. He was outrageous, witty, outspoken, a drinker and uncompromising but he survived partially protected by his friendship with Jack and Ann.",
  "storyline": "Women He's Undressed is a cinema length documentary that explores the life of Australia's most prolific costume designer. Until now Orry-Kelly has been unacknowledged in his country of birth and pretty well forgotten in the adopted country of his greatest success. During the boom years of Hollywood he was the costume designer on an astonishing 282 motion pictures. He designed for the stars like Marilyn Monroe, Bette Davis, Humphrey Bogart, Rosalind Russell, Errol Flynn and many more of the immortals. His films included Some Like It Hot, Casablanca, An American in Paris and Now, Voyager. Orry-Kelly (Jack to his friends) won three Academy Awards and was nominated for a fourth. Orry-Kelly was Head of Warner Brothers Costume Department during the richest period of American film, the establishment of the dream factory and its effect on mass culture. He was outrageous, witty, outspoken, a drinker and uncompromising but he survived partially protected by his friendship with Jack and Ann ...",
  "plot": "The film focuses on the March sisters: beautiful Meg (Trini Alvarado), tempestuous Jo (Winona Ryder), tender Beth (Claire Danes), and romantic Amy (Kirsten Dunst), who are growing up in Concord, Massachusetts during and after the American Civil War. With their father away fighting in the war, the girls struggle with major and minor problems under the guidance of their strong-willed mother, affectionately called Marmee (Susan Sarandon). As a means of escaping some of their problems, the sisters revel in performing in romantic plays written by Jo in their attic theater.\n\nLiving next door to the family is wealthy Mr. Laurence (John Neville), whose grandson Theodore, nicknamed \"Laurie\" (Christian Bale), moves in with him and becomes a close friend of the March family, particularly Jo. Mr. Laurence becomes a mentor for Beth, whose exquisite piano-playing reminds him of his deceased daughter, and Meg falls in love with Laurie's tutor John Brooke (Eric Stoltz).\n\nMr. March is wounded in the war and Marmee is called away to nurse him. While Marmee is away, Beth contracts scarlet fever from a neighbor's infant. Awaiting Marmee's return, Meg and Jo send Amy away to live in safety with their Aunt March. Prior to Beth's illness, Jo had been Aunt March's companion for several years, and while she was unhappy with her position she tolerated it in the hope her aunt one day would take her to Europe. When Beth's condition worsens, Marmee is summoned home and nurses her to recovery just in time for Christmas. Mr. Laurence gives his daughter's piano to Beth, Meg accepts John Brooke's proposal and Mr. March surprises his family by returning home from the war.\n\nFour years pass; Meg and John marry, and Beth's health is deteriorating steadily. Laurie graduates from college, proposes to Jo and asks her to go to London with him, but realizing she thinks of him more as a big brother than a romantic prospect, she refuses his offer. Jo later deals with the added disappointment that Aunt March has decided to take Amy, who is now sixteen (and now played by Samantha Mathis), with her to Europe instead of her. Crushed, Jo departs for New York City to pursue her dream of writing and experiencing life. There she meets Friedrich Bhaer (Gabriel Byrne), a German professor who challenges and stimulates her intellectually, introduces her to opera and philosophy, and encourages her to write better stories than the lurid Victorian melodramas she has penned so far.\n\nIn Europe, Amy is reunited with Laurie. She is disappointed to find he has become dissolute and irresponsible and scolds him for pursuing her merely to become part of the March family. In return, he bitterly rebukes her for courting one of his wealthy college friends in order to marry into money. He leaves Amy a letter asking her to wait for him while he works in London for his grandfather and makes himself worthy of her.\n\nJo is summoned home to see Beth, who finally dies of the lingering effects of scarlet fever that have plagued her for the past four years. Grieving for her sister, Jo retreats to the comfort of the attic and begins to write her life story. Upon its completion, she sends it to Professor Bhaer. Meanwhile, Meg gives birth to twins Demi and Daisy.\n\nA letter from Amy informs the family Aunt March is too ill to travel, so Amy must remain in Europe with her. In London, Laurie receives a letter from Jo in which she informs him of Beth's death and mentions Amy is in Vevey, unable to come home. Laurie immediately travels to be at Amy's side. They finally return to the March home as husband and wife, much to Jo's surprise and eventual delight.\n\nAunt March dies and she leaves Jo her house, which she decides to convert into a school. Professor Bhaer arrives with the printed galley proofs of her manuscript but when he mistakenly believes Jo has married Laurie he departs to catch a train to the West, where he is to become a teacher. Jo runs after him and explains the misunderstanding. When she begs him not to leave, he proposes marriage and she happily accepts.",
  "synopsis": null
}