{
  "imdb_id": "tt3734466",
  "tmdb_id": "270593",
  "douban_id": null,
  "title": "How Old Are You? (2014)",
  "genres": [
    "Drama"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "122 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm1754432",
      "name": "Roshan Andrews"
    }
  ],
  "writer": [
    {
      "id": "nm1332681",
      "name": "Sanjay",
      "description": null
    },
    {
      "id": "nm5392515",
      "name": "Bobby Sanjay",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0913097",
      "name": "Manju Warrier",
      "character": "Nirupama"
    },
    {
      "id": "nm0090283",
      "name": "Kunchacko Boban",
      "character": ""
    },
    {
      "id": "nm6446330",
      "name": "Amritha Anil",
      "character": "Lekshmi"
    },
    {
      "id": "nm1701016",
      "name": "Kaniha",
      "character": "Susan       (as Kanika)"
    },
    {
      "id": "nm0018203",
      "name": "Lalu Alex",
      "character": ""
    },
    {
      "id": "nm7600010",
      "name": "Sethu Lakshmi",
      "character": "Madhaviyamma"
    },
    {
      "id": "nm4265894",
      "name": "Vinay Forrt",
      "character": "Jayachandran"
    },
    {
      "id": "nm1434433",
      "name": "Idavela Babu",
      "character": ""
    },
    {
      "id": "nm3397660",
      "name": "Sudheer Karamana",
      "character": ""
    },
    {
      "id": "nm7896538",
      "name": "Vaishak Uthaman",
      "character": "IT Staff"
    },
    {
      "id": "nm2241427",
      "name": "Suraaj Venjarammoodu",
      "character": "Benny"
    }
  ],
  "overview": "36 year-old Nirupama Rajeev (played by Manju Warrier) is an UD clerk in Revenue Department. The role of her husband is played by Kunchaka Boban. There is nothing interesting about her life as she leads a life which is determined by her usual daily activities. The movie focusses on the society's obsession with the age and how individual's ability is overlooked by the fact how old he or she is.",
  "storyline": "A lady rediscovers her lost charisma for the good of the society overcoming strong odds from a patriarchal society.",
  "plot": "The story is centered on a 36-year-old character named Nirupama Rajeev (Manju Warrier) who works as a UD clerk in the Revenue Department. Her husband is Rajeev Narayanan (Kunchako Boban) who works at Akashavaani and aspires of migrating to Ireland, but Nirupama can't accompany him as most Irish companies turn down her job applications. There is nothing interesting about her life; she leads a normal life but craves for a change.\n\nOne fine day, she gets an invitation from the President and gets summoned to the IG's office and learns that the President of India would like to have a conversation with her. Unfortunately, Nirupama faints in-front of the President and the meeting turns out to be a disaster. Post this, she becomes the laughing stock on Facebook. Nirupama is then faced with an issue of being criticized by her family members. Later Nirupama gets in a situation where she has to watch her husband and daughter fly to Ireland.\n\nSusan David (Kanika), her old classmate, a successful business woman, reminds her of the woman she used to be and inspires her to rediscover her younger self. Nirupama then explains her situation, when she met the president, to the social medias and clears her name. Her inability to rise up to her daughter's expectations and the discomfiture of her husband being mistaken for her younger brother further troubles her. Nirupama had a habit of having a vegetable garden on her roof, without the usage of chemicals or pesticides. One day Nirupama visits an old woman whom she would meet everyday on her bus. Both of them don't even know their names, and when she gets to know that the woman is sick, Nirupama turns up at her house with her own vegetable. The old woman thanks her for the time she spent for her and for reminding that she is not alone in this world. News of her pure vegetables spreads via the neighbor of the sick woman. In between, Nirupama's daughter calls her to Ireland, but she hesitates as she has lots of work left to be done. Her vegetables are asked for a wedding. For this Nirupama encourages all her neighbors to cultivate vegetables on their rooftops as well, which turns out to be a huge success. Her friend Susuan david encourages her into a seminar with important people as audience. Her topic of biofarming influenced all the officials and gives her the job of making it a reality. Once again the President meets her and family.\n\nThe meeting turned out to be a successful one. The transformation of her character from a depressed woman to a steady and sprightly lady is almost predictable. 'How old are you' leaves behind a sharp note to its audience. Near the end of the story, Nirupama reminds her husband to expect only what is given to her.",
  "synopsis": null
}