{
  "imdb_id": "tt3788392",
  "tmdb_id": "292625",
  "douban_id": null,
  "title": "The Swimmers (2014)",
  "genres": [
    "Drama",
    "Horror"
  ],
  "country": "Thailand",
  "version": [
    {
      "runtime": "115 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.9,
  "director": [
    {
      "id": "nm1637163",
      "name": "Sophon Sakdaphisit"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm5036210",
      "name": "Chutavuth Pattarakampol",
      "character": "Perth"
    },
    {
      "id": "nm6642812",
      "name": "Supassra Thanachat",
      "character": "Ice"
    },
    {
      "id": "nm6642813",
      "name": "Thanapob Leeratanakajorn",
      "character": "Tan"
    },
    {
      "id": "nm6912032",
      "name": "Violette Wautier",
      "character": "Mint"
    }
  ],
  "overview": "After falling pregnant to Perth, her boyfriend's best friend, Ice commits suicide. She returns to haunt Perth while Tan seeks out the person who made her kill herself for his own revenge.",
  "storyline": "After falling pregnant to Perth, her boyfriend's best friend, Ice commits suicide. She returns to haunt Perth while Tan seeks out the person who made her kill herself for his own revenge.",
  "plot": "On a sunny day in an affluent suburb in Connecticut, a fit and tanned middle-aged man in a bathing suit, Ned Merrill (Burt Lancaster), drops by a pool party being held by old friends, the Westerhazys. They offer him a cocktail while nursing hangovers from the night before. As they share stories, Ned realizes that there is a series of swimming pools that form a \"river\" to his house, making it possible for him to \"swim\" his way home. Ned dives into the pool, emerging at the other end and beginning his journey. Ned's behavior perplexes his friends, who know things about his recent past he seems to have forgotten.\n\nAs Ned travels he encounters other neighbors. He meets 20-year-old Julie (Janet Landgard), who used to babysit his daughter, and reveals his idea to her; she joins him. Together, they have several experiences, including crashing another pool party and sipping champagne. While chatting in the forest, Julie reveals that she had a schoolgirl crush on Ned, who begins talking about how he will protect her, making plans for the two of them. Discomfited, Julie runs away.\n\nThe neighborhood is full of judgmental, well-heeled people intent on one-upsmanship, and Ned continues to be confused by hints that his life might not be as he believes it.\n\nNed meets a wealthy older couple, unbothered by his eccentric behavior but also unimpressed by his posturing, and a lonely young boy with whom Ned spends a short time. He fails to make any real connection with the people he meets, being obsessed with his journey, and becoming increasingly out of touch with reality.\n\nNed carries on with his plan. He walks into another party where the hostess, who seems to have had a past encounter with him, playfully calls him a \"party crasher\". He encounters there a bubbly girl, Joan (Joan Rivers), who does not know him. Ned asks her to join him, and Joan is intrigued until she is warned off by a friend. Ned jumps into the pool, grabbing the attention of the guests. When he gets out of the water, he notices a cart that used to be his, being used to serve hot dogs. Ned gets into a spat with the homeowner, who claims to have bought it at a white elephant sale.\n\nNed then shows up at the backyard pool of Shirley Abbott (Janice Rule), a stage actress with whom he had an affair several years earlier. His warm memories of their time together are not in agreement with her own experience of having been \"the other woman\". Unable to reconcile his feelings with the pain he has caused, Ned wades into the deep end of the pool.\n\nNed continues on, winding up at a crowded public swimming pool. He is confronted by local shopkeepers who ask him \"How do you like our water?\" and ask him when he will settle his unpaid bills. When some of them let loose vicious comments about his wife's snobbish tastes and his out-of-control daughter's recent troubles with the law, it is too much for Ned and he flees.\n\nNear sunset, a shivering, limping Ned staggers home, as rain pours down, and finds his house locked and deserted. Peering in through a window, he sees that it has been emptied of furniture, and appears to have been abandoned for some time.",
  "synopsis": null
}