{
  "imdb_id": "tt3741316",
  "tmdb_id": "333091",
  "douban_id": null,
  "title": "Bare (2015)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.9,
  "director": [
    {
      "id": "nm3399862",
      "name": "Natalia Leite"
    }
  ],
  "writer": [
    {
      "id": "nm3399862",
      "name": "Natalia Leite",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm1872698",
      "name": "Dianna Agron",
      "character": "Sarah Barton"
    },
    {
      "id": "nm0209289",
      "name": "Paz de la Huerta",
      "character": "Pepper"
    },
    {
      "id": "nm3024712",
      "name": "Chris Zylka",
      "character": "Haden"
    },
    {
      "id": "nm2106801",
      "name": "Louisa Krause",
      "character": "Lucille Jacobs"
    },
    {
      "id": "nm6746846",
      "name": "Mary Price Moore",
      "character": "Linda Barton"
    },
    {
      "id": "nm2962702",
      "name": "Alexandra Roxo",
      "character": "Ginger"
    },
    {
      "id": "nm1254942",
      "name": "Lora Martinez-Cunningham",
      "character": "Jaz"
    },
    {
      "id": "nm5608908",
      "name": "Kelly Pittman",
      "character": "Diana"
    },
    {
      "id": "nm1763493",
      "name": "Travis Hammer",
      "character": "Billy"
    },
    {
      "id": "nm6661047",
      "name": "Kelley Lewallen",
      "character": "Jenny"
    },
    {
      "id": "nm3287985",
      "name": "Luis Bordonada",
      "character": "Carlos"
    },
    {
      "id": "nm6661048",
      "name": "Anthony Michael Jarvis",
      "character": "Jack"
    },
    {
      "id": "nm3265070",
      "name": "James Burnett",
      "character": "Casey"
    },
    {
      "id": "nm0737276",
      "name": "Hank Rogerson",
      "character": "John Woodley"
    },
    {
      "id": "nm0307267",
      "name": "J.D. Garfield",
      "character": "Terry"
    },
    {
      "id": "nm0715765",
      "name": "Robyn Reede",
      "character": "Dairy Dream Manager"
    },
    {
      "id": "nm2358563",
      "name": "Hugh Elliot",
      "character": "Club Patron"
    },
    {
      "id": "nm2636838",
      "name": "Jesus Jr.",
      "character": "Bouncer"
    },
    {
      "id": "nm0366890",
      "name": "Luce Rains",
      "character": "Travis"
    },
    {
      "id": "nm8035080",
      "name": "Laura Scaccia",
      "character": "Janae"
    },
    {
      "id": "nm6761062",
      "name": "Mocha Blackshear",
      "character": "Mocha       (as Ciera Ramirez Blackshear)"
    },
    {
      "id": "nm3914897",
      "name": "Bonnie Bell",
      "character": "Suzy Barton"
    },
    {
      "id": "nm0226867",
      "name": "Lori Dillen",
      "character": "Pam"
    },
    {
      "id": "nm2287032",
      "name": "Dave Colon",
      "character": "Trucker"
    },
    {
      "id": "nm0218716",
      "name": "Christopher Dempsey",
      "character": "Business Man"
    },
    {
      "id": "nm3628707",
      "name": "Carlos Telles",
      "character": "Police Officer"
    },
    {
      "id": "nm6661150",
      "name": "Allie Sundstrom",
      "character": "Lucille's Cousin"
    },
    {
      "id": "nm5743785",
      "name": "William Bolt",
      "character": "Supertown Manager"
    },
    {
      "id": "nm3639205",
      "name": "Michael Graves",
      "character": "Grandpa"
    },
    {
      "id": "nm6850309",
      "name": "Signe Pierce",
      "character": "Internet Star"
    },
    {
      "id": "nm7085525",
      "name": "Tom Fleming",
      "character": "Video Narrator"
    },
    {
      "id": "nm6043752",
      "name": "Yvette Fazio-Delaney",
      "character": "Dancer"
    },
    {
      "id": "nm8035081",
      "name": "Alexandra Flores",
      "character": "Dancer"
    },
    {
      "id": "nm6448556",
      "name": "Valentina Hart",
      "character": "Dancer"
    }
  ],
  "overview": "A young woman's friendship with a drug-dealing drifter evolves into a lesbian romance.",
  "storyline": "A young girl in Nevada becomes romantically involved with a female drifter who introduces her to a life of stripping, drugs, and metaphysical experiences that teach her what happens when real life catches up with dark fantasy.",
  "plot": "Sarah Barton lives in a small Nevada desert town with her mother and works as a cashier. After a coworker's complaint causes her to lose her job, she meets Pepper, a drifter who has crashed at an antiques store owned by her family. Intrigued by Pepper, Sarah allows her to stay at the store until she can find somewhere else. Sarah begins hanging out with Pepper and becomes drawn into Pepper's partying lifestyle, to the annoyance of her boyfriend, Haden, who does not understand why she has so little time for him. Haden offers to get her a job where he works and to let her stay with him, but she declines both offers.\n\nOn a trip to Reno, Sarah follows along as Pepper cons a gambler into giving them money to play blackjack. After celebrating their winnings, Pepper reveals that she works at a strip club as a bartender. Sarah initially takes a job at a fast food restaurant but soon tries out for the strip club instead. The strippers laugh when Sarah suggests that Pepper is a bartender. One of the strippers gives Sarah a free sample of an unspecified drug, and Sarah goes out on the stage. After Sarah and Pepper ingest peyote in the desert, Pepper admits that stripping is addictive and difficult to stop, as the money is good. The two women promise each other that either will quit if the other does. The two then confess their attraction to each other and have sex.\n\nHaden and Sarah's other friends become worried about her, as she has kept her new life secret from them. Sarah breaks up with Haden, telling him that they have gone in separate directions. When the other strippers tell Sarah that Pepper has worked in the past as a recruiter and seduced other women, Sarah becomes worried that she has been used. Pepper first denies everything but admits she has worked in the past as a recruiter; she still denies that she intentionally recruited Sarah or used her. After they reconcile, Sarah insists on paying off Pepper's debts so they can run away together and start over somewhere else.\n\nHowever, an altercation breaks out at the strip club when a man accuses Pepper of not paying back the full debt. Sarah intercedes on Pepper's behalf, only to panic when she sees Haden and another friend about the enter the club. As she attempts to slip out unnoticed, Haden discovers her and berates her. A cop, drawn by the earlier disturbance, breaks up the scene and arrests Sarah for possession of a controlled substance when she accidentally drops several drugs. Outed as both a stripper and drug-user, Sarah at first attempts to return to her friends but finds them too judgmental. After offering to pay back her mother for bailing her out, the two tearfully embrace. Sarah tells Pepper that she has tired of the lifestyle and can not continue, as it is counter to her values, then hitchhikes out of town by herself.",
  "synopsis": null
}