{
  "imdb_id": "tt3765892",
  "tmdb_id": "296121",
  "douban_id": null,
  "title": "Trophy Heads (2014)",
  "genres": [
    "Horror"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "87 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.9,
  "director": [
    {
      "id": "nm0023929",
      "name": "Charles Band"
    }
  ],
  "writer": [
    {
      "id": "nm0023929",
      "name": "Charles Band",
      "description": "original story"
    },
    {
      "id": "nm6532938",
      "name": "Roger Barron",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm6531142",
      "name": "Adam Noble Roberts",
      "character": "Max"
    },
    {
      "id": "nm1864017",
      "name": "Maria Olsen",
      "character": "Mom"
    },
    {
      "id": "nm0828288",
      "name": "Brinke Stevens",
      "character": "Herself"
    },
    {
      "id": "nm0218674",
      "name": "Darcy DeMoss",
      "character": "Herself"
    },
    {
      "id": "nm0522550",
      "name": "Jacqueline Lovell",
      "character": "Herself"
    },
    {
      "id": "nm0001643",
      "name": "Linnea Quigley",
      "character": "Linnea Quigley"
    },
    {
      "id": "nm0000292",
      "name": "Michelle Bauer",
      "character": "Herself"
    },
    {
      "id": "nm0240373",
      "name": "Denice Duff",
      "character": "Herself"
    },
    {
      "id": "nm3229438",
      "name": "Irena Murphy",
      "character": "Julia"
    },
    {
      "id": "nm0002340",
      "name": "Stuart Gordon",
      "character": "Stuart"
    },
    {
      "id": "nm0624594",
      "name": "Gregory Niebel",
      "character": "Casting Director"
    },
    {
      "id": "nm0835393",
      "name": "Carel Struycken",
      "character": "Brother Humphrey"
    },
    {
      "id": "nm0213374",
      "name": "Kristine DeBell",
      "character": "Sister Jasmine"
    },
    {
      "id": "nm0779255",
      "name": "Nihilist Gelo",
      "character": "Young Man at Park"
    },
    {
      "id": "nm0213983",
      "name": "David DeCoteau",
      "character": "Juicy Stand Customer"
    },
    {
      "id": "nm2625932",
      "name": "Amy Paffrath",
      "character": "Amy"
    },
    {
      "id": "nm3062739",
      "name": "Jean Louise O'Sullivan",
      "character": "Jean Louise"
    },
    {
      "id": "nm0606637",
      "name": "Jessica Morris",
      "character": "Jessica"
    },
    {
      "id": "nm1218053",
      "name": "Robin Sydney",
      "character": "Robin"
    },
    {
      "id": "nm5323054",
      "name": "Christopher Clausi",
      "character": "Extra"
    },
    {
      "id": "nm3701261",
      "name": "Graham Mackie",
      "character": "Extra"
    },
    {
      "id": "nm4190963",
      "name": "Matthew Gittelson",
      "character": "Extra"
    },
    {
      "id": "nm6116476",
      "name": "Michael York",
      "character": "Extra"
    },
    {
      "id": "nm4455382",
      "name": "Ron Schultz",
      "character": "Extra"
    },
    {
      "id": "nm0713522",
      "name": "Timothy L. Raynor",
      "character": "Extra"
    },
    {
      "id": "nm10876607",
      "name": "Owen Robert Mckenzie",
      "character": "Extra"
    }
  ],
  "overview": "An obsessed fan and his mother kidnap former 'scream queens' and force them to reenact their famous film roles...with deadly results.",
  "storyline": "It's the present day, and our heroines, real life Scream Queens who starred in those infamous movies back in the 80's and 90's, have gone on with their lives since those days, some still acting or in new businesses of their own. What none of them suspect is that somewhere, down in the basement of an old house, an obsessed fan, Max, sits in the dark, watching clips from those movies over and over, his obsession growing into a diabolical plan. One by one, with his mother's help, he begins to \"collect\" them, transporting them to a makeshift prison he's set up in his basement. The Scream Queens have no idea what's going on, until they find themselves forced to reenact movie scenes from their horror heyday, a nightmarish process since Max remembers every line and gesture and they haven't watched them in years. And they definitely don't remember the new and terrible outcome of the scenes...",
  "plot": "Chino (Derek Ramsay), a rich playboy, meets Lani (Cristine Reyes), a GI baby of a former prostitute, when he visits Angeles City for a bar hopping. During Chino and Lani’s whirlwind romance, Chino gets into a fight with a mayor’s son that leads his brother Sammy (John Estrada) to send him to America. Lani, with no knowledge of Chino’s departure to America, follows Chino to Manila to tell him about her pregnancy. Upon Lani’s visit, Sammy refuses Lani entry to their house. As Sammy leaves the house, not looking at the commotion Lani is causing outside his car, he instructs his driver to ignore Lani’s pleas and carry on driving. The driver accidentally bumps into Lani, causing her miscarriage.\n\nWith nothing else going on for her, Lani holds on to her American dream. Blessed with beauty and a whistle-bait figure, she plans to use these assets to inch her way toward advancing her social status, and subsequently, to plot vengeance against the brothers. Winning Ms. Body Beautiful and working as a joiner in a bar in Manila, Lani monitors the status of Chino and Sammy. Lani’s plot begins to unravel when the American Ambassador takes her to a society ball. As part of the elite, Sammy also attends the ball. Sammy instantly notices Lani’s smashing looks and gets smitten.\n\nMeanwhile, a homesick Chino in America finds comfort in his newfound friend, Gwen (Heart Evangelista). With Gwen’s attributes, Chino falls for Gwen in no time. One night, Chino receives a phone call from Sammy asking him to come back to Manila to meet his new sister-in-law. Chino, together with Gwen, excitedly heads back to Manila to be introduced to the new bride. Chino’s excitement turns into despair when he realizes that his new sister-in-law turns out to be Lani, the girl he abandoned.\n\nUnable to confess to Sammy and Gwen, Chino’s paranoia and Lani’s constant seduction create a rift between the two brothers. Little did Sammy and Chino know, the plot has been carefully planned by Lani and Gwen. Gwen is actually Lani’s long-lost sister who was adopted by a Filipino family in America. Gwen, who is trying to make up for their years apart, agrees to Lani’s plot. The pact between the two sisters becomes complicated, however, when Gwen slowly falls for Chino.\n\nLani feels betrayed by Gwen’s feelings for Chino, and promises to win Chino back. Lani succeeds. Sammy discovers the infidelity of his wife . Sammy’s violent streak surfaces as his jealousy turns to rage. He soon discovers the connivance of the sisters and takes Lani to a remote cabin to kill her.\n\nGwen learns from their mother about Lani’s miscarriage. She decides to tell Chino about Lani’s misfortune together with her secret as Lani’s long-lost sister. Realizing the absence of Sammy and Lani in the house, Chino and Gwen seek help from Sammy’s ex-wife. After they obtained vital information about the whereabouts of Sammy and Lani, Chino and Gwen head to the cabin to save Lani. Gwen and Chino find the cabin as Sammy is torturing Lani. Chino and Sammy wrestle for the gun. The unthinkable happens. Chino kills Sammy.\n\nChino faces trial and is found innocent. As he comes out of prison, Gwen waits for him. While Chino and Gwen start their new lives, Lani, who now inherits Sammy’s fortune, finally fulfills her American dream",
  "synopsis": null
}