{
  "imdb_id": "tt3774790",
  "tmdb_id": "332502",
  "douban_id": null,
  "title": "400 Days (2015)",
  "genres": [
    "Mystery",
    "Sci-Fi",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "91 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.5,
  "director": [
    {
      "id": "nm2470867",
      "name": "Matt Osterman"
    }
  ],
  "writer": [
    {
      "id": "nm2470867",
      "name": "Matt Osterman",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0746125",
      "name": "Brandon Routh",
      "character": "Theo"
    },
    {
      "id": "nm0176981",
      "name": "Dane Cook",
      "character": "Dvorak"
    },
    {
      "id": "nm2362068",
      "name": "Caity Lotz",
      "character": "Emily"
    },
    {
      "id": "nm1133651",
      "name": "Ben Feldman",
      "character": "Bug"
    },
    {
      "id": "nm0146915",
      "name": "Tom Cavanagh",
      "character": "Zell"
    },
    {
      "id": "nm0101198",
      "name": "Grant Bowler",
      "character": "Walter"
    },
    {
      "id": "nm1443641",
      "name": "Sally Pressman",
      "character": "Darla"
    },
    {
      "id": "nm0825209",
      "name": "Mark Steger",
      "character": "Creature"
    },
    {
      "id": "nm1792248",
      "name": "Fernanda Romero",
      "character": "Zia"
    },
    {
      "id": "nm1665054",
      "name": "Dominic Bogart",
      "character": "Sketch"
    },
    {
      "id": "nm0039149",
      "name": "Frank Ashmore",
      "character": "Garcia"
    },
    {
      "id": "nm4408860",
      "name": "Oz Kalvan",
      "character": "Sam"
    },
    {
      "id": "nm0517904",
      "name": "Iris Karina",
      "character": "Sara"
    },
    {
      "id": "nm1146612",
      "name": "Luke Barnett",
      "character": "Reporter"
    },
    {
      "id": "nm2896588",
      "name": "Sara Tomko",
      "character": "Reporter"
    },
    {
      "id": "nm1570753",
      "name": "Kim Estes",
      "character": "Reporter"
    },
    {
      "id": "nm0827309",
      "name": "Robert Lewis Stephenson",
      "character": "Reporter"
    },
    {
      "id": "nm3083465",
      "name": "Stevens Gaston",
      "character": "Correctional Officer"
    }
  ],
  "overview": "4 would be astronauts spend 400 days in a land locked space simulator to test the psychological effects of deep space travel but, when something goes terribly wrong and they are forced to leave the simulation, they discover that everything on earth has changed. Is this real or is the simulation on a higher level than they could have ever imagined?",
  "storyline": "\"400 Days\" centers on four astronauts sent on a simulated mission to a distant planet to test the psychological effects of deep space travel. Locked away for 400 days, the crew's mental state begins to deteriorate when they lose all communication with the outside world. Forced to exit the ship, they discover that this mission may not have been a simulation after all.",
  "plot": "Four astronauts – Captain Theo Cooper (Routh), Dr. Emily McTier (Lotz), Bug Kieslowski (Feldman) and Cole Dvorak (Cook) – begin a 400-day long simulation on Earth intended to study the long-term effects of space travel.\n\nAs their time underground grinds on, the crew begins to deal with extreme psychological effects like paranoia and hallucination. The team settles deeper into their separate spaces, until a disheveled man finds his way into their simulated space ship. After his escape the crew decides to exit and explore the surface world, which they discover is now dark, windy, desolate, forbidding and covered with dust.\n\nAfter a long walk with minor incidents they discover the town 'Tranquillity', which is inhabited and has electricity. A man named Zell (Tom Cavanagh) invites them into his diner and tells them that the moon was struck by an asteroid which created an enormous dust cloud now covering the earth, blocking the sun. Dvorak scoffs at this suggestion, still believing them to be in a simulation and leaves to go to the local bar, followed by the rest of the crew. After a few drinks, Dvorak goes out of the bar with a young woman without telling the others. The three return to the diner where Zell has offered them a place to sleep.\n\nBug takes first watch duty, but McTier and Cooper wake up alone after some time. When they ask Zell about their missing friends, he insists that Cooper and McTier arrived alone. Suspecting danger, the pair leaves the diner unsuccessfully looking for their friends. They return to the ship and as Cooper closes the entrance hatch, he discovers that they were being followed by Zell and two other men. Cooper and McTier manage to neutralize their attackers and the very moment Zell dies, the 400 days have just passed and they are being informed that the simulation has ended with great success. The entrance hatch opens with bright light shining down. Cooper and McTier grab each other's hands and anxiously await what happens next as the film ends without conclusion about it.",
  "synopsis": null
}