{
  "imdb_id": "tt3704416",
  "tmdb_id": "295490",
  "douban_id": null,
  "title": "Digging for Fire (2015)",
  "genres": [
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.9,
  "director": [
    {
      "id": "nm1846132",
      "name": "Joe Swanberg"
    }
  ],
  "writer": [
    {
      "id": "nm2159926",
      "name": "Jake Johnson",
      "description": "written by"
    },
    {
      "id": "nm1846132",
      "name": "Joe Swanberg",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm2159926",
      "name": "Jake Johnson",
      "character": "Tim"
    },
    {
      "id": "nm1679669",
      "name": "Rosemarie DeWitt",
      "character": "Lee"
    },
    {
      "id": "nm5047403",
      "name": "Jude Swanberg",
      "character": "Jude"
    },
    {
      "id": "nm0885900",
      "name": "Alicia Van Couvering",
      "character": "Cashier"
    },
    {
      "id": "nm3985937",
      "name": "Timothy Simons",
      "character": "Yoga Couple"
    },
    {
      "id": "nm2809577",
      "name": "Jenny Slate",
      "character": "Yoga Couple"
    },
    {
      "id": "nm1337885",
      "name": "Jeff Baena",
      "character": "BB Gun Friend"
    },
    {
      "id": "nm1898126",
      "name": "Mike Birbiglia",
      "character": "Phil"
    },
    {
      "id": "nm2074421",
      "name": "Steve Berg",
      "character": "Paul"
    },
    {
      "id": "nm0651692",
      "name": "Kent Osborne",
      "character": "Adam"
    },
    {
      "id": "nm0005377",
      "name": "Sam Rockwell",
      "character": "Ray"
    },
    {
      "id": "nm0582149",
      "name": "Chris Messina",
      "character": "Tango"
    },
    {
      "id": "nm0447695",
      "name": "Anna Kendrick",
      "character": "Alicia"
    },
    {
      "id": "nm0488953",
      "name": "Brie Larson",
      "character": "Max"
    },
    {
      "id": "nm0509937",
      "name": "Judith Light",
      "character": "Grandma"
    },
    {
      "id": "nm0000385",
      "name": "Sam Elliott",
      "character": "Pop Pop"
    },
    {
      "id": "nm0101005",
      "name": "Tom Bower",
      "character": "Tom the Neighbor"
    },
    {
      "id": "nm4542300",
      "name": "Megan Mercier",
      "character": "Uber Driver #1"
    },
    {
      "id": "nm0001491",
      "name": "Melanie Lynskey",
      "character": "Squiggy"
    },
    {
      "id": "nm0515296",
      "name": "Ron Livingston",
      "character": "Bob"
    },
    {
      "id": "nm7210797",
      "name": "Aislinn Brooke Plair",
      "character": "Squiggy and Bob's Daughter       (as Aislinn Plair)"
    },
    {
      "id": "nm8326648",
      "name": "Noah Nelson",
      "character": "Squiggy and Bob's Son"
    },
    {
      "id": "nm2698115",
      "name": "Lindsay Burdge",
      "character": "Lucy"
    },
    {
      "id": "nm5313645",
      "name": "David Siskind",
      "character": "Uber Driver #2"
    },
    {
      "id": "nm3891594",
      "name": "David Bly",
      "character": "Waiter"
    },
    {
      "id": "nm3980619",
      "name": "Noelia Estrada",
      "character": "Hostess"
    },
    {
      "id": "nm0037708",
      "name": "Miguel Arteta",
      "character": "Bartender"
    },
    {
      "id": "nm2888803",
      "name": "Padraic Cassidy",
      "character": "Brian"
    },
    {
      "id": "nm0089217",
      "name": "Orlando Bloom",
      "character": "Ben"
    },
    {
      "id": "nm0011038",
      "name": "Jane Adams",
      "character": "Woman on Beach"
    }
  ],
  "overview": "Tim and Lee are married with a young child. The chance to stay at a fancy home in the Hollywood Hills is complicated by Tim's discovery of a bone and a rusty old gun in the yard. Tim is excited by the idea of a mystery, but Lee doesn't want him to dig any further, preferring that he focus on the family taxes, which he promised to do weeks ago. This disagreement sends them on separate and unexpected adventures over the course of a weekend, as Tim and his friends seek clues to the mystery while Lee searches for answers to the bigger questions of marriage and parenthood.",
  "storyline": "Married couple Lee and Tim, a part-time yoga instructor and a public school physical education teacher respectively, jump at the opportunity to sit at the secluded Los Angeles Hills house of an actress acquaintance for two weeks as a mini-vacation for them and their three-year-old son, Jude. The house sit starts with an unusual event: Tim finds on the property in the wooded hills just beyond the swimming pool a gun and a bone. He believes the bone could be a human one, and that there could be a murdered dead body buried in the hills in the vicinity of where he found these items. Tim telephones the police, who tell him they can do nothing unless an actual body is found. As such, Lee convinces Tim to drop the subject. On their first weekend at the house, Lee decides to leave Tim on his own for the weekend to complete their income tax return, which he has long put off, while she and Jude go to visit among others her mother and stepfather, and her sister Squiggy and her family, neither ...",
  "plot": "Lee (Rosemarie DeWitt), a yoga instructor, brings her husband Tim (Jake Johnson), a gym teacher, and their 3-year-old son Jude (Jude Swanberg) to house-sit in a client's house for a few weeks while the client is away. While walking around the property, Tim finds a gun and a bone in the backyard. At first he wants to dig up the surrounding ground to see if a body is buried there, but Lee convinces him it is a bad idea.\n\nWhen Lee and Jude leave for the weekend to stay with her parents so that Tim can work without distraction on the family's taxes, he invites a group of friends—including Ray (Sam Rockwell), Phil (Mike Birbiglia), Adam (Kent Osborne), and Paul (Steve Berg)—to the house for the night. After a few drinks, they decide to dig up the backyard together, quickly finding another bone and a license plate. Phil, who is skeptical about the digging, leaves with Adam and Paul as Alicia (Anna Kendrick), Max (Brie Larson) and Billy (Chris Messina) arrive at the house. Billy pairs off with Alicia and Ray with Max while Tim continues to dig. He finds a shoe before deciding to go to sleep.\n\nThe next morning, Tim is visited by a neighbor who warns him that digging for buried items in the backyard is a bad idea and says that the site was once the \"Chicano Hall of Fame\". Soon afterwards, Max returns to pick up her purse and finds Tim digging again. She joins him and discovers a plastic bag filled with bones. Meanwhile, Lee goes to visit her sister Squiggy (Melanie Lynskey) and brother-in-law Bob (Ron Livingston) for an afternoon after complaining to her mother that she no longer feels she has an identity outside of being a mother and wife.\n\nPhil returns to the house and, seeing Tim with Max, assumes that Tim is cheating on Lee. Tim and Max go out to dinner and Tim confesses that he feels his marriage to Lee has deteriorated since they had a child. Lee goes to a bar alone, where she meets Ben (Orlando Bloom). When Ben is punched by another man at the bar, she accompanies him to visit Alicia, who is a medical student and a friend of his, so that Alicia can suture his wound. As Tim and Max smoke marijuana together at the house, Ben cooks dinner for Lee.\n\nMax leaves the house when Ray reappears and Tim accuses Ray of ruining his night. Lee and Ben make their way to the beach and share a kiss. Tim returns to the backyard and uncovers a ring and what appears to be a human hand before he decides to stop digging. He throws everything he has found back into the hole he has dug before starting to fill it in. He walks back up to the house and, finding Lee waiting for him, kisses her. The next morning, they pack up their belongings and go to pick up Jude.",
  "synopsis": null
}