{
  "imdb_id": "tt3778394",
  "tmdb_id": "357155",
  "douban_id": null,
  "title": "Delirium (2014)",
  "genres": [
    "Comedy"
  ],
  "country": "Argentina",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.4,
  "director": [
    {
      "id": "nm1885763",
      "name": "Carlos Kaimakamian Carrau"
    }
  ],
  "writer": [
    {
      "id": "nm1885763",
      "name": "Carlos Kaimakamian Carrau",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0201857",
      "name": "Ricardo Darín",
      "character": "Himself"
    },
    {
      "id": "nm2202603",
      "name": "Emiliano Carrazzone",
      "character": "Mariano"
    },
    {
      "id": "nm1158317",
      "name": "Ramiro Archain",
      "character": "Martín"
    },
    {
      "id": "nm2529512",
      "name": "Miguel Dileme",
      "character": "Federico"
    },
    {
      "id": "nm3491796",
      "name": "Florencia Miller",
      "character": "Moza"
    },
    {
      "id": "nm1893381",
      "name": "Catalina Dlugi",
      "character": "Herself"
    },
    {
      "id": "nm0319880",
      "name": "Susana Giménez",
      "character": "The President of Argentina"
    },
    {
      "id": "nm0868610",
      "name": "Diego Torres",
      "character": "Himself"
    }
  ],
  "overview": null,
  "storyline": "A group of friends is looking for a change in their lives . Believing that a film will bring them fame and wealth embark on the project without more knowledge but with great actor like hook : Ricardo Darin .",
  "plot": "A group of 3 friends try to earn a lot of money quickly. After considering several options, they try to make a short film. They manage to get in contact with the famous actor Ricardo Darín (who plays himself in the movie), who mistook one of them as a relative of one of his friends, and agreed to work with them because of the misunderstanding. The group starts to film, and attempts to drive a car slowly towards Darín while filming; but the untrained driver accelerated instead of stopping the car, and killed him.\n\nThe three friends escaped, and all the media was filled with people asking for the whereabouts of Darín. They arranged some portions of the unreleased short film to make it seem as if Darín was leaving the country, which led to a national outrage. They tried to use a similar system to stage a request of a million dollars to the producers of his last film; those producers denounced that Darín had been kidnapped. This led to a complete national crisis, and the US threatened to start bombing Buenos Aires if Darín did not appear alive.",
  "synopsis": null
}