{
  "imdb_id": "tt3799372",
  "tmdb_id": "323674",
  "douban_id": null,
  "title": "6 Years (2015)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "79 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm4227232",
      "name": "Hannah Fidell"
    }
  ],
  "writer": [
    {
      "id": "nm4227232",
      "name": "Hannah Fidell",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm3920288",
      "name": "Taissa Farmiga",
      "character": "Melanie Clark"
    },
    {
      "id": "nm4101208",
      "name": "Ben Rosenfield",
      "character": "Dan Mercer       (as Benjamin Rosenfield)"
    },
    {
      "id": "nm2698115",
      "name": "Lindsay Burdge",
      "character": "Amanda"
    },
    {
      "id": "nm0502671",
      "name": "Joshua Leonard",
      "character": "Mark"
    },
    {
      "id": "nm1436209",
      "name": "Jennifer Lafleur",
      "character": "Ms. Anders       (as Jennifer LaFleur)"
    },
    {
      "id": "nm0114430",
      "name": "Peter Vack",
      "character": "Will"
    },
    {
      "id": "nm0923984",
      "name": "Dana Wheeler-Nicholson",
      "character": "Joanne"
    },
    {
      "id": "nm5092134",
      "name": "Molly McMichael",
      "character": "Jessica"
    },
    {
      "id": "nm1367641",
      "name": "Jason Newman",
      "character": "Jason"
    },
    {
      "id": "nm6684675",
      "name": "Alysia Lucas",
      "character": "Becca"
    },
    {
      "id": "nm5443533",
      "name": "Dillon Cavitt",
      "character": "Jared"
    },
    {
      "id": "nm5556340",
      "name": "Elizabeth Lestina",
      "character": "Liz"
    },
    {
      "id": "nm7515266",
      "name": "Nichole Worrell",
      "character": "Nurse"
    },
    {
      "id": "nm1372989",
      "name": "Corby Sullivan",
      "character": "Arresting Police Officer"
    },
    {
      "id": "nm2956003",
      "name": "Scott Colquitt",
      "character": "Police Officer"
    },
    {
      "id": "nm0954658",
      "name": "Nathan Zellner",
      "character": "Jail Officer"
    },
    {
      "id": "nm7515267",
      "name": "Jess Williamson",
      "character": "Singer"
    },
    {
      "id": "nm4383409",
      "name": "Ben Sklar",
      "character": "Office Mate"
    },
    {
      "id": "nm5434364",
      "name": "Cody Haltom",
      "character": "Rich"
    },
    {
      "id": "nm5433988",
      "name": "Matthew Genitempo",
      "character": "Dan"
    },
    {
      "id": "nm4284343",
      "name": "Kerri Lendo",
      "character": "Record Label Employee"
    },
    {
      "id": "nm1744821",
      "name": "Haroula Rose",
      "character": "Record Label Girl"
    },
    {
      "id": "nm0694737",
      "name": "Bryan Poyser",
      "character": "Record Label Guy"
    },
    {
      "id": "nm1054429",
      "name": "Michael Tully",
      "character": "Record Label Drunk       (as Mike Tully)"
    }
  ],
  "overview": "A young couple bound by a seemingly ideal love, begins to unravel as unexpected opportunities spin them down a volatile and violent path and threaten the future they had always imagined.",
  "storyline": "A romantic drama centering around unforeseen circumstances, 6 Years is a tale about Melanie (Taissa Farmiga) and Dan (Ben Rosenfield), a young couple in love whose relationship begins to fracture. Close friends since childhood, the pair's connection is tested when Dan receives an enviable job offer from a record company. Forced to choose between his love for Melanie and his dream job, Dan's decisions prove to affect the future of both young lovers irrevocably. 6 Years is written and directed by Hannah Fidell.",
  "plot": "A young couple, Melanie Clark (Taissa Farmiga) and Dan Mercer (Ben Rosenfield), experience joyful moments in their relationship, including having passionate sex. After a house party one night, Mel drives to Dan's house drunk. Berating her for being reckless, Dan requests that she stay the night. Mel reacts angrily and pushes him into a dresser, causing Dan to sustain a head wound. At the emergency room, Dan lies about how he got the injury, covering for Mel.\n\nDan interns at Austin-based record label Topo Records. His co-worker Amanda (Lindsay Burdge) notices his head; she points out how different the situation would look if it had happened to Mel and not him. Mel starts a job as a teaching assistant to Ms. Anders (Jennifer Lafleur) at an elementary school. One night, her friends ask how she and Dan keep things fresh, and Jessica (Molly McMichael) suggests they should watch pornography. Dan later catches Mel watching a porn film.\n\nThe next day, they go for lunch with Dan's mom Joanne (Dana Wheeler-Nicholson). Before Mel arrives, Joanne tells Dan that she and his dad will pay his rent if he chooses to move to New York City. A few nights later, Mel and Dan go to a pool party thrown by Mark (Joshua Leonard). After Mel leaves, Dan kisses Amanda. He apologizes, and they agree it's best to be friends.\n\nThe next morning, Dan goes to Mel's house and she notices his odd behavior. He denies there's anything wrong. That night, Mel borrows Dan's phone at a party and sees a text from Amanda talking about their kiss. They break out into a physical fight, and, in an attempt to subdue Mel's lashing out, Dan holds her to the ground. Cops show up, misreading the situation, and detain him. Dan is released the next morning, but refuses to speak to Mel.\n\nJason and Mark offer Dan a job at Topo Records' new office in Brooklyn. To celebrate, he goes to a bar with Amanda. She apologizes for sending him the text, and Dan informs her that he and Mel are on a break. Meanwhile, Mel attends a party with her friends, where she meets Will (Peter Vack). After becoming intoxicated, Jessica and Will take her home. Jessica goes back to the party, but Will stays behind. Will attempts to rape Mel while she is semiconscious, but she pushes him off and he leaves.\n\nMel tells Dan about Will and tearfully asks him to hold her. The two then go to Houston to help Mel's mom move out of Mel's childhood home. While there, Dan visits his mother who encourages him to take the job in New York. Later, Dan tells Mel about his job offer across the country and she accuses him of only thinking of himself. He, in turn, calls her needy and Mel orders him to leave. Mel then worries that she has messed the relationship up for good. Her roommate Becca (Alysia Lucas) suggests that she should sleep on it and give Dan time to cool off.\n\nBack at Dan's house, he and Amanda have sex. The next morning, Mel arrives to apologize and catches Amanda leaving. She throws a glass across the room and pushes Dan into the broken shards, injuring his foot and hand. At the hospital, Mel tells Dan that she thinks he should move to New York, though he tries to make amends with her and insists that he wants to stay with her. Mel then asks Dan if he loves her and wants to spend the rest of his life with her. When Dan is unable to answer, Mel implies that after all her efforts to heal their relationship, she's finally given up. The two then end things for good.",
  "synopsis": null
}