{
  "imdb_id": "tt3732950",
  "tmdb_id": "314420",
  "douban_id": null,
  "title": "Body (2015)",
  "genres": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "75 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.3,
  "director": [
    {
      "id": "nm3228270",
      "name": "Dan Berk"
    },
    {
      "id": "nm1793586",
      "name": "Robert Olsen"
    }
  ],
  "writer": [
    {
      "id": "nm3228270",
      "name": "Dan Berk",
      "description": null
    },
    {
      "id": "nm1793586",
      "name": "Robert Olsen",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3621345",
      "name": "Helen Rogers",
      "character": "Holly"
    },
    {
      "id": "nm4078666",
      "name": "Alexandra Turshen",
      "character": "Cali"
    },
    {
      "id": "nm4259098",
      "name": "Lauren Molina",
      "character": "Mel"
    },
    {
      "id": "nm0275244",
      "name": "Larry Fessenden",
      "character": "Arthur"
    },
    {
      "id": "nm6497963",
      "name": "Adam Cornelius",
      "character": "Ben"
    },
    {
      "id": "nm0107271",
      "name": "Dan Brennan",
      "character": "Mr. Greenberg"
    },
    {
      "id": "nm0283530",
      "name": "Kimberly Flynn",
      "character": "Mrs. Greenberg"
    },
    {
      "id": "nm5127084",
      "name": "Ian Robinson",
      "character": "Josh"
    },
    {
      "id": "nm10504279",
      "name": "Jack Mathis Brenner",
      "character": "Bearded Man"
    },
    {
      "id": "nm1219453",
      "name": "Mike Keller",
      "character": "Cop"
    }
  ],
  "overview": "A night out turns deadly when three girls break into a seemingly empty mansion.",
  "storyline": "Holly, Cali and Mel, three girls celebrating the Christmas holidays at Mel's house the night before Christmas eve. Cali convinces them to go out and have some fun when the others feel like just going to bed (Cali's role as instigator of problems continues throughout the movie). The girls are led to a deserted mansion filled with expensive cars and booze (having been told it's Cali's uncles place). The plot is mostly based around the psychological mechanisms that can take hold when a stupid mistake ends up as a threat to a young persons future well-being and how normal morals can be overwhelmed by indulgent, half-baked ideas of self-preservation.",
  "plot": "Holly, Cali, and Mel become bored when they return home for the holidays. Cali convinces the others that they should go to her uncle's house, where they can party. In the house, however, Holly finds evidence that leads her to believe that Cali is unrelated to the owners. When she confronts Cali, Cali admits that they have broken into a house owned by a couple for whom she used to babysit. Holly and Mel insist that they leave, but before they can, Arthur, the groundskeeper surprises them. After a brief scuffle, Arthur falls down a staircase, apparently dead. The women panic and decide to cover up the accident. When Arthur turns out to not be dead after all, the friends disagree on how to proceed.",
  "synopsis": null
}