{
  "imdb_id": "tt3761196",
  "tmdb_id": "278254",
  "douban_id": null,
  "title": "I Will Dance (2015)",
  "genres": [
    "Documentary",
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "78 min",
      "description": ""
    }
  ],
  "imdb_rating": 9.3,
  "director": [
    {
      "id": "nm3625207",
      "name": "Joseph East"
    }
  ],
  "writer": [
    {
      "id": "nm6528124",
      "name": "Alicia East",
      "description": null
    },
    {
      "id": "nm0772296",
      "name": "Thomas Schlesinger",
      "description": "story"
    }
  ],
  "cast": [
    {
      "id": "nm6537022",
      "name": "Sean Black",
      "character": "Himself"
    },
    {
      "id": "nm6537021",
      "name": "Tylisa Black",
      "character": "Herself"
    },
    {
      "id": "nm6536158",
      "name": "Gwen Brown",
      "character": "Herself"
    },
    {
      "id": "nm6528122",
      "name": "Amanda Farnsworth",
      "character": "Herself"
    },
    {
      "id": "nm6528120",
      "name": "Semaj King",
      "character": "Himself"
    },
    {
      "id": "nm6528123",
      "name": "Ronald Smith",
      "character": "Himself"
    },
    {
      "id": "nm6528121",
      "name": "Tori Thomas",
      "character": "Herself"
    }
  ],
  "overview": "Follows the young people of Selma, Alabama's RATCo (Random Acts of Theatre Company) as they journey to New York City to share their story of hope, resilience, and overcoming.",
  "storyline": "Random Acts of Theatre Company (RATCo) is more than a theatre company. To the girl who doesn't know where she'll sleep each night, it's a home. To the boy who prefers singing and dancing to football, it's a safe place. And to all the young people who are finding their voices there, it's a movement. In Selma, Alabama, against the backdrop of segregated institutions and the social ills that come along with extreme poverty (including under-performing schools, rampant teenage pregnancy, and a murder rate that is five times higher than the national average) RATCo's young people are breaking the familial and societal norms modeled around them. Among the cycle breakers highlighted in the film are Semaj, Tori, and Macio. Semaj is a bright student and gifted writer in a place where being smart is seen as a weakness. Tori captures hearts effortlessly through her humor, rawness, and spunk. And Macio \"writes\" through dance and is as interested in the famed New York cupcakes as he is in seeing a ...",
  "plot": null,
  "synopsis": null
}