{
  "imdb_id": "tt3772640",
  "tmdb_id": "282761",
  "douban_id": null,
  "title": "She's Dating the Gangster (2014)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "Philippines",
  "version": [
    {
      "runtime": "105 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.4,
  "director": [
    {
      "id": "nm1283069",
      "name": "Cathy Garcia-Molina"
    }
  ],
  "writer": [
    {
      "id": "nm2268581",
      "name": "Carmi Raymundo",
      "description": "story as Carmi G. Raymundo &"
    },
    {
      "id": "nm6410404",
      "name": "Charlene Grace Bernardo",
      "description": "story as Charlene Bernardo"
    },
    {
      "id": "nm2268581",
      "name": "Carmi Raymundo",
      "description": "screenplay as Carmi G. Raymundo &"
    },
    {
      "id": "nm6410404",
      "name": "Charlene Grace Bernardo",
      "description": "screenplay as Charlene Bernardo"
    },
    {
      "id": "nm6538572",
      "name": "Bianca B. Bernardino",
      "description": "book as Bianca Bernardino"
    }
  ],
  "cast": [
    {
      "id": "nm3981536",
      "name": "Daniel Padilla",
      "character": "Kenji /              Kenneth"
    },
    {
      "id": "nm1742708",
      "name": "Kathryn Bernardo",
      "character": "Athena /              Kelay"
    },
    {
      "id": "nm0327076",
      "name": "Richard Gomez",
      "character": "Present Kenji"
    },
    {
      "id": "nm0958613",
      "name": "Dawn Zulueta",
      "character": "Present Athena"
    },
    {
      "id": "nm5008704",
      "name": "Sofia Andres",
      "character": "Abigail"
    },
    {
      "id": "nm4582869",
      "name": "Khalil Ramos",
      "character": "Lucas"
    },
    {
      "id": "nm1111198",
      "name": "Ian Veneracion",
      "character": "Present Lucas"
    },
    {
      "id": "nm4750381",
      "name": "Pamu Pamorada",
      "character": "Sara"
    },
    {
      "id": "nm5682411",
      "name": "James Alexander Diaz McDermott",
      "character": "Jigs       (as Alexander Diaz)"
    },
    {
      "id": "nm4097339",
      "name": "Alyana Asistio",
      "character": "Grace       (as Yana Asistio)"
    },
    {
      "id": "nm1979852",
      "name": "Igi Boy Flores",
      "character": "Kirby       (as Igiboy Flores)"
    },
    {
      "id": "nm4912288",
      "name": "Marco Gumabao",
      "character": "Stephen"
    },
    {
      "id": "nm6798900",
      "name": "John Uy",
      "character": "Mickey"
    },
    {
      "id": "nm4038393",
      "name": "Eslove Briones",
      "character": "Sara's Date"
    },
    {
      "id": "nm3889365",
      "name": "Joe Vargas",
      "character": "Gang Leader"
    },
    {
      "id": "nm5196498",
      "name": "Elisse Joson",
      "character": "Mean Girl"
    },
    {
      "id": "nm1851576",
      "name": "Arnold Reyes",
      "character": "Athena's Dad"
    },
    {
      "id": "nm2895878",
      "name": "Niña Dolino",
      "character": "Athena's Stepmom"
    },
    {
      "id": "nm0517034",
      "name": "Rio Locsin",
      "character": "Abigail's Mom"
    },
    {
      "id": "nm2354147",
      "name": "Fonz Deza",
      "character": "Present Athena's Dad       (as Alfonso Deza)"
    },
    {
      "id": "nm1211150",
      "name": "Chiqui del Carmen",
      "character": "Present Athena's Stepmom"
    },
    {
      "id": "nm1996934",
      "name": "Kobi Vidanes",
      "character": "Carl"
    },
    {
      "id": "nm3472410",
      "name": "Justin Gonzales",
      "character": "Nathan       (as Justin Gonzalez)"
    },
    {
      "id": "nm1290816",
      "name": "Yayo Aguila",
      "character": "Present Grace"
    },
    {
      "id": "nm0667074",
      "name": "Allan Paule",
      "character": "Present Mickey"
    },
    {
      "id": "nm0520855",
      "name": "William Lorenzo",
      "character": "Present Jigs"
    },
    {
      "id": "nm0611644",
      "name": "Niño Muhlach",
      "character": "Present Kirby"
    },
    {
      "id": "nm1053916",
      "name": "Ramon Christopher",
      "character": "Present Stephen"
    },
    {
      "id": "nm2657973",
      "name": "Julian Estrada",
      "character": "Jet"
    },
    {
      "id": "nm4751533",
      "name": "Kevin Fowler",
      "character": "Barry"
    },
    {
      "id": "nm4997749",
      "name": "Karen Reyes",
      "character": "Bridesmaid"
    },
    {
      "id": "nm1560480",
      "name": "Matutina",
      "character": "Nana Buding"
    },
    {
      "id": "nm1286598",
      "name": "Hyubs Azarcon",
      "character": "Truck Driver"
    },
    {
      "id": "nm2681183",
      "name": "Pooh",
      "character": "News Reporter"
    },
    {
      "id": "nm1296210",
      "name": "Jojit Lorenzo",
      "character": "Airline Officer"
    },
    {
      "id": "nm3477347",
      "name": "JM de Guzman",
      "character": "Airline Officer"
    },
    {
      "id": "nm1492443",
      "name": "Rayver Cruz",
      "character": "Basketball Player"
    },
    {
      "id": "nm4008510",
      "name": "Patrick Sugui",
      "character": "Basketball Player"
    },
    {
      "id": "nm1285216",
      "name": "Carl Ravanes",
      "character": "Basketball Player"
    },
    {
      "id": "nm6798901",
      "name": "Rasheed Rivero",
      "character": "Basketball Player"
    },
    {
      "id": "nm1714943",
      "name": "Joross Gamboa",
      "character": "Coach"
    },
    {
      "id": "nm1379894",
      "name": "Ketchup Eusebio",
      "character": "Coach"
    },
    {
      "id": "nm1168681",
      "name": "Janus del Prado",
      "character": "Bus Ticket Vendor"
    },
    {
      "id": "nm2505548",
      "name": "Joem Bascon",
      "character": "Hairstylist"
    },
    {
      "id": "nm2999760",
      "name": "Gerry Bricenio",
      "character": "Bus Conductor"
    },
    {
      "id": "nm4079644",
      "name": "Olive Isidro",
      "character": "Doctor       (as Olivia Cruz)"
    }
  ],
  "overview": "She’s Dating the Gangster tells the heart-wrenching tale of 17-year-old Athena Dizon and campus bad boy Kenji de los Reyes, two teenagers who begin a pretend relationship that ultimately transforms into something deeper.",
  "storyline": "It all started when 17-year-old Athena Dizon unwittingly plays a trick on resident heartthrob and bad boy, Kenji de los Reyes. All of a sudden, she finds herself pretending-unwillingly at that-to be his girlfriend to make his ex jealous. Now, not only does she have to deal with dirty looks from the girls in school who want Kenji for themselves, but her supposed boyfriend is getting on her nerves. He's hotheaded, never seems to agree with her on anything-and everything about him screams gangster.",
  "plot": "Kenji Delos Reyes delivers a speech during the wedding reception of his college friends, Kirby and Grace. However, Kenneth, Kenji’s only son, makes out with a girl in a bathroom stall as the girl’s grandfather enters; chaos then ensues as the old man chases Kenneth to the reception hall. After the wedding reception, Kenji then confronts Kenneth; he tells him to be mature enough already and asks him what the problem is, to which the latter says that he doesn’t want to be with him but has no choice. Kenji asks Kenneth what caused him to feel this way, to which Kenneth replies that he knows his father is in love with a girl other than his mother, Athena. Disappointed, Kenji tells Kenneth that the latter has no idea how much he loves him and his mother. Kenneth walked out and goes on a drinking spree while Kenji goes on a trip to Bicol.\n\nThe morning after drinking, a hungover Kenneth finds out the plane that would take his father to Bicol has crashed. He rushes to the airport to see the list of survivors. He then meets Kelay who also wants to see the list but Kelay could not pass through so she makes a fake weeping, causing a scene. Members of the media approach her and ask what her father’s name is, to which she answers Kenji delos Reyes. Hearing this, Kenneth confronts her and says that he is the only offspring of Kenji. Kenneth then tells the media that he’s the legal son and he can show his birth certificate to prove this. Kelay, on the other hand, shows a picture of a young Kenji with another girl. The people notice that the young Kenji looks like Kenneth, while the girl in the picture looks like Kelay. This caused a ruckus, with members of the media asking if Kelay and Kenneth are siblings. Confirming that the girl on the picture is not his mother and Kelay is not his sister, only Kenneth is asked by the airline officer for his contact details. Kenneth wanted Kelay to tell him who the girl in the picture is, but Kelay bargains that she would only tell him if he agrees to notify her once the airline contacts Kenneth for information regarding Kenji. Because all flights to Legazpi are booked, Kenneth decided to travel by bus but all tickets have been sold. He oversleeps while waiting for a new slot so Kelay got the tickets for the two of them.\n\nOn the way to Legazpi, Kelay tells the tale of young Athena Dizon, her aunt, and Kenji, twenty years back when Kenji was broken hearted over Athena Abigail Tizon, Kenneth's mother. He mistakenly sent his messages of despair to Athena Dizon’s pager. Athena, not knowing from whom the messages are from, agrees to meet up with the sender. On a pool hall, Athena and her friend Sarah are keen on playing pool. Kenji arrives and demands that they transfer to another pool table. Moments later, she witnessed Kenji being bullied by a rival group of gangsters. They tease him that \"Bee\" would not show up. Hearing this, Athena realizes that the messages were sent by Kenji.\n\nAfter the incident, Kenji found out that he sent the messages mistakenly to Athena Dizon. He confronts and kisses her forcefully, telling Athena that she will be his girlfriend since she is the reason Kenji got mugged. Athena has to pretend to be his girlfriend in order to get Abi jealous. At first, Athena refuses and Kenji bullies her. She eventually agreed when Kenji attempts to commit suicide by jumping from the school's rooftop if she did not become his girlfriend.\n\nFrom then on, Athena was treated like a princess with Kenji providing her bodyguards. Girls in their school start bullying Athena for being Kenji's new girlfriend. Kenji confronts them and warns them that no one can hurt Athena without consequences. Athena and Kenji's pretend relationship eventually became real and the two confess their love for each other. He takes her to Legazpi to see the Mayon Volcano and promises that someday they will get married in that place with the volcano as their witness.\n\nBack to the present, Kenneth receives a call from present day Lucas that the latter wanted to help look for Kenji. On their way, Lucas then continues the story of Athena and Kenji and why they did not end up with each other. When Athena and Kenji got back to Manila, Kenji started frequently absenting from class. Athena then gets notified by the young Lucas that she should come with him to the hospital. Worried, Athena hurries and finds Abi lying in the hospital bed. Abi had stage three gastric cancer and this was the reason why she broke up with Kenji. Wanting Abi to be have a sense of happiness and live longer, Athena breaks up with Kenji. He and Abi get married, giving birth to Kenneth.\n\nThe story then returns to the present time. Kelay receives a call from her family informing her that Athena is dying. Kelay and Kenneth part ways with Kenneth promising that Athena and Kenji would meet once he finds him. Kenneth finds the hospital where Kenji is confined and reads Kenji's letter for him. In the letter, Kenji tells him that he was on his way to Legazpi to finally part with his memories with Athena and apologizes for making Kenneth feel unloved. When Kenji wakes up, they embrace each other and reconcile. After Kenji recovers, Kenneth takes him to Athena’s house. Athena tells Kenji about her heart disease for the first time and tells him that his love kept her alive through the years. She says she is happy that their love for each other somehow made it possible for Kenji to have Kenneth in his life. Athena dies in Kenji's arms peacefully.\n\nShortly after, Kelay wakes up to a phone call. The speaker tells her that a flight has gone missing again and Kenneth was on that flight. Kelay goes to the airport to look for Kenneth. She makes a scene again, telling the media her 'boyfriend' is missing. Kenneth then revealed to Kelay that it was actually Kenji who called her. Kenneth asks Kelay if they can have a great love story like Kenji and Athena. The film cuts to black as Kenneth and Kelay are about to kiss.",
  "synopsis": null
}