{
  "imdb_id": "tt3720468",
  "tmdb_id": "378991",
  "douban_id": null,
  "title": "OMG... We're in a Horror Movie (2016)",
  "genres": [
    "Comedy",
    "Horror"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "107 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.5,
  "director": [
    {
      "id": "nm6339830",
      "name": "Ajala Bandele"
    }
  ],
  "writer": [
    {
      "id": "nm6339830",
      "name": "Ajala Bandele",
      "description": "writer"
    },
    {
      "id": "nm6339830",
      "name": "Ajala Bandele",
      "description": null
    },
    {
      "id": "nm6494640",
      "name": "Tom Hatfield",
      "description": "writer"
    },
    {
      "id": "nm6494640",
      "name": "Tom Hatfield",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm6339830",
      "name": "Ajala Bandele",
      "character": "AJ"
    },
    {
      "id": "nm5135207",
      "name": "Jenny Curtis",
      "character": "Hot Pedestrian"
    },
    {
      "id": "nm3336072",
      "name": "Liz Fenning",
      "character": "Amy"
    },
    {
      "id": "nm3656099",
      "name": "Christopher Hampton",
      "character": "Chris       (as Chris Hampton)"
    },
    {
      "id": "nm6143921",
      "name": "Nils Jansson",
      "character": "Kyle"
    },
    {
      "id": "nm3199591",
      "name": "Greg Loebell",
      "character": "Yelling Pedestrian"
    },
    {
      "id": "nm5063575",
      "name": "Sharon Mae",
      "character": "Jesse"
    },
    {
      "id": "nm4309768",
      "name": "Shanna Malcolm",
      "character": "Tanya"
    },
    {
      "id": "nm6318172",
      "name": "Brendan McGowan",
      "character": "Tom"
    },
    {
      "id": "nm6089907",
      "name": "Chynna Skye",
      "character": "Hot Pedestrian"
    },
    {
      "id": "nm5777435",
      "name": "Sam Szabo",
      "character": "Singing Pedestrian"
    },
    {
      "id": "nm4268556",
      "name": "Jennifer van Heeckeren",
      "character": "Yelling Pedestrian"
    },
    {
      "id": "nm5366816",
      "name": "Brittany Anne Woodford",
      "character": "Sally"
    }
  ],
  "overview": "Six friends having a weekly board game night are interrupted by a booming movie trailer voice from the sky. Inexplicably, they find themselves trapped in a Horror Movie. Who amongst them will turn into a homicidal killer? Who will be the sole survivor? And who will be the first to die in the shower? Struggling to break free from the stereotypes that would see them dead, each of the friends try to stay alive in whatever hopelessly desperate ways they can.",
  "storyline": "Six friends having a weekly board game night are interrupted by a booming movie trailer voice from the sky. Inexplicably, they find themselves trapped in a Horror Movie. Who amongst them will turn into a homicidal killer? Who will be the sole survivor? And who will be the first to die in the shower? Struggling to break free from the stereotypes that would see them dead, each of the friends try to stay alive in whatever hopelessly desperate ways they can.",
  "plot": "Kate and John Coleman (Vera Farmiga and Peter Sarsgaard) are experiencing strains in their marriage after their third child is stillborn. They decide to adopt a 9-year-old Russian girl named Esther (Isabelle Fuhrman) from a local orphanage. While Kate and John's 7-year-old deaf-mute daughter Max (Aryana Engineer) embraces Esther immediately, their 12-year-old son Daniel (Jimmy Bennett) is less welcoming. At school, a bully named Brenda taunts Esther, and she is eventually hurt when Esther pushes her off a slide and causes her to break her ankle.\n\nKate eventually suspects that there might be problems in Esther's background when Esther catches her and John having sex in the kitchen, and Esther knows more about sex beyond her years. Kate is further alarmed when Sister Abigail (C. C. H. Pounder), the head of the orphanage, warns her that bad things happen when Esther is around upon stating theories that whenever an incident such as arson or murder, Esther would always appear. Esther overhears this and uses Max to kill Sister Abigail using a hammer. Kate is convinced that something is wrong with Esther, but John does not believe her. Kate finds Esther's \"Bible\" and discovers that it came from the Saarne Institute in Estonia, a mental hospital. She emails a picture of Esther to them and asks for more information.\n\nWhen Daniel learns about Sister Abigail's death, he tells Max of his plan to retrieve the hammer. Esther overhears this and confronts Daniel at the tree house before setting it on fire and escaping. Daniel falls trying to escape and is knocked unconscious. Esther attempts to finish him off, but Max stops her. While Daniel is hospitalized, Esther slips into his room and smothers him, but he is revived. Kate realizes what happened and attacks Esther before being sedated by the hospital staff.\n\nThat night, a provocatively-dressed Esther tries to seduce a drunk John. When his vision clears, he tells Esther that he's calling the orphanage to discuss her future in their house and tells her to go to her room. Esther is devastated.\n\nAt the hospital, Kate receives a call from Dr. Varava (Karel Roden), the director of The Saarne Institute, who reveals that Esther is actually a 33-year-old woman named Leena Klammer, who has a rare hormone disorder that stunted her physical growth. She was one of The Saarne Institute's most violent patients and was forced to wear a straitjacket to protect the staff. After constantly trying to fight her way of it, she suffered permanent scars on her neck and wrists. She also spent most of her life posing as a child. She tricked a family into adopting her, but when she couldn't seduce the father, she killed him and his entire family, and burned their house down. Dr. Varava also said she disappeared a year ago, and they lost track of her. He warned Kate: \"If it's really Leena, you don't have much time.\" Horrified, Kate rushes home.\n\nDuring this time, Leena removes her \"Esther\" disguise by removing her ribbons around her neck and wrists, fake teeth, makeup, and \"wrappings,\" and trashes her bedroom. John comes to check on Esther and notices a black light has been dislodged from her fish tank. The blacklight suddenly reveals \"Esther's\" artwork to be sexual and violent. Horrified, John realizes that Kate was right.\n\nJohn is then ambushed by Leena, who stabs and kills John. Max witnesses this and hides. Kate rushes home and finds John dead. Leena gets a gun and shoots Kate. Kate manages to take the gun and flees with Max. Leena finds Kate and Max near a frozen pond. She lunges at Kate, hurling them both into the ice. Kate climbs partially out of the pond, and Leena begs Kate not to let her die, but Kate kicks her in the face, breaking her neck and killing her.",
  "synopsis": null
}