{
  "imdb_id": "tt3741860",
  "tmdb_id": "290504",
  "douban_id": null,
  "title": "Awake: The Life of Yogananda (2014)",
  "genres": [
    "Documentary"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "87 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm0223814",
      "name": "Paola di Florio"
    },
    {
      "id": "nm0498658",
      "name": "Lisa Leeman"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm0365600",
      "name": "George Harrison",
      "character": "Himself       (archive footage)"
    },
    {
      "id": "nm0451600",
      "name": "Anupam Kher",
      "character": "Narrator"
    },
    {
      "id": "nm0749043",
      "name": "Reed Rudy",
      "character": "Additional Voices"
    },
    {
      "id": "nm0005432",
      "name": "Russell Simmons",
      "character": "Himself"
    }
  ],
  "overview": "Documentary about the life of Yogananda, who brought Hindu spirituality to the West in the 1920s.",
  "storyline": "Unique biopic about Yogananda, author of The Autobiography of a Yogi. In the 1920s, he brought Hindu spirituality to the West. This tells the story of his life and influence on yoga, religion and science, combining re-enactment, interviews, and verité.",
  "plot": null,
  "synopsis": "\"Awake: The Life of Yogananda\" is an unconventional biography about the East Indian mystic who brought yoga and meditation to the West in the 1920s. Paramahansa Yogananda authored the spiritual classic \"Autobiography of a Yogi\" which has sold millions of copies worldwide and is a go-to book for seekers, philosophers, and yoga enthusiasts today. By personalizing his own quest for enlightenment and sharing his struggles along the path, Yogananda made ancient Vedic teachings accessible to a modern audience. Known as the \"Father of Yoga in the West,\" he attracted countless followers in his day. Filmed over three years with the participation of 30 countries around the world, the documentary examines the world of yoga, modern and ancient, East and West, and explores why millions today have turned their attention inward, bucking the temptations of the material world in pursuit of Self-realization."
}