{
  "imdb_id": "tt3708326",
  "tmdb_id": "296916",
  "douban_id": null,
  "title": "Faust 2.0 (2014)",
  "genres": [
    "Horror"
  ],
  "country": "Sweden",
  "version": [
    {
      "runtime": "79 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.3,
  "director": [
    {
      "id": "nm0003103",
      "name": "Nicolas Debot"
    },
    {
      "id": "nm1209659",
      "name": "Micke Engström"
    },
    {
      "id": "nm1275840",
      "name": "Allan Gustafsson"
    },
    {
      "id": "nm0750259",
      "name": "Johannes Pinter"
    },
    {
      "id": "nm1500455",
      "name": "Robert Selin"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm4376174",
      "name": "Frida Liljevall",
      "character": "Elisabeth"
    },
    {
      "id": "nm0373218",
      "name": "Thomas Hedengran",
      "character": "Vincent"
    },
    {
      "id": "nm0098543",
      "name": "Katharina Bothén",
      "character": "Madeleine Stark       (as Katarina Bothén)"
    },
    {
      "id": "nm0121062",
      "name": "Per Burell",
      "character": "Thomas af Ekenstam"
    },
    {
      "id": "nm6471173",
      "name": "Chrissy Pavlov",
      "character": "Alice"
    },
    {
      "id": "nm6471174",
      "name": "Peter Stridsberg",
      "character": "Vince"
    },
    {
      "id": "nm2551030",
      "name": "Mattias Redbo",
      "character": "Joel"
    },
    {
      "id": "nm2514148",
      "name": "Ida Linnertorp",
      "character": "Liv"
    },
    {
      "id": "nm3665840",
      "name": "Mariah Kanninen",
      "character": "Erida"
    },
    {
      "id": "nm0706537",
      "name": "Per Ragnar",
      "character": "Faust"
    },
    {
      "id": "nm4990283",
      "name": "Anders Fager",
      "character": ""
    },
    {
      "id": "nm2040996",
      "name": "Anders Hasselroth",
      "character": ""
    },
    {
      "id": "nm2417727",
      "name": "Joachim Staaf",
      "character": ""
    }
  ],
  "overview": "Softwares and apps are daily installed based on agreements we scroll past and accept. But what exactly do we accept? In Faust 2.0 we meet five individuals who unknowingly enters into a pact with unknown forces and whose lives are brought to a brutal turn when they use the mystical applications to achieve what they want - but instead get what they deserve. As the applications spread the pieces fall into place and a digital pandemic takes shape.",
  "storyline": "Softwares and apps are daily installed based on agreements we scroll past and accept. But what exactly do we accept? In Faust 2.0 we meet five individuals who unknowingly enters into a pact with unknown forces and whose lives are brought to a brutal turn when they use the mystical applications to achieve what they want - but instead get what they deserve. As the applications spread the pieces fall into place and a digital pandemic takes shape.",
  "plot": "The story commences on the streets of Prague on a grey morning with commuters bustling about. We are introduced to the figure of an Everyman, played by Petr Čepek, a colourless figure emerging from a metro station. On his way home, the man encounters two men handing out flyers. It is a map of the city with a location marked in. He shrugs and discards it, returning to his lodging. As he opens the door, a black cockerel runs out. The man sits down to eat, cutting himself a slice of bread. He discovers an egg concealed inside the loaf. He cracks it open but it is empty. Suddenly the lights go out and the wind rises. Objects are thrown about the room. The commotion ceases; the man goes to the window and looks down to where the two men from earlier are staring up at him. One of them holds the cockerel. The man closes the blind and returns to the table, where he finds the map and, using his own map of the city, traces out the location marked.\n\nThe next day, he goes to the spot indicated and enters a dilapidated building just as a man rushes from it in fear. He presses on into the interior and descends to a dressing room, where he finds a charred script, a robe embroidered with sigils, greasepaint, a wig with a beard and a cap. Sitting down he addresses himself as Faust and speaks to himself (the first words spoken in the film) Faust's opening declaration of intent to follow black magic.\n\nAs the opening curtain is signalled, 'Faust' finds himself on a stage, a performance about to begin. Ripping off his costume, he breaks through the stage backdrop into a vault where an alchemist's laboratory is revealed; with the aid of a book of spells, he brings to life a clay child which grows horrifyingly into his own image before he smashes it. Warned by a marionette angel not to experiment further but encouraged by a demon to do as he pleases, he is sent by a wooden messenger to a cafe meeting with the two street-map men, identified as 'Cornelius' and 'Valdes', who give him a briefcase of magical devices. Returning to the vault, he uses these to summon Mephisto, offering Lucifer his soul in return for 24 years of self-indulgence.\n\nAt another café, 'Faust' is entertained by Comelius and Valdes, who provide a fountain of wine from a table-top. He watches as a tramp, carrying a severed human leg, is pestered by a large black dog until he throws the limb into the river. 'Faust' finds a key in his food, uses it on a shop-front shutter, and is dragged back on stage by waiting stagehands. He mimes a scene from Gounod's opera, in which Mephisto returns and the pact with Lucifer is signed in blood. After the interval, 'Faust' visits Portugal to demonstrate his supernatural powers to the King: when a requested restaging of the David and Goliath contest is poorly received, he drowns the entire Portuguese court.\n\n'Faust' is distracted from repentance by Helen of Troy, whom he seduces before realising she is a wooden demon in disguise. Lucifer arrives earlier than expected to claim his soul, and 'Faust' rushes in panic from the theatre, meeting a newcomerin at the doorway as he bursts into the street. He is felled by a red car, and Cornelius and Valdes watch in amusement as a tramp carries away a severed leg from the scene of the accident. A policeman checks the car, but it is without a driver.",
  "synopsis": null
}