{
  "imdb_id": "tt3760610",
  "tmdb_id": "279633",
  "douban_id": null,
  "title": "Terry the Tomboy (TV Movie 2014)",
  "genres": [
    "Comedy"
  ],
  "country": "USA",
  "version": [],
  "imdb_rating": 4.4,
  "director": [
    {
      "id": "nm1543633",
      "name": "Wade Randolph"
    }
  ],
  "writer": [
    {
      "id": "nm1543633",
      "name": "Wade Randolph",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3096796",
      "name": "Lia Marie Johnson",
      "character": "Terry"
    },
    {
      "id": "nm2940487",
      "name": "Kelsy Abbott",
      "character": "Mother"
    },
    {
      "id": "nm3191813",
      "name": "Eric Acosta",
      "character": "Father"
    },
    {
      "id": "nm4555455",
      "name": "Noland Ammon",
      "character": "Duncanty"
    },
    {
      "id": "nm2911799",
      "name": "Christopher Bones",
      "character": "Brian"
    },
    {
      "id": "nm2464622",
      "name": "Nathan Carden",
      "character": "Hot Moving Dude"
    },
    {
      "id": "nm0185078",
      "name": "Jennifer Elise Cox",
      "character": "Unfathomable Aunt Peyton"
    },
    {
      "id": "nm6121373",
      "name": "Shai Crockett",
      "character": "Britannica's Friend"
    },
    {
      "id": "nm3967559",
      "name": "Charlie DePew",
      "character": "Brett"
    },
    {
      "id": "nm2556904",
      "name": "Tiffany Espensen",
      "character": "Wallaine Rapkin"
    },
    {
      "id": "nm0383422",
      "name": "John Michael Higgins",
      "character": "Doctor Larry"
    },
    {
      "id": "nm1111656",
      "name": "Brian Huskey",
      "character": "Mayor Destero"
    },
    {
      "id": "nm4664099",
      "name": "Alex Kavutskiy",
      "character": "Dart Toss Guy"
    },
    {
      "id": "nm6104900",
      "name": "Leo Lam",
      "character": "Carnival Dancer"
    },
    {
      "id": "nm6558328",
      "name": "Craig Manchester",
      "character": "Fred 'Foot Guy'"
    },
    {
      "id": "nm2757860",
      "name": "Charisma McKorn",
      "character": "Britannica's Friend"
    },
    {
      "id": "nm6045535",
      "name": "Brett Newton",
      "character": "Carnival Dancer"
    },
    {
      "id": "nm2790374",
      "name": "Vatche Panos",
      "character": "Ring Toss Guy"
    },
    {
      "id": "nm1409381",
      "name": "Willy Roberts",
      "character": "Caricature Artist"
    },
    {
      "id": "nm1317656",
      "name": "Brandon Soo Hoo",
      "character": "Napkin Rapkin"
    },
    {
      "id": "nm6001373",
      "name": "Shawn Thomas",
      "character": "Dart thrower"
    },
    {
      "id": "nm2733899",
      "name": "Audrey Whitby",
      "character": "Britannica"
    }
  ],
  "overview": "Terry the Tomboy centers around a confident, bacon-loving and shower-deficient tomboy whose summer goal is to win the county fair pie-eating contest. After meeting her new neighbor Brett (Charlie Depew, The Amazing Spiderman), she isn’t so interested in pie anymore and realizes the worst thing has happened — she’s a tomboy who has fallen in love.",
  "storyline": "A visit to the doctor confirms that the worst has happened: Terry is crushing on her new neighbor Brett. With help from her best friend and not-so-secret admirer, Duncanty, Terry attempts to overcome her unfortunate condition. When she realizes girly-girl Brittanica is vying for Brett's attention, Terry needs to make a decision. Will she comb her hair and grow up or be herself and chow down at the county fair?",
  "plot": "Terry is excited that summer is here and school is out. In anticipation she and her best friend Duncanty create a list of things that they want to accomplish this summer. The most important is to win the county fair pie eating contest. Terry hears a noise and meets a hot boy named Brett who is moving in across the street from Terry. Right when Terry is about to talk to him, Brittanica, Terry's nemesis and former friend, swoops in and tells Brett lies about Terry. Terry gets mad and goes home.\n\nAs summer passes, Terry feels awkward and sick. Terry realizes she is in love with Brett, but Brittanica gets in the way so she asks her brother for help and he advises her to become a cheerleader. Terry gives up on cheerleading after an infamous failure at the tryouts. Desperate, Terry becomes a girly girl to catch Brett's eye. At the very end of the Summer, Terry looks for Brett at the Ferris wheel, but when Terry gets there, she sees Brett and Brittanica already on the ride, kissing.\n\nTerry is crushed, but then remembers the pie eating contest. She goes to Duncanty's house and gets him to go to the contest with her. They go to the contest together. Terry wins and is happy, but then sees Duncanty talking to another girl and gets jealous. She walks over to them and pushes the girl down into the mud and tells Duncanty that she needs him instead of Brett and that Duncanty is the only boy she will ride the Ferris wheel with. They share a kiss.\n\nAfter that, Terry feels that they should stay friends and not go too fast. The film ends with Terry saying that the summer was fun and feels free. She doesn't feel awkward about Brett (who broke up with Brittanica at the fair after discovering her lies). The film ends with all the characters at a dance party.",
  "synopsis": null
}