{
  "imdb_id": "tt3788052",
  "tmdb_id": "298533",
  "douban_id": null,
  "title": "Corner Gas: The Movie (2014)",
  "genres": [
    "Comedy"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm1012778",
      "name": "David Storey"
    }
  ],
  "writer": [
    {
      "id": "nm0125217",
      "name": "Brent Butt",
      "description": "story and"
    },
    {
      "id": "nm2053475",
      "name": "Andrew Carr",
      "description": "story and"
    },
    {
      "id": "nm0942094",
      "name": "Andrew Wreggitt",
      "description": "story"
    },
    {
      "id": "nm0125217",
      "name": "Brent Butt",
      "description": "teleplay and"
    },
    {
      "id": "nm2053475",
      "name": "Andrew Carr",
      "description": "teleplay and"
    },
    {
      "id": "nm0942094",
      "name": "Andrew Wreggitt",
      "description": "teleplay"
    }
  ],
  "cast": [
    {
      "id": "nm0125217",
      "name": "Brent Butt",
      "character": "Brent Leroy"
    },
    {
      "id": "nm0588364",
      "name": "Gabrielle Miller",
      "character": "Lacey Burrows"
    },
    {
      "id": "nm1004294",
      "name": "Fred Ewanuick",
      "character": "Hank Yarbo"
    },
    {
      "id": "nm0677139",
      "name": "Eric Peterson",
      "character": "Oscar Leroy"
    },
    {
      "id": "nm0942476",
      "name": "Janet Wright",
      "character": "Emma Leroy"
    },
    {
      "id": "nm0136482",
      "name": "Lorne Cardinal",
      "character": "Davis Quinton"
    },
    {
      "id": "nm0818166",
      "name": "Tara Spencer-Nairn",
      "character": "Karen Pelly"
    },
    {
      "id": "nm0731970",
      "name": "Nancy Robertson",
      "character": "Wanda Dollard"
    },
    {
      "id": "nm0482141",
      "name": "Don Lake",
      "character": "Jerome"
    },
    {
      "id": "nm0664995",
      "name": "Reagan Pasternak",
      "character": "Sasha"
    },
    {
      "id": "nm0766005",
      "name": "Will Sasso",
      "character": "Legal Aid Lawyer"
    },
    {
      "id": "nm0001295",
      "name": "Graham Greene",
      "character": "Fishing Guide"
    },
    {
      "id": "nm1390985",
      "name": "Jay Onrait",
      "character": "Denizen Jay"
    },
    {
      "id": "nm5934066",
      "name": "Dan O'Toole",
      "character": "Denizen Dan"
    },
    {
      "id": "nm1389203",
      "name": "Darren Dutchyshen",
      "character": "Denizen Dutchy"
    },
    {
      "id": "nm3895332",
      "name": "Jon Montgomery",
      "character": "Jon"
    },
    {
      "id": "nm0192257",
      "name": "Cavan Cunningham",
      "character": "Mayor Fitzy"
    },
    {
      "id": "nm0392228",
      "name": "Karen Holness",
      "character": "Tina Fuller"
    },
    {
      "id": "nm0293433",
      "name": "Jean Freeman",
      "character": "Fitzy's Grandma"
    },
    {
      "id": "nm2009420",
      "name": "Gwen Seed",
      "character": "Mertyl"
    },
    {
      "id": "nm0004067",
      "name": "Russell Yuen",
      "character": "Won Hu"
    },
    {
      "id": "nm0002944",
      "name": "Michael Boisvert",
      "character": "Survivan Ivan"
    },
    {
      "id": "nm0732793",
      "name": "Karen Robinson",
      "character": "Powerco Debbie"
    },
    {
      "id": "nm0455631",
      "name": "Erroll Kinistino",
      "character": "Phil"
    },
    {
      "id": "nm1382676",
      "name": "Josh Strait",
      "character": "Josh"
    },
    {
      "id": "nm2965043",
      "name": "Mark D. Claxton",
      "character": "Denizen Joe       (as Mark Claxton)"
    },
    {
      "id": "nm2969222",
      "name": "Ken Mitchell",
      "character": "Denizen Gus"
    },
    {
      "id": "nm2991685",
      "name": "Lana Daborn",
      "character": "Denizen Della"
    },
    {
      "id": "nm3433165",
      "name": "Molly Kidder",
      "character": "Denizen Sarah"
    },
    {
      "id": "nm1755310",
      "name": "Sangeeta Gupta",
      "character": "Denizen Lori"
    },
    {
      "id": "nm6984571",
      "name": "Ryan Anderson",
      "character": "Denizen Mike"
    },
    {
      "id": "nm6984572",
      "name": "Leon Willey",
      "character": "Denizel Leon"
    },
    {
      "id": "nm0440511",
      "name": "Daniel Kash",
      "character": "Jerome's Lawyer"
    },
    {
      "id": "nm0502278",
      "name": "Gerald Lenton-Young",
      "character": "Older Exec"
    },
    {
      "id": "nm4008735",
      "name": "Cannon Metzer",
      "character": "Kid"
    },
    {
      "id": "nm4472457",
      "name": "Michael Maslany",
      "character": "Band Member Teen"
    },
    {
      "id": "nm2970552",
      "name": "Zach Ford",
      "character": "Wullertonite Vernon"
    },
    {
      "id": "nm3076492",
      "name": "Lucy Hill",
      "character": "Wullertonite Veronica"
    },
    {
      "id": "nm6985240",
      "name": "Sebastian Weir",
      "character": "Wullertonite Kid #1 (Boy)       (as Sebastien Weir)"
    },
    {
      "id": "nm6984573",
      "name": "Hanna Benham",
      "character": "Wullertonite Kid #1 (Girl)"
    },
    {
      "id": "nm2416719",
      "name": "Dustin MacDougall",
      "character": "Burly Man #1"
    },
    {
      "id": "nm4334741",
      "name": "Matt Rapley",
      "character": "Burly Man #2       (as Matt Ragley)"
    },
    {
      "id": "nm5957454",
      "name": "Irfan Gabriel",
      "character": "Summons Man"
    },
    {
      "id": "nm6963842",
      "name": "Julie Mombourquette",
      "character": "Coffnuts Gal"
    },
    {
      "id": "nm3360890",
      "name": "Mike James",
      "character": "Coffnuts Grandpa"
    },
    {
      "id": "nm6984575",
      "name": "Katrina Matwichuk",
      "character": "Kickstarter Katrina"
    },
    {
      "id": "nm1011075",
      "name": "Leo Fafard",
      "character": "Werewolf Bad Guy"
    },
    {
      "id": "nm0124706",
      "name": "Randy Butcher",
      "character": "Bad Guy"
    },
    {
      "id": "nm7732071",
      "name": "Lana de Lint",
      "character": "Denizen Della       (as Lana Daborn)"
    },
    {
      "id": "nm7104156",
      "name": "Michael J. Lai",
      "character": "Townsfolk"
    }
  ],
  "overview": "It’s been a few years, and there’s still not a lot going on 40 kilometers from nowhere. But that’s all about to change as the fine folks of Dog River, Saskatchewan face their biggest crisis ever. Brent and the gang discover that the town’s been badly mismanaged, leaving residents with little choice but to pack up and leave. As residents make one last rally to save Dog River as they know it, they discover a devious plan by a corporate chain that would change life for Dog Riverites forever.",
  "storyline": "As the town of Dog River goes bankrupt the residents of the town must pack up and move out. However our favourite citizens make one last-ditch effort to save Dog River.",
  "plot": "Hank, Brent, and Wanda stand silently at the Corner Gas counter. Hank cryptically asks \"How long has it been?\", with Brent answering April 13, 2009, referencing the series finale. An armed robber enters and demands money, but is attacked by Hank. The robber shoots Brent in the arm and rips off Wanda's face when she intervenes, revealing her to be a robot. Wanda uses lasers to disarm the robber, while Brent checks his now visible robotic arm. The robber turns into a werewolf, and Wanda begins to fight him when Hank wakes up with the National Star judge in front of him at the Regina Airport. They depart for Dog River, where the town is in a riot. Hank proceeds to explain the events that caused the town to fall apart.\n\nFive years after the series finale, Fitzy has blown the town's money on a bad real estate investment in Detroit, leaving the town without electricity or water. A box that Davis checked on his contract allows the town to force him to retire on his 25th anniversary of police service. He leaves Wanda to watch his house which, with its two diesel-powered backup generators, is the only place in Dog River with reliable electrical power. Wanda turns Davis' garage into an illegal bar and later a casino. Karen, married and pregnant, begins issuing tickets in order to improve her stats and her job prospects should Dog River close and thus require her to find a job in another community's police department. Oscar becomes a survivalist and trades his car for a horse, which is confiscated by Karen and repeatedly stolen back. An epiphany leads Davis to become a private detective and begin solving \"mysteries\".\n\nAfter realizing that the crisis won't blow over and Lacey will move away if Dog River goes bankrupt, Brent buys the closed town bar and enters Dog River into a \"Quaintest Town in Canada\" competition, hoping that the $75,000 prize can save the town. Emma invites Lacey and Brent to dinner to spark a romance in a bid to acquire grandchildren. Hank has a falling-out with Brent after Brent refuses to invest in his plan to bring a Coff-Nuts franchise to Dog River (which would hurt Lacey's restaurant). After Lacey advises a Coff-Nuts representative named Jerome that the town is broke, a woman representing a company called CN Holdings attempts to convince the townspeople to sell their homes. Hank overhears the woman and Jerome scheming, so he takes Jerome to Wullerton in hopes that Coff-Nuts will change its plan and ruin the rival town. He abandons Jerome, but Wullerton's astonishingly friendly citizens drive him back to Dog River. Both distracted -- Brent by repairs to the bar, and Lacey by a quest to restore the town's electricity -- Brent and Lacey forget to attend Emma's dinner.\n\nAt the bar, Jerome reveals that CN Holdings, a Coff-Nuts subsidiary, intends to use the bankrupt town's infrastructure to build a regional distribution centre. However, as he leaves the bar, he suffers an injury, causing him to file a lawsuit against Brent. Wanda volunteers to represent Brent, but she loses the case causing Corner Gas to be confiscated and the bar to be condemned.\n\nFitzy later returns with a plan to allow Wullerton to annex Dog River, which proves unpopular. Brent and Lacey then rally the town to prepare for the \"Quaintest Town in Canada\" contest judge, Tina Fuller, to enter Dog River, but a series of mishaps create the appearance of a riot in the middle of town. Everyone then gathers at The Ruby, where Lacey encourages everyone to financially support Brent, but Brent declines their aid due to the judgment against him. Tina sympathizes with the town's predicament and writes an article to garner public support for Dog River. The media attention forces Coff-Nuts to drop the lawsuit. Between the proceeds from Wanda's casino, Karen's tickets, and a fundraising drive by residents of Wullerton, the town is saved.\n\nCatastrophe averted, Lacey and Brent kiss, shocking everyone at The Ruby. Oscar encourages Brent to ask Lacey out, and they reveal that they have been dating for two years. Emma rejoices at the prospect of grandchildren, but Lacey reveals that she and Brent have decided against having children.",
  "synopsis": "Its been a few years, and theres still not a lot going on 40 kilometers from nowhere. But that's all about to change as the fine folks of Dog River, Saskatchewan face their biggest crisis ever. Brent and the gang discover that the towns been badly mismanaged, leaving residents with little choice but to pack up and leave. As residents make one last rally to save Dog River as they know it, they discover a devious plan that may change life for Dog Riverites forever."
}