{
  "imdb_id": "tt3774114",
  "tmdb_id": "302401",
  "douban_id": null,
  "title": "Snowden (2016)",
  "genres": [
    "Biography",
    "Drama",
    "Thriller"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "134 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm0000231",
      "name": "Oliver Stone"
    }
  ],
  "writer": [
    {
      "id": "nm1634307",
      "name": "Kieran Fitzgerald",
      "description": "screenplay &"
    },
    {
      "id": "nm0000231",
      "name": "Oliver Stone",
      "description": "screenplay"
    },
    {
      "id": "nm3427812",
      "name": "Anatoly Kucherena",
      "description": "book"
    },
    {
      "id": "nm4816469",
      "name": "Luke Harding",
      "description": "book"
    }
  ],
  "cast": [
    {
      "id": "nm0502425",
      "name": "Melissa Leo",
      "character": "Laura Poitras"
    },
    {
      "id": "nm0704270",
      "name": "Zachary Quinto",
      "character": "Glenn Greenwald"
    },
    {
      "id": "nm0330687",
      "name": "Joseph Gordon-Levitt",
      "character": "Edward Snowden"
    },
    {
      "id": "nm0124964",
      "name": "Jaymes Butler",
      "character": "Drill Sergeant"
    },
    {
      "id": "nm0278755",
      "name": "Robert Firth",
      "character": "Dr. Stillwell"
    },
    {
      "id": "nm5564735",
      "name": "Rachel Handshaw",
      "character": "CIA Polygraph Adminstrator"
    },
    {
      "id": "nm2757852",
      "name": "Christian Contreras",
      "character": "CIA Psychologist"
    },
    {
      "id": "nm4554036",
      "name": "Parker Sawyers",
      "character": "CIA Interviewer"
    },
    {
      "id": "nm0406975",
      "name": "Rhys Ifans",
      "character": "Corbin O'Brian"
    },
    {
      "id": "nm0859104",
      "name": "Ken Thomas",
      "character": "Warrenton Gate Guard       (as Kenneth Thomas)"
    },
    {
      "id": "nm0000115",
      "name": "Nicolas Cage",
      "character": "Hank Forrester"
    },
    {
      "id": "nm0073121",
      "name": "Michael Benz",
      "character": "CIA Student"
    },
    {
      "id": "nm0940362",
      "name": "Shailene Woodley",
      "character": "Lindsay Mills"
    },
    {
      "id": "nm0929489",
      "name": "Tom Wilkinson",
      "character": "Ewen MacAskill"
    },
    {
      "id": "nm0000613",
      "name": "Joely Richardson",
      "character": "Janine Gibson"
    },
    {
      "id": "nm0746583",
      "name": "Nicholas Rowe",
      "character": "Assistant Editor Guardian"
    },
    {
      "id": "nm0330983",
      "name": "Demetri Goritsas",
      "character": "CIA Supervisor"
    },
    {
      "id": "nm0648249",
      "name": "Timothy Olyphant",
      "character": "CIA Agent Geneva"
    },
    {
      "id": "nm3115493",
      "name": "Ben Schnetzer",
      "character": "Gabriel Sol"
    },
    {
      "id": "nm0761395",
      "name": "Erol Sander",
      "character": "Diplomat Party Guest"
    },
    {
      "id": "nm1809646",
      "name": "Suzanne Gilbert",
      "character": "Woman Party Guest       (as Suzie Gilbert)"
    },
    {
      "id": "nm3427812",
      "name": "Anatoly Kucherena",
      "character": "Russian Diplomat"
    },
    {
      "id": "nm8419678",
      "name": "Valentina Kuitko",
      "character": "Russian Translator"
    },
    {
      "id": "nm0080282",
      "name": "Bhasker Patel",
      "character": "Marwan Al-Kirmani"
    },
    {
      "id": "nm8419679",
      "name": "Olga Koda",
      "character": "Pole Dancer"
    },
    {
      "id": "nm0126341",
      "name": "Patrick Joseph Byrnes",
      "character": "NSA Dep. Director Lowell"
    },
    {
      "id": "nm3453330",
      "name": "Christy Meyer",
      "character": "Epilepsy Doctor"
    },
    {
      "id": "nm2207222",
      "name": "Scott Eastwood",
      "character": "Trevor James"
    },
    {
      "id": "nm3147751",
      "name": "LaKeith Stanfield",
      "character": "Patrick Haynes       (as Lakeith Lee Stanfield)"
    },
    {
      "id": "nm1317164",
      "name": "Stephanie Simbeck",
      "character": "Female Drone Pilot"
    },
    {
      "id": "nm1334869",
      "name": "Logan Marshall-Green",
      "character": "Male Drone Pilot"
    },
    {
      "id": "nm2256122",
      "name": "Eric Kofi-Abrefa",
      "character": "NSA Tunnel Guard 1"
    },
    {
      "id": "nm0908220",
      "name": "Stanley I. Walker Jr.",
      "character": "NSA Tunnel Guard 2       (as Stanley Walker)"
    },
    {
      "id": "nm0001035",
      "name": "Ben Chaplin",
      "character": "Robert Tibbo"
    },
    {
      "id": "nm6577020",
      "name": "Mathangi Ray",
      "character": "Mother - Tong Lau Hong Kong"
    },
    {
      "id": "nm8419681",
      "name": "Ashani Perera",
      "character": "Girl - Tong Lau Hong Kong"
    },
    {
      "id": "nm1213889",
      "name": "Alan Rusbridger",
      "character": "Moderator"
    },
    {
      "id": "nm5722984",
      "name": "Edward Snowden",
      "character": "Edward Snowden"
    }
  ],
  "overview": "CIA employee Edward Snowden leaks thousands of classified documents to the press.",
  "storyline": "SNOWDEN stars Joseph Gordon-Levitt and is written and directed by Oliver Stone. The script is based on the books The Snowden Files: The Inside Story of the World's Most Wanted Man by Luke Harding and Time of the Octopus by Anatoly Kucherena.",
  "plot": "In 2013, Edward Snowden arranges a clandestine meet in Hong Kong with documentarian Laura Poitras and journalist Glenn Greenwald. They discuss releasing the classified information in the former’s possession regarding illegal mass surveillance conducted by the National Security Agency (NSA).\n\nIn 2004, Snowden is undergoing basic training, having enlisted in the U.S. Army with intentions of matriculating to the Special Forces. He eventually fractures his tibia, and is informed that he will be receiving an administrative discharge and that he may serve his country in other ways.\n\nSnowden applies for a position at the Central Intelligence Agency (CIA) and subsequently undergoes the screening process. Initially his answers to the screening questions are insufficient, but Deputy Director Corbin O'Brian decides to take a chance on him, given the demands of such extraordinary times. Snowden is then brought to \"The Hill\" where he is educated and tested on cyberwarfare. He learns about the Foreign Intelligence Surveillance Act, which circumvents the Fourth Amendment rights of U.S. citizens by allowing warrant requests to be approved by a panel of judges that were appointed by the chief justice. Snowden and his peers are each tasked with building a covert communications network in their hometown, deleting it, and then rebuilding it in eight hours or less, with five being the average time taken. Snowden impresses O'Brian when he completes the exercise in 38 minutes.\n\nMeanwhile, Snowden meets Lindsay Mills via a dating website. The two bond, despite sharply contrasting political ideologies. Snowden acquires his first post abroad working with diplomatic cover in Geneva in 2007, taking Mills with him. He meets Gabriel Sol, who has ample experience in electronic surveillance. Snowden begins questioning the ethical implications of their assignment. After his superior decides to set up their target on a DUI charge in order to leverage information from him, Snowden resigns from the CIA.\n\nSnowden later takes a position with the NSA in Japan, initially under the pretense of building a program that would allow the government to back up all critical data from the Middle East in an emergency, a program which he names \"Epic Shelter\". Snowden learns of the practices the NSA and other U.S. Government agencies are using not just in Japan, but in most countries the U.S. is currently allied with, which include planting malware in different computers that manage government, infrastructure and financial sectors so that, in the event that any allies turn against the US, that country can effectively be shut down in retaliation. The stress associated with the job results in the end of his relationship with Mills, who moves back with her family in Maryland.\n\nThree months later, Snowden has left his post with the NSA and returned to Maryland where he and Mills resume their relationship and he takes a position consulting for the CIA. During a hunting trip, O'Brian reveals an operation in Oahu that revolves around counterattacking Chinese hackers. After Snowden is diagnosed with epilepsy, Mills agrees that he should join the operation for she believes the environment in Hawaii may be beneficial for him. Upon beginning his new job in \"The Tunnel\", an underground World War II bunker that has been repurposed for massive electronic surveillance and SIGINT operations, Snowden learns that Epic Shelter is actually providing real-time data that assists U.S. drone pilots in launching lethal strikes against terror suspects in Afghanistan.\n\nSnowden ultimately becomes disillusioned with what he is a part of. It culminates in Snowden smuggling a microSD card into his office by way of a Rubik's Cube, and loading all relevant data. He then tells his colleagues he is feeling ill and departs. He advises Mills to fly home to Maryland, after which he contacts Poitras and Greenwald to schedule the meeting.\n\nWith the help of journalist Ewen MacAskill, the information is disseminated to the press on June 5, 2013, with additional leaks published in the following days. In the aftermath, with the help of MacAskill, Greenwald and Poitras, Snowden is smuggled out of Hong Kong on a flight bound for Latin America by way of Russia. However, the U.S. Government revokes his passport, forcing him to remain in Moscow indefinitely. He is eventually granted asylum for three years, with Mills joining him at a later date. Snowden continues his activism.",
  "synopsis": "Hong Kong - Monday June 3, 2013Documentary filmmaker Laura Poitras (Melissa Leo) meets with columnist Glenn Greenwald (Zachary Quinto) at a hotel. They are met by Edward Snowden (Joseph Gordon-Levitt) in the lobby. Snowden brings the two to his room to begin documenting everything that has led up to this moment.In a flashback to 2004, Snowden was enlisted in the Special Forces as a candidate. Although he was persistent, he suffered an injury when he broke his legs after landing on them during a drill. The doctor tells Snowden that his legs were broken for weeks but only now have sustained a more serious injury. He warns Snowden that the bones in his legs will turn to powder if he lands on them again, so Snowden is discharged from the military.In 2006, Snowden began training for a position at the Central Intelligence Agency. He started a class under Corbin O'Brian (Rhys Ifans). One of Snowden's first tests is to solve a problem using a sequence. Snowden finishes first, and O'Brian checks his work to see what mistake he made. Snowden explains that he solved the problem by going out of order in the sequence, to the surprise of not only O'Brian, but the rest of the class as well.Snowden befriends a professor named Hank Forrester (Nicolas Cage), who appears to have had an influence on Snowden far more than O'Brian.Outside of work, Snowden chats online with a girl named Lindsay Mills (Shailene Woodley). They finally meet up one afternoon and go for a walk around the park. Lindsay takes several photos of Snowden, and they end up having their first kiss.In the present day of June 4, 2013 in Hong Kong, Snowden, Poitras, and Greenwald are joined by Ewen MacAskill (Tom Wilkinson), an intelligence reporter from The Guardian. MacAskill reports to editor Janine Gibson (Joely Richardson) in regards to the story that Snowden is telling them.In a flashback to 2007, Snowden is stationed in Geneva, Switzerland to maintain computer network security. Lindsay joins him on his trip. He meets with a CIA agent (Timothy Olyphant) who guides him through his task.Snowden and Lindsay are at a party with a number of diplomats and other special guests in attendance. His task is to find a banker for surveillance purposes. With Lindsay's help, Snowden meets a banker named Marwan Al-Kirmani (Bhasker Patel). Later on, Snowden learns through his colleague Gabriel Sol (Ben Schnetzer) that Al-Kirmani's name is being looked up to gather personal information on him, and that the program the CIA is developing allows them to spy on people through lenses even when they are not being used. Snowden and Gabriel find out that Al-Kirmani's daughter is with a man who is seeing another woman, and is, along with his mother, living illegally in the United States.Snowden and the agent later meet up with Al-Kirmani in a hotel. Al-Kirmani appears distressed after he tells the men that his daughter's fiance and his mother got deported. The man gets drunk, and the agent encourages him to go home. After seeing how morally bankrupt the people he works for are, Snowden decides to quit the CIA. He expresses his feelings to Lindsay over the notion that he would have been responsible for the lives of millions.In 2009, Snowden begins working at Dell as a supervisor on NSA computer system upgrades. He is assigned to an airbase in Tokyo, where Lindsay follows him again. In Tokyo, he works as a subcontractor and instructs top officials on how to protect their systems from Chinese hackers.In the present day 2013, the journalists hit a bump when Janine is hesitant in publishing Snowden's documents, clashing with Greenwald in the process. MacAskill tries to keep her on their side so that they may get their work done.In 2012, Snowden works for Booz Allen Hamilton. With their ties to the NSA, Snowden begins to observe work that he finds disturbing, in which he realizes that the government is actively spying on people through a number of programs, including PRISM. He starts to collect the documents he uncovers in a dossier, all containing information on the NSA's surveillance practices.Snowden seizes his opportunity to get the documents when one team causes a problem with their work. While everyone is distracted, Snowden downloads the files onto his drive and manages to get everything he needs before someone sees. Afterward, he hides the drive in the square of a Rubik's cube and tosses it to one of the men at the gate as a friendly gesture to avoid setting off any alarms. When that's done, he walks away proudly.With his story finished, Snowden's documents are published by The Guardian. It soon gets sent to news outlets all around the world. The reports on the NSA scandal become global news. Snowden is forced to leave the country and say goodbye to Lindsay, and he is seen by many as either a traitor or a hero.The last scene is in an auditorium where Snowden makes an appearance through a remote-controlled monitor to an audience of college students. He says he would hope to return to the United States for a fair trial, but he knows now is not the time for that to happen. The moderator asks him how his life has changed since doing what he did. We then see the REAL Edward Snowden saying that he has given up a lot of things since he became a whistleblower, but he has no regrets because he knows in his heart that he was doing the right thing. The audience applauds him, and the film closes on Snowden smiling.The final text states that Edward Snowden has been living in Moscow since 2013 in hiding, and Lindsay Mills flew over there to join him."
}