{
  "imdb_id": "tt3734636",
  "tmdb_id": "425535",
  "douban_id": null,
  "title": "Making It (2015)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "100 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm5627006",
      "name": "Stephen Glover"
    }
  ],
  "writer": [
    {
      "id": "nm4302096",
      "name": "Richard Crawley",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4302096",
      "name": "Richard Crawley",
      "character": "George Banbury"
    },
    {
      "id": "nm6500291",
      "name": "James Anthony",
      "character": "Toby"
    },
    {
      "id": "nm2045509",
      "name": "William de Coverly",
      "character": "Lawrence"
    },
    {
      "id": "nm3971488",
      "name": "Nadia Albina",
      "character": "Mandy"
    },
    {
      "id": "nm3152422",
      "name": "Julia Sandiford",
      "character": "Poppy Clarke"
    },
    {
      "id": "nm6654403",
      "name": "Isobella Hubbard",
      "character": "Katherine"
    },
    {
      "id": "nm3575759",
      "name": "Gethin Alderman",
      "character": "Robin"
    },
    {
      "id": "nm6654404",
      "name": "Clare Fraenkel",
      "character": "Bev"
    },
    {
      "id": "nm1310693",
      "name": "Maggie McCourt",
      "character": "George's Mum"
    },
    {
      "id": "nm1246409",
      "name": "Philip Harvey",
      "character": "George's Dad"
    },
    {
      "id": "nm6654405",
      "name": "Philip D. McQuillan",
      "character": "Tim       (as Philip Duguid-McQuillan)"
    },
    {
      "id": "nm3106044",
      "name": "Annabel Bates",
      "character": "Julie"
    },
    {
      "id": "nm6654406",
      "name": "Richard Scott",
      "character": "Theo"
    },
    {
      "id": "nm5174560",
      "name": "Mark Lawson",
      "character": "David"
    },
    {
      "id": "nm2383358",
      "name": "Rachel Dale",
      "character": "Shop Assistant"
    },
    {
      "id": "nm2380226",
      "name": "Ed Eales White",
      "character": "Trygve"
    },
    {
      "id": "nm5105026",
      "name": "Amalia Vitale",
      "character": "Dorota"
    },
    {
      "id": "nm2363918",
      "name": "Penelope Granycome",
      "character": "Penny"
    },
    {
      "id": "nm5543953",
      "name": "Jamie Bacon",
      "character": "Carl"
    },
    {
      "id": "nm5532732",
      "name": "James French",
      "character": "Trigger"
    },
    {
      "id": "nm6654407",
      "name": "Emily Hickman",
      "character": "Sally"
    },
    {
      "id": "nm4277762",
      "name": "Barry Fitzgerald",
      "character": "Joe"
    },
    {
      "id": "nm5092668",
      "name": "Rebecca Scott",
      "character": "David's Wife"
    },
    {
      "id": "nm6065970",
      "name": "Louis Devereux",
      "character": "Waiter"
    },
    {
      "id": "nm5627006",
      "name": "Stephen Glover",
      "character": "Boat man"
    },
    {
      "id": "nm10657226",
      "name": "Dan Gold",
      "character": "Radio Presenter"
    },
    {
      "id": "nm7014781",
      "name": "Joanna Hickman",
      "character": "Grace"
    },
    {
      "id": "nm5364182",
      "name": "Antony Jardine",
      "character": "Ferdy"
    },
    {
      "id": "nm6966837",
      "name": "Lucia McAnespie",
      "character": "Val"
    },
    {
      "id": "nm4100747",
      "name": "Simon Yadoo",
      "character": "Intern"
    }
  ],
  "overview": "MAKING IT is an original and quirky comedy following one man’s search for love, creative fulfilment and a pencil sharper.  George Banbury is a thirty-three year old struggling actor best known for having appeared alongside a troll in a Wine Gums advert. Stuck in a rut and living with his parents, George is going nowhere fast. An unexpected pregnancy and a chance encounter with an ex-girlfriend sees George attempt to expose his inner leading man to a world that has already cast him as a supporting artiste.",
  "storyline": "A south London based comedy-drama about one man's efforts to make his mark on the world. George Banbury is a thirty-three year old struggling actor best known for having appeared alongside a troll in a Wine Gums advert. Stuck in a rut, living with his parents and working a minimum wage job, a series of events unexpectedly sees George embark on a quest for love, creative fulfilment and a pencil sharpener. Inspired by films such as Happy Go Lucky, Tiny Furniture and Annie Hall, making it explores the tribulations faced by a generation of twenty- and thirty-somethings trying to make sense of life. A quirky, upbeat take on middle-class London, this film will resonate with anyone who has asked themselves \"is this really it?\".",
  "plot": "At Culver University in Virginia, General Thunderbolt Ross meets with Dr. Bruce Banner, the colleague and boyfriend of his daughter Betty, regarding an experiment that Ross claims is meant to make humans immune to gamma radiation. The experiment — part of a World War II era \"super soldier\" program that Ross hopes to recreate — fails, and the exposure to gamma radiation causes Banner to transform into the Hulk for brief periods of time, whenever his heart rate rises above 200. The Hulk destroys the lab and injures or kills the people inside. Banner becomes a fugitive from the U.S. military and Ross in particular, who wants to weaponize the Hulk process.\n\nFive years later,[N 1] Banner works at a bottling factory in Rocinha, Rio de Janeiro in Brazil, while searching for a cure for his condition. On the Internet, he collaborates with a colleague he knows only as \"Mr. Blue\", and to whom he is \"Mr. Green\". He is also learning meditative breathing techniques to help keep control, and has not transformed in five months. After Banner cuts his finger, a drop of his blood falls into a bottle, and is eventually ingested by an elderly consumer in Milwaukee, Wisconsin, giving him gamma sickness. Using the bottle to track down Banner, Ross sends a SWAT team, led by Russian-born British Royal Marine Emil Blonsky, to capture him. Banner transforms into the Hulk and defeats Blonsky's team. After Ross explains how Banner became the Hulk, Blonsky agrees to be injected with a small amount of a similar serum, which gives him enhanced speed, strength, agility, and healing, but also begins to deform his skeleton and impair his judgment.\n\nBanner returns to Culver University and reunites with Betty, who is dating psychiatrist Leonard Samson. Banner is attacked by Ross and Blonsky's forces, tipped off by the suspicious Samson, causing him to again transform into the Hulk. The ensuing battle outside the university proves to be futile for Ross' forces and they eventually retreat, though Blonsky, whose sanity is starting to falter, boldly attacks and mocks the Hulk. The Hulk seemingly kills Blonsky and flees with Betty. After the Hulk reverts to Banner, he and Betty go on the run, and Banner contacts Mr. Blue, who urges them to meet him in New York City. Mr. Blue is actually cellular biologist Dr. Samuel Sterns, who tells Banner he has developed a possible antidote to Banner's condition. After a successful test, he warns Banner that the antidote may only reverse each individual transformation. Sterns reveals he has synthesized Banner's blood samples, which Banner sent from Brazil, into a large supply, with the intention of applying its \"limitless potential\" to medicine. Fearful of the Hulk's power falling into the military's hands, Banner wishes to destroy the blood supply.\n\nMeanwhile, Blonsky is revealed to have survived the battle and has completely healed. He joins Ross' forces for a third attempt to take Banner into custody. They succeed and Banner, along with Betty, are taken away in a helicopter. Blonsky stays behind and forces Sterns to inject him with Banner's blood, as he covets the Hulk's power. Sterns warns that the combination of the super-soldier formula and Banner's blood may cause him to become an \"abomination\", but Blonsky insists. The experiment mutates Blonsky into a creature with size and strength surpassing that of the Hulk, but drives him mad. He attacks Sterns, who gets some of Banner's blood in a cut on his forehead, causing him to begin mutating as well. Blonsky then rampages through Harlem. Realizing that the Hulk is the only one who can stop Blonsky, Banner convinces Ross to release him. He jumps from Ross' helicopter and transforms after hitting the ground. After a long and brutal battle through Harlem, the Hulk defeats Blonsky. After having a small, peaceful moment with Betty, the Hulk flees from New York.\n\nA month later, Banner is in Bella Coola, British Columbia. Instead of trying to suppress his transformation, he successfully transforms in a controlled manner. In a final scene, Tony Stark approaches Ross at a local bar and informs him a team is being put together.",
  "synopsis": null
}