{
  "imdb_id": "tt3802576",
  "tmdb_id": "330037",
  "douban_id": null,
  "title": "Brothers (2015)",
  "genres": [
    "Action",
    "Drama",
    "Sport"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "156 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.7,
  "director": [
    {
      "id": "nm1633551",
      "name": "Karan Malhotra"
    }
  ],
  "writer": [
    {
      "id": "nm0640334",
      "name": "Gavin O'Connor",
      "description": "original story &"
    },
    {
      "id": "nm0233561",
      "name": "Cliff Dorfman",
      "description": "original story"
    },
    {
      "id": "nm1749719",
      "name": "Ekta Pathak Malhotra",
      "description": "adapted screenplay"
    },
    {
      "id": "nm3789785",
      "name": "Siddharth",
      "description": "dialogue &"
    },
    {
      "id": "nm5969139",
      "name": "Garima",
      "description": "dialogue"
    },
    {
      "id": "nm3294574",
      "name": "Anthony Tambakis",
      "description": "orignal story"
    }
  ],
  "cast": [
    {
      "id": "nm0474774",
      "name": "Akshay Kumar",
      "character": "David Fernandes"
    },
    {
      "id": "nm3289096",
      "name": "Sidharth Malhotra",
      "character": "Monty Fernandes"
    },
    {
      "id": "nm0006763",
      "name": "Jackie Shroff",
      "character": "Garson Fernandes"
    },
    {
      "id": "nm2596365",
      "name": "Jacqueline Fernandez",
      "character": "Jenny"
    },
    {
      "id": "nm4231730",
      "name": "Meghan Jadhav",
      "character": "Teenage David"
    },
    {
      "id": "nm0156858",
      "name": "Shefali Shah",
      "character": "Mary Fernandes       (as Shefali Shetty)"
    },
    {
      "id": "nm0474820",
      "name": "Kiran Kumar",
      "character": "Peter Briganza"
    },
    {
      "id": "nm0709359",
      "name": "Ashutosh Rana",
      "character": "Paasha"
    },
    {
      "id": "nm0451425",
      "name": "Kulbhushan Kharbanda",
      "character": "Principal"
    },
    {
      "id": "nm1596214",
      "name": "Ashok Lokhande",
      "character": "Monty's Coach"
    },
    {
      "id": "nm0958861",
      "name": "Raj Zutshi",
      "character": "Baaz Rawat       (as Rajendranath Zutshi)"
    },
    {
      "id": "nm7522630",
      "name": "Roderick Harding",
      "character": "Judge       (as Rod Herding)"
    },
    {
      "id": "nm1947403",
      "name": "Conan Stevens",
      "character": "Luca"
    },
    {
      "id": "nm0076780",
      "name": "Daniel Bernhardt",
      "character": "Max Potter"
    },
    {
      "id": "nm0004626",
      "name": "Kareena Kapoor",
      "character": "Mary"
    },
    {
      "id": "nm0810653",
      "name": "Ron Smoorenburg",
      "character": "Hammer"
    },
    {
      "id": "nm1882579",
      "name": "Zachary Coffin",
      "character": "Fight Medic"
    },
    {
      "id": "nm2414411",
      "name": "Shad Gaspard",
      "character": "Ronnie Cross"
    },
    {
      "id": "nm2382250",
      "name": "Chan Griffin",
      "character": "Tenzin"
    },
    {
      "id": "nm8230473",
      "name": "Hemant Aangrish",
      "character": "Gama"
    },
    {
      "id": "nm8230474",
      "name": "Ankush",
      "character": "Rana Singh Hooda"
    },
    {
      "id": "nm3750312",
      "name": "Gaurav Bakshi",
      "character": "Sport's Minister"
    },
    {
      "id": "nm8967830",
      "name": "Prateik Bhanushali",
      "character": "Middle Monty"
    },
    {
      "id": "nm8967832",
      "name": "Nishit Harshad Broker",
      "character": "Chandran"
    },
    {
      "id": "nm8967826",
      "name": "Eric Brown",
      "character": "Lucas TV Opponent 2"
    },
    {
      "id": "nm6071681",
      "name": "Ramakant Dayama",
      "character": "Tyagi"
    },
    {
      "id": "nm8633354",
      "name": "Sukanya Dhanda",
      "character": "Desai's wife"
    },
    {
      "id": "nm8967836",
      "name": "Dorothy",
      "character": "Mrs. Sam"
    },
    {
      "id": "nm8967831",
      "name": "Zubin Vicky Driver",
      "character": "Swami"
    },
    {
      "id": "nm8967834",
      "name": "Shilpa Gandhi",
      "character": "Poopoo's Doctor"
    },
    {
      "id": "nm8967828",
      "name": "Arsh Gyani",
      "character": "Young David"
    },
    {
      "id": "nm8230475",
      "name": "Abbas Hayder",
      "character": "Suleman"
    },
    {
      "id": "nm6091397",
      "name": "Gowhar Khan",
      "character": "Khalid Nadir"
    },
    {
      "id": "nm8536228",
      "name": "Naisha Khanna",
      "character": "Poopoo"
    },
    {
      "id": "nm8967839",
      "name": "Avdhesh Kumar",
      "character": "Constable Bhonsle"
    },
    {
      "id": "nm8967829",
      "name": "Darsheel Kumar",
      "character": "Young Monty"
    },
    {
      "id": "nm8967827",
      "name": "Mike Lehr",
      "character": "Lucas TV Opponent 1"
    },
    {
      "id": "nm8967837",
      "name": "Ramneeka Lobo",
      "character": "Suzan"
    },
    {
      "id": "nm7179196",
      "name": "Ramneeka Dhillon Lobo",
      "character": "Mrs. Sujaan"
    },
    {
      "id": "nm1335248",
      "name": "Arvind Parab",
      "character": "Old Man with Mic"
    },
    {
      "id": "nm8624065",
      "name": "Burjor Patel",
      "character": "Uncle Sam"
    },
    {
      "id": "nm2691198",
      "name": "Chandra Prakash",
      "character": "Announcer"
    },
    {
      "id": "nm2016965",
      "name": "Vlad Rimburg",
      "character": "R2F Refree       (as Vladislav Rimburg)"
    },
    {
      "id": "nm8967833",
      "name": "Subrat Samonto",
      "character": "Manager Patil"
    },
    {
      "id": "nm8967835",
      "name": "Shaqib Shaikh",
      "character": "Video Uploader"
    },
    {
      "id": "nm6968443",
      "name": "Honey Sharma",
      "character": "Mustafa"
    },
    {
      "id": "nm1404287",
      "name": "Kavi Shastri",
      "character": "Sachin Mehra"
    },
    {
      "id": "nm8967838",
      "name": "Harsh Singh",
      "character": "Santosh Desai"
    }
  ],
  "overview": "Brothers is an upcoming Hindi film, directed by Karan Malhotra and produced by Karan Johar under Dharma Productions along with Lionsgate Films and Endemol India.[6] The film is an official remake of the 2011 Hollywood film Warrior.",
  "storyline": "The story of two estranged brothers comes to play in the rink. David Fernandes quits his job as a Physics teacher to become a full-time fighter. He is willing to do whatever it takes to save his ill daughter. Monty Fernandes creates a storm on the internet with just one video. Finally getting the chance to prove himself to the world, he trains vigorously. Two brothers, two fighters, and one ultimate fight.",
  "plot": "The film opens in medias res where street fighting issues are raised in Mumbai. Sports chairman Peter Braganza (Kiran Kumar) expresses his desire of making street fighting a legal sport and decides to open a league called Right 2 Fight (R2F). Meanwhile, in prison, Garson \"Gary\" Fernandes (Jackie Shroff), a recovering alcoholic and former MMA expert under rehabilitation, is released from his jail term and his younger son Monty (Sidharth Malhotra) comes to pick him up. Monty gets angry when his father asks about his elder son David and takes him away to their home. At home Gary acts protective of all the belongings of his wife Maria, who died many years ago. David (Akshay Kumar), now a physics teacher, has a daughter suffering from a kidney disease. Unable to arrange money from the bank and other sources he arranges money through street fights. This enrages his wife Jenny (Jacqueline Fernandez) as she is worried about David. Meanwhile, Gary, who misses his wife Maria (Shefali Shah), starts hallucinating about her. Gary then tries to meet David but the latter ends up throwing Monty and Gary out of his house in rage.\n\nMonty is then revealed to be Gary's illegitimate child. Maria nevertheless loved Monty, as did David. The two brothers had a close, loving relationship when David was aged 18 and Monty was aged 14. One night on Monty's 15th birthday, Gary came home drunk and apologizes to Maria for destroying the family, but mentions his lover Sarah's name, instead of Maria's. An enraged Maria confronts Gary about this. In a drunken stupor, Gary hits Maria who gets injured and dies. A furious David pushes Gary aside. When Monty comes close to Maria, David angrily pushed him away, holding his father and brother equally responsible for his mother's death. This creates a rift between Gary, Monty and David.\n\nDavid later loses his job as school principal Shobhit Desai (Kulbhushan Kharbanda) learn s about David's involvement in street fights. Monty, who wants to be a fighter, is then introduced to Suleiman Pasha (Ashutosh Rana), a fight agent. Suleiman fixes a match with Mustafa in which Monty gets defeated. This enrages Gary and Monty decides a rematch with Mustafa, where Monty defeats Mustafa and is declared a selected fighter for R2F by Peter. The fight gets recorded and uploaded on YouTube and soon Monty becomes an internet sensation. Monty undergoes training to become the R2F champion. Meanwhile, David too decides to be a full-time fighter and Jenny encourages him to do so. Suleiman trains David and fixes a match while Monty celebrates his victory at a bar. David soon is victorious in the fight. R2F soon becomes a sensation and fighters from all over the world show their interest in the league. Eventually, brothers David and Monty make it to the finals.\n\nGary, feeling guilty, leaves the arena as he thinks that he is responsible for the conflict between the brothers. Pasha advises David to not let his relationship with Monty get in the way of his win. The match begins. Both David and Monty put up a strong fight, however David eventually ends up breaking Monty's shoulder. He immediately shows concern for his younger brother, but Pasha asks him to keep fighting and not care about Monty's arm. Gary rushes to David and apologizes for his mistakes. He asks David to not take out his anger towards him on Monty, and reminds him that Monty is his brother. David, already conflicted, turns to Monty and envisions a young Monty instead. Monty, on the other hand, agrees to continue the match despite a broken shoulder and blurred vision. The match continues. David overpowers Monty once again. While David keeps Monty pinned to the ground, he asks Monty to stop fighting. Monty, in turn, says that David has always only thought of himself as he deserted Monty out of anger once Maria died, and asks him to keep hitting. David is overridden with guilt and sorrow; moved to tears, he apologizes. Seeing this, Monty surrenders the match. Monty reconciles with David and the latter takes Monty away in his arms.",
  "synopsis": null
}