{
  "imdb_id": "tt3854562",
  "tmdb_id": "329628",
  "douban_id": null,
  "title": "Star Trek: Horizon (2016)",
  "genres": [
    "Action",
    "Adventure",
    "Sci-Fi"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "102 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm4548941",
      "name": "Tommy Kraft"
    }
  ],
  "writer": [
    {
      "id": "nm4548941",
      "name": "Tommy Kraft",
      "description": null
    },
    {
      "id": "nm0734472",
      "name": "Gene Roddenberry",
      "description": "Based upon \"Star Trek\" created by"
    }
  ],
  "cast": [
    {
      "id": "nm3583756",
      "name": "Paul Lang",
      "character": "Captain Harrison Hawke"
    },
    {
      "id": "nm4689876",
      "name": "Marc Bowers",
      "character": "Commander Jackson Gates"
    },
    {
      "id": "nm4778068",
      "name": "Ryan Webber",
      "character": "Commander Francis Brookes       (as Ryan A. Webber)"
    },
    {
      "id": "nm5318801",
      "name": "Callie Bussell",
      "character": "Lieutenant T'Mar"
    },
    {
      "id": "nm4963099",
      "name": "Jeannine Thompson",
      "character": "Lieutenant Amelia Yarris"
    },
    {
      "id": "nm5427976",
      "name": "Ashley Croft",
      "character": "Ensign Marie Sutherland"
    },
    {
      "id": "nm6622320",
      "name": "Tom McClure",
      "character": "Lieutenant Tom Samuels"
    },
    {
      "id": "nm4504092",
      "name": "Tim Kaiser",
      "character": "Admiral Gardner"
    },
    {
      "id": "nm3064669",
      "name": "Ryan T. Husk",
      "character": "Admiral Verak"
    },
    {
      "id": "nm4397002",
      "name": "Rocco Guirlanda",
      "character": "Daekon"
    },
    {
      "id": "nm1066970",
      "name": "Rico E. Anderson",
      "character": "Ambassador Salak       (as Rico Anderson)"
    },
    {
      "id": "nm5320204",
      "name": "David Wunderlich",
      "character": "Commansour Hasaht       (as Dave Wunderlich)"
    },
    {
      "id": "nm3777618",
      "name": "Caroline Rankin",
      "character": "Preyopt Janyo       (as Caroline Kelly Rankin)"
    },
    {
      "id": "nm6631275",
      "name": "Todd Lutz",
      "character": "Bridge Officer"
    },
    {
      "id": "nm7969728",
      "name": "Christopher K. Blackmon",
      "character": "Chief Moore       (as Christopher Blackman)"
    }
  ],
  "overview": "The Coalition of Planets, a young alliance of worlds led by Earth, is at war with the Romulan Empire. Desperate for a chance to gain the upper hand in the war, the Coalition forms an alliance with T’mar, a Romulan deserter, in the hopes that she can provide valuable intelligence on her former masters.",
  "storyline": "In a time prior to the United Federation of Planets, a young coalition of worlds led by Earth battle the Romulan Star Empire for their very survival.",
  "plot": "At the direction of Starfleet, Enterprise makes a detour to a planet passing between two gas giants, in order to obsereve the gravitational forces and subsequent volcanic activity. Their new course takes the ship close to that of E.C.S. Horizon, the cargo vessel where Ensign Mayweather grew up. He then requests permission for a further detour to re-join his family on Horizon as his father is ill and he hasn't been able to visit him in four years. Captain Archer readily agrees, but bad news arrives when Mayweather learns that his father died some six weeks earlier.\n\nAs planned, Mayweather boards Horizon and receives a warm welcome from most of the crew, including his mother Rianna. He also finds out that his brother, Paul, has been named acting captain, but he doesn't seem to be coping well with his new responsibilities. Mayweather offers to make a few repairs and upgrades to systems on the ship, but Paul tells him to stop, making him feel uneasy and out of place. Soon afterwards, the ship suddenly comes under attack, and a homing device is placed on the hull. Mayweather then recommends a boost in the ship's fighting capability, but Paul insists that the safest course is to flee to the nearest port and yield the cargo as needed.\n\nBack on Enterprise, Commander Tucker arranges a movie night for the crew featuring the Frankenstein film trilogy, and invites Sub-Commander T'Pol. She eventually consents, and finally finds in the film an insightful view into historical Human-Vulcan relations. Meanwhile, Mayweather makes his intended modifications without permission, resulting in a confrontation when Paul finds out. The ship comes under further attack from an alien vessel, and Paul offers up the cargo as planned. The aliens refuse and demand the vessel as well. Left without any other option, Paul tells Mayweather to re-initiate the modifications, and to detach the command module from the cargo section. They soon disable the alien ship. The brothers reconcile, and Mayweather leaves, promising to visit again soon.",
  "synopsis": "The film is set in the era of Star Trek: Enterprise, with the NX-01 even putting in a brief cameo, but it's the NX-04, the Discovery, Commanded by Captain Hawke (Paul Lang), and her crew is the primary focus of the story.There are numerous tie in's to the different Star Trek series' which bring Horizon into canon. Horizon fills the void between First Contact and TOS regarding the \"Federation's\" conflict with the Romulans.The film opens with a prologue 250,000 years earlier, during the last moments of a war between the Arioui and the Iconians. Some of the last remaining Iconians manage to Stargate away a planet with a massively powerful weapon and hide it from the Arioui, who, it is implied would have used it to rule or destroy the rest of the galaxy. The planet's name is Horizon, and those last Arioui keep it hidden, lest it fall into the wrong hands.The first scene in the present time begins with Discovery racing back to earth to get T'mar and her secrets to Starfleet Command with several Romulan ships Commanded by Admiral Verak (Ryan Husk) in pursuit. In a running battle with a trio of Romulan Warbirds. The Discovery has a newly discovered Romulan defector, T'mar (Callie Bussell) on board and the chasing Warbirds want her back - dead or alive.They take heavy damage and suffer casualties. The Enterprise makes a cameo here, swooping in to save them at the last moment. Captain Archer's ship makes several appearances throughout the movie, which Enterprise fans will love. Discovery limps back to space dock to undergo repairs and debrief.After an all-too narrow escape it is found that T'mar is a wealth of tactical knowledge and revels that the Romulans are building a weapon of mass destruction. Thus the stage is set, and the Discovery is set out to find out the truth of what the Romulans are up to and to prevent them from gaining an upper hand in the war.They learn from T'mar that the Romulans are building a super weapon just two light-years from earth. A fleet of Vulcan and earth ships, including the newly repaired Discovery, head out to find and destroy the weapon, called Horizon. The fleet comes under attack by Romulans, and it's left to the Discovery to destroy the weapon with their new prototype torpedoes. The torpedoes cause an unexpected spacial rift to form, and Discovery is pulled through.The crew find themselves at the planet Horizon was brought to by the Iconians. While investigating a structure on the surface they are found by Daekon (Rocco Guirlanda), a Romulan defector from the future and a combatant in the Temporal Cold War. We learn that he is the mysterious man from the future in the Enterprise series. The crew of Discovery works to defeat him and finally completely destroy the weapon, bringing the Temporal Cold War to a close at long last."
}