{
  "imdb_id": "tt3831400",
  "tmdb_id": "286397",
  "douban_id": null,
  "title": "Roy Orbison: Mystery Girl",
  "genres": [
    "Documentary"
  ],
  "country": "USA",
  "version": [],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm1446801",
      "name": "Alex Orbison"
    }
  ],
  "writer": [
    {
      "id": "nm6597181",
      "name": "Roy Orbison Jr.",
      "description": "writer"
    },
    {
      "id": "nm1446801",
      "name": "Alex Orbison",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm1780086",
      "name": "Jeff Ayeroff",
      "character": "Himself"
    },
    {
      "id": "nm0095104",
      "name": "Bono",
      "character": "Himself"
    },
    {
      "id": "nm0122450",
      "name": "Billy Burnette",
      "character": "Himself"
    },
    {
      "id": "nm1974480",
      "name": "Michael Campbell",
      "character": "Himself"
    },
    {
      "id": "nm0143601",
      "name": "John Carter Cash",
      "character": "Himself"
    },
    {
      "id": "nm0188936",
      "name": "Steve Cropper",
      "character": "Himself"
    },
    {
      "id": "nm6597180",
      "name": "Richard Dodd",
      "character": "Himself"
    },
    {
      "id": "nm0447112",
      "name": "Jim Keltner",
      "character": "Himself"
    },
    {
      "id": "nm0528855",
      "name": "Jeff Lynne",
      "character": "Himself"
    },
    {
      "id": "nm5202280",
      "name": "David Malloy",
      "character": "Himself"
    },
    {
      "id": "nm6597181",
      "name": "Roy Orbison Jr.",
      "character": "Himself"
    },
    {
      "id": "nm1446801",
      "name": "Alex Orbison",
      "character": "Himself"
    },
    {
      "id": "nm6597182",
      "name": "Wesley Orbison",
      "character": "Himself"
    },
    {
      "id": "nm0678816",
      "name": "Tom Petty",
      "character": "Himself"
    }
  ],
  "overview": "The discography of Roy Orbison (1936-1988) - which yielded some of the most heartfelt, passionate classics of the rock ‘n’ roll era - shined even brighter with the release of Mystery Girl, the last album Orbison recorded, in 1989. The commercial success of Mystery Girl was nothing short of impressive: the album was a Top 5 hit, eventually earning Orbison his first platinum award for over 1 million sales, and featured the worldwide Top 10 smash “You Got It.” Mystery Girl: Unraveled features a new hour-long documentary on the making of the album, executive produced by Roy’s sons. The documentary includes new interviews with those behind the album including Steve Cropper, Tom Petty, Mick Campbell and Jeff Lynne. In addition there are eight wonderful music videos, including an unreleased alternate video for “She’s a Mystery to Me” and three new videos for “The Way Is Love,” “You Got It” and “California Blue.",
  "storyline": "The discography of Roy Orbison (1936-1988) - which yielded some of the most heartfelt, passionate classics of the rock 'n' roll era - shined even brighter with the release of Mystery Girl, the last album Orbison recorded, in 1989. The commercial success of Mystery Girl was nothing short of impressive: the album was a Top 5 hit, eventually earning Orbison his first platinum award for over 1 million sales, and featured the worldwide Top 10 smash \"You Got It.\" Mystery Girl: Unraveled features a new hour-long documentary on the making of the album, executive produced by Roy's sons. The documentary includes new interviews with those behind the album including Steve Cropper, Tom Petty, Mick Campbell and Jeff Lynne. In addition there are eight wonderful music videos, including an unreleased alternate video for \"She's a Mystery to Me\" and three new videos for \"The Way Is Love,\" \"You Got It\" and \"California Blue.",
  "plot": null,
  "synopsis": "Written and Executive Produced by Roy Orbison's sons - Wesley, Roy Jr., and Alex Orbison, Mystery Girl: Unraveled is a new one-hour documentary chronicling the song-by-song creation of Roy Orbison's Mystery Girl album through rare and intimate archival footage and the memories of those who were there captured in new, never-before-seen interviews. Special appearances by Tom Petty, Bono, Jeff Lynne, Steve Cropper, Billy Burnette, and more."
}