{
  "imdb_id": "tt3824412",
  "tmdb_id": "294132",
  "douban_id": null,
  "title": "Results (2015)",
  "genres": [
    "Comedy",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "105 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.4,
  "director": [
    {
      "id": "nm1216004",
      "name": "Andrew Bujalski"
    }
  ],
  "writer": [
    {
      "id": "nm1216004",
      "name": "Andrew Bujalski",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0001602",
      "name": "Guy Pearce",
      "character": "Trevor"
    },
    {
      "id": "nm1130627",
      "name": "Cobie Smulders",
      "character": "Kat"
    },
    {
      "id": "nm0180984",
      "name": "Kevin Corrigan",
      "character": "Danny"
    },
    {
      "id": "nm0000931",
      "name": "Elizabeth Berridge",
      "character": "Christine"
    },
    {
      "id": "nm2446757",
      "name": "Tishuan Scott",
      "character": "Lorenzo"
    },
    {
      "id": "nm2986217",
      "name": "Rebecca Beegle",
      "character": "Susan, Bootcamper"
    },
    {
      "id": "nm6905015",
      "name": "Matt Sledge",
      "character": "Charles, Bootcamper"
    },
    {
      "id": "nm7391615",
      "name": "Leslie Roberts",
      "character": "Monica, Bootcamper"
    },
    {
      "id": "nm7391604",
      "name": "Leslie Asaka",
      "character": "Leslie Asaka, Bootcamper"
    },
    {
      "id": "nm7084465",
      "name": "Cody Butler",
      "character": "Cody Butler, Bootcamper"
    },
    {
      "id": "nm7391606",
      "name": "Jenn Deising",
      "character": "Jenn Deising, Bootcamper"
    },
    {
      "id": "nm7391607",
      "name": "Tricia Dew",
      "character": "Tricia Dew, Bootcamper"
    },
    {
      "id": "nm7391608",
      "name": "Sarah Enouen",
      "character": "Sarah Enounen, Bootcamper       (as Sarah Enounen)"
    },
    {
      "id": "nm7391609",
      "name": "Keri Kelley",
      "character": "Keri Kelley, Bootcamper"
    },
    {
      "id": "nm7391610",
      "name": "Rose Mata",
      "character": "Rose Mata, Bootcamper"
    },
    {
      "id": "nm5138192",
      "name": "Jay Perkins",
      "character": "Jay Perkins, Bootcamper"
    },
    {
      "id": "nm7391612",
      "name": "Natalie Peters",
      "character": "Natalie Peters, Bootcamper"
    },
    {
      "id": "nm5888201",
      "name": "Chad Price",
      "character": "Chad Price, Bootcamper"
    },
    {
      "id": "nm7391613",
      "name": "Tia Sales",
      "character": "Tia Sales, Bootcamper"
    },
    {
      "id": "nm7391614",
      "name": "Kara Trombetta",
      "character": "Kara Tombetta, Bootcamper"
    },
    {
      "id": "nm0523279",
      "name": "Amy Lowrey",
      "character": "Laura"
    },
    {
      "id": "nm6671246",
      "name": "Tucker Bernon",
      "character": "Barrett"
    },
    {
      "id": "nm7391616",
      "name": "Maria Luque",
      "character": "Maria, Trainer"
    },
    {
      "id": "nm7391617",
      "name": "Maggie Mahoney",
      "character": "Elizabeth, Trainer"
    },
    {
      "id": "nm4379670",
      "name": "Brooke Yerrington",
      "character": "Brooke, Trainer"
    },
    {
      "id": "nm9563664",
      "name": "Kent Smith",
      "character": "Kent, Trainer"
    },
    {
      "id": "nm6671245",
      "name": "Brook Jones",
      "character": "Akim, Trainer"
    },
    {
      "id": "nm6671243",
      "name": "Graham L. Carter",
      "character": "Brandon, Photographer       (as Graham Carter)"
    },
    {
      "id": "nm6371735",
      "name": "Brock Humphrey",
      "character": "Peter, Pizza Man"
    },
    {
      "id": "nm6067651",
      "name": "Charlie LaRose",
      "character": "Charlie, Video Client"
    },
    {
      "id": "nm7068698",
      "name": "Laura Frances",
      "character": "Mrs. Price, Runger"
    },
    {
      "id": "nm6671249",
      "name": "Donn Adelman",
      "character": "Donn Adelman, Pianist"
    },
    {
      "id": "nm7391618",
      "name": "Matt Adelman",
      "character": "Matt Adelman, Drummer"
    },
    {
      "id": "nm0000610",
      "name": "Giovanni Ribisi",
      "character": "Paul"
    },
    {
      "id": "nm4460142",
      "name": "David Bernon",
      "character": "Ivan, from Craigslist"
    },
    {
      "id": "nm9567185",
      "name": "John Bloss",
      "character": "John, Video Client"
    },
    {
      "id": "nm1759763",
      "name": "Shiina Yamada",
      "character": "Thea"
    },
    {
      "id": "nm3222845",
      "name": "Layne Edwards",
      "character": "Rebecca, GF"
    },
    {
      "id": "nm1074492",
      "name": "Zoe Graham",
      "character": "Talley, Client"
    },
    {
      "id": "nm6671247",
      "name": "Edmund Bujalski",
      "character": "Mr. Burke, TV Executive"
    },
    {
      "id": "nm2794660",
      "name": "Elena Eidelberg",
      "character": "Tabitha, TV Grieving"
    },
    {
      "id": "nm1550794",
      "name": "Rebecca McInroy",
      "character": "Rebecca McInroy, TV Voiceover       (voice)"
    },
    {
      "id": "nm6659859",
      "name": "Einstein",
      "character": "Raymond"
    },
    {
      "id": "nm0001309",
      "name": "Anthony Michael Hall",
      "character": "Grigory"
    },
    {
      "id": "nm0956603",
      "name": "Constance Zimmer",
      "character": "Mandy"
    },
    {
      "id": "nm0233449",
      "name": "Greg Dorchak",
      "character": "Rick Jackson"
    },
    {
      "id": "nm6671248",
      "name": "Elizabeth McQueen",
      "character": "Elizabeth McQueen, on Vocals & Guitar"
    },
    {
      "id": "nm6584063",
      "name": "Lauren Gurgiolo",
      "character": "Lauren Gurgiolo, Lead Guitar"
    },
    {
      "id": "nm5413677",
      "name": "Lindsay Greene",
      "character": "Lindsay Greene, on the Bass"
    },
    {
      "id": "nm4758108",
      "name": "Paul Qui",
      "character": "Chef Paul"
    },
    {
      "id": "nm3902123",
      "name": "Zack Carlson",
      "character": "Carl, Shusher"
    },
    {
      "id": "nm3390894",
      "name": "Kelli Bland",
      "character": "Rose, Assistant"
    },
    {
      "id": "nm6696453",
      "name": "Sumair Bhasin",
      "character": "Samir, Spotter"
    },
    {
      "id": "nm9563665",
      "name": "Lauren Siegel",
      "character": "Bonnie, Weightlifter"
    },
    {
      "id": "nm7356079",
      "name": "Anupam Srivastava",
      "character": "Vish, Cat Owner"
    },
    {
      "id": "nm4682401",
      "name": "Dexter",
      "character": "Shecky"
    },
    {
      "id": "nm5537434",
      "name": "Stephen Latham",
      "character": "Mike, Foreman       (as Steve Latham)"
    },
    {
      "id": "nm3416644",
      "name": "Patrick Riester",
      "character": "Gavin, Coworker"
    },
    {
      "id": "nm2395937",
      "name": "Brooklyn Decker",
      "character": "Erin"
    },
    {
      "id": "nm0936315",
      "name": "Bill Wise",
      "character": "Officer Smart"
    },
    {
      "id": "nm6415735",
      "name": "Howdy Fowler",
      "character": "Howdy, Canine Admirer"
    },
    {
      "id": "nm0647408",
      "name": "Luis Olmeda",
      "character": "Louie, Schizophrenic"
    },
    {
      "id": "nm5797013",
      "name": "Nikki Dengel",
      "character": "Gina, Daughter"
    },
    {
      "id": "nm6667999",
      "name": "Lindsay Anne Kent",
      "character": "Danyelle, Waitress       (as Lindsay Kent)"
    },
    {
      "id": "nm6689185",
      "name": "Bri Marie Korin",
      "character": "Ava, Sister       (as Briannah Marie Korin)"
    },
    {
      "id": "nm6671244",
      "name": "Janie Johnson",
      "character": "Chantal, Sister"
    },
    {
      "id": "nm5213356",
      "name": "Katie Folger",
      "character": "Riley, Sister"
    },
    {
      "id": "nm6059557",
      "name": "Lauren Knutti",
      "character": "Dominique, Depressed at Keg"
    },
    {
      "id": "nm7555591",
      "name": "Anthony Gonzales",
      "character": "Restaurant Patron"
    }
  ],
  "overview": "Two mismatched personal trainers' lives are upended by the actions of a new, wealthy client.",
  "storyline": "The healthy living philosophies of an ultra-positive gym owner, Trevor, played by Guy Pearce, is tested against his employee Kat's more pragmatic approach, played by Cobie Smulders. It doesn't help that the two have slept together and he harbours lingering feelings for her. Her unresolved anger threatens to ruin the gym's relationship with a wealthy new client, Danny, played by Kevin Corrigan. Matters are further jeopardized when Trevor, trying to smooth the situation, gives way to his own emotions instead. In spite of their best efforts, neither is able to truly move on. The business risk Trevor is in too deep to back away from and the uncertainty of something more with Kat threatens to profoundly impact both their lives.",
  "plot": "In 1943, having expended enormous resources on recapturing escaped Allied prisoners of war (POWs), the Germans move the most determined to a new, high-security prisoner of war camp. The commandant, Luftwaffe Colonel von Luger (Hannes Messemer), tells the senior British officer, Group Captain Ramsey (James Donald), \"There will be no escapes from this camp.\" Von Luger points out the various features of the new camp designed to prevent escape, as well as the advantages that the prisoners will receive as incentive not to try. After several failed attempts on the first day, the POWs settle into life at the camp.\n\nMeanwhile, Gestapo and SD agents bring RAF Squadron Leader Roger Bartlett (Richard Attenborough) to the camp. Known as \"Big X\", Bartlett is introduced as the principal escape organiser. As Kuhn (Hans Reiser) leaves, he warns Bartlett that if he escapes again, he will be shot. However, locked up with \"every escape artist in Germany\", he immediately plans the greatest escape ever attempted, with tunnels to break out 250 prisoners, so that as many troops and resources as possible will be wasted looking for escapees rather than used at the front line.\n\nThe POWs organise themselves into teams. Flight Lieutenant Robert Hendley (James Garner), an American in the RAF, is \"the scrounger\" who finds needed materials, from a camera to clothes and identity cards. Australian Flying Officer Louis Sedgwick (James Coburn), \"the manufacturer,\" makes tools like picks for digging and bellows for pumping air into the tunnels. Flight Lieutenants Danny Valinski (Charles Bronson) and William \"Willie\" Dickes (John Leyton) are \"the tunnel kings\" in charge of the digging. Flight Lieutenant Andrew MacDonald (Gordon Jackson) acts as intelligence provider and Bartlett's second-in-command. Lieutenant Commander Eric Ashley-Pitt (David McCallum) of the Royal Navy devises a method of spreading soil from the tunnels over the camp, under the guards' noses. Flight Lieutenant Griffith (Robert Desmond) acts as \"the tailor\", creating civilian outfits from scavenged cloth. Forgery is handled by Flight Lieutenant Colin Blythe (Donald Pleasence), who becomes nearly blind due to progressive myopia caused by intricate work by candlelight; Hendley takes it upon himself to be Blythe's guide in the escape. The prisoners work on three tunnels simultaneously, calling them \"Tom\", \"Dick\", and \"Harry\".\n\nUSAAF Captain Virgil Hilts (Steve McQueen), the \"Cooler King\", irritates guards with frequent escape attempts and general irreverence. Hilts and RAF Flying Officer Archibald Ives (Angus Lennie) conceive an escape attempt through a short tunnel at a blind spot right near the edge of the camp, a proposal which is accepted by Bartlett on the grounds that vetoing every independent escape attempt would raise suspicion of the collective escape attempt being planned. However, Hilts and Ives are caught and returned to the 'cooler'. Upon release from the cooler, Bartlett requests that Hilts use his next escape attempt as an opportunity for a reconnaissance of the area immediately surrounding the camp; Hilts turns down Bartlett's request but assists the prisoners as a scrounger. Meanwhile, Hendley forms a friendship with German guard Werner (Robert Graf), which he exploits to obtain documents, and then as blackmail to get hold of other items for the escape. Soon, Bartlett orders \"Dick\" and \"Harry\" to be shut down, as \"Tom\" is closest to completion.\n\nWhile the POWs enjoy a 4th of July celebration arranged by the three Americans, the guards discover \"Tom\". The mood drops to despair and Ives, who has been badly affected by his time in the cooler, walks in a daze to the barbed wire that surrounds the camp and climbs it in view of guards; Hilts runs to stop him but is too late, and Ives is shot dead near the top of the fence. The prisoners switch their efforts to \"Harry\", and Hilts agrees to reconnoitre outside the camp and allow himself to be recaptured. The information he brings back is used to create maps to guide the escapees.\nEnd of the real \"Harry\" tunnel (on the other side of the road) showing how it does not reach the cover of the trees\nThe last part of the tunnel is completed on the scheduled night, but it proves to be twenty feet short of the woods. Knowing there are no other options, Bartlett orders the escape to go ahead, and Hilts improvises a signal system to allow them to exit the tunnel between sweeps of the guards on patrol. The claustrophobic Danny, having spent much of his time in the tunnel and barely surviving multiple cave-ins, nearly refuses to go, but is helped along by Willie. 76 prisoners manage to escape: however, Griffith trips noisily while exiting the tunnel and the escape is discovered.\n\nAfter attempts to reach neutral Switzerland, Sweden, or Spain, almost all the POWs are recaptured or killed. Hendley and Blythe steal an aircraft to fly over the Swiss border, but the engine fails and they crash-land. Soldiers arrive and Blythe, his eyesight damaged, stands and is shot. Hendley surrenders and is captured as Blythe dies.\n\nWhen Bartlett is identified in a crowded railway station by Gestapo agent Kuhn, Ashley-Pitt overpowers and shoots him with his own gun, but is killed by soldiers while attempting to escape. The resulting confusion allows Bartlett and MacDonald to slip away, but they are later caught while boarding a bus after MacDonald blunders by replying to a suspicious Gestapo agent who wishes them \"Good luck\" in English. Hilts steals a motorcycle and is pursued by German soldiers, jumps a first-line barbed wire fence at the German-Swiss border and drives on to the Neutral Zone, but becomes entangled in the second line of the barbed fence and is captured.\n\nThree truckloads of recaptured POWs are driven down a country road and split off in three directions. One truck, containing Bartlett, MacDonald, Cavendish, Haynes, and others, stops in a field and the POWs are told to get out and \"stretch their legs\". They are shot dead under the pretense that they were trying to escape. In all, 50 escapees are murdered; Hendley and nine others are returned to the camp. Von Luger is relieved of command of the camp by the SS for having failed to prevent the breakout.\n\nOnly three POWs make it to safety: Danny and Willie steal a rowboat and proceed downriver to the Baltic coast, where they sneak aboard a Swedish merchant ship, while Sedgwick slips through the countryside on a stolen bicycle before hiding aboard a freight train to France, where he is guided by the Resistance into Spain. Hilts is returned into the camp alone in handcuffs and taken back to the cooler – ironically just as Von Luger is relieved of his command and taken out of the camp. Lieutenant Goff (Jud Taylor), one of the Americans, fetches Hilts's baseball and glove and throws them to him when Hilts and his guards pass by. The guard locks him in his cell and walks away, but momentarily pauses when he hears the familiar sound of Hilts bouncing his baseball against a cell wall. The film ends with the caption \"This picture is dedicated to the fifty.\"",
  "synopsis": null
}