{
  "imdb_id": "tt3853824",
  "tmdb_id": "331018",
  "douban_id": null,
  "title": "Gifts from Strangers (2014)",
  "genres": [
    "Horror",
    "Thriller"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "45 min",
      "description": ""
    },
    {
      "runtime": "45 min",
      "description": "original"
    }
  ],
  "imdb_rating": 5.3,
  "director": [
    {
      "id": "nm4923119",
      "name": "Marcus Caballero"
    }
  ],
  "writer": [
    {
      "id": "nm4923119",
      "name": "Marcus Caballero",
      "description": "story"
    },
    {
      "id": "nm4923119",
      "name": "Marcus Caballero",
      "description": "writer"
    },
    {
      "id": "nm4923119",
      "name": "Marcus Caballero",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm1387343",
      "name": "John Shepherd",
      "character": "Chris"
    },
    {
      "id": "nm5572341",
      "name": "Sara Shenair",
      "character": "Becky"
    },
    {
      "id": "nm4923119",
      "name": "Marcus Caballero",
      "character": "Brian /              Horror Fan '84"
    },
    {
      "id": "nm6621191",
      "name": "Viggo Anastarsi",
      "character": "The Fairest"
    },
    {
      "id": "nm6628688",
      "name": "Gregory Caballero",
      "character": "VHS Killer       (as Emmanual Peck)"
    },
    {
      "id": "nm6667967",
      "name": "Jennifer Greenwood",
      "character": "VHS Victim       (as Jennifer Green)"
    },
    {
      "id": "nm6708138",
      "name": "Emmanuel Peck",
      "character": "Video Killer"
    }
  ],
  "overview": "A social media Vblogger and his close friends find themselves the victims of an unending series of pranks after opening a mysterious package sent from an online friend, pranks that soon take a more sinister and deadly turn.",
  "storyline": "A social media Vblogger and his close friends find themselves the victims of an unending series of pranks after opening a mysterious package sent from an online friend, pranks that soon take a more sinister and deadly turn.",
  "plot": "Martin, a drifter, arrives in a small town and asks about a woman named Ana. Peter, a teenager, directs him to a cemetery. As Martin mourns her death and recalls his past with her, three thugs harass him. When their leader, Caleb, threatens to kill Martin, Martin dares them to do so. Peter interrupts them as they savagely beat Martin, then flees when Caleb stabs Martin. Having been flagged down by Peter, Lieutenant De Luca arrives and confronts Caleb, who claims self-defense. De Luca, revealed to be Caleb's father, calls him a liar and orders him to help cover up the crime; neither realize that Peter is watching. They leave Martin for dead in a ditch after De Luca is called away, and Peter brings him home when he notices life signs.\n\nPeter's mother, Monica, does not want to get involved, but Peter convinces her to perform first aid, which Martin refuses, saying that his blood is contagious. After questioning them further about what happened to Ana and learning she committed suicide after giving birth, Martin disappears. When De Luca returns to bury the body and finds it missing, he immediately suspects Peter. He sends Caleb to take care of the situation. Peter promises not to tell anyone, but Caleb beats him when he insists he does not know Martin's whereabouts. Before they can kill Peter, Martin kills Caleb's friends and sets Caleb on fire. De Luca interrogates Peter, who admits he moved Martin's body, but De Luca initially does not believe Martin could have survive his injuries. Nonetheless, he identifies Martin as his son's attacker, and the police begin a manhunt.\n\nAfter becoming drunk, De Luca encounters Peter again and takes him a to secluded spot. There, De Luca continues the interrogation and sets Peter on fire when he continues to insist he knows nothing about Martin. After knocking De Luca unconscious, Martin rescues Peter and takes him back to Monica's house. As she calls an ambulance, Martin recites a Latin blessing and rubs his blood on Peter. Later, at the hospital, Peter miraculously recovers and is discharged. As Monica and Peter flee the town, the police capture Martin. De Luca stops the bus Peter and Monica have boarded, abducts them, and forces them to reveal how Peter was healed. He makes Monica, a nurse, perform a transfusion from Martin to Caleb. Martin begs her not to do so and insists that his blood must be blessed to prevent infection, but De Luca ignores him.\n\nThough healed by Martin's blood, Caleb becomes infected. He kills and drains Monica of blood, then leaves the hospital with his father. The police go to De Luca's house to question him. When he refuses to come out, they assault the house. Peter goes to the jail to free Martin but finds Martin is powerless to revive the dead, though Martin demands they stop Caleb. When Martin arrives at De Luca's house, he finds De Luca and Caleb missing, and all the cops but the chief of police are dead. Martin kills the wounded chief of police, explaining that he has become infected. As they race after Caleb, De Luca rams their car. In the resulting accident, Peter becomes wounded and accidentally infects himself when he comes into contact with Martin's blood. Martin ties him to a tree and leaves.\n\nA passing motorist with a pet dog frees Peter. Martin finds and confronts Caleb, but he is overpowered by Caleb, who has killed and fed off a young girl. Peter arrives, his face bloody and dirty from feeding, and drags Caleb into the sunlight, protected by heavy clothing; Caleb disintegrates. Martin reveals that he and Ana are Peter's true parents; Monica adopted him after Ana's suicide. Martin tells Peter to be stronger than his mother and requests that Peter leave him to die in the Sun. As Peter leaves, it is revealed that he fed off of the motorist's pet dog, who he lets out of her car. He then drives away.",
  "synopsis": null
}