{
  "imdb_id": "tt3800796",
  "tmdb_id": "353345",
  "douban_id": null,
  "title": "The Exorcism of Molly Hartley (2015)",
  "genres": [
    "Horror"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "96 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.6,
  "director": [
    {
      "id": "nm0003458",
      "name": "Steven R. Monroe"
    }
  ],
  "writer": [
    {
      "id": "nm1107639",
      "name": "Matt Venne",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0511264",
      "name": "Sarah Lind",
      "character": "Molly Hartley"
    },
    {
      "id": "nm0001701",
      "name": "Devon Sawa",
      "character": "Father John Barrow"
    },
    {
      "id": "nm1248373",
      "name": "Gina Holden",
      "character": "Dr. Laurie Hawthorne"
    },
    {
      "id": "nm0534132",
      "name": "Peter MacNeill",
      "character": "Chaplain Henry Davies"
    },
    {
      "id": "nm1090413",
      "name": "Daina Leitold",
      "character": "Janet Jones"
    },
    {
      "id": "nm1043218",
      "name": "Julia Arkos",
      "character": "Beatrice White"
    },
    {
      "id": "nm4850533",
      "name": "Tom McLaren",
      "character": "Father James"
    },
    {
      "id": "nm1416919",
      "name": "Bradley Sawatzky",
      "character": "Orderly #1"
    },
    {
      "id": "nm3934270",
      "name": "Steve Weller",
      "character": "Orderly #2"
    },
    {
      "id": "nm0341489",
      "name": "Ernesto Griffith",
      "character": "Orderly #3"
    },
    {
      "id": "nm2301598",
      "name": "Robert Borges",
      "character": "Orderly #4"
    },
    {
      "id": "nm4428678",
      "name": "Scott Johnson",
      "character": "Orderly #5"
    },
    {
      "id": "nm3155062",
      "name": "Andrew Cecon",
      "character": "Husband"
    },
    {
      "id": "nm1291216",
      "name": "Eric Blais",
      "character": "Male Officer"
    },
    {
      "id": "nm1783534",
      "name": "Kristen Harris",
      "character": "Officer #2"
    },
    {
      "id": "nm2295100",
      "name": "Jon Cor",
      "character": "Daryl"
    },
    {
      "id": "nm1008494",
      "name": "Kate Yacula",
      "character": "Lydia"
    },
    {
      "id": "nm1417678",
      "name": "Tom Keenan",
      "character": "Junior Priest"
    },
    {
      "id": "nm4181818",
      "name": "Samantha Kendrick",
      "character": "Friend #1"
    },
    {
      "id": "nm1740097",
      "name": "Melissa Marie Elias",
      "character": "Amy"
    },
    {
      "id": "nm7505522",
      "name": "Christopher Read",
      "character": "Patient"
    },
    {
      "id": "nm5491338",
      "name": "Maxine Gibson Bruce",
      "character": "Loner Girl on Bus"
    },
    {
      "id": "nm8549973",
      "name": "Mark Kiazyk",
      "character": "Scary Hallway Patient"
    }
  ],
  "overview": "Taking place years after The Haunting of Molly Hartley, who now, as an adult, has fallen under the possession of an evil spirit and must be exorcised by a fallen priest before the devil completely takes her.",
  "storyline": "Molly Hartley is all grown up, but the unholy demon inside her lives on. Six years after graduating high school - and discovering that a secret pact assigned her soul to the devil - Molly is suspected of murder and confined to a mental hospital, where she wreaks supernatural havoc on the staff and patients. Her only hope is an exorcism by a defrocked priest looking to redeem himself and save Molly's life before her hideous \"transformation\" is complete...but Satan has other plans!",
  "plot": "The film begins with a teenage girl, Laurel Miller (Jessica Lowndes), going into the woods to meet her boyfriend Michael (Randy Wayne). He gives her an early birthday present, but her father (Jamie McShane) shows up and demands that she leave with him. As they drive home, Laurel tells him that she will be marrying Michael as soon as she turns eighteen. He breaks down and apologizes to her, telling her he can't let her turn 18, then purposely crashes their car. Seeing that she is not dead, he kills her with a broken piece of mirror, saying he couldn't let the darkness take her.\n\nThe film then switches to present day where 17-year-old Molly Hartley (Haley Bennett) is stabbed in the chest by her deranged mother Jane (Marin Hinkle) with a pair scissors one day after school. Although she survives and her wound is healed with only a scar remaining, she is still haunted in her dreams and hears things because of the frightening experience. Molly lives with her father Robert (Jake Weber) and her mother is locked up in a mental ward outside the town she recently moved to. Her father enrolls Molly in a new school to help with the trauma and start a new life. However, as her eighteenth birthday approaches, Molly must deal with both the stress of being a new student and with the continuing nightmares she has of her mother's attack. Joseph Young (Chace Crawford), one of Molly's classmates, attempts to help her; however, Molly begins to display symptoms of the same psychosis that took control of her mother's life.\n\nOne night, her mother escapes and tries to kidnap her, but Molly escapes. The next morning, she is cornered by Jane and discovers that she, and others who share her mother's concerns, want to kill her in order to save her from a preordained life as a servant to Satan. It is revealed that Molly had died as the result of a miscarriage and her parents made a pact with the Devil disguised as a woman to save her life. The terms of the agreement were such that the Hartleys would only have Molly until her eighteenth birthday, then she would belong to the Devil. After Jane is accidentally killed by falling down to the floor and upon knocking her father out, Molly turns to Joseph for help, only to discover that he is one of them and has set her up by taking her to his house.\n\nDr. Emerson (Nina Siemaszko) arrives at Joseph's house and tells Molly that she is also to be a servant of the devil. She says Molly can either kill her father to break the pact, or submit to the devil. She attempts to let her father live and not join the devil by stabbing herself in the chest with a kitchen knife in an effort to commit suicide. This attempt is in vain because the clock has already struck midnight.\n\nThe film switches to a mental institution, where a doctor is talking to a woman dressed in black, later revealed to be a cold-hearted Molly. It is revealed that Molly's father has now been admitted to the institution; Molly casually smiles and says she will not speak to him, instead choosing to move on. Molly becomes valedictorian of her high school, and dates Joseph. She is seen leaving her high school graduation with Joseph in a limousine, after being told by Dr. Emerson (disguised as the school guidance counselor) that they'll \"see her soon.\"",
  "synopsis": null
}