{
  "imdb_id": "tt3841424",
  "tmdb_id": "335578",
  "douban_id": null,
  "title": "Land of Mine (2015)",
  "genres": [
    "Drama",
    "History",
    "War"
  ],
  "country": "Denmark",
  "version": [
    {
      "runtime": "100 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.8,
  "director": [
    {
      "id": "nm1324710",
      "name": "Martin Zandvliet"
    }
  ],
  "writer": [
    {
      "id": "nm1324710",
      "name": "Martin Zandvliet",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm3435612",
      "name": "Roland Møller",
      "character": "Sgt. Carl Rasmussen"
    },
    {
      "id": "nm3836977",
      "name": "Louis Hofmann",
      "character": "Sebastian Schumann"
    },
    {
      "id": "nm2056274",
      "name": "Joel Basman",
      "character": "Helmut Morbach"
    },
    {
      "id": "nm3140538",
      "name": "Mikkel Boe Følsgaard",
      "character": "Lt. Ebbe Jensen"
    },
    {
      "id": "nm0110331",
      "name": "Laura Bro",
      "character": "Karin"
    },
    {
      "id": "nm7775095",
      "name": "Zoe Zandvliet",
      "character": "Elisabeth, Karins Daughter       (as Zoé Zandvliet)"
    },
    {
      "id": "nm1416781",
      "name": "Mads Riisom",
      "character": "Soldier Peter"
    },
    {
      "id": "nm3427188",
      "name": "Oskar Bökelmann",
      "character": "Ludwig Haffke"
    },
    {
      "id": "nm6607719",
      "name": "Emil Belton",
      "character": "Ernst Lessner"
    },
    {
      "id": "nm6607720",
      "name": "Oskar Belton",
      "character": "Werner Lessner"
    },
    {
      "id": "nm3487965",
      "name": "Leon Seidel",
      "character": "Wilhelm Hahn"
    },
    {
      "id": "nm1745451",
      "name": "Karl Alexander Seidel",
      "character": "Manfred"
    },
    {
      "id": "nm5344130",
      "name": "Maximilian Beck",
      "character": "August Kluger"
    },
    {
      "id": "nm5681238",
      "name": "August Carter",
      "character": "Rudolf Selke"
    },
    {
      "id": "nm4289816",
      "name": "Tim Bülow",
      "character": "Hermann Marklein"
    },
    {
      "id": "nm6607721",
      "name": "Alexander Rasch",
      "character": "Friedrich Schnurr"
    },
    {
      "id": "nm6607722",
      "name": "Julius Kochinke",
      "character": "Johann Wolff"
    },
    {
      "id": "nm6607723",
      "name": "Aaron Koszuta",
      "character": "Gustav Becker"
    },
    {
      "id": "nm2991231",
      "name": "Levin Henning",
      "character": "Albert Bewer"
    },
    {
      "id": "nm0039575",
      "name": "Michael Asmussen",
      "character": "Danish Sergeant"
    },
    {
      "id": "nm2422401",
      "name": "Magnus Bruun",
      "character": "Danish Soldier"
    },
    {
      "id": "nm3703256",
      "name": "Mette Lysdahl",
      "character": "Red Cross Nurse Lone Nielsen"
    },
    {
      "id": "nm0578485",
      "name": "Johnny Melville",
      "character": "Officer Givens"
    },
    {
      "id": "nm1870161",
      "name": "Anthony Straeger",
      "character": "Officer Garth"
    },
    {
      "id": "nm8446785",
      "name": "Suri",
      "character": "Dog Otto"
    }
  ],
  "overview": "In the days following the surrender of Germany in May 1945, a group of young German prisoners of war were handed over to the Danish authorities and subsequently sent out to the West Coast, where they were ordered to remove the more than two million mines that the Germans had placed in the sand along the coast. With their bare hands, crawling around in the sand, the boys were forced to perform the dangerous work under the leadership of the Danish sergeant, Carl Leopold Rasmussen.",
  "storyline": "In post-World War II Denmark, the Danish government puts their hated German prisoners of war to work clearing the 1.5 million landmines from the western beaches of the country. At one such beach, Sgt. Carl Leopold Rasmussen finds himself in charge of one such labor unit and finds they are largely all inexperienced boys. As the boys struggle to complete and survive their dangerous work, Sgt. Rasmussen's hate for Germans gradually cools as he grows to understand the horrific situation these child soldiers are in even as the mines claim more and more victims. Eventually, the boys and the Sergeant must decide what can be done in a situation that would be later be denounced by later generations as the worst war crime committed by the Danish government in its history.",
  "plot": "In the days following the surrender of Germany in May 1945 a group of young German prisoners of war were handed over to the Danish authorities and subsequently sent out to the West Coast, where they were ordered to remove the more than two million mines that the Germans had placed in the sand along the coast. With their bare hands, crawling around in the sand, the boys were forced to perform the dangerous work under the leadership of the Danish sergeant, Carl Leopold Rasmussen (Roland Møller). Most of them are teenage boys conscripted by Hitler in the last days of the war, and they are hopelessly ill-equipped to carry out their dangerous job. An early scene of the captured German soldiers being harassed by the Danes shows the hatred that the Danes felt toward their former occupiers. Rasmussen shares this contempt, and he is determined to treat the young soldiers under his command without the least bit of sympathy.\n\nAs the film begins, the young Germans are dropped off by trucks at the seaside; most are still in their teens. They wear confusion and defeat in their eyes. There to greet them is sergeant Rasmussen. He marches his squad out on the dunes each day to prod for mines. Yet this seemingly endless task soon starts to look like a blood-letting, and even Rasmussen grows conflicted in his feelings toward his young charges.\n\nAs time passes, he actually comes to appreciate them, especially Sebastian Schumann, who is the natural leader of the group. He realizes that these boys have nothing to do with the wartime German occupation of Denmark. In the end, out of fourteen boys, only four survive, including Sebastian, and although they had been promised that they would be sent home after defusing all of the mines, the Danish authorities decide that since they need experienced Germans, they must stay. Rasmussen, finding that decision extremely unfair, decides to help them escape and they are finally able to return home.",
  "synopsis": null
}