{
  "imdb_id": "tt3872958",
  "tmdb_id": "283831",
  "douban_id": null,
  "title": "Strobe Edge (2015)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "115 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.3,
  "director": [
    {
      "id": "nm0386382",
      "name": "Ryuichi Hiroki"
    }
  ],
  "writer": [
    {
      "id": "nm5418886",
      "name": "Io Sakisaka",
      "description": "manga"
    },
    {
      "id": "nm5117757",
      "name": "Sayaka Kuwamura",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm4134328",
      "name": "Kasumi Arimura",
      "character": "Ninako Kinoshita"
    },
    {
      "id": "nm4445437",
      "name": "Sôta Fukushi",
      "character": "Ren Ichinose"
    },
    {
      "id": "nm2951952",
      "name": "Jingi Irie",
      "character": "Daiki Korenaga"
    },
    {
      "id": "nm6410316",
      "name": "Yuina Kuroshima",
      "character": "Mao Sugimoto"
    },
    {
      "id": "nm3978000",
      "name": "Arisa Satô",
      "character": "Mayuko Korenaga"
    },
    {
      "id": "nm4290253",
      "name": "Yûki Yamada",
      "character": "Takumi Ando"
    }
  ],
  "overview": "Ninako Kinoshita has never been in love until an encounter with the school's most popular boy, Ren Ichinose, leads the two to befriending each other. Ren's patient and kind personality is a far cry from his unapproachable idol status at school, and soon Ninako falls in love with him. However, she must cope with the fact that he already has a long-time girlfriend.",
  "storyline": "15-year-old Ninako Kinoshita has never been in love until an encounter on the train with her school's most popular boy, the quiet Ren Ichinose. As she grows closer to Ren, she falls in love with him, but must learn to cope with the unfortunate fact that Ren already has a longtime girlfriend.",
  "plot": "Freshman high school student Ninako Kinoshita has never been in love with anyone until she meets with popular schoolmate Ren Ichinose while boarding a train for school. She gradually falls in love with him as she gets to know about him, though she has to face the truth that Ren is already in a committed relationship with Mayuka Korenaga, a model and the older sister of Daiki, whose love confession Ninako rejects and whose subsequent up-and-down relationship with Ninako's best friend, Sayuri Uehara, becomes the series' secondary plot. Through Ren, Ninako is also introduced to his friend, Takumi Ando, who, despite his womanizing tendency, genuinely falls in love with her.\n\nNinako and Ren are then thrown into situations that require them to be close together, such as working part-time at the same restaurant and being chosen to buy supplies for the summer festival. Gradually, Ren begins to develop feelings for Ninako, but he is adamant in his choice to stay with Mayuka. Realizing that this act is hurting the both of them, Mayuka chooses to break up with Ren. At the same time, Ando continues to urge Ninako to move on from Ren and be his girlfriend. Once while with Ninako, Ando is confronted by Mao Sugimoto, an ex-girlfriend who cheated him by kissing Ren, causing their breakup and Ando's friendship with Ren becoming looser.\n\nIn the next school year, Ninako gets to be in the same class as Ren and Ando, while Mao enrolls in the same school as them as a freshman, irritating Ando. Ninako and Ren continue to develop feelings for each other, but at one point, Mao meets with Ninako and urges her to stop following Ren, with the reason that she wants him and Ando reconcile. When Ando confronts Mao about this, she states that she wants Ninako and Ren to drift apart so Ando can pursue Ninako, to atone for what Mao, who still loves Ando despite all things, has done to him before. Not knowing the reason, Ninako begins to avoid and ignore Ren, who has begun to pursue her so he can confess. When he does, Ninako declines without reason, and when he insists, she becomes upset and tells him to leave her alone. She is, however, encouraged by Ando to stop pitying him and instead follow her heart. Realizing that what she has done is selfish, Ninako goes after the dejected Ren and confesses to him, which he immediately accepts.",
  "synopsis": null
}