{
  "imdb_id": "tt3835730",
  "tmdb_id": "314049",
  "douban_id": null,
  "title": "Husband to Rent (2014)",
  "genres": [
    "Comedy"
  ],
  "country": "Czech Republic",
  "version": [],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm6601789",
      "name": "Tomás Svoboda"
    }
  ],
  "writer": [
    {
      "id": "nm2441035",
      "name": "Iva Jestrábová",
      "description": "contribution"
    },
    {
      "id": "nm3034804",
      "name": "Igor Konyukov",
      "description": "contribution"
    },
    {
      "id": "nm0668078",
      "name": "Halina Pawlowská",
      "description": "contribution"
    },
    {
      "id": "nm6601789",
      "name": "Tomás Svoboda",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1027253",
      "name": "David Novotný",
      "character": "Honza"
    },
    {
      "id": "nm0689990",
      "name": "Bolek Polívka",
      "character": "Milan"
    },
    {
      "id": "nm0560727",
      "name": "David Matásek",
      "character": "Jakub"
    },
    {
      "id": "nm1330785",
      "name": "Lukás Latinák",
      "character": "Krystof"
    },
    {
      "id": "nm2486866",
      "name": "Jitka Cvancarová",
      "character": "Kristýna"
    },
    {
      "id": "nm0635375",
      "name": "Zuzana Norisová",
      "character": "Petra"
    },
    {
      "id": "nm0392714",
      "name": "Eva Holubová",
      "character": "Eliska"
    },
    {
      "id": "nm0228686",
      "name": "Nina Divísková",
      "character": "paní Junková"
    },
    {
      "id": "nm0900653",
      "name": "Lenka Vlasáková",
      "character": "Marta"
    },
    {
      "id": "nm1670027",
      "name": "Vasil Fridrich",
      "character": "Martin"
    },
    {
      "id": "nm2617575",
      "name": "Simona Babcáková",
      "character": "Alena"
    },
    {
      "id": "nm3187749",
      "name": "Lenka Zahradnická",
      "character": "Jana"
    },
    {
      "id": "nm2130266",
      "name": "Martin Hruska",
      "character": "syn Junkové"
    },
    {
      "id": "nm0825873",
      "name": "Milan Steindler",
      "character": "manzel Kristýny"
    },
    {
      "id": "nm2102956",
      "name": "Jana Stryková",
      "character": "dcera Elisky"
    },
    {
      "id": "nm2256018",
      "name": "Thomas Zielinski",
      "character": "Výcepní"
    },
    {
      "id": "nm7650769",
      "name": "Alex Konyukov",
      "character": "syn Marty"
    },
    {
      "id": "nm7650770",
      "name": "Agátka Svobodová",
      "character": "dcera Marty"
    },
    {
      "id": "nm6450780",
      "name": "Anna Ctvrtnícková",
      "character": "Adélka"
    },
    {
      "id": "nm0061578",
      "name": "Dana Batulková",
      "character": "Hygienicka"
    },
    {
      "id": "nm4154705",
      "name": "Jan Vlas",
      "character": "úredník banky"
    },
    {
      "id": "nm4355120",
      "name": "Dusan Sitek",
      "character": "Policista"
    },
    {
      "id": "nm5805466",
      "name": "Jan Konecný",
      "character": "Císník"
    },
    {
      "id": "nm0509103",
      "name": "Norbert Lichý",
      "character": "Notár"
    },
    {
      "id": "nm1632279",
      "name": "Pavel Simcík",
      "character": "Posták"
    },
    {
      "id": "nm4466679",
      "name": "Igor Rattaj",
      "character": "Barman"
    },
    {
      "id": "nm0398713",
      "name": "Andrej Hryc",
      "character": "Uhlár"
    },
    {
      "id": "nm7650775",
      "name": "Rostislav Bilí",
      "character": ""
    },
    {
      "id": "nm7650774",
      "name": "Andrej Devocka",
      "character": ""
    },
    {
      "id": "nm7650772",
      "name": "Ondrej Formánek",
      "character": ""
    },
    {
      "id": "nm7650778",
      "name": "Ronald Handlovský",
      "character": ""
    },
    {
      "id": "nm7650771",
      "name": "Lenka Langová",
      "character": ""
    },
    {
      "id": "nm7650777",
      "name": "Viktor Margita",
      "character": ""
    },
    {
      "id": "nm7650773",
      "name": "Jan Martínek",
      "character": ""
    },
    {
      "id": "nm2339606",
      "name": "Veronika Riehs",
      "character": ""
    },
    {
      "id": "nm4474784",
      "name": "Sárka Strelková",
      "character": ""
    },
    {
      "id": "nm1173293",
      "name": "Alena Stréblová",
      "character": ""
    },
    {
      "id": "nm3357097",
      "name": "Tomás Svoboda",
      "character": ""
    },
    {
      "id": "nm7650779",
      "name": "Peter Valovic",
      "character": ""
    },
    {
      "id": "nm7650776",
      "name": "Petr Volek",
      "character": ""
    }
  ],
  "overview": null,
  "storyline": "Four swimmers - water polo players find themselves at the bottom of their existence after losing a match. So desperate that they even find themselves living at the bottom of their emptied pool. To save their \"dignity\" they start a questionable business \"Husband to rent\" fixing home items for local housewives. But as time will show the household items are not the only things they end up repairing.",
  "plot": "On Christmas Eve 1989, aspiring filmmaker Mark Cohen, and his roommate, Roger Davis, learn that the rent previously waived by their old friend and landlord, Benjamin \"Benny\" Coffin III, is due (\"Rent\"). Their former roommate Tom Collins shows up and gets mugged. Mark and Roger meet with Benny, who tells them he plans to evict the homeless from the nearby lot and build a cyber studio (\"You'll See\"). He offers them free rent if they get Maureen, Mark's ex-girlfriend, to cancel her protest against his plans, but they refuse.\n\nA street drummer, Angel, finds Collins and they bond since they have AIDS. Roger, who is HIV-positive and a former drug addict, tries to compose his one last great song (\"One Song Glory\"). He's visited by his downstairs neighbor, Mimi, an exotic dancer and heroin addict (\"Light My Candle\").\n\nOn Christmas Day, Mark and Roger are visited by Collins and Angel (in drag), bearing gifts (\"Today 4 U\"). They invite Mark and Roger to attend Life Support, an AIDS support group. Roger turns them down, while Mark goes to fix Maureen's sound equipment. He runs into Joanne, Maureen's new girlfriend, who bonds with him as they discuss Maureen's promiscuity (\"Tango: Maureen\"). Mark arrives at the Life Support meeting (\"Life Support\"). He films the meeting for the documentary he's making about people living with HIV/AIDS.\n\nMimi visits Roger (\"Out Tonight\"). Roger, whose ex-girlfriend died of HIV/AIDS, rebukes her advances and throws her out (\"Another Day\"). The next day, he joins Mark, Collins and Angel at a Life Support meeting (\"Will I?\"). Leaving the meeting, the group imagines what it would be like to move to Santa Fe, New Mexico (\"Santa Fe\"). Roger and Mark leave to help Maureen set up for her performance, and Angel and Collins reveal they are falling in love (\"I'll Cover You\"). Maureen performs her song that calls out Benny for changing who he was when he got married and blames him for trying to shut down the tent city (\"Over the Moon\"). The performance starts a riot because Benny called in police to make sure the protest stayed peaceful, but it escalated into violence. Once the protest is over, the group goes to The Life Cafe and celebrates Mark selling his riot footage to a local news station (\"La Vie Boheme\"). Roger and Mimi reveal they are falling for each other, and reveal they are HIV positive (\"I Should Tell You\"). They share a kiss and continue celebrating with their friends (\"La Vie Boheme B\").\n\nOn New Years Day, Benny has padlocked the apartment, but Angel breaks the lock with a garbage can. Mark takes a job at Buzzline, the television news program he sold his riot footage to. After another fight, Maureen proposes to Joanne; the relationship ends when Maureen flirts with another woman at the engagement party (\"Take Me or Leave Me\"). After being persuaded by Mimi, his ex-girlfriend, Benny gives the group back their apartment. Over the following year, Roger grows distrustful of Mimi, and their relationship ends (\"Without You\"). Angel's condition gets worse and he dies in Collins' arms. At Angel's funeral, the group goes their separate ways after a bitter argument (\"I'll Cover You/Goodbye Love\").\n\nRoger sells his guitar, buys a car, and moves to Santa Fe. He returns because he still loves Mimi. Mark quits his job at Buzzline to pursue his own film (\"What You Own\"). On Christmas Eve 1990, Mark and Roger reunite with Collins, who reveals he has reprogrammed an ATM to dispense cash when someone inputs A-N-G-E-L. Joanne and Maureen find Mimi on the streets, near death. Mimi and Roger reconcile and he sings the song he has written over the past year (\"Finale A/Your Eyes\"). Mimi appears to die, but suddenly awakens. She tells them that she was heading to the light, but Angel told her to go back. As Mark's documentary is shown for the first time, the friends reaffirm that there is \"no day but today\" (\"Finale B\").",
  "synopsis": null
}