{
  "imdb_id": "tt3844362",
  "tmdb_id": "308024",
  "douban_id": null,
  "title": "The Overnight (2015)",
  "genres": [
    "Comedy",
    "Mystery"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "79 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm2674307",
      "name": "Patrick Brice"
    }
  ],
  "writer": [
    {
      "id": "nm2674307",
      "name": "Patrick Brice",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0004395",
      "name": "Adam Scott",
      "character": "Alex"
    },
    {
      "id": "nm2279940",
      "name": "Taylor Schilling",
      "character": "Emily"
    },
    {
      "id": "nm7062441",
      "name": "RJ Hermes",
      "character": "RJ       (as R.J. Hermes)"
    },
    {
      "id": "nm1747551",
      "name": "Kyle Field",
      "character": "Wade"
    },
    {
      "id": "nm0222586",
      "name": "Sarah DeVincentis",
      "character": "Dawn"
    },
    {
      "id": "nm7382412",
      "name": "Sophia Alison",
      "character": "Birthday Party Guest #1"
    },
    {
      "id": "nm4110880",
      "name": "Ally Anderson",
      "character": "Birthday Party Guest #2"
    },
    {
      "id": "nm7382413",
      "name": "Nancy Dillon",
      "character": "Birthday Party Guest #3"
    },
    {
      "id": "nm7382414",
      "name": "Avalon Economon",
      "character": "Birthday Party Guest #4"
    },
    {
      "id": "nm7382415",
      "name": "Abbie Gill",
      "character": "Birthday Party Guest #5"
    },
    {
      "id": "nm7382416",
      "name": "Gail Honeystein",
      "character": "Birthday Party Guest #6"
    },
    {
      "id": "nm7382417",
      "name": "Bit Kernodle",
      "character": "Birthday Party Guest #7"
    },
    {
      "id": "nm7382418",
      "name": "Bianca Rodriguez",
      "character": "Birthday Party Guest #8"
    },
    {
      "id": "nm0779145",
      "name": "Frankie Scott",
      "character": "Birthday Party Guest #9"
    },
    {
      "id": "nm7382419",
      "name": "Asya Vartanian",
      "character": "Birthday Party Guest #10"
    },
    {
      "id": "nm5763226",
      "name": "Tess Barthélémy",
      "character": "Birthday Party Guest #11"
    },
    {
      "id": "nm7062442",
      "name": "Max Moritt",
      "character": "Max"
    },
    {
      "id": "nm0005403",
      "name": "Jason Schwartzman",
      "character": "Kurt"
    },
    {
      "id": "nm0002105",
      "name": "Judith Godrèche",
      "character": "Charlotte"
    },
    {
      "id": "nm0005503",
      "name": "Susan Traylor",
      "character": "Breast Pump Doctor"
    },
    {
      "id": "nm7382420",
      "name": "Y. Lambremont",
      "character": "Massage Parlor Woman #1"
    },
    {
      "id": "nm7382421",
      "name": "Sarah Lambremont",
      "character": "Massage Parlor Woman #2"
    },
    {
      "id": "nm0877642",
      "name": "Jim Turner",
      "character": "Massage Parlor Man"
    }
  ],
  "overview": "Alex, Emily, and their son, RJ, are new to Los Angeles. A chance meeting at the park introduces them to the mysterious Kurt, Charlotte, and Max. A family “playdate” becomes increasingly interesting as the night goes on.",
  "storyline": "Alex, Emily, and their son, RJ, are new to Los Angeles. A chance meeting at the park introduces them to the mysterious Kurt, Charlotte, and Max. A family \"playdate\" becomes increasingly interesting as the night goes on.",
  "plot": "In 1997, bartender Troy Duffy-- an aspiring screenwriter and member of the band \"The Brood\"-- successfully sells his script for The Bookdock Saints to Miramax chief Harvey Weinstein for $300,000 and is taken on by the William Morris Agency. Weinstein agrees to let Duffy, who has never made a movie or attended film school, to direct the $15 million film. Moreover, The Brood will produce the soundtrack and get a recording contract from Maverick Records, and Weinstein will buy J. Sloan's, the Los Angeles bar where Duffy works, and hire Duffy to run it. Meanwhile, Duffy asks friends Tony Montana and Mark Brian Smith to manage The Brood and document his activities on film.\n\nDuffy initially enjoys his new success, entertaining celebrities in his bar, dining at hotel restaurants, and moving into a production office where he holds teleconferences with major Hollywood producers. The movie deal, however, quickly turns sour, largely due to Duffy's own arrogance and increasingly abusive behavior. Believing himself to be the next power-player in Hollywood, Duffy insults actors who are in consideration for Boondock (including Ethan Hawke, Keanu Reeves, and Kenneth Branagh, whose name Duffy repeatedly mispronounces before simply calling him \"cunt\"), as well as producers such as Jerry Bruckheimer. When the film fails to go into production as quickly as Duffy would like, he threatens to leave William Morris in favor of a rival agency, and alienates both Weinstein and his own production team through his abrasive behavior. Ultimately, Duffy receives word of rumors that Weinstein, one of the most powerful producers in Hollywood, has had him blacklisted. Miramax puts the film in turnaround, conference calls are refused, and soon Duffy is without any film industry contacts at all.\n\nDuffy's musical efforts are equally ill-fated. Famed guitarist Jeff \"Skunk\" Baxter expresses interest in producing The Brood, singling out lead vocalist Taylor for particular praise. However, during recording sessions with Baxter and producer Ron Saint Germain, Duffy attempt to wrest control away from them, ignores any advice that contradicts his own opinions, and refuses to listen to Baxter's concerns about the band's heavy alcohol consumption. After being dropped by Maverick Records, Duffy and his band are signed to Atlantic Records. Renaming themselves The Boondock Saints, their debut CD sells only 690 copies, and they are dropped from the label shortly before disbanding.\n\nIn 1998, Duffy is finally able to obtain financing for the film through Franchise Pictures, although it totals less than half of Miramax's offer. The Boondock Saints is promoted at the 1999 Cannes Film Festival, but all the major American distribution companies pass on it. The film manages to receive a limited release in five cities, but performs poorly and is pulled after a week before being released on DVD and VHS. On the night of the film's screening at the Palm Springs Film Festival, Duffy and producer Chris Brinker are almost killed by a car jumping the curb and speeding off; the car and its driver remain unidentified. Although positive reviews of the movie begin to spread via word-of-mouth and the film becomes a financial success, Duffy's contract with Franchise Films stipulates he cannot profit from the film's television, home media, or foreign sales. He eventually spends all of the money he earned from his film and record deals, his bar closes, and he is unable to secure any work in Hollywood within six years after the production of The Boondock Saints.",
  "synopsis": null
}