{
  "imdb_id": "tt3841400",
  "tmdb_id": "292349",
  "douban_id": null,
  "title": "Burma (2014)",
  "genres": [
    "Comedy",
    "Crime"
  ],
  "country": "India",
  "version": [],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm4943058",
      "name": "Dharani Dharan"
    }
  ],
  "writer": [
    {
      "id": "nm4943058",
      "name": "Dharani Dharan",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm6176534",
      "name": "Michael Thangadurai",
      "character": "Burma"
    },
    {
      "id": "nm6607676",
      "name": "Reshmi Menon",
      "character": "Kalpana"
    },
    {
      "id": "nm0474609",
      "name": "Atul Kulkarni",
      "character": "Bothra"
    },
    {
      "id": "nm3164292",
      "name": "Sampath Raj",
      "character": "Guna"
    },
    {
      "id": "nm3962607",
      "name": "Karthik Sabesh",
      "character": "Boomer"
    },
    {
      "id": "nm6765795",
      "name": "Madhu Raghuram",
      "character": ""
    },
    {
      "id": "nm6765796",
      "name": "Sharath Kumar",
      "character": ""
    },
    {
      "id": "nm4225184",
      "name": "Kani Kusruti",
      "character": "Clara"
    }
  ],
  "overview": "Sampath is an expert in car, seizing, and works for Atul Kulkarni, who is a financier in North Madras. Burma aka Parandhaman works under Sampath for peanuts and the moment he comes to know the true colors of his boss; he makes his crooked intelligence to show the jail for Sampath and eventually gains the trust from Atul after creating his own brand for siezing cars. Sampath comes back from the jail and secretly plans the downfall of Burma.  Burma gets an opportunity to seize 28 cars and he has completed 99% of his job without any fuss only to get stuck on the last car. What happens to Burma and to the rest of lead characters forms the rest of the story with parallel stories layered like a double decker sandwich.",
  "storyline": "The film is set in North Madras area where a Settu (Atul Kulkarni) used to employ Guna (Sampath Raj) for car seizure before he is double crossed by Burma (Michael Thangadurai), who takes over the hot-seat. Burma is aided by his girlfriend Kalpana (Reshmi Menon) and sidekick Boomer (Karthik Sabesh). Their mission is to seize 28 cars for Settu and raise money so that Burma can marry Kalpana. Meanwhile another gang of robbers led by a lady killer gets involved, leading to chase, abduction, double cross and killing.",
  "plot": null,
  "synopsis": null
}