{
  "imdb_id": "tt3826834",
  "tmdb_id": "285021",
  "douban_id": null,
  "title": "Corrections Class (2014)",
  "genres": [
    "Drama"
  ],
  "country": "Russia",
  "version": [
    {
      "runtime": "98 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm6592335",
      "name": "Ivan I. Tverdovskiy"
    }
  ],
  "writer": [
    {
      "id": "nm7052266",
      "name": "Mariya Borodyanskaya",
      "description": null
    },
    {
      "id": "nm2541458",
      "name": "Dmitry Lanchikhin",
      "description": null
    },
    {
      "id": "nm6592335",
      "name": "Ivan I. Tverdovskiy",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm5690494",
      "name": "Mariya Poezzhaeva",
      "character": "Lena Chekhova"
    },
    {
      "id": "nm2187975",
      "name": "Filipp Avdeev",
      "character": "Anton Sobolev"
    },
    {
      "id": "nm6592336",
      "name": "Nikita Kukushkin",
      "character": "Mishka"
    },
    {
      "id": "nm1235719",
      "name": "Olga Lapshina",
      "character": "Polina Grigorevna, Anton's mother"
    },
    {
      "id": "nm6633542",
      "name": "Natalya Pavlenkova",
      "character": "Svetlana Viktorovna, Lena's mother"
    },
    {
      "id": "nm7052261",
      "name": "Yuliya Serina",
      "character": "Vitka"
    },
    {
      "id": "nm4681307",
      "name": "Artyom Markaryan",
      "character": "Mitka"
    },
    {
      "id": "nm7052262",
      "name": "Mariya Uryadova",
      "character": "Olya"
    },
    {
      "id": "nm3120830",
      "name": "Natalya Domeretskaya",
      "character": "Tereza Pavlovna Kuznetsova"
    },
    {
      "id": "nm6592338",
      "name": "Irina Vilkova",
      "character": "Lyudmila Nikolaevna"
    },
    {
      "id": "nm5608140",
      "name": "Elena Nesterova",
      "character": "Math teacher"
    },
    {
      "id": "nm4121355",
      "name": "Marina Nikolayeva",
      "character": "Elena Viktorovna"
    },
    {
      "id": "nm7052263",
      "name": "Zhanetta Demikhova",
      "character": "Olga Nikolaevna, Cleaning woman"
    },
    {
      "id": "nm7052264",
      "name": "Olga Roslova",
      "character": "Biology teacher"
    },
    {
      "id": "nm6626840",
      "name": "Elena Makhova",
      "character": ""
    }
  ],
  "overview": "Lena is a bright, disabled girl who, after years spent studying at home, is keen to get back to school. She is assigned to a special class for disabled pupils who have to present themselves before a school commission at the end of the year in order to prove that they merit being moved back into a \"normal\" class. Her enervated teachers, however, show absolutely no desire to motivate the students and help them improve; on the contrary, they try to quash right from the start any interest Lena shows in more complex study material. Nevertheless, Lena soon involves herself in the school routine and gets together with classmate Anton. Yet their transparent happiness is not to everyone's liking and repercussions soon follow.",
  "storyline": "Lena is a bright, disabled girl who, after years spent studying at home, is keen to get back to school. She is assigned to a special class for disabled pupils who have to present themselves before a school commission at the end of the year in order to prove that they merit being moved back into a \"normal\" class. Her enervated teachers, however, show absolutely no desire to motivate the students and help them improve; on the contrary, they try to quash right from the start any interest Lena shows in more complex study material. Nevertheless, Lena soon involves herself in the school routine and gets together with classmate Anton. Yet their transparent happiness is not to everyone's liking and repercussions soon follow.",
  "plot": "Lena is a bright, disabled girl with myopathy who must use a wheelchair to get around. After years being homeschooled by her protective mother, she is keen to get back to school. She is assigned to a special class for physically and psychologically disabled students who have to present themselves before a school commission at the end of the year in order to prove that they merit being moved back into a \"normal\" class. There she meets a group of students: Mishka, brother and sister Mitka and Vitka, Olya, and Anton. Though initially appearing to be her friends, they quickly display high degrees of callousness when they exploit her condition to solicit money from passers-by, and treat it as a joke when one of their classmates is killed attempting to lie beneath a moving train - an activity which the group indulges in to kill their boredom. Their teachers, meanwhile, treat the corrections class with contempt and show absolutely no desire to motivate the students or help them improve.\n\nAnton, however, treats Lena with kindness, and the two soon begin a relationship. Lena admonishes the group for their behavior and urges them to concentrate on passing the commission so they can get back to normal school. Lena and Anton's relationship, however, upsets the rest of the group, particularly Mishka, who concocts a plan with the rest of the group to have sex with Lena. After stealing her wheelchair, they separate her from Anton, and Mishka and Mitka attempt to rape Lena while Vitka and Olya shoot video on their phones. However they find they cannot complete the act, and leave her beaten and bruised on the side of the train tracks.\n\nThe final day of school arrives and the students get their results - every one of them has passed, except for Lena, who the commission votes to keep on in the corrections class another year. When Lena asks the group why they did what they did, they cruelly insult her. Anton, who does not know about the rape, also begins ignoring her. The final scene is of Lena's mother collapsing in the school hallway in tears, when Lena appears behind her - walking unassisted without her wheelchair.",
  "synopsis": null
}