{
  "imdb_id": "tt3895884",
  "tmdb_id": "287689",
  "douban_id": null,
  "title": "7 Days in Hell (TV Movie 2015)",
  "genres": [
    "Comedy",
    "Sport"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "43 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm2021516",
      "name": "Jake Szymanski"
    }
  ],
  "writer": [
    {
      "id": "nm1104505",
      "name": "Murray Miller",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm1676221",
      "name": "Andy Samberg",
      "character": "Aaron Williams"
    },
    {
      "id": "nm3229685",
      "name": "Kit Harington",
      "character": "Charles Poole"
    },
    {
      "id": "nm0035488",
      "name": "Fred Armisen",
      "character": "Edward Pudding"
    },
    {
      "id": "nm0004518",
      "name": "David Copperfield",
      "character": "David Copperfield"
    },
    {
      "id": "nm0263708",
      "name": "Chris Evert",
      "character": "Chris Evert"
    },
    {
      "id": "nm0287182",
      "name": "Will Forte",
      "character": "Sandy Pickard"
    },
    {
      "id": "nm1229568",
      "name": "Filip Hammar",
      "character": "Swedish TV Host"
    },
    {
      "id": "nm0483915",
      "name": "Jim Lampley",
      "character": "Jim Lampley"
    },
    {
      "id": "nm0005177",
      "name": "Howie Mandel",
      "character": "The Duke of Kent"
    },
    {
      "id": "nm0568501",
      "name": "John McEnroe",
      "character": "John McEnroe"
    },
    {
      "id": "nm0639821",
      "name": "Soledad O'Brien",
      "character": "Soledad O'Brien"
    },
    {
      "id": "nm0820053",
      "name": "June Squibb",
      "character": "Queen Elizabeth"
    },
    {
      "id": "nm1102987",
      "name": "Serena Williams",
      "character": "Serena Williams"
    },
    {
      "id": "nm2361892",
      "name": "Chris Romano",
      "character": "Streaker       (as Romanski)"
    },
    {
      "id": "nm3015360",
      "name": "Lyssa Roberts",
      "character": "Wimbledon Streaker"
    },
    {
      "id": "nm7452248",
      "name": "Jared Rojo Meyer",
      "character": ""
    },
    {
      "id": "nm7452249",
      "name": "Charli Hayden",
      "character": ""
    },
    {
      "id": "nm2104446",
      "name": "Henrik Rutgersson",
      "character": "Swedish News Anchor"
    },
    {
      "id": "nm1796755",
      "name": "Ludwig Manukian",
      "character": "Foreign News Anchor"
    },
    {
      "id": "nm2501633",
      "name": "Lena Dunham",
      "character": "Lanny Denver"
    },
    {
      "id": "nm2394794",
      "name": "Karen Gillan",
      "character": "Lily Allsworth"
    },
    {
      "id": "nm0358316",
      "name": "Jon Hamm",
      "character": "Narrator"
    },
    {
      "id": "nm0790688",
      "name": "Michael Sheen",
      "character": "Caspian Wint"
    },
    {
      "id": "nm0005460",
      "name": "Mary Steenburgen",
      "character": "Louisa Poole"
    }
  ],
  "overview": "A fictional documentary-style expose on the rivalry between two tennis stars who battled it out in a 1999 match that lasted seven days.",
  "storyline": "A \"documentary\" on the rivalry between an American tennis player, Aaron Williams (played by Andy Samberg), and an English tennis player, Charles Poole (Kit Harrington, of Game of Thrones fame). Focuses largely on the match where their rivalry reached a climax - Wimbledon 2001, 1st round - a match that took seven days...",
  "plot": "Aaron Williams (Andy Samberg) and Charles Poole (Kit Harington) are professional tennis players who face off in what becomes the longest match in history. The mockumentary explores the backgrounds of the two competitors.\n\nAaron Williams is considered \"The Bad Boy of Tennis.\" He was found on the streets and adopted by Richard Williams, who raised Aaron with his daughters, Venus and Serena Williams. He begins to engage in risky behavior with Rod Stewart and David Copperfield when his tennis career takes off. At the 1996 Wimbledon Finals, on his championship point, his serve hits a line judge, who has an immediate heart attack and dies. Williams falters and loses the championship. At the ceremony following the match, Williams lashes out and pushes Prince Edward, the Duke of Kent (Howie Mandel), and disappears.\n\nCharles Poole is a child prodigy. While physically gifted and being very attractive, Poole was forced into a tennis career by his mother (Mary Steenburgen), who sped his education along by sending him to a vocational school where he earned a degree as a truck driver. Thus, Poole is very dim-witted and his mother threatens to disown him if he loses. He appears on a local show hosted by Caspian Wint (Michael Sheen) as a 15 year old and is on track to become the youngest professional tennis player in history. He tells Wint that he idolizes Aaron Williams.\n\nWilliams resurfaces in Sweden creating a male underwear line which causes groin chafing. Because Williams runs out of funds, he descends into pornography and an addiction to PCP. He is arrested, convicted, and is sent to a Swedish prison.\n\nTwo weeks before 2001 Wimbledon starts, Poole is interviewed by a reporter. When asked if he is a better player than Williams, he says yes. This comment reaches its way to Williams, who is participating in a massive shower orgy. After hearing the comment, he leaves, escapes, and becomes a free man, according to Swedish law.\n\nWilliams claims he will be playing in Wimbledon. The All-England Chair Committee, led by the Duke of Kent, refuses to let him play. Edward Pudding (Fred Armisen), also a member of the committee, believes that letting Williams play will spike interest for the tournament, and he suggests that Williams play an Englishman who is likely to beat him, which turns out to be Poole.\n\nPoole is in his hotel room the night before the match. He receives a call from Queen Elizabeth (June Squibb), who tells him to \"win.\"\n\nOn the first day of the match, the match plays as expected, with Poole winning the first set 6-0. Before the second set starts, a thunderstorm suspends play for the rest of the day.\n\nOn the second day, a revitalized Williams takes the second and third sets. According to Pudding, everyone at the match knew Williams hid cocaine, but it was \"rude to point things out.\" The match resumes, and it goes to a fifth set before sunset suspends the match. That night, Poole gets another call from the Queen, and is next seen staring at a wall. In a credits scene, it's revealed Poole suffered some sort of breakdown.\n\nOn the third day, neither Williams and Poole are willing to surrender the match. After eight hours of intense tennis, the match is suspended. That night, Poole gets a disturbing and threatening call from the Queen.\n\nOn the fourth day, Poole is about to win the match, but a streaker runs onto the court. Williams tries to subdue her, but ends up having sex with her. After they finish, a male streaker runs onto the court, with whom Williams also has sex. The female streaker runs back onto the court, and a threesome takes place until the match is suspended on account of darkness.\n\nBefore the fifth day, Williams arranges a press conference. After refusing to apologize for the \"incidents,\" Williams shares with the press that he has located his birth father, British singer Engelbert Humperdinck. He claims he will dedicate his performance at Wimbledon to all Englishmen. Even if Williams's claim was fabricated, John McEnroe believes the statement was a brilliant tactic, which interfered with Poole's psyche. After darkness again suspends the match, Poole is seen beaten in an elevator by the Queen in the stomach. He asks his mother for help, but she reminds him of her threat to disown him.\n\nBefore the sixth day, Williams is hit by a truck, which is implied to be Poole. Williams leaves the hospital and elects to play with one arm, which he does for a little bit. In the 196th game, with Poole serving 98-97 and triple match point, something happens to Poole that is considered by some to be the greatest travesty in sports history. On his first serve, David Copperfield magically appears on Poole's shoulders. Since there is no rule for that, the point counts. Copperfield later exonerates Williams from any wrongdoing, and claims he was supposed to appear on the Statue of Liberty. Poole, visibly distracted, fails to win the match in the sixth day.\n\nBefore the seventh day, Poole and Williams meet at a joint press conference. A reporter informs Poole about a sex tape made by his ex-girlfriend, Lily (Karen Gillan) and Williams, though it was more embarrassing for Williams as he had failed to get an erection. Poole attacks Williams and removes his wig, revealing Williams's bald scalp. The two elect to settle their matters on the court. Queen Elizabeth makes an appearance at the match, and the tensions between the two players reach a boiling point. They challenge each other to fight and are restrained by security guards. Queen Elizabeth urges everyone to stop, and lets the players fight.\n\nPoole and Williams charge the net and kill each other after simultaneously hitting each other in the head with their rackets. The two players are buried together. The documentary ends with video flashbacks of Poole and Williams praising each other.",
  "synopsis": null
}