{
  "imdb_id": "tt3812348",
  "tmdb_id": "345664",
  "douban_id": null,
  "title": "Mr. Right (2015)",
  "genres": [
    "Comedy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "79 min",
      "description": ""
    }
  ],
  "imdb_rating": 2.9,
  "director": [
    {
      "id": "nm2689791",
      "name": "Roger Melvin"
    }
  ],
  "writer": [
    {
      "id": "nm2304840",
      "name": "Dominic L. Santana",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1551922",
      "name": "Columbus Short",
      "character": "Michael"
    },
    {
      "id": "nm1801624",
      "name": "Erica Tazel",
      "character": "Lisa"
    },
    {
      "id": "nm3451173",
      "name": "Dawn Halfkenny",
      "character": "Norma       (as Dawnisha Halfkenny)"
    },
    {
      "id": "nm1382877",
      "name": "Jackie Long",
      "character": "Fontaine"
    },
    {
      "id": "nm6575442",
      "name": "David Moore",
      "character": "Seth"
    },
    {
      "id": "nm1351490",
      "name": "Rodney Perry",
      "character": "Frank"
    },
    {
      "id": "nm4506899",
      "name": "Erica Page",
      "character": "Maria"
    },
    {
      "id": "nm4496621",
      "name": "Reece Odum",
      "character": "Michelle"
    },
    {
      "id": "nm2304840",
      "name": "Dominic L. Santana",
      "character": "Louis"
    },
    {
      "id": "nm6018082",
      "name": "Elizabeth Faith Ludlow",
      "character": "Date       (as Elizabeth Ludlow)"
    },
    {
      "id": "nm3072964",
      "name": "Tiffany Cook",
      "character": "The Employee"
    },
    {
      "id": "nm1106900",
      "name": "Miguel A. Gaetan",
      "character": "Marco"
    },
    {
      "id": "nm6774293",
      "name": "Sunny Kelley",
      "character": "Date"
    },
    {
      "id": "nm6097570",
      "name": "Adam Klein",
      "character": "Waiter #2"
    },
    {
      "id": "nm4843832",
      "name": "Terrill Patterson",
      "character": "Waiter 1"
    },
    {
      "id": "nm5282935",
      "name": "Abigail Rich",
      "character": "Las Vegas Showgirl"
    }
  ],
  "overview": "A conservative writer who's sworn off dating is swept off her feet by a man who, she learns, works for an upscale dating service.",
  "storyline": "A conservative writer who's sworn off dating is swept off her feet by a man who, she learns, works for an upscale dating service.",
  "plot": "Martha is an eccentric woman who leaves her boyfriend after she discovers that he is cheating on her. Elsewhere, Francis is seen knocking on a hotel door. A woman answers and Francis explains that he is the hit-man that she hired to kill her law partner so that she would own the firm outright; he then puts on a red clown nose, tells her that murder is wrong, and shoots her dead. At the same time, a team of assassins are preparing to trap Francis in the hotel. Hopper, a hit man who once worked with Francis in the CIA, chooses to remain behind in the surveillance van, as he knows that Francis will overpower the unprofessional assassins. Hopper listens as the assassins are killed, while the audience watches Francis demonstrate his skills. After the incident, Hopper receives a phone call from his bosses, who instruct him to pretend to be an FBI agent and to partner with a local New Orleans police detective, Gus Patrick, who has been assigned to capture Francis.\n\nThe following day, Martha spends the morning at a pet store where her roommate works. On the way home from the store, Martha stops at a convenience market. Francis, also in the market, is attracted to her quirkiness. He asks her out on a date and the pair spend the next ten hours together. Francis is honest with Martha about his line of work, but she assumes that he is being sarcastic. As the pair stroll through the park, Francis senses that a hit-man is near, and he dances with Martha while evading a bullet streaming past them. They end up spending the night together.\n\nThe next morning, Francis leaves Martha a note, asking her to continue their date that night. Martha is smitten and makes breakfast for her roommate Sophie, who is skeptical of Francis. The new couple meet in a bar that night. There, Francis recognizes Espinoza, one of the hit-men who survived the hotel. Francis excuses himself and follows Espinoza outside, where Francis kills him.\n\nAt the same time, brothers from a mob family are hiding out in New Orleans. The younger brother, Von Cartigan, has ambition, but lacks brains and skill; he convinces a local thug named Johnny Moon to join him in hiring Francis, who now has a reputation for killing the people who hire him. Thus, his plan is to hire the hit-man for his older brother Richard, whom Francis would kill, so that Von can take over the mob.\n\nFrancis takes Martha with him to the initial meeting for the hit-man job. From the car, she watches as Francis puts on a clown nose and kills the man who tried to hire him. Martha, now realizing that Francis has been truthful about his line of work, panics and asks him to take her home. Unbeknownst to Francis, Johnny follows the pair to her apartment and gives her address to the mob brothers.\n\nLater that day, Hopper and Gus interview Martha and explain that Francis is a hit-man with a conscience. At this time, Martha realizes that she is falling for a dangerous criminal. Francis decides to come to the apartment. Although Hopper is waiting for him, Francis is able to stun him unconscious. Francis drags Hopper into the apartment, where he tells Martha and Sophie that Hopper is not an FBI agent. Martha does not know what to believe, but then remembers that Francis has always told her the truth. She decides to go with him. As they leave, assassins working for the mob family arrive. One assassin, Steve, surprises Francis with his impressive combat skills, and the pair express mutual admiration. As Francis takes care of the other assassins, he is again surprised when Steve disarms him. The mobsters take Martha and provide an address where Francis can find them. As they make their escape, Francis fights Hopper. When Gus arrives, Hopper shoots him dead. Francis escapes unseen.\n\nFrancis arrives at the mobsters' house to rescue Martha, at which point Von tells Francis to kill Richard, revealing his treachery to his brother. Francis refuses and leaves the room to look for Martha, and Von kills Richard himself. After Francis finds Martha, the pair run into Hopper, who fights Francis while Johnny captures Martha. Realizing that she possesses similar skills to Francis, Martha is able to kill first Johnny and then Von. Outside, Hopper is preparing to shoot Francis when he is killed by Steve. Grateful, Francis tells Steve that Hopper is worth five-million dollars, dead or alive. As Steve celebrates, Francis and Martha leave hand-in-hand.\n\nTwo months later, Martha and Francis are living in Vietnam. A hit-man watches as the pair decide where to travel to next. Before he can pull the trigger, Martha sneaks up and shoots him dead.",
  "synopsis": null
}