{
  "imdb_id": "tt3811932",
  "tmdb_id": "343401",
  "douban_id": null,
  "title": "Adult (2014)",
  "genres": [
    "Documentary"
  ],
  "country": "Sweden",
  "version": [
    {
      "runtime": "57 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm3137953",
      "name": "Shahriyar Latifzadeh"
    }
  ],
  "writer": [
    {
      "id": "nm3137953",
      "name": "Shahriyar Latifzadeh",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm6577296",
      "name": "Iva Jansson",
      "character": "Herself"
    },
    {
      "id": "nm6577299",
      "name": "Bibi Langer",
      "character": "Herself"
    },
    {
      "id": "nm6577300",
      "name": "Alireza Latifzadeh",
      "character": "Himself"
    },
    {
      "id": "nm6577295",
      "name": "Eshrat Latifzadeh",
      "character": "Herself"
    },
    {
      "id": "nm3137953",
      "name": "Shahriyar Latifzadeh",
      "character": "Himself"
    },
    {
      "id": "nm4053825",
      "name": "Birgitta Leijonhufvud",
      "character": "Herself"
    },
    {
      "id": "nm6577297",
      "name": "Oscar Oscarsson",
      "character": "Himself"
    },
    {
      "id": "nm6577298",
      "name": "Lennart Persson",
      "character": "Himself"
    },
    {
      "id": "nm5479603",
      "name": "Lars Tollin",
      "character": "Himself"
    }
  ],
  "overview": "The director Shahriyar Latifzadeh follows four elderly people in their daily lives. Can their life wisdom help him understand how life should be lived if we had all the wisdom at the age of 35?",
  "storyline": "The director Shahriyar Latifzadeh follows four elderly people in their daily lives. Can their life wisdom help him understand how life should be lived if we had all the wisdom at the age of 35?",
  "plot": "Further information: List of Divergent characters and Factions (Divergent)\nIn a post-apocalyptic Chicago, survivors are divided into five factions based on their dispositions: Abnegation, for the selfless; Amity, for the peaceful; Candor, for the honest; Dauntless, for the brave; and Erudite, for the intellectual. Each year, all sixteen-year-olds take an aptitude test that determines the faction for which they are best suited. After receiving the results, test takers choose a faction at the Choosing Ceremony, no matter what their results were. Those who do not complete initiation into their new faction become \"factionless\" and are forced to live in poverty on the streets of the city.\n\nSixteen-year-old Beatrice Prior is born into an Abnegation family. She doesn't feel she belongs in Abnegation because she doesn't see herself as naturally selfless. Her aptitude test results are inconclusive and indicate aptitude for three factions – Abnegation, Erudite, and Dauntless. The test administrator warns her never to tell anyone that her results were inconclusive as this marks her as \"Divergent\". Beatrice agonizes over Choosing Day, unsure about staying in Abnegation with her parents or moving to a different faction. On Choosing Day, Beatrice decides to leave Abnegation and join Dauntless. Her brother Caleb chooses Erudite.\n\nThe Dauntless instructor, Four, explains that not all Dauntless initiates will be allowed to enter the faction. The initiates will have to go through a series of training and evaluation. Unique to this faction, only the top ten initiates will stay, while the rest will be dismissed and become factionless; by contrast, the other factions allow everyone who complete initiation to enter. During her initiation, Beatrice renames herself Tris and befriends transfer initiates Christina, Al, and Will but comes into conflict with fellow initiates Peter, Drew, and Molly. She also befriends Dauntless-born initiates Uriah, Lynn, and Marlene.\nThe Willis (or Sears) Tower, one of several landmarks Roth describes within post-apocalyptic Chicago, the novel's setting.\nInitiation into Dauntless is composed of three stages. The first involves learning how to handle guns and knives and hand-to-hand combat with other initiates. Tris lacks the physical strength of most of her fellow initiates but finishes in sixth place by beating the higher-ranked Molly. When the rankings for Stage 1 of initiation are announced, a jealous Peter, who finished second, stabs first-place Edward in the eye with a butter knife during the night. Edward then leaves Dauntless to be Factionless, and his girlfriend Myra follows him out of Dauntless.\n\nDuring Visiting Day, Tris learns that her mother's faction of origin was Dauntless.\n\nErudite stirs dissent against the Abnegation leadership in the city's government and accuses Marcus, the Abnegation leader, of abusing his son. The fact that Marcus's son joined Dauntless two years before, and Tris' and Caleb's choices at the Choosing Ceremony, where they switched factions instead of remaining in Abnegation adds to the rumors. Abnegation is also alleged to be hoarding supplies meant to be sent out in the city.\n\nThe initiates enter Stage 2 of their training, which involves simulations similar to the aptitude tests. Initiates are forced to face hallucinations based upon their deepest fears. The simulations act in a hypnotic fashion and initiates forget their situation isn't real. Tris' Divergent abilities enable her to remember that she's facing a simulation, not reality. She uses this advantage and wins top rank in the class. Peter, Drew, and Al attack Tris in revenge with a threatened sexual assault and attempt to kill her by throwing her into the chasm at Dauntless headquarters. Four intervenes and stops it. Later, Al begs for Tris's forgiveness, but she rebuffs him. He later commits suicide by jumping into the chasm where he tried to kill Tris.\n\nThe final stage of Dauntless initiation gathers all their fears in a single simulation landscape. All the initiates, including the Divergents, are aware they are under a simulation and must use the skills they've learned in the previous stages to overcome each obstacle. Tris' relationship with Four continues to grow as she prepares for the last stage of testing, and he lets her into his own fear landscape. Four has four fears in his landscape, which is an uncommonly low number, hence his nickname. She also learns he is really Marcus' son Tobias, the child of the Abnegation leader the Erudites accused of child abuse. Four shares information with Tris that he discovered about Erudite's plans to use Dauntless to stage an attack on Abnegation.\n\nTris successfully overcomes seven fears in her fear landscape. After her test, she and the other Dauntless members are injected with a new \"tracking\" serum that supposedly activates if someone goes missing.\n\nBefore the official initiation ceremony, Four invites Tris back to his private apartment, and Tris expresses her feelings for him. The ceremony begins with the post of final rankings and Tris is ranked first. In the midst of celebrating she suddenly realizes Erudite will use the \"tracking\" serum to force Dauntless members to carry out their invasion of Abnegation.\nA junction on the Chicago \"L\", one of modern Chicago's train systems. Dauntless demonstrate their fearlessness by jumping on and off trains throughout the novel.\nThe night after the ceremony, the serum induces a simulation and all the Dauntless become sleep-walking soldiers under orders to attack the Abnegation compound. The serum doesn't work on Tris or Tobias (Four) because they are Divergent. Tris and Tobias try to break away from the pack and escape as they arrive at the Abnegation compound, but Tris is shot and wounded. Tobias refuses to leave her behind and they are captured and brought before Jeanine, the Erudite leader who is the mastermind of the whole attack. She injects Four with an experimental serum that overrides his Divergence, to control what he can see and hear. Jeanine directs Tobias back to the Dauntless control room to oversee the attack and sentences Tris to death. Tris wakes up sealed inside a real-life glass tank that fills up with water, but her mother breaks the tank and rescues her. Her mother reveals that she is also Divergent before she is killed helping Tris escape. Tris gets away but is forced to kill Will, who attacks her under the influence of the simulation.\n\nShe finds her father, Andrew, and Tobias' father, Marcus in a safe house. Tris tells them the reason for Dauntless' attack on Abnegation. Later, Caleb, Marcus, Andrew, and Tris head to the Dauntless compound to find the source of the simulation and fight their way through to Dauntless headquarters. Tris' father sacrifices himself to clear the way for her to reach the control room. She confronts the mind-controlled Tobias, who attacks her. Tris realizes she can't bring herself to kill him and surrenders. This causes Tobias to break through the special sight-and-sound-only simulation. Freed, Tobias helps Tris shut down the Erudite simulation and free the remaining Dauntless from their mind control. They rejoin Caleb, Marcus, and Peter, who helped Tris find the control room in exchange for his safety. The group boards a train to the Amity sector to find the rest of the Abnegation survivors.",
  "synopsis": null
}