{
  "imdb_id": "tt3806618",
  "tmdb_id": "291853",
  "douban_id": null,
  "title": "Threesome (2014)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "Denmark",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.4,
  "director": [
    {
      "id": "nm0084819",
      "name": "Claus Bjerre"
    }
  ],
  "writer": [
    {
      "id": "nm2094672",
      "name": "Lucas Alexander",
      "description": null
    },
    {
      "id": "nm0084819",
      "name": "Claus Bjerre",
      "description": null
    },
    {
      "id": "nm6572136",
      "name": "Maria Cordsen",
      "description": null
    },
    {
      "id": "nm6572135",
      "name": "Siff Lundgreen",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2094672",
      "name": "Lucas Alexander",
      "character": "Lucas"
    },
    {
      "id": "nm2422401",
      "name": "Magnus Bruun",
      "character": "Fyr i bar"
    },
    {
      "id": "nm6572136",
      "name": "Maria Cordsen",
      "character": "Maria"
    },
    {
      "id": "nm6572135",
      "name": "Siff Lundgreen",
      "character": "Siff"
    },
    {
      "id": "nm7070909",
      "name": "Thomas Dalmo Nommesen",
      "character": "Badmintonfyr"
    }
  ],
  "overview": "Siff, a student in sexology, find out her boyfriend Lucas and her close friend Maria is having an affair. Neither of them wants to break it up. As a solution the two women decide to share and sleep with Lucas by turns.",
  "storyline": "Siff, a zealous student in sexology, has recently moved to her boyfriend Lucas' place. Her close friend Maria is temporarily sleeping on their couch, though Lucas is not very keen on the idea. At first it seems the two women keep the phlegmatic Lucas well in hand. But when Siff is gone for a weekend seminar, Lucas has an affair with Maria. On finding out what has happened Siff wants to throw Maria out, but she doesn't have the heart to do it, so Lucas ends up promising Siff it will never happen again. But it does, Lucas and Maria still feel attracted to each other. Neither of them wants to break it up. As a solution the two women decide to share and sleep with Lucas by turns. But Siff knows from her studies that a threesome relationship will inevitably go on the rocks without a set of clean-cut agreements. So they work out a sex-calendar to manage their ménage à trois. Realizing she is trapped by her own broad-mindedness Siff understands she needs to set a limit.",
  "plot": "Due to an administrative error two male college students, the shy and intellectual Eddy (Josh Charles) and the All-American jock Stuart (Stephen Baldwin), end up with a female roommate. The university thought that Alex (Lara Flynn Boyle) was a man (based on her name) and thus the three students are forced to live with each other until the university can move Alex to a female residence hall.\n\nAlex falls in love and tries unsuccessfully to seduce Eddy; Eddy falls in love with Stuart; and Stuart is in love with Alex. The trio become good friends and scare off anyone who tries to seduce the other. Eventually, Alex, Stuart and Eddy agree to have an actual threesome that seems to destroy the friendship, and raises the possibility that Alex might have become pregnant.\n\nAfter the threesome, they start to drift apart. Three weeks later the semester ends and Alex moves to an apartment and Eddy gets a single dorm. Eddy (who acts as the film's narrator) eventually finds a boyfriend, Stuart finds happiness in a monogamous relationship with a woman, and Alex remains single. While they now only see each other for lunch occasionally, they do not seem to regret the friendship they had while in college.",
  "synopsis": null
}