{
  "imdb_id": "tt3850214",
  "tmdb_id": "308639",
  "douban_id": null,
  "title": "Dope (2015)",
  "genres": [
    "Comedy",
    "Crime",
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "103 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm0266622",
      "name": "Rick Famuyiwa"
    }
  ],
  "writer": [
    {
      "id": "nm0266622",
      "name": "Rick Famuyiwa",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm5473880",
      "name": "ASAP Rocky",
      "character": "Dom"
    },
    {
      "id": "nm2981935",
      "name": "Blake Anderson",
      "character": "Will Sherwood"
    },
    {
      "id": "nm0064193",
      "name": "Bruce Beatty",
      "character": "Mr. Bailey"
    },
    {
      "id": "nm0094170",
      "name": "De'aundre Bonds",
      "character": "Stacey"
    },
    {
      "id": "nm3903943",
      "name": "Julian Brand",
      "character": "Mario"
    },
    {
      "id": "nm1938751",
      "name": "Quincy Brown",
      "character": "Jaleel"
    },
    {
      "id": "nm4169922",
      "name": "Kiersey Clemons",
      "character": "Diggy"
    },
    {
      "id": "nm0253708",
      "name": "Kimberly Elise",
      "character": "Lisa Hayes"
    },
    {
      "id": "nm0289213",
      "name": "Rick Fox",
      "character": "Councilman Blackmon"
    },
    {
      "id": "nm6400046",
      "name": "Christopher Glenn",
      "character": "Crip 1"
    },
    {
      "id": "nm0365244",
      "name": "Ricky Harris",
      "character": "Tannehill James"
    },
    {
      "id": "nm3568982",
      "name": "Chanel Iman",
      "character": "Lily"
    },
    {
      "id": "nm0429480",
      "name": "Wyking Jones",
      "character": "SAT Proctor"
    },
    {
      "id": "nm1514763",
      "name": "Amin Joseph",
      "character": "The Voice"
    },
    {
      "id": "nm7031438",
      "name": "Kap G",
      "character": "Fidel X"
    },
    {
      "id": "nm2368789",
      "name": "Zoë Kravitz",
      "character": "Nakia"
    },
    {
      "id": "nm1280286",
      "name": "Allen Maldonado",
      "character": "Allen the Bouncer"
    },
    {
      "id": "nm1107024",
      "name": "Josh Meyer",
      "character": "DEA Tech"
    },
    {
      "id": "nm1483657",
      "name": "Mimi Michaels",
      "character": "AJ's Receptionist"
    },
    {
      "id": "nm1190373",
      "name": "Ashton Moio",
      "character": "Lance"
    },
    {
      "id": "nm4271336",
      "name": "Shameik Moore",
      "character": "Malcolm"
    },
    {
      "id": "nm0692493",
      "name": "Lidia Porto",
      "character": "Marta"
    },
    {
      "id": "nm1727825",
      "name": "Tony Revolori",
      "character": "Jib"
    },
    {
      "id": "nm2265758",
      "name": "Simmie Sims",
      "character": "Test Taker"
    },
    {
      "id": "nm0809793",
      "name": "Roger Guenveur Smith",
      "character": "Austin Jacoby"
    },
    {
      "id": "nm3147751",
      "name": "LaKeith Stanfield",
      "character": "Bug       (as Keith Stanfield)"
    },
    {
      "id": "nm6770906",
      "name": "Vince Staples",
      "character": "Dom's Crew 1"
    },
    {
      "id": "nm5546917",
      "name": "Milton T.J. Taylor",
      "character": "Young Malcolm       (as Milton TJ Taylor)"
    },
    {
      "id": "nm2997492",
      "name": "Tyga",
      "character": "De'Andre"
    },
    {
      "id": "nm6290276",
      "name": "Casey Veggies",
      "character": "The Rapper"
    },
    {
      "id": "nm0001845",
      "name": "Forest Whitaker",
      "character": "The Narrator"
    }
  ],
  "overview": "Malcolm is carefully surviving life in a tough neighborhood in Los Angeles while juggling college applications, academic interviews, and the SAT. A chance invitation to an underground party leads him into an adventure that could allow him to go from being a geek, to being dope, to ultimately being himself.",
  "storyline": "A coming of age comedy/drama for the post hip hop generation. Malcolm is a geek, carefully surviving life in The Bottoms, a tough neighborhood in Inglewood, CA filled with gangsters and drug dealers, while juggling his senior year of college applications, interviews and the SAT. His dream is to attend Harvard. A chance invitation to a big underground party leads Malcolm and his friends into an \"only in Los Angeles\" gritty adventure filled with offbeat characters and bad choices. If Malcolm can persevere, he'll go from being a geek, to being dope, to ultimately being himself.",
  "plot": "This article's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (February 2016) (Learn how and when to remove this template message)\nMalcolm Adekanbi and his best friends, Jib and Diggy, are high school \"geeks\" living in \"The Bottoms\" a crime-frequent neighborhood in Inglewood, California. Malcolm is confident he will be admitted to his dream school, Harvard University, on his academic ability, but his school counselor berates him since their school is in a run-down suburb in Los Angeles. He suggests Malcolm take college application process more seriously, starting with an upcoming interview with businessman and Harvard alumnus, Austin Jacoby.\n\nWhile biking home, Malcolm is stopped by Dom, a drug dealer who instructs him to invite a girl named Nakia to his party. Finding him charming, Nakia tells Malcolm to reply that she will only accept if Malcolm goes. Despite initial reluctance, Jib, Diggy convince Malcolm to go and the trio arrives. During the party, Dom and his crew meet in a back room to buy high-grade, powdered molly but are interrupted by a gang. Hidinf behind the bar, Dom finds Malcolm's backpack and fills it with the drugs and a gun, giving Malcolm it and sending him away while police arrive. Nakia then drives Malcolm home when he offers her help for the GED.\n\nThe next day, Malcolm discovers the items and an iPhone. Immediately, an unknown man calls, reveals that he knows Malcom's identity and instructs him to turn over the drugs that day. After school, Dom, in custody, calls and warns Malcolm that he is being lured and to flee. He texts Malcolm an address and tells him to ask for AJ. Malcolm, Jib, and Diggy flee to the address, a mansion, and are greeted by a young man named Jaleel and his sister Lily. Since their father, AJ, isn't home, Jaleel invites them inside and takes Jib and Diggy out for food while Malcolm stays with Lily. She seduces him, finds the drugs and takes a heavy dose. Meanwhile, Malcolm gets a phone call reminding him of the interview. Lily, intoxicated, drives him but passes out at a stop sign, who then runs out of the car and publicly urinates on a bush while bystanders record. Malcolm takes her car and drives to the meeting himself.\n\nArriving at Jacoby's office, he notices photos of Dom, Lily, and Jaleel in the man's office and realizes he is AJ. Malcolm relays Dom's instructions to Jacoby, but denies any knowledge and it is now Malcolm's responsibility and that if he succeeds, he will make Malcolm \"a Man of Harvard.\" He reschedules the interview - if the drugs aren't sold by then, Malcolm won't be admitted. Low on options, Malcolm, Jib, and Diggy seek help from a college student they met years ago, Will Sherwood. A stoner and hacker, he sets up an online black-market website to sell the drugs through Bitcoin transactions, which soon goes viral.\n\nMalcolm helps Nakia study, where she opens up to him. He then accuses her of being sent by Dom to gather info and pushes her away. The next day, Malcolm asks Will to extract cash from the Bitcoins, and arranges a meeting with a money-laundering gangster named Fidel. With the meeting going as planned, Malcolm leaves with a bag of cash but is assaulted by the school bully and company, quickly overpowering him and takes the bag. Desperate, he defends himself by pulling the gun, getting the money back and earning the bully's respect.\n\nReturning to AJ's office for his interview, Malcolm tells Jacoby that he has sold the drugs but has left a trail leading to Jacoby. Unless Jacoby admits him to Harvard, Malcolm will transfer the Bitcoins to Jacoby's checking account, which will frame Jacoby and have him arrest. He then types his college application essay. He describes two students – Student A is a music geek that plays in a punk band and gets straight As, while Student B suffers in the hood and makes money in immoral ways. He then asks, \"Which student do you think I am?\"\n\nMalcolm waits for Nakia at prom, but she does not show at all. Later, Nakia meets Malcolm at his home and thanks him for helping her pass her GED, giving him a pass to Six Flags and kisses him on the cheek. He then goes inside and enters his room to find an envelope from Harvard on his bed. He opens it and looks at the audience before smiling.",
  "synopsis": "Malcolm is a modern-day high school senior obsessed with 1990's hip-hop culture, along with his friends Jib and Diggy, he's a geek who is continually pushed around school. They live in \"The Bottoms\" part of Inglewood, California, a suburb of Los Angeles. Malcolm's ultimate dream is to go to Harvard but in a meeting with his counselor Mr. Bailey, Bailey calls Malcolm's desire to attend Harvard an arrogant one, and says that his straight A's don't mean a thing. Bailey then reminds Malcolm about his Harvard interview with a man named Austin Jacoby.A street drug dealer, Dom, stops Malcolm and tells him to go a building and invite a girl named Nakia to Dom's birthday party. Nakia says she'll go if Malcolm is there. Malcolm tells Jib and Diggy, who both think it would be a great idea if they went.The three go to Dom's party. At the party, Dom and his crew are buying powdered Molly when two rival gang members kick in the door and start shooting Dom's crew members, causing panic in the club. Dom hides behind the bar where he finds Malcolm's backpack. Thinking fast, he runs to Malcolm and tells him to run and don't stop. Malcolm sees Nakia on the floor and he helps her up.Nakia drives Malcolm home, thanking him for helping her. She likes him for not being like Dom and the other guys she's used to dealing with. He asks Nakia to prom since she says she missed hers and he offers to help her study for her GED. Nakia says she'll think about it. The next morning at school, Malcolm walks through the metal detector, which goes off and the guard dog barks at Malcolm. Since the guard knows Malcolm, he lets him walk away assuming the metal detector is malfunctioning. Malcolm looks in his backpack and finds the \"Molly\" (MDMA street name) and a gun. Panicked, he runs into the band room with Jib and Diggy. He realizes Dom slipped all of this in his bag during the shootout. Someone then calls Malcolm's phone and demands that he bring the contents of the bag to him later in the day.Malcolm walks over to a red El Camino as instructed, until he gets a phone call from Dom as he's being held at the station. He tells Malcolm that he was setup and needs to get out of there immediately since the guys could kill him. He orders Malcolm to go to an address that he'll text him and to ask for \"AJ\".The three go to the address. They meet Jaleel and his half-naked sister Lily. AJ is their father, and won't be home until later and invites the three inside to hang out. Jaleel then takes Jib and Diggy out to get food while Malcolm stays with Lily. She ends up seducing him and offers to take his virginity. Malcolm catches Lily taking some of the molly from his backpack. She straddles Malcolm and vomits on his face. Malcolm then gets a phone call reminding him of his alumni interview. Lily offers to drive him there.Lily, still high, drives recklessly through the streets until she passes out at a stop sign. The cops race past them, worried Malcolm tries to wake her up. She springs up yelling that she has to pee. Lily sprints across the road and squats to pee in a bush in front of a coffee shop, with other people watching and taping her. Malcolm takes her car and heads to the meeting himself.Malcolm makes his meeting with Austin Jacoby. He realizes Jacoby is AJ after seeing pictures of Dom, Lily, and Jaleel in his office. He mentions having something for the man as instructed by Dom, but Jacoby doesn't want the drugs after this botched delivery. Jacoby implicitly tells him that with Dom in jail, there is no method of selling the drugs, but he needs them sold anyway. He then implicitly says that he will get Malcolm to Harvard if he can sell the drugs. He then reschedules the interview to give Malcolm time. With no other options, Malcolm, Jib, and Diggy decide to seek help from a stoner/hacker they met at band camp years ago named Will Sherwood. Will helps the three organize an online network through Bitcoin transactions that would allow them to sell the molly without getting it traced back to them.The drug gets lots of attention after a video of Lily peeing in front of the coffee shop goes viral, so the drug itself is nicknamed \"Lily\".Malcolm runs into Nakia, who still wants to study. He helps her, and she later opens up to him about dealing with guys like Dom. Malcolm thinks she was sent there by Dom to gather info on the drugs. Offended, Nakia leaves and says Malcolm is just like all the other guys. When trying to collect cash in exchange for the Bitcoin currency, Will tells Malcolm that they need to go \"black market\" for the money and need to meet with another gangster named Fidel X. Malcolm does so and then proceeds to give him a jump drive with the bitcoin information in exchange for the cash.Malcolm returns to Jacoby's office and reveals that he secretly linked the bitcoin account to Jacoby's personal accounts. He brings ten percent of the money in cash, but tells Jacoby that he set up the account so that the DEA can trace the account if Jacoby ever tries to transfer the money electronically. Malcolm is the only way to get to the money, so Jacoby cannot kill him. Malcolm then demands that Jacoby get him into Harvard if he wants the money. Jacoby agrees to Malcolm's terms.Malcolm goes home and starts to come up with a new college essay. He describes two students Student A is a geek that hangs out with his friends and gets straight A's, while Student B earns a lot of money in an unethical way. He asks, \"Which student do you think I am?\"Malcolm and his friends go to prom together. He waits for Nakia, having apologized and given her a prom ticket. He goes home and finds her standing outside. She thanks Malcolm for helping her pass her GED. She then gives him a pass for Six Flags. She kisses Malcolm's cheek and walks back into her house.In the final scene, Malcolm goes home to find a big envelope from Harvard on his bed. He opens it and reads what's inside. He then looks to the audience for a moment before he smiles."
}