{
  "imdb_id": "tt3831810",
  "tmdb_id": "297961",
  "douban_id": null,
  "title": "Big Driver (TV Movie 2014)",
  "genres": [
    "Crime",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "87 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm0004121",
      "name": "Mikael Salomon"
    }
  ],
  "writer": [
    {
      "id": "nm0000175",
      "name": "Stephen King",
      "description": "story"
    },
    {
      "id": "nm1075295",
      "name": "Richard Christian Matheson",
      "description": "teleplay"
    }
  ],
  "cast": [
    {
      "id": "nm0004742",
      "name": "Maria Bello",
      "character": "Tess Thorne"
    },
    {
      "id": "nm0235652",
      "name": "Ann Dowd",
      "character": "Ramona Norvell"
    },
    {
      "id": "nm1705317",
      "name": "Will Harris",
      "character": "Lester"
    },
    {
      "id": "nm0005053",
      "name": "Joan Jett",
      "character": "Betsy Neal"
    },
    {
      "id": "nm0001156",
      "name": "Olympia Dukakis",
      "character": "Doreen"
    },
    {
      "id": "nm1219077",
      "name": "Jennifer Kydd",
      "character": "Patsy"
    },
    {
      "id": "nm4469249",
      "name": "Andre Myette",
      "character": "Lester's Brother"
    },
    {
      "id": "nm1203829",
      "name": "Juanita Peters",
      "character": "Molly"
    },
    {
      "id": "nm0158285",
      "name": "Mary-Colin Chisholm",
      "character": "Janine"
    },
    {
      "id": "nm1743069",
      "name": "Kim Parkhill",
      "character": "Leslie"
    },
    {
      "id": "nm0020439",
      "name": "Deborah Allen",
      "character": "Doris"
    },
    {
      "id": "nm1107283",
      "name": "Tara Nicodemo",
      "character": "Lady Cop"
    },
    {
      "id": "nm6854050",
      "name": "Roland Marko Simmonds",
      "character": "Cop"
    },
    {
      "id": "nm6854051",
      "name": "Mike Taylor",
      "character": "Limo Driver"
    },
    {
      "id": "nm0132665",
      "name": "Lee J. Campbell",
      "character": "Gun Store Owner"
    },
    {
      "id": "nm1401864",
      "name": "Trina Corkum",
      "character": "Gossiping Woman"
    },
    {
      "id": "nm0939277",
      "name": "Patrick Robert Wong",
      "character": "Convenience Store Clerk       (as Patrick Wong)"
    }
  ],
  "overview": "Based on a novella from Stephen King, A famous mystery writer sets out for revenge after a brutal attack.",
  "storyline": "Driving home along a generally unused country road following a speaking engagement, famed mystery novelist Tess Thorne experiences a flat tire on her car. She accepts the help of who she believes is a good Samaritan who stops to help her, but who instead rapes her, leaving her submerged in shallow water in a drainage pipe as dead. She found out that he actually orchestrated her getting the flat tire just moments before the rape. Alive, she, in shock, is able to make her way home, but she does not go to the hospital, dealing with her wounds herself, does not call the police, or tell any of her friends or acquaintances how she sustained her obvious injuries. Once the issue of what happened to her settles into herself, she decides to use her skills as an investigative writer to find out the reason behind what happened - if she was a random or targeted victim - and especially if the latter, how best to use that information to her advantage. Using her stories' grandmotherly heroine, Doreen...",
  "plot": "Tess Thorne, a successful crime-mystery writer, is invited to a library in upstate Massachusetts for a meet-and-greet with fans, but is scared of flying so drives to engagements even long distances away. After the event, Ramona, the organizer, suggests a quicker route home for Tess. However, it takes her via a remote rural location where her car runs over nail-studded planks lying across the road, puncturing her tire. It happens by an abandoned gas station and, having no signal for her cell phone, Tess hopes that someone will stop to help.\n\nA man in a pickup stops and offers to assist. At first he seems eager to help, but soon turns nasty. He hits her, then brutally rapes and beats her, before choking her into unconsciousness. He drags her into a culvert and leaves her there. When she recovers the man is gone, and she finds three female bodies in the culvert, all victims (she assumes) of the same man. Tess leaves to find help, but as she walks she worries that the attack will create a scandal – she will be attacked in the media for \"asking for it\" and blamed. She will be re-traumatized and her reputation will be destroyed. She comes across a convenience store and calls a limousine service for a ride home. She decides that she cannot tell anyone what happened.\n\nWhen Tess is safely home, she decides to avenge herself. She receives a call from Betsy, a waitress at the Stagger Inn, telling her that her car has been parked there. The pair form a bond by both being victims of violence. Tess later realizes that Ramona is her attacker’s mother and accomplice, who sought her out and invited her to the library, then led her into her son's trap. That night, she goes to Ramona's house with a gun to confront her. Ramona denies all knowledge and during a struggle Ramona wrestles the gun from Tess, then reveals that she helped orchestrate the attack and pulls the trigger, firing on an empty chamber. Tess grabs a kitchen knife and stabs Ramona before shooting her. She then spots an earring that she lost during the rape attack.\n\nIn the house, Tess finds clues that identify her attacker as Lester Norville, aka Big Driver. At a nearby gas station she sees his rig, and notes the address on the truck. On the way to the address she sees the rig parked, and stops. The green pickup that he drove to the attack pulls into the lot. Fired up, Tess runs to the truck and shoots the driver as he climbs out, but then realizes he is not Big Driver, but his brother, ‘Little Driver’. She regrets the killing but at the urging of ‘Doreen’, moves on to ‟finish the job”. (Doreen is a character from one of her books who together with others are the ‘Knitting Club’, with whom Tess often communicates.)\n\nTess drives on to the address which turns out to be Big Driver’s home. Breaking in, she finds graphic photos of his victims and photos of the brothers together with each body. There are also photos of her being raped by Big Driver. Realizing that 'Little Driver' is not innocent, she no longer feels guilt about shooting him. Hearing noises from an outbuilding, Tess enters to find Big Driver working at a bench; confronting him, she fires twice before the gun empties and she runs outside. He painfully follows her but she hits him on the head with a nailed plank like the one that caused the flat tire. As he is trying to escape, she calmly reloads and shoots him in the groin and watches him die. Doreen appears again and urges her to leave quickly.\n\nAn anonymous tip leads police to the bodies in the culvert, and to Big Driver's house with the incriminating photos. At home shortly afterwards, Tess receives an anonymous call from a woman she realizes is Betsy, who says: ‟I know what you’ve done. Way to go, girl!”",
  "synopsis": null
}