{
  "imdb_id": "tt3813480",
  "tmdb_id": "323644",
  "douban_id": null,
  "title": "Aya (2013)",
  "genres": [
    "Short",
    "Drama",
    "Thriller"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "8 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm3244333",
      "name": "Michael Watson"
    }
  ],
  "writer": [
    {
      "id": "nm5485830",
      "name": "Josh Harris",
      "description": "story"
    },
    {
      "id": "nm5485830",
      "name": "Josh Harris",
      "description": "writer"
    },
    {
      "id": "nm3244333",
      "name": "Michael Watson",
      "description": "co-writer"
    }
  ],
  "cast": [
    {
      "id": "nm2426831",
      "name": "Olivia Glynn-Jones",
      "character": "Aya"
    }
  ],
  "overview": "A young woman on the verge of suicide is approached by two familiar figures, one fighting for her, the other against her.",
  "storyline": "A young woman on the verge of suicide is approached by two familiar figures, one fighting for her, the other against her.",
  "plot": "Set in late 1950s, the film uses the symbols of Serpentine Worship and socio-political rebellions during that period of time to create an ambience for storytelling. The protagonist Dasan is a practicing Pulluvan, who has an aura of ascribed divinity around him. He has two wives, Janaki and Chakara. Janaki’s love with Dasan is platonic, but Chakara true to her name is possessive. Dasan along the course of time becomes passionate with Devaki Antharjanam, the wife of the village landlord as well. Be it wine, women or smoke, Dasan has no restrictions. His mastery over the profession was unparalleled. Due to the ascribed divinity around him, he is unquestioned. But not for too long. Something happens which makes his life topsy-turvy! The event also brings out the tenacity and quality of relations he had. The film depicts the various shades of love and problematizes the conventional concepts around it. It is also an attempt to transcend the definitions of love and to explore the flowering of bonds which are more deep rooted than love. What do we call it?",
  "synopsis": null
}