{
  "imdb_id": "tt3824442",
  "tmdb_id": "280174",
  "douban_id": null,
  "title": "Sarabham (2014)",
  "genres": [
    "Mystery"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "133 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm6590141",
      "name": "Arun Mohan"
    }
  ],
  "writer": [
    {
      "id": "nm6590141",
      "name": "Arun Mohan",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm5194813",
      "name": "Naveen Chandra",
      "character": "Vikram"
    },
    {
      "id": "nm5686248",
      "name": "Salony Luthra",
      "character": "Sanjana /              Shruti"
    },
    {
      "id": "nm4861046",
      "name": "Aadukalam Naren",
      "character": "Chandrasekhar       (as Narein)"
    },
    {
      "id": "nm6787082",
      "name": "Kadhal Kannan",
      "character": "Sreenivasan"
    },
    {
      "id": "nm5611465",
      "name": "Boys Rajan",
      "character": "Vikram's Boss"
    },
    {
      "id": "nm6787083",
      "name": "Sankara Narayanan",
      "character": ""
    },
    {
      "id": "nm6328044",
      "name": "Thilak Rammohan",
      "character": "Thilak - police inspector"
    },
    {
      "id": "nm6787084",
      "name": "Sam Anton",
      "character": ""
    }
  ],
  "overview": "Vikram, an ambitious young man who wants to get rich quick, is dejected when his project is rejected by his wealthy client Chandrasekar. He tries to take revenge and that is when he crosses the path of Chandrasekar's daughter Sruthi...",
  "storyline": "Vikram is a budding architect who dreams of making big money with his next project, a theme park to be built by millionaire Chandrasekaran's company. His dreams are shattered when the latter rejects the proposal over trivial issues. A devastated Vikram is driven to desperation and decides to vent his anger on Chandrasekaran, but co-incidentally crosses the life of his daughter Shruti who shares a strained relationship with her father. Both are in need of money and decide to dupe the millionaire. Though he succeeds, Vikram realizes soon that he is being played and framed. A sinister plot unveils to twist the fate of one and all to build up for an unexpected climax.",
  "plot": "Vikram (Naveen Chandra) is a young project manager at an architecture firm in Chennai. Though he leads an honest life, he maintains that it is not wrong to do something illegal for money as long as you don't get caught. One day, he goes to his firm's biggest client, Chandrasekar (Aadukalam Naren) to present an ambitious theme park project plan that he had been preparing for months. It is then when Vikram and his colleague see Chandrasekar's rebellious daughter enter the office to demand for money, embarrassing him in front of everyone. Having lost his mood, Chandrasekar coldly rejects Vikram's plan. Vikram gets drunk and then goes to Chandrasekar's beach house to vandalize it. Instead, he sees Chandrasekar's daughter running away. Vikram follows her to a nearby hotel and confronts her about her father's behaviour. She introduces herself as Shruti (Salony Luthra) and reveals that she dislikes her father just as much as Vikram does because he is a materialistic corporate man. Shruti follows Vikram home, where she proposes that he pretend to abduct her in order to extort ransom money from Chandrasekar. Vikram initially refuses. However, he learns from his superior at work the next day that Chandrasekar had a change of heart and has approved his theme park plan in condition that the firm has a more experienced project manager head the project. Vikram becomes ever more furious when his archenemy at the firm is chosen to lead the project and finally agrees to Shruti's plan. Together, Vikram and Shruti easily extort all the black money that Chandrasekar has been hiding away from the income tax department. He then sends Shruti back home safely while promising to keep her share of the money for her while she prepares her passport and visa to run away to Australia.\n\nThe next day, Vikram learns from the news that a young girl's dead body resembling Chandrasekar's daughter has been found washed up at the beach. As Vikram panics, Chandrasekar and Shruti walk into his apartment. Chandrasekar then reveals that the rebellious daughter Vikram saw the other day at his office was actually Shruti's twin, Sanjana (Salony Luthra). Shruti accidentally killed Sanjana while trying to stop the latter from taking her drugs. That was when she ran away from home and ended up with Vikram. Her father then calls her up and forces her to help him frame Vikram instead. This was why Chandrasekar approved Vikram's plan out of the blue and then had another project manager hired to further provoke him to have revenge. Chandrasekar then takes back his ransom money in return for not having Vikram arrested by the police for Sanjana's so-called kidnapping and murder.\n\nFurious that he has been played, Vikram decides to really kidnap Shruti for the money. He sees her leaving her father's beach house and takes her away forcefully. He has Chandrasekar bring his money to a warehouse in exchange for Shruti. At the warehouse, Chandrasekar brings a gang along for protection and Vikram has to fight them off. However, it is revealed that Shruti is actually Sanjana all along, and it was Shruti who was killed during their struggle. Knowing that their father would not support her, she pretended to be Shruti all along and had the real Shruti's body look like her instead. Seeing that her father never loved her and was instead happy she had died, she kills him in cold blood and splits the ransom money with Vikram. Sanjana then continues pretending to be Shruti and explains to the police that it was her own father who kidnapped and killed his drug addict daughter with the help of the gang to save his reputation. The gang then goes into hiding for a crime they did not commit. Meanwhile, Sanjana takes over Chandrasekar's company and hires Vikram as her theme parks's project leader.",
  "synopsis": null
}