{
  "imdb_id": "tt3872000",
  "tmdb_id": "281315",
  "douban_id": null,
  "title": "The Last Great Climb (2014)",
  "genres": [
    "Documentary"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "60 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm4792387",
      "name": "Alastair Lee"
    }
  ],
  "writer": [
    {
      "id": "nm6635142",
      "name": "Duncan Prestbury",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1616420",
      "name": "Chris Bonington",
      "character": "Himself"
    },
    {
      "id": "nm2541364",
      "name": "Leo Houlding",
      "character": "Himself"
    },
    {
      "id": "nm4975387",
      "name": "Sean Leary",
      "character": "Himself"
    },
    {
      "id": "nm6730920",
      "name": "Jason Pickles",
      "character": "Himself"
    }
  ],
  "overview": "The 2013 film from Alastair Lee is an epic to end all mountain epics se t in the stunning mountains of Queen Maud Land, Antarctica. The feature documentary follows top adventure climber Leo Houlding with his tried and tested team of Jason Pickles and Sean ‘Stanley’ Leary as they attempt to make the first ascent of the NE ridge of 'the master piece of the range'; the majestic Ulvetanna Peak (2931m). One of the most technically demanding climbs in the world’s harshest environment.  The film tells the story of a climber's life long dream reach one of the world's most remote and difficult summits, interweaved with the fascinating story of the mountain itself; which incredibly was only discovered in 1994. All set against the backdrop of the current age of mountaineering where few great lines remained unclimbed.",
  "storyline": "THE LAST GREAT CLIMB from Alastair Lee, is an epic to end all mountain epics, set in the stunning mountains of Queen Maud Land, Antarctica. The 2013 documentary film follows top adventure climber Leo Houlding with his tried and tested team of Jason Pickles and Sean 'Stanley' Leary as they attempted to make the first ascent of the NE ridge of 'the master piece of the range' - the majestic 'Ulvetanna Peak' (2931m), Queen Maud Land, Antarctica. One of the most technically demanding climbs in the world's harshest environment.",
  "plot": null,
  "synopsis": null
}