{
  "imdb_id": "tt3820450",
  "tmdb_id": "364708",
  "douban_id": null,
  "title": "All American Bikini Car Wash (2015)",
  "genres": [
    "Comedy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.3,
  "director": [
    {
      "id": "nm0952457",
      "name": "Nimrod Zalmanowitz"
    }
  ],
  "writer": [
    {
      "id": "nm1153499",
      "name": "Patrick Rodio",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4050470",
      "name": "Jack Cullison",
      "character": "Jack Miller"
    },
    {
      "id": "nm0770647",
      "name": "Jason Lockhart",
      "character": "Vex"
    },
    {
      "id": "nm4401152",
      "name": "J.R. Ritcherson",
      "character": "Marvin"
    },
    {
      "id": "nm3844430",
      "name": "Ashley Park",
      "character": "Brittany"
    },
    {
      "id": "nm6270328",
      "name": "Scarlet Red",
      "character": "Tori"
    },
    {
      "id": "nm3165063",
      "name": "Kayla Collins",
      "character": "Kelly"
    },
    {
      "id": "nm5924908",
      "name": "Dora Pereli",
      "character": "Amanda"
    },
    {
      "id": "nm6603046",
      "name": "Emma Lane",
      "character": "Mia"
    },
    {
      "id": "nm5407644",
      "name": "Thalia Longchamp",
      "character": "Vanessa"
    },
    {
      "id": "nm3576812",
      "name": "Brendan Nagle",
      "character": "Bobby Bullets"
    },
    {
      "id": "nm0148304",
      "name": "Heath Centazzo",
      "character": "Big Tony"
    },
    {
      "id": "nm6065119",
      "name": "Ryan Gold",
      "character": "Stuart Miller"
    },
    {
      "id": "nm4850533",
      "name": "Tom McLaren",
      "character": "Prof Dugan"
    },
    {
      "id": "nm4535518",
      "name": "Mindy Robinson",
      "character": "Tracy"
    },
    {
      "id": "nm1661634",
      "name": "Erika Jordan",
      "character": "April"
    },
    {
      "id": "nm5282007",
      "name": "Ana Foxx",
      "character": "Bikini Girl 1"
    },
    {
      "id": "nm6603048",
      "name": "Christiana Cinn",
      "character": "Bikini Girl 2"
    },
    {
      "id": "nm4617631",
      "name": "Arch Darrow",
      "character": "Old Man"
    },
    {
      "id": "nm6603049",
      "name": "Shelly Raiter",
      "character": "Marcy Miller"
    },
    {
      "id": "nm6603050",
      "name": "Eden Raiter",
      "character": "Sarah Miller"
    },
    {
      "id": "nm6603051",
      "name": "Daniel Convertino",
      "character": "Ferrari Customer"
    }
  ],
  "overview": "An enterprising college student agrees to run his professor's Las Vegas car wash to avoid flunking out of school. But it's Vegas gone wild when he decides to staff it with gorgeous bikini-clad girls.",
  "storyline": "Jack's hard-partying ways catch up with him when he learns he is failing out of college, but his professor offers him a chance to save his grade by running the local car wash business he owns for a week. But Jack takes on more than he can handle when his friends talk him into turning the business into a bikini car wash!",
  "plot": null,
  "synopsis": "Jack Miller is screwed. A perennial college slacker, Jack thought he had college all figured out. He was wrong. Jacks partying and overall laziness have caught up with him, and hes about to fail out of his business class. That means his father wont give him the start-up money he needs for his skate shop, which is all Jacks ever really wanted.But his professor gives him a pass or fail challenge - show that he can operate the local car wash the professor owns successfully for one week, and hell give him the extra credit he needs to pass his class, and then graduate!While discussing his situation with his friends, Vex and Marvin, they all realize theyre each pretty desperate (Vex needs money to pay a loan shark, and Marvin needs to get, well, laid). Inspired by the sight of their roommate, the sexy Tori, washing her car, they decide that running the business as a Bikini Car Wash is the way to go. Jack is reluctant but agrees. They hire Tori and a few friends, and are ready to wash some cars! Jacks friend Brittany is doubtful of the plan, but Jack assures her that it wont be sleazy or exploitative.After a slow start, it does well, but to keep it going and profitable, they need to sustain the success. With everyone help and input, it soon becomes a word-of-mouth hit. Brittany supports Jack but is critical of some of the overt sexiness, and when some of the girls threaten to make things a little too sexy, Jack realizes he needs to put his foot down. Plus, Jack didnt know that hed be dealing with extortion from the local mob family! But even though the pressure and stress is building, Jack is actually enjoying running the car wash.\nOnce Jacks Dad finds out the truth about Jacks failing grade (and the professor discovers his business has been turned into a bikini car wash), they both confront Jack and he has to come clean but Jack hopes that, in the end, the hard work of his team combined with his leadership will be enough for him to get the grade he needs."
}