{
  "imdb_id": "tt3883234",
  "tmdb_id": "294234",
  "douban_id": null,
  "title": "Bigger (2012)",
  "genres": [
    "Documentary",
    "Biography"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "87 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.4,
  "director": [
    {
      "id": "nm6647607",
      "name": "Jon Bulette"
    },
    {
      "id": "nm2572999",
      "name": "F. Stone Roberts"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm3647687",
      "name": "Precious Muir",
      "character": "Herself"
    }
  ],
  "overview": "\"Boobs\" is a documentary about one girl's journey through the beauty industry. British model, Precious Muir, has moved from London to New York to make it as a fashion model. Her career has not been what she had hoped, and she has decided that the best route to success is to undergo breast enhancement surgery. The film follows Precious as she undergoes the procedure (going from a B cup to a D cup), and the unexpected aftermath of this dramatic, life-altering decision.",
  "storyline": "Boobs is a documentary about one girl's journey through the beauty industry. British model, Precious Muir, has moved from London to New York to make it as a fashion model. Her career has not been what she had hoped, and she has decided that the best route to success is to undergo breast enhancement surgery.",
  "plot": "Laurel and Hardy establish an electrical goods store next door to Charlie Hall's grocery store. Hall, still sulking and suspicious from their previous encounter with the liquor-spiked well-water in \"Them Thar Hills\", mistakenly thinks that Hardy is making advances towards his wife (Mae Busch), and destroys a few items in Stan and Ollie's shop. Stan and Ollie leave their shop, without closing their door, to wreak havoc in Hall's grocery; while they are there, a shoplifter (Bobby Dunn) removes items from their store, taking more and more as their confrontations with Hall escalate (at first he merely carries the items out by hand a few at a time, but then, having come and gone unhindered several times, boldly returns with a wheelbarrow). A policeman eventually comes and straightens out the brouhaha, but when Laurel and Hardy return to their store, there's nothing left: the shoplifter has returned a final time with a huge moving-van, and taken everything away.",
  "synopsis": null
}