{
  "imdb_id": "tt3836512",
  "tmdb_id": "320048",
  "douban_id": null,
  "title": "Ratter (2015)",
  "genres": [
    "Drama",
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "80 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.6,
  "director": [
    {
      "id": "nm4734352",
      "name": "Branden Kramer"
    }
  ],
  "writer": [
    {
      "id": "nm4734352",
      "name": "Branden Kramer",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm1667364",
      "name": "Ashley Benson",
      "character": "Emma"
    },
    {
      "id": "nm2791093",
      "name": "Matt McGorry",
      "character": "Michael"
    },
    {
      "id": "nm0894627",
      "name": "Kaili Vernoff",
      "character": "Emma's Mom"
    },
    {
      "id": "nm3135063",
      "name": "Rebecca Naomi Jones",
      "character": "Nicole"
    },
    {
      "id": "nm1837544",
      "name": "Alex Cranmer",
      "character": "Professor"
    },
    {
      "id": "nm2508626",
      "name": "Michael William Freeman",
      "character": "Alex"
    },
    {
      "id": "nm3719644",
      "name": "John Anderson",
      "character": "Kent"
    },
    {
      "id": "nm0149920",
      "name": "Dylan Chalfy",
      "character": "Stalker"
    },
    {
      "id": "nm5706268",
      "name": "Jeremy Fiorentino",
      "character": "Officer Rodriguez"
    },
    {
      "id": "nm3194762",
      "name": "Karl Glusman",
      "character": "Brent"
    },
    {
      "id": "nm4723712",
      "name": "Jon Bass",
      "character": "Greg"
    },
    {
      "id": "nm4564474",
      "name": "Tali Custer",
      "character": "Alissa"
    },
    {
      "id": "nm8378340",
      "name": "Lola Hazim",
      "character": "Young nicole"
    },
    {
      "id": "nm0462416",
      "name": "Ted Koch",
      "character": "Dad"
    },
    {
      "id": "nm0464341",
      "name": "Jason Kolotouros",
      "character": "Officer Cicero"
    }
  ],
  "overview": "Emma is a young and beautiful graduate student just starting a new life in New York City. Like most people her age, she is always connected - her phone and laptop are constant companions, documenting her most intimate moments. What she doesn't realize is that she's sharing her life with an uninvited and dangerous guest. A hacker is following Emma’s every move. When the voyeuristic thrill of watching her digitally isn't enough, the situation escalates to a dangerous and terrifying level.",
  "storyline": "Emma, a graduate student living alone in NYC, is being watched by a stalker who hacks into the technology that surrounds her - laptop, cell phone, and other web connected devices. This obsession continues to grow as the hacker records Emma's most intimate moments. When the thrill of watching isn't enough, the situation escalates to a dangerous and terrifying level.",
  "plot": "Emma Taylor (Ashley Benson), a graduate student moves to New York for a fresh start after her recent break up with her boyfriend Alex. After getting settled into her new apartment someone begins anonymously hacking all her electronic devices and watching her through the cameras. One day while attending College Emma meets Michael (Matt McGorry), who asks Emma out. The two begin dating. However, she becomes suspicious after the hacker begins stealing private photos of her with Michael and sending her messages and videos pretending to be Michael. She confronts Michael who denies sending the messages, but Emma doesn't believe him and starts avoiding him.\n\nTo relieve some stress, Emma and her best friend, Nicole, go clubbing. While they are out the hacker breaks into her apartment. She returns home drunk and passes out on her couch without knowing her hacker is out on her balcony. When she wakes he is gone. Michael comes over later that day to see how she is doing and to give her a cat so she isn't so lonely, the two then reconcile about before and have sex. A little while later Michael calls her and tells her someone emailed him telling him to leave Emma alone. Emma freaks out and calls the cops who do nothing. She begins feeling isolated and depressed because there is nothing anyone can do about the situation.\n\nOne day Emma comes home to find her apartment door unlocked. She walks in her home and finds her cat dead. She tries to call Michael and tell him the news however he never answers or calls back. Feeling more vulnerable than ever Emma spends the day wandering the city so she doesn't have to be home alone. She makes plans with Nicole to hang out at Emma's apartment later so she returns home.\n\nWhile waiting for Nicole, Emma, and her Mom video chat. During the middle of the chat Emma's power cuts off and she begins screaming. The hacker appears and begins attacking Emma while the chat with her mom is still going. Emma's screams abruptly stop and her mom calls the cops. The hacker then turns the laptop towards him and Emma's mom begins pleading with him to leave her alone. He shuts the laptop. After the credits roll the cops show up and begin looking for Emma who along with her hacker are nowhere to be found.",
  "synopsis": "Emma Taylor (Ashley Benson), a graduate student, moves to New York City for a fresh start after her recent break up with her boyfriend Alex. After getting settled into her new Brooklyn apartment, someone begins anonymously hacking all her electronic devices and watching her through the cameras. One day while attending college, Emma meets Michael (Matt McGorry), who asks her out. The two begin dating. However, one night Emma pleasures herself, after which she becomes suspicious after the hacker begins stealing private photos of her with Michael and sending her messages and videos pretending to be Michael. She confronts Michael who denies sending the messages, but Emma does not believe him and starts avoiding him.To relieve some stress, Emma and her best friend, Nicole, go clubbing. While they are out the hacker breaks into her apartment. She returns home drunk and passes out on her couch without knowing her hacker is out on her balcony. When she wakes up he is gone but doesn't pay attention as she goes into the bathroom to relieve herself. Michael comes over later that day to see how she is doing and to give her a cat so she is not so lonely. The two then reconcile about before and have sex. A little while later Michael calls her and tells her someone emailed him telling him to leave Emma alone. Emma freaks out and calls the cops who do nothing. She begins feeling isolated and depressed because there is nothing anyone can do about the situation.One day Emma comes home to find her apartment door unlocked. She walks in her home and finds her cat dead. She tries to call Michael and tell him the news. However, he never answers or calls back. Feeling more vulnerable than ever Emma spends the day wandering the city so she does not have to be home alone. She makes plans with Nicole to hang out at Emma's apartment later so she returns home.While waiting for Nicole, Emma and her mom video chat. During the middle of the chat Emma's power cuts off and she begins screaming. The hacker appears and begins attacking Emma while the chat with her mom is still going. Emma's screams abruptly stop and her mom calls the cops. The hacker then turns the laptop towards him and Emma's mom begins pleading with him to leave her alone. He shuts the laptop. After the credits roll the cops show up and begin looking for Emma who along with her hacker are nowhere to be found."
}