{
  "imdb_id": "tt3879074",
  "tmdb_id": "403569",
  "douban_id": null,
  "title": "Total Frat Movie (2016)",
  "genres": [
    "Comedy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "93 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.4,
  "director": [
    {
      "id": "nm1284464",
      "name": "Warren P. Sonoda"
    }
  ],
  "writer": [
    {
      "id": "nm1072901",
      "name": "Stephen Fromkin",
      "description": null
    },
    {
      "id": "nm2484584",
      "name": "Sacha Pavlovic",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0214302",
      "name": "Justin Deeley",
      "character": "Charlie Martin"
    },
    {
      "id": "nm1329780",
      "name": "Jamie Johnston",
      "character": "Alex Watson"
    },
    {
      "id": "nm1903172",
      "name": "Steven Yaffee",
      "character": "John 'Douchenozzle' MacGyver"
    },
    {
      "id": "nm0396623",
      "name": "Alex House",
      "character": "Billy Taylor"
    },
    {
      "id": "nm7027308",
      "name": "Jason R. Stroud",
      "character": "Alpha Pledge #1"
    },
    {
      "id": "nm3635960",
      "name": "Jake Raymond",
      "character": "Alpha Pledge #2"
    },
    {
      "id": "nm2451211",
      "name": "Corey Gorewicz",
      "character": "Alpha Pledge #3"
    },
    {
      "id": "nm9201714",
      "name": "Rachelle Van Dijk",
      "character": "Sophie"
    },
    {
      "id": "nm1962639",
      "name": "Omar Habib",
      "character": "Active Alpha"
    },
    {
      "id": "nm3109458",
      "name": "Ann Pirvu",
      "character": "Rebecca 'Becca' Henley"
    },
    {
      "id": "nm4653974",
      "name": "Rebecca Dalton",
      "character": "Katie Littleton"
    },
    {
      "id": "nm0338381",
      "name": "Tom Green",
      "character": "Dean Kravitz"
    },
    {
      "id": "nm3598228",
      "name": "Ryan O'Callaghan",
      "character": "Jonesy"
    },
    {
      "id": "nm3889070",
      "name": "Nick Bateman",
      "character": "Alexander 'AJ' Chesterfield"
    },
    {
      "id": "nm3637096",
      "name": "David Alexander",
      "character": "Haroon       (as David Wontner)"
    },
    {
      "id": "nm5443751",
      "name": "Jack Ettlinger",
      "character": "Evan Hillman"
    },
    {
      "id": "nm5903903",
      "name": "Audrey Ferron",
      "character": "Stacey"
    },
    {
      "id": "nm9201715",
      "name": "John Stewart",
      "character": "Young Charlie"
    },
    {
      "id": "nm7390585",
      "name": "Isaac Kragten",
      "character": "Young Billy       (as Issac Kragten)"
    },
    {
      "id": "nm0182801",
      "name": "Sonya Côté",
      "character": "Pearl       (as Sonya Cote)"
    },
    {
      "id": "nm9201716",
      "name": "Pam Gordon",
      "character": "Edith"
    },
    {
      "id": "nm5183204",
      "name": "Mackenzie Ball",
      "character": "Sgt. Dustin Keeton"
    },
    {
      "id": "nm4359789",
      "name": "Drew Dafoe",
      "character": "Frank Van Dyke"
    },
    {
      "id": "nm2374363",
      "name": "Jon McLaren",
      "character": "Zack 'Escobar' Smith"
    },
    {
      "id": "nm1265503",
      "name": "Alexander Conti",
      "character": "Wiv Wivviot"
    },
    {
      "id": "nm0134227",
      "name": "Landy Cannon",
      "character": "Sam Venable"
    },
    {
      "id": "nm4152890",
      "name": "Olivia Leigh Nowak",
      "character": "Brooke"
    },
    {
      "id": "nm9201717",
      "name": "Ashley McIntee",
      "character": "Heather"
    },
    {
      "id": "nm9201718",
      "name": "Hilary Gowing",
      "character": "Claire"
    },
    {
      "id": "nm2414957",
      "name": "Eva Avila",
      "character": "Lisa"
    },
    {
      "id": "nm4276977",
      "name": "Jennifer Krukowski",
      "character": "Ashley"
    },
    {
      "id": "nm4033129",
      "name": "Katie Buitendyk",
      "character": "Penny"
    },
    {
      "id": "nm6704258",
      "name": "Jordan Kearns",
      "character": "Tanya Tatas"
    },
    {
      "id": "nm0413263",
      "name": "Andrew Jackson",
      "character": "Captain Vickers"
    },
    {
      "id": "nm9201719",
      "name": "Courtney Else",
      "character": "Muffy"
    },
    {
      "id": "nm0482126",
      "name": "Bill Lake",
      "character": "Robert Taylor"
    }
  ],
  "overview": "Charlie Martin, a JI whose fraternity gets kicked off campus after it takes the rap for a rival fraternity gone awry. Three years later, Charlie and the remaining brothers must throw the greatest rush event to recruit a new pledge class and bring the house back to glory.",
  "storyline": "Charlie Martin, a JI whose fraternity gets kicked off campus after it takes the rap for a rival fraternity gone awry. Three years later, Charlie and the remaining brothers must throw the greatest rush event to recruit a new pledge class and bring the house back to glory.",
  "plot": "Mac (Seth Rogen) and Kelly Radner (Rose Byrne) are a young couple with an infant daughter, Stella. The restrictions of parenthood make it difficult for them to maintain their old lifestyle, which alienates them from their friends Jimmy Blevins (Ike Barinholtz) and his ex-wife, Paula (Carla Gallo). One day, the couple finds out that Delta Psi Beta, a fraternity known for their outrageous parties, has moved into an adjacent house. The fraternity's leaders, Teddy Sanders (Zac Efron) and Pete Regazolli (Dave Franco), aspire to join Delta Psi's Hall of Fame by throwing a massive end-of-the-year party.\n\nOne night, the couple ask Teddy to keep the noise down. Teddy agrees on the condition that Mac and Kelly promise to always call him instead of calling the police. To earn Mac and Kelly's favor, Teddy invites them to join the party, which the couple agree to. At the party, Kelly meets Teddy's girlfriend Brooke Shy (Halston Sage) and Teddy shows Mac his bedroom, which includes a stash of fireworks and a breaker box that controls their power.\n\nThe following night, Mac tries his best to call Teddy but is unable to get in touch with him to ask him to keep it down so that their baby can sleep. Kelly convinces Mac to call the police and report the party as an anonymous person, but Officer Watkins (Hannibal Buress) identifies them to Teddy. Teddy feels betrayed that his new friends went back on their promise. The following day, Delta Psi constantly hazes Mac and Kelly, resulting in Stella nearly eating an unused condom after garbage from their party trash is dumped all over their lawn. The couple goes to the college dean Carol Gladstone (Lisa Kudrow) and learn that the school has a three strikes policy before they intervene with punishment; burning down their old house was Delta Psi's first strike.\n\nAfter failing to force the fraternity to move by damaging their house, Kelly manipulates Pete and Brooke into having sex and Mac gets Teddy to catch them. Teddy and Pete fight, which ends with a barbecue grill being rolled into the path of a passing car and injuring a professor, giving Delta Psi their second strike and placing the fraternity on probation for the remainder of the year, effectively ending their party plans. To acquire evidence of Delta Psi's hazing, Kelly and Mac hire a pledge nicknamed Assjuice (Craig Roberts) to stand up to Teddy to record him threatening retaliation. When Teddy instead shows him kindness, he reveals that Mac and Kelly hired him and also damaged their house. Teddy begins playing violent pranks on the couple.\n\nMac and Kelly send Teddy a counterfeit letter from Gladstone enabling them to have parties again, and Teddy begins planning their end-of-the-year bash. Once the party is in full swing, the Radners call Watkins to complain about the noise. Teddy discovers the random strangers sent by Mac, Kelly and Jimmy. After finding a flyer about the party and determining the letter is counterfeit, he stops the party just as Watkins arrives. Jimmy throws himself from the balcony to distract Teddy, allowing Mac and Kelly to sneak into Teddy's bedroom and restart the party using the breaker box. Teddy catches them and fights Mac, while Kelly lights one of the fireworks and shoots it at Watkins's patrol car, while Paula convinces one of the Frat boys to turn the breaker box, resuming the huge party while the police officer is still there. Teddy takes the blame for the party and convinces Pete to take the others and flee. Gladstone shuts the house down and Mac and Kelly return home, adjusting to their new lives. Jimmy and Paula also get back together.\n\nFour months later, Mac is at an outdoor shopping mall when he runs into Teddy, who is working as a shirtless greeter at Abercrombie &amp; Fitch. The two greet each other warmly and Teddy tells Mac that he is attending night classes to complete his degree. Mac takes off his shirt and jokingly acts as a greeter with Teddy.\n\nMac and Kelly later take pictures of Stella dressed in various costumes for a calendar. They get a call from Jimmy and Paula, who are attending Burning Man and invite the couple to come, including Stella. Mac and Kelly decline, accepting their new roles as parents.",
  "synopsis": null
}