{
  "imdb_id": "tt3824296",
  "tmdb_id": "315140",
  "douban_id": null,
  "title": "Touched (TV Movie 2014)",
  "genres": [
    "Drama"
  ],
  "country": "USA",
  "version": [],
  "imdb_rating": 6.9,
  "director": [
    {
      "id": "nm0561879",
      "name": "Bradford May"
    }
  ],
  "writer": [
    {
      "id": "nm1818496",
      "name": "Gina Van Name",
      "description": "written by and"
    },
    {
      "id": "nm1405911",
      "name": "Nathan Atkins",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0005368",
      "name": "Doris Roberts",
      "character": "Norma"
    },
    {
      "id": "nm0139257",
      "name": "Rachael Carpani",
      "character": "Emma"
    },
    {
      "id": "nm0001368",
      "name": "Ernie Hudson",
      "character": "Dr. Beck"
    },
    {
      "id": "nm1410077",
      "name": "Elizabeth Bond",
      "character": "Amber Fells"
    },
    {
      "id": "nm0308651",
      "name": "Chris Gartin",
      "character": "Henry Luther"
    },
    {
      "id": "nm0656335",
      "name": "Sam Page",
      "character": "Justin"
    },
    {
      "id": "nm0763643",
      "name": "Tessie Santiago",
      "character": "Maria Luther"
    }
  ],
  "overview": "Acclaimed author and recluse Norma Boswell is reaching the end of her days. She has kept her terminal diagnosis secret from everyone around her, her housekeeper and gardener, as well as her estranged son, Justin. As her health continues to decline, her doctor insists it is time to bring in a live-in nurse at home. Stubbornly proud, Norma rejects every candidate for the job straight away. That is until she comes across Emma Keating, who refuses to take no for an answer and whole-heartedly agrees to keep Norma’s secret.",
  "storyline": "Norma (an author of novels) finds herself diagnosed with cancer. Emma Norma's nurse is doing a secret treatment that no one may know about. While in her treatment to help her feel happy Norma finnishes her old books and her most favourite one happens to be named. Touched. Norma and Emma find that joy is the real medicine to any problem.",
  "plot": "Its plot is about two inmates of a mental institution, a man named Daniel and a woman named Jennifer, who are not as ill as the psychiatrists at the institution perceive them to be. Daniel and Jennifer escape to make lives for themselves together in the world at large.",
  "synopsis": null
}