{
  "imdb_id": "tt3846718",
  "tmdb_id": "358952",
  "douban_id": null,
  "title": "Freak Out (2015)",
  "genres": [
    "Comedy",
    "Horror"
  ],
  "country": "Israel",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm3872651",
      "name": "Boaz Armoni"
    }
  ],
  "writer": [
    {
      "id": "nm6614255",
      "name": "Lior Lederman",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm5770144",
      "name": "Itay Zvolon",
      "character": "Matan"
    },
    {
      "id": "nm3037198",
      "name": "Kye Korabelnikov",
      "character": "Stas"
    },
    {
      "id": "nm3963700",
      "name": "Assaf Ben-Shimon",
      "character": "Uzi"
    },
    {
      "id": "nm6614253",
      "name": "Eran Peretz",
      "character": "Ishay"
    },
    {
      "id": "nm4868414",
      "name": "Ofer Ruthenberg",
      "character": "Roy"
    },
    {
      "id": "nm9104338",
      "name": "Roni Dotan",
      "character": ""
    },
    {
      "id": "nm4723709",
      "name": "Yael Nivron",
      "character": "Ayelet"
    }
  ],
  "overview": "Matan, a soldier in the IDF, sets off for a week of patrolling in a remote base. Overwhelmed with homesickness, he becomes an easy target for the other soldiers who make it their business to make his life hell. However, it is not long before strange things begin to happen to all of them.",
  "storyline": "Matan, a soldier in the IDF, sets off for a week of patrolling in a remote base in the north of Israel with three soldiers whom he doesn't know. As the week progresses, the soldiers begin to question whether they will come out of this experience alive.",
  "plot": "The fourth season is set in Jupiter, Florida in 1952 and follows the lives of a troupe of people belonging to one of the last remaining freak shows of its time. Elsa Mars (Jessica Lange) is the owner of Fräulein Elsa's Cabinet of Curiosities; and her performers the bearded lady Ethel Darling (Kathy Bates), her lobster-handed son Jimmy Darling (Evan Peters), the strongman Dell Toledo (Michael Chiklis), and his three-breasted hermaphrodite wife Desiree Dupree (Angela Basset), as well as the newly recruited conjoined twin sisters Bette and Dot Tattler (Sarah Paulson).\n\nAfter their mother is found stabbed to death, Bette and Dot are discovered stabbed themselves at their farmhouse. The news makes headlines, and soon Elsa discovers the twins' existence. Believing the sisters to be her troupe's saviors, she brings them back to camp. They meet their fellow freaks Paul the Illustrated Seal (Mat Fraser) who has seal-like flippers for hands, Amazon Eve (Erika Ervin) who is the largest and strongest woman of the show, and finally the tiny performer from India, Ma Petite (Jyoti Amge) who is the smallest woman in the world. Bette sees the show as their haven but Dot believes that they are being exploited for their appearance. Meanwhile, serial killer Twisty the Clown (John Carroll Lynch) is responsible for recent murders and kidnappings that plagued the town.\n\nA detective arrives at the freak show to arrest Bette and Dot for the recent string of murders. After calling them all freaks and threatening to drive them out of town, Jimmy kills the detective and the freaks dispose of his body. After a performance, which was bought out by a wealthy widow named Gloria Mott (Frances Conroy) and her emotionally stunted son Dandy Mott (Finn Wittrock), Dandy demands to buy the twins, offering Elsa $15,000, but she declines. Enraged by his boring life, Dandy sets out to join the freak show, but Jimmy turns him down. Hoping to cheer her son up, Gloria finds Twisty on the side of the road and brings him home to surprise Dandy, not knowing that he is a meg. Dandy searches inside his bag and finds a severed head, causing Twisty to knock Dandy out and run away. Dandy follows him back to an abandoned school bus in the middle of the woods, where he discovers a kidnapped woman and boy, and realizes the two can work together.\n\nNew to the troupe are Dell and his wife Desiree, who fled Chicago after Dell murdered a man having sex with Desiree. Elsa allows him to be the show's bodyguard, but he soon becomes more than she can handle after he degrades her and beats up Jimmy for taking the freaks out in public to a diner. Ethel is less than happy about Dell's arrival; it is revealed that he and Ethel were once married, and after trying to kill his own son Jimmy, Ethel made him leave. When she learns that her liver is failing, Ethel makes Dell promise to look after Jimmy when she dies, though he is never to tell him of his true lineage.\n\nCon artists Stanley (Denis O'Hare) and Maggie Esmerelda (Emma Roberts) set their eyes on Elsa's troupe, hoping to make some money by selling the freak's corpses to a museum. Posing as a fortune teller, Maggie joins the troupe and soon falls for Jimmy. On Halloween, Ethel tells the urban legend of Edward Mordrake (Wes Bentley), a man born with a face on the back of his head, who, if summoned on Halloween, will take a freak to Hell with him. Elsa performs on Halloween night, unknowingly summoning Mordrake; who goes around camp learning the sad tales of its performers. Coming to Elsa's tent, she reveals her past life in Germany, where she worked as a dominatrix. She reveals that she was a victim of Hans Grüper, also known as Dr. Arthur Arden (James Cromwell), who amputated her legs while filming a snuff film. Mordrake is about to choose Elsa to take to Hell, but he hears music and realizes Elsa is not the one. Jimmy and Maggie try to rescue the kidnapped children after discovering Twisty's hideout, but Dandy knocks them out and he and Twisty put on a show for the kids. The pair soon escape and Mordrake visits Twisty, asking to learn his tale. He learns that Twisty worked as a clown at a freak show, and after two dwarves convinced him the police were after him for molesting children, Twisty made a failed suicide attempt, that left his jaw blown off. After revealing his misdeeds, Mordrake kills Twisty.\n\nNow that his mentor is dead, Dandy gets more curious about killing and starts by killing his maid Dora (Patti LaBelle), soon followed by a prostitute named Andy (Matt Bomer). Dora's daughter Regina Ross (Gabourey Sidibe) later visits Mott Manor looking for her mother. Gloria asks Dandy to see a therapist but he refuses to go anymore after the first visit. Gloria attempts to end the madness, but Dandy steals her gun, shoots her in the head and bathes in her blood. Stanley pressures Maggie to murder Jimmy and Ma Petite, but when she cannot go through with either one, he turns to Dell. After he blackmails him with the knowledge of his homosexual tendencies, Dell kills Ma Petite.\n\nOverhearing Elsa's plans to help get rid of the twins with Stanley, Ethel confronts Elsa, accusing her of killing anyone who steals her spotlight. Ethel shoots Elsa in her wooden leg, finding out her secret. However, Elsa throws a dagger through Ethel's eye, killing her. After she and Stanley make her death look like a suicide, Jimmy sinks into a drunken despair over his mother's death. Dandy visits the Tupperware party women and kills them all, framing Jimmy for the crime. Elsa prepares for her move to Hollywood after Stanley promises her a career in television, but when Dell tells her of Stanley convincing Jimmy to sell his hands to afford bail, she realizes he is not to be trusted. Traveling salesman and magician Chester Creb (Neil Patrick Harris) visits the freak show with his ventriloquist dummy, Marjorie, falling in love with the twins. Elsa sells the show to Chester to go with Stanley to Hollywood.\n\nDell tries to commit suicide by hanging himself but is saved by Desiree. When he admits to murdering Ma Petite to Desiree, Elsa shoots Dell in the head and kills him. During a feast to welcome the new owner, the freaks reveal they know of Stanley's true intentions, after Maggie confesses to Desiree. Desiree kills the curator of the museum and gives her head to Stanley. Stanley is chased around camp by the freaks, who later turn him into their own version of Meep. The next day, the troupe is rehearsing under Chester but Bette and Dot refuse to be his assistants and leave. Maggie volunteers, however, Chester hallucinates and sees Maggie as his wives who criticize him; he saws Maggie in half, killing her. He then chases Marjorie into his caravan and kills her also, believing Marjorie caused the hallucination. Chester leaves the freak show and turns himself in to the police. After careful consideration, the troupe believes Stanley's word and they plan to kill Elsa the same night. Before they can, Elsa is warned by Bette and Dot that she will be killed next, so Elsa sells the show to Dandy and moves to Hollywood.\n\nThe freaks quit and turn on Dandy which causes him to go on a killing spree. Desiree survives by hiding during the rampage while Jimmy is away from the grounds, and Bette and Dot are tied up in his tent. Jimmy comes back to see the corpses of his family in the performing tent, and finds that Desiree is the only survivor. The twins marry Dandy back at his mansion, but is revealed to be an act of vengeance, as Desiree drugs Dandy at dinner. He awakens to find himself chained in Hardeen Houdini's (Harry Houdini's brother) Chinese torture tank, and drowns while the remaining freaks watch.\n\nIn 1960, Elsa is now a household name with her very own TV show and multiple hit songs, yet she is not entirely happy with her life. When asked to perform for Halloween, Elsa refuses and meets with her old flame Massimo Dolcefino (Danny Huston). Massimo refuses to run away with her and tells her that he is dying. That night, the president of WBN tells Elsa that a copy of her snuff film has surfaced and her involvement with a freak show whose members (she is shocked to hear) were all murdered has been discovered, and this will ruin her career and marriage. She agrees to perform on Halloween, summoning Edward Mordrake and his troupe, who kills her. During the telecast, Desiree is married with two children, and a pregnant Bette and Dot are happily married to Jimmy. Instead of taking her to Hell, Mordrake banishes Elsa to a reincarnation of her freak show, where all of her deceased freaks now reside and she finally finds happiness with her true family.",
  "synopsis": null
}