{
  "imdb_id": "tt3825272",
  "tmdb_id": "372472",
  "douban_id": null,
  "title": "Clank: Agent Recruit (2015)",
  "genres": [
    "Action",
    "Thriller"
  ],
  "country": "Sweden",
  "version": [
    {
      "runtime": "101 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.2,
  "director": [
    {
      "id": "nm6216421",
      "name": "Pauli Janhunen Calderón"
    }
  ],
  "writer": [
    {
      "id": "nm6228292",
      "name": "David Anghel",
      "description": "concept"
    },
    {
      "id": "nm3175946",
      "name": "Emilio Janhunen Calderón",
      "description": "consulting writer"
    },
    {
      "id": "nm6216421",
      "name": "Pauli Janhunen Calderón",
      "description": "written by"
    },
    {
      "id": "nm6295256",
      "name": "Jonas Masko",
      "description": "consulting writer"
    }
  ],
  "cast": [
    {
      "id": "nm3175946",
      "name": "Emilio Janhunen Calderón",
      "character": "Max Lyons /              Smythe /              Henchmen"
    },
    {
      "id": "nm7106485",
      "name": "Sasha Ytterskog",
      "character": "Crane /              Graves"
    },
    {
      "id": "nm6434147",
      "name": "Rebecka Andersson",
      "character": "Julianne"
    },
    {
      "id": "nm6216421",
      "name": "Pauli Janhunen Calderón",
      "character": "Clank"
    },
    {
      "id": "nm6295256",
      "name": "Jonas Masko",
      "character": "Ronson /              Agent Trooper /              Henchmen"
    },
    {
      "id": "nm6492667",
      "name": "Pel Lindberg",
      "character": "Agent Leader"
    },
    {
      "id": "nm6228293",
      "name": "Timo Janhunen",
      "character": "Doctor Alfred"
    },
    {
      "id": "nm7038971",
      "name": "Gordon Woodward",
      "character": "Mr. Cooper"
    },
    {
      "id": "nm6279717",
      "name": "Olof Rindestad",
      "character": "Ryan /              Henchmen"
    },
    {
      "id": "nm7137363",
      "name": "Hugo Alberto Witting",
      "character": "General Villanueva /              Henchmen /              Trooper"
    },
    {
      "id": "nm7106486",
      "name": "Wille Glyt",
      "character": "Miguel /              Henchman"
    },
    {
      "id": "nm7106487",
      "name": "Beka Kuliev",
      "character": "Zulu /              Guard"
    },
    {
      "id": "nm6256144",
      "name": "Henrik Lindmark",
      "character": "Theodore Kerr /              Agent /              Guard"
    },
    {
      "id": "nm7106489",
      "name": "Jonas S. Einarsson",
      "character": "Number One"
    },
    {
      "id": "nm7106488",
      "name": "Denise Wessman",
      "character": "News Reporter /              Alarm voice"
    },
    {
      "id": "nm6228261",
      "name": "Olof Sköldberg",
      "character": "Henchman Squad Leader"
    },
    {
      "id": "nm7224927",
      "name": "Marcel Rossi",
      "character": "Agent Trooper /              Henchmen"
    },
    {
      "id": "nm7224926",
      "name": "Hampus Hardeborn",
      "character": "Henchmen"
    },
    {
      "id": "nm6228163",
      "name": "Xizco O. Triana",
      "character": "Silvio"
    },
    {
      "id": "nm6492668",
      "name": "Gabriel Tiedtke",
      "character": "Scouting Henchman"
    },
    {
      "id": "nm6610309",
      "name": "Adam Leijon",
      "character": "Scouting Henchman"
    },
    {
      "id": "nm7226885",
      "name": "Love Molander",
      "character": "Trooper /              Henchman"
    },
    {
      "id": "nm6277653",
      "name": "Joar Lindén",
      "character": "Daniel       (archive footage)"
    },
    {
      "id": "nm6279716",
      "name": "Johan Tryman",
      "character": "Crane       (archive footage)"
    }
  ],
  "overview": "An unknown enemy is threatening to reveal CIS most protected secrets. Clank begins a search for answers. Every clue that leads closer to uncovering an evil plan will also destroy things he cares about. The right choice must be made.",
  "storyline": "An unknown enemy is threatening to reveal CIS most protected secrets. Clank begins a search for answers. Every clue that leads closer to uncovering an evil plan will also destroy things he cares about. The right choice must be made.",
  "plot": "Above planet Tenemule in the Solana Galaxy, Chairman Drek (Paul Giamatti) stands poised with his fellow Blarg aboard the Deplanetizer, a space station with the power to destroy entire planets. The Blarg fire the Deplanetizer at Tenemule, completely destroying it.\n\nOn planet Veldin, a young spaceship mechanic named Ratchet (James Arnold Taylor) learns of the destruction of Tenemule along with three other planets, and the peacekeeping Galactic Rangers are being dispatched to address the situation. He also learns that their leader, the egocentric Captain Qwark (Jim Ward), plans to visit Veldin in search of a new recruit to the team. To the reluctance of his mentor Grimroth \"Grim\" Razz (John Goodman), Ratchet attempts to join, only to be rejected by Qwark moments later.\n\nIn a warbot factory on planet Quartu, a diminutive yet intelligent defective robot is created. Having acquired Drek's plans, he escapes Drek's lieutenant Victor Von Ion (Sylvester Stallone) and attempts to travel to planet Kerwan to warn the Rangers. The defect crash-lands on Veldin, where Ratchet takes him in and names him Clank (David Kaye). Learning of Drek's plot, Ratchet flies Clank to Kerwan, where the two are forced to help save the Galactic Rangers who Drek has already attacked. Victor barely escapes alive. Under pressure from reporters, Qwark makes Ratchet and Clank honorary Rangers. Upon learning this, Drek gets the idea of destroying the Rangers by turning Qwark against them. Ratchet joins Brax Lectrus (Vincent Tong) and Cora Veralux (Bella Thorne) in the field while Clank is assigned to the Rangers' support team with Elaris (Rosario Dawson), who is routinely ignored by Qwark. Studying the destroyed planets, they discover that the Blarg have been extracting portions containing famous landmarks from each.\n\nAfter briefing, the Rangers infiltrate the warbot factory on Quartu. They discover that the Blarg are planning to build a replacement planet from the other worlds' fragments, their planet (Quartu) having been polluted beyond surface habitation. The next target is Cora's homeworld of Novalis. Qwark encounters Drek, who offers to help boost his image in spite of Ratchet's popularity. Qwark accepts so long as Drek agrees never to hurt his Rangers. The rangers capture Zed (Andrew Cownden), one of Drek's main assistants.\n\nAs the Rangers assault the Deplanetizer, Drek forces Qwark to deactivate the Rangers' weapons. Victor raids the starship Phoenix and goes after Clank, who smartly uses water to defeat him. Ratchet manages to successfully board the station and sacrifice his ship, but Drek captures him and the Rangers can only watch as Novalis is destroyed. Ratchet learns Qwark is a traitor.\n\nAppalled, Qwark goes to confront Drek. However, he is also met by Drek's devious chief scientist Dr. Nefarious (Armin Shimerman) whom Qwark thought was killed during a prison escape. After he chides Qwark for selling out the Rangers, Dr. Nefarious betrays Drek by turning him into a sheep and ejecting him to New Quartu in an escape pod and takes control of the Deplanetizer for his own intentions.\n\nRatchet exiles himself back to Veldin, guilt-ridden, but Clank and the Rangers find him and convince him to return. With Novalis gone, the Deplanetizer's next and last target is planet Umbris which has an unstable core that would annihilate the other planets in the entire solar system if it is destroyed. Zed tells the group that Nefarious is the one behind all this.\n\nThey assault the Deplanetizer and Ratchet is forced to battle Qwark. After a long battle Ratchet pleads for Qwark to stop. Qwark, now realizing that he had been used, finally does so and apologizes to Ratchet. They confront Dr. Nefarious, who reveals that he was once a Ranger himself before he left due to Qwark's mistreatment. Dr. Nefarious successfully activates the Deplanetizer barely escaping Qwark, but not before the other Rangers are able to move it off target from Umbris. The Deplanetizer instead fires on New Quartu, destroying the composite planet and killing Drek, still being a sheep who crash landed on it moments prior. Ratchet, Clank and Qwark barely escape as the now-vulnerable station falls toward Umbris, while Dr. Nefarious is seemingly disintegrated by the energy of one of his own weapons (the RYNO, which he attempted to use on Qwark).\n\nHaving thwarted Drek and Dr. Nefarious, the other Rangers return to a hero's welcome on Kerwan, with the now-demoted Private Qwark shamelessly attempting to promote his apologetic autobiography about the crisis. Ratchet and Clank reunite on Veldin, with Ratchet promising that he will rejoin the Rangers when he is needed.\n\nIn a mid-credits scene, Dr. Nefarious is found amongst the Deplanetizer's wreckage on Umbris, and forcibly converted by one of his drones into his iconic robot form.\n\nIn the post-credits, the Plumber appears and scolds the audience that they have still not left the movie yet.",
  "synopsis": null
}