{
  "imdb_id": "tt3886444",
  "tmdb_id": "323030",
  "douban_id": null,
  "title": "Khamoshiyan (2015)",
  "genres": [
    "Drama",
    "Horror",
    "Romance",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "122 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.0,
  "director": [
    {
      "id": "nm5234003",
      "name": "Karan Darra"
    }
  ],
  "writer": [
    {
      "id": "nm0080333",
      "name": "Vikram Bhatt",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3073211",
      "name": "Gurmeet Choudhary",
      "character": "Jaidev"
    },
    {
      "id": "nm3170495",
      "name": "Ali Fazal",
      "character": "Kabir"
    },
    {
      "id": "nm5688044",
      "name": "Sapna Pabbi",
      "character": "Meera"
    },
    {
      "id": "nm7489809",
      "name": "Debina Choudhary",
      "character": "Simran"
    },
    {
      "id": "nm0080333",
      "name": "Vikram Bhatt",
      "character": "Book Editor"
    },
    {
      "id": "nm8245509",
      "name": "Debina Bonnerjee",
      "character": "Simran"
    },
    {
      "id": "nm4521892",
      "name": "Vinod Rawat",
      "character": "Good Spirit"
    }
  ],
  "overview": "An erotic love triangle revolving around a writer adrift in the icy slopes of Kashmir where he discovers a woman with a strange, silent past.",
  "storyline": "An erotic love triangle revolving around a writer adrift in the icy slopes of Kashmir where he discovers a woman with a strange, silent past.",
  "plot": "Kabir (Ali Fazal), is a novelist, whose failed career and relationship with Simran (Debina Bonnerjee) forces him to move to Kashmir in search of an inspirational story. In Kashmir, Kabir stops at a guest house run by the beautiful but mysterious lady Meera (Sapna Pabbi). Meera is married to Jaidev (Gurmeet Chaudhary), who is confined to his bed. On his first night at the guest house, Kabir begins seeing strange apparitions. He also becomes attracted towards Meera. Meera, who is also falling for Kabir, refuses to go with him. Kabir finds out that Meera has not been out of the house for two years.\n\nKabir now in love with Meera, tries to take her away from the house. While driving away,an evil force comes before their car and they have an accident. Curious, Kabir calls a tantrik after drugging Meera. The tantrik discovers an evil spirit in the house which attacks them, he claims that the spirit is of Jaidev, who is dead. Realization dawns upon Kabir, and he recalls Meera speaking on the phone in a man's voice and never seeing Jaidev in person. Kabir sneaks into Jaidev's room, only to find Jaidev sleeping. Furious with Kabir, Meera tells him to leave.\n\nKabir later returns to confront Meera. She reveals that she was involved in a hit and run two years back and to evade imprisonment she ran away to a small town in Kashmir, where she met Jaidev, a rich industrialist who lived in the huge mansion. She fell in love with him and soon they both got married. One night Meera saw Jaidev performing a ritual slaughter and praying to the devil. Scared and shocked Meera tried to run away but she was caught by Jaidev. In a struggle to stop her, Jaidev fell from the balcony and was paralysed below the waist. Later Jaidev committed suicide and left a letter for Meera, mentioning that she will have to live in the house forever with his soul, and if she ever tried to run away, his lawyer was instructed to open a letter upon news of his disappearance, which will detail that Meera has killed him and was the culprit in the hit and run. Meera had to stay in the house with Jaidev's soul and delude the world that her husband is alive.\n\nKabir decides to steal the letter from the lawyer's office, however he finds that there was no lawyer and Jaidev was bluffing. On knowing Jaidev's lie, Meera and Kabir plan to cremate Jaidev's body and set his spirit to rest. While they cremate his body, inside the house a laugh echos in the one of the rooms and Jaidev in a painting smiles sadisticly. To their surprise Jaidev returns to haunt Meera and captures her in the painting. Kabir goes to the tantrik for help, who it turns out is also a spirit. The tantrik tells Kabir that the painting is merely a portal to the world of spirits. He gives Kabir holy water to spray on Jaidev and informs him that he doesn't have long to save Meera. After a lot of deadly struggles, Kabir drinks a drop of Jaidev's blood to get Jaidev's spirit to enter his body. He later drinks holy water, which makes Jaidev's evil spirit perish, setting Meera free.\n\nKabir is shown at a book launch for his latest novel, Khamoshiyan. Meera is also at the party but the two leave to spend some time alone together.",
  "synopsis": null
}