{
  "imdb_id": "tt3949936",
  "tmdb_id": "339944",
  "douban_id": null,
  "title": "The Secret Society of Souptown (2015)",
  "genres": [
    "Action",
    "Adventure",
    "Family",
    "Fantasy",
    "Mystery"
  ],
  "country": "Estonia",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm2454264",
      "name": "Margus Paju"
    }
  ],
  "writer": [
    {
      "id": "nm3099569",
      "name": "Mika Keränen",
      "description": "books"
    },
    {
      "id": "nm5900577",
      "name": "Christian Gamst Miller-Harris",
      "description": "co-writer"
    },
    {
      "id": "nm5900577",
      "name": "Christian Gamst Miller-Harris",
      "description": null
    },
    {
      "id": "nm1284642",
      "name": "Mihkel Ulman",
      "description": "scenario"
    },
    {
      "id": "nm1284642",
      "name": "Mihkel Ulman",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm7275655",
      "name": "Olivia Viikant",
      "character": "Mari"
    },
    {
      "id": "nm7275656",
      "name": "Arabella Antons",
      "character": "Sadu"
    },
    {
      "id": "nm7275657",
      "name": "Hugo Soosaar",
      "character": "Olav"
    },
    {
      "id": "nm7275658",
      "name": "Karl Jakob Vibur",
      "character": "Anton"
    },
    {
      "id": "nm1801089",
      "name": "Mirtel Pohla",
      "character": "Kadri Heller"
    },
    {
      "id": "nm1840656",
      "name": "Evelin Võigemast",
      "character": "Reet Haljandi"
    },
    {
      "id": "nm1271089",
      "name": "Ott Aardam",
      "character": "Hannes Haljandi"
    },
    {
      "id": "nm1796577",
      "name": "Tiit Lilleorg",
      "character": "Peeter Remmelgas"
    },
    {
      "id": "nm7275659",
      "name": "Sten-Markus Rohtla",
      "character": "Leo"
    },
    {
      "id": "nm7275660",
      "name": "Gregor Kelder",
      "character": "Vant"
    },
    {
      "id": "nm7275661",
      "name": "Meriliis Lillemägi",
      "character": "Cätly"
    },
    {
      "id": "nm1311267",
      "name": "Sampo Sarkola",
      "character": "Arttu Peltomaa"
    },
    {
      "id": "nm1800530",
      "name": "Karin Rask",
      "character": "Sadu ema"
    },
    {
      "id": "nm7275662",
      "name": "Kaido Höövelson",
      "character": "Sadu isa"
    },
    {
      "id": "nm3856179",
      "name": "Jaak Prints",
      "character": "Politseinik Kuul"
    },
    {
      "id": "nm1797216",
      "name": "Tõnu Oja",
      "character": "Politseinik Lippur"
    },
    {
      "id": "nm7275663",
      "name": "Jonathan Peterson",
      "character": "Onu Kristjan"
    },
    {
      "id": "nm7970008",
      "name": "Ireen Peegel",
      "character": "Mask"
    },
    {
      "id": "nm0527493",
      "name": "Ain Lutsepp",
      "character": "Linnapea"
    },
    {
      "id": "nm1271088",
      "name": "Argo Aadli",
      "character": "Hillar Vesimaa"
    },
    {
      "id": "nm1936672",
      "name": "Ardo Ran Varres",
      "character": "Valvur"
    },
    {
      "id": "nm0901508",
      "name": "Peeter Volkonski",
      "character": "Raamatukoguhoidja"
    },
    {
      "id": "nm7275664",
      "name": "Sander Rebane",
      "character": "Paul Veenre"
    },
    {
      "id": "nm0623863",
      "name": "Lauri Nebel",
      "character": "Surnuaiavaht"
    },
    {
      "id": "nm7275665",
      "name": "Edgar Külaots",
      "character": "Katsealune"
    },
    {
      "id": "nm4268531",
      "name": "Külliki Saldre",
      "character": "Peaõde"
    },
    {
      "id": "nm7970009",
      "name": "Pille Rossi",
      "character": "Valveõde"
    },
    {
      "id": "nm7299661",
      "name": "Alo Kurvits",
      "character": "Jõumehe Atraktsiooni Juht"
    },
    {
      "id": "nm5332430",
      "name": "Anni Aguraijuja",
      "character": "Üliõpilane"
    },
    {
      "id": "nm7970010",
      "name": "Kristi Ruusna",
      "character": "Üliõpilane"
    },
    {
      "id": "nm7970011",
      "name": "Riste Lehari",
      "character": "Üliõpilane"
    },
    {
      "id": "nm7970012",
      "name": "Trevor Mattias Sakias",
      "character": "Noor Peeter Remmelgas"
    },
    {
      "id": "nm1253030",
      "name": "Oleg Rogatchov",
      "character": "Igor       (as Oleg Rogatsov)"
    },
    {
      "id": "nm0483818",
      "name": "Anu Lamp",
      "character": "Proua Rovel"
    },
    {
      "id": "nm0699310",
      "name": "Rein Pruul",
      "character": "Rikas Mees"
    },
    {
      "id": "nm2870572",
      "name": "Maria Peterson",
      "character": "Antoni Nutitelefon"
    },
    {
      "id": "nm7970013",
      "name": "Tõnu Karjatse",
      "character": "Raadiodiktor"
    },
    {
      "id": "nm7970014",
      "name": "Anastassia Savela",
      "character": "Baleriin 'Faustis'"
    },
    {
      "id": "nm7970015",
      "name": "Marika Muiste",
      "character": "Baleriin 'Faustis'"
    },
    {
      "id": "nm7970016",
      "name": "Oksana Saar",
      "character": "Baleriin 'Faustis'"
    },
    {
      "id": "nm7970017",
      "name": "Svetlana Danilova",
      "character": "Baleriinid 'Faustis'"
    },
    {
      "id": "nm7970018",
      "name": "Anatoli Arhangelski",
      "character": "Mephistopheles"
    },
    {
      "id": "nm5982071",
      "name": "Daniel Kirspuu",
      "character": "Faust"
    },
    {
      "id": "nm7970019",
      "name": "Lauri Sirp",
      "character": "Dirigent"
    }
  ],
  "overview": "\"Secret Society of Souptown\" is an adventurous family movie that takes place in Souptown, a district in the summery city of Tartu. Four children - Mari, Sadu, Olav and Anton form a secret society to play hide-and seek games invented by Mari's grandfather, a professor at the university. When the city is attacked by a mysterious poison which turns adults into children our gang embarks on a quest for the antidote. Their path is paved with challenges bigger than any other they have seen so far. It is an adventure you cannot even imagine... Will the children find the antidote in time to save their loved ones.",
  "storyline": "\"Secret Society of Souptown\" is an adventurous family movie that takes place in Souptown, a district in the summery city of Tartu. Four children - Mari, Sadu, Olav and Anton form a secret society to play hide-and seek games invented by Mari's grandfather, a professor at the university. When the city is attacked by a mysterious poison which turns adults into children our gang embarks on a quest for the antidote. Their path is paved with challenges bigger than any other they have seen so far. It is an adventure you cannot even imagine... Will the children find the antidote in time to save their loved ones.",
  "plot": "This section's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (October 2015) (Learn how and when to remove this template message)\nThe movie begins with Lily having a flashback: her mother is packing, when T-Ray enters the room and grabs her. Frightened, she grabs a gun but it is knocked out of her hands. Lily's mother holds out her hand for Lily to hand her the gun. Then, a gunshot is heard and Lily states that she accidentally killed her mother, while trying to help her when she was young.\n\nIn the night, Lily sees many bees in her room and tells her father but T-Ray yells at her to go back to bed. The next night, Lily runs into their peach tree orchard and digs up a box she buried there. The box contains her mother's gloves, a small photograph of her mother, and a flat wood carving of the Black Madonna. She unbuttons the bottom part of her blouse and sets the carving on her stomach. While Lily lies staring at the stars and talking to her mother's spirit, she hears her father calling. He accosts her. As there is no one else, T-Ray takes Lily home.\n\nThe next morning, the housekeeper Rosaleen surprises Lily with a cake for her 14th birthday. As T-Ray enters, Rosaleen states that she is going to take Lily into town to buy her a training bra. Lily asks him to tell her about her mother as her birthday gift but he says very little. When Rosaleen and Lily walk uptown, they are confronted by three racist men who insult Rosaleen. She is beaten up and arrested. After T-Ray and Lily get home, T-Ray punishes Lily sending her to her bedroom and he and Lily argue. When Lily calls him a liar, he again tells her to stay in her room. Lily waits until he is gone before she writes a letter saying \"Don't bother to look for me. People like you who tell lies should rot in hell\". After setting the note on the table, she grabs the bag she has packed and goes to the hospital \"colored ward\" to find Rosaleen.\n\nThey run away to a town, where Lily's mother was thought to have once lived, called Tiburon. They find a honey jar with the same picture of the Virgin Mary that Lily had. When they ask who made the honey, they are led to the house of August Boatwright and her sisters, May and June. May had a twin, April, who is revealed to have died during their childhood. Her condition makes her have difficulties distinguishing others' problems from hers. She sees everyone's problems as her concern and she has difficulties coping with her \"extra problems\". Lily lies and says that she is an orphan, that Rosaleen is a nanny, and that they have no place to stay. August offers to let them help with the honey in exchange for shelter, much to June's dismay.\n\nLily experiences growing up in their household. June has a boyfriend named Neil, who is trying to marry her but she always refuses. Lily questions August as to why she uses \"black\" Mary pictures. She claims that she was sent by God to help African Americans have peace and equality. When Lily is introduced to the local church, she has a flashback when the memories of the night her mother died begin to come to her. She discovers a wall outside of the house that has little pieces of paper stuffed between the holes. It was built for May after April died. August claimed that they were psychically linked to one another and were like a single person. After April died, May became very emotional and easily broken down by sad situations. She would write all the things that troubled her and put them into the wall.\n\nLily and a teenage boy named Zach, who works with the bees become friends. Soon after, Lily meets with Zach and they start to talk about each other's futures. Lily confesses she loves English and wants to become a writer as Zach confesses he wants to become a lawyer. On the ride to town to deliver honey, Lily confides in Zach the truth of their situation and the reason why she came to August. He gives her a notebook because she claimed to want to be a writer. They decide to watch a movie together but Lily sits in the \"colored\" section. This incites a racist mob who kidnap Zach and call Lily names for choosing to associate with him. Zach's mother and the Boatwright family are very worried and concerned. June and August decide not to tell May of Zach's disappearance, for fear of what it would do to her fragile mental state.\n\nZach's mother comes to the house to pray before the statue of the Black Madonna in the living room and runs into May afterwards. She confides in an unknowing May who subsequently goes into shock. The others grow worried after May disappears for an unusual amount of time. They go out to look for her only to discover that May's sadness and dismay led her to kill herself, by placing a large rock upon her chest and lying down in a shallow section of the river by their home. She writes a suicide note to August and June, claiming that she was too tired of carrying the weight of the world on her shoulders and that she would be much happier with her sister and parents in Heaven. Soon after May's death, Zach returns bruised and distraught. After her funeral, August and June slowly begin to recover from their loss, with June even finally agreeing to marry Neil, whom she had broken up with in a fit of indecisive anger and fear. Realizing the sisterly bond they have formed with Rosaleen, August and June embrace her as their new sister and decide to call her \"July\".\n\nMeanwhile, Lily shows August the picture of her mother and August admits that she knew all along. Lily confesses that she, while trying to help her mother, wound up killing her. She also confesses her belief that Zach's disappearance was all her fault, as well, so she needs to leave, convinced it is best for everyone that she leave since she is unlovable and destroys all that she comes across. Lily breaks down crying and runs to the honey house, where she breaks several jars. August finds her and gives over the things that her mother left, when she went back to get Lily, though Lily doesn't believe her. Lily receives her mother's old comb, pin, a piece of poetry and a picture of her mother with baby Lily. This shows that Deborah did love her daughter. Zach gives her a necklace telling Lily to never forget their story and she smiles and says she won't. They share a kiss.\n\nLater on, T-Ray comes to the Boatwright home looking for Lily. When he sees Lily wearing her mother's pin, he mistakes her for her mother for a second and proceeds to grab and drag her out of the house, all the while telling her she can't leave him. In a moment of panic, Lily calls him 'Daddy', causing him to come to himself. She tells him she's staying there and after August shows up to calm the scene and assure him they'll take care of her, he reluctantly gives August permission to take care of Lily, for as long as she wanted to stay there. As T-Ray drives off, he admits that the day Deborah left, she wasn't only coming back for her stuff, but coming back for Lily. He says he lied because she wasn't coming back for him.\n\nLily's voice-over states that she thought, as T-Ray drove off, saying \"Good riddance\", he was really saying \"Lily, you'll be better off here with all of these mothers.\" Lily is shown writing the contents of the entire story into the notebook that Zach gave her and she puts it in May's wall and is shown wearing Zach's necklace. She walks off into the honey house as the scene fades to black.",
  "synopsis": null
}