{
  "imdb_id": "tt3923116",
  "tmdb_id": "254012",
  "douban_id": null,
  "title": "Venus Talk (2014)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "South Korea",
  "version": [
    {
      "runtime": "109 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.3,
  "director": [
    {
      "id": "nm1394119",
      "name": "Chil-in Kwon"
    }
  ],
  "writer": [
    {
      "id": "nm6689799",
      "name": "Lee Soo-ah",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1105090",
      "name": "Uhm Junghwa",
      "character": "Jung Shin-Hye       (as Jeong-hwa Eom)"
    },
    {
      "id": "nm0600668",
      "name": "So-Ri Moon",
      "character": "Jo Mi-Yeon"
    },
    {
      "id": "nm5180933",
      "name": "Min-soo Jo",
      "character": "Lee Hae-Young"
    },
    {
      "id": "nm5668344",
      "name": "Jae-yoon Lee",
      "character": "Hwang Hyun-Seung"
    },
    {
      "id": "nm1520129",
      "name": "Sung-min Lee",
      "character": "Lee Jae-Ho"
    },
    {
      "id": "nm0497710",
      "name": "Kyeong-yeong Lee",
      "character": "Choi Sung-Jae"
    },
    {
      "id": "nm2246822",
      "name": "Hye-jin Jeon",
      "character": "Jeon Hye-Jin"
    },
    {
      "id": "nm4298865",
      "name": "Moo-Seong Choi",
      "character": "Lee Sung-Wook"
    },
    {
      "id": "nm1040587",
      "name": "Hae-hyo Kwon",
      "character": "President Park"
    },
    {
      "id": "nm1074519",
      "name": "Ho-jin Kim",
      "character": "Gu Dong-Wook       (as Ho Jin Kim)"
    },
    {
      "id": "nm1262749",
      "name": "BoA",
      "character": "Mi-yeon's Neighbor"
    }
  ],
  "overview": "Independent TV producer Shin-Hye (UHM Jung-Hwa), self-assured housewife Mi-Yeon (MOON So-Ri), and single mom Hae-Young (JO Min-Soo) are a tight-knit group of 40-something friends going through the ups and downs of their lives and loves in modern day Seoul. This racy comedy is the latest from director KWON Chil-in, known for his frank portrayals of relationships and women's sexuality.",
  "storyline": "Shin Hye, Mi Yeon, and Hae Young are three vivacious women who help each other through the tangles of their romantic lives, from tentative first dates to Viagra-taking husbands and one-night stands. Being 40 proves that they're not past their prime!",
  "plot": "Shin-hye (Uhm Jung-hwa) is a capable, successful TV producer, sometimes derided as a \"gold miss\" for still being single in her forties. Her protege-turned-longtime boyfriend, the current chief of their TV network, just left her for a younger woman who also happens to be Shin-hye's junior colleague.\n\nShin-hye has two best friends, Mi-yeon (Moon So-ri), a housewife who isn't satisfied with her sex life with her rather docile husband Jae-ho (Lee Sung-min), and Hae-young (Jo Min-su), a soft-hearted, divorced single mother who wants her grown daughter Soo-jung (Jeon Hye-jin) to move out so she can have more time with her widowed boyfriend, carpenter Sung-jae (Lee Geung-young).\n\nSoon, life gets better for the three friends. Shin-hye begins a thrilling relationship with a younger man (Lee Jae-yoon), another TV producer who is 17 years her junior; she tries to keep the relationship casual but can't stop herself from falling for him. Mi-yeon and Jae-ho enjoy a second honeymoon after their daughter leaves to study abroad and he starts taking Viagra. Soo-jung finally gets married upon her unexpected pregnancy and moves out of Hae-young's home. But things take a turn when Hae-young is diagnosed with cancer, and Mi-yeon finds out her husband had an affair.",
  "synopsis": null
}