{
  "imdb_id": "tt3923662",
  "tmdb_id": "343173",
  "douban_id": "26349395",
  "title": "The Rezort (2015)",
  "genres": [
    "Horror",
    "Sci-Fi",
    "Thriller"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "93 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.1,
  "director": [
    {
      "id": "nm1530422",
      "name": "Steve Barker"
    }
  ],
  "writer": [
    {
      "id": "nm1268554",
      "name": "Paul Gerstenberger",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0779084",
      "name": "Dougray Scott",
      "character": "Archer"
    },
    {
      "id": "nm2681284",
      "name": "Jessica De Gouw",
      "character": "Melanie Gibbs"
    },
    {
      "id": "nm0564901",
      "name": "Martin McCann",
      "character": "Lewis Evans"
    },
    {
      "id": "nm0329647",
      "name": "Claire Goose",
      "character": "Valerie Wilton"
    },
    {
      "id": "nm2580536",
      "name": "Elen Rhys",
      "character": "Sadie"
    },
    {
      "id": "nm2623902",
      "name": "Jassa Ahluwalia",
      "character": "Jack"
    },
    {
      "id": "nm5679844",
      "name": "Lawrence Walker",
      "character": "Alfie"
    },
    {
      "id": "nm4586939",
      "name": "Kevin Shen",
      "character": "Nevins"
    },
    {
      "id": "nm0694463",
      "name": "Sean Power",
      "character": "Spencer"
    },
    {
      "id": "nm4524012",
      "name": "Jamie Ward",
      "character": "Mike"
    },
    {
      "id": "nm4564730",
      "name": "Dave Wong",
      "character": "Ken Lee"
    },
    {
      "id": "nm1600132",
      "name": "Shane Zaza",
      "character": "Salva"
    },
    {
      "id": "nm1166911",
      "name": "Stefan Pejic",
      "character": "Tate"
    },
    {
      "id": "nm0813066",
      "name": "Cristian Solimeno",
      "character": "Shooting Range Instructor"
    },
    {
      "id": "nm2901051",
      "name": "Catarina Mira",
      "character": "Alvarez"
    },
    {
      "id": "nm0539414",
      "name": "Manuela Maletta",
      "character": "Glamourous Guide"
    },
    {
      "id": "nm1648200",
      "name": "Patrick Holland",
      "character": "Barman"
    },
    {
      "id": "nm6410424",
      "name": "Danny Flack",
      "character": "Stringy 2       (as Dan Flack)"
    },
    {
      "id": "nm1528648",
      "name": "Gerald Tyler",
      "character": "Stringy 3"
    },
    {
      "id": "nm0002243",
      "name": "Sam Douglas",
      "character": "Big Guy"
    },
    {
      "id": "nm3685723",
      "name": "Derek Siow",
      "character": "Jay Lee"
    },
    {
      "id": "nm1169321",
      "name": "François Pandolfo",
      "character": "Airport Lounge Barman"
    },
    {
      "id": "nm3021103",
      "name": "Bentley Kalu",
      "character": "Resort Armourer"
    },
    {
      "id": "nm0278755",
      "name": "Robert Firth",
      "character": "Kenneth Varantoom"
    },
    {
      "id": "nm0416857",
      "name": "Rebecca James",
      "character": "Dr. Bailey Hess"
    },
    {
      "id": "nm1694775",
      "name": "Avita Jay",
      "character": "Naina Ghosh"
    },
    {
      "id": "nm0481924",
      "name": "Richard Laing",
      "character": "Kyle Gibbs"
    },
    {
      "id": "nm2694952",
      "name": "Jonathan Sawdon",
      "character": "Simon Givens       (as Jonathon Sawdon)"
    },
    {
      "id": "nm9391067",
      "name": "Pino Maiello",
      "character": "Airport security"
    }
  ],
  "overview": "The ReZort, a post apocalyptic safari, offers paying guests the opportunity to kill zombies in the wake of an outbreak.",
  "storyline": "Following a near-apocalyptic zombie outbreak, humans are once again in control. If an occasional rogue zombie finds its way into everyday life, it is quickly disposed of by the authorities. In this day and age, people know how to handle \"Zee's\". The latest craze is the Zombie Safari - Zafari - a chance to go out and shoot the undead in the wild. The ultimate blood sport experience, and for many the ultimate therapeutic revenge following the losses suffered during the outbreak. Little do the vacationers realize they're actually in a highly controlled environment, where the zombies are always kept at a safe shooting distance. Nothing is left to chance, nothing is unplanned. So far.",
  "plot": "Septuagenarian best friends Fred Ballinger and Mick Boyle are on vacation in the Swiss Alps, staying at a luxury resort. Fred is a retired composer of classical music; at the hotel, he is approached by an emissary for Queen Elizabeth II to perform his popular piece \"Simple Songs\" at her husband Prince Philip's birthday concert. Fred turns down the offer, claiming he is not interested in performing any more – although he still composes pieces in his head when alone. Mick is a filmmaker, and is working with a group of writers to develop the screenplay for his latest film, which he calls his \"testament\". Also with them is actor Jimmy Tree, who is researching for an upcoming role and frustrated that he is only remembered for his role as a robot. The hotel is inhabited by other quirky individuals, including a young masseuse, an overweight Diego Maradona, and Miss Universe.\n\nFred and Mick reflect on their lives, admitting that their memories are fading and that they see little in their futures. Fred's daughter and assistant, Lena, is married to Mick's son, but the latter leaves her for pop star Paloma Faith. Lena stays at the resort and vents her anger at her father, who was always distant as she grew up. The emissary returns, and Lena cries as Fred explains that he won't perform \"Simple Songs\" because the soprano part belongs only to his wife and she can no longer sing.\n\nMick completes his screenplay and is satisfied with it. The main role is written for aging diva Brenda Morel, who has starred in eleven of his previous films. Brenda surprises Mick by arriving at the resort, and telling him that she is taking a television role instead; cinema is the past, she says, and Mick hasn't made a good film in years. Disheartened, Mick jumps off a balcony in front of Fred. Fred decides to visit his wife for the first time in years. She is senile, and living at a care home in Venice. He then returns to the UK to conduct \"Simple Songs\" in front of the Queen and Prince.\n\nInterspersed throughout the film are surreal sequences, including a levitating monk, an imagined Paloma Faith music video, Jimmy dressed as Adolf Hitler, Fred conducting a field of cowbells, and Mick envisioning all his previous leading ladies on a mountaintop (including Brenda, in her new unglamorous TV role).",
  "synopsis": null
}