{
  "imdb_id": "tt3957956",
  "tmdb_id": "351901",
  "douban_id": null,
  "title": "12 Rounds 3: Lockdown (2015)",
  "genres": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.4,
  "director": [
    {
      "id": "nm3893748",
      "name": "Stephen Reynolds"
    }
  ],
  "writer": [
    {
      "id": "nm2535285",
      "name": "Nathan Brookes",
      "description": null
    },
    {
      "id": "nm2546393",
      "name": "Bobby Lee Darby",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4358770",
      "name": "Jonathan Good",
      "character": "John Shaw       (as Dean Ambrose)"
    },
    {
      "id": "nm0003078",
      "name": "Roger Cross",
      "character": "Tyler Burke       (as Roger R. Cross)"
    },
    {
      "id": "nm1214436",
      "name": "Daniel Cudmore",
      "character": "Gideon"
    },
    {
      "id": "nm0613147",
      "name": "Lochlyn Munro",
      "character": "Darrow"
    },
    {
      "id": "nm0648153",
      "name": "Ty Olsson",
      "character": "Harris"
    },
    {
      "id": "nm1222371",
      "name": "Sarah Smyth",
      "character": "Officer Jenny Taylor"
    },
    {
      "id": "nm1503911",
      "name": "Rebecca Marshall",
      "character": "Captain Matthews"
    },
    {
      "id": "nm0607516",
      "name": "Kirby Morrow",
      "character": "Saul"
    },
    {
      "id": "nm7444222",
      "name": "Samuel Smith",
      "character": "Porter"
    },
    {
      "id": "nm1573094",
      "name": "Toby Levins",
      "character": "Meeks"
    },
    {
      "id": "nm1319578",
      "name": "James Michalopolous",
      "character": "Friels       (as James Michalopoulos)"
    },
    {
      "id": "nm3629916",
      "name": "Jaeson Lee",
      "character": "Robertson"
    },
    {
      "id": "nm0235596",
      "name": "Bill Dow",
      "character": "Keppler"
    },
    {
      "id": "nm0853175",
      "name": "Sharon Taylor",
      "character": "Carmen"
    },
    {
      "id": "nm2112348",
      "name": "Hugo Steele",
      "character": "Hurst"
    },
    {
      "id": "nm0365755",
      "name": "Matthew Harrison",
      "character": "George Freemont"
    },
    {
      "id": "nm3125251",
      "name": "Darren Dolynski",
      "character": "Security Guard"
    },
    {
      "id": "nm1340559",
      "name": "Gary Peterman",
      "character": "Evidence Cop"
    },
    {
      "id": "nm3082707",
      "name": "Avery Konrad",
      "character": "Girlfriend"
    },
    {
      "id": "nm5084903",
      "name": "Andrew Herr",
      "character": "Young Kid"
    },
    {
      "id": "nm3979210",
      "name": "Courtney Hojenski",
      "character": "Female Trainee"
    },
    {
      "id": "nm2784156",
      "name": "Jason Burkart",
      "character": "Morgue Attendee"
    },
    {
      "id": "nm2019420",
      "name": "Lee Tomaschefski",
      "character": "Hot Brunette       (as Leela Tömas)"
    },
    {
      "id": "nm7714880",
      "name": "Tony Skinner",
      "character": "Tom"
    }
  ],
  "overview": "Lockdown Follows a police officer who returns to duty after recovering from a gun shot wound to discover incriminating evidence of illegal activities against those closest to him. He quickly finds himself trapped inside his own precinct, hunted and in search of the truth, as the crooked cops stop at nothing to recover the evidence.",
  "storyline": "Lockdown Follows a police officer who returns to duty after recovering from a gun shot wound to discover incriminating evidence of illegal activities against those closest to him. He quickly finds himself trapped inside his own precinct, hunted and in search of the truth, as the crooked cops stop at nothing to recover the evidence.",
  "plot": "Detective Tyler Burke (Roger Cross) and his two men infiltrate the house of a drug dealer George Freemont, with whom he had been secretly collaborating to sell police-confiscated narcotics. They ask him for Freemont's proof of their collaboration. They destroy Freemont's laptop, and Burke shoots Freemont after making it look like Freemont shot first.\n\nDetective John Shaw (Dean Ambrose) returns to active duty at his precinct after the death of his partner, Ray Jones, in which Shaw was shot and sidelined with post traumatic stress disorder. He is met by his supervisor, Captain Matthews, recent police academy graduate Officer Jenny Taylor (Sarah Smyth) and lastly Detective Burke, who is being hailed for his 'bust' of Freemont.\n\nUnknown to Burke, Freemont had made a backup containing the incriminating evidence that is in the form of a flash drive in the shape of a credit card, which is found during Freemont's autopsy and delivered to Evidence by Taylor. Shaw reads the incident report of the Freemont bust and retrieves the flash drive from Evidence. At the same time, Burke, at his home, receives a call from Taylor regarding the flash drive. Burke deduces that the flash drive contains the evidence and quickly heads to the precinct. Discovering the content of the flash drive, Shaw heads to Matthews' office. Burke receives word from Officer Meeks, one of his corrupt colleagues, that Shaw had already checked out the flash drive, but misses Shaw though both men shared the same elevator. Burke is unable to intercept Shaw and triggers the fire alarm so that everyone (except he and his fellow corrupt cops) can evacuate the building and find Shaw easily. Once the building is evacuated, Officer Darrow (Lochlyn Munro) takes over security control to monitor Shaw's whereabouts via CCTV and also initiates a total lockdown of the building, disabling all the phone communication, computer networks as well as jamming cell phone signals. Shaw, unable to find Matthews at her office, had ducked into a stairwell to call her on his cell, but is cut off by the lockdown.\n\nShaw, knowing that he is now being hunted, ambushes Meeks but is surprised by Burke, Shaw uses Meeks as a shield, but Meeks is shot anyway by Burke. Shaw and Meeks duck into an elevator, but Meeks dies soon after. Burke radios Darrow to shut down the elevators, but Shaw manages to escape.\n\nShaw next runs into Taylor, who had been accidentally locked in. She sees Meeks' blood on Shaw and refuses to trust him, forcing him to draw his gun on her. He confiscated her taser and leaves her with a warning to hide until the lockdown is over. Matthews arrives and hails Burke over walkie talkie. Burke takes the opportunity to frame Shaw, directly blaming him for Meeks' death and assuring Matthews that he will handle Shaw. Shaw then goes into the motor pool where is spotted by Darrow on the camera. In the ensuring pursuit, Shaw is hit by the bullet to his arm while attempting to flee in an unmarked police car, but manages to elude his pursuers.\n\nTaylor next runs into Burke, who invites her to walk with him to the security control. Burke tells Shaw through the PA system to show himself in the CCTV camera or else he will shoot Taylor. Shaw reveals himself and after sending his men after Shaw, Burke shoots Taylor anyway and the gunshot is heard by Shaw.\n\nBurke and his fellow corrupt cops don SWAT armor and weaponry and went out to corner Shaw in a Crime Lab where Shaw had been bandaging his arm. Shaw is pinned down but managed to escape using Taylor's taser to stun a dead corrupt cop to fire an assault rifle that caused an explosion nearby on an experiment table, killing one corrupt cop but narrowly saved Burke and the others. The Police Chief arrives and takes charge of the situation from Matthews, informing Burke that there is a SWAT team inbound.\n\nShaw heads to the server room and disconnects several wires to disable the CCTV cameras. Shaw then reactivates the network in order to upload the evidence regarding Burke to Internal Affairs. Darrow notices that the network is activated and after alerting Burke, managed to deactivate the network before the evidence is sent. Shaw goes to the rooftop in order to get a signal and make a call to Matthews. Shaw convinces Matthews that he is the innocent and Burke is corrupt. He is interrupted by one of Burke's henchmen and after a brief fight succeeds in escaping again.\n\nShaw manages to ambush a lone Burke and cuffs him and both men enter an elevator. Burke secretly has its own key and manages to unlock the cuffs and after a struggle, Shaw is forced to escape but not after being shot in the hip. The SWAT Team arrived on scene to prepare for the raid. Shaw then goes to the office again to bandage his hip. Burke and 2 henchmen catch up with Shaw, who succeeds in escaping again. The Police Chief radios Burke that SWAT will enter once they cut the power.\n\nDarrow and Burke manage to ambush and capture Shaw, whom they bring to a meeting room. Burke succeeds in getting the flash drive from Shaw and promptly destroys it. Just as Burke is about to shoot Shaw, the power is cut and Shaw manages to use the distraction to escape.\n\nAfter a brief encounter with the SWAT Team, Shaw calls Matthews to meet him at the back of the building. They meet up, but only to reveal herself as working with Burke. Burke then shoots Matthews before the SWAT Team bursts inside. As Shaw is about to be arrested, he plays a recording of Burke's earlier monologue in which Burke incriminates himself. Burke attempts to shoot Shaw but Shaw fires his last round to Burke's leg. Shaw then cuffs Burke and walks out of the building.",
  "synopsis": "Detective Burke and his two men infiltrate the house of a drug dealer George Freemont to ask where the evidence is containing Burke is distributing narcotics. One of the men shoots Freemont's laptop that contains evidence. While the men searching for back-up evidence, Burke shoots Freemont, killing him.Detective John Shaw returns to active duty at his precinct after the death of his partner, Ray Jones. Some of his employees are now looking at him as he comes back to the office. Then the employees make a round of applause to Burke as he enters in the office, and makes a brief remark of George Freemont is no longer a threat. Later, Shaw and Burke practice shooting a gun.The flash drive, disguised as a credit card, contains the same evidence was retrieved during Freemont's autopsy. The flash drive was surrendered to the evidence cop. Shaw reads the incident report claiming that Freemont open fire at Burke and his men. The incident report that he reads are all lies. Shaw learns that the flash drive might contain the related incident; he goes to the evidence cop to retrieve it. At the same time, Burke, at his home, receives a call from someone saying that the evidence of George arrived and quickly heads to the precinct. Burke summons his men to meet at the precinct. After looking the evidence, Shaw heads to Captain Matthews office regarding the evidence. While waiting the elevator to open, Burke and his two men approaches to Shaw. After they got into the elevator, Shaw accidentally drops the flash drive to floor and one of Burke's men picks the flash drive and give it back to him which is unknown to him that he pick the evidence. As Shaw gets out from the elevator, Burke receives a call from his crew that Shaw has got the evidence, so they quickly finds Shaw in order to retrieve the evidence. After Shaw found that Matthews is not in the office, he realizes that he is being hunted by Burke and his men. Burke then press the fire alarm so that the employees can evacuate the building in order to find Shaw easily. Once the building is evacuated, Darrow takes over security control to monitor Shaw's whereabouts and he initiates the total lockdown and disables all the phone communication and networks. Shaw has only 12 rounds left in his gun and makes good use of it.All of the people have now evacuated except the Officer Taylor, newly graduated from the academy, has being locked inside despite she is using the card key. Shaw sees Officer Meeks, worked on Burke to find Shaw, then held hostage as Burke appears. Seeing this opportunity, Burke shoots Meeks and Shaw drags his body into the elevator. All throughout, Burke frames Shaw for a homicide he didn't commit. With Shaw is still on the elevator, Burke radios Darrow to shut the elevator, but he managed to escape before they find him.Shaw goes to the locker room but the henchman confronts him and the two have fight. Shaw ultimately kills the henchman by pounding the head with the barbell weight. Then, Shaw meets Taylor and he told her to hide, not telling Taylor what's going on inside the building. Shaw goes to the parking lot which is Darrow alerts the men for his presence. Shaw goes for hide beside the car but as the henchman moving behind him, he fires two rounds at him. After the henchmen fires at Shaw, he makes an escape by driving while finding an exit. Shaw is hit by the bullet to his arm. The henchmen continue firing at the car but they find out that Shaw went to the nearest entrance.Burke sees Taylor and invited her to walk with him to the security control. Burke then speaks through the PA system with Taylor, asking her brief questions, and then he tells Shaw to show himself at the CCTV camera where he can see any in the monitors in five seconds or else he will going to shoot Taylor. Shaw shows himself to the camera and then he alerts his men that he is on the first floor. Burke then shoots Taylor anyway and the gunshot is heard by Shaw.After he outran the henchmen, he goes to the office to put the bandage in the wounded arms. Shaw tries to escape as Burke and his henchmen see him. The henchmen now surround him, but he gives a chance to escape by firing a Taser to the man he killed; enable the handed gun to fire at Burke and his men. Shaw heads to the server room and messes the wires to disable the CCTV cameras. Shaw then reactivates the network in order to upload the evidence regarding Burke to the police department. However, Darrow notices that the network is activated and he struggles to deactivate it. Unfortunately for Shaw that Darrow successfully deactivated the network just moments before it finishes the upload. Frustrated by this, Shaw goes to the rooftop in order to get the signal and make call to Matthews. Shaw convinces Matthews that he is the innocent and Burke is corrupt at all. The henchman found him and after some fight, Shaw pinned out the grenade, blowing him.Shaw then sees Burke and put a cuff on him. After they got into the elevator, Burke secretly has its own key and manages to unlock the cuff, and tries to subdue Shaw. He goes out of the elevator with Burke still inside. The three henchmen fires at Shaw, hitting the bullet on his hip. Shaw then goes to the office to put some bandage in the wounded hip. After that, Shaw aims his gun to the henchwoman but she tries to subdue him until he fatally shoots her. After Shaw manages to kill another henchman, by stabbing his neck with the knife, Darrow and Burke capture him.Both held Shaw capture inside the room and ask him where the evidence is. As Shaw hands it over to Burke, he quickly destroys that. Burke then manages to incapacitate Shaw but as the SWAT Team cuts the power, Shaw gives an opportunity to kill Darrow and try to fight between the two.After being encountered with the SWAT Team, Shaw calls Matthews to meet her at the back of the building. Finally, Matthews make it to meet him, but only to reveal herself that he is working with Burke. He then shoots Matthews to make even think that Shaw kill her. After a several minutes of confronting Shaw, the SWAT Team burst inside and he assumes to them that Shaw kill her. Before Shaw is about to be arrested, he plays a recording of Burkes confession to them. Burke attempt to shoot Shaw but he fires the last round to his leg. Shaw cuffs his hand and walks out to the building."
}