{
  "imdb_id": "tt3951298",
  "tmdb_id": "377206",
  "douban_id": null,
  "title": "Army Dog (2016)",
  "genres": [
    "Action"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm3179964",
      "name": "Ezra Kemp"
    }
  ],
  "writer": [
    {
      "id": "nm0364963",
      "name": "Kirk Harris",
      "description": null
    },
    {
      "id": "nm1119091",
      "name": "Vernon E. Mortensen",
      "description": null
    },
    {
      "id": "nm6828079",
      "name": "Adrienne Thorne",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0000680",
      "name": "Casper Van Dien",
      "character": "Tom Holloway"
    },
    {
      "id": "nm1836948",
      "name": "Grace Van Dien",
      "character": "Tara Holloway"
    },
    {
      "id": "nm0767445",
      "name": "Stelio Savante",
      "character": "Sheriff Bill"
    },
    {
      "id": "nm2338912",
      "name": "Annemarie Pazmino",
      "character": "Laurie Holloway"
    },
    {
      "id": "nm7853425",
      "name": "Talya Azizi",
      "character": "Afghan Girl"
    },
    {
      "id": "nm1783289",
      "name": "Matt Bradford",
      "character": "Coach Jerry Bronson"
    },
    {
      "id": "nm10515938",
      "name": "Trisha Golamb",
      "character": "Afghan villager"
    },
    {
      "id": "nm10515936",
      "name": "Alvinita Gonzales",
      "character": "Soccer fan"
    },
    {
      "id": "nm10515937",
      "name": "Daniel Gonzales",
      "character": "Soccer Fan"
    },
    {
      "id": "nm1434186",
      "name": "Michael King",
      "character": "Captain Harris"
    },
    {
      "id": "nm8209147",
      "name": "George Pens",
      "character": "Green Beret"
    },
    {
      "id": "nm10515935",
      "name": "Izaac Rudd Jr.",
      "character": "Afghan villager"
    },
    {
      "id": "nm10515934",
      "name": "Carrie Gomez Rudd",
      "character": "Afghan villager"
    },
    {
      "id": "nm6903325",
      "name": "Dominic Rudd",
      "character": "Afghan villager"
    },
    {
      "id": "nm4025484",
      "name": "Craig R Sawyer",
      "character": "Master Sergeant Johnny Slade"
    }
  ],
  "overview": "A brave Army dog returns to the U.S., where he helps his heroic handler bond with his resentful daughter on a camping trip despite danger lurking around every corner.",
  "storyline": "Casper van Dien plays Army Sargent Tom Holloway. His partner and best friend is his bomb sniffing dog Conner. They go through a lot together so when Tom is ready to retire he returns home to his family with Conner in tow. Unfortunately his daughter Tara, played by Casper's real life daughter Grace, isn't all that pleased to have a new family member. She really missed her dad for all those years he was away and she naturally wants him all to herself now. Seeing him spending his time with Conner instead fills her with jealousy. Tom can see the anxiety his daughter is experiencing so he decides to take her and Conner on a camping trip to help them bond closer together and possibly even learn a little about teamwork. Unfortunately once in the mountains an unexpected occurrence leads to a danger filled adventure that tests the three campers.",
  "plot": "A couple is camping in the Scottish Highlands. The woman gives the man a silver letter opener as a present; shortly afterwards they are killed in their tent by an unseen assailant. Meanwhile, Private Cooper is seen running through a forest in North Wales. He attacks his pursuers but is overwhelmed and wrestled to the ground. It turns out Cooper is trying to join a special forces unit but fails when he refuses to shoot a dog in cold blood. He is returned to his unit by Captain Richard Ryan.\n\nFour weeks later a squad of six regular British Army soldiers, including Cooper, is dropped into the Scottish Highlands, somewhat fed up about missing an England–Germany World Cup match. Expecting to carry out a training mission against a Special Air Service (SAS) unit, they only find their savaged remains. A badly-wounded Captain Ryan, the only survivor, makes cryptic references to what attacked them. Unseen predators attack the troops. While retreating, Bruce is impaled on a tree branch, killing him, and Sergeant Wells is attacked. He is rescued by Cooper and carried to a rural roadside where the group encounters Megan, a zoologist who takes them to a lonely house, belonging to an unknown family. The soldiers who remain are Wells, Cooper, Spoon, Joe and Terry. As dark falls, the house is surrounded by the attackers: to the soldiers' incredulity, these are revealed to be werewolves.\n\nThey go to get in the Land Rover but it has been destroyed by the werewolves. The soldiers maintain a desperate defence against the werewolves, believing that if they can make it to sunrise, the werewolves will revert to human form. Cooper and Megan then treat Wells' wounds. After Terry is abducted and ammunition runs short, they realise that they will not last and decide to try to escape. Spoon creates a diversion while Joe steals a Land Rover from the garage. When he gets in, he sees Terry in the garage being eaten alive by a werewolf, which rips off Terry's head and throws it at the windscreen. Joe drives up to the house door, then realizes that a werewolf was hiding in the back seat and goes down fighting.\n\nUnder interrogation, Ryan then reveals that the government had sent him on a mission to capture a live werewolf so that it can be studied and exploited as a weapon; Cooper's squad was the bait. An enraged Wells and Cooper attempt to kill Ryan, but he transforms into a werewolf due to his wounds and escapes out a window, running off into the forest. It is then revealed that the unknown family of the house are the werewolves.\n\nThe soldiers try blowing up the barn - where Megan tells them the werewolves must be hiding - with petrol, gas canisters, matches and the Land Rover. Once it has been destroyed, Megan reveals that not only were there no werewolves in the barn but she had persuaded them to destroy their only means of transport; she is a werewolf as well and had been suppressing the metamorphosis but now gives in. She also reveals that she unlocked the back door to the house, allowing the werewolves inside.\n\nBefore she fully transforms, Wells runs into the room just in time and kills her with a gunshot to the head. He and Cooper run upstairs and Spoon runs to the kitchen, blocking the door. A werewolf breaks in and Spoon runs out of ammo. He fights the werewolf and using nearby surroundings to his advantage, he gains the upper hand, but is then killed when a second werewolf intervenes.\n\nWells and Cooper shoot through the floor upstairs to elude the werewolves, dropping into the kitchen, where they find Spoon's remains. Wells orders Cooper to take shelter in the cellar as he begins to transform into a werewolf, giving him a roll of photographic film (which was in a flashgun camera used to stun the werewolves) to prove what has happened. The werewolves break into the kitchen and confront Wells as he cuts a gas line and blows up the house, killing himself and the werewolves.\n\nAs the sun rises, Cooper attempts to leave but Ryan, who also took shelter in the cellar, confronts him. After a brutal fight, Cooper stabs Ryan in the chest with the silver letter opener, weakening him enough to allow Cooper to shoot him in the head, killing him. Cooper and Megan's dog, Sam, emerge from the cellar and walk off into the woods.",
  "synopsis": null
}