{
  "imdb_id": "tt3921362",
  "tmdb_id": "358975",
  "douban_id": null,
  "title": "Fire Birds (2015)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "Israel",
  "version": [
    {
      "runtime": "107 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm3402398",
      "name": "Amir Wolf"
    }
  ],
  "writer": [
    {
      "id": "nm7199921",
      "name": "Orly Robenshtein Katcap",
      "description": null
    },
    {
      "id": "nm3402398",
      "name": "Amir Wolf",
      "description": null
    },
    {
      "id": "nm3697901",
      "name": "Itzhak Wolf",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0021734",
      "name": "Gila Almagor",
      "character": "Olga"
    },
    {
      "id": "nm9104338",
      "name": "Roni Dotan",
      "character": ""
    },
    {
      "id": "nm0381812",
      "name": "Rami Heuberger",
      "character": "Tatoo Man"
    },
    {
      "id": "nm0444289",
      "name": "Dvora Kedar",
      "character": "Ms Halperin       (as Dvora Keidar)"
    },
    {
      "id": "nm1363885",
      "name": "Mali Levi",
      "character": "Irit"
    },
    {
      "id": "nm0741903",
      "name": "Aliza Rosen",
      "character": "Ms Tamanski       (as Alisa Rozen)"
    },
    {
      "id": "nm5489794",
      "name": "Nadia Rova",
      "character": "Nicole"
    },
    {
      "id": "nm0855267",
      "name": "Oded Teomi",
      "character": "Amikam"
    },
    {
      "id": "nm0899042",
      "name": "Sarit Vino-Elad",
      "character": "Daniela bardugo"
    },
    {
      "id": "nm0901406",
      "name": "Amnon Wolf",
      "character": "Amnon"
    },
    {
      "id": "nm1311794",
      "name": "Miryam Zohar",
      "character": "Zisy Glik       (as Miriam Zohar)"
    }
  ],
  "overview": "An eighty-year-old man's body is found with three stab wounds to the chest and a number tattooed along his forearm. Amnon, a police detective and second generation Holocaust survivor, is reluctantly assigned to the case. As the plot weaves between the past and present, their stories unfold.",
  "storyline": "An eighty-year-old man's body is found with three stab wounds to the chest and a number tattooed along his forearm. Amnon, a police detective and second generation Holocaust survivor, is reluctantly assigned to the case. As the plot weaves between the past and present, their stories unfold.",
  "plot": "A joint task force operation between the Drug Enforcement Administration and the U.S. Army has been formed to dismantle one of the largest drug cartels operating in South America. Multiple attempts to assault the cartel's mountainous compound have been thwarted by a (fictional) Scorpion-attack helicopter piloted by a mercenary pilot, Eric Stoller (Bert Rhine). After having several aircraft shot down, most notably a pair of UH–60 Black Hawks and their AH–1 Cobra escorts, the army turns to the new AH–64 Apache attack helicopter, which can match its enemies' maneuverability and firepower.\n\nPilot Jake Preston (Nicolas Cage) is subsequently enlisted in the Apache air-to-air combat training program. Earlier, Preston was the sole survivor of a previous air-attack by Stoller. Upon his arrival at the training course, he encounters his ex-girlfriend Billie Lee Guthrie (Sean Young), who broke off their relationship to pursue a separate career flying OH–58 Kiowa scout helicopters which often work alongside the Apache as target identifiers and designators. Jake's arrogance and loose improvised style quickly earn him the mixed respect and chagrin of veteran pilot and flight instructor Brad Little (Tommy Lee Jones). During the training schedule, Preston is revealed to be suffering from an eye dominance disability, which makes it difficult for him to utilize the Apache's visual input. Using an unconventional but effective training method, Little helps Preston deal with his handicap.\n\nA formation of military aircraft consisting of four Apaches and Guthrie's Kiowa, flies down to South America to provide air support for a DEA mission to hunt down and arrest drug cartel leaders. However, they are soon attacked at their base camp, and one Apache is destroyed. With another Apache left to protect the DEA personnel, Preston, Little and Guthrie attempt to seek out Stoller. They soon locate his position, as well as a pair of Draken jet fighter aircraft who are also protecting the cartel. Little destroys one aircraft, but is shot down in aerial combat by Stoller. He survives, but his Apache is disabled. Stoller later targets Guthrie, but Preston reaches their coordinates and engages him in a fierce dogfight. Using the Apache's maneuverability near a mountainous peak, Preston manages to trick Stoller into flying past him; then attacks and destroys his helicopter. Meanwhile, Guthrie uses one of the Stinger missiles onboard Little's downed Apache to destroy the remaining enemy aircraft. With no air support, the cartel's defenses cease, and their leaders are later apprehended. As an injured Little is loaded onto a Medevac helicopter, he expresses pride in both Preston and Guthrie.",
  "synopsis": null
}