{
  "imdb_id": "tt3949586",
  "tmdb_id": "296244",
  "douban_id": null,
  "title": "Plague (2015)",
  "genres": [
    "Drama",
    "Horror",
    "Sci-Fi"
  ],
  "country": "Australia",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm4222005",
      "name": "Nick Kozakis"
    },
    {
      "id": "nm3703974",
      "name": "Kosta Ouzas"
    }
  ],
  "writer": [
    {
      "id": "nm3703974",
      "name": "Kosta Ouzas",
      "description": "writer as Kostas Ouzas"
    }
  ],
  "cast": [
    {
      "id": "nm0108725",
      "name": "Don Bridges",
      "character": "Gary"
    },
    {
      "id": "nm6537852",
      "name": "Cris Cochrane",
      "character": "Plagued Person"
    },
    {
      "id": "nm2798882",
      "name": "Tegan Crowley",
      "character": "Evie"
    },
    {
      "id": "nm3714816",
      "name": "Liza Dennis",
      "character": "Marge"
    },
    {
      "id": "nm6695253",
      "name": "Steven Jianai",
      "character": "Charlie"
    },
    {
      "id": "nm6520962",
      "name": "Rosa Leonardi",
      "character": "Plagued person"
    },
    {
      "id": "nm3576834",
      "name": "Scott Marcus",
      "character": "John"
    },
    {
      "id": "nm3718331",
      "name": "Sarah Ranken",
      "character": "Sam"
    },
    {
      "id": "nm4430268",
      "name": "Benjamin Rigby",
      "character": "Corporal Davies"
    },
    {
      "id": "nm1025341",
      "name": "Nicholas Stribakos",
      "character": "Bob"
    }
  ],
  "overview": "An independent Australian horror/drama that explores the societal norms that break down among a small group of survivors in a post-apocalyptic world. Ravenous hordes of infected zombies terrorize the survivors, but it is the horror within their own sanctuary that they must fear the most.",
  "storyline": "A small group of survivors in post-apocalyptic Australia seek shelter from an infection that has spread like a plague among the human populace. Evie (Tegan Crowley) and her fellow survivors become separated from her husband John (Scott Marcus). Evie refuses to leave John behind against the wishes of the group. The survivors revolt and abandon Evie to an uncertain fate. With the unexpected arrival of Charlie (Steven Kennedy) what appears to be an opportunity at a new beginning quickly turns to horror as menacing as the infected that pursue them.",
  "plot": "In 1983, simultaneously one day all of the world's children under the age of nine fall into a catatonic state. For the next ten years, every child who is born, is born in a state of catatonia. During this state, the children experience seizures twice a day and seem to develop superhuman strength. By 1993, all the children wake up, hellbent on killing all adults. Things get even worse when the adults realize the children have a sort of collective brain—what one learns, they all learn. The children get smarter by the hour, first they dismantle the engines in almost every car and set up road blocks to stop the adults from escaping. Then they learn how to use firearms. The children also take the souls of the ones they kill as a part of deliverance. The adults must find a way to stop them before it's too late.",
  "synopsis": null
}