{
  "imdb_id": "tt3983674",
  "tmdb_id": "224972",
  "douban_id": null,
  "title": "The Mask You Live In (2015)",
  "genres": [
    "Documentary",
    "News"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.7,
  "director": [
    {
      "id": "nm1308076",
      "name": "Jennifer Siebel Newsom"
    }
  ],
  "writer": [
    {
      "id": "nm1256818",
      "name": "Jessica Congdon",
      "description": "writer"
    },
    {
      "id": "nm1308076",
      "name": "Jennifer Siebel Newsom",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm7979632",
      "name": "Joe Herman",
      "character": "Himself - Coach and Former NLF Player"
    },
    {
      "id": "nm2426691",
      "name": "Michael Kimmel",
      "character": "Himself - Sociologist and Educator       (as Dr. Michael Kimmel)"
    },
    {
      "id": "nm2985111",
      "name": "Caroline Heldman",
      "character": "Herself - Political Scientist and Educator       (as Dr. Caroline Heldman)"
    },
    {
      "id": "nm5608059",
      "name": "Tony Porter",
      "character": "Himself - Educator and Activist"
    },
    {
      "id": "nm8698856",
      "name": "Roman Sarlo",
      "character": "Himself"
    },
    {
      "id": "nm8698857",
      "name": "Mike Nelson",
      "character": "Himself"
    },
    {
      "id": "nm8698858",
      "name": "Cleo Cloman",
      "character": "Himself"
    },
    {
      "id": "nm8698859",
      "name": "Borey Ai",
      "character": "Himself"
    },
    {
      "id": "nm8698860",
      "name": "Nghiep Lam",
      "character": "Himself"
    },
    {
      "id": "nm7660216",
      "name": "Curtis Carroll",
      "character": "Himself"
    },
    {
      "id": "nm8698861",
      "name": "Tommy Winfrey",
      "character": "Himself"
    },
    {
      "id": "nm3429342",
      "name": "Ian Breckenridge-Jackson",
      "character": "Himself"
    },
    {
      "id": "nm0254536",
      "name": "Lisa Elliott",
      "character": "Herself - Neuroscientist       (as Dr. Lise Eliot)"
    },
    {
      "id": "nm8698862",
      "name": "Michael G. Thompson",
      "character": "Himself - Psychologist       (as Dr. Michael G. Thompson)"
    },
    {
      "id": "nm0121811",
      "name": "Nadine Burke",
      "character": "Herself - Pediatrician       (as Dr. Nadine Burke-Harris)"
    },
    {
      "id": "nm2789233",
      "name": "William Pollack",
      "character": "Himself - Psychologist and Educator       (as Dr. William Pollack)"
    },
    {
      "id": "nm2802444",
      "name": "Carol Gilligan",
      "character": "Herself - Psychologist and Educator       (as Dr. Carol Gilligan)"
    },
    {
      "id": "nm8698863",
      "name": "Steven Mason",
      "character": "Himself"
    },
    {
      "id": "nm8698864",
      "name": "Cody Owsley",
      "character": "Himself"
    },
    {
      "id": "nm3176082",
      "name": "Madeline Levine",
      "character": "Herself - Psychologist       (as Dr. Madeline Levine)"
    },
    {
      "id": "nm8698865",
      "name": "Judy Y. Chu",
      "character": "Herself - Psychologist and Educator       (as Dr. Judy Y. Chu)"
    },
    {
      "id": "nm8698866",
      "name": "Gabriella Sarlo",
      "character": "Herself"
    },
    {
      "id": "nm8698867",
      "name": "Terry A. Kupers",
      "character": "Himself - Medical Doctor"
    },
    {
      "id": "nm8698868",
      "name": "Molly Yim",
      "character": "Herself"
    },
    {
      "id": "nm8698869",
      "name": "Niobe Way",
      "character": "Herself - Psychologist and Educator       (as Dr. Niobe Way)"
    },
    {
      "id": "nm8150003",
      "name": "Luis Vallejo",
      "character": "Himself"
    },
    {
      "id": "nm8698870",
      "name": "Ana Montes",
      "character": "Herself"
    },
    {
      "id": "nm8698871",
      "name": "Pedro Noguera",
      "character": "Himself - Sociologist and Educator       (as Dr. Pedro Noguera)"
    },
    {
      "id": "nm6590991",
      "name": "Kevin Grant",
      "character": "Himself - Youth Advocate and Community Activist"
    },
    {
      "id": "nm2830060",
      "name": "Joseph Marshall",
      "character": "Himself - Educator and Youth Advocate       (as Dr. Joseph Marshall)"
    },
    {
      "id": "nm8698872",
      "name": "Ashanti Branch",
      "character": "Himself - Educator and Youth Advocate"
    },
    {
      "id": "nm5936931",
      "name": "Don Dianda",
      "character": "Himself"
    },
    {
      "id": "nm1674354",
      "name": "Philip Zimbardo",
      "character": "Himself - Psychologist and Educator       (as Dr. Philip Zimbardo)"
    },
    {
      "id": "nm2109520",
      "name": "Byron Hurt",
      "character": "Himself - Filmmaker"
    },
    {
      "id": "nm3950075",
      "name": "Ashly Burch",
      "character": "Herself - Actress and Writer"
    },
    {
      "id": "nm3457202",
      "name": "Jim Steyer",
      "character": "Himself - Educator and Youth Advocate"
    },
    {
      "id": "nm1204972",
      "name": "Jackson Katz",
      "character": "Himself - Educator and Advocate       (as Dr. Jackson Katz)"
    },
    {
      "id": "nm8698873",
      "name": "James Gilligan",
      "character": "Himself - Psychiatrist and Educator       (as Dr. James Gilligan)"
    },
    {
      "id": "nm8698874",
      "name": "Carlos Hagedorn",
      "character": "Himself"
    },
    {
      "id": "nm8698875",
      "name": "David Brickley",
      "character": "Himself       (archive footage)"
    }
  ],
  "overview": "Compared to girls, research shows that boys in the U.S. are more likely to be diagnosed with a behavior disorder, prescribed stimulant medications, fail out of school, binge drink, commit a violent crime, and/or take their own lives.  Jennifer Siebel Newsom's new documentary film, The Mask You Live In, asks: As a society, how are we failing our boys?",
  "storyline": "Explores how our culture's narrow definition of masculinity is harming our boys, men and society at large and unveils what we can do about it.",
  "plot": "Stanley Ipkiss is a shy and unlucky bank clerk working at the local Edge City bank. He is frequently ridiculed by everyone around him, except for his Jack Russell Terrier Milo, and his co-worker and best friend Charlie Schumaker. Meanwhile, gangster Dorian Tyrell, owner of the Coco Bongo nightclub, plots to overthrow his boss Niko. One day, Tyrell sends his singer girlfriend Tina Carlyle into Stanley's bank to record its layout, in preparation to rob the bank.\n\nStanley is attracted to Tina, and she seems to reciprocate. After being denied entrance to the Coco Bongo, he finds a wooden mask near the city's harbor. Placing it on his face transforms him into a zoot-suited, green-faced, bizarre, wise-cracking trickster known as the Mask, who is able to cartoonishly alter himself and his surroundings at will. Stanley scares off a street gang that attempts to rob him by turning a balloon into a Tommy gun, and then he exacts revenge on his tormentors; he scares his grouchy landlady, and injures the con-artist repairmen who did unnecessary work on his car and charged him for it.\n\nThe next morning, Stanley encounters detective Lieutenant Kellaway and newspaper reporter Peggy Brandt investigating the Mask's activity of the previous night. To attend Tina's performance, he again becomes the Mask to raid the bank, inadvertently foiling Tyrell's plan in the process. At the Coco Bongo, Stanley dances exuberantly with Tina, whom he ends up kissing. Following a confrontation with Tyrell for disrupting the bank robbery, Stanley flees leaving behind a scrap of cloth from his suit that transforms back into his pajamas, while Tyrell is arrested by the police as a suspect for the bank robbery.\n\nBased on the shred of cloth, Kellaway suspects Stanley to be the bank robber; he believes that \"there can't be two idiots with those kind of pajamas.\" Stanley later consults a psychiatrist who has recently published a book on masks, and is told that the object may be a depiction of Loki, the Norse god of darkness and mischief. The same night, Stanley transforms into the Mask and meets Tina at a local park, but the meeting is interrupted by Kellaway, who attempts to arrest him. Stanley tricks a large group of police officers into joining him in a mass-performance of the Desi Arnaz song \"Cuban Pete\", takes off the mask and flees with Peggy, but she betrays him to Tyrell for a $50,000 bounty. Tyrell tries on the mask and becomes a malevolent green-faced monster. Forced to reveal the location of the stolen money, Stanley is kept hostage in one of the mob's cars while Tyrell's henchmen search his apartment. With the money now in the hands of Tyrell's gang, Stanley is then delivered to Kellaway, along with a rubber green mask, where he is arrested.\n\nWhen Tina visits Stanley in his cell, he urges her to flee the city. Tina thanks Stanley for treating her \"like a person, and not some kind of party favor\" and tells him that she knew that he was the Mask all along. She attempts to leave the city, but is captured by Tyrell's men and forcibly taken to a charity ball at the Coco Bongo hosted by Niko and attended by the city's elite, including Mayor Tilton. Upon arrival, the masked Tyrell kills Niko and prepares to destroy both the club and Tina with dynamite. Milo helps Stanley escape from his cell, and Stanley brings Kellaway as a cover and hostage in a desperate attempt to stop Tyrell.\n\nAfter locking Kellaway in his car, Stanley enters the club and manages to enlist the help of Charlie, but is soon after spotted and captured. Tina tricks Tyrell into taking off the mask, which is recovered and donned by Milo, turning the dog into a cartoonish pitbull who wreaks havoc among Tyrell's men, while Stanley fights Tyrell himself. After recovering the mask, Stanley uses its special powers to save Tina by swallowing Tyrell's bomb and flushing Tyrell down the drain of the club's ornamental fountain. The police arrive and arrest Tyrell's remaining henchmen, while Kellaway attempts to arrest Stanley once again. Mayor Tilton comes over and tells Kellaway, Doyle and the police to free Stanley, concluding after witnessing Stanley's heroism that Tyrell was the original Mask. Tilton sets up a meeting with Kellaway in his office in the morning and all charges against Stanley are dropped. As the sun rises the following day, Stanley, Tina, Milo and Charlie take the mask back down to the harbor. Tina throws the mask into the water, and she and Stanley kiss. Charlie then jumps in the water to retrieve the mask for himself, only to find Milo swimming away with it. The film ends with Stanley kissing Tina, quoting the Mask's catchphrase: \"SssssMOKIN'!!!\"",
  "synopsis": null
}