{
  "imdb_id": "tt3900206",
  "tmdb_id": "260313",
  "douban_id": null,
  "title": "Flowers (2014)",
  "genres": [
    "Drama"
  ],
  "country": "Spain",
  "version": [
    {
      "runtime": "99 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm1531686",
      "name": "Jon Garaño"
    },
    {
      "id": "nm1305002",
      "name": "Jose Mari Goenaga"
    }
  ],
  "writer": [
    {
      "id": "nm1534594",
      "name": "Aitor Arregi",
      "description": null
    },
    {
      "id": "nm1531686",
      "name": "Jon Garaño",
      "description": null
    },
    {
      "id": "nm1305002",
      "name": "Jose Mari Goenaga",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1523587",
      "name": "Itziar Ituño",
      "character": "Lourdes"
    },
    {
      "id": "nm1084844",
      "name": "Nagore Aranburu",
      "character": "Ane"
    },
    {
      "id": "nm1424220",
      "name": "Itziar Aizpuru",
      "character": "Tere"
    },
    {
      "id": "nm1322246",
      "name": "Josean Bengoetxea",
      "character": "Beñat"
    },
    {
      "id": "nm1716930",
      "name": "Egoitz Lasa",
      "character": "Ander"
    },
    {
      "id": "nm0299937",
      "name": "Ane Gabarain",
      "character": "Jaione"
    },
    {
      "id": "nm0815115",
      "name": "José Ramón Soroiz",
      "character": "Txema"
    },
    {
      "id": "nm0073295",
      "name": "Jox Berasategui",
      "character": "Jexus"
    },
    {
      "id": "nm0489677",
      "name": "Mikel Laskurain",
      "character": "Esteban"
    },
    {
      "id": "nm3802600",
      "name": "Mariasun Pagoaga",
      "character": "Inaxi"
    },
    {
      "id": "nm7285918",
      "name": "Roel Vermeulen",
      "character": "Bill"
    },
    {
      "id": "nm0037138",
      "name": "Anabel Arraiza",
      "character": "Miren"
    },
    {
      "id": "nm4792691",
      "name": "Kepa Errasti",
      "character": "Ginekologoa"
    },
    {
      "id": "nm7285919",
      "name": "Koldo Martínez",
      "character": "Gorpu donazioen arduraduna"
    },
    {
      "id": "nm1475750",
      "name": "Leire Ucha",
      "character": "Loredendako saltzailea 1"
    },
    {
      "id": "nm1656108",
      "name": "Itziar Urretabizkaia",
      "character": "Loredendako saltzailea 2"
    },
    {
      "id": "nm1699228",
      "name": "Gorka Zubeldia",
      "character": "Garabilaria"
    },
    {
      "id": "nm7285920",
      "name": "Aitor Odriozola",
      "character": "Mikel (6 urte)"
    },
    {
      "id": "nm7285921",
      "name": "Unax Odriozola",
      "character": "Mikel (9 urte)"
    },
    {
      "id": "nm2014242",
      "name": "Jorge Gil Munarriz",
      "character": "Lore banatzailea 1"
    },
    {
      "id": "nm2120014",
      "name": "Gotzon Sanchez",
      "character": "Lore banatzailea 2"
    },
    {
      "id": "nm7285922",
      "name": "Jon Elizegi",
      "character": "Hozkallu teknikaria"
    },
    {
      "id": "nm2707929",
      "name": "Fernando Ruiz",
      "character": "Ertzainaren ahotsa"
    },
    {
      "id": "nm7285923",
      "name": "Iñaki Gabarain",
      "character": "Irakaslearen ahotsa"
    }
  ],
  "overview": "Ane is in her mid-forties and delighted when a stunning bouquet of flowers is delivered to her home. But the site manager has no idea who to thank – one thing is for sure; her jealous husband, Ander, is not the unknown cavalier. As these gallantries increase, always on a Thursday and always with an anonymous sender, Ane’s life takes on a new direction. The life of Lourdes is also sent into turmoil by beautiful bouquets of flowers: Since the death of her husband in a traffic accident, flowers have been deposited regularly at the scene. Lourdes’ mother-in-law, Tere, is determined to get to the bottom of the anonymous flowers. Jon Garaño and José Mari Goenaga’s feature film debut pays charming homage to three headstrong women and the power of flowers.",
  "storyline": "Ane's life turns around when, week after week, she receives a bunch of flowers at home. Always at the same time and always without a senders note.",
  "plot": "This section's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (May 2014) (Learn how and when to remove this template message)\nIn the late 1950s, the Dollanganger family—14-year-old Chris, 12-year-old Cathy, 4-year-old twins Carrie and Cory and their parents Christopher and Corrine—live happily together in Pennsylvania. Corrine works as a homemaker and their father in a sales department. When he is promoted to Vice President, Cathy worries that he'll be home less, but he gives her a promise ring with the assurance he will always love her. Their happy life changes on their father's birthday when a police officer informs them that Christopher died in a car crash, leaving the family devastated and heavily in debt. Four months later, Corrine announces they are going to go live with her wealthy parents in Virginia. Confused since having been told they had no living relatives, Corrine explains that she is estranged from her parents and changed her last name to conceal her true identity, which is Foxworth.\n\nCorrine's grim and cold-hearted mother, Olivia, takes the children to a small room in the attic of Foxworth Hall. Corrine tells them that her father had disowned her for something she did when she was 18, and that she plans to introduce them to him once she wins back his love. The next day, the children are given a list of rules and Olivia tells them to remain in the attic. When Corrine returns, she has been horse-whipped at her father's command as punishment for her marriage to Christopher. Corrine confesses that Christopher was actually her half-uncle; her father's younger half-brother, and they were disinherited after eloping. Corrine promises the children she will convince her father to forgive her, introduce them to him, and they will all live wealthy, happy lives.\n\nAt first visiting as often as she can, Corrine's visits become less frequent as she begins to enjoy her new-found wealthy life and starts a relationship with her father's attorney, Bart Winslow. Corrine later informs them that while her father has forgiven her, she can't let them meet him because she claimed that she didn't have any children with their father; thus, they will have to remain in the attic until he dies. At Christmas, Corrine lavishes expensive gifts on the children in compensation for hiding them. After learning of a big Christmas party, Cathy and Chris beg to attend and Corrine allows them to hide in a space above the staircase with a view to the party. They see their grandfather, Malcolm, for the first time and witness their mother in an intimate encounter with Bart. Chris goes off to explore the rest of the mansion. Corrine awakens Cathy, demanding to know where her brother is. When Chris appears, she slaps him for running off and threatens to have them whipped, but apologizes the next day and offers to leave Foxworth Hall with them if they wish to, but they agree to stay.\n\nA year passes and Corrine's visits with her children all but cease. Due to a lack of fresh air and sunshine, the twins have stopped growing while Cathy and Chris enter puberty. Corrine explains the physical changes of becoming young adults to them and gives Cathy her first bra. As she tries it on, Chris walks in on her. Olivia catches them and calls them sinners and tries to cut off Cathy's hair as punishment. Chris stops her, but she threatens to starve them for a week if he doesn't cut Cathy's hair himself. Cathy and Chris refuse to comply and give their remaining food to the twins while they rely mostly on water. Olivia appears to relent and leaves them a basket of food; however, Cathy awakens to find tar in her hair the next morning. As Chris reluctantly cuts her hair, he tells her that he finds her beautiful, but knows it is wrong to think of her like that.\n\nAnother year passes and Corrine hasn't visited in months, forcing Cathy and Chris to act as parents to the twins. They conclude that their mother has abandoned them and begin contemplating an escape. When Corrine does return, she happily announces she has married Bart and was away on her honeymoon in Europe, infuriating Cathy. Olivia soon brings them sugar-powdered doughnuts, which she says are from their mother. Olivia beats Chris with a belt after he demands to be called by his name rather than \"boy.\" Cathy tends to his wounds and admits her fear of losing him. Assuring her nothing will happen to him, they kiss. When Olivia comes to deliver their food, Chris tells her that she was right about them being the \"devil's spawn\" and pleads for forgiveness. After she leaves, Chris reveals the whole scene was a scheme to get an impression of the key in soap, and he carves a wooden copy.\n\nCathy and Chris begin to steal money from their mother's room to finance an escape by train. On a night raid, Cathy finds Bart asleep and kisses him. Chris later overhears his mother and Bart talking, as he mentions a dream of a young, blond-haired girl coming into his room and kissing him. Realizing that she had kissed their stepfather, Chris angrily confronts Cathy, who assures him that the kiss meant nothing and had only been done out of curiosity. His jealousy turns into a desire for sibcest. She kisses him and they end up having sex. Cathy suggests they move to Florida and he tells her that he loves her and can never love anyone else. Carrie tells them that Cory is sick. Olivia and Corrine arrive and when hesitating to help him, Cathy demands her mother take Cory to a hospital, threatening revenge if she doesn't. Olivia agrees the child should go. The next day, Corrine tells them Cory had pneumonia and has died, and has already been buried.\n\nDevastated by the loss and in fear for their lives, Cathy and Chris decide to take all the money they have collected and grab as much jewelry as they can to finally escape. During the search for valuables, they discover that Corrine and Bart have left Foxworth Hall, leaving Cathy's promise ring and a photo of their father behind. Chris hides in the study to avoid being caught by the butler, John Amos, and a maid. Overhearing their conversation, Chris learns that Olivia has been leaving poison to kill \"the mice\" in the attic and that their grandfather had died seven months ago. He is soon caught by Olivia and flees from the room before meeting with Cathy, who shows him how Cory's pet mouse has died after eating a piece of his doughnut, revealing that the poison was in their food. Olivia then comes to take their key, but Chris is too sick to fight back and Cathy is unable to bring herself to strike the old woman. Olivia offers to show them mercy if they give her the key, but Chris restrains her long enough for Cathy and Carrie to escape. Olivia chases after them, but panics due to her claustrophobia when Chris shuts the door and turns the lights off. Cathy says it is her punishment for what she did to them and God does see everything. Olivia tells them that their mother was the one who poisoned them, not her, but they ignore her and climb out the window before fleeing on foot.\n\nDuring their escape, they run into John Amos, who mistakes them for intruders, but he realizes they are Corrine's children. Horrified, he tells them to run while he cuts off the electric fence for them. They board a train to Florida and Chris assures her that their ordeal is finally over. Cathy vows revenge on their mother for the pain and shame she dealt them.",
  "synopsis": null
}