{
  "imdb_id": "tt3922818",
  "tmdb_id": "365942",
  "douban_id": null,
  "title": "The Space Between Us (2017)",
  "genres": [
    "Drama",
    "Romance",
    "Sci-Fi"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "120 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm0155093",
      "name": "Peter Chelsom"
    }
  ],
  "writer": [
    {
      "id": "nm1615610",
      "name": "Allan Loeb",
      "description": "screenplay"
    },
    {
      "id": "nm0771609",
      "name": "Stewart Schill",
      "description": "story and"
    },
    {
      "id": "nm0507669",
      "name": "Richard Barton Lewis",
      "description": "story &"
    },
    {
      "id": "nm1615610",
      "name": "Allan Loeb",
      "description": "story"
    }
  ],
  "cast": [
    {
      "id": "nm0000198",
      "name": "Gary Oldman",
      "character": "Nathaniel Shepherd"
    },
    {
      "id": "nm2857778",
      "name": "Janet Montgomery",
      "character": "Sarah Elliot"
    },
    {
      "id": "nm5904649",
      "name": "Trey Tucker",
      "character": "Harrison Lane"
    },
    {
      "id": "nm1956106",
      "name": "Scott Takeda",
      "character": "Dr. Gary Loh"
    },
    {
      "id": "nm2889197",
      "name": "Adande 'Swoozie' Thorne",
      "character": "Scott Hubbard"
    },
    {
      "id": "nm2075924",
      "name": "Sarah Minnich",
      "character": "Reporter"
    },
    {
      "id": "nm3479972",
      "name": "Ryan Jason Cook",
      "character": "Control Room Technician"
    },
    {
      "id": "nm0000703",
      "name": "BD Wong",
      "character": "Tom Chen"
    },
    {
      "id": "nm0616774",
      "name": "Lauren Chavez-Myers",
      "character": "Alice Myers       (as Lauren Myers)"
    },
    {
      "id": "nm2813734",
      "name": "Morse Bicknell",
      "character": "NASA Executive"
    },
    {
      "id": "nm1544010",
      "name": "Beth Bailey",
      "character": "NASA Chief Doctor"
    },
    {
      "id": "nm2633535",
      "name": "Asa Butterfield",
      "character": "Gardner Elliot"
    },
    {
      "id": "nm0155093",
      "name": "Peter Chelsom",
      "character": "Centaur       (voice)"
    },
    {
      "id": "nm0001303",
      "name": "Carla Gugino",
      "character": "Kendra Wyndham"
    },
    {
      "id": "nm0827429",
      "name": "William Sterchi",
      "character": "Debate Moderator"
    },
    {
      "id": "nm8755757",
      "name": "Anthony Jarvis",
      "character": "College Student"
    },
    {
      "id": "nm1429380",
      "name": "Britt Robertson",
      "character": "Tulsa"
    },
    {
      "id": "nm8755758",
      "name": "Zacciah Hanson",
      "character": "Little Bewley Brother"
    },
    {
      "id": "nm1924388",
      "name": "Jesse Romero",
      "character": "Big Bewley Brother"
    },
    {
      "id": "nm2060832",
      "name": "Tim D. Janis",
      "character": "Chuck Woodruff       (as Tim Janis)"
    },
    {
      "id": "nm2175530",
      "name": "Kristen DeVore Rakes",
      "character": "Maid       (as Kristen Rakes)"
    },
    {
      "id": "nm2886631",
      "name": "Aurora Antonio",
      "character": "Young NASA Secretary"
    },
    {
      "id": "nm0570637",
      "name": "Bruce McIntosh",
      "character": "NASA Scientist"
    },
    {
      "id": "nm1254942",
      "name": "Lora Martinez-Cunningham",
      "character": "NASA Guide"
    },
    {
      "id": "nm1450145",
      "name": "David House",
      "character": "Roland"
    },
    {
      "id": "nm2934406",
      "name": "John-Paul Howard",
      "character": "Student       (as J.P. Howard)"
    },
    {
      "id": "nm6982686",
      "name": "Logan Paul",
      "character": "Buff College Kid"
    },
    {
      "id": "nm0366890",
      "name": "Luce Rains",
      "character": "Homeless Man"
    },
    {
      "id": "nm0311901",
      "name": "Esodie Geiger",
      "character": "Mrs. Tupelo"
    },
    {
      "id": "nm4948923",
      "name": "Charles Arnone",
      "character": "Mechanic"
    },
    {
      "id": "nm4958641",
      "name": "Stafford Douglas",
      "character": "Entitled Teen"
    },
    {
      "id": "nm6448223",
      "name": "Travis Armstrong",
      "character": "Colorado State Trooper"
    },
    {
      "id": "nm0656275",
      "name": "Matthew Page",
      "character": "Colorado State Trooper       (as Matt Page)"
    },
    {
      "id": "nm1904886",
      "name": "Mia Stallard",
      "character": "Screaming Girl"
    },
    {
      "id": "nm6590594",
      "name": "David Devereaux",
      "character": "Teenage Boy"
    },
    {
      "id": "nm2456350",
      "name": "Jacob Browne",
      "character": "New Mexico State Policeman"
    },
    {
      "id": "nm1017206",
      "name": "Jenny Gabrielle",
      "character": "Havasupai Woman"
    },
    {
      "id": "nm0083655",
      "name": "Gil Birmingham",
      "character": "Shaman Neka"
    },
    {
      "id": "nm3229268",
      "name": "Bernardo Saracino",
      "character": "Pilot"
    },
    {
      "id": "nm1787679",
      "name": "Eli Goodman",
      "character": "ER Doctor"
    },
    {
      "id": "nm2092454",
      "name": "Nate Warren",
      "character": "ER Clerk"
    },
    {
      "id": "nm4503029",
      "name": "Ramona King",
      "character": "Reception Nurse"
    },
    {
      "id": "nm1403599",
      "name": "Drago Sumonja",
      "character": "Social Services Man"
    },
    {
      "id": "nm1148573",
      "name": "Colin Egglesfield",
      "character": "Sarah's Brother"
    },
    {
      "id": "nm0521551",
      "name": "Eb Lottimer",
      "character": "Air Force Colonel"
    },
    {
      "id": "nm1247628",
      "name": "Ramsey Scott",
      "character": "Foster Care Worker"
    }
  ],
  "overview": "A young man raised by scientists on Mars returns to Earth to find his father.",
  "storyline": "In this interplanetary adventure, a space shuttle embarks on the first mission to colonize Mars, only to discover after takeoff that one of the astronauts is pregnant. Shortly after landing, she dies from complications while giving birth to the first human born on the red planet - never revealing who the father is. Thus begins the extraordinary life of Gardner Elliot - an inquisitive, highly intelligent boy who reaches the age of 16 having only met 14 people in his very unconventional upbringing. While searching for clues about his father, and the home planet he's never known, Gardner begins an online friendship with a street smart girl in Colorado named Tulsa. When he finally gets a chance to go to Earth, he's eager to experience all of the wonders he could only read about on Mars - from the most simple to the extraordinary. But once his explorations begin, scientists discover that Gardner's organs can't withstand Earth's atmosphere. Eager to find his father, Gardner escapes the team...",
  "plot": "In the near future, Nathaniel Shepard (Gary Oldman), CEO of Genesis, launches the first ever mission to colonize Mars. During the journey, the lead astronaut, Sarah Elliot (Janet Montgomery) discovers she is pregnant. Shortly after landing, she dies from complications while giving birth to the first human born on Mars. The father of the child is unknown.\n\nIn a dilemma, Nathaniel eventually decides to keep the child on Mars as a secret, to avoid a PR disaster for his company.\n\n16 years later, her son, Gardner Elliot (Asa Butterfield), has grown into an inquisitive, highly intelligent boy who has only ever met 14 people in his very unconventional upbringing. One day, in order to find out more about his mother, he hacks into Centaur, a robot he helped build, to gain access to the ship's storage. There, he retrieves his mother's items. Among them, a wedding ring and a USB drive, from which he plays a video of her and a man (Colin Egglesfield) in a beach house. Convinced that the man is his father, he becomes determined to find him.\n\nGardner logs on to an Internet chatroom, where he has struck up an online relationship with Tulsa (Britt Robertson), a street smart girl from Colorado who is constantly being shuffled from one foster home to the next. Under the guise of being confined to a penthouse, due to osteogenesis imperfecta, they discuss their plans for the future. Gardner promises to come see her, someday.\n\nHis mother figure, astronaut Kendra Wyndham (Carla Gugino), video calls Nathaniel and Genesis director Tom Chen (B. D. Wong), to inform them of Gardner's extraordinary intelligence and to beg them to allow him to return to Earth. Nathaniel refuses, as Gardner would have to undergo a highly risky surgery to increase his bone density, and then train to adapt to Earth's atmospheric pressure. Gardner undergoes the surgery anyway, and after training, he, Kendra, and some other astronauts board a space shuttle for Earth.\n\nOn the day of space shuttle's arrival, Nathaniel discovers that Gardner is on board. He angrily confronts Tom, who hid this from him. Despite his anger, Nathaniel visits Gardner, who is being quarantined in NASA while undergoing medical tests to determine whether he is fit for life on Earth.\n\nAfter a visit from Kendra, Gardner manages to discover that he is not fit for life on Earth. Upset, he stages a daring escape and hitches a ride to find Tulsa.\n\nUpon seeing him, Tulsa hits him as she is upset at Gardner for 'ghosting' her for 7 months. However, she forgives him and he convinces her to help him find his father. They stop by her house to get supplies for the journey, but are found by Nathaniel and Kendra. While trying to convince him to return, Gardner angrily confronts Kendra with her own admission of not wanting children, and escapes with Tulsa on an old plane her foster father was working on.\n\nThe plane abruptly runs out of gas while still in the sky. Tulsa manages to crash-land the plane into an old, abandoned barn, causing a fiery explosion. They escape safely to a diner where they determine the location of the shaman that married Gardner's parents, Shaman Neka (Gil Birmingham).\n\nBelieving that Gardner has died, a grieving Nathaniel and Kendra let out their rage at one another. After discovering that no bodies were found in the wreckage, they receive some devastating news - Gardner's body contains dangerously high levels of troponin, meaning that he has an enlarged heart. His heart is unable to stand Earth's atmospheric pressure, and so Gardner must be returned to Mars immediately if he is to survive.\n\nThe search is resumed with renewed fervor, and they discover CCTV footage of Gardner and Tulsa in a supermarket parking lot, where they have bought clothes and supplies for the journey.\n\nDuring the journey, Gardner tells Tulsa the truth - that he was born and raised on Mars. Unwilling to accept the truth, she forces him out of the car but forgives him once he promises never to lie to her again, although she still does not believe him.\n\nAt night, they camp out under the stars, where they kiss and have sex. In the morning, they are discovered by a follower of Shaman Neka and are brought to him. He agrees to help them. Gardner's nose starts bleeding, a fact he conceals while Tulsa accesses the records to get the location of the beach house, which is in New California.\n\nBefore they begin their journey, they make a detour to Las Vegas. Gardner's nose starts to bleed again and he collapses. After undergoing emergency surgery at a hospital, Tulsa tells Gardner she now believes he was born on Mars, but plans to leave him in the hospital, before foster care can come, as he is too sick to continue their journey. Gardner reveals that he knows he won't last anymore on Earth, and all he wants is to meet his father before he dies.\n\nTulsa gives in and helps him escape. They steal a car and drive to the beach house. There, they meet the man from the video, who reveals that he is not Sarah Elliot's husband, but her brother. However, he thinks that the two are lying to him.\n\nGardner runs down to the sea, where he tells Tulsa that this is where he wants to die. He collapses. Tulsa tries frantically to drag him to the shore, but he is too heavy for her. Nathaniel and Kendra arrive just in time to save him. While Nathaniel performs CPR on him, Gardner asks him about his mother, and reveals that he knows Nathaniel is his real father.\n\nNathaniel, Kendra, and Tulsa rush Gardner to a jet. They plan to launch into the stratosphere to stabilize him. When that proves to not be enough, a desperate Nathaniel takes control and launches into outer space. Miraculously, this suicidal mission works and Gardner is revived.\n\nSoon, Gardner boards a space shuttle to Mars. Tulsa and Gardner have an emotional parting. Kendra, who is staying on Earth to train astronauts for Mars, adopts Tulsa. Determined to join Gardner on Mars, Tulsa joins Kendra's program. Back on Mars, with his father Nathaniel, Gardner enjoys life.",
  "synopsis": null
}