{
  "imdb_id": "tt3951566",
  "tmdb_id": "278189",
  "douban_id": null,
  "title": "Apothecary (2014)",
  "genres": [
    "Drama",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "138 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm4444213",
      "name": "Madhav Ramadasan"
    }
  ],
  "writer": [
    {
      "id": "nm6697628",
      "name": "Hemanth Kumar",
      "description": null
    },
    {
      "id": "nm4444213",
      "name": "Madhav Ramadasan",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0329730",
      "name": "Suresh Gopi",
      "character": "Dr. Vijay Nambiar"
    },
    {
      "id": "nm1334389",
      "name": "Jayasurya",
      "character": "Subin Joseph"
    },
    {
      "id": "nm1366317",
      "name": "Abhirami",
      "character": "Dr. Nalini Nambiar"
    },
    {
      "id": "nm3981484",
      "name": "Asif Ali",
      "character": "Prathapan"
    },
    {
      "id": "nm1740873",
      "name": "Raghavan",
      "character": "Dr. Shankar Vasudevan"
    },
    {
      "id": "nm1668938",
      "name": "Arun",
      "character": "Dr. Raheem"
    },
    {
      "id": "nm6697627",
      "name": "Jayan Cherthala",
      "character": "Sajan Xavier"
    },
    {
      "id": "nm1428724",
      "name": "Indrans",
      "character": "Joseph"
    },
    {
      "id": "nm7871217",
      "name": "Jeena",
      "character": "PRO"
    },
    {
      "id": "nm3440285",
      "name": "Lishoy",
      "character": "Dr. Peethambaran"
    },
    {
      "id": "nm6697626",
      "name": "Neeraj Madhav",
      "character": "Shinoy Joseph"
    },
    {
      "id": "nm6363742",
      "name": "Kavitha Nair",
      "character": "Sabira"
    },
    {
      "id": "nm1032596",
      "name": "Seema G. Nair",
      "character": "Clara"
    },
    {
      "id": "nm3515935",
      "name": "Meera Nandan",
      "character": "Daisy"
    },
    {
      "id": "nm1403667",
      "name": "Antony Thekkek",
      "character": "Dr. Ali Hemmed       (as Thampy Antony)"
    },
    {
      "id": "nm7723845",
      "name": "Unnikrishnan",
      "character": "Kunjariya       (as Unni Chitoor)"
    },
    {
      "id": "nm3646658",
      "name": "Jayaraj Warrier",
      "character": "Varkkichan"
    }
  ],
  "overview": "Dr Vijay Nambiar (Suresh Gopi) is a famous neurosurgeon. His wife Dr Nalini Nambiar (Abhirami) is a gynecologist in the same hospital. They lead a contented and busy family life. 'Appothikkiri' plots the intriguing issues that affect their life.",
  "storyline": "A doctor is haunted by his conscience, when puppeteer-ed by his superiors.",
  "plot": "Dr. Vijay Nambiar (Suresh Gopi) is a skilled and renowned neurosurgeon. He lives with his wife, Dr. Nalini Nambiar (Abhirami), and their two children. Both doctors work at the Apothecary Hospital. The film begins with Nambiyar's being admitted to the hospital because of a motor vehicle accident. He has suffered a brain injury, and his chance of survival seems slim. Subin Joseph (Jayasurya), a patient of Nambiyar's, comes to visit him.\n\nSubin recounts his experience at the hospital under Nambiyar's care. The hospital is revealed to be run greedily, with patients being subjected to expensive and unnecessary tests and medicines. Nambiyar is a doctor with a good reputation, but is forced by the management to run clinical trials for new drugs. He realizes that such trials are necessary for progress, but the lack of ethical protocol and the side effects of such drugs turn the patients' lives into a living hell.\n\nThis dilemma consumes him, causing him to have hallucinations of his clinical trial patients. His soul is locked in a surreal struggle between the good and the bad actions of his work. His accident resulted from such an episode, wherein he fell to the road in a fit of panic. Finally, he is redeemed with the realization that his work has saved thousands, compared to the few lives destroyed by his actions. Should he live, he would go on to save even more lives.\n\nNambiyar returns to life a changed man. He confronts the hospital board about their actions. He reminds them of the definition of 'Apothecary' which was used years back, to refer to doctors who treated village folk with their medicines. Stating that the hospital simply retains that name, he leaves the hospital to set up a charitable institution. His wife and several of the hospital staff and patients accompany him on his new journey.",
  "synopsis": null
}