{
  "imdb_id": "tt3908142",
  "tmdb_id": "374052",
  "douban_id": null,
  "title": "The Love Witch (2016)",
  "genres": [
    "Comedy",
    "Horror",
    "Romance",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "120 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.9,
  "director": [
    {
      "id": "nm0082366",
      "name": "Anna Biller"
    }
  ],
  "writer": [
    {
      "id": "nm0082366",
      "name": "Anna Biller",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm6231136",
      "name": "Samantha Robinson",
      "character": "Elaine"
    },
    {
      "id": "nm1323275",
      "name": "Gian Keys",
      "character": "Griff"
    },
    {
      "id": "nm3731645",
      "name": "Laura Waddell",
      "character": "Trish"
    },
    {
      "id": "nm0661651",
      "name": "Jeffrey Vincent Parise",
      "character": "Wayne"
    },
    {
      "id": "nm1239627",
      "name": "Jared Sanford",
      "character": "Gahan"
    },
    {
      "id": "nm0781571",
      "name": "Robert Seeley",
      "character": "Richard"
    },
    {
      "id": "nm1912054",
      "name": "Jennifer Ingrum",
      "character": "Barbara"
    },
    {
      "id": "nm0263141",
      "name": "Randy Evans",
      "character": "Steve"
    },
    {
      "id": "nm1599755",
      "name": "Clive Ashborn",
      "character": "Professor King"
    },
    {
      "id": "nm1972813",
      "name": "Lily Holleman",
      "character": "Miss Curtis"
    },
    {
      "id": "nm2444393",
      "name": "Jennifer Couch",
      "character": "Wendy"
    },
    {
      "id": "nm0941966",
      "name": "Stephen Wozniak",
      "character": "Jerry"
    },
    {
      "id": "nm5672668",
      "name": "Giselle DaMier",
      "character": "Harpist"
    },
    {
      "id": "nm7195426",
      "name": "April Showers",
      "character": "April Showers"
    },
    {
      "id": "nm4752515",
      "name": "Elle Evans",
      "character": "Star"
    },
    {
      "id": "nm6050249",
      "name": "Fair Micaela Griffin",
      "character": "Moon"
    },
    {
      "id": "nm3112349",
      "name": "Dani Lennon",
      "character": "Mandy"
    },
    {
      "id": "nm2173789",
      "name": "Gina Venditti",
      "character": "Jane"
    },
    {
      "id": "nm0267746",
      "name": "Frank Farmer",
      "character": "Sam"
    },
    {
      "id": "nm0325016",
      "name": "Kyle Derek",
      "character": "Lyle"
    },
    {
      "id": "nm1588491",
      "name": "Christopher Le Crenn",
      "character": "Jester"
    },
    {
      "id": "nm5033479",
      "name": "Neil Gillen",
      "character": "Troubadour"
    },
    {
      "id": "nm7331007",
      "name": "Amy Segal",
      "character": "Lady Love"
    },
    {
      "id": "nm4894972",
      "name": "Jacob Peacock",
      "character": "Holly King"
    },
    {
      "id": "nm5700554",
      "name": "Robert Michael",
      "character": "Sun Dancer       (as Robert Michael Anderson)"
    },
    {
      "id": "nm6165988",
      "name": "Jacklyn Chung-Young",
      "character": "Sun Dancer"
    },
    {
      "id": "nm7560879",
      "name": "Jonathan Beck",
      "character": "Witch"
    },
    {
      "id": "nm1985820",
      "name": "Bernard Bullen",
      "character": "Lord Bernard"
    },
    {
      "id": "nm2407265",
      "name": "Lisa Ann Davis",
      "character": "Witch"
    },
    {
      "id": "nm7936391",
      "name": "Michael G. Gabel",
      "character": "Troubadour"
    },
    {
      "id": "nm3725724",
      "name": "Giovanni V. Giusti",
      "character": "Lord Antone"
    },
    {
      "id": "nm3608086",
      "name": "Alisha Honoré",
      "character": "Connie"
    },
    {
      "id": "nm7983953",
      "name": "Matthew Jablonski",
      "character": "Priest"
    },
    {
      "id": "nm3569981",
      "name": "Max Karson",
      "character": "Witch"
    },
    {
      "id": "nm2434639",
      "name": "Casey Larios",
      "character": "Witch, Priest"
    },
    {
      "id": "nm1789216",
      "name": "Larva",
      "character": "Witch"
    },
    {
      "id": "nm7477549",
      "name": "Donna Madach",
      "character": "Witch"
    },
    {
      "id": "nm7560877",
      "name": "Elise Massa",
      "character": "Witch"
    },
    {
      "id": "nm6720312",
      "name": "Jamie Morrow",
      "character": "Renaissance Fair Maiden"
    },
    {
      "id": "nm1885103",
      "name": "Barry Morse",
      "character": "Lord"
    },
    {
      "id": "nm6600196",
      "name": "Guilherme Scarabelot",
      "character": "Page"
    },
    {
      "id": "nm7560878",
      "name": "Christian Smith",
      "character": "Witch"
    },
    {
      "id": "nm6355410",
      "name": "Rosie Woodward Smith",
      "character": "Witch       (as Rosie Woodward)"
    },
    {
      "id": "nm5411704",
      "name": "Marylin Winkle",
      "character": "Musician"
    },
    {
      "id": "nm7300530",
      "name": "David Winograd",
      "character": "Elain's Dad       (voice)"
    }
  ],
  "overview": "Elaine, a beautiful young witch, is determined to find a man to love her. In her gothic Victorian apartment she makes spells and potions, and then picks up men and seduces them. However her spells work too well, and she ends up with a string of hapless victims. When she finally meets the man of her dreams, her desperation to be loved will drive her to the brink of insanity and murder.",
  "storyline": "Elaine, a beautiful young witch, is determined to find a man to love her. In her gothic Victorian apartment she makes spells and potions, and then picks up men and seduces them. However her spells work too well, and she ends up with a string of hapless victims. When she finally meets the man of her dreams, her desperation to be loved will drive her to the brink of insanity and murder. With a visual style that pays tribute to Technicolor thrillers of the 1970s, THE LOVE WITCH explores female fantasy and the repercussions of pathological narcissism.",
  "plot": "Confronted with the potential end of their marriage, Ethan (Mark Duplass) and Sophie (Elisabeth Moss) are seeing a therapist (Ted Danson) regularly. After asking them to each play a note on a piano, he identifies a disconnection in their relationship and suggests they take a weekend retreat to a large, secluded estate. The couple decides to try anything to save their marriage and agree to go.\n\nOnce at the estate, Ethan and Sophie make themselves comfortable, smoking some marijuana to relax. Sophie goes to the guest cottage and, while there, has sex with Ethan. Sophie returns to the house to find Ethan asleep. When she mentions the sex they just had, Ethan claims he cannot remember the event, so Sophie, annoyed that Ethan could ruin an otherwise romantic evening with a poor joke, goes to bed alone. Ethan, instead, curls up in the guest cottage. During the night, Sophie joins him in remorse, apologizing for her behavior and falling asleep next to him. The next morning, she makes him eggs and bacon for breakfast. Ethan makes note how odd it is that Sophie is cooking bacon for him, as she notedly hates the smell of bacon and would always refuse to cook it.\n\nEthan, suspicious, returns to the main house where Sophie has no memory of joining him in the guest cottage, nor of relenting on her distaste of bacon. Ethan quickly divines that something unusual is going on: when in the guest house cottage, each of them met a doppelgänger of the other, one who was convincing enough to pass without suspicion. By visiting with Sophie II (Moss), Ethan is able to establish that their doppelgängers cannot or will not leave the guest cottage; by barging in on Sophie's session with Ethan II (Duplass), he determines that the doppelgängers disappear when both (original) spouses are in the guest cottage together and that the doubles are idealized versions of the spouses they imitate. Ethan and Sophie agree to take advantage of these strange circumstances, though Ethan sets ground rules, including a rule of \"no intimacy\" and spend only fifteen minutes at a time with them.\n\nEthan accumulates evidence that there is a mundane explanation for what's going on: some of his clothing is missing, and he receives several voice mails from friends and family, answering calls, made in his voice, asking about details of his past. Sophie, meanwhile, asks Ethan II why he cheated on her in the first place. Ethan II says that it was a moment of weakness, and promises to make it right. Sophie has started to develop feelings for Ethan II and goes to the guest cottage to seduce him. Ethan discovers this by quick sleight of hand: claiming to take the car to the store, he instead enters the guest house and assumes the place of his doppelgänger. Sophie seduces the original Ethan, unbeknownst to her.\n\nThe next morning, Sophie once again seeks refuge with Ethan II, and Ethan I deliberately disturbs them by entering the guest cottage. As they argue, they find Sophie II and Ethan II awaiting them in the main house. The four spend a bizarre social evening together, and it becomes clear that Ethan II and Sophie II know they are playing a role. Ethan II also reveals Ethan I's duplicity at the guest cottage, further turning Sophie I against him. Ethan II conspires to lock Ethan I in the guest cottage for the night. There, Ethan I finds a computer with files for different couples that include sound recordings of voices, and locates a file labeled 'Sophie &amp; Ethan' (presumably Ethan II and Sophie II), learning to imitating his and Sophie I's.\n\nSophie II visits Ethan I in the guest house the next morning and explains what has been happening. The residing couple (Ethan II and Sophie II) must drive a wedge between the visiting couple, causing the visiting couple to fall out of love. The residing couple, presumably having worked out their differences through the shared imprisonment, can then leave, and the visiting couple is in turn trapped within the estate until new visitors arrive. Ethan II, she reveals, is planning to leave with Sophie I as he has fallen in love with her. However, Sophie II would rather conspire against him than see her husband leave with another woman. To execute this plan, Ethan I hides in the bathroom of the main house while Sophie II asks to borrow some of Sophie I's clothes in preparation for a hike the three are taking, emerging in the exact clothes that Sophie I is wearing. Ethan then confronts Sophie and explains what he has been told. Ethan II discovers their clandestine meeting and after wrestling with Ethan I, attempts to convince Sophie I to flee with him. When she refuses, he decides to run away, figuring this is his chance to finally escape the retreat grounds, even if he has to do so alone. Ethan I pursues him, but without need: Ethan II hits an invisible barrier and collapses to the ground unconscious from the impact. Each Sophie has an opposing reaction to the incident, one seemingly distressed for Ethan II lying on the ground and the other slowly smiling at Ethan I as she waits for his next move. Ethan I, realizing this is their chance to escape, grabs the smiling Sophie judging solely by her facial expression and makes a run for the car. The Sophie left behind is last seen left by the side of the road, kneeling over Ethan II who is still unconscious and whose prognosis is unclear. She looks up only a short while with a blank stare to watch Ethan and Sophie drive away from the estate.\n\nEthan and Sophie drive straight to the therapist's office demanding answers, but find it abandoned with only a piano in the centre of the room. The two call it a day, seemingly deciding to wash their hands of everything that has happened, and head home. The following day, Ethan and Sophie are home in bed. After some playful banter, he asks what she plans on making for breakfast. Calling back from downstairs, Sophie casually replies eggs and bacon. Ethan takes a moment to consider the meaning of Sophie cooking bacon, either he has brought back Sophie II or Sophie I has changed. Ethan appears to come to some peace with his own conclusion and he heads downstairs to join her for breakfast.",
  "synopsis": null
}