{
  "imdb_id": "tt3975510",
  "tmdb_id": "323435",
  "douban_id": null,
  "title": "One and Two (2015)",
  "genres": [
    "Drama",
    "Fantasy",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.1,
  "director": [
    {
      "id": "nm3902730",
      "name": "Andrew Droz Palermo"
    }
  ],
  "writer": [
    {
      "id": "nm3902730",
      "name": "Andrew Droz Palermo",
      "description": "co-writer"
    },
    {
      "id": "nm4662697",
      "name": "Neima Shahdadi",
      "description": "co-writer"
    }
  ],
  "cast": [
    {
      "id": "nm2215143",
      "name": "Kiernan Shipka",
      "character": "Eva"
    },
    {
      "id": "nm3154303",
      "name": "Timothée Chalamet",
      "character": "Zac"
    },
    {
      "id": "nm0714147",
      "name": "Elizabeth Reaser",
      "character": "Elizabeth"
    },
    {
      "id": "nm0101198",
      "name": "Grant Bowler",
      "character": "Daniel"
    },
    {
      "id": "nm7355551",
      "name": "Wendy Ahlstrom",
      "character": "Country Woman"
    },
    {
      "id": "nm5196953",
      "name": "Kyle Bell",
      "character": "Jeff"
    },
    {
      "id": "nm5873741",
      "name": "Zachary Dylan Brown",
      "character": "Nurse"
    },
    {
      "id": "nm6307539",
      "name": "Chantey Colet",
      "character": "Terry"
    },
    {
      "id": "nm6949770",
      "name": "Monica Crumpler",
      "character": "Nurse 3"
    },
    {
      "id": "nm6758613",
      "name": "Rayven Symone Ferrell",
      "character": "Danny"
    },
    {
      "id": "nm0320646",
      "name": "Dale Girard",
      "character": "John /              Nurse #2"
    },
    {
      "id": "nm6429675",
      "name": "Saia Grayson",
      "character": "Danny's Opponent"
    },
    {
      "id": "nm5233331",
      "name": "Albert Guzman",
      "character": "Grieving family member"
    },
    {
      "id": "nm6275982",
      "name": "Julie Haught",
      "character": "River Woman"
    },
    {
      "id": "nm2438151",
      "name": "Robert Haulbrook",
      "character": "Nurse #1"
    },
    {
      "id": "nm6166737",
      "name": "Corey Maher",
      "character": "Doctor"
    },
    {
      "id": "nm7194867",
      "name": "Jane Marsh",
      "character": "Amish Wife"
    },
    {
      "id": "nm3230187",
      "name": "Jane Hardin Marsh",
      "character": "Amish Woman"
    },
    {
      "id": "nm6155310",
      "name": "Brenda Moss-Clifton",
      "character": "Patient"
    },
    {
      "id": "nm4822331",
      "name": "Ed Pilkington",
      "character": "Van"
    },
    {
      "id": "nm0779367",
      "name": "John Henry Scott",
      "character": "Amish Farmer"
    },
    {
      "id": "nm6241224",
      "name": "Yuliya Sherstyuk",
      "character": "Grieving Family Member"
    },
    {
      "id": "nm5477036",
      "name": "Sherry Sparks-Jenkins",
      "character": "Grieving Daughter"
    },
    {
      "id": "nm6689744",
      "name": "Todd Whittington",
      "character": "Erie Man"
    }
  ],
  "overview": "Two siblings discover a supernatural escape from a troubled home, but find their bond tested when reality threatens to tear their family apart.",
  "storyline": "Zac and Eva live with their parents in isolated-mysterious farmhouse. The family lives' in the 1800s manner and doing the old-fashioned chores. When their mom becomes seriously ill, the sibling begins to discover family dark secrets and supernatural abilities to teleport themselves, which threaten a family to splintered. One and Two is the story about the bond and love between the siblings.",
  "plot": "C.R. \"Mac\" MacNamara is a high-ranking executive in the Coca-Cola Company, assigned to West Berlin after a business fiasco a few years earlier in the Middle East (about which he is still bitter). While based in West Germany for now, Mac is angling to become head of Western European Coca-Cola Operations, based in London. After working on an arrangement to introduce Coke into the Soviet Union, Mac receives a call from his boss, W.P. Hazeltine, in Atlanta. Scarlett Hazeltine, the boss's hot-blooded but slightly dim 17-year-old socialite daughter, is coming to West Berlin. Mac is assigned the unenviable task of taking care of this young whirlwind.\n\nAn expected two-week stay develops into two months, and Mac discovers just why Scarlett is enamored of West Berlin: she surprises him by announcing that she's married to Otto Piffl, a young East German Communist with ardent anti-capitalistic views. When the southern belle is confronted about her foolishness in the matter of helping him blow up anti-American \"Yankee Go Home\" balloons (how the couple met) she simply replies with, \"Why, that ain't anti-american, it's anti-yankee... And where I come from, everybody's against the yankees...\" Mac tries to come to terms with the fact that he let his boss's daughter marry a communist and learns the horrible truth: The couple are bound for Moscow to make a new life for themselves (\"They've assigned us a magnificent apartment, just a short walk from the bathroom!\"). Since Hazeltine and his wife are coming to Berlin to collect their daughter the very next day, this is obviously a disaster of monumental proportions, and Mac deals with it as any good capitalist would — by framing the young Communist firebrand and having him picked up by the East German police, using all his wiles, as well as his sexy secretary Fraulein Ingeborg, to get his way. After Otto is forced to listen endlessly to the song \"Itsy Bitsy Teenie Weenie Yellow Polka Dot Bikini\" during interrogation, he cracks and signs a confession that he's an American spy.\n\nUnder pressure from his stern and disapproving wife Phyllis (who wants to take her family back to live in the U.S.), and with the revelation that Scarlett is pregnant, Mac sets out to bring Otto back with the help of his new Soviet business associates. With the boss on the way, he finds that his only chance is to turn Otto into a son-in-law in good standing — which means, among other things, making him a capitalist with an aristocratic pedigree (albeit contrived by adoption). In the end, the Hazeltines approve of their new son-in-law, upon which Mac learns from Hazeltine that Otto will be named the new head of Western European Operations, with Mac getting a promotion to VP of Procurement back in Atlanta. Mac reconciles with his family at the airport and to celebrate his promotion, offers to buy them Cokes. Ironically, after handing out the bottles to his family, he discovers that the Coke machine actually has been stocked with Pepsi-Cola.",
  "synopsis": null
}