{
  "imdb_id": "tt4034208",
  "tmdb_id": "348555",
  "douban_id": null,
  "title": "The Next Skin (2016)",
  "genres": [
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "country": "Spain",
  "version": [
    {
      "runtime": "103 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm3040373",
      "name": "Isa Campo"
    },
    {
      "id": "nm1050097",
      "name": "Isaki Lacuesta"
    },
    {
      "id": "nm3040373",
      "name": "Isa Campo"
    }
  ],
  "writer": [
    {
      "id": "nm3040373",
      "name": "Isa Campo",
      "description": null
    },
    {
      "id": "nm1050097",
      "name": "Isaki Lacuesta",
      "description": null
    },
    {
      "id": "nm1209187",
      "name": "Fran Araújo",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3856284",
      "name": "Àlex Monner",
      "character": "Gabriel"
    },
    {
      "id": "nm0840772",
      "name": "Emma Suárez",
      "character": "Ana"
    },
    {
      "id": "nm0530365",
      "name": "Sergi López",
      "character": "Enric"
    },
    {
      "id": "nm0865333",
      "name": "Bruno Todeschini",
      "character": "Michel"
    },
    {
      "id": "nm4000959",
      "name": "Igor Szpakowski",
      "character": "Joan"
    },
    {
      "id": "nm0067485",
      "name": "Sílvia Bel",
      "character": "Glòria"
    },
    {
      "id": "nm3036925",
      "name": "Greta Fernández",
      "character": "Clara"
    },
    {
      "id": "nm4001114",
      "name": "Mikel Iglesias",
      "character": "Amic Joan 1"
    },
    {
      "id": "nm6948831",
      "name": "Pablo Rosset",
      "character": "Amic Joan 2       (as Pablo Roset)"
    },
    {
      "id": "nm6948832",
      "name": "Guillem Jorba",
      "character": "Amic Joan 3       (as Guillem Jorba Prats)"
    },
    {
      "id": "nm9046194",
      "name": "Pol Fercan",
      "character": "Amic Joan 4"
    },
    {
      "id": "nm0604361",
      "name": "Alex Moreu Garriga",
      "character": "Monitor 1       (as Àlex Moreu)"
    },
    {
      "id": "nm7278202",
      "name": "Fred Adenis",
      "character": "Monitor 2"
    },
    {
      "id": "nm1162052",
      "name": "Lucy Tillett",
      "character": "Monitora"
    },
    {
      "id": "nm10382598",
      "name": "Intissar El Meskine",
      "character": "Noia centre menors"
    },
    {
      "id": "nm3085401",
      "name": "Pep García Pascual",
      "character": "Venedor mercat       (as Pep García-Pascual)"
    },
    {
      "id": "nm4746626",
      "name": "Margarita Roset",
      "character": "Dona gran mercat"
    },
    {
      "id": "nm3680330",
      "name": "Juli Costa",
      "character": "Home parella mercat"
    },
    {
      "id": "nm2601956",
      "name": "David Arribas",
      "character": "Caixer frontera"
    },
    {
      "id": "nm2264572",
      "name": "Jordi Pau",
      "character": "Client bar 1"
    },
    {
      "id": "nm10382599",
      "name": "Carles Tarrida",
      "character": "Client bar 2"
    },
    {
      "id": "nm10382600",
      "name": "Kito Pau",
      "character": "Client bar 3"
    },
    {
      "id": "nm1252415",
      "name": "Oriol Maymó",
      "character": "Pare Gabriel"
    },
    {
      "id": "nm10382601",
      "name": "David Almenar",
      "character": "Caçador 1"
    },
    {
      "id": "nm10382602",
      "name": "Iñigo Ligüeri",
      "character": "Caçador 2"
    }
  ],
  "overview": "A teenager who went missing and was presumed dead returns home after eight years to find a family deeply affected by his disappearance. Gradually, doubts arise about whether he really is the missing boy or an impostor.",
  "storyline": "A teenager who went missing and was presumed dead returns home after eight years to find a family deeply affected by his disappearance. Gradually, doubts arise about whether he really is the missing boy or an impostor.",
  "plot": "As a prologue. a nameless Cambodian girl leaves her village for Bangkok. Upon arriving, she is kidnapped, drugged, and sold in the skin trade.\n\nMeanwhile, as this movie starts in the city of Newark, a Newark Police Department detective named Nick Cassidy discovers that Serbian mobster Viktor Dragovic is wreaking havoc with his hitmen. Meanwhile, in Bangkok, detective Tony Vitayakul attempts to buy a Thai girl from a group of human traffickers. When his cover is blown, he takes down the traffickers and frees the girl from captivity.\n\nCaptain Costello and Cassidy brief the police department on Dragovic; revealing he runs the largest human trafficking network in the world. As a cargo ship owned by Dragovic approaches America, Cassidy and the department prepare to intercept it at the docks. When the ship arrives, Dragovic discovers the trafficked women have died during transport. The ship's captain is held responsible and shot in the head. A shootout erupts as the police move in for an arrest. Cassidy chases Dragovic and his son, Andre, as they flee. He fatally shoots Andre in self-defense and Dragovic is arrested. While in custody, Dragovic arranges to have Cassidy and his entire family murdered; having his house blown up the same night. Cassidy's wife and daughter are killed instantly, while Cassidy survives after being shot in the back.\n\nCostello and Reed, an FBI agent, visit Cassidy in hospital. They tell him Dragovic fled the US after being bailed. As soon as they leave, Cassidy staggers out of the hospital unnoticed. He gathers a few weapons and travels to the restaurant of Dragovic's attorney. After forcing the attorney to reveal Dragovic's whereabouts, Cassidy kills the attorney and blows up the restaurant.\n\nIn Cambodia, Senator Khat warns Dragovic that unless he leaves the country immediately, he will be arrested and extradited to the United States. Dragovic blackmails the Senator into giving him two weeks to put his affairs in order and flee.\n\nCassidy travels to Thailand in pursuit of Dragovic. Believing that Cassidy has experienced a nervous breakdown, the US authorities have ordered Reed to detain him as soon as he arrives. Tony and his partner, Nung, are told to assist with the arrest. At Suvarnabhumi airport, Cassidy flees as the police try to arrest him. Reed, who has been bought off by Dragovic, kills Nung and frames Cassidy for the murder. Tony pursues Cassidy through the streets, but Cassidy escapes; he travels to a nightclub in Poipet, where - after torturing one of Dragovic's men - he discovers the location of Dragovic's current operations. Tony and Reed arrive at the nightclub and attempt to arrest Cassidy. After fighting with Tony, Cassidy escapes injured. Reed then uses Tony's cell phone to uncover an informant, who happens to be Tony's girlfriend, Min. While attempting to sabotage Dragovic's operations, a shootout erupts between Cassidy and Dragovic's men. Ivan and Goran shoot their half-brother, Janko, on behalf of their father. Tony arrives and attempts to kill Cassidy, but after learning the truth about his partner's death, he kills Reed instead. Before dying, Janko reveals his father's location.\nClosing narration\n\nI don't know where she is. But whatever it takes, wherever I have to go, I'm gonna find my daughter.\nNick Cassidy\nThe next day, Cassidy and Tony storm Dragovic's compound. While there, Cassidy learns that his daughter, Sofia, was not killed, but placed in the human trafficking trade. Ivan tries to kill Min, but Tony shoots him in the head. Cassidy destroys a vehicle with a rocket-launcher, and as a result, Dragovic's helicopter leaves without him. During a shootout between Cassidy and Dragovic's men, Goran is killed in a hand-to-hand fight with Tony. After the shootout, Cassidy fights with Dragovic; ultimately stabbing him in the chest. He attempts to retrieve the whereabouts of his daughter from the dying Dragovic, but fails.\n\nIn the aftermath, Cassidy says goodbye to Tony and Min. Before leaving, he gives them a picture of Sofia and tells them to hold onto it until he has found her. He then sets out in search of his daughter.",
  "synopsis": null
}