{
  "imdb_id": "tt4034354",
  "tmdb_id": "347031",
  "douban_id": null,
  "title": "Swiss Army Man (2016)",
  "genres": [
    "Adventure",
    "Comedy",
    "Drama",
    "Fantasy",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm3453283",
      "name": "Dan Kwan"
    },
    {
      "id": "nm3215397",
      "name": "Daniel Scheinert"
    }
  ],
  "writer": [
    {
      "id": "nm3453283",
      "name": "Dan Kwan",
      "description": "written by"
    },
    {
      "id": "nm3215397",
      "name": "Daniel Scheinert",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0200452",
      "name": "Paul Dano",
      "character": "Hank"
    },
    {
      "id": "nm0705356",
      "name": "Daniel Radcliffe",
      "character": "Manny"
    },
    {
      "id": "nm0935541",
      "name": "Mary Elizabeth Winstead",
      "character": "Sarah"
    },
    {
      "id": "nm7708571",
      "name": "Antonia Ribero",
      "character": "Crissie"
    },
    {
      "id": "nm2361928",
      "name": "Timothy Eulich",
      "character": "Preston"
    },
    {
      "id": "nm0343478",
      "name": "Richard Gross",
      "character": "Hank's Dad"
    },
    {
      "id": "nm0144554",
      "name": "Marika Casteel",
      "character": "Reporter"
    },
    {
      "id": "nm7874447",
      "name": "Andy Hull",
      "character": "Cameraman"
    },
    {
      "id": "nm7656390",
      "name": "Aaron Marshall",
      "character": "Officer #1"
    },
    {
      "id": "nm1503403",
      "name": "Shane Carruth",
      "character": "Coroner"
    }
  ],
  "overview": "Alone on a tiny deserted island, Hank has given up all hope of ever making it home again. But one day everything changes when a dead body washes ashore, and he soon realizes it may be his last opportunity to escape certain death. Armed with his new “friend” and an unusual bag of tricks, the duo go on an epic adventure to bring Hank back to the woman of his dreams.",
  "storyline": "Hank, stranded on a deserted island and about to kill himself, notices a corpse washed up on the beach. He befriends it, naming it Manny, only to discover that his new friend can talk and has a myriad of supernatural abilities...which may help him get home.",
  "plot": "Hank, a man marooned on an island, is on the verge of hanging himself, but sees a corpse wash up on the beach. He tries to resuscitate it, but the corpse bemuses him with its incessant flatulence. As the tide begins to wash the corpse away, Hank watches as its farts propel itself around on the water. Hank immediately mounts the corpse and rides across the ocean like a jet ski, landing on a mainland shore but far from civilization. That night, the two of them hide in a cave from a rainstorm, and after the runoff pours into the corpse's mouth, Hank realizes the next morning that the corpse has yet another power in which it can be used like a well for a seemingly infinite source of drinkable water. The corpse also begins a slow transition into speaking and a grasp on the English language, adopting the name Manny. Hank and Manny continue their quest, using Manny's erections (fueled by a swimsuit magazine they find) as a compass. Manny has forgotten everything about his former life, and Hank tries to teach him various concepts about life, but Manny's childlike and shameless interpretations of these concepts conflict with what Hank considers socially acceptable behavior.\n\nOver the course of their journey, Hank teaches Manny the joys of eating out, going to movies, and partying, using crudely-constructed props and sets made from plants and garbage they find. Using these, Hank leads Manny to believe that Manny is in love with a woman named Sarah, who rides the bus alone every day. Manny falls in love with Sarah, and it is this love that motivates him to try and find civilization with Hank. In reality, Hank is very much in love with Sarah, having seen her riding the bus every day but never talking to her due to his own shyness. He has a photo of her that he took secretly while on the bus set as the wallpaper on his phone and follows her on social media. As he looks through photos, it is revealed that Sarah is happily married and has a child.\n\nHank portrays Sarah to help Manny learn how to talk to women, but they end up connecting and kiss. They have a falling out after Hank reveals that Manny never knew Sarah during his life. Feeling betrayed over Hank's hypocrisy and self-restraint, Manny states he wishes to be fully dead again. At this time, Hank experiences strange mental flashes of surreal images recalling his journey and suggests that one of Manny's powers is to affect his mind. Despite the tension between them, when Hank is attacked by a bear, Manny moves under his own power for the first time, crawling after his injured friend and igniting one of his farts from their campfire to scare the bear away. Hank loses consciousness and wakes up to Manny carrying him to Sarah's house, despite Hank's protests.\n\nWhile Sarah is in the house, Manny talks to Sarah's daughter, Chrissy. Expecting her to be impressed, he demonstrates several of his powers, inadvertently frightening her with his compass-erection, which Hank quickly slaps down. Sarah is alerted by her daughter's crying and calls the police at the sight of Hank and Manny's once-again inanimate corpse. Hank is soon patched up, but the cops discover the photos of Sarah on his phone and become suspicious. Hank's father also appears, mistaking Manny's corpse for Hank when asked by the paramedics to confirm his identity. After being interviewed by the local television news and deliriously professing on air his gratitude for Manny and his magical powers, Hank runs away with Manny's body. Hank's pursuers discover the structures he built which in actuality seem to be quite close to Sarah's house, as if he had been there some time instead of journeying through the forest. The police, Sarah, her husband, her daughter, a reporter, a camera man, and Hank's father all follow him to the beach. Cornered, Hank lets out a long fart as he is taken away by the police. Shortly after, to everyone else's shock, horror, and in Chrissy's case, glee, Manny begins violently farting until he floats back into the ocean and skims quickly away, propelled by his own flatulence, he and Hank sharing one last smile.",
  "synopsis": "The film starts with shots of several items floating in the middle of the ocean. They have little messages written on them by someone stating that they are hungry, bored, and they don't want to die alone.On a deserted island, Hank Thompson (Paul Dano) is getting ready to hang himself. He then sees the body of a young man (Daniel Radcliffe) wash up on the shore. Hank attempts to walk over, but he forgets he's got a noose around his neck and he is almost hung until the rope snaps. He runs to the young man and checks for a pulse, but he's dead. Hank hears a rumbling sound from inside the man's body, and the corpse farts. Hank takes the belt off the man's pants and uses it to try and hang himself again. However, the corpse continues to fart so much that it moves a little. Hank runs back to the corpse and uses his farts to ride away from the island like a jet ski. Hank loses his balance and falls into the water.Hank wakes up in a different location near the woods. He thinks the corpse has saved him. Hank brings the corpse into a cave as it rains that night. The corpse appears to be collecting water in his mouth while sticking his tongue out.In the morning, Hank gets thirsty. The corpse starts spewing water from his mouth. Hank drinks it in a cup he found. He thanks the corpse and starts talking to him. The corpse replies with a groggy, \"Okay, buddy\", leading Hank to scream and punch him in the face. The corpse starts mumbling, making it sound like he is saying \"Manny\", so Hank starts calling him that. He thinks he may just be hallucinating from starvation, but he starts trying to get Manny to remember anything he can about life.Hank carries Manny on his back as they walk through the woods. He reminds Manny of various aspects about life, like pooping and sex. Manny sees a picture of a sports magazine with a beautiful woman in the pages. He gets an erection that Hank uses as a compass to guide him away.On their walk, Hank steps in a pile of poo, and he then hears what sounds like a bear growling. In a panicked fit, Hank and Manny tumble down a hill. After the fall, Manny sees Hank's phone in a plastic bag, which Manny thinks belonged to him. The wallpaper shows a woman named Sarah (Mary Elizabeth Winstead), whom Hank would always see on the bus sitting by herself. He took the picture of her secretly. Manny falls in love with Sarah, now finding motivation to get home.Hank begins to remind Manny what it feels like to love. Hank dresses up to look like Sarah so Manny can talk to \"her\". Manny is awkward and doesn't know how to talk to women. The two also discuss topics like masturbation and family members, including how Hank's mom died and he doesn't have the best relationship with his dad. It gets unpleasant when Manny makes a connection between masturbating and Hank's mom, causing Hank to yell at him. He apologizes for that, though.In the woods, Hank starts to build several structures, like a bus, a theater, and a cafe. On the bus, Hank plays out with Manny what it's like to see Sarah getting on the bus and trying to find the courage to talk to her.Hank starts to use Manny like a multi-purpose tool, like hunting for food by shooting things out of Manny's mouth, chopping wood with his arms, and lighting farts with fire. Hank puts on a shadow puppet theater performance of movies like \"Jurassic Park\" and \"E.T.\" for Manny.The two start to cross a pipe above a river. The pipe breaks, and the two fall into the river. Hank tries to get air from Manny before they are shot to the surface by Manny's farts. Hank then sticks something into Manny's mouth and shoots it out to use as a grappling hook to climb up a hill.Hank finally gets a signal on his phone. He has gotten a birthday message from his dad. He goes on Instagram and looks at Sarah's profile. She has a husband and a daughter. When Manny learns about this, he feels upset for Hank making him think that he was going to get a chance to be with Sarah. The two go up a tree when a bear shows up and claws Manny's leg. Up the tree, Manny starts crying after feeling deceived. He says he wishes he were dead again. Hank spots a town not far from where they are, and he tries to get the attention of passing cars. The branch then breaks and Hank twists his leg. The bear starts to carry him away until Manny drops from the tree and starts moving on his own. He sets one of his farts on fire and scares the bear away. Hank passes out.Hank wakes up to find Manny carrying him away from the woods and close to a house. The house is Sarah's. The two tumble down the hill in the backyard. They are met by Sarah's daughter Chrissy (Antonia Ribero). She can apparently communicate with Manny as well. Manny creeps her out with his water-puking and spontaneous boners, causing Chrissy to cry. Sarah comes out and sees Hank and Manny. Manny is no longer responsive. Sarah gets help to come.Paramedics, cops, and a news crew show up at Sarah's house. Hank's dad arrives and sees the body bag with Manny in it, thinking Hank is in there. He goes to his car and cries. The reporter starts to interview Hank over his experience. The cops then look at Hank's phone and see pictures of Sarah, which freaks her out. Hank ignores everyone and runs to Manny's body, taking it back into the woods. Everyone follows them and walks past all the things that Hank built. They make it back to the shore where Hank and Manny first washed up on. Hank doesn't want anyone to take Manny away. An officer cuffs Hank and takes him away. Some farting is heard, and everyone sees Manny moving as he farts violently. His farts then send him away across the ocean. Everyone looks confused and disturbed, except for Hank's dad, Chrissy, and Hank, who all react with a smile."
}