{
  "imdb_id": "tt4076164",
  "tmdb_id": "355998",
  "douban_id": null,
  "title": "In the Room (2015)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "Hong Kong",
  "version": [
    {
      "runtime": "104 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.7,
  "director": [
    {
      "id": "nm0451799",
      "name": "Eric Khoo"
    }
  ],
  "writer": [
    {
      "id": "nm8126983",
      "name": "Andrew Hook",
      "description": null
    },
    {
      "id": "nm6807716",
      "name": "Jonathon Lim",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0463158",
      "name": "Boon Pin Koh",
      "character": "Kong"
    },
    {
      "id": "nm2899507",
      "name": "Daniel Jenkins",
      "character": "Lawrence"
    },
    {
      "id": "nm0387319",
      "name": "Josie Ho",
      "character": "Orchid"
    },
    {
      "id": "nm9435560",
      "name": "Jean Maguire",
      "character": "Boss Lei"
    },
    {
      "id": "nm1919865",
      "name": "Gillian Tan",
      "character": "Orchid's Girl"
    },
    {
      "id": "nm1329689",
      "name": "Ian Tan",
      "character": "Damien"
    },
    {
      "id": "nm9435561",
      "name": "Nadia Ar",
      "character": "Imrah /              Hotel Maid"
    },
    {
      "id": "nm2965226",
      "name": "George Young",
      "character": "Vernon"
    },
    {
      "id": "nm9396907",
      "name": "Netnaphad Pulsavad",
      "character": "Noi"
    },
    {
      "id": "nm9435562",
      "name": "W. Leon Unaprom",
      "character": "An"
    },
    {
      "id": "nm2739561",
      "name": "Shô Nishino",
      "character": "Mariko"
    },
    {
      "id": "nm2143230",
      "name": "Lawrence Wong",
      "character": "Boon"
    },
    {
      "id": "nm6079248",
      "name": "Woo-sik Choi",
      "character": "Min-jun       (as Choi Woo-Shik)"
    },
    {
      "id": "nm3345824",
      "name": "Kkobbi Kim",
      "character": "Seo-yun"
    },
    {
      "id": "nm3014319",
      "name": "Francis Bosco",
      "character": "Foreman"
    },
    {
      "id": "nm6967069",
      "name": "Aeaw",
      "character": ""
    }
  ],
  "overview": "This sensitive and sensual film draws together several narratives spanning several decades, all of them transpiring in the same room of the same Singaporean hotel — and all of them involving sex.",
  "storyline": "All the six stories start just after the surrender of the British to Japanese troops in Singapore in 1942. All stories- involving sex, transpire in the same room of the same Singaporean hotel. Six stories of six different Japanese, British, and Chinese couples spread over several decades. Segment 1- Rubber: A gay love romance between two middle aged men - A British, who does not want to leave for England without the other and a Singaporean, who wants to stay. Segment 2 - Pussy: An experienced woman teaches some young girls how to use their sexuality against men. Segment 3 - Listen: After a band play at a hotel at a New-Year's-Eve, they go to their room and celebrate with an orgy and lots of drugs. Segment 4 - Change: A transsexual and his/her boyfriend are very excited for the next day's gender-change surgery. Segment 5 - Search: A young wife of a rich businessman spends erotic moments with her teenage lover while he is away. Segment 6 - First Time: A young woman who never had an ...",
  "plot": "In Akron, Ohio, 24-year-old Joy Newsome and her five-year-old son Jack live in a squalid shed they call Room. They share a bed, toilet, bathtub, television, and rudimentary kitchen; the only window is a skylight. They are captives of a man they call \"Old Nick\", Jack's biological father, who abducted Joy seven years prior, and routinely rapes her while Jack sleeps in the closet. She tries to stay optimistic for her son, but suffers from malnutrition and depression. She allows Jack to believe that only Room and its contents are \"real\", and that the rest of the world exists only on television.\n\nOld Nick tells Joy that he lost his job and threatens he may not be able to afford their supplies in the future. That night, Jack is overcome with curiosity and ventures out of the closet while Old Nick is asleep in bed with his mother. Joy is horrified when she awakens and sees their interaction, slapping Old Nick away. As punishment, he cuts their heat and power. Joy decides to tell Jack about the outside world; he reacts with disbelief and incomprehension, but also curiosity. She has Jack fake a fever, hoping that Old Nick will take him to a hospital where he can alert the authorities, but Old Nick says he will return the following day with antibiotics.\n\nJoy wraps Jack in carpet and has him play dead in the hope that Old Nick will remove him from Room. Falling for the ruse, Old Nick places Jack in the back of his pickup truck and drives through a residential neighborhood. Although stunned by his first exposure to the outside world, Jack jumps from the truck and attracts the attention of a passer-by. The police arrive and rescue him. Joy is found, reunited with Jack and the two are taken to the hospital.\n\nReunited with her family, Joy learns her parents have divorced and that her mother has a new partner, Leo. She returns with Jack to her childhood home where her mother and Leo reside. Her father cannot accept Jack and leaves. Jack struggles to adjust to life in the larger world, speaking only to his mother and expressing a desire to return to Room. Joy struggles with anger and depression, lashing out at her mother and becoming worried about Jack's lack of interaction with \"real\" things. At the suggestion of the family’s lawyer, Joy agrees to a television interview, but becomes upset when the interviewer questions her decision to keep the newborn Jack instead of asking Old Nick to drop him at a hospital. Overwhelmed with guilt, she attempts suicide; Jack finds her unconscious in the bathroom, and she is admitted to a hospital.\n\nJack misses his mother but begins to settle into his new life. He bonds with his new family, meets Leo's dog Seamus and makes friends with a boy his age. Believing his long hair will give Joy the strength she needs to recover, Jack has his grandmother cut it for him so he can send it to her. Joy returns home and apologizes, thanking Jack for saving her life again. At Jack's request, they visit Room one last time, escorted by police. Jack is confused; he feels it has shrunk and that it is a different place with the door open. He and Joy say their goodbyes to Room and leave.",
  "synopsis": null
}