{
  "imdb_id": "tt4085502",
  "tmdb_id": "361183",
  "douban_id": null,
  "title": "Sum of Histories (2015)",
  "genres": [
    "Drama",
    "Romance",
    "Sci-Fi"
  ],
  "country": "Belgium",
  "version": [
    {
      "runtime": "86 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.7,
  "director": [
    {
      "id": "nm0098192",
      "name": "Lukas Bossuyt"
    }
  ],
  "writer": [
    {
      "id": "nm0098192",
      "name": "Lukas Bossuyt",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm1212342",
      "name": "Leo Achten",
      "character": "Professor Theo"
    },
    {
      "id": "nm4189543",
      "name": "Charlotte Anne Bongaerts",
      "character": "Griet"
    },
    {
      "id": "nm0208642",
      "name": "Koen De Graeve",
      "character": "Viktor"
    },
    {
      "id": "nm2282375",
      "name": "Tom Hirst",
      "character": "Jef       (as Thomas Van Hulle)"
    },
    {
      "id": "nm3315962",
      "name": "Bart Hollanders",
      "character": "Dimi"
    },
    {
      "id": "nm5848899",
      "name": "Emma Kristin",
      "character": "Kind"
    },
    {
      "id": "nm8927677",
      "name": "Robbe Nevens",
      "character": "Viktor (age 8)"
    },
    {
      "id": "nm1683009",
      "name": "Matteo Simoni",
      "character": "Tom"
    },
    {
      "id": "nm0810722",
      "name": "Karina Smulders",
      "character": "Lena"
    },
    {
      "id": "nm7228564",
      "name": "Polleke van der Sman",
      "character": "Lena (age 10)"
    },
    {
      "id": "nm3363061",
      "name": "Xandra Van Welden",
      "character": "Mama Viktor"
    },
    {
      "id": "nm1613524",
      "name": "Robrecht Vanden Thoren",
      "character": "Titus"
    }
  ],
  "overview": "What would you do if you could change the past?",
  "storyline": "What would you do if you could change the past?",
  "plot": "In 1973, during the Yom Kippur War, an Israeli A-4 Skyhawk jet carrying a nuclear weapon is shot down; 29 years later, a Syrian scrap collector uncovers a large unexploded bomb buried in a field in the Golan Heights. He sells it to a South African black market arms trafficker named Olson, who recognizes it as the nuclear bomb that was lost during the war. He then sells it to a far-right group led by Austrian billionaire and neo-Nazi Richard Dressler. Dressler's aim is to start a nuclear war between the United States and Russia that will devastate them both, and leave a united Fascist Europe to rule the world.\n\nCIA analyst Jack Ryan is summoned by CIA Director William Cabot to accompany him to Russia to meet President Nemerov. In Moscow, Cabot and Ryan are allowed to examine a Russian nuclear weapons facility as prescribed by the START treaty, where Ryan notices the absence of three scientists listed on the facility's roster. Cabot sends operative John Clark to Russia to investigate. Clark tracks the missing scientists to a former Soviet military facility in Ukraine, where Cabot suspects they are building a secret nuclear weapon that Russia could use without any way to trace it back to them.\n\nRyan and his colleagues discern that a crate from the facility in Ukraine was flown to the Canary Islands, then sent to Baltimore on a cargo ship. Ryan warns Cabot, who is attending a football game in Baltimore with the President, about a bomb threat. The President is evacuated before the bomb detonates, but the city is destroyed. To escalate the situation, a corrupt Russian Air Force general who has been paid by Dressler sends Tu-22M Backfires to attack a U.S. aircraft carrier in the North Sea.\n\nRyan learns from the radiation assessment team that the isotopic signature from the nuclear blast pinpoints it as having been manufactured at the Savannah River Site in South Carolina in 1968; evidence which seems to exonerate the Russians. In Syria, Clark tracks down Ghazi, one of the men who found the bomb, now dying of radiation exposure. He tells Clark that he sold the bomb to Olson, who lives in Damascus. Ryan's colleagues at Langley infiltrate Olson's computer and download files that implicate Dressler as the person who bought the plutonium and who is behind the Baltimore attack.\n\nRyan is able to reach the National Military Command Center in The Pentagon and get a message to Nemerov, saying that he knows that Russia was not behind the attack, while also asking Nemerov to stand down his forces as a show of good faith. Nemerov agrees to do so as President Fowler follows suit. The participants in the conspiracy, including Dressler, are assassinated. Presidents Fowler and Nemerov announce new measures to counter nuclear proliferation in joint speeches at the White House, as Ryan and his fiancee Dr. Catherine Muller listen in.",
  "synopsis": "The story begins in a hospital in 2013 when little Viktor (8) pays a visit to his friend Lena (10). He promises her to create a time machine that will enable him to go back in time and stop the car that ran her over.When, 25 years later, Viktor discovers a way to send e-mails back in time, he finally has the opportunity to prevent the accident. But Viktor is hesitant: is this what Lena would want? Viktor and the beautiful Lena are together and expecting their first child. Lena is happy and changing the past comes with a certain risk.Only when Lena is humiliated on account of her disability does an emotional Viktor decide to send an e-mail to 2013. He asks a young man, Tom (21), to stop the car that will run over Lena. But it does not go according to plan. The car changes course and instead of little Lena, Tom's girlfriend is run over and killed.25 years later, the repercussions of this accident are great. Indeed, Lena is no longer in a wheelchair but she is also no longer with Viktor, but with Tom. The unknowing Viktor leads a quiet and slightly lonely life. He is still secretly in love with Lena but he knows he doesn't stand a chance with her.One day, a former assistant of Viktor's tells him about the e-mail and its impact on his life. Viktor's world comes crashing down. The realization that he used to be with Lena and that he is responsible for this new reality is unbearable. Viktor decides to take action. He intends to eliminate Tom, who stole Lena from him, and for the second time he sends an e-mail into the past.\nBut again, it does not go according to plan. Will Lena and Viktor ever be together again?"
}