{
  "imdb_id": "tt4047104",
  "tmdb_id": "307002",
  "douban_id": null,
  "title": "Enakkul Oruvan (2015)",
  "genres": [
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "136 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.8,
  "director": [
    {
      "id": "nm6780137",
      "name": "Prasad Ramar"
    }
  ],
  "writer": [
    {
      "id": "nm5237694",
      "name": "Pawan Kumar",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1413459",
      "name": "Siddharth",
      "character": "Vicky /              Vignesh"
    },
    {
      "id": "nm4715473",
      "name": "Deepa Sannidhi",
      "character": "Divya"
    },
    {
      "id": "nm6686507",
      "name": "Srushti Dange",
      "character": ""
    },
    {
      "id": "nm1559782",
      "name": "Ajay Ratnam",
      "character": "Police Officer"
    },
    {
      "id": "nm3682633",
      "name": "John Vijay",
      "character": "Vajravelu"
    },
    {
      "id": "nm4861046",
      "name": "Aadukalam Naren",
      "character": "Durai       (as Narein)"
    },
    {
      "id": "nm6106368",
      "name": "Munishkanth",
      "character": "Drug Dealer       (as Ramdoss)"
    },
    {
      "id": "nm2909348",
      "name": "Yog Japee",
      "character": "Gun Man"
    },
    {
      "id": "nm5650589",
      "name": "Nalan Kumarasamy",
      "character": "Special Appearance"
    },
    {
      "id": "nm7255526",
      "name": "Srinivas Kavinayam",
      "character": "Special Appearance"
    },
    {
      "id": "nm6916925",
      "name": "Udhayabanu Maheshwaran",
      "character": "Raghavan"
    },
    {
      "id": "nm1686044",
      "name": "Mahadevan",
      "character": "Moneylender"
    },
    {
      "id": "nm6662210",
      "name": "Mippu",
      "character": "Drug Dealer"
    },
    {
      "id": "nm5296950",
      "name": "Vettri",
      "character": ""
    },
    {
      "id": "nm4533261",
      "name": "Amit Bhargav",
      "character": "Actor"
    }
  ],
  "overview": "A man suffering from insomnia is tricked into buying a drug, Lucia, that makes his desires come true in his dreams, blurring the line between fantasy and reality.",
  "storyline": "A man suffering from Insomnia gets introduced to pills that allow him to cultivate and experience lucid dreams that could continue with interruptions too. With each real-life character that has caused an impact in him getting a parallel in his dream, the distinction between reality & dream thins out and that consumes him. The final act on how he gets out of it brings the curtains down with a wonderful little perspective brought to note.",
  "plot": "The plot is non-linear, and the end scene of the film shows the real beginning of the story.The plot starts with the protagonist being in a state of coma and continuing only on life support. The film, from the beginning, tells two stories of the same person, one in colour and the other in black and white.\n\nA detective from Mumbai crime branch starts investigating the incident that caused the protagonist's (Siddharth) current state. The Detective going through his belongings stumbles upon some scribbled notes and a mysterious pill. Meanwhile, police capture two suspects and interrogate them for information.\n\nThe story starts with Vicky who is from a village and working as an Usher/\"torch-shiner\" in a movie theatre owned by Durai (Aadukalam Naren). Vicky suffers from insomnia. On one of his sleepless nights Vicky is contacted by a drug dealer who gives him Lucia pills as a solution to his sleeping problems. This drug is said to have the capability to help one dream the life they want but has the side-effect, that on discontinuation the same dreams shall turn into a nightmare.\n\nWith the help of the Lucia pills, Vicky starts seeing himself as being a successful actor called Viknesh surrounded by people he knows in the real world. Film actor Viknesh's life is depicted in black-and-white. Durai, the theater owner where Vicky works, had directed a film in his youth produced by a thug, who now wants Durai to sign off his theatre for his debt. In the black-and-white life, Viknesh and Durai gets a number of death threats from a person. More events from the dream are followed by similar events in reality as Vicky falls in love with Divya (Deepa Sannidhi) who is a model in the dream and a waitress in reality.\n\nIn the dream, Viknesh and Divya hit it off easily at the beginning but later friction arises when Viknesh expresses his discontent on Divya working in film industry. Meanwhile, in reality, Vicky struggles to win Divya's heart, who rejects him first due to his low salary and falls later for his humble character. Divya's attempts to get Vicky educated and lead him to earn a better job turns out to be futile and also results in death of Durai in the hands of goons. Frustrated, Vicky chooses to leave Divya and continue to work in the theatre, despite the threats. Vicky and his foreign friends redecorate the theatre and release Durai's film to the audience. He later reconciles with Divya, who agrees to marry him.\n\nIn the dream, Durai is kidnapped, and Viknesh rescues him with the help of police. In the process, all of the goons are either arrested or killed except for the contract killer. Viknesh feels Durai is not safe with him and decides to fire him. Viknesh breaks up with Divya and sends off all his servants so as to be alone. Later, a visually disturbed Viknesh finds himself in a thrashed room. Viknesh gets hold of the torch and through its light sees the \"torch-shiner\" Vicky inspecting the screen of the theatre.\n\nDivya misses Viknesh and tries to get back with him but Viknesh is in his own shell and shuts out everyone from his life. Divya receives an unexpected call from Viknesh some days later and he asks her to meet him. He tells her that he cannot decide if the present moment is a dream or reality but he is ultimately happy. He says that he should not confuse his dreams and real life. Asking Divya to close her eyes, Viknesh jumps off the roof to the confusion of everyone present, including the contract killer waiting to kill him.\n\nAt present, the detective with the help of the suspects, performs a sting operation on the drug dealer and learns more about the Lucia pills. Meanwhile, Divya is caught in an attempt to kill Viknesh by pulling him off life support. During her interrogation, the whole investigating team along with Divya watches a re-run of an interview of the film star Viknesh. In the interview, Viknesh expresses his dissatisfaction of the stardom and reveals that he is actually color blind from an accident in his childhood. He tells the interviewer that he dreams of being a normal person and in fact in one of his dreams he is a \"torch-shiner\" who gets no attention from people and is happily in love with the dream of his life.\n\nThe detective is now convinced that Viknesh is living in his own versions of reality and chose to be in his dream over the real world by attempting suicide. Divya cries near a comatose Viknesh in the hospital and simultaneously Vicki is shown happily married to Divya and have a daughter. Viknesh's health begins to deteriorate and the doctors attempt to defibrillate him. Simultaneously, Vicky, aware and alive in his dream world finds everything disappearing around him and is killed by a shot to the head. Viknesh wakes up from his coma to see the astonished doctors and Divya and Durai's relieved faces.",
  "synopsis": null
}