{
  "imdb_id": "tt4029408",
  "tmdb_id": "395740",
  "douban_id": null,
  "title": "R.E.M. (2015)",
  "genres": [
    "Drama",
    "Sci-Fi",
    "Thriller"
  ],
  "country": "Hungary",
  "version": [
    {
      "runtime": "78 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm6763133",
      "name": "Szilárd Molnár"
    }
  ],
  "writer": [
    {
      "id": "nm6763133",
      "name": "Szilárd Molnár",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm6763134",
      "name": "Gergely Orbán",
      "character": "Joe"
    },
    {
      "id": "nm6763135",
      "name": "Tamás Pavlics",
      "character": "Márk"
    },
    {
      "id": "nm6763136",
      "name": "Noémi Sárog",
      "character": "Kata"
    },
    {
      "id": "nm6763137",
      "name": "Gábor Pál Gelencsér",
      "character": "Díler #1"
    },
    {
      "id": "nm6430313",
      "name": "Gergely Garamszegi",
      "character": "Díler #2"
    },
    {
      "id": "nm6763140",
      "name": "Dániel Becságh",
      "character": "Joe haverja"
    },
    {
      "id": "nm6763139",
      "name": "László Benkö",
      "character": "Kissrác"
    },
    {
      "id": "nm6763138",
      "name": "Dávid Bánkuti",
      "character": "X"
    },
    {
      "id": "nm6763143",
      "name": "Sándor Gál",
      "character": "Rendör"
    },
    {
      "id": "nm5851092",
      "name": "Dávid Kiss",
      "character": "Peti       (voice)"
    },
    {
      "id": "nm6763142",
      "name": "Emília Kálnoky",
      "character": "Kislány"
    },
    {
      "id": "nm6763141",
      "name": "Zsuzsanna Vörös",
      "character": "Kata barátnöje"
    }
  ],
  "overview": "Two addicts discover that exploring other people's dreams with the help of a machine can beat any drug. But the process holds more danger for both dreamer and \"dreamwalker\" than they could imagine.",
  "storyline": "Two addicts discover that exploring other people's dreams with the help of a machine can beat any drug. But the process holds more danger for both dreamer and \"dreamwalker\" than they could imagine.",
  "plot": null,
  "synopsis": "Joe and Mark just became neighbours. Joe is on his way home from a drug rehab, Mark recently moved back to Hungary after he had been fired from a Swiss research institute. But as an illegal parting gift, he took his research subject with him: a machine that he hopes he can use to read minds. Mark knows nobody back home, so he asks Joe to participate in his experiment, and though at first Joe doesn't want to participate, eventually he gives in.\nThey soon realize that the signals of the awake mind are too strong, and thereby endangering the receiver's health. So they try something new: using the machine while the subject is dreaming. Mark experiences the \"dreamwalking\", but he doesn't just see the dream, but everything that happens to Joe in it, affects Mark's body too. They find out that to achieve the ultimate experience, they need to get the subject in a euphoric state - either with booze or drugs. Not wanting to take the risks, they sneak into a neighbour girl's, Kata's apartment, and start experimenting on her. They even purchase a drug called FBA, which is meant to keep the subject in R.E.M. phase, thus avoiding intermission between dreams for the receiver. One side effect of this is extreme exhaustion, therefore Mark wants to stop, but Joe disagrees with him and continues the dreamwalking. Eventually, Kata dies and Mark is eager to finish the whole experiment, but Joe, suffering from the withdrawal symptoms, doesn't let him. Mark offers him help to stop, but actually he lures the desperate Joe into his lucid dream. In the dream, Mark fakes his own death and sets a violent thug after Joe, who even seems to see Kata's ghost at one point. Joe eventually can't take it, so obviously he turns to the drugs and overdoses himself.\nMark wakes up from his dream, and leaves Joe's apartment with the dead body inside."
}