{
  "imdb_id": "tt4047112",
  "tmdb_id": "294655",
  "douban_id": null,
  "title": "Jeeva (2014)",
  "genres": [
    "Drama",
    "Sport"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "127 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm3607398",
      "name": "Suseenthiran"
    }
  ],
  "writer": [
    {
      "id": "nm6791986",
      "name": "Santhosh",
      "description": "dialogue"
    },
    {
      "id": "nm3607398",
      "name": "Suseenthiran",
      "description": "as Susindran"
    }
  ],
  "cast": [
    {
      "id": "nm3684167",
      "name": "Vishnu Vishal",
      "character": "Jeeva"
    },
    {
      "id": "nm4248233",
      "name": "Sri Divya",
      "character": "Jenny       (as Sree Divya)"
    },
    {
      "id": "nm4262344",
      "name": "Soori",
      "character": "David"
    },
    {
      "id": "nm6780151",
      "name": "Lakshman Narayan",
      "character": "Ranjith"
    },
    {
      "id": "nm6474455",
      "name": "Sanyathara",
      "character": ""
    },
    {
      "id": "nm1706602",
      "name": "Charlie",
      "character": "Arul Pragasam"
    },
    {
      "id": "nm6780152",
      "name": "V. Madhusudhan Rao",
      "character": ""
    },
    {
      "id": "nm6916922",
      "name": "Marimuthu",
      "character": ""
    },
    {
      "id": "nm3163698",
      "name": "T. Siva",
      "character": "Jenny's Father"
    },
    {
      "id": "nm6916923",
      "name": "R. Ravi",
      "character": ""
    },
    {
      "id": "nm6916924",
      "name": "Muthuraman",
      "character": ""
    },
    {
      "id": "nm6916925",
      "name": "Udhayabanu Maheshwaran",
      "character": "Raghavan"
    },
    {
      "id": "nm6064238",
      "name": "Bava Lakshmanan",
      "character": ""
    },
    {
      "id": "nm5879936",
      "name": "Ramnath Shetty",
      "character": ""
    },
    {
      "id": "nm6916926",
      "name": "Nandhakumar",
      "character": ""
    },
    {
      "id": "nm6916927",
      "name": "Anjali Varadharajan",
      "character": "Jenny's Mother"
    },
    {
      "id": "nm6612961",
      "name": "Rindhu Ravi",
      "character": ""
    },
    {
      "id": "nm6916928",
      "name": "Sreeja Ravi",
      "character": "Ranjith's Mother"
    },
    {
      "id": "nm6835494",
      "name": "Akhila",
      "character": "Jeeva's Sister"
    },
    {
      "id": "nm6916929",
      "name": "Monica",
      "character": ""
    },
    {
      "id": "nm6916930",
      "name": "Darsha",
      "character": ""
    },
    {
      "id": "nm5877628",
      "name": "Master Adithya",
      "character": ""
    },
    {
      "id": "nm0536820",
      "name": "J. Mahendran",
      "character": "(as Mahendran)"
    },
    {
      "id": "nm6916931",
      "name": "Tamil",
      "character": ""
    },
    {
      "id": "nm6916932",
      "name": "Rahul",
      "character": ""
    },
    {
      "id": "nm0836991",
      "name": "Nataraja Subramanian",
      "character": "Cameo appearance"
    },
    {
      "id": "nm1951127",
      "name": "Arya",
      "character": "Cameo appearance       (as Aarya)"
    },
    {
      "id": "nm6120872",
      "name": "Surabhi",
      "character": "Cameo appearance"
    },
    {
      "id": "nm4442569",
      "name": "Joy Badlani",
      "character": "Alok"
    },
    {
      "id": "nm6109980",
      "name": "Sanjay Bharathi",
      "character": "DCA Captain"
    },
    {
      "id": "nm2533953",
      "name": "G. Marimuthu",
      "character": ""
    }
  ],
  "overview": "Jeeva is the story about an ardent cricket fan and his dream to play international matches. How he manages to balance his love life and achieve his cricketing dreams forms the plot of the movie.",
  "storyline": "Right from his childhood, the motherless Jeeva grows with his focus fully on Cricket. However, it is never smooth sailing for him with disruptions coming in various forms ranging from his love life to team selection politics.",
  "plot": "This film is about a young aspiring Cricketer Jeeva, who dreams of playing for the India national cricket team one day. The films begins with Jeeva, sitting in a park bench and starts to narrate his life story. He is a lower middle class boy,who from the very young age is interested in cricket. He sees Sachin Tendulkar as his idol. Though his father initially does not support him, he later starts to do so on the request of his friend. Jeeva grows up and becomes a part of the school team. He excels in his game and turns out to be a star player. Seeing his performances, a local cricket club offers him a chance to join and train with them,for which his father disagrees saying that his academic performance is poor due to cricket and he may not get a job in future. In between Jeeva falls in love with his neighbour girl and they are broken up when their family comes to know about this. Jeeva starts to drink due to this heartbreak. So to make him concentrate on good deeds again, Jeeva's father agrees to let him join the cricket club.\n\nJeeva becomes a sensation at the club, scoring good runs in every game.His opening Partner Ranjith initially has ego clashes with Jeeva, but later they become close friends and produce great performances.They both develop and their team starts to enter higher division competitions.Then comes the tournament that selects the players for the Tamil Nadu Ranji Trophy team and as expected both Jeeva and Ranjith get selected. But the real trouble starts after joining the Team. The Tamil Nadu team mostly comprises players from Brahmin community and since Jeeva and Ranjith are from a different community, they are sidelined for most of the games.They are given chances in tough conditions where its hard to score more runs.But still they manage to put up a decent performance. Jeeva even once gets applauded by Irfan, the Captain of the Rajasthan team, who is a veteran national team member.But getting dropped in the upcoming games affects their average and their subsequent chances of getting into the team for future games. Angered by being rejected from the team, Ranjith storms into the Association office and blasts at the chairman for showing partiality towards Brahmin community and leaves with a heavy heart. Both Jeeva and Ranjith feel that their cricketing career is over. Ranjith commits suicide and Jeeva is heartbroken. In the meantime, Jeeva's school time crush Jenny meets him back and they start loving again. Her Father even agrees for their marriage and promises a job for Jeeva, provided he converts to Christianity and quits Cricket. Jeeva initially agrees but immediately tells Jenny that he cannot live without Cricket. Jeeva returns to training and he practices even harder waiting for a magic to happen that will revive his cricketing career.\n\nAnd the magic happens after sometime, when the his Coach gets a call from the Rajasthan CPL(ipl) team franchise, to offer Jeeva a chance to play in the upcoming season of CPL. Jeeva comes to know that it was Irfan, the Rajasthan Team Captain who applauded him during the Ranji Trophy match, has suggested his name for the CPL. Jeeva is awestruck. He is extremely happy as his coach tells that if he performs well in the CPL, he can directly enter the National team. Jeeva Runs home with tears of joy.\n\nThe story comes back to the present, where Jeeva actually gives interview to TV channels, as a star player of the national cricket team. He narrates his experience on his debut CPL match, where he smashes the very first ball he faces for a Sixer, and he puts up a great performance time and again which seals his place in the national team. Jeeva ends his interview by saying that \"in other countries, players lose by playing; But only in India, the players lose even without getting a chance to participate\".",
  "synopsis": null
}