{
  "imdb_id": "tt4044970",
  "tmdb_id": "281139",
  "douban_id": null,
  "title": "Salute! Sun Yat",
  "genres": [
    "Drama"
  ],
  "country": "Taiwan",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.0,
  "director": [
    {
      "id": "nm0947140",
      "name": "Chih-yen Yee"
    }
  ],
  "writer": [
    {
      "id": "nm0947140",
      "name": "Chih-yen Yee",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3214105",
      "name": "Bryan Shu-Hao Chang",
      "character": ""
    },
    {
      "id": "nm1534398",
      "name": "Hsiao-chuan Chang",
      "character": ""
    },
    {
      "id": "nm5356727",
      "name": "Honduras",
      "character": ""
    },
    {
      "id": "nm6050666",
      "name": "Wei-Jie Hu",
      "character": ""
    },
    {
      "id": "nm3191792",
      "name": "River Huang",
      "character": ""
    },
    {
      "id": "nm4193385",
      "name": "Chien-Na Lee",
      "character": ""
    },
    {
      "id": "nm7833436",
      "name": "Sean Shih",
      "character": ""
    },
    {
      "id": "nm6812012",
      "name": "Matthew Han-Ting Wei",
      "character": ""
    },
    {
      "id": "nm6924236",
      "name": "Shu-Chun Yang",
      "character": ""
    },
    {
      "id": "nm6924234",
      "name": "Huai-Yun Zhan",
      "character": ""
    }
  ],
  "overview": "Lefty sees himself as the poorest high school student in Taipei. To make some money, he plans to steal the abandoned Dr. Sun Yat-Sen statue in the school storage room.  Lefty plots, but he never sees his rival,Sky coming.  Sky also considers himself as the poorest high school student in Taipei.  Meeting Dr Sun from Ablaze ImageHe has the same plan in mind to steal Dr. Sun Yat-Sen for his own sake, but he also never sees Lefty coming.  When two teams of Taipei’s poorest high school students meet on campus one night, a war erupts. This is a war of losers and a war eventually makes both Lefty and Sky question their destined poverty and social class. “Not the statue but something more substantial we have to claim.” Finally this time on the quiet night campus the seeds of revolution planted by Dr. Sun decades ago may get to sprout.",
  "storyline": "Lefty, seeing himself as the poorest high-school student in Taipei, plots a way to earn more money. He decides to steal the Dr. Sun Yat-sen statue abandoned at his school and sell it for cash. However, when Lefty and his gang embark on the heist, they chance upon another group of teens, led by Sky, and with the same goal in mind. Now it's a battle of wits.",
  "plot": null,
  "synopsis": null
}