{
  "imdb_id": "tt4076980",
  "tmdb_id": "321621",
  "douban_id": null,
  "title": "The Throwaways (2015)",
  "genres": [
    "Action",
    "Comedy",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.4,
  "director": [
    {
      "id": "nm0004784",
      "name": "Tony Bui"
    }
  ],
  "writer": [
    {
      "id": "nm0743683",
      "name": "Michael Arlen Ross",
      "description": "written by and"
    },
    {
      "id": "nm0359534",
      "name": "Don Handfield",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0111730",
      "name": "Peter Brooke",
      "character": "Agent Langstrom"
    },
    {
      "id": "nm0001001",
      "name": "James Caan",
      "character": "Holden"
    },
    {
      "id": "nm0164929",
      "name": "Noel Clarke",
      "character": "Erik"
    },
    {
      "id": "nm0001143",
      "name": "Kevin Dillon",
      "character": "Fisher"
    },
    {
      "id": "nm0195928",
      "name": "Darrell D'Silva",
      "character": "Konstantin"
    },
    {
      "id": "nm0304282",
      "name": "Valentin Ganev",
      "character": "Bulgarian Official"
    },
    {
      "id": "nm0359534",
      "name": "Don Handfield",
      "character": "US Embassy Station Chief       (as E.D. Handfield)"
    },
    {
      "id": "nm2361583",
      "name": "Christian Hillborg",
      "character": "Dmitri"
    },
    {
      "id": "nm0403134",
      "name": "Sam Huntington",
      "character": "Drew"
    },
    {
      "id": "nm1788870",
      "name": "Nikolai Ilchev",
      "character": "Vitally"
    },
    {
      "id": "nm4477836",
      "name": "Jack Kesy",
      "character": "Connelly"
    },
    {
      "id": "nm0458136",
      "name": "Scott Klace",
      "character": "Benson"
    },
    {
      "id": "nm2692146",
      "name": "Katie McGrath",
      "character": "Gloria"
    },
    {
      "id": "nm0706666",
      "name": "Bashar Rahal",
      "character": "The Broker"
    },
    {
      "id": "nm3533342",
      "name": "Amber Jean Rowan",
      "character": "Bes"
    },
    {
      "id": "nm1284482",
      "name": "Atanas Srebrev",
      "character": "Princeton"
    },
    {
      "id": "nm3795611",
      "name": "Alfie Stewart",
      "character": "Teebs"
    },
    {
      "id": "nm2190910",
      "name": "Leanne Suter",
      "character": "Chicago News Reporter"
    },
    {
      "id": "nm7523296",
      "name": "Rossen Traykov",
      "character": "US Embassy Employee"
    }
  ],
  "overview": "Notorious hacker Drew Reynolds is captured by the CIA and given a proposition - work for them or spend the rest of his life in prison. Agreeing on the condition that he can form his own team, he puts together a group of \"throwaways\" - the people deemed expendable and seemingly the worst in the organization.",
  "storyline": "Notorious hacker Drew Reynolds is captured by the C.I.A. and given a proposition, work for them, or spend the rest of his life in prison. Agreeing on the condition that he can form his own team, he puts together a group of \"throwaways\", people deemed expendable, and seemingly the worst in the organization.",
  "plot": "When the infamous hacker Drew Reynolds is captured by the CIA, he is faced with a choice. Either to spend his life in jail or work for them. Reynolds agrees to work for the CIA should he be able to form his own squad team called the \"Throwaways\", this team was seen as expendable and deemed the worst in the whole organisation.\n\nThe film opens with lone wolf patriot blackjack hacker Drew Reynolds living in solitude and doing what he does best: hacking anyone he feels is a threat to the America and the free world, including various jihadist and other terrorist organizations and straw militia groups. His friend in cybersecurity, Erik, alerts him that the CIA has tracked him down and though he manages to briefly elude them, he is captured. Upon meeting with him, Agents Holden (a former mentor of Drew) and Connelly offer him a deal: spend 30 years to life in prison or work for them to catch an even greater threat. An unidentified hacker has somehow managed to tap into Chicago's power grid using a volatile program known as \"Pantheon\" and shut it down completely thanks to a special encryption key that allows him access to the entire Internet and World Wide Web and beyond. If this device gets into the wrong hands, the entire world will be at the mercy of any number of terrorists, most likely the highest bidder. Offered a deal where he could forego a possible life sentence if he agrees to use his expertise to locate this hacker, Drew accepts in exchange for total immunity on one condition: he picks the team of experts he will be working with.\n\nOver the reservations of Connelly and Holden, Drew picks three agents who had been deemed as \"Throwaways\" based on their lack of success or other factors: Dan Fisher, a short tempered and violence-prone ex-agent who's been relegated to basement duty; Gloria Miller, a \"swallow\" agent who successfully seduces her marks but is nonetheless not taken seriously by her cohorts; and Dmitri Stanislav, a cowardly ex-KGB Russian with a history of deserting his comrades (including Fisher at one point) on dangerous missions. As the mission progresses the team are able to learn that the hacker in question is Teebs, a young anarchist who intends to sell the key on the black market to the highest bidder, who ends up being a pro-Soviet Russian defector named Olag Constantin. It is also revealed that Drew faked the algorithm process by which he chose his team; he simply read their files and selected them based on their shoddy records hoping that the mission would end in failure. With his immunity deal having already been signed, Drew could then go back to working alone. The others discover this following an assassination attempt on Holden, after which Connelly disbands the team but commends them for proving far more successful than he'd previously thought they would be. Furious, Fisher, Gloria, and Dmitri leave in a huff.\n\nShortly after, a failed raid to apprehend Teebs's and Constantin's broker results in Connelly and his team being killed. Drew has Erik pull up everything he can on Teebs while at the same time, Holden identifies one of the assassins who murdered Connelly and his team as Bes, a chameleon agent posing as Teebs's girlfriend who is under Constantin's employ. Shortly afterward, Teebs reactivates Pantheon at Constantin's order, causing Bulgaria to experience total blackout. Thanks to Erik's help, Drew is able locate Teebs and after an apology followed by a rousing pep talk, he and Holden are able to convince their former team members to return and finish the mission.\n\nOnce the team is back together, they sneak into Constantin's headquarters. Drew finds Teebs and tries to convince him to hand over the key. Teebs attacks him instead, but drops the key when Drew shoots him, destroying it and forcing Drew to bypass the hardwired encryption in order to restore Bulgaria's power and prevent a lethal gas valve failure. Gloria, Fisher, and Dmitri take on Constantin and his men in a lengthy and caper-filled confrontation. Gloria manages to kill Bes while Dmitri and Fisher are able to take out Constantin and the soldiers with an RPG launcher.\n\nTheir mission a success, Drew is made an official CIA agent under Holden's command and is teamed up with the now fully reestablished agents before they eagerly head out on their next mission. Meanwhile, a post-credits scene shows Teebs retrieving another Pantheon key from a strongbox in an unknown location.",
  "synopsis": null
}