{
  "imdb_id": "tt4019666",
  "tmdb_id": "329639",
  "douban_id": null,
  "title": "Love Stories (2016)",
  "genres": [
    "Comedy",
    "Romance"
  ],
  "country": "Brazil",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.2,
  "director": [
    {
      "id": "nm1988881",
      "name": "Tomas Portella"
    }
  ],
  "writer": [
    {
      "id": "nm1252328",
      "name": "Tatiana Maciel",
      "description": "screenplay and"
    },
    {
      "id": "nm5454868",
      "name": "Célio Porto",
      "description": "screenplay"
    },
    {
      "id": "nm0266045",
      "name": "Adriana Falcão",
      "description": "story editor"
    },
    {
      "id": "nm7288036",
      "name": "Pedro Carvalhaes",
      "description": "story"
    }
  ],
  "cast": [
    {
      "id": "nm2366126",
      "name": "Gregório Duvivier",
      "character": "Eduardo /              Duca"
    },
    {
      "id": "nm3747235",
      "name": "Dani Calabresa",
      "character": "Viviane"
    },
    {
      "id": "nm2274746",
      "name": "Clarice Falcão",
      "character": "Bárbara"
    },
    {
      "id": "nm0142317",
      "name": "Marcos Caruso",
      "character": "Miguel"
    },
    {
      "id": "nm5716139",
      "name": "Júlia Rabello",
      "character": ""
    },
    {
      "id": "nm3020327",
      "name": "Rafael Infante",
      "character": "Marceleza"
    },
    {
      "id": "nm3740655",
      "name": "Luis Lobianco",
      "character": ""
    },
    {
      "id": "nm3479264",
      "name": "Verônica Debom",
      "character": ""
    },
    {
      "id": "nm6379516",
      "name": "Daniel Duncan",
      "character": "Charles"
    },
    {
      "id": "nm3924575",
      "name": "Paulo Leal",
      "character": ""
    },
    {
      "id": "nm0688982",
      "name": "Zezé Polessa",
      "character": "Dona Yvonne"
    },
    {
      "id": "nm3474793",
      "name": "Carol Portes",
      "character": ""
    }
  ],
  "overview": null,
  "storyline": "Eduardo discovers he has a split personality: a buttoned-up São Paulo executive and beach-loving weekend playboy in Rio de Janeiro called Duca. Unconsciously, he becomes entangled with a woman although he's already engaged to another.",
  "plot": "Oliver Barrett IV comes from an American upper-class East Coast family and is heir to the Barrett fortune. He attends Harvard University, where he is very active in ice hockey. At the library, Oliver meets Jennifer \"Jenny\" Cavalleri, a quick-witted, working-class Radcliffe College student of classical music. She mocks him, calling him \"preppy\" and \"jock.\" Oliver finds charm and truth in her comments. They quickly fall in love, despite their differences.\n\nJenny reveals her plans for the future, which include studying in Paris. Oliver is upset that he does not figure in those plans. He wants to marry Jenny and proposes. After she accepts, she is driven to the Barrett mansion to meet the old guard parents. Oliver reassures her that their class differences won't matter. However, his parents are clearly not impressed and are judgmental. Later, at the Harvard club Oliver's father tells him that he will cut him off financially if he marries Jenny. Oliver storms out of the dining hall. Upon graduation from college, the two students decide to marry against the wishes of Oliver's father, who severs ties with his son. The wedding is modern and contains no religious denomination. Jenny's widowed father attends, although he also has concerns about their social differences.\n\nWithout his father's financial support, the couple struggle to pay Oliver's way through Harvard Law School. Jenny gets work as a private-school teacher. They rent the top floor of a triple decker near the Law School. Oliver graduates third in his class, winning $500, and takes a position at a respectable New York law firm. They eventually move into a doorman building, which contrasts greatly with their Cambridge digs. The 24-year-olds are ready to start a family, but when they fail to conceive they consult a medical specialist. After many tests, Oliver is informed that Jenny is terminally ill. Her exact condition is never stated explicitly, but she appears to have leukemia (confirmed by Oliver in the sequel Oliver's Story).\n\nAs instructed by his doctor, Oliver attempts to live a \"normal life\" without telling Jenny of her condition, but she finds out after confronting her doctor about her recent illness. Oliver buys tickets to Paris but she declines, wanting only time with him. Soon after she begins costly cancer therapy, Oliver is desperate enough over the mounting expenses to seek financial relief from his father. The senior Barrett asks what the money request of $5,000 is for, but Oliver will only say that it's \"personal\". His father asks if he's \"gotten a girl in trouble\". Oliver, not wanting to admit the truth, says yes to this scenario. His father writes him a check.\n\nFrom her hospital bed, Jenny makes funeral arrangements with her father, then asks for Oliver. She tells him to not blame himself, insisting that he never held her back from music and it was worth it for the love they shared. Jenny's last wish is made when she asks him to embrace her tightly before she dies. As grief-stricken Oliver leaves the hospital, he sees his father outside, having rushed to New York City from Massachusetts as soon as he heard the news about Jenny and wanting to offer his help. Oliver tells him, \"Jenny's dead,\" and his father says \"I'm sorry,\" to which Oliver responds, \"Love-- Love means never having to say you're sorry.\" Oliver walks back alone to the outdoor ice rink, where Jenny had watched him skate the day she was hospitalized.",
  "synopsis": null
}