{
  "imdb_id": "tt4058218",
  "tmdb_id": "360994",
  "douban_id": null,
  "title": "Love at First Child (2015)",
  "genres": [
    "Comedy",
    "Romance"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "91 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm1199305",
      "name": "Anne Giafferi"
    }
  ],
  "writer": [
    {
      "id": "nm1199305",
      "name": "Anne Giafferi",
      "description": "dialogue"
    },
    {
      "id": "nm1199305",
      "name": "Anne Giafferi",
      "description": "screenplay"
    },
    {
      "id": "nm0494504",
      "name": "Anne Le Ny",
      "description": "collaboration"
    },
    {
      "id": "nm1909070",
      "name": "Murielle Magellan",
      "description": "play"
    }
  ],
  "cast": [
    {
      "id": "nm0141140",
      "name": "Isabelle Carré",
      "character": "Gabrielle"
    },
    {
      "id": "nm0115730",
      "name": "Patrick Bruel",
      "character": "Ange"
    },
    {
      "id": "nm1295721",
      "name": "Alice de Lencquesaing",
      "character": "Claire"
    },
    {
      "id": "nm4552893",
      "name": "Thomas Solivérès",
      "character": "Simon"
    },
    {
      "id": "nm0290420",
      "name": "Carole Franck",
      "character": "Caroline, la collègue pharmacienne"
    },
    {
      "id": "nm0830802",
      "name": "Laurent Stocker",
      "character": "Guillaume"
    },
    {
      "id": "nm1051119",
      "name": "Éric Naggar",
      "character": "Le médecin"
    },
    {
      "id": "nm2792026",
      "name": "Lionel Auguste",
      "character": "Le patron du bar"
    },
    {
      "id": "nm2331206",
      "name": "Satya Dusaugey",
      "character": "L'arbitre de foot"
    },
    {
      "id": "nm0239428",
      "name": "Jean-Paul Dubois",
      "character": "Le maire"
    },
    {
      "id": "nm5240127",
      "name": "Louise Coldefy",
      "character": "Elodie"
    },
    {
      "id": "nm6212638",
      "name": "Charlotte Mangel",
      "character": "Sylvia"
    },
    {
      "id": "nm2555109",
      "name": "Rachel Vidal",
      "character": "Louise (3 mois)"
    },
    {
      "id": "nm7728503",
      "name": "Kim Levy",
      "character": "Louise (3 mois)"
    },
    {
      "id": "nm7728504",
      "name": "Juliette Minot Rolland",
      "character": "Louise (3 mois)"
    },
    {
      "id": "nm7728505",
      "name": "Auguste Valentino Nascimento",
      "character": "Louise (3 mois)"
    },
    {
      "id": "nm7728506",
      "name": "Juliette Barbazanges Aubry",
      "character": "Louise (3 mois)"
    },
    {
      "id": "nm7728507",
      "name": "Célia Touloum",
      "character": "Louise (de 5 à 7 mois)"
    },
    {
      "id": "nm7728508",
      "name": "Clémence Gremiaux",
      "character": "Louise (de 5 à 7 mois)"
    },
    {
      "id": "nm7728509",
      "name": "Inès Lhomme",
      "character": "Louise (de 5 à 7 mois)"
    },
    {
      "id": "nm7728510",
      "name": "Lilou Freddi Jannin",
      "character": "Louise à 5 ans"
    },
    {
      "id": "nm7728511",
      "name": "Ambre Freddi Jannin",
      "character": "Louise à 5 ans"
    },
    {
      "id": "nm7728512",
      "name": "Romane De Beron",
      "character": "Jumeau"
    },
    {
      "id": "nm7728513",
      "name": "Léandre Teyssandier",
      "character": "Jumeau"
    },
    {
      "id": "nm7728514",
      "name": "Faustine Martin",
      "character": "Jumeau"
    },
    {
      "id": "nm7728515",
      "name": "Pierre Tonnellier",
      "character": "Jumeau"
    },
    {
      "id": "nm0997553",
      "name": "Anne-Sophie Morillon",
      "character": ""
    }
  ],
  "overview": "Gabriell is a single mother, her 17-year-old daughter Claire is pregnant, however the child's father Simon has no desire to be involved with his future baby. When Gabrielle takes matters into her own hands and asks Simon's father Ange for help, an unexpected relationship begins.",
  "storyline": "Gabriell is a single mother, her 17-year-old daughter Claire is pregnant, however the child's father Simon has no desire to be involved with his future baby. When Gabrielle takes matters into her own hands and asks Simon's father Ange for help, an unexpected relationship begins.",
  "plot": "This article's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (November 2016) (Learn how and when to remove this template message)\nThe film opens with a woman leaving a bassinet on the porch of a fancy home; the baby, Junior, promptly pees on the woman who picks him up. From there, he is repeatedly discarded at various homes throughout many years by guardians who have grown tired of his destructive behavior—which includes throwing a rattle at the window, giving a cat soap to eat, using a vacuum cleaner to suck up the fish tank, and demolishing a mobile home with a bulldozer in retaliation for his favorite toys being stepped on—until he is eventually deposited at a Catholic orphanage, where he continues to wreak havoc on the strict nuns.\n\nBenjamin \"Ben\" Healy is a pleasant but brow-beaten husband, yuppie, and baseball coach working for his father, Big Ben, a tyrannical sporting goods dealer who is running for mayor. Recently, he has discovered that his father intends to sell his store and the land to a Japanese company rather than leave it to him; when he asks why, Big Ben reveals that it is because his son \"stubbornly refuses to follow his example\" by adopting an honest work ethic instead of a ruthless drive to usurp. He would love to have a son, but his selfish, gold-digging wife, Florence (\"Flo\" for short), has been unable to conceive. Ben and Flo are never invited to parties because they do not have a kid. Eventually Ben is able to convince Flo into adopting a child. They then approach a less-than-trustworthy adoption agent named Igor Peabody with the dilemma, and Igor presents them with Junior.\n\nHowever, Junior is hardly a model child; apparently mean-spirited and incorrigible. He leaves a path of serious destruction in his wake, and is even pen pals with Martin Beck, a notorious serial killer called the Bow Tie Killer. He sets his room on fire using a clown lamp and throws Fuzzball, the family cat, at Big Ben and he falls down the stairs. He messes up a camping trip with the neighbors by peeing on the campfire, and manipulating a practical joke played on the kids by their father, Roy, Ben's obnoxious friend who greatly enjoys rubbing his good fortunes in Ben's face, by luring a real black bear to the campsite. He makes Ben believe a bear is attacking when it is really Roy in a bear costume who gets hit with a frying pan. Hearing Junior laugh, Ben finds out he is responsible for making him hit Roy.\n\nThe next day, at a birthday party, Lucy — the snobby birthday girl — and her friends are very cruel to Junior and ban him from watching the magic show. However, he wants revenge and sneaks a water sprinkler into her room, forces a boy to pin a tail on a woman's rump instead of the donkey, cuts off another girl's braid with scissors, puts a frog in the punch bowl, replaces the piñata candy with pickles including the juice, throws all the presents in the pool and replaces the birthday candles with firecrackers. This leads Ben to punish him and take away his allowance. Seeing Junior upset, Ben gives him his most precious possession, a dried prune that belonged to his grandfather (he thought it resembled Roosevelt), telling him it signifies a bond between two people.\n\nFinally, Junior displays his effective but unethical method for winning in a Little League baseball game where he beats up rival players with a bat after they tease him. Ben is having serious doubts about him, and decides to take him back to the orphanage. However, upon hearing he was returned thirty times, he decides to keep and love him — something no one has ever done. However, Junior becomes upset that his parents were going to send him back; despite Ben stating that he will not, he drives Flo's car into Big Ben's store, and Ben's bank account is wiped out in order to pay for the damage. He is on the verge of cracking until Martin (believing that Junior is the criminal J.R.) arrives at the house, posing as his uncle, and decides to kidnap his faithful correspondent, along with Flo, for ransom.\n\nWhile Ben first sees this as good riddance to the browbeating Flo and the trouble making Junior, he soon notices signs that the latter is not the monster he appeared to be. In his drawer is the prune carefully wrapped up, and through a series of pictures he drew, he depicts Big Ben and Flo as deformed monsters with hostile surroundings, but Ben as a happy person in a pleasant background, revealing that he really did value him as a father figure all along. Realizing that his behavior was simply a response to how he himself had been treated, and that it has simply been bad luck that he has dealt with too many cruel and selfish people at such a young age, Ben undertakes a rescue mission to retrieve him back from Martin.\n\nHe then confronts Big Ben (who is preparing to make a TV appearance for his mayoral campaign) to loan him the ransom money. When he callously refuses, Ben quits his father's job and activates the camera that unknowingly puts Big Ben on live TV in revenge for the store and the land his father is selling the Japanese company, where he ends up revealing his true nature on the news.\n\nAfterward, Ben steals Roy's car and goes to rescue Junior. He catches up with Martin and Junior at the circus. Junior is rescued after escaping from Martin through a trapeze act and calls Ben \"Dad\" for the first time. Martin drives away, but the Healys are now on his trail. After a collision, Flo (who was stuffed in a suitcase) is thrown into the air and lands in the back of a farm truck loaded with pigs; Ben remarks as he watches her being carried away that she had always wanted to travel.\n\nMartin is arrested, but while being led away, he grabs an officer's sidearm and fires at Junior, but Ben shields him and takes the shot. Thinking he is dead, Junior apologizes for all the bad things he did, and tells him he will never be naughty again and he loves him. He wakes up and tells Junior he loves him, too, and realizes the bullet ricocheted off his good-luck prune, which was in his pocket. Junior asks Ben if he really believed that he was going to stop misbehaving, but Ben tells Junior he wants him to be himself. Junior then removes his bow tie and throws it over the bridge, perhaps as a sign that he has changed his ways not to be like Martin, but be himself, and is then carried home by his new father.\n\nThe film ends with Flo in the truck looking out from the suitcase, only to be met by a pig's rump, and the title track to the film, performed by The Beach Boys, plays over the closing credits.",
  "synopsis": null
}