{
  "imdb_id": "tt4000956",
  "tmdb_id": "292834",
  "douban_id": null,
  "title": "Brother Nature (2016)",
  "genres": [
    "Comedy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.7,
  "director": [
    {
      "id": "nm1444412",
      "name": "Osmany Rodriguez"
    },
    {
      "id": "nm1564890",
      "name": "Matt Villines"
    }
  ],
  "writer": [
    {
      "id": "nm0453115",
      "name": "Taran Killam",
      "description": "screenplay &"
    },
    {
      "id": "nm1510062",
      "name": "Mikey Day",
      "description": "screenplay"
    },
    {
      "id": "nm1556962",
      "name": "Cameron Fay",
      "description": "story by"
    }
  ],
  "cast": [
    {
      "id": "nm0453115",
      "name": "Taran Killam",
      "character": "Roger Fellner"
    },
    {
      "id": "nm1843026",
      "name": "Gillian Jacobs",
      "character": "Gwen Turley"
    },
    {
      "id": "nm1293885",
      "name": "Bobby Moynihan",
      "character": "Todd Dotchman"
    },
    {
      "id": "nm1901220",
      "name": "Sarah Burns",
      "character": "Margie Turley"
    },
    {
      "id": "nm0000597",
      "name": "Bill Pullman",
      "character": "Jerry Turley"
    },
    {
      "id": "nm0001854",
      "name": "Rita Wilson",
      "character": "Cathy Turley"
    },
    {
      "id": "nm2305663",
      "name": "Ellen Bloodworth",
      "character": "Grandma Hibby"
    },
    {
      "id": "nm0006713",
      "name": "Rachael Harris",
      "character": "Aunt Pam"
    },
    {
      "id": "nm0906476",
      "name": "David Wain",
      "character": "Uncle Mel"
    },
    {
      "id": "nm3718434",
      "name": "Jonah Kellams",
      "character": "Cousin Cody"
    },
    {
      "id": "nm6959135",
      "name": "Ethan Harmon",
      "character": "Cousin Spencer"
    },
    {
      "id": "nm3529685",
      "name": "Kumail Nanjiani",
      "character": "Riggleman"
    },
    {
      "id": "nm0860380",
      "name": "Kenan Thompson",
      "character": "Miesha"
    },
    {
      "id": "nm0002064",
      "name": "Giancarlo Esposito",
      "character": "Congressman Frank McClaren"
    },
    {
      "id": "nm4610003",
      "name": "Julian F. Grijalva",
      "character": "George Washington"
    },
    {
      "id": "nm1510062",
      "name": "Mikey Day",
      "character": "Thomas Jefferson"
    },
    {
      "id": "nm8417086",
      "name": "Tim Robinson",
      "character": "Ben Franklin"
    },
    {
      "id": "nm5132834",
      "name": "Sam Grey",
      "character": "John Adams"
    },
    {
      "id": "nm1326599",
      "name": "Noor Shic",
      "character": "Riggleman's Mom"
    },
    {
      "id": "nm1807222",
      "name": "Sarah Baker",
      "character": "Shannon (Jewelry Store Clerk)"
    },
    {
      "id": "nm8417088",
      "name": "Mike O'Brien",
      "character": "Nick (Karaoke)"
    },
    {
      "id": "nm5262775",
      "name": "Aidy Bryant",
      "character": "Dana Curlman (CH9 Producer)"
    },
    {
      "id": "nm1882629",
      "name": "Rachel Maddow",
      "character": "Rachel Maddow"
    },
    {
      "id": "nm8417089",
      "name": "Julianne Rogers",
      "character": "Laerke"
    },
    {
      "id": "nm1156870",
      "name": "Joseph Bertót",
      "character": "Janitor"
    },
    {
      "id": "nm5993534",
      "name": "Benny Morinishi",
      "character": "Micah"
    },
    {
      "id": "nm5512056",
      "name": "Matthew Schur",
      "character": "Freckly 10 Year Old"
    },
    {
      "id": "nm2299988",
      "name": "Chris Barron",
      "character": "Chris Barron (Spin Doctors)"
    },
    {
      "id": "nm2300396",
      "name": "Aaron Comess",
      "character": "Aaron Comess (Spin Doctors)"
    },
    {
      "id": "nm2299929",
      "name": "Eric Schenkman",
      "character": "Eric Schenkman (Spin Doctors)"
    },
    {
      "id": "nm2295603",
      "name": "Mark White",
      "character": "Mark White (Spin Doctors)"
    },
    {
      "id": "nm0996134",
      "name": "Paula Pell",
      "character": "Woman in Suit"
    },
    {
      "id": "nm3491660",
      "name": "Jennie Pierson",
      "character": "Suzy"
    },
    {
      "id": "nm8333026",
      "name": "Emily McSwain",
      "character": "Barber"
    }
  ],
  "overview": "Roger (Taran Killam), a straight-laced politician has big plans to propose to his dream girl (Gillian Jacobs) at her family's lake house. But everything goes awry when he meets his potential brother-in-law Todd (Bobby Moynihan): a full-time camp counselor with a heart of gold and a wild sense of fun, pining to be Roger's best friend, and ultimately catapulting him into a series of unfortunate events. As Roger tries to take a stand amidst outrageous fishing excursions, propulsive water jetpacks and American history-themed musicals, he realizes that being a part of a new family may be more difficult than he'd thought.",
  "storyline": "Roger (Taran Killam), a strait-laced politician has big plans to propose to his dream girl (Gillian Jacobs) at her family's lake house. But everything goes awry when he meets his potential brother-in-law Todd (Bobby Moynihan): a full-time camp counselor with a heart of gold and a wild sense of fun, pining to be Roger's best friend, and ultimately catapulting him into a series of unfortunate events. As Roger tries to take a stand amidst outrageous fishing excursions, propulsive water jetpacks and American history-themed musicals, he realizes that being a part of a new family may be more difficult than he'd thought.",
  "plot": "High school senior Venus \"Vee\" Delmonico (Emma Roberts) longs to leave her home, Staten Island, for college, but is afraid to tell her mother (Juliette Lewis) about her admission to California Institute of the Arts, as the mother is still grieving from the death of Vee's brother.\n\nVee's friend Sydney (Emily Meade) becomes popular in Nerve: an online reality game where people either enlist online as \"players\" or pay to watch as \"watchers\". Players accept dares from watchers, receiving monetary rewards. Sydney and her other friends chastise Vee's unadventurous nature. When Vee refuses to talk to her crush J.P., Sydney approaches J.P. herself and reveals that Vee is interested in him. J.P. rebuffs her, and Vee walks away embarrassed.\n\nFurious, Vee signs up as a player on Nerve. The game collects her personal data and explains the three rules: all dares must be recorded on the player's phone, earned money will be revoked if a player fails or \"bails\" a dare, and a player must not report the game to law enforcement. In addition, the top two most-watched players will compete in a highly sought-after final round. Her first dare is to kiss a stranger at a diner for five seconds. Vee kisses Ian (Dave Franco), who is reading Vee's favorite book (Virginia Woolf's \"To the Lighthouse\"). He starts dancing around the diner and sings to her on a dare, revealing that he's playing too. The watchers then dare Ian to take her into the city, believing they make a good couple.\n\nIn the city Vee is dared to try on an extremely expensive dress and meets Ian in the dressing room who has also been dared to try on formal attire. On returning to the changing rooms Vee and Ian find their clothes have been stolen and their next dare has started which is to leave the store. Vee and Ian run out of the store in their underwear and on returning to Ian's motorbike find a bag of clothes paid for by watchers. Vee is then dared to get a tattoo chosen by Ian, Ian draws out a tattoo and refuses to show Vee. When Vee becomes impatient, Ian distracts her with Wu-Tang Clan's C.R.E.A.M. on the radio, one of her brother's favorite songs. Vee raps along with the song until the finished tattoo is revealed to be a lighthouse. Ian's next dare is to trust Vee and is supposed to ride his motorbike through the city blindfolded at 60 mph, using Vee to steer his body; once completed, the couple kisses. Vee and Ian are soon among Nerve's top players under a short space of time. Jealous at Vee's rise of popularity on Nerve, Sydney accepts a dare to walk across a ladder suspended between two buildings. Whilst performing the dare, she drops her phone and due to her becoming scared, bails out and loses the game.\n\nIan takes Vee to Sydney's party and Vee catches her in bed with J.P. After arguing with Sydney, Vee receives and completes a dare to finish Sydney's dare. Vee's friend Tommy (Miles Heizer) reveals that he was watching Ian's profile; Ian had accepted a dare to make Vee and Sydney fight. Vee realizes how dangerous Nerve is and reports the game to the police, but they do nothing. As punishment, all money is drained from Vee's bank account, and her mother's. She is then attacked by elite player Ty (Machine Gun Kelly) in order to keep her in the game.\n\nAfter waking up in an abandoned site, she finds Ian, who confesses that he and Ty were players before, until their friend was killed in a dare. When they tried to alert the authorities, their families' jobs, bank accounts, and identities were confiscated, trapping them in the secret third category of the game: \"prisoners\". Vee is now a prisoner too, and only the winner of the final round can regain their identity.\n\nVee, Tommy, and Sydney recruit Tommy's computer hacker friends to alter the game's online code, although it is impossible to shut down Nerve as all the watchers act as a server to the game. After hanging from a crane for five seconds - which was the same dare that killed his friend - Ian too earns a spot in the finals in order to protect Vee. During the finals, which take place in an abandoned stadium, Vee and Ian are each given a revolver: one must shoot the other to win. Ian offers to throw the competition, but Ty jumps from the audience and takes Ian's place. Vee criticizes the watchers, whose identity are concealed behind masks and tells them to show \"nerve\" at who they are and reveal themselves. The watchers then cast a vote regarding if Ty should kill Vee. The majority vote is \"yes\", and Ty shoots Vee.\n\nTommy and his hackers modify Nerve's source code to decrypt the watcher's code names and send them a message: \"You are an accessory to murder\". All watchers immediately log out of Nerve, closing down Nerve's servers and effectively ending the game once and for all. Vee is unharmed; she and Ty had staged her murder to scare the watchers into disbanding Nerve. Everyone's money and identities are restored.\n\nA few months later, Vee and Sydney have reconciled, Vee and Ian are a couple, and Vee is attending California Arts. Ian reveals that his real name is Sam.",
  "synopsis": null
}