{
  "imdb_id": "tt4079142",
  "tmdb_id": "324293",
  "douban_id": null,
  "title": "Peace Officer (2015)",
  "genres": [
    "Documentary",
    "Crime"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "105 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.5,
  "director": [
    {
      "id": "nm1479219",
      "name": "Brad Barber"
    },
    {
      "id": "nm4703163",
      "name": "Scott Christopherson"
    }
  ],
  "writer": [
    {
      "id": "nm1479219",
      "name": "Brad Barber",
      "description": "writer"
    },
    {
      "id": "nm4703163",
      "name": "Scott Christopherson",
      "description": "writer"
    },
    {
      "id": "nm6811084",
      "name": "David Lawrence",
      "description": "writer"
    },
    {
      "id": "nm2695444",
      "name": "Renny McCauley",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm7858380",
      "name": "William 'Dub' Lawrence",
      "character": ""
    }
  ],
  "overview": "Peace Officer is a documentary about the increasingly militarized state of American police as told through the story of Dub Lawrence, a former sheriff who established his rural state's first SWAT team only to see that same unit kill his son-in-law in a controversial standoff 30 years later. Driven by an obsessed sense of mission, Dub uses his own investigation skills to uncover the truth in this and other recent officer-involved shootings in his community, while tackling larger questions about the changing face of peace officers nationwide.",
  "storyline": "Peace Officer is a documentary about the increasingly militarized state of American police as told through the story of 'Dub' Lawrence, a former sheriff who established and trained his rural state's first SWAT team only to see that same unit kill his son-in-law in a controversial standoff 30 years later. Driven by an obsessed sense of mission, Dub uses his own investigation skills to uncover the truth in this and other recent officer-involved shootings in his community, while tackling larger questions about the changing face of peace officers nationwide.",
  "plot": null,
  "synopsis": null
}