{
  "imdb_id": "tt4096750",
  "tmdb_id": "408755",
  "douban_id": null,
  "title": "The Binding (2016)",
  "genres": [
    "Drama",
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "91 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.5,
  "director": [
    {
      "id": "nm2803289",
      "name": "Gus Krieger"
    }
  ],
  "writer": [
    {
      "id": "nm2803289",
      "name": "Gus Krieger",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm3004295",
      "name": "Amy Gumenick",
      "character": "Sarah"
    },
    {
      "id": "nm1833129",
      "name": "Josh Heisler",
      "character": "Bram"
    },
    {
      "id": "nm9116726",
      "name": "James Rose Collins",
      "character": "Scaia       (as James Rose Collons)"
    },
    {
      "id": "nm0751762",
      "name": "Leon Russom",
      "character": "Uriel"
    },
    {
      "id": "nm1158992",
      "name": "Kate Fuglei",
      "character": "Martha"
    },
    {
      "id": "nm3603463",
      "name": "Virginia Welch",
      "character": "Leah"
    },
    {
      "id": "nm3234663",
      "name": "Rob Cunliffe",
      "character": "Daniel"
    },
    {
      "id": "nm2882129",
      "name": "Kevin Stidham",
      "character": "Gabe"
    },
    {
      "id": "nm4557043",
      "name": "Timothy Portnoy",
      "character": "Joseph"
    },
    {
      "id": "nm0659573",
      "name": "Stuart Pankin",
      "character": "Plank"
    },
    {
      "id": "nm3422130",
      "name": "Catherine Parker",
      "character": "Sam       (as Katie Parker)"
    },
    {
      "id": "nm3263766",
      "name": "Amelia Gotham",
      "character": "Hannah"
    },
    {
      "id": "nm2301438",
      "name": "Max Adler",
      "character": "David"
    },
    {
      "id": "nm0147738",
      "name": "Larry Cedar",
      "character": "Kore"
    }
  ],
  "overview": "A young woman's faith is put to the ultimate test when she is forced to uncover the truth behind her husband's horrific visions.",
  "storyline": "A young woman's faith is put to the ultimate test when she is forced to uncover the truth behind her husband's horrific visions.",
  "plot": "Riggan Thomson is a faded American actor who is famous for playing the superhero Birdman in a film trilogy 20 years ago. He is tormented by the mocking and critical internal voice of Birdman and frequently visualizes himself performing feats of levitation and telekinesis. Riggan is trying to gain recognition as a serious actor for writing, directing, and starring in a Broadway adaptation of Raymond Carver's short story \"What We Talk About When We Talk About Love.\"\n\nJake, Riggan's best friend and lawyer, is producing the play which co-stars Riggan's girlfriend Laura and Broadway débutante Lesley. Riggan's daughter Sam, a recovering drug addict whom he is trying to reconnect with, is working as his assistant. The day before the first preview, a light fixture falls onto Riggan's hopeless co-star Ralph, which Riggan tells Jake he caused. At Lesley's suggestion, Riggan replaces Ralph with her boyfriend, the brilliant but volatile method actor Mike Shiner. The first previews are disastrous: Mike breaks character over the replacement of his gin with water, attempts to have real sex with Lesley during a sex scene and claims that the prop gun does not look real which is hindering his performance. Riggan clashes continually with Mike and is incensed at influential theater critic Tabitha Dickson's praise for Mike's performance, but Jake persuades him to continue with the play. Riggan catches Sam using marijuana and berates her; she tells him he is expendable and that his play is a vanity project.\n\nDuring the final preview, Riggan goes for a cigarette and accidentally locks himself outside with his robe stuck in the fire escape door. He is forced to walk through Times Square in his underwear and enter through the audience to do the final scene miming the gun. A concerned Sam is waiting in his dressing room after the show. She thinks the performance was very weird but sort of cool. They talk about the show, him being a bad father and her rehab experience. She shows him that the Times Square footage is going viral and explains how this actually helps him. Riggan goes to a bar for a drink and approaches Tabitha, accusing her of not understanding theater and just being someone who crudely labels things. She tells him that she hates ignorant Hollywood celebrities who pretend to be serious actors and promises to \"kill\" his play with a deprecating review without even having seen it. On the way back, Riggan buys a pint of whiskey, drinks it and passes out on a stoop. The next day, walking to the theater with a severe hangover, he has a conversation with the now visible Birdman, who tries to convince him to quit the play and make the fourth Birdman film that fans are still demanding. Riggan visualizes himself jumping off the roof and flying through the streets of Manhattan before arriving at the theater.\n\nOn the opening night the play is going very well. In his dressing room, a strangely calm Riggan confesses to his ex-wife Sylvia that several years ago he attempted to drown himself in the ocean after she caught him having an affair. He also tells her about his inner Birdman voice, which she ignores. After Sylvia wishes him luck and leaves the room, Riggan picks up a real gun and checks that it is loaded for the final scene in which his character commits suicide. At the climax, Riggan shoots himself in the head on-stage. The play receives a standing ovation as Tabitha rushes out to file copy.\n\nThe next day, Riggan wakes up in hospital with his face covered in a mask of bandages where his nose has been surgically reconstructed after he blew it off during the botched suicide. His ex-wife is worried about him but Jake cannot contain his excitement that the play will run forever after Tabitha's rave-review which called the suicide attempt \"super-realism\" and just what American theater needed. Sam visits with flowers, which he cannot smell, and takes a picture of him to scare the skyrocketing number of followers on the Twitter account she has created for him. While she steps outside to find a vase, Riggan goes into the bathroom, removes the bandages revealing his swollen new nose, and obscenely says goodbye to Birdman, whom he sees sitting on the toilet. Fascinated by some birds flying outside his room, he opens the window and climbs out onto the ledge. When Sam returns, Riggan is nowhere to be seen. She frantically scans the ground below the open window before she slowly looks up into the sky, smiles, and laughs.",
  "synopsis": null
}