{
  "imdb_id": "tt4034452",
  "tmdb_id": "316042",
  "douban_id": "26580909",
  "title": "Hyena Road (2015)",
  "genres": [
    "Action",
    "Drama",
    "War"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "120 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm0343472",
      "name": "Paul Gross"
    }
  ],
  "writer": [
    {
      "id": "nm0343472",
      "name": "Paul Gross",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm1160472",
      "name": "Rossif Sutherland",
      "character": "Warrant Officer Ryan Sanders"
    },
    {
      "id": "nm0369935",
      "name": "Allan Hawco",
      "character": "Travis"
    },
    {
      "id": "nm1248979",
      "name": "David Richmond-Peck",
      "character": "Hickey"
    },
    {
      "id": "nm1705230",
      "name": "Karl Campbell",
      "character": "Tank"
    },
    {
      "id": "nm8130966",
      "name": "Kelly Holden",
      "character": "C.P. Sergeant"
    },
    {
      "id": "nm2368981",
      "name": "Christine Horne",
      "character": "Captain Jennifer Bowman"
    },
    {
      "id": "nm8130967",
      "name": "Ibrahim Dweiken",
      "character": "Bionics Taliban"
    },
    {
      "id": "nm1042518",
      "name": "Darren Wall",
      "character": "Zero"
    },
    {
      "id": "nm8130969",
      "name": "Andrew Wall",
      "character": "Captain Dawson T.O.C."
    },
    {
      "id": "nm7037771",
      "name": "Niamatullah Arghandabi",
      "character": "The Ghost"
    },
    {
      "id": "nm7037772",
      "name": "Hekmat Bavari",
      "character": "Abdul       (as Hekmat Bavary)"
    },
    {
      "id": "nm8130970",
      "name": "Sadeen Dagamseh",
      "character": "Abdul's Daughter #1"
    },
    {
      "id": "nm8130971",
      "name": "Julia Issa Begain",
      "character": "Abdul's Daughter #2"
    },
    {
      "id": "nm6830089",
      "name": "Nikki Duval",
      "character": "Chewey"
    },
    {
      "id": "nm0343472",
      "name": "Paul Gross",
      "character": "Pete Mitchell"
    },
    {
      "id": "nm0424800",
      "name": "Clark Johnson",
      "character": "General Rilmen"
    },
    {
      "id": "nm2842100",
      "name": "Darren Felbel",
      "character": "Shorty"
    },
    {
      "id": "nm8130973",
      "name": "Alex Mokhtarzada",
      "character": "Hamid Walid Khan"
    },
    {
      "id": "nm1566128",
      "name": "Aqqalu Meekis",
      "character": "Wolf"
    },
    {
      "id": "nm1008824",
      "name": "Penny McDonald",
      "character": "Journalist"
    },
    {
      "id": "nm7340626",
      "name": "Shawn M. Stewart",
      "character": "Osborne"
    },
    {
      "id": "nm5658664",
      "name": "Kamiran Aldeo",
      "character": "Walid"
    },
    {
      "id": "nm8130974",
      "name": "Ramadan Ashmari",
      "character": "Afghan Elder #1"
    },
    {
      "id": "nm8130975",
      "name": "Sulayman Alkhiaba",
      "character": "Afghan Elder #2"
    },
    {
      "id": "nm1029263",
      "name": "Nabil Elouahabi",
      "character": "Haji Baba /              The Cleaner"
    },
    {
      "id": "nm8130976",
      "name": "Allan Shehi",
      "character": "Greywal"
    },
    {
      "id": "nm0648313",
      "name": "Abdullah Omar",
      "character": "11 Year Old K-City Boy"
    },
    {
      "id": "nm8130977",
      "name": "Roqaya Salim Ahmad",
      "character": "Pashto with Frying Pan"
    },
    {
      "id": "nm1213885",
      "name": "Robin Ruel",
      "character": "Heather"
    },
    {
      "id": "nm0699856",
      "name": "Jennifer Pudavick",
      "character": "Mary"
    },
    {
      "id": "nm2052198",
      "name": "Allan Best",
      "character": "American Technician"
    },
    {
      "id": "nm8130978",
      "name": "Joe Bloggins",
      "character": "Task Force Commander"
    },
    {
      "id": "nm8130979",
      "name": "Anil Abraham",
      "character": "QRF Commander"
    },
    {
      "id": "nm0934383",
      "name": "Brian Wiltshire",
      "character": "T.O.C. Officer #1"
    },
    {
      "id": "nm8130980",
      "name": "Mohammad Fawaz Habashneh",
      "character": "Lead Taliban"
    },
    {
      "id": "nm8130981",
      "name": "Benjamin Berkowski",
      "character": "Lieutenant O'Brien"
    },
    {
      "id": "nm8130972",
      "name": "Fazal Hakimi",
      "character": "Bashir Daoud Khan, BDK"
    }
  ],
  "overview": "Three different men, three different worlds, three different wars – all stand at the intersection of modern warfare – a murky world of fluid morality where all is not as it seems.",
  "storyline": "Three different men, three different worlds, three different wars - all stand at the intersection of modern warfare - a murky world of fluid morality where all is not as it seems.",
  "plot": "Hyena Road is centered around the Canadian Forces deployed in Kandahar Province, Afghanistan. The Forces are encountering resistance from insurgents as they construct \"Hyena Road\" deep into Taliban territory. Warrant Officer Ryan Sanders, the leader of a rifle squad, finds himself under heavy fire while on sentry duty on the road. After their assigned evacuation vehicles are unable to reach their location, the squad moves on foot and reaches a Pashtun village. There are harbored by a tribal elder in his home, who also sends the Taliban away after they attack the village with rockets while searching for the Canadians. Sanders and his squad evacuate the area and return to base, where his secret lover Captain Jennifer Bowman, a communications officer, is also stationed. Meanwhile, Captain Pete Mitchell, an intelligence officer, carries out normal duties as the road is constructed, with little help from the Canadian's Afghani allies. When he hears Sanders' story of the Afghani elder, he decides to search for the man as a potential ally. He is helped in his search by a local asset assisting against the Taliban, called The Cleaner. While a search of the village yields nothing, Sanders' is able to remember that the elder has eyes of two different colours, with one being brown and the other blue. Mitchell is immediately able to identify the man as \"the Ghost\", formerly a fighter against the Soviets who gained his nickname for disappearing every time he was injured, since his comrades would take him across the mountains into Pakistan, out of the range of the Soviets.\n\nMitchell eventually arranges a meeting with the Ghost, but he refuses to accept money as a deal for his help, stating that he is now an old man and his days of combat are behind him. Meanwhile, the Canadians Afghani Allies, BDK and his son, Karim, are double-crossing them and receiving bribes from the Taliban. Sanders' squad sees this firsthand while observing the Ghost visit his son's home and granddaughters. The home was situated on land owned by BDK, while the crops had been destroyed by a Coalition airstrike some time in the past, leaving the Ghost's son with nothing to give BDK as his tithe for protection. Soon after the Ghost leaves, BDK arrives with Taliban protection and instructs the Ghost's son to pay up his money. When the son states that the entire opium crop was destroyed, BDK takes the Ghost's granddaughters and drive away. Sander's fireteam observe the whole scene and are desperate to prevent BDK from taking the children, but Mitchell repeatedly instructs them to hold their fire as they do not fully understand local politics. While everyone in the Canadian intelligence group knows their Afghani allies are crooked, there is no alternative in the province and they need all the help they can get.\n\nMeanwhile, Bowman reveals to Sanders that she is pregnant with his son, having conceived while both were on leave. Sanders rejoices in this, despite it being a serious problem regarding military rules prohibiting fraternization between officers and NCOs.\n\nThe Canadians follow the Ghost, who has declared a personal war on BDK in revenge for the kidnapping of the girls. With assistance from his tribe, the Ghost abducts BDK's son Karim and beheads him when he is unable to reveal the location of the girls. Following this, the Ghost arranges a meeting with BDK in an isolated house, at the same time when BDK is supposed to be with the Canadians as they commemorate the opening of Hyena road. BDK agrees to exchange the girls for Karim. However, when BDK arrives with his bodyguards in a convoy, he demands to know the location of his son. The Ghost response by opening a sac he has brought and holding up Karim's severed head, at which point BDK pulls out his pistol and threatens to kill the Ghost. Sanders and his squad, who have been watching the whole action, fires on BDK as they have positive intent of violence. They do not, however, know that the Ghost desired to die having nothing else to live for, and only wanted to avenge his grandchildren who he assumed were lost forever. A firefight ensures after BDK is shot in the head by the Canadians, and the Canadians soon drive off BDK's bodyguards and begin moving out. As they move down to the house, dozens of Taliban insurgents arrive and they are trapped with the Ghost around the house. Although they fight off the insurgents, there is no support available and the Canadians are pinned down. After Travis, one of the members of Sanders' squad, is shot in the head by a sniper, the squad decides to relocate into the house under heavy enemy fire. As they move, they run into IEDs and the squad is incapacitated, with only Sander being able-bodied, along with the Ghost. Recognizing that there is no escape, Sanders calls in for artillery ordering to fire on his exact location to eliminate the insurgents, instructing them to fire for effect. After apologizing for the last time to Bowman, who heavily weeping tries to countermand the order, Sanders pulls off his helmet and tells the Ghost that he was going to be a father, something the Ghost appears to understand despite him not speaking English. Moments later, the artillery rounds hit the house obliterating Sanders, the Ghost, his squad, and many of the Taliban insurgents around them.\n\nThe film ends as Canadian troops rescue numerous Afghani children including the Ghost's granddaughters from one of BDK's safehouses, having acted on the Cleaner's information and other assets. Mitchell talks about how things will eventually get better, in the long term.",
  "synopsis": null
}