{
  "imdb_id": "tt4048272",
  "tmdb_id": "374475",
  "douban_id": null,
  "title": "Toni Erdmann (2016)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "162 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.1,
  "director": [
    {
      "id": "nm0011752",
      "name": "Maren Ade"
    }
  ],
  "writer": [
    {
      "id": "nm0011752",
      "name": "Maren Ade",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm1197689",
      "name": "Sandra Hüller",
      "character": "Ines Conradi"
    },
    {
      "id": "nm0800638",
      "name": "Peter Simonischek",
      "character": "Winfried"
    },
    {
      "id": "nm0937000",
      "name": "Michael Wittenborn",
      "character": "Henneberg"
    },
    {
      "id": "nm2457436",
      "name": "Thomas Loibl",
      "character": "Gerald"
    },
    {
      "id": "nm2012595",
      "name": "Trystan Pütter",
      "character": "Tim"
    },
    {
      "id": "nm2445328",
      "name": "Ingrid Bisu",
      "character": "Anca"
    },
    {
      "id": "nm0591389",
      "name": "Hadewych Minis",
      "character": "Tatjana"
    },
    {
      "id": "nm0751301",
      "name": "Lucy Russell",
      "character": "Steph"
    },
    {
      "id": "nm0168272",
      "name": "Victoria Cocias",
      "character": "Flavia"
    },
    {
      "id": "nm1090879",
      "name": "Alexandru Papadopol",
      "character": "Dascalu"
    },
    {
      "id": "nm0539341",
      "name": "Victoria Malektorovych",
      "character": "Natalja"
    },
    {
      "id": "nm0121974",
      "name": "Ingrid Burkhard",
      "character": "Annegret"
    },
    {
      "id": "nm0530562",
      "name": "Jürg Löw",
      "character": "Gerhard"
    },
    {
      "id": "nm0717973",
      "name": "Ruth Reinecke",
      "character": "Renate"
    },
    {
      "id": "nm0903177",
      "name": "Nicolas Wackerbarth",
      "character": "Coach Leopold"
    },
    {
      "id": "nm6316506",
      "name": "Mihai Manolache",
      "character": "Mann am Ölfeld"
    },
    {
      "id": "nm0052600",
      "name": "Radu Bânzaru",
      "character": "Bogdan"
    },
    {
      "id": "nm2137261",
      "name": "Niels Bormann",
      "character": "Kurierfahrer"
    },
    {
      "id": "nm8032809",
      "name": "Radu Dumitrache",
      "character": "Manager Spa"
    },
    {
      "id": "nm0405812",
      "name": "Klara Höfels",
      "character": "Irma"
    },
    {
      "id": "nm0822352",
      "name": "Hartmut Stanke",
      "character": "Walter"
    },
    {
      "id": "nm0530561",
      "name": "Hans Löw",
      "character": "Oliver"
    },
    {
      "id": "nm1779253",
      "name": "Julischka Eichel",
      "character": "Babette"
    },
    {
      "id": "nm7401713",
      "name": "Lennart Moho",
      "character": "Lukas"
    },
    {
      "id": "nm0727477",
      "name": "Irene Rindje",
      "character": "Bärbel"
    },
    {
      "id": "nm0518187",
      "name": "Sava Lolov",
      "character": "Mr. Vermillard"
    },
    {
      "id": "nm1013098",
      "name": "John Keogh",
      "character": "Mr. Myers"
    },
    {
      "id": "nm0196693",
      "name": "Cezara Dafinescu",
      "character": "Dorina"
    },
    {
      "id": "nm1617888",
      "name": "Ozana Oancea",
      "character": "Ana"
    },
    {
      "id": "nm0162964",
      "name": "Manuela Ciucur",
      "character": "Frau Rodica"
    },
    {
      "id": "nm1474908",
      "name": "Ursula Renneke",
      "character": "Lehrerin       (as Ursula Reneke)"
    },
    {
      "id": "nm8657315",
      "name": "Karlheinz Ade",
      "character": "Rektor Dudinger"
    },
    {
      "id": "nm8657316",
      "name": "Mugur Sabo",
      "character": "Männer am Markt"
    },
    {
      "id": "nm8657317",
      "name": "Manu Sabo",
      "character": "Männer am Markt"
    },
    {
      "id": "nm8657318",
      "name": "Claudiu Imparatu",
      "character": "Männer am Markt       (as Claudiu Împaratu)"
    },
    {
      "id": "nm1211293",
      "name": "Bryan Jardine",
      "character": "Amerikanischer Botschafter       (as Bryan Jardin)"
    },
    {
      "id": "nm4897505",
      "name": "Dana Marineci",
      "character": "Rezeptionistin Dacoil"
    },
    {
      "id": "nm8657319",
      "name": "Catalin Baicus",
      "character": "Dariu"
    },
    {
      "id": "nm8657320",
      "name": "Marius Georgian",
      "character": "Corneliu"
    },
    {
      "id": "nm5282550",
      "name": "Miriam Rizea",
      "character": "Flora"
    },
    {
      "id": "nm0831164",
      "name": "Luana Stoica",
      "character": "Sekretärin von Iliescu"
    },
    {
      "id": "nm0691251",
      "name": "Valentin Popescu",
      "character": "Arbeiter am Ölfeld"
    },
    {
      "id": "nm0104426",
      "name": "Ioan Brancu",
      "character": "Vorarbeiter am Ölfeld"
    },
    {
      "id": "nm2909561",
      "name": "Emil Constantinescu",
      "character": "Junge am Ölfeld"
    },
    {
      "id": "nm7039918",
      "name": "Madalina Ciotea",
      "character": "Frau vom Partyservice"
    },
    {
      "id": "nm8657321",
      "name": "Daniel Filipescu",
      "character": "Kellner Da Vinci"
    },
    {
      "id": "nm7200401",
      "name": "Raluca David",
      "character": "Portier Hotel Winfried"
    },
    {
      "id": "nm0713685",
      "name": "Mihai Razus",
      "character": "Manager von Dacoil"
    },
    {
      "id": "nm8657322",
      "name": "Adrian Bucur",
      "character": "Manager von Dacoil"
    },
    {
      "id": "nm3234765",
      "name": "Andrei Mateiu",
      "character": "Nataljas Fahrer"
    },
    {
      "id": "nm8657323",
      "name": "Florin Visenescu",
      "character": "Tonis Limo Fahrer"
    },
    {
      "id": "nm6056347",
      "name": "Serban Cismarescu",
      "character": "Mann Dachterasse       (as Serban Gabriel Cismarescu)"
    },
    {
      "id": "nm8657324",
      "name": "Marcus Weber",
      "character": "Kukeri Double"
    },
    {
      "id": "nm2943113",
      "name": "Ebba",
      "character": "Hund Willi"
    },
    {
      "id": "nm8657325",
      "name": "6d und 6b der Heinrich Heine Gesamtschule Klasse 8b",
      "character": "Schüler"
    },
    {
      "id": "nm0412096",
      "name": "Vlad Ivanov",
      "character": "Iliescu"
    }
  ],
  "overview": "Without a warning a father comes to visit his daughter abroad. He believes that she lost her humor and therefore surprises her with a rampage of jokes.",
  "storyline": "Winfried doesn't see much of his working daughter Ines. He pays her a surprise visit in Bucharest, where she's busy as a corporate strategist. The geographical change doesn't help them to see more eye to eye. Practical joker Winfried annoys his daughter with corny pranks and jabs at her routine lifestyle of meetings and paperwork. Father and daughter reach an impasse, and Winfried agrees to go home to Germany. Enter Toni Erdmann: Winfried's flashy alter ego. Disguised in a tacky suit, weird wig and fake teeth, Toni barges into Ines' work circle, claiming to be her CEO's life coach. As Toni, Winfried doesn't hold back, and Ines meets the challenge. The harder they push, the closer they become. In all the madness, Ines begins to see that her eccentric father deserves a place in her life.",
  "plot": "Winfried Conradi is a divorced music teacher, an old-age hippie of sorts, with a passion for bizarre pranks involving several fake personas. Following the death of his beloved dog, he decides to reconnect with his daughter, Ines, who is pursuing a career in business consulting. Ines is currently posted in Bucharest, Romania, where she works on an outsourcing project in the oil industry. She is consumed by her work and seems to have little time for her family, least of all her father.\n\nWinfried spontaneously travels to Bucharest and waits for Ines in the lobby of an office complex. After several hours, she finally appears, accompanied by several of her client's board members and on the way to a meeting. Winfried puts on sunglasses and fake teeth as a playful disguise, and approaches her from the side while hiding behind a newspaper. Ines completely ignores her father, but meets with him briefly after work and invites him to a business reception.\n\nIn the evening, Winfried accompanies Ines to the reception at the American Embassy, where they meet Henneberg, a German oil company CEO with whom Ines wishes to secure a consulting contract. Ines tries desperately to gain Henneberg's attention, but Henneberg seems more interested in her father. Winfried tells Henneberg that he has hired a replacement daughter because Ines is always busy. To Ines' surprise, Henneberg invites Winfried and Ines for drinks, along with his entourage. At the bar, Henneberg once again brushes aside Ines, and makes fun of Winfried.\n\nAfter several days, Ines and Winfried are struggling to get along. Ines is consumed by work-related stress and oversleeps a planned rendezvous with clients, blaming her father for not waking her up. Winfried, feeling alienated and unwanted, leaves in a taxi for the airport. Ines continues with her work as normal, and several days later arranges to meet two female friends at a bar. While Ines and her friends are chatting, a man approaches and introduces himself as \"Toni Erdmann\". The man is clearly Winfried, disguised in a wig and with false teeth, but Ines does not let on. Ines' two friends politely engage \"Erdmann\" in conversation, and he explains that he is a life coach and consultant visiting Bucharest to attend the funeral of his friend's turtle.\n\nInes is increasingly frustrated and unfulfilled in her work and personal life, but continues to encounter \"Erdmann\" sporadically at parties or outside her office. At first Ines is angry with her father, and accuses him of trying to \"ruin\" her. However, as time goes on she comes to see the worth of her father's interventions in her life, and plays along with the \"Erdmann\" ruse. \"Erdmann\" accompanies her on a night out with her work friends, and eventually even comes to a business meeting with her. In turn, \"Erdmann\" takes Ines to a Romanian family's Easter party, where he forces her into a reluctant and comical, yet powerful, performance of Whitney Houston's \"Greatest Love of All\". After her performance, Ines promptly rushes off.\n\nBack at her flat, Ines is preparing to host a business brunch to celebrate her birthday. She struggles to zip up her tight dress, realizes her shoes don't match, and attempts to change clothes. The doorbell rings. Instead of redressing, or changing her outfit, she opens the door naked. Spontaneously, she decides to tell her guests that her birthday brunch is a \"naked party\". Each of them reacts differently, with some leaving in disgust while others self-consciously strip off. As the party becomes increasingly awkward, Winfried arrives dressed in a full-body Bulgarian kukeri costume. The costume frightens Ines' colleagues, but when Winfried leaves the party Ines follows him. Outside in a public park, father and daughter hug and share a moment of intimacy—despite Winfried's impractical and incongruous costume.\n\nMonths later, Ines returns to Germany for her grandmother's funeral. She explains that she has quit her job in Bucharest and will shortly begin a new job in Singapore with McKinsey &amp; Company. After the funeral, Winfried and Ines play with some funny hats in the garden of her grandmother's house, and reflect on the nature of happiness.",
  "synopsis": "TONI ERDMANN (Peter Simonischek) is Winfried, 65, a music teacher with a strong penchant for jokes, who lives with his old dog. His daughter Ines (Sandra Hüller) is a career woman who travels around the world in order to optimize companies. Father and daughter could therefore not be more different. He, the soulful, socially romantic '68. She, the rational management consultant who tries to raise her profile at a major outsourcing project in Romania to compete in a mans world.Winfried does not see much of his daughter at home, he decides after the death of his dog to visit her spontaneously. But the visit does not lead to a rapprochement. Winfried annoys his daughter with mild jokes and subliminal criticism of their performance-oriented life between meetings, hotel bars and countless emails. Father and daughter at an impasse and it comes to a confrontation between the two.But instead, as announced to leave Bucharest, he surprised Ines with a radical transformation in Toni Erdmann, his dazzling alter ego. With crooked teeth, bad suit and wig Toni is wilder and bolder than Winfried and does not mince his words. Toni mixes in Ines professional life, to be with the assertion that the coach of her boss and start a rampage of jokes. Surprisingly leaves Ines on his offer, and father and daughter making a startling discovery: The harder they clashed, the closer they come."
}