{
  "imdb_id": "tt4042814",
  "tmdb_id": "356268",
  "douban_id": null,
  "title": "Keeper (2015)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "Belgium",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.7,
  "director": [
    {
      "id": "nm1879267",
      "name": "Guillaume Senez"
    }
  ],
  "writer": [
    {
      "id": "nm3460363",
      "name": "David Lambert",
      "description": null
    },
    {
      "id": "nm0738925",
      "name": "Marcia Romano",
      "description": "consulting writer"
    },
    {
      "id": "nm1879267",
      "name": "Guillaume Senez",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3197772",
      "name": "Kacey Mottet Klein",
      "character": "Maxime"
    },
    {
      "id": "nm1863193",
      "name": "Galatéa Bellugi",
      "character": "Mélanie"
    },
    {
      "id": "nm3270435",
      "name": "Laetitia Dosch",
      "character": "La mère de Mélanie"
    },
    {
      "id": "nm1595165",
      "name": "Catherine Salée",
      "character": "La mère de Maxime"
    },
    {
      "id": "nm0522205",
      "name": "Sam Louwyck",
      "character": "Le père de Maxime"
    },
    {
      "id": "nm0896631",
      "name": "Cédric Vieira",
      "character": "Le coach"
    },
    {
      "id": "nm1186317",
      "name": "Vincent Sornaga",
      "character": "L'assistant social"
    },
    {
      "id": "nm0046436",
      "name": "Dominique Baeyens",
      "character": "La gynécologue"
    },
    {
      "id": "nm0225797",
      "name": "Béatrice Didier",
      "character": "La psychologue"
    },
    {
      "id": "nm1327467",
      "name": "Corentin Lobet",
      "character": "Le coordinateur"
    },
    {
      "id": "nm7107021",
      "name": "Aaron Duquaine",
      "character": "Lionel, le petit frère"
    },
    {
      "id": "nm6700447",
      "name": "Leopold Buchsbaum",
      "character": "Thibaut       (as Léopold Buchsbaum)"
    },
    {
      "id": "nm0495844",
      "name": "Sophia Leboutte",
      "character": "La directrice maison maternelle"
    },
    {
      "id": "nm0710628",
      "name": "Mounia Raoui",
      "character": "Médecin du centre"
    },
    {
      "id": "nm4192555",
      "name": "Théo Dardenne",
      "character": "Fred"
    },
    {
      "id": "nm4249465",
      "name": "Alain Bellot",
      "character": "Le délégué"
    },
    {
      "id": "nm4066639",
      "name": "Sarah Ber",
      "character": "Amie de Mélanie"
    },
    {
      "id": "nm8033271",
      "name": "Emmanuelle Gilles-Rousseau",
      "character": "Jeune fille toilettes"
    },
    {
      "id": "nm8033272",
      "name": "Karol Tatiana Ararat Mora",
      "character": "Copine Fred"
    },
    {
      "id": "nm8033273",
      "name": "Bastien Rempp",
      "character": "Bastien"
    },
    {
      "id": "nm8033274",
      "name": "Hélène Kapako",
      "character": "Fille maison maternelle"
    },
    {
      "id": "nm8033275",
      "name": "Zoé De Smet",
      "character": "Lucas, le bébé"
    },
    {
      "id": "nm6204744",
      "name": "Paloma Garcia Martens",
      "character": ""
    },
    {
      "id": "nm8514679",
      "name": "Arthur Mas",
      "character": "Arthur"
    },
    {
      "id": "nm9332785",
      "name": "Mathilde Warnier",
      "character": ""
    }
  ],
  "overview": "Maxime and Mélanie are a typical teenage couple. Like most lovestruck fifteen-year-olds, they can't get enough of each other and they think they'll be together forever. But when Mélanie becomes pregnant, their worlds are rocked.",
  "storyline": "The story of two teenagers that are about to have a baby. After deciding they will keep the baby, they have to deal with their parents and also with their everyday life.",
  "plot": "Conceived by means of in vitro fertilization, Anna Fitzgerald (Abigail Breslin) was brought into the world as a savior sister at the informal suggestion of Kate's doctor, Dr. Chance (David Thornton) (a formal suggestion would have been a violation of legal and medical ethics). She is a genetic match to her older sister, Kate (Sofia Vassilieva), who suffers from acute promyelocytic leukemia, and Anna can therefore donate compatible organs, blood, and tissue to help her sister. Her family members are introduced one by one, and each tells about how Kate's illness has affected them personally. When Kate turns 15, she goes into renal failure and 11-year old Anna knows that she will be forced by her parents to donate one of her kidneys. She also realizes that she may not be able to live the life she will want to lead – she won't be able play any sports, drink alcohol, or be a mother in the future. Anna tells her parents that she does not want to be a donor and proceeds to sue them for medical emancipation and the rights to her own body. Her father Brian (Jason Patric) sees Anna's point, though her domineering mother, Sara (Cameron Diaz), who leads an obsessive campaign to keep Kate alive, is indignant at Anna's decision when she receives the notice of court proceedings. Attorney Campbell Alexander (Alec Baldwin) agrees to work for Anna as her guardian ad litem, suing for partial termination of parental rights. It is later learned he agreed to take the case – not for the notoriety, but because he suffers from epilepsy, and is genuinely sympathetic to her predicament because he also understands how it feels to have no control over his body. Both Sara and Alexander tell their side of the story to the judge (Joan Cusack), who had recently lost her young daughter, something Sara inadvertently mentions. To Sara's dismay, the judge decides against summary dismissal, and the case goes to a hearing.\n\nThe film is interlaced with flashbacks that detail Kate and Anna's close relationship, as well as how Kate's illness has affected her siblings' lives and their relationships. In a flashback, Kate also meets a fellow cancer patient, Taylor Ambrose (Thomas Dekker), whom she begins dating. After a date, they kiss outside Kate's house, with Sara and Kate's father Brian watching from their bedroom window. After this, he becomes her boyfriend in and out of hospital and supports her as she undergoes treatment. He then asks her to the hospital's \"prom\" for teen patients; there, they slow-dance, then proceed to a vacant hospital room. A few days later, Kate begins to worry as she has not seen Taylor since the dance. In anger, she reveals to Sara that they did \"stuff\" together. Kate subsequently learns that Taylor has died and later attempts suicide by overdosing on painkillers, but Anna stops her. Kate later expresses hope that after she dies, she will see Taylor wherever she ends up.\n\nKate makes a request to go to the beach one last time. Brian obtains permission and compassionate encouragement, from Dr. Chance, who claims she is \"no more sick there\", to do so. Brian discharges her from the hospital for the day and takes her and the kids to the beach. When Brian arrives home to pick everyone up, Sara overreacts and demands that Kate be returned to the hospital immediately, arguing that bringing her to the beach is effectively \"killing her\". Brian angrily refuses and drives off, threatening Sara with a divorce if she does not join them. Sara shows up at the beach, where they enjoy one final family outing.\n\nDuring the hearing, Anna and Kate's brother, Jesse, reveals while Anna is on the witness stand that Anna is actually acting under Kate's instruction; Kate, not wanting to live any longer and be a detriment to her family, had gently persuaded Anna to refuse to donate her kidney, knowing that Sara would be too narrow-minded to listen to her. It also emerges that Anna had wanted to give Kate her kidney of her own accord, and had been terribly upset at Kate's decision. Sara is indignant and attempts to argue, but is finally forced by both Jesse and Brian to realize that Kate had been trying to tell her she is ready to die for some time. The judge makes a request to visit Kate in the hospital before finalizing the case. Later that day, as the remainder of the family leave, Kate gifts her mother with a memory book she has made over the years and later dies while sleeping at the hospital with her mother by her side. After Kate's death, Campbell brings the court decision: Anna won the case. The family moves on with their lives, but reveal that every year on Kate's birthday they go to Montana, which was her \"most favorite place in the world\". Anna concludes that she was not born merely to save her sister, she was born because she had a sister, and that she helped make life easier for everyone else.",
  "synopsis": null
}