{
  "imdb_id": "tt4080058",
  "tmdb_id": "368958",
  "douban_id": null,
  "title": "Fanciful (2014)",
  "genres": [
    "Drama"
  ],
  "country": "Poland",
  "version": [
    {
      "runtime": "75 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.2,
  "director": [
    {
      "id": "nm0432667",
      "name": "Katarzyna Jungowska"
    }
  ],
  "writer": [
    {
      "id": "nm0503287",
      "name": "Wojciech Lepianka",
      "description": null
    },
    {
      "id": "nm1679369",
      "name": "Eric Stepniewski",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm5584702",
      "name": "Michalina Olszanska",
      "character": "Roma Malinowska"
    },
    {
      "id": "nm1466093",
      "name": "Lukasz Simlat",
      "character": "Andrzej Malinowski"
    },
    {
      "id": "nm0843772",
      "name": "Grazyna Szapolowska",
      "character": "Mrs. Maka"
    },
    {
      "id": "nm0646037",
      "name": "Daniel Olbrychski",
      "character": "Homeless"
    },
    {
      "id": "nm0196449",
      "name": "Marta Dabrowska",
      "character": "Julia"
    },
    {
      "id": "nm0804518",
      "name": "Halina Skoczynska",
      "character": "Grandmother"
    },
    {
      "id": "nm2707925",
      "name": "Natalia Szygula",
      "character": "Helena"
    },
    {
      "id": "nm4657947",
      "name": "Piotr Toloczko",
      "character": "Kuba"
    },
    {
      "id": "nm2064990",
      "name": "Patrycja Markowska",
      "character": "Patrycja"
    },
    {
      "id": "nm10497722",
      "name": "Karolina Sapun",
      "character": "Asia"
    },
    {
      "id": "nm10497723",
      "name": "Bartosz Zysk",
      "character": "Michal"
    },
    {
      "id": "nm4808723",
      "name": "Krzysztof Kaminski",
      "character": "Teacher"
    },
    {
      "id": "nm2431276",
      "name": "Andrzej Baranowski",
      "character": "Professor"
    },
    {
      "id": "nm10497724",
      "name": "Malgorzata Debska",
      "character": "Jowita"
    },
    {
      "id": "nm8902446",
      "name": "Marie Carrour",
      "character": "Olga"
    },
    {
      "id": "nm3980242",
      "name": "Arkadiusz Golebiowski",
      "character": "Shelter worker for homeless people"
    },
    {
      "id": "nm10497725",
      "name": "Eliza Walszczyk",
      "character": "Agata"
    },
    {
      "id": "nm10497726",
      "name": "Patryk Walczak",
      "character": "Sebastian"
    },
    {
      "id": "nm2634389",
      "name": "Elzbieta Sloboda",
      "character": "School's Owner"
    },
    {
      "id": "nm3212316",
      "name": "Andrzej Lelito",
      "character": "Guardian"
    },
    {
      "id": "nm7818686",
      "name": "Ewa Sikorska",
      "character": "Nurse"
    },
    {
      "id": "nm5307229",
      "name": "Gaja Listewnik",
      "character": "Nurse"
    },
    {
      "id": "nm10497740",
      "name": "Bartosz Adamski",
      "character": ""
    },
    {
      "id": "nm9298850",
      "name": "Milosz Bielski",
      "character": ""
    },
    {
      "id": "nm10497737",
      "name": "Maxine Chanson",
      "character": ""
    },
    {
      "id": "nm10497727",
      "name": "Pawel Dubel",
      "character": ""
    },
    {
      "id": "nm7259019",
      "name": "Zuzanna Kalinowska",
      "character": ""
    },
    {
      "id": "nm10497736",
      "name": "Lukasz Kasprzak",
      "character": ""
    },
    {
      "id": "nm8036686",
      "name": "Marcin Koczot",
      "character": ""
    },
    {
      "id": "nm2674362",
      "name": "Pawel Konofalski",
      "character": ""
    },
    {
      "id": "nm10497738",
      "name": "Karolina Matej",
      "character": ""
    },
    {
      "id": "nm10497732",
      "name": "Adam Myslinski",
      "character": ""
    },
    {
      "id": "nm10497733",
      "name": "Ewa Nowak",
      "character": ""
    },
    {
      "id": "nm10497728",
      "name": "Sebastian Piekarek",
      "character": ""
    },
    {
      "id": "nm10497734",
      "name": "Raphael Rautureau",
      "character": ""
    },
    {
      "id": "nm10497731",
      "name": "Rafal Sedek",
      "character": ""
    },
    {
      "id": "nm10497735",
      "name": "Lynsey Sutherland",
      "character": ""
    },
    {
      "id": "nm10497729",
      "name": "Adrian Szczotka",
      "character": ""
    },
    {
      "id": "nm10497730",
      "name": "Agnieszka Trzeszczak",
      "character": ""
    },
    {
      "id": "nm5504181",
      "name": "Marija Zhuk",
      "character": ""
    },
    {
      "id": "nm10497739",
      "name": "Pawel Zwirello",
      "character": ""
    }
  ],
  "overview": null,
  "storyline": "After her mother's death 15-year-old Roma falls ill with a strange disease. Previously distant and emotionally cold towards the teenager, now driven by fear for his daughter's life, her father tries to rebuild their mutual relations.",
  "plot": "In 479 BC, one year after the famed Battle of Thermopylae, Dilios, a hoplite in the Spartan Army, begins his story by depicting the life of Leonidas I from childhood to kingship via Spartan doctrine. Dilios's story continues and Persian messengers arrive at the gates of Sparta demanding \"earth and water\" as a token of submission to King Xerxes; the Spartans reply by killing and kicking the messengers into a well. Leonidas then visits the Ephors, proposing a strategy to drive back the numerically superior Persians through the Hot Gates; his plan involves building a wall in order to funnel the Persians into a narrow pass between the rocks and the sea. The Ephors consult the Oracle, who decrees that Sparta will not go to war during the Carneia. As Leonidas angrily departs, a messenger from Xerxes appears, rewarding the Ephors for their covert support.\n\nAlthough the Ephors have denied him permission to mobilize Sparta's army, Leonidas gathers three hundred of his best soldiers in the guise of his personal bodyguard; they are joined along the way by Arcadians. At Thermopylae, they construct the wall made up of stones and slain Persian scouts as mortar, angering the Persian Emissary. Stelios, an elite Spartan soldier, orders him to go back to the Persian lines and warn Xerxes after cutting off his whipping arm. Meanwhile, Leonidas encounters Ephialtes, a deformed Spartan whose parents fled Sparta to spare him certain infanticide. Ephialtes asks to redeem his father's name by joining Leonidas' army, warning him of a secret path the Persians could use to outflank and surround the Spartans. Though sympathetic, Leonidas rejects him since his deformity physically prevents him from holding his shield high enough; potentially compromising the phalanx formation, and Ephialtes is enraged.\n\nThe battle begins soon after the Spartans' refusal to lay down their weapons. Using the Hot Gates to their advantage, as well as their superior fighting skills, the Spartans repel wave after wave of the advancing Persian army. During a lull in the battle, Xerxes personally approaches Leonidas to persuade him to surrender, offering him wealth and power in exchange for his allegiance; Leonidas declines and mocks Xerxes for the inferior quality of his fanatical warriors. In response, Xerxes sends in his elite guard, the Immortals, later that night. Despite some Spartans being killed, they heroically defeat the Immortals (with slight help from the Arcadians). On the second day, Xerxes sends in new waves of armies from Asia and other Persian city-states, including war elephants, to crush the Spartans once and for all, but to no avail. Meanwhile, Ephialtes defects to Xerxes to whom he reveals the secret path in exchange for wealth, luxury, and a uniform. The Arcadians retreat upon learning of Ephialtes' betrayal, but the Spartans stay. Leonidas orders an injured but reluctant Dilios to return to Sparta and tell them of what has happened, a \"tale of victory\".\n\nIn Sparta, Queen Gorgo tries to persuade the Spartan Council to send reinforcements to aid the 300. Theron, a corrupt politician, claims that he \"owns\" the Council and threatens the Queen, who reluctantly submits to his sexual demands in return for his help. When Theron disgraces her in front of the Council, Gorgo kills him out of rage, revealing within his robe a bag of Xerxes' gold. Marking his betrayal, the Council unanimously agrees to send reinforcements. On the third day, the Persians, led by Ephialtes, traverse the secret path, encircling the Spartans. Xerxes' general again demands their surrender. Leonidas seemingly kneels in submission, allowing Stelios to leap over him and kill the general. A furious Xerxes orders his troops to attack. Leonidas rises and throws his spear at Xerxes; barely missing him, the spear cuts across and wounds his face, proving the God-King's mortality. Leonidas and the remaining Spartans fight to the last man until they finally succumb to an arrow barrage.\n\nDilios, now back at Sparta, concludes his tale before the Council. Inspired by Leonidas' sacrifice, Greece has mobilized. The Persians now face an army of 30,000 free Greeks led by a vanguard of 10,000 Spartans. After one final speech commemorating the 300, Dilios, now head of the Spartan Army, leads them to war, against the Persians across the fields of Plataea.",
  "synopsis": null
}