{
  "imdb_id": "tt4047132",
  "tmdb_id": "295379",
  "douban_id": null,
  "title": "Oru Oorla Rendu Raja (2014)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "132 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.1,
  "director": [
    {
      "id": "nm1583171",
      "name": "R. Kannan"
    }
  ],
  "writer": [
    {
      "id": "nm1583171",
      "name": "R. Kannan",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2156989",
      "name": "Vimal",
      "character": "Azhagu"
    },
    {
      "id": "nm3591550",
      "name": "Priya Anand",
      "character": "Priya"
    },
    {
      "id": "nm4262344",
      "name": "Soori",
      "character": "Mike"
    },
    {
      "id": "nm0621937",
      "name": "Nassar",
      "character": "Selva Vinayagam       (as Nasser)"
    },
    {
      "id": "nm8602109",
      "name": "Narendra Khatri",
      "character": "Railway policeman"
    },
    {
      "id": "nm3612256",
      "name": "Anupama Kumar",
      "character": "Selva Vinayagam's Wife"
    },
    {
      "id": "nm4446366",
      "name": "Thambi Ramayya",
      "character": ""
    },
    {
      "id": "nm3833752",
      "name": "Singamuthu",
      "character": ""
    },
    {
      "id": "nm3901254",
      "name": "A.R. Manikandan",
      "character": ""
    },
    {
      "id": "nm1468843",
      "name": "Kalairani",
      "character": ""
    },
    {
      "id": "nm6780198",
      "name": "Shankar Krishnamurthy",
      "character": ""
    },
    {
      "id": "nm6780199",
      "name": "Shruti Reddy",
      "character": "(as Shruthi Reddy)"
    },
    {
      "id": "nm6780200",
      "name": "Shasha Sri",
      "character": ""
    },
    {
      "id": "nm3106095",
      "name": "Vishakha Singh",
      "character": "Special appearance"
    },
    {
      "id": "nm4710376",
      "name": "Iniya",
      "character": "Special appearance"
    },
    {
      "id": "nm3164927",
      "name": "Stunt Silva",
      "character": "(as Selva Stunt)"
    },
    {
      "id": "nm2670388",
      "name": "Singampuli",
      "character": ""
    }
  ],
  "overview": "A young doctor decides to expose the inhuman working conditions in a factory run by a selfish owner. Attempts are made on her life, but two aimless drifters whom she encounters on a train come to her rescue.",
  "storyline": "Azhagu (Vimal) and Michael (Soori) are on the run from some angry villagers and board a train to Chennai. On the way they meet Priya (Priya Anand) a good hearted doctor and our hero falls madly in love with her. Priya is a crusader fighting for some workers in a factory run by the unscrupulous Selva Vinayagam (Nasser) and his cruel wife (Anupama Kumar). Priya's best friend Kalpana (Visakha Singh) had died due to the carelessness of the factory management who are trying to suppress it.",
  "plot": "Azhagu (Vimal) and Mike (Soori) are thick friends and happy-go-lucky jobless youths who just roam around doing nothing. They meet Priya (Priya Anand) in a train while trying to escape from a few goons who were chasing them for a reason. Initially they take Priya for a prostitute, but later understand that she is actually a doctor. Azhagu falls for her immediately and decides that he should become an engineer, so that he can marry Priya. Priya is saved by Azhagu from a man who tries to kill her. Azhagu then listens to her story.\n\nPriya had a friend Kalpana (Vishakha Singh), who was from a village where Priya went for a medical camp. There she learns that the people of that village are affected by potential cancer and other effects due to the Steel factory owned by Selva Vinayagam (Nassar). Priya enters the company with the help of Kalpana, who works there. Priya gathers proof and talks with Selva to provide Safety equipment to the workers so that no one gets affected further. But Selva denies and insults Priya, who leaves the place. Back in the factory, Kalpana operates a costly machine and unfortunately gets her hand stuck in it, resulting in huge blood loss. Priya begs the owners to dismantle the machine, so that Kalpana can be saved, but the owners are reluctant and Kalpana dies as a result. Hence Priya decides to sue the company and files a case against them. The case is being heard the next day and if Priya makes it to the Court, the company will lose the case. So she is being targeted by Selva's men. How Azhagu and Mike help Priya escape the goons and whether they help her to win the case forms the rest of the story.\n\nThe Story is centered on a factory in Kayalpattinam (Thoothukudi) which explores the safety of laborers in factories being at jeopardy. It was a noble effort by Kannan to have raised an awareness and caution to incorporate safety standards inorder to avoid any untoward incident that may harm the labourers' lives and lifestyle through this film. After the film's release, one of the most fatal incidents due to oversight in the Industrial safety measures happened at Ranipet Sipcot industrial estate in Vellore district when a tank of an effluent treatment plant collapsed on the compound wall of an adjacent factory where the employees were present. Ten workers died as a result of this nasty incident.",
  "synopsis": null
}