{
  "imdb_id": "tt4028134",
  "tmdb_id": "356690",
  "douban_id": null,
  "title": "Lake Fear (2014)",
  "genres": [
    "Comedy",
    "Horror"
  ],
  "country": "USA",
  "version": [],
  "imdb_rating": 4.9,
  "director": [
    {
      "id": "nm5426690",
      "name": "Michael Crum"
    }
  ],
  "writer": [
    {
      "id": "nm5427808",
      "name": "Gerald Crum",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2036520",
      "name": "Joshua Winch",
      "character": "Remington"
    },
    {
      "id": "nm5427630",
      "name": "Shanon Snedden",
      "character": "Jordan"
    },
    {
      "id": "nm6636119",
      "name": "Taylor LeeAnn Graham",
      "character": "Kathy       (as Taylor L. Graham)"
    },
    {
      "id": "nm5561796",
      "name": "Jessica McLeod",
      "character": "Tina       (as Jessica Willis)"
    },
    {
      "id": "nm5023994",
      "name": "Jori Gill",
      "character": "Stephanie"
    },
    {
      "id": "nm3109139",
      "name": "Dylan Alford",
      "character": "Eyeless Man"
    },
    {
      "id": "nm6762019",
      "name": "Daffy Daryll Arellano",
      "character": "Car owner       (as Daryll 'Daffy' Arellano)"
    },
    {
      "id": "nm2115227",
      "name": "Richard S. Blake",
      "character": "Jordan's father"
    },
    {
      "id": "nm3525818",
      "name": "Carly Capra",
      "character": "Creature 1"
    },
    {
      "id": "nm5427808",
      "name": "Gerald Crum",
      "character": "Monster 2"
    },
    {
      "id": "nm5426690",
      "name": "Michael Crum",
      "character": "Monster 2"
    },
    {
      "id": "nm2812754",
      "name": "Lorraine Eubank",
      "character": "Tina's Mom"
    },
    {
      "id": "nm5477146",
      "name": "Jason Mcroberts",
      "character": "Cowboy"
    },
    {
      "id": "nm6701245",
      "name": "Scott Rumsey",
      "character": "Pig Demon"
    }
  ],
  "overview": "Four girls go to a cabin in the woods, which is inhabited by evil. This cabin then ensnares them in a labyrinth of macabre as they must battle their way out.",
  "storyline": "Tina, Jordan, Kathy and Stephanie head to a cabin for a weekend get away. They sneak into an abandoned cabin for a bit of adventure as they enjoy their time away from it all. After stumbling upon a doll that has been watching them the entire time they end up also finding a tape recorder that dictates different evils that the cabin possesses. The girls don't pay any attention to it until the evil in the cabin starts playing with them. They become locked in a battle with the evil that wont let them go. This is a comedy / horror . A generic spoof like premise that decides to take a new twist That audiences will not expect.",
  "plot": "Count Greven (Bruno de Carli) returns to his old castle after spending several years touring the world. The servants note how the count has changed: he is now withdrawn and fearful. He orders that the doors to the castle be kept locked and no one admitted. When he is left alone in his room, Greven opens a chest he brought from his travels, inside it there is a strange statue that he adds to his vast collection of rare works of art. Several days pass and a worried servant (Bernhard Goetzke) informs the town's minister (Hermann Picha) about his master's melancholia. The old man visits the castle looking to help. The count confesses the minister how, during his stay in India, he had heard of a statue of Buddha that was so beautiful that it made the sick well and the sad joyous; while visiting the temple, he stole the figure and smuggled it back home. The count tells the minister that the temple's priest swore a terrible revenge upon him for his sacrilege, and he has been living in fear of their secret powers ever since. The minister leaves shocked, believing that Greven has gone mad. The count screams in despair that he no longer wants to live, since the agony of suspense is worse than death.\n\nOne night, a turbaned figure does appear on Greven's grounds. The count demands that the Indian priest (Conrad Veidt) kills him right then and there to end his suffering, but the man refuses. He warns that - from that very day - the count will only have seven years to live life to its fullest, after which he will die by the hand of the one who loves him most. The count spends those years seeking out every joy life holds. He throws bacchanalias and hosts gambling parties, but soon these pleasures no longer satisfy him. Looking to obtain fame, Greven researches obsessively a means to cure world hunger, but after succeeding, he capriciously destroys it, all for his amusement. Still looking for fulfillment and meaning, he becomes involved with a young woman (Mechthildis Thein) and revels in the experience of love. He and the young woman are wed.\n\nNevertheless, as the fateful day approaches, he becomes paranoid and terrified once again. Desperate, he decides to leave his castle and travel around the world once again, however he can't depart from his wife and cancels his trip. Greven then takes the statue and throws it into a lake, hoping the curse of the priest goes away with it, only to find it back in his home right after. Trusting no one - he even suspects that will be his wife's hand that will slay him - he shoots himself. The statue is retrieved from Greven's castle and carried back to India in the hands of the mysterious priest.",
  "synopsis": null
}