{
  "imdb_id": "tt4087996",
  "tmdb_id": "317991",
  "douban_id": null,
  "title": "Black Stone (2015)",
  "genres": [
    "Drama"
  ],
  "country": "South Korea",
  "version": [
    {
      "runtime": "93 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm2408025",
      "name": "Gyeong-tae Roh"
    }
  ],
  "writer": [
    {
      "id": "nm2408025",
      "name": "Gyeong-tae Roh",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4150579",
      "name": "Kate Velarde",
      "character": ""
    },
    {
      "id": "nm3669207",
      "name": "Erlinda Villalobos",
      "character": "Phungtai"
    },
    {
      "id": "nm3676169",
      "name": "Tae-hee Won",
      "character": ""
    }
  ],
  "overview": "Artist/filmmaker Roh has an impressively sombre world view; based on the sad fate of a Filipino-Korean family, he shows a decayed society where it’s impossible...",
  "storyline": "While his parents are toiling away in a food processing plant in Seoul, Shon Sun is drafted in the army. But being prey to abuse, he deserts. Back in Seoul he finds out his parents have disappeared. Intent on finding them, he embarks on a journey through the contaminated jungle his father was born in.",
  "plot": null,
  "synopsis": "Shon Sun n'est pas tout à fait Coréen. Il ne vient pas non plus vraiment d'ailleurs. Il est simplement Shon Sun.\nSes parents adoptifs ont quittés la jungle et leur village de pêcheurs depuis bien longtemps et travaillent dans une usine illégale de fabrication de nourriture animale. Alarmée, Shon Sun est violé par le lieutenant Ko Ah-Shen. Contaminé par le SIDA, il tue le Lieutenant et s'enfuie, clandestin, sur la route de son village d'origine, Guro. Une fois rentré, Shon Sun apprend la disparition de ses parents adoptifs. Sa mère est morte, son père disparu. Il décide alors d'emprunter le chemin de la jungle, celui de ce village lointain dont lui parlait si souvent son père adoptif, Ching Tuang, et où réside sa grand mère adoptive, Pung Tai ...\nEcoeuré par une terre dévastée et par les vices humains, Shon Sun s'abandonne à sa maladie et à sa tourmente. Au plus profond de la jungle tropicale, Il atteint le point de rupture.\nIl aperçoit alors Ching Tuang et Pung Tai. Inlassablement, ils ramassent des pierres noires pour les reposer à leur place, après les avoir nettoyées de toute pollution. X les rejoint, et commence à nettoyer une de ces pierres ...Shon Sun is not Korean. He does not really come from any other place. He is just Shon Sun.\nHis adoptive parents have left the tropical jungle and their fishing village a long time ago. They are now working in an illegal animal feed factory. Engaged in the army, Shon Sun is raped by the Lieutenant Ko Ah-Shen. He gets HIV. He kills the Lieutenant and runs away on the road to his home village. He is a murderer. And a deserter. At home no one is there. His adoptive mother, Shon Rae-son, is dead and his adoptive father, Ching Tuang, just disappeared. He decides to take the jungle road. Ching Tuang often told him about a small village in the jungle depths. A small fishing village where his grand mother, Pung Tai, is supposed to live\nDisguted by a wasted world and the human vices, Shon sun gives way to his illness and his fear. In the deepest area of the tropical jungle, he reaches the breaking point.\nHe suddenly catches sight of Ching Tuang and Pung Tai. They tirelessly pick up black stones and replace it on the same place, after having cleaned it. Shon Sun joins them. He sits down and begins to clean a stone. A black stone."
}