{
  "imdb_id": "tt4094724",
  "tmdb_id": "316727",
  "douban_id": null,
  "title": "The Purge: Election Year (2016)",
  "genres": [
    "Action",
    "Horror",
    "Sci-Fi",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "108 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm0218621",
      "name": "James DeMonaco"
    }
  ],
  "writer": [
    {
      "id": "nm0218621",
      "name": "James DeMonaco",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0342029",
      "name": "Frank Grillo",
      "character": "Leo Barnes"
    },
    {
      "id": "nm0593310",
      "name": "Elizabeth Mitchell",
      "character": "Senator Charlie Roan"
    },
    {
      "id": "nm0932112",
      "name": "Mykelti Williamson",
      "character": "Joe Dixon"
    },
    {
      "id": "nm1928515",
      "name": "Joseph Julian Soria",
      "character": "Marcos"
    },
    {
      "id": "nm3340597",
      "name": "Betty Gabriel",
      "character": "Laney Rucker"
    },
    {
      "id": "nm0785352",
      "name": "Terry Serpico",
      "character": "Earl Danzinger"
    },
    {
      "id": "nm0388064",
      "name": "Edwin Hodge",
      "character": "Dante Bishop"
    },
    {
      "id": "nm0001717",
      "name": "Kyle Secor",
      "character": "Minister Edwidge Owens"
    },
    {
      "id": "nm0634218",
      "name": "Barry Nolan",
      "character": "Reporter #1"
    },
    {
      "id": "nm1154919",
      "name": "Liza Colón-Zayas",
      "character": "Dawn       (as Liza Colon-Zayas)"
    },
    {
      "id": "nm0680392",
      "name": "Ethan Phillips",
      "character": "Chief Couper"
    },
    {
      "id": "nm2592774",
      "name": "Adam Cantor",
      "character": "Tall Eric Busmalis"
    },
    {
      "id": "nm0048336",
      "name": "Christopher James Baker",
      "character": "Harmon James"
    },
    {
      "id": "nm6221266",
      "name": "Jared Kemp",
      "character": "Rondo"
    },
    {
      "id": "nm4212725",
      "name": "Brittany Mirabile",
      "character": "Schoolgirl #1 Freakbride"
    },
    {
      "id": "nm0000855",
      "name": "Raymond J. Barry",
      "character": "Leader Caleb Warrens"
    },
    {
      "id": "nm7895226",
      "name": "Naeem Duren",
      "character": "Rev w /              Angel in Command Center"
    },
    {
      "id": "nm3608877",
      "name": "Naheem Garcia",
      "character": "Angel Munoz"
    },
    {
      "id": "nm3519113",
      "name": "Steven Barkhimer",
      "character": "Drab Suited Man 1"
    },
    {
      "id": "nm0447376",
      "name": "Tom Kemp",
      "character": "Drab Suited Man 2"
    },
    {
      "id": "nm3092486",
      "name": "Portland Helmich",
      "character": "Moderator"
    },
    {
      "id": "nm4815384",
      "name": "Roman Blat",
      "character": "Uncle Sam"
    },
    {
      "id": "nm0048379",
      "name": "David Aaron Baker",
      "character": "Tommy Roseland"
    },
    {
      "id": "nm0587125",
      "name": "George Lee Miles",
      "character": "Irish Ike Jenkins"
    },
    {
      "id": "nm6319093",
      "name": "Antoine Coetzee",
      "character": "South African Male"
    },
    {
      "id": "nm3324218",
      "name": "Drew Cooper",
      "character": "Enormous Gang Member"
    },
    {
      "id": "nm1949214",
      "name": "Johnnie Mae",
      "character": "Mrs. Sabian"
    },
    {
      "id": "nm0660057",
      "name": "Tom Paolino",
      "character": "Axe Headed Man"
    },
    {
      "id": "nm1446091",
      "name": "Emily Petta",
      "character": "Screaming Woman"
    },
    {
      "id": "nm4782621",
      "name": "Alexander Cook",
      "character": "Masked Man"
    },
    {
      "id": "nm2535554",
      "name": "Juani Feliz",
      "character": "Schoolgirl #2"
    },
    {
      "id": "nm7147345",
      "name": "Jamal Peters",
      "character": "Gang Member with Dying Friend"
    },
    {
      "id": "nm1476990",
      "name": "Matt Walton",
      "character": "Reporter #1"
    },
    {
      "id": "nm0444352",
      "name": "Thomas Kee",
      "character": "Crazy Man (Self-Purger)"
    },
    {
      "id": "nm0267772",
      "name": "Lonnie Farmer",
      "character": "Man with Bull Horn"
    },
    {
      "id": "nm6416117",
      "name": "Christy Coco",
      "character": "Young Charlie Roan"
    },
    {
      "id": "nm8251920",
      "name": "Darcie Fisher",
      "character": "Reporter #3"
    },
    {
      "id": "nm6550424",
      "name": "Alexander Schuler",
      "character": "Demonic Man"
    },
    {
      "id": "nm0025305",
      "name": "Hank Amos",
      "character": "Mercenary #8"
    },
    {
      "id": "nm8251921",
      "name": "Lindsey Pires",
      "character": "Dancer #1"
    },
    {
      "id": "nm8251922",
      "name": "Emily Smith",
      "character": "Dancer #2"
    },
    {
      "id": "nm5202431",
      "name": "Kimberly Howe",
      "character": "School Girl #4"
    },
    {
      "id": "nm4007942",
      "name": "Malcolm C. Murray",
      "character": "Rev 2"
    },
    {
      "id": "nm3617785",
      "name": "Franz Strassmann",
      "character": "Mercenary"
    }
  ],
  "overview": "Two years after choosing not to kill the man who killed his son, former police sergeant Leo Barnes has become head of security for Senator Charlene Roan, the front runner in the next Presidential election due to her vow to eliminate the Purge. On the night of what should be the final Purge, a betrayal from within the government forces Barnes and Roan out onto the street where they must fight to survive the night.",
  "storyline": "It's been two years since Leo Barnes (Frank Grillo) stopped himself from a regrettable act of revenge on Purge Night. Now serving as head of security for Senator Charlie Roan (Elizabeth Mitchell), his mission is to protect her in a run for president and survive the annual ritual that targets the poor and innocent. But when a betrayal forces them onto the streets of D.C. on the one night when no help is available, they must stay alive until dawn...or both be sacrificed for their sins against the state.",
  "plot": "In 2022, a masked purger taunts a young woman (Cristy Coco) and her family. He then tells them they are going to play one final Purge game, called \"Mommy's Choice.\" When she refuses, the man moves slowly towards the family as they struggle.\n\nEighteen years later, two days before the Purge, riots break out all over Washington, D.C., claiming that the New Founding Fathers are using the Purge to help their economic agenda. The events make a great effect on the upcoming Presidential election. Charlie Roan (Elizabeth Mitchell), a Senator, is gaining ground over the NFFA's candidate, Minister Edwidge Owens (Kyle Secor). It is revealed that she is the young woman from the beginning, and that she alone was spared by the masked purger. The NFFA, headed by Caleb Warrens (Raymond J. Barry), view Roan as a threat to their rule and plan to use the upcoming Purge to eliminate her from play. Meanwhile, Roan and Owens attend a debate and, while Owens states how America's crime rates are lowering, Roan gets a standing ovation after she declares the Purge only serves to eliminate the poor and benefit the rich and powerful, after which she then breaks security protocol, by stepping into the audience. At a convenience store, owner and proprietor Joe Dixon (Mykelti Williamson), assistant Marcos (Joseph Julian Soria), and their friend, EMT Laney Rucker (Betty Gabriel), watch the coverage on television.\n\nOn March 20, the day before the Purge, the NFFA revokes the Purge rule that protects ranking 10 government officials, appearing to attempt to regain public favor, but is actually a front to kill Roan. That same day, Joe and Laney confront a teenage shoplifter named Kimmy (Brittany Mirabile) and her friend (Juani Feliz) both attempting to steal a candy bar. Later, an enraged Joe discovers that his Purge insurance rates have been raised beyond his affordability, prompting him to stake out and guard his store. Roan decides to wait out the Purge from her unsecured home in order to secure the popular vote of the common people. Her head of security, former police sergeant Leo Barnes (Frank Grillo), initially disagrees with the idea but accepts her reasons. He then revamps security and has Roan's house re-secured with new barricades and surrounded by secret service agents and SWAT snipers standing watch outside, with his partners Chief Couper (Ethan Phillips) and Eric Busmalis (Adam Cantor) as well as three more secret service agents partly supervising the event from indoors. Meanwhile, a group of tourists at Dulles Airport are interviewed by a news anchor wherein their response is to join the Purge. News of airports across America flooding with more tourists traveling to the United States to witness or join the Purge make the press dub them as \"Murder Tourists\".\n\nAfter Purge Night commences, Joe and Marcos repel an attack by the teenage shoplifters, injuring Kimmy. Laney and her partner Dawn (Liza Colón-Zayas) patrol the city in a heavily modified ambulance, rendering medical care to the wounded. Roan and Barnes are betrayed by Couper and Busmalis, who signal a Neo-Nazi paramilitary force led by Earl Danzinger (Terry Serpico) and secretly let them into the household, having killed all the secret service agents and SWAT snipers. As the troops assassinate the three remaining secret service agents, Barnes manages to get Roan to safety, but is wounded in the process. He detonates a bomb in the house, killing Couper, Busmalis, and a few troops. Navigating through the hostile streets of Washington D.C. to seek safer shelter, Roan and Barnes are ambushed and taken captive by a group of Murder Tourists. While the group taunts them, Marcos spots the commotion, prompting him and Joe to leave the store's roof and rescue the duo. They shoot the group dead and take Barnes and Roan to Joe's store. Roan converses with the two while Marcos tries to tend to Barnes' wound. As Barnes and Joe get into a light argument, Marcos then witnesses the teenage shoplifters returning in two groups, causing Joe to call Laney and Dawn for backup, who can't respond immediately as they are treating a teenage boy named Rondo (Jared Kemp). As Barnes, Roan, Joe and Marcos prepare to defend themselves, Laney and Dawn arrive and run over Kimmy and her friend with their ambulance. Laney then guns down the other shoplifters before finishing off a heavily wounded Kimmy with a point-blank headshot. The group then leave the store for a safer hideout.\n\nWith all seven safe in the ambulance, the group is ambushed by a helicopter piloted by Danzinger, who end up killing Rondo. The surviving six then seek refuge underneath a highway overpass wherein Barnes deduces they were found because the bullet in his chest is a tracker. After he extracts the bullet, the group is confronted by members of the Crips but when Joe gives the gang's trademark whistle call (revealing that he was once their member), the Crips calm. Their leader asks the group to tend to his heavily injured \"boy\" to which the group agrees. In return for the group's actions, the Crips plant the bullet in another area to trick the paramilitary forces after telling the former to leave. When two of Danzinger's ground team members find the bullet, the Crips emerge from hiding and eliminate them.\n\nBarnes, Roan, Joe, Laney, Dawn, and Marcos are led to a hideout beneath a hospital protected by anti-Purge rebels led by Dwayne Bishop (Edwin Hodge) where volunteer doctors and nurses administer to wounded Purge victims while other professionals supply food, water, and medicines. Joe, Marcos, and Laney decide to go back to the store, but are forced to turn back after spotting several NFFA death squad trucks heading to the hideout, prompting Laney to report to Dawn. Meanwhile, Roan discovers the rebels are planning to assassinate Owens and tries to dissuade them, as she wants to win the election fairly. They are forced to flee as Dawn alerts the entire hideout of death squad forces arriving. Barnes and Roan survive the hostile alleyways and they meet up again with the ambulance. However, before the group can escape the city, the ambulance is rammed by Danzinger, and Roan is seized.\n\nThe senator is delivered alongside a drug addict name Lawrence by Danzinger to an NFFA-captured Catholic cathedral where Owens presides over a midnight Purge mass, while Barnes and the others give chase. The group meet up with Bishop and his team wherein they formulate a plan to rescue Roan by infiltrating the cathedral through a tunnel system. Meanwhile, at the cathedral, Owens has his friend Harmon James (Christopher James Baker), another NFFA loyalist, stab Lawrence as a cleansing ritual for his longtime vice. As he invites the high-ranking members of the NFFA to the altar to sacrifice Roan with Warrens to lead them in the purging, the group and Bishop's team reaches the cathedral wherein Barnes and his team stealthily eliminates the NFFA Secret Service Agents and get to the choir loft to position.\n\nAs Warrens begins to slit Roan's throat, Marcos assassinates him from the choir loft, instigating a chaos that signals Bishop's team to invade the cathedral. As the entire congregation begins to disperse and flee in panic, the group fires into the fleeing crowd, killing a vast number of them and leaving only a few, including Owens and James, to escape. A second horde of NFFA secret service agents attempts to eliminate the group but are gunned down by Bishop's team. After the rebels untie Roan, the group head to the cathedral's crypt to find Owens. Bishop captures Owens and contemplates killing him, to the protests of Roan and Barnes, while Owens goads him on to kill him. Bishop refrains, and spares him on the condition that Roan wins the election. As Barnes knocks Owens unconscious with Joe watching, the group also discovers a large number of bound and gagged Purge mass sacrifice victims that Owens had stashed in the crypt.\n\nBishop and his men decide to secure transport to leave the cathedral while Barnes, Roan, Joe, Laney and Marcos attempt to untie the captives. However, they are soon ambushed by Danzinger and his mercenaries, leaving the rebel team killed and Bishop wounded. Barnes rushes out to help him, leaving Roan in the care of Laney and company. Bishop manages to dispatch the remaining mercenaries but is fatally gunned down by Danzinger. Seeing this, Barnes engages Danzinger in a vicious melee combat wherein the former gains the upper hand, killing the latter. As Roan frees some of the last of Owens' imprisoned victims, James emerges from hiding and fires at the group, killing one of the newly freed victims. After incapacitating Laney and wounding Marcos, he targets Roan but Joe steps in and engages in a furious crossfire with James, finally killing him with a headshot. Before succumbing to his injuries, Joe urges Roan to win the election and tells Marcos and Laney to take care of his store.\n\nOn May 26, two months after the Purge, Roan defeats Owens in the presidency by a landslide while Barnes is promoted to head of Secret Service while continuing his service as her chief of security. Marcos and Laney renovate the store and continue to run it in Joe's honor while they watch the news of Roan's victory and another report indicating that outlawing the Purge has become Roan's top priority. Further reports state that many NFFA supporters have reacted to the election results with violent protests in the streets as Marcos looks at an American flag hanging outside the store.",
  "synopsis": "The film starts on Purge Night. A couple of masked men are keeping a family tied up. One of the men says they are going to play \"Mommy's Choice\" to see which one of them will live through the night.18 years later. Two days before Purge Night.We see a news report on Senator Charlie Roan (Elizabeth Mitchell), who is running for presidency and is aiming to get rid of The Purge, stating how it only serves to eliminate the poor, the homeless and other lower classes of society that make up of the majority of America's population. It was her family that was murdered in front of her that night, leaving her as the only survivor. Purging has become so popular that foreigners are visiting the U.S. to get in on the action. Running against her is Minister Edwige Owens (Kyle Secor). In a secret meeting in Washington DC, the New Founding Fathers of America counsel want to get rid of Charlie by any means necessary. The leader and chairman, Caleb Warrens (Raymond J. Barry), has something sinister in mind.Meanwhile we are introduced to Joe Dixon (Mykelti Williamson), a convenience shop owner. He runs the place with his assistant Marcos (Joseph Julian Soria), while his friend, an EMT named Laney (Betty Gabriel), pays them a visit. Marcos spots two uniformed schoolgirls attempting to shoplift some candy. Joe confronts them, leading one of the girls, Kimmy (Brittany Mirabile), to rudely dismiss him. She is forced to do so when Laney steps in, as Kimmy idolized Laney when she was known as \"Pequeña Muerte\" (Little Death) in school. Joe then gets a call that his Purge insurance rates have been jacked up, and if he doesn't pay by the next day, his store won't be protected. He decides to guard the store himself.Charlie is guarded by Leo Barnes (Frank Grillo), who also wants to put an end to Purge Night. It has been two years since Leo attempted to kill the person who killed his son on the last Purge Night (from the previous film). Charlie decides to stay in her own home instead of a bunker so that she can stay on the good side of voters.Purge Night arrives. The announcement goes off that no one, including elected officials, is off limits tonight (in complete contrast to certain high-ranking Level 10 officials in the previous two Purge films). Leo secures Charlie's home, with snipers standing watch outside. A few minutes later after the commencement, all the snipers are shot dead by unseen marksmen. Leo finds out that Chief Couper (Ethan Phillips) and Tall Eric Busmalis (Adam Cantor) have betrayed them, and are allowing an armed mercenary team led by a skinhead named Earl Danzinger (Terry Serpico), to storm the house. Leo guides Charlie out of the house through a tunnel beneath the house. He then sets off a bomb he left, killing the villains left inside the house including Couper and Tall Eric.While Laney patrols the city in her van, Joe and Marcos sit on the roof of the store to keep an eye out for Purgers. A car covered in Christmas lights rolls up. Three girls with creepy masks step out. One of them takes off her mask, revealing her to be Kimmy, her face caked in blood. She claims to have just killed her parents, and she plans to break into the store to retaliate against Joe. Marcos scares her off by shooting her which the bullet only gazes her ear.Charlie and Leo run out into the streets, trying to avoid the Purgers. They are ambushed by a small group of foreign Purgers. As one of them brags about how they'll kill them, Joe and Marcos show up and shoot all the Purgers. They take Charlie and Leo inside the store for protection. Joe calls Laney to tell her that they have Charlie with them.Kimmy and her goons return to break into the store. They try to cut through the place with power saws, but Laney shows up and plows Kimmy down with her van. She steps out and shoots the other girls before blowing Kimmy's brains out. Laney urges everyone to hop in the van. Another shoplifter is trying to break in from the back. Joe wants to stay, but Laney won't let him, and when Marcos says he'll stay if Joe stays, Joe decides to join them.The group is shot at by a helicopter. Leo pulls a bullet from his chest from the raid at Charlie's house when he discovers a tracker bullet that led the villains to Charlie. As they continue moving, they are followed by some Crips gang members also out tonight on Purge Night. Joe manages to get them to back off by doing the Crips whistle, revealing his own past as a gang member. The Crips ask the group to help one of their own in exchange for a favor. When two of Danzinger's teammates show up and find the bullet, they run into the Crips, who shoot them dead.The group goes to a hidden location led by Dante Bishop (Edwin Hodge), the new leader of the anti-Purge movement. Many victims are being treated there by professionals. Charlie tries to persuade Dante to not kill Owens. A death squad infiltrates the place, forcing the group to run. Their van gets rammed by Purgers, and Charlie gets taken.Charlie is brought to Owens' church for a Purge mass. Warren prepares to slit her throat, but the others arrive in time, and Marcos kills Warren. The rest of the congregation flees. Dante considers killing Owens, but Charlie and Leo talk him out.Danzinger and his men show up and start Purging. He kills Dante and fights with Leo, ending in Leo killing him. Owens's assistant comes out with a gun and heads toward Charlie. Joe steps in and shoots at the man, taking a few shots himself before getting the guy with a headshot. Joe succumbs to his wound and states his hope for Charlie to win and for Marcos to take care of the store. Two months later. Election Day.Charlie wins the presidency in a landslide and proceeds to start the plan to get rid of Purge Night. Marcos and Laney now take care of Joe's store in his memory. Before the end credits begin, we hear a news report that Purge supporters are reacting to the election results with violence."
}