{
  "imdb_id": "tt4075614",
  "tmdb_id": "301820",
  "douban_id": null,
  "title": "DMTSoup (2014)",
  "genres": [
    "Adventure",
    "Comedy",
    "Drama",
    "Thriller"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "78 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.9,
  "director": [
    {
      "id": "nm2431728",
      "name": "Chris Budziszewski"
    }
  ],
  "writer": [
    {
      "id": "nm2431728",
      "name": "Chris Budziszewski",
      "description": "story"
    },
    {
      "id": "nm2431728",
      "name": "Chris Budziszewski",
      "description": "writer"
    },
    {
      "id": "nm2431728",
      "name": "Chris Budziszewski",
      "description": null
    },
    {
      "id": "nm6807120",
      "name": "Tom Foolery",
      "description": "co-writer"
    },
    {
      "id": "nm6807120",
      "name": "Tom Foolery",
      "description": "story"
    },
    {
      "id": "nm6807120",
      "name": "Tom Foolery",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2431728",
      "name": "Chris Budziszewski",
      "character": "Chris"
    },
    {
      "id": "nm6807120",
      "name": "Tom Foolery",
      "character": "Tom"
    },
    {
      "id": "nm6807121",
      "name": "Filip Hajduk",
      "character": "James Brandy"
    },
    {
      "id": "nm6807122",
      "name": "Vanessa Budziszewski",
      "character": "Jennifer"
    },
    {
      "id": "nm6807123",
      "name": "Brandon Ostrowski",
      "character": "David"
    }
  ],
  "overview": "After being exposed to an ultra-rare powder, a drug dealer is met by a spiritual force that induces a life-altering ultimatum.",
  "storyline": "After being exposed to an ultra-rare powder, a drug dealer is met by a spiritual force that induces a life-altering ultimatum; to track down and kill a guidance counselor turned fugitive. This experimental film is filled with original content that engages and challenges the viewer. While its main goal is to entertain with every frame, DMTSoup is above all else, a fresh take on modern cinema with a heavy tie in with the score. Which elements are real and which are due to the drug-induced state of the main character? Only time will tell.",
  "plot": null,
  "synopsis": "A brief collage of landscapes and cities within North America are presented along with an industrial score. A night city skyline is met with the title, DMTSoup.The voice of a news anchor previews the latest item; a prostitution ring run by high-school guidance counsellor, James Brandy was shut down by authorities after two students have come forward with evidence.A reporter on the scene at the school delves deeper adding that Brandy utilized a social networking website in order to lure in students with promises of money, better grades and samples of highly addictive substances. The news bulletin reads: James Brandy; high school teacher missing, suspected of distributing phantom drugs.A young couple stand in front of said high school while being interviewed. The girl mentions that Brandy was involved with some strange new drug, and that he used to be her history teacher. The boy adds that he had him as a guidance counselor and that he seemed friendly and aided students with their issues.Inside of a suburban home, Chris (Chris Budziszewski) talks on his phone sitting on a couch and watching television. He boasts about his latest marijuana shipment, naming it Boombastic Kush and agreeing to a meet. On the coffee table in front of him, sits an assortment of drug paraphernalia, including a glass bong, a hookah, wine bottles and a grinder. An obscured video plays on the screen.He changes the channel to the news. From another angle, a baseball bat, a deck of cards and a wooden box is also seen on the table. The news reads: Exclusive footage of suspected abuser creates online craze and viral status. A young man is shown smoking out of a bong among some friends, smiling at the camera. The news title card emerges, Six @ Six News.A calendar of December 2012, a clock reading 5:04 and a package with Fragile written on it is placed at the foot of the door to Chris basement apartment. The unidentifiable person rings the doorbell and leaves. Moments later, Chris opens the door and curiously picks up the package. He rips it open, and excitingly gasps. He removes a smaller box with congratulatory writing upon it. A glimpse of a disclaimer mentioning random participants in a survey is briefly shown and Chris lifts the cover of the box. The contents are blurred as a transition with a portal opens. Through the portal Tom drives his car towards the meeting point.A time-lapse of his drive through sunrise is shown, along with the opening credits. He arrives at a convenience store. Tom jumps back into his car and hangs a Yoshi stuffed dinosaur on his rear-view mirror. This image of the store displays on an ipad on Chris coffee table. As the view pans, the tables contents; an empty notepad, another note reading -40 degrees Celsius, and the date, Dec 02, 2014 is presented before the television continues the scene of Toms drive.He arrives at a park, where he leaves his car running. The car stereo is heard listing various side effects, including delusions, blackouts, time-loss, high energy spikes, mild dementia, hallucinations and spirit talk, but is cut off due to Tom returning to turn off the car.Tom meets Chris on a park bench. They proceed with the exchange, Chris asking Tom for twenty dollars. He passes it under the bench to be less suspicious. Chris then offers to share a smoke with Tom, to which he agrees. Tom lights up Chris joint.Tom smokes as well, and they converse about the initial impact of the marijuana. Tom compares it to his teacher molesting him and receiving an A+ while Chris finds it hard to compare to much of anything.\nLying on the snow staring at the clouds, they shiver and talk nonsense. Tom describes his vision to be in a Jurassic Park style, while Chris points out that there are large amounts of kind dinosaurs. He spots a Tyrannosaurus Rex cloud floating by. After a few more exchanges, Tom sits up and flicks away the remainder of the joint. Within a flash of the flick, he spots a dark being standing in front of him. Before his eyes can register what he saw, the figure disappears and Toms confusion leads him to question, Boobies?.Tom stumbles away while Chris walks after him. The park bench reads Fairview Park. The two scare a crowd of geese in the distance, and the bench reading changes to Farewell Park.The duo walk down various streets, fields and underneath a bridge before crossing through a forest. As Tom leads, Chris is distracted by a television screen sitting among the trees. He stares into the screen, which displays Tom and himself with slightly altered hair walking through the forest.The video continues, with Tom following Chris through dense woods. He stops, mutters to himself that he cant continue, and turns back. He attempts to play hacky sack until Chris reemerges with a gun. He points it at Tom, saying that he led him astray. Tom lifts his hands in surrender and mutters that Chris knows better than to do so. The video ends and Chris stares in disbelief at a blank screen. Tom turns to notice Chris absence, and snaps him out of his hallucination.He pulls out a red map, with You are Here written in bold with no other details. He points to the here, and gives out directions to Chris, who nods in understanding. They continue their walk.A whisper is heard off-screen, and Tom stops in his tracks. He lifts his head up from the map and stares with horror. The figure he witnessed earlier is standing among the trees. It tells him, You will die in 29 days, 13 hour, 4 minutes and 11 seconds. Chris stands beside Tom staring at the figure, which after more inspection is seen as a phantom. It adds that he can save his soul by executing another person in his place that is beyond saving. The phantom directs them back to their package by 6pm. Tom runs away and Chris follows.They run through the forest and enter a portal. The phantom is heard reciting a poem. Chris and Tom walk aimlessly through a night city that seems deserted save for a few vehicles in the distance. The phantoms poetry asks Chris and Tom to question their minds understanding of the current events, instructing them both to focus on the task at hand as doing so will aid in avoiding their demise.The duo pass through another portal, back to the forest. Chris questions their teleportation, but Tom quickly disregards it saying, Thats impossible. They continue on to a busy street. Chris looks at his watch and warns Tom that they have 30 seconds to make it home. He counts down as both attempt to cross the street. A time-lapse of their many failed attempts at crossing plays out, but finally they make it to the other side. Tom and Chris stare at the clock inside Chris home which displays 5:33. Tom points out that there was plenty of time asking Chris why he counted down. Chris reveals that his watch is broken, and Tom responds with saying there was about an hour to use up, and he heads to the couch after dropping his coat on the ground. Chris hangs up Toms coat and continues into the kitchen.A montage of Chris preparing the marijuana and smoking it through a bong ensues and the two spend the rest of their time on the couch playing video games as the clock lapses forward to 6:oo. The phantom appears in Chris hallway pointing to the television screen. The two watch the screen as a news item is presented. A breakdown of ingredients: meth, cocaine, dmt, lsd, mineral spirits and other unknown nitrates are said to be within dmtsoup. The report mentions strange packages of dmtsoup being distributed at random. Chris comes to a realization that the marijuana he had been smoking was spiked with what the news described. Tom asks Chris if he has more of it and Chris responds that he still has a whole box. The phantom exits after giving them a week until their next instruction.A montage of Chris and Tom spending a week bonding over dmtsoup via drinking whiskey, competing in video games, smoking outside of the house, becoming ill, debating over the last slice of pizza, making shisha bubbles, and dancing in the hallway. The calendar is show as the days go by, ending with a week completed.Tom builds himself a bong out of a water bottle. He takes a hit and teleports. His mind takes him to a car parked outside Chris house. Tom sits in the backseat while Chris sitting at the drivers seat babbles about his spirit animal. A speeding car incoming is heard off-screen and Tom stares outside his window. He screams as the car crashes into him, but realizes he is sitting on a park bench with Chris continuing his monologue. Chris mentions flying and forgetting to use his jet boosters, causing him to freak out over falling, adding that Tom was there as well. Toms face morphs in size during this and he looks up into the sky. When he looks back down hes sitting with Chris outside of Chris home. Chris completes his speech with a mention of dinosaurs returning and that it was all one crazy trip. Tom responds by telling Chris hes never felt this way before. He completes his sentence having teleported back to his initial spot in the kitchen with his water bong in his hand. Chris lies next to him and sits up. He takes the bong from Tom and tells him that everything that occurred to them must be because of Tom and that he is to blame. As Chris smokes, Tom's gaze wanders to the ceiling. Outside, the roof of the house, storm clouds drift by and the phantoms laugh is heard.Tom and Chris discuss the delivery. Tom questions the source of the package and Chris responds with saying that they were simply samples from a survey. After a childish argument breaks out over whether or not the phantom was trying to steal their package, it appears before them. It states their task is simple: to cast a lure and catch their prey. The phantom exists and Tom finds a grenade in the package.The image of this is shown on an ipad on Chris coffee table, along with the notepad with lure your prey lastly added to it, another note stating -10 degrees Celsius, deflated balloons, and the date shown as December 10, 2012. The television continues the scene left by the ipad.Tom sits in the hallway tossing the grenade in his hand. He thanks the phantom for the present as Chris walks in. He mentions that his birthday is forthcoming and that he wants a lot of balloons. He asks Tom how he can prove his reliability as a sidekick. Tom responds with saying he's attractive, then asking Chris for some privacy as he walks over to the computer.Tom is seen on an online social dating website, called Phase:Boob luring in James Brandy through a profile showcasing himself as a female prostitute. During this Chris drives to another park, sits on a bench and lights himself a joint. Chris teleports back to his couch, staring at himself on the television staring back at him as if a mirror. His face begins to morph alike Toms. He tries to speak, but the television duplicates itself within, creating a tunnel of televisions. Chris and his multiples move back and forth through the layers of televisions in near second sync. In a flash, Chris is in the middle of a shower with his clothes still on. He looks around in bewilderment. He calls out for Tom once noticing the water was not flowing though he could hear it. He continues in a room filled with stuffed animals and grows afraid. He tries to snap out of his trip by clapping his hands, but the clap sends him into the middle of the street where he stands amidst passing traffic. Chris is back on the park bench trying to subdue his trip.The image of this is shown on the ipad on Chris coffee table, along with the notepad with train for killing lastly added to it, another note stating +26 degrees Celsius, deflated balloons, and the date shown as December 17th, 2012. The television continues the scene left by the ipad as Chris and Tom train in the backyard by performing various mild exercises.During this training, the duo come to an agreement that by working together they can proceed with their task to kill and bury their target in order to save their souls. Later, Tom times Chris doing a lap around a runner's track. Tom reveals the watch he was using is broken, so Chris hands Tom his phone to use. After another lap, Chris finds out Tom couldn't figure out how to use the phone and didn't time him again.Tom babbles drunkenly while drinking the remainder of his wine. He chugs another bottle of wine and steps away to the fridge. He looks inside and a portal opens. He watches himself from a different angle discuss a plan with Chris on how to commit their murder, with Chris whipping out the red map from earlier in the forest, instructing Tom to follow his plan instead. Tom looks deeper into the fridge and teleports himself into the forest during a war. He hears a helicopter pass above and looks up. Tom lies on the kitchen floor staring at the light. Back in his imaginary forest, he dodges a bullet and looks to a small cliff nearby. Chris comes running in shooting a gun and jumps off the cliff towards Tom. At home, Chris walks towards Tom to see if he is okay. The scene shoots back and forth between Toms forest vision discussion with Chris and his drunken state at home while Chris talks of doing research on how to kill Brandy.At the forest, Chris pulls a gun on himself and tells Tom to shave his moustache and leave the forest immediately. Back at home, Tom crawls to the bathroom where he vomits and his vision stops. In the meantime, Chris writes large equations on a dry-erase board while his own calculating whispers question his state of mind. Eventually he comes to a mysterious conclusion and heads to Tom to explain. When he arrives at the bathroom where Tom had been shaving, he stops in disbelief and affirms Toms look.Tom, disguised as a female hooker waits on the edge of a road holding a birthday balloon. Chris watches through binoculars atop a building roof. Tom is met by Brandy and they casually flirt while heading into an alleyway. There, Tom temporarily excuses himself and tells Chris over his phone that he cant proceed with his task. He recalls his grenade and tosses it at Brandy. The phantom appears behind Brandy, laughing and knocking him unconscious. Tom wraps Brandy in garbage bags and throws them into Chris trunk. They speed off into the sunset.A sunrise time-lapse plays out in an open field. Chris digs a hole in the snow while Tom sits at the edge of a hill, distraught. Chris grabs the garbage bags holding Brandy and tosses them into the hole and covers it with snow. Tom recalls a moment earlier that morning as a flashback shows Chris and Tom investigating the trunk after pulling over, finding Brandy to still be (barely) alive. Chris smashes Brandys head in with a bat. Blood sprays onto Toms face as his memory ends. He stares into the natural beauty of rolling red hills.The phantom recites another poem confirming their success but questioning their ability to survive the way home. Chris and Tom walk across the hills and some time later are crawling through snow. Chris stops crawling and briefly faints. He watches as a ghostly Tom hands him a bowl of soup telling him that it should satisfy his needs. Chris takes it and consumes. Tom, still crawling on the snow reaches for his next grab, and finds himself back at Fairview Park. He stands up and uncovers Chris from a group of fallen tree branches. They walk back to Toms car and after having to boost his battery, the duo head back home.During their drive, the radio becomes garbled and tunes to different stations of seemingly random speech. They arrive at Chris home. Tom wonders if they will still die even though they did what was asked of them and Chris laughs at the irony since, it's his birthday. Outside his home the trees rustle in the wind.\nThe image of this is shown on an ipad on Chris coffee table, along with the notepad with is it all over? lastly added to it, another note stating 0 degrees Celsius, a large amount of alcohol bottles, wrapped presents , and the date shown as December 24th, 2012. The television continues the scene left by the ipad as Chris enters his apartment. Tom follows and they both notice the remains of a massive birthday party they had missed. Chris assumes he had blacked out and couldnt recall what happened. Tom lists some of the attendees, of which are curiously named after various drugs. Chris worries someone may have taken his dmtsoup and searches vigorously through his package. Finding it missing, he slams the package and is saddened by his loss, realizing he could have made a profit if he sold it. Tom reassures Chris and points out some gifts that were left over by the party. Chris picks up a birthday envelope titled from Tom and opens it to a MDMA pill taped to the card. A written note on the card reads Molly has a crush on you. Chris hammers the contents of the pill and splits it into two coffee cups.As their energy levels rise, a time-lapse of them both cleaning the apartment plays, ending with a quick-cut montage of various balloons being popped around the apartment. The last balloon starts up another time-lapse of Chris and Tom riding the waves of the ecstasy.During this extended take the following occurs: Chris makes a shisha bubble while Tom exercises; they drink large amounts of water then proceed to one handed hand-stands; Chris writing out a screenplay while Tom paces back and forth; the duo chewing large amounts of bubblegum and taking turns smelling Vaporub, and lastly, playing guitars on the couch.A brief montage of them playing guitar and home-made percussion made from wine bottles are combined with moments of Toms salvia trip playing on the television. Chris and Tom smoke shisha while watching Toms salvia trip. They discuss their experience with MDMA, and Tom inquires if Chris had ever tried salvia. Frightened but intrigued, Chris asks if he has any with him.A flash of a large glass bong twists into view and Chris falls backwards in the hallway. His expression of numb fear reads as lost and he turns his head to face the shaggy carpet. The tension builds until a blue screen of death appears filling the screen. Seconds later, Chris awakes underwater and bursts through the surface. He sits up in his tub and looks across the bathroom. He watches himself having a previous conversation earlier with Tom regarding him shaving his moustache. Water is spilling down the walls as a near transparent phantom rises behind him. Chris is swallowed back underwater.Brief flashes of Toms eyes and parts of the bathtub stream through as Chris dives deeper into the salvia he cant recall smoking. He awakes lying in the hallway facing the mirror. He watches his reflection change into the phantoms. He turns in horror and watches the phantom float towards him. As it glides closer, a sensation of a waterfall washes over Chris, and time reverses. Chris walks out of the bathroom and down the hallway towards the kitchen. Above him glow hung miniature planets guiding his path.The image of this is shown on an ipad on Chris coffee table, along with an empty notepad, a pile of cards face-down, and the date shown as December 31st, 2012. The television continues the scene left by the ipad as Chris walks towards the kitchen bar where a wooden box sits. He lifts the lid up, spots 4 face-down cards spread evenly, and closes the lid. The phantom appears standing on the other side of the bar. It informs Chris of his progress, and warns of choices still ahead. Chris reaches into the box and picks up the first card, the Jack of Diamonds.A portal opens and Chris awakes on his couch with the television playing Toms salvia scene. Chris sits up, breathing heavily. The doorbell rings and Chris leaves to open it, stopping to notice the clock reading midnight. He opens the door to the dark emptiness of night and suddenly a man swings a bat at Chris head. He carries Chris down the basement stairs and through the apartment hallway. Chris awakes to having been de-clothed and strapped to his dining table with plastic wrap. His mouth taped shut, he looks around, mumbling incoherences. His whole dining room has been wrapped in plastic. The man is seen delicately washing his knives in the kitchen sink. He stands behind the wrap as a silhouette, asking Chris if he thought it was safe to take candy from a stranger and to prepare for consequences. He steps into Chris view and is revealed to be James Brandy. Brandy lays out his knifes on a nearby stool, picks one up and aims for Chris chest. He asks if he should aim for the heart or the soul, then jams the blade into the center. Chris finds himself back in front of the phantom at the kitchen bar still holding the playing card.The phantom informs Chris that Brandys soul has been successfully exchanged for his. Chris reaches for the third card, but is interrupted by Tom who appears beside him. Tom guides Chris to picking the second card, a Queen of Spades. The phantom laughs as another portal opens.Chris awakes once again out of breath on his couch. A deck of cards on the coffee table is topped with the Queen of Spades. He pants heavily before hearing a doorbell. He opens the door to bright sunshine, and asks the young couple standing at his door, (the same couple from the news feed) what they want. The young girl asks to purchase his Boombastic Kush, upon which Chris denies.The couple grows agitated, not wanting to leave empty handed. The girl takes out her makeup mirror and lifts the lid towards Chris, who spots a Queen of Spades image on the front.However, before he can register the connection, the girl folds town the lid and blows white dust covering Chris face. Chris falls back down the stairs, paralyzed. He watches the couple walk into his apartment and steal his package of DMTSoup, and leave. Chris then finds himself back in front of the phantom and the cards.The phantom warns Chris of others that will beg for the substance and to avoid temptation at all costs as it will end up in his demise. Chris reaches for the third card, revealing a King of Hearts. The portal opens.\nChris stares at his reflection in the bathroom mirror. The phantoms mask appears on his face and Chris is jolted awake, lying in the hallway. He is choking and shaking suffering through a heart attack. He reaches for his cell phone to dial 9-1-1. He cant complete the call and dies. His eyes open to a field of white and Chris is shown surrounded by the endless openness of purgatory. He then appears back in front of the phantom at the kitchen bar.The phantom mimics the clock and tells Chris he has reached his end after being beckoned to save himself from damnation. The final card is picked up revealed to be The Joker. Frustrated, Chris yells at the phantom that he cant handle any further games. Laughing, the phantom removes his mask to reveal Tom. Chris immediately tackles him down and fatally suffocates him. In an instant, Chris sees himself being choked by his own hands.Chris awakes on his couch for the final time with the news still playing on the television. He removes a small plastic bag of DMTSoup from the package he received and inspects it with wonder. The calendar of December 2012 and a clock reading 5:04 is shown. He heads to the kitchen sink to wash his face. A mound of marijuana sits on his kitchen bar along with various jars with labels. He shuts the sink off, grabs a garbage bag and dumps his entire drug paraphernalia into it, along with the contents left on the coffee table. Toms salvia scene plays on the television. Along with the bag, Chris grabs his bat and heads to his door. He creeps up the steps, worried of another dangerous confrontation and cautiously walks outside his home. He drops the bag by the recycle bins and heads back into his apartment. He spots a glass bong that was left over. Taking it, he steps outside. A brief flash of his underwater salvia trip appears. Angrily, Chris whips the bong down his driveway, smashing it into pieces.Satisfied, Chris goes back inside, only to come back out with a dust pan and a broom. Dark clouds loom above as a storm is heard brewing. He cleans up the glass off his driveway and upon reaching the end, turns around to find a second, much larger package in front of his home with fragile written upon it. Chris walks towards the package in disbelief. End credits roll."
}