{
  "imdb_id": "tt4189442",
  "tmdb_id": "305932",
  "douban_id": null,
  "title": "Expelled (2014)",
  "genres": [
    "Comedy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.0,
  "director": [
    {
      "id": "nm2078193",
      "name": "Alex Goyette"
    }
  ],
  "writer": [
    {
      "id": "nm2078193",
      "name": "Alex Goyette",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm6811460",
      "name": "Cameron Dallas",
      "character": "Felix O'neil"
    },
    {
      "id": "nm2397866",
      "name": "Matt Shively",
      "character": "Danny"
    },
    {
      "id": "nm3096796",
      "name": "Lia Marie Johnson",
      "character": "Katie"
    },
    {
      "id": "nm1426656",
      "name": "Marcus Johns",
      "character": "Ben"
    },
    {
      "id": "nm5155082",
      "name": "Andrea Russett",
      "character": "Vanessa"
    },
    {
      "id": "nm1618597",
      "name": "Emilio Palame",
      "character": "Principal Truman"
    },
    {
      "id": "nm0371111",
      "name": "Kristina Hayes",
      "character": "Julie"
    },
    {
      "id": "nm1911958",
      "name": "Teala Dunn",
      "character": "Emily"
    },
    {
      "id": "nm3395008",
      "name": "Michelle Glavan",
      "character": "Stacy"
    },
    {
      "id": "nm1167931",
      "name": "Circus-Szalewski",
      "character": "Shamus"
    },
    {
      "id": "nm3052512",
      "name": "Stevie Mack",
      "character": "Mr. Harris"
    },
    {
      "id": "nm4850533",
      "name": "Tom McLaren",
      "character": "Phil"
    },
    {
      "id": "nm7023562",
      "name": "Sajad Jabery",
      "character": "Basketball Player"
    },
    {
      "id": "nm4513448",
      "name": "David Carter-T",
      "character": "Basketball Player"
    },
    {
      "id": "nm1551597",
      "name": "Amy Roiland",
      "character": "Mrs. Jensen"
    },
    {
      "id": "nm7023563",
      "name": "Lyndsay Rae",
      "character": "Toilet Girl"
    },
    {
      "id": "nm6905819",
      "name": "Daniel Lee",
      "character": "Tobias Glen"
    },
    {
      "id": "nm7039125",
      "name": "Tosha Jackson Williams",
      "character": "Theatre Teacher"
    },
    {
      "id": "nm0478378",
      "name": "Devyn LaBella",
      "character": "Lauren"
    },
    {
      "id": "nm3161731",
      "name": "Ellen Karsten",
      "character": "Mrs. Taylor"
    },
    {
      "id": "nm4263605",
      "name": "Peter Koocheradis",
      "character": "Slow Clapper"
    },
    {
      "id": "nm5237822",
      "name": "Rene Michelle Aranda",
      "character": "Police Officer"
    },
    {
      "id": "nm6781807",
      "name": "Robert Tunnell",
      "character": "Police Officer"
    },
    {
      "id": "nm2621983",
      "name": "David Hill",
      "character": "Police Officer"
    },
    {
      "id": "nm6254908",
      "name": "Danny Mika",
      "character": "Student"
    },
    {
      "id": "nm8200230",
      "name": "Angela Richardson",
      "character": "Beth oneil"
    }
  ],
  "overview": "Felix (Cameron Dallas) is a legendary prankster who gets expelled from his high school and, with his friend’s help, stops at nothing to hide it from his parents.",
  "storyline": "Felix (Cameron Dallas) is a legendary prankster who always charms his way out of trouble. However, after his third strike at school, the principal has had enough and expels him. Never defeated, Felix resorts to his infamous ways and devises a plan with his brother (Marcus Johns), best friend (Matt Shively), new friend (Lia Marie Johnson) and classmate (Andrea Russett) to hide it from his parents.",
  "plot": "This article's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (March 2016) (Learn how and when to remove this template message)\nFelix O'Neil (Cameron Dallas) is a mischievous prankster who believes that school is a waste of time. He gets expelled after receiving his third suspension from the principal, Truman.\n\nFelix spends the next few days covering up his expulsion with the help of his best friend, Danny. A week before report cards are supposed to be mailed, Felix makes a deal with his ex-girlfriend, Vanessa, to help her win a class election against her rival, Stacy in exchange, Vanessa being Mr. Truman's T.A., would print out a straight A report card for Felix. Felix and Danny hack Stacy's computer and discover that she is the notorious cyber bully, Roxy (one of Stacy's campaign promises is to shut down Roxy). Felix is able to get into the school and expose Stacy.\n\nThat night, Felix arrives home and finds his report card in the mail, which Vanessa, lied to him and gave him F's instead, his actual grades. Barely escaping his parents from finding out, in return he ruins the school play Vanessa stars in. After escaping from Truman, he is able to lie to his parents and convince Danny to help him break into school to fix his grades. Truman however, catches him in the act and dispatched the police to the location, who arrests Felix.\n\nFelix's advanced troublemaker brother Ben, who broke out of his mountain academy by shipping himself out to their house, is able to bail Felix out. They get home, and almost gets busted by his mom. His mom, who keeps putting pressure on Felix about the report card, forces Felix to convince Danny to give it to him. His parents are blown away, but his mom scheduled a conference with his chemistry teacher and was dead set on going. Felix hires his janitor to pose as his chemistry teacher, and meets with Felix at his house. Ben, shocked accidentally knocks him out. Felix, having no other choice goes with his mom to the meeting. Ben is able to help and attempts to stop the meeting, but fails. Right as Felix's history teacher is about to tell about his expulsion, Ben knocks him out. His mom finds Ben in the hallway, and even though Felix denies knowledge of it, his mom grounds him.\n\nBen was sent back to the academy, but not before planning his next escape; Felix's mom is doing everything to meet with Truman about Felix. A delivery pizza girl Katie, who delivered pizza to him the other day convinces him to find a way to get Truman to re-enroll him. After getting into the school, they see Truman late at night doing something on his computer. Deducing something is suspicious, Felix convinces Danny to bug his computer using a hard drive, finding out Truman is an addicted gambler who steals the school's money to supply himself. Felix is able to blackmail Truman to re-enroll him. Vanessa, not okay with this helps Truman, who presumably breaks into Felix's house to steal the drive.\n\nAfter Felix and Danny realize the drive isn't there, they head to the school where Truman gloats on beating Felix. Danny however, is able to steal Truman's laptop with clear evidence of his activity. Felix's mom arrives, and Truman lies about Felix, stating he is an exemplary student and that his \"Straight A\" report card wasn't faked. Felix's mom's suspicions are relieved.\n\nFelix is re-enrolled, and wins Katie's affection. Although he still doesn't understand the importance of school, he works harder and earns better grades. Felix states at the end, \"High school is a game. And I'm finally here to play.\"",
  "synopsis": null
}