{
  "imdb_id": "tt4133448",
  "tmdb_id": "376043",
  "douban_id": null,
  "title": "The Weatherman's Umbrella (2016)",
  "genres": [
    "Family"
  ],
  "country": "Australia",
  "version": [
    {
      "runtime": "70 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm2420080",
      "name": "Anne Richey"
    }
  ],
  "writer": [
    {
      "id": "nm2420080",
      "name": "Anne Richey",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm6856309",
      "name": "Lily Morrow",
      "character": "Sarah"
    },
    {
      "id": "nm6856310",
      "name": "Daryl Hull",
      "character": "The Weatherman"
    },
    {
      "id": "nm0281313",
      "name": "John Flaus",
      "character": "Great Grandfather"
    },
    {
      "id": "nm6856311",
      "name": "Jacob Vulfs",
      "character": "Blind Man's Son"
    },
    {
      "id": "nm6856312",
      "name": "Chris Muir",
      "character": "Blind Man"
    },
    {
      "id": "nm6856313",
      "name": "Gordon Lyall",
      "character": "Harris"
    },
    {
      "id": "nm6856314",
      "name": "Bruno Torfs",
      "character": "Bearded Man"
    },
    {
      "id": "nm6856315",
      "name": "Jane Fraga",
      "character": "Scavenger"
    },
    {
      "id": "nm6856316",
      "name": "Kaylea Graf",
      "character": "Scavenger's daughter"
    },
    {
      "id": "nm6856317",
      "name": "Bill Mitchell",
      "character": "Poor Man"
    },
    {
      "id": "nm6856318",
      "name": "Christina Weiss",
      "character": "Poor Woman"
    },
    {
      "id": "nm6856319",
      "name": "Cameron Giovanetti",
      "character": "Poor Boy"
    },
    {
      "id": "nm6856320",
      "name": "David Vulfs",
      "character": "Demon"
    },
    {
      "id": "nm6856321",
      "name": "Eddy Bourke",
      "character": "Demon's Apprentice"
    },
    {
      "id": "nm6856322",
      "name": "Bruce Morrow",
      "character": "Rich Man"
    },
    {
      "id": "nm6869944",
      "name": "Teake Schroder",
      "character": "Kid in Shop"
    },
    {
      "id": "nm6856324",
      "name": "Lucy Bourke",
      "character": "Kid in Shop"
    },
    {
      "id": "nm6856325",
      "name": "Micci Soriano",
      "character": "Kid in Shop"
    },
    {
      "id": "nm6856326",
      "name": "Noah Vulfs",
      "character": "Kid in Shop"
    },
    {
      "id": "nm6856327",
      "name": "Benjamin Fraga",
      "character": "Kid in Shop"
    },
    {
      "id": "nm6856328",
      "name": "Asher Sims",
      "character": "Kid in Shop"
    },
    {
      "id": "nm6856329",
      "name": "Hayley Fiske",
      "character": "Kid in Shop"
    },
    {
      "id": "nm6869945",
      "name": "Heidi Trudinger",
      "character": "Diver"
    },
    {
      "id": "nm6856331",
      "name": "Anna Fraga",
      "character": "Diverling"
    },
    {
      "id": "nm6869946",
      "name": "Cassius Schroder",
      "character": "Diverling"
    },
    {
      "id": "nm6856333",
      "name": "Amy Morrow",
      "character": "Diverling"
    },
    {
      "id": "nm6856334",
      "name": "Lisa Nolte",
      "character": "Sarah's Mother"
    },
    {
      "id": "nm6856335",
      "name": "Chris Hobbs",
      "character": "Sarah's Father"
    },
    {
      "id": "nm6856336",
      "name": "Don Wilson",
      "character": "Farmer"
    },
    {
      "id": "nm6856337",
      "name": "Michelle Wilson",
      "character": "Farmer's Wife"
    }
  ],
  "overview": "When the Weatherman puts on his boots it gets frosty, when he puts on his scarf it gets windy, and when he puts on his hat it gets warm. The problem is, the Weatherman's lost his umbrella. Without an umbrella, there will be no more rain.",
  "storyline": "When eleven year old Sarah is dropped off at her great grandfather's house near Marysville, she expects to spend her time eating, playing on her computer and watching television. It turns out that none of these things are possible however, so she storms off to find the shop. Sarah soon becomes involved in the quest to find the weatherman's lost umbrella. Without her help, it might never rain again. (Story inspired by the characters in Bruno's Sculpture Garden in Marysville, Victoria).",
  "plot": "A successful weatherman at a Chicago news program, David Spritz (Nicolas Cage) is well paid but garners little respect from people in the area who throw fast food at him, David suspects, because they're resentful of how easy his high-paying job is. Dave also feels overshadowed by his father, Pulitzer Prize-winning author Robert Spritzel (Michael Caine), who is disappointed in Dave's apparent inability to grow up and deal with his two children. The situation worsens when Robert is diagnosed with lymphoma and given only a few months to live. As he becomes more and more depressed, Dave takes up archery, finding the activity a way to build his focus and calm his nerves.\n\nTo prove himself to his father and possibly reconcile with Noreen (Hope Davis), his estranged wife, Dave pursues a weatherman position with a national talk show called Hello America. The job would nearly quadruple his salary, but means relocating to New York City. When Hello America invites him to New York, he takes his daughter, Shelly (Gemmenne de la Peña), with him and bonds with her by helping her shop for a more suitable wardrobe. While away, Dave learns that his son Mike (Nicholas Hoult) attacked his counselor, Don Bowden (Gil Bellows), claiming that the man wanted to perform oral sex on him. Despite this stress and an all-night drinking binge, Dave impresses the Hello America interviewers and is eventually offered the job.\n\nWhen he returns, Dave slaps Russ (Michael Rispoli), Noreen's boyfriend, when he finds him dealing with his son's predicament. Dave later confronts the counselor at his home, beating him up and warning him that he is in store for worse.\n\nThe family holds a living funeral for Robert (organised by Dave's mother, Lauren, played by Judith McConnell), in which Dave asks Noreen to reconcile and move to New York, but she has decided to marry Russ. Dave and Robert have one final talk, in which Dave breaks down in tears, unsure of his life's choices. Robert consoles him, telling him that he has time to \"chuck\" the garbage of his life. Robert dies soon after.\n\nThe film ends several months later, after Dave has accepted the job and moved to New York. People have ceased throwing things at him though, he muses, this may be a pleasant side-effect of his archery hobby, for which he carries a bow.",
  "synopsis": null
}