{
  "imdb_id": "tt4161074",
  "tmdb_id": "357799",
  "douban_id": null,
  "title": "Presenting Princess Shaw (2015)",
  "genres": [
    "Documentary",
    "Music"
  ],
  "country": "Israel",
  "version": [
    {
      "runtime": "83 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm2609593",
      "name": "Ido Haar"
    }
  ],
  "writer": [
    {
      "id": "nm2609593",
      "name": "Ido Haar",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm4918873",
      "name": "Kutiman",
      "character": "Himself       (as Ophir Kutiel)"
    },
    {
      "id": "nm7973095",
      "name": "Samantha Montgomery",
      "character": "Herself"
    }
  ],
  "overview": "Through You Princess will follow Samantha, Kutiman, and some of the musicians around the world who are not aware of Kutiman creating his new music out of their musical web clips. Everyone is from another background, culture, and country, but all share now a mutual musical vision.",
  "storyline": "In every corner of the world, at any given moment, random people post personal video clips online. They are their virtual messages in a bottle, tossed into the boundless sea that is the Internet. Most of these posts flounder in a sad limbo of indifference and anonymity-unless your YouTube handle happens to be Princess Shaw. Samantha Montgomery, 38, lives alone in one of New Orleans' toughest neighborhoods. By day she works as a caregiver for the elderly; at night she transforms into Princess Shaw, belting out soulful originals at sparsely attended open mic nights and posting homemade a cappella clips on YouTube, usually reaching just a handful of viewers. One of her followers happens to be Kutiman, a.k.a. Ophir Kutiel, an Israeli musician living on a kibbutz outside Tel Aviv, who mashes up YouTube videos from all over the world to create new musical pieces. Princess Shaw has no idea that he has found hers. A rousing documentary crowd-pleaser about a star-crossed singer-songwriter and ...",
  "plot": null,
  "synopsis": null
}