{
  "imdb_id": "tt4145324",
  "tmdb_id": "316410",
  "douban_id": null,
  "title": "Bound (2015)",
  "genres": [
    "Drama",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "91 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.4,
  "director": [
    {
      "id": "nm1714788",
      "name": "Jared Cohn"
    }
  ],
  "writer": [
    {
      "id": "nm1714788",
      "name": "Jared Cohn",
      "description": "screenplay"
    },
    {
      "id": "nm3226880",
      "name": "Delondra Williams",
      "description": "additional writing"
    }
  ],
  "cast": [
    {
      "id": "nm0004806",
      "name": "Charisma Carpenter",
      "character": "Michelle Mulan"
    },
    {
      "id": "nm4216406",
      "name": "Bryce Draper",
      "character": "Ryan Black"
    },
    {
      "id": "nm4526291",
      "name": "Morgan Obenreder",
      "character": "Dara"
    },
    {
      "id": "nm0598282",
      "name": "Michael Monks",
      "character": "Preston"
    },
    {
      "id": "nm0000838",
      "name": "Daniel Baldwin",
      "character": "Walter"
    },
    {
      "id": "nm2903041",
      "name": "Andy T. Tran",
      "character": "Lee"
    },
    {
      "id": "nm0933823",
      "name": "Mark McClain Wilson",
      "character": "George"
    },
    {
      "id": "nm4173528",
      "name": "Hayley McLaughlin",
      "character": "Alana"
    },
    {
      "id": "nm2049547",
      "name": "Noel Arthur",
      "character": "Jesse Aaron"
    },
    {
      "id": "nm2396859",
      "name": "Steffinnie Phrommany",
      "character": "Kori"
    },
    {
      "id": "nm1277604",
      "name": "Steve Suh",
      "character": "Security Officer"
    },
    {
      "id": "nm0778949",
      "name": "Cedric Scott",
      "character": "Concierge"
    },
    {
      "id": "nm2104845",
      "name": "Lyndsay Haldorson",
      "character": "Receptionist"
    },
    {
      "id": "nm5363540",
      "name": "Heather Paige Cohn",
      "character": "Nurse"
    },
    {
      "id": "nm0654468",
      "name": "Terrell Owens",
      "character": "Terrell"
    },
    {
      "id": "nm3428569",
      "name": "Lauren Nash",
      "character": "Salesgirl"
    },
    {
      "id": "nm7065105",
      "name": "Barbro Adler",
      "character": "Background Person"
    },
    {
      "id": "nm7065106",
      "name": "Oriana Albrecht",
      "character": "Background Person"
    },
    {
      "id": "nm2200905",
      "name": "Andy Aquino",
      "character": "Background Person       (as Andrew L. Aquino)"
    },
    {
      "id": "nm2259412",
      "name": "Robert Beckett",
      "character": "Background Person"
    },
    {
      "id": "nm7065107",
      "name": "Jason E. Bell",
      "character": "Background Person"
    },
    {
      "id": "nm7065108",
      "name": "Florencia A. Bone",
      "character": "Background Person"
    },
    {
      "id": "nm7065109",
      "name": "Miss Mia Vixen",
      "character": "Background Dominaxtrix"
    },
    {
      "id": "nm2142745",
      "name": "Craig Blair",
      "character": "Waiter"
    }
  ],
  "overview": "The daughter of a wealthy real estate mogul falls in love with a younger man, and she is introduced to the world of BDSM. With her newly awakened sexual prowess, she is finally able to take control of her life.",
  "storyline": "The daughter of a wealthy real estate broker falls in love with a younger man, who introduces her to B&D and S&M. Using her newly awakened sexual prowess, she finally takes charge of her own life.",
  "plot": "Michelle Mulan is a 40-something real estate broker who has recently been promoted as a chairperson to a failing firm, even though she is fully qualified, she had only been promoted because of her father Walter's, status as chairman. While other chairmen want to sell the firm, she sees more advantage in merging with a larger company. Despite having a boyfriend, George (Mark McClain Wilson), Michelle does cheat on him to satiate her sexual desires. Also a single mother, she struggles to get her teenage daughter, Dara, on the right track and takes her to dinner at a local restaurant. There, a man fifteen years her junior becomes enamored with her. After dropping Dara off at home, Michelle returns to the restaurant and finds Ryan trying to seduce her, but manages to ward him off. Still taking his number, Michelle initially decides not to meet him, but the next day after getting a meeting enabling the merger, decides to do so. After rejecting a marriage proposal from George, Michelle goes out with Ryan. On their date, he introduces her to the world of BDSM after which Michelle cheats on George with Ryan. After breaking up with George, Michelle begins to date Ryan and easily gives in to his dominating personality.\n\nFalling in love, Michelle begins to call Ryan her 'master' and refers to herself as a 'messy whore'. At a benefit dinner, Ryan begins to insult Michelle's client and operate a vibrator egg she is wearing while she is with the client. Despite this, she manages to get the client to consider a merger. While trying to get Dara on the right track, Michelle also decides to learn more about being dominated and very quickly finds that she enjoys submitting to Ryan's will. After learning Ryan has a criminal record as a result of being a car thief from her father, Michelle continues to try and negotiate a deal with the client to save the firm. Michelle continues seeing Ryan and gives herself in to him completely while also learning more and more about the submissive lifestyle. Along the way, however, she also learns how to become a dominant and a woman at a BDSM club Ryan introduced her tells her that Ryan is a predator.\n\nUnknown to her, Ryan also seduces Dara and has made her a submissive. Seeing this, she finally overthrows Ryan's bonds and uses her new-found sexual prowess to take control of her life. Ryan assaults her when she goes to confront him at his loft about his affair with Dara, but Michelle knocks him unconscious with a camera tripod. She proceeds to take him to his private dungeon and bind him, turning him into the submissive. After torturing Ryan, Michelle turns him over to the police for having sex with her underage daughter. With her newfound confidence, Michelle seals the deal with her client and the merger of Walter's company to the client's is successful. Afterwords in the final scene, Michelle signs the paperwork involving the merger with the clinet... and also making him her submissive.",
  "synopsis": "Michelle Mulan (Charisma Carpenter) is a 40-year-old real estate broker who has recently been promoted as a chairperson to a failing firm, even though she is fully qualified, she had only been promoted because of her father Walter's (Daniel Baldwin), status as chairman. While other chairmen want to sell the firm, she sees more advantage in merging with a larger company. Despite having a boyfriend, George (Mark McClain Wilson), Michelle does cheat on him to satiate her sexual desires.Also a single mother, Michelle struggles to get her troubled teenage daughter, Dara (Morgan Obenreder), on the right track and takes her to a dinner. There, a man around 15 years her junior becomes enamored with her. After dropping Dara off at home, Michelle goes back to the restaurant and finds the man who introduces himself as Ryan Black (Bryce Draper), who tries to seduce her. Michelle manages to ward him off.Still taking his phone number, Michelle initially decides not to meet him, but after getting a meeting enabling the merger, decides to do so. After rejecting a marriage proposal from George, Michelle goes out with Ryan. On their date, he takes her back to his loft introduces her to the world of B&D and S&M after which Michelle cheats on George with Ryan. After breaking up with George, Michelle begins to date Ryan and easily gives in to his dominating personality.Falling in love, Michelle begins to call Ryan her 'master' and refers to herself as a 'messy whore'. At a benefit dinner, Ryan begins to insult Michelle's client, a wealthy businessman named Jesse Aaron (Noel Arthur), and operate a vibrator egg she is wearing while she is with the client. Despite this, she manages to get Mr. Aaron to consider a merger. While trying to get Dara on the right track, Michelle also decides to learn more about being dominated and very quickly finds that she enjoys submitting to Ryan's will.After learning that Ryan served time in prison for auto thief from her father, Michelle continues to try and negotiate a deal with the client to save the firm. Michelle refuses to continue seeing Ryan and gives herself in to him completely while also learning more and more about the submissive lifestyle. Along the way, however, she also learns how to become a dominant. She begins to frequent the S&M bondage club that Ryan frequents and partakes in the \"action\" at the club.Unknown to her, Ryan also seduced Dara and made her a submissive. Michelle comes home from the bondage club one evening and sees Ryan having sex with a tied-up Dara in Michelle's own bed. Seeing this, she finally overthrows Ryan's bonds and uses her new-found sexual prowess to take control of her life. She throws Ryan off her daughter and out of her house. Michelle then apologizes to Dara for not being there for her.The next day, Michelle is assaulted by Ryan outside of her office building, but manages to use a camera to knock him unconscious. She proceeds to take him to a private dungeon in an abandoned garage and bind him, turning him into the submissive. After torturing Ryan, Michelle turns him over to the police for having sex with her underage daughter.With her newfound confidence, Michelle arrives at the office and, through a series of skilled negotiations, seals the deal with her firm, impressing Walter. Michelle is then promoted to full partner and permanent member of the firm and to take over when Walter retires. In the very final scene in Michelle's office, she uses her sexual powers against her client Mr. Aaron.... while also making him her submissive."
}