{
  "imdb_id": "tt4112250",
  "tmdb_id": "329475",
  "douban_id": null,
  "title": "Katham Katham (2015)",
  "genres": [
    "Action",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "143 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.3,
  "director": [
    {
      "id": "nm6836459",
      "name": "Babu Thooyavan"
    }
  ],
  "writer": [
    {
      "id": "nm6836459",
      "name": "Babu Thooyavan",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3831055",
      "name": "Nandha",
      "character": "Nandha"
    },
    {
      "id": "nm0836991",
      "name": "Nataraja Subramanian",
      "character": "Pandiya"
    },
    {
      "id": "nm4317930",
      "name": "Sanam Shetty",
      "character": ""
    },
    {
      "id": "nm6698719",
      "name": "Sharika",
      "character": ""
    },
    {
      "id": "nm0712437",
      "name": "Nizhalgal Ravi",
      "character": ""
    },
    {
      "id": "nm5631806",
      "name": "Crane Manohar",
      "character": ""
    },
    {
      "id": "nm3833752",
      "name": "Singamuthu",
      "character": ""
    },
    {
      "id": "nm6836460",
      "name": "Soundar",
      "character": ""
    }
  ],
  "overview": "An idealistic sub-inspector joins a station that is run by a corrupt inspector, who moves closely with a criminal-minister. Gradually, his hate for the other takes over and he edges towards the dark side while the other sees the error of his ways and reforms.",
  "storyline": "A corrupt police inspector Pandiya (Natraj) and upright sub inspector Nandha (Nandha) are at logger heads, the former always dominates the latter as he is the superior officer. At one point of time, Pandiya turns honest and even files a case against the son of the most powerful politician in the town Periyanna. But sadly Nandha still believes that Pandiya is corrupt and suspects him in the murder of another cop friend. Mean time, due to the earlier ego clash Nandha becomes Periyanna's right hand and sketches a plan to encounter Pandiya.",
  "plot": "Nandha (Nandha Durairaj) is an upright sub-inspector of police who has been transferred fifteen times in three years. He is then transferred in a police station based in Pollachi. There, the inspector of police Pandian (Natarajan Subramaniam) is in the pay of Periyannan (Rajagopalan), the local minister who runs in own government in the place. Nandha is shocked to note that Pandian and the entire police department is corrupt. Thereafter, Nandha tries hard to enforce the order. Soon, both policemen will clash. Pandian becomes a honest policeman after Periyannan's men attempt to kill him and he is revived with blood transfusions from the public. However, Nandha does not believe that he has truly changed. After a fellow honest sub-inspector gets killed by Periyannan's men, Nandha blames Pandian and through short routes becomes inspector himself. He arranges for Periyannan and his men to clash with Pandian, but in the ensuing fight, Pandian kills them all while Nandha walks away.",
  "synopsis": null
}