{
  "imdb_id": "tt4127138",
  "tmdb_id": "298077",
  "douban_id": null,
  "title": "Ambition (2014)",
  "genres": [
    "Short",
    "History",
    "Mystery",
    "Sci-Fi"
  ],
  "country": "Poland",
  "version": [
    {
      "runtime": "7 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.5,
  "director": [
    {
      "id": "nm1313617",
      "name": "Tomek Baginski"
    }
  ],
  "writer": [
    {
      "id": "nm1313617",
      "name": "Tomek Baginski",
      "description": "screenplay"
    },
    {
      "id": "nm1313617",
      "name": "Tomek Baginski",
      "description": "writer"
    },
    {
      "id": "nm1314178",
      "name": "Jacek Dukaj",
      "description": "story development"
    },
    {
      "id": "nm3309822",
      "name": "Afolabi Kuti",
      "description": "screenplay"
    },
    {
      "id": "nm6894173",
      "name": "Tobiasz Piatkowski",
      "description": "story"
    },
    {
      "id": "nm6869536",
      "name": "Jan Pomierny",
      "description": "story development"
    },
    {
      "id": "nm6869536",
      "name": "Jan Pomierny",
      "description": "story"
    }
  ],
  "cast": [
    {
      "id": "nm0318821",
      "name": "Aidan Gillen",
      "character": "Master"
    },
    {
      "id": "nm4957233",
      "name": "Aisling Franciosi",
      "character": "Apprentice"
    }
  ],
  "overview": "Tomek Bagiński’s latest project - tells of a young apprentice (Aisling Franciosi) struggling to master nanotechnology on an alien world and prove herself to her enigmatic master (Aidan Gillen).  Will her herculean goals remain tantalizingly out of reach, or will she fulfill them and in the process, change life as we know it?",
  "storyline": "The story of one of the most important space exploration endeavours of this decade. Just as Gillen's enigmatic Master encourages Franciosi's Apprentice to seek out the key to life amidst a rugged alien landscape, ESA has been on a decade-long ambitious journey of its own, to unlock the mysteries of a comet and the origins of our Solar System with its Rosetta spacecraft, hundreds of millions of kilometres from Earth. Ambition complements the ongoing communication about Rosetta and adds a \"human dimension\" to the scientific and technological achievements of the mission, which include curiosity, drive and ambition.",
  "plot": "Literature graduate Wyman Chan (Chapman To) writes erotic stories in the soft porn section of the newspaper for a living, but with the soft porn section ceasing publication, he loses his job. The unemployed Chan becomes capricious, and takes inspiration from men working in the Japanese adult video (AV) industry to become a producer of pornographic films. Chan's idea immediately receives enthusiastic responses from his friends, who offer their help—especially Hatoyama (Josie Ho), who is familiar with the Japanese porn industry. While everyone initially takes great interest in being a part of filming, Chan is soon forced into acting in the lead role. Surprisingly, Chan becomes a sensation in Japan for his performance of being sexually harassed and dominated by women in the AV. Hatoyama immediately travels to Hong Kong to persuade Chan to pursue his unrealistic dream—a Hong Kong man entering the Japanese AV industry.",
  "synopsis": "We find ourselves on a seemingly alien landscape, a dark rock desert, illuminated by a cold light and apparently devoid of any life. An Apprentice, using only hand gestures and aided by some sort of futuristic nanotechnology, is working on a floating rock, adding blue and green features at it that hint at water and vegetation. She seems in control at first, but suddenly the rock explodes and collapses to the ground. The Apprentice, saddened, is reached by her Master, who tells her that this is enough and that she should settle for \"less challenging\" tasks. She immediately protests, demanding for another chance, confident she will be successful.The Master, amused by her reaction, changes the subject and starts telling her a story from the past. Instead of using only spoken words, he also employs his mastery of the technology-enabled telekinesis, and visualizes the narration by building a monumental model of the solar system around them, complete with planets and asteroids. He narrates about the Rosetta mission, a space mission consisting of a probe and a lander which was the first one to catch a comet, the most mysterious object of the solar system, the ones which could have brought water to Earth. He focuses on the importance of the mission: not only it was set out to discover why water, which constitutes \"the key of life on Earth\", was so abundant on our home planet, but it was also a display of ambition, the human feature that drives us to do greater and greater things even when we fail. He points out that the technology used back then is described as so rudimentary that it offered no guarantee of success, yet mankind thought it was worth trying. Having concluded the lesson, he proceeds to reveal that it was he who destroyed the rock earlier, and that he did it on purpose to test her character. Since she asked to try again, thus proving her ambition, he declares her ready, implying that she has successfully completed her training.He then instructs her to \"reset\", and she complies easily by destroying the planets still hovering around them. Then he asks her to begin what we understand is their real task. While smiling and whispering the word \"water\", she summons a meteorite that breaks apart in the atmosphere and strikes the ground not too far from they are standing. Each impact is an explosion that sends a shock wave; after a couple of seconds the shock wave reaches the characters and our point of view: the Master and the Apprentice are unfazed by it, and we catch a glimpse of water droplets condensing on the camera lens, just before the screen fades to black."
}