{
  "imdb_id": "tt4132034",
  "tmdb_id": "326351",
  "douban_id": null,
  "title": "Beauty Is... (2014)",
  "genres": [
    "Documentary",
    "Drama"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "123 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm3564978",
      "name": "Toyin Agbetu"
    }
  ],
  "writer": [
    {
      "id": "nm3564978",
      "name": "Toyin Agbetu",
      "description": null
    },
    {
      "id": "nm6854992",
      "name": "WigWam",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4663208",
      "name": "Akala",
      "character": "Himself"
    },
    {
      "id": "nm3867879",
      "name": "Alexander Aplerku",
      "character": ""
    },
    {
      "id": "nm6854989",
      "name": "Natalie Barrett",
      "character": "Herself"
    },
    {
      "id": "nm0414213",
      "name": "Judith Jacob",
      "character": "Herself"
    },
    {
      "id": "nm6854988",
      "name": "Caroline King-Gadekah",
      "character": ""
    },
    {
      "id": "nm4030255",
      "name": "Weruche Opia",
      "character": ""
    },
    {
      "id": "nm3992447",
      "name": "Russell Nii Ordatei",
      "character": ""
    },
    {
      "id": "nm6854987",
      "name": "Bami Oshinowo",
      "character": ""
    },
    {
      "id": "nm6854990",
      "name": "Dami Solebo",
      "character": ""
    },
    {
      "id": "nm5222920",
      "name": "Akpore Uzoh",
      "character": ""
    },
    {
      "id": "nm6854991",
      "name": "Stephanie Yamson",
      "character": ""
    }
  ],
  "overview": "Beauty Is... the film by community educator and guerrilla film maker Toyin Agbetu asks ‘what is beauty?’ and examines the answer from a philosophical position through discussions on hair, skin shade, body image and character.  It's a serious, yet often humorous cross between Chris Rock's \"Good Hair\" and Bill Duke/D. Channsin Berry's \"Dark Girls\" documentaries with some sensitive Oprah styled interviews mixed in.  The film explores the risks posed by chemical straighteners and skin bleaching, it shares insights on conditions like Vitiligo and Alopecia whilst discussing the impact of biased media on children and personal relationships.  Backed by a global campaign to challenge governments and the pharmaceutical industry, this is edutainment that may just change your life.",
  "storyline": "Beauty Is - the film by community educator and independent film maker Toyin Agbetu asks 'what is beauty?' and examines the answer from a philosophical position through discussions on hair, skin shade, body image and character. It's a serious, yet often humorous cross between Chris Rock's \"Good Hair\" and Bill Duke/D. Channsin Berry's \"Dark Girls\" documentaries with some sensitive Oprah styled interviews mixed in. The film explores the risks posed by chemical straighteners and skin bleaching, it shares insights on conditions like Vitiligo and Alopecia whilst discussing the impact of biased media on children and personal relationships. Backed by a global campaign to challenge governments and the pharmaceutical industry, this is edutainment that may just change your life.",
  "plot": "In France, a widowed merchant (André Dussollier) is forced to sell his estate after his ships are lost at sea, leaving him bankrupt. He moves to a simple house in the countryside with his six children, though the only one happy with the change is his youngest daughter, Belle (Léa Seydoux). In town, the merchant is forced to flee into the forest when Perducas (Eduardo Noriega) threatens to harm him over his son's debts.\n\nWhile lost in the forest, the merchant stumbles upon the magical domain of the Beast (Vincent Cassel). The merchant is confronted by the Beast when he tries to take a single red rose for Belle. As price for nabbing one of his roses, the Beast demands the merchant's servitude or his family will be killed. The Beast gives the merchant one day's leave to say goodbye to his children. Learning of her father's fate, Belle, feeling responsible, steals her father's horse and returns to the castle to take her father's place.\n\nAt the castle, Belle is given luxurious goods and allowed to roam the grounds, but must return every evening for dinner with the Beast. The Beast asks Belle if she will love him, but she rejects him. At night, Belle has vivid dreams about the castle as it used to be, and of the Prince who used to live in it. The Prince was in love with a Princess (Yvonne Catterfeld), who agreed to bear him a son if he promised to stop hunting an elusive golden deer, saying that his obsession keeps him away from her.\n\nBelle makes the Beast a proposal: she will dance with him, if she is allowed to see her family one last time. The two begin to dance, and the Beast once again asks for Belle's love. Jarred, Belle demands to see her family as she had bargained. The Beast is apathetic. Belle fervently rejects the Beast for his deception, saying he will always disgust her. The same night, she witnesses the Beast prey upon and devour a hog. She is shocked and attempts to escape by running into the enchanted forest. Beast chases then catches her on a frozen lake. He climbs on top of her and tries to kiss her as the lake begins to crack under their weight. The ice gives way and Belle becomes submerged. The Beast pulls her from the water, and returns her to the castle.\n\nWhen Belle awakes the next morning, the Beast agrees to let her return home. He repeats that she must return to him or that he will 'die' from the loss of her. Belle arrives home, where she finds her father is bedridden and her siblings are hiding from Perducas. Belle's eldest brother takes a jewel from her clothing, and posits whether the castle may contain further treasures. He goes to Perducas and his men, offering the riches of the castle as payment for his debt. The group travel to the castle and raid it, pulling a golden arrow held by a statue.\n\nBelle has a final dream about how the Prince broke his promise and killed the golden deer with the golden arrow. While dying, the deer transformed into the Princess, who revealed that she had been a forest nymph all along, allowed to take human form in order to experience love. Her father, the god of the forest, punished the Prince by transforming him into the Beast, the dogs into small creatures named Tadommes, and his friends into statues. The god of the forest resounded that only the love of a woman would break the Beast's eternal curse.\n\nShe races to the castle after her brothers, arriving just as the Beast is about to kill them for intruding. The Beast stops his attack when Belle begs for mercy. Perducas uses the golden arrow to stab the Beast, mortally wounding him. Belle and her brothers carry the Beast into the castle as vines begin to overtake it. They place the Beast into a magical healing well. Dying, the Beast asks whether Belle could ever love him, and she counters that she already does. The Beast sinks into the water, and when he rises up he has transformed back into the Prince. The vines recede, the statues crumble, and the Tadommes return to dogs. Perducas, who tries to run away, is killed by the vines and turned into a human tree.\n\nThe film ends with the story being told by Belle to her two young children. They are living in the same countryside house with Belle's father. Belle goes outside to greet her husband, the Prince, and the two kiss and embrace.",
  "synopsis": null
}