{
  "imdb_id": "tt4196848",
  "tmdb_id": "374461",
  "douban_id": null,
  "title": "Mr. Church (2016)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "104 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.7,
  "director": [
    {
      "id": "nm0000915",
      "name": "Bruce Beresford"
    }
  ],
  "writer": [
    {
      "id": "nm0573185",
      "name": "Susan McMartin",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0000552",
      "name": "Eddie Murphy",
      "character": "Henry Church"
    },
    {
      "id": "nm1429380",
      "name": "Britt Robertson",
      "character": "Charlie"
    },
    {
      "id": "nm0001523",
      "name": "Natascha McElhone",
      "character": "Marie"
    },
    {
      "id": "nm1882152",
      "name": "Xavier Samuel",
      "character": "Owen"
    },
    {
      "id": "nm4867258",
      "name": "Lucy Fry",
      "character": "Poppy"
    },
    {
      "id": "nm1399894",
      "name": "Christian Madsen",
      "character": "Eddie Larson"
    },
    {
      "id": "nm5085683",
      "name": "Mckenna Grace",
      "character": "Izzy"
    },
    {
      "id": "nm6814613",
      "name": "Natalie Coughlin",
      "character": "Young Charlie"
    },
    {
      "id": "nm4068901",
      "name": "Madison Wolfe",
      "character": "Young Poppy"
    },
    {
      "id": "nm5576756",
      "name": "Lincoln Melcher",
      "character": "Young Owen"
    },
    {
      "id": "nm0573182",
      "name": "Kathleen McMartin",
      "character": "Mrs. Dickerman"
    },
    {
      "id": "nm0790460",
      "name": "Sara Shearer",
      "character": "Gibby"
    },
    {
      "id": "nm1107255",
      "name": "Kelly Lester",
      "character": "Doctor"
    },
    {
      "id": "nm3680986",
      "name": "Aileen Burdock",
      "character": "Waitress"
    },
    {
      "id": "nm4121649",
      "name": "Michael Leone",
      "character": "Michael"
    },
    {
      "id": "nm5058951",
      "name": "Shawnee Witt",
      "character": "Cashier"
    },
    {
      "id": "nm0058175",
      "name": "Thom Barry",
      "character": "Frankie Twiggs"
    },
    {
      "id": "nm4412982",
      "name": "Adriana Leonard",
      "character": "Checkout Girl"
    },
    {
      "id": "nm0074410",
      "name": "Jenica Bergere",
      "character": "Nurse"
    },
    {
      "id": "nm3046038",
      "name": "Paul Archer",
      "character": "Diner #1"
    },
    {
      "id": "nm1265922",
      "name": "Francisco Javier Gomez",
      "character": "Diner #2"
    },
    {
      "id": "nm2279891",
      "name": "Darius Cottrell",
      "character": "Bus Driver"
    },
    {
      "id": "nm7169354",
      "name": "Mike Ryan",
      "character": "Bus Driver #1"
    },
    {
      "id": "nm7169355",
      "name": "Bruce Marshall",
      "character": "Bus Driver #2"
    },
    {
      "id": "nm6062566",
      "name": "Wyatt Carnel",
      "character": "Kid on Skateboard"
    }
  ],
  "overview": "A unique friendship develops when a little girl and her dying mother inherit a cook - Mr. Church. What begins as an arrangement that should only last six months, instead spans fifteen years.",
  "storyline": "\"Mr. Church\" tells the story of a unique friendship that develops when a little girl and her dying mother retain the services of a talented cook - Henry Joseph Church. What begins as a six month arrangement instead spans into fifteen years and creates a family bond that lasts forever.",
  "plot": "Charlotte \"Charlie\" Brooks (Natalie Coughlin) lives with her single mother Marie Brooks (Natascha McElhone) in a small beat-up apartment. She is awakened by cooking that smells like heaven, to find a stranger named Mr. Henry Joseph Church (Eddie Murphy). Charlie doesn’t like this mysterious man in her house. Marie agrees with Charlie to get rid of him until she finds out he was hired by Marie's deceased ex-lover to take care of her for six months because she has breast cancer and only has six months to live.\n\nSix years later, Marie is still living and Mr. Church has become a fixture in the household. Charlie (now Britt Robertson) is a senior in high school and now aware of her mother's cancer. Charlie grows distant from her mother and closer to Mr. Church because of her inability to come to terms with Marie's impending death. Marie lives long enough to see Charlie go to prom with her dream guy Owen (Xavier Samuel), but dies soon after.\n\nMr. Church stays with Charlie after Marie dies. Charlie gets accepted to Boston University but cannot afford to attend. Mr. Church gives her an envelope containing five thousand dollars for tuition–the money he saved from coupons Marie gave him. Charlie runs into Owen sometime later and he tells her he is going away to college.\n\nTwo years later a pregnant Charlie shows up on Mr. Church's doorstep, eventually asking to live with him. He accepts as long as she keeps out of his business. Charlie notices how Mr. Church comes home drunk and has matches from a place called Jelly's. A drunk Mr. Church finds her snooping, they argue and he tries to throw her out for breaking his rules. She leaves and runs into her old friend Larson (Christian Madsen) at a store parking lot. A kid on a skate board hits Charlie and knocks her down knocking her unconscious. Larson, who is banned from operating a vehicle due to a previous accident, nevertheless drives her to the hospital just in time. Mr. Church comes to the hospital and takes Charlie back with him. Charlie gives birth to a baby girl named Izzy (Mckenna Grace), and she and Izzy live with Mr. Church. Charlie gets a job as a waitress.\n\nFive years later, Mr. Church becomes sick. Charlie takes him to the doctor, but Mr. Church dies of an enlarged heart. Charlie finds Owen again and they get back together. Charlie meets the owner of Jelly's and finds out that Mr. Church played the piano there. The film ends with Charlie writing the story of her life with Mr. Church.",
  "synopsis": null
}