{
  "imdb_id": "tt4125752",
  "tmdb_id": "353387",
  "douban_id": null,
  "title": "Missed Call (2015)",
  "genres": [
    "Short",
    "Drama",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "10 min",
      "description": ""
    }
  ],
  "imdb_rating": 9.0,
  "director": [
    {
      "id": "nm4403271",
      "name": "Susana Hornil"
    }
  ],
  "writer": [
    {
      "id": "nm6848886",
      "name": "Marcello Barbaro",
      "description": "writer"
    },
    {
      "id": "nm6848916",
      "name": "Nicolas Spadaccini",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm6848898",
      "name": "Anthony Adamucci",
      "character": "Tai Chi Student #3"
    },
    {
      "id": "nm5505892",
      "name": "Joseph Altamuro",
      "character": "Man Drinking Coffee #4"
    },
    {
      "id": "nm6848886",
      "name": "Marcello Barbaro",
      "character": "Man Drinking Coffee #2"
    },
    {
      "id": "nm6848912",
      "name": "Randal Castillo",
      "character": "Man Drinking Coffee #3"
    },
    {
      "id": "nm6848915",
      "name": "Veronique Dienemann",
      "character": "Secretary"
    },
    {
      "id": "nm6848902",
      "name": "Veronica Herrera",
      "character": "Tai Chi Student #2"
    },
    {
      "id": "nm6848879",
      "name": "Robert Klepa",
      "character": "Man Drinking Coffee #1"
    },
    {
      "id": "nm6848910",
      "name": "Shannon Lee Moore",
      "character": "Woman Reading Book"
    },
    {
      "id": "nm6848911",
      "name": "Nancy Lopez",
      "character": "Woman Standing in Line"
    },
    {
      "id": "nm2362068",
      "name": "Caity Lotz",
      "character": "Kirsten"
    },
    {
      "id": "nm6848885",
      "name": "Howard Martin",
      "character": "Tai Chi Student #3"
    },
    {
      "id": "nm2880281",
      "name": "Sol Mason",
      "character": "Barista"
    },
    {
      "id": "nm6848883",
      "name": "Paula Moreno",
      "character": "Woman Drinking Tea #1"
    },
    {
      "id": "nm6848897",
      "name": "Cate Rubenstein",
      "character": "Woman Crosser with Dog"
    },
    {
      "id": "nm6848909",
      "name": "Manouche Rubenstein",
      "character": "Dog"
    },
    {
      "id": "nm3151437",
      "name": "Alvaro Segura",
      "character": "2Nd Barista"
    },
    {
      "id": "nm6848882",
      "name": "Sarasvati Segura",
      "character": "Amy       (voice)"
    },
    {
      "id": "nm6848916",
      "name": "Nicolas Spadaccini",
      "character": "Man Jogging"
    },
    {
      "id": "nm6848891",
      "name": "Mariana Spin",
      "character": "Woman Drinking Tea #2"
    },
    {
      "id": "nm0089340",
      "name": "Eric St. John",
      "character": "Donovan"
    },
    {
      "id": "nm1710870",
      "name": "Dylan Stern",
      "character": "Luke"
    },
    {
      "id": "nm6848890",
      "name": "Paul Terry Jr.",
      "character": "Tai Chi Student #1"
    },
    {
      "id": "nm6848895",
      "name": "Gene Walder",
      "character": "Tai Chi Instructor"
    },
    {
      "id": "nm6848881",
      "name": "Kirk Westwood",
      "character": "Homeless"
    },
    {
      "id": "nm6848884",
      "name": "Paul White",
      "character": "Man on Bench"
    }
  ],
  "overview": "Kirsten is a successful woman, madly in love with her boyfriend back home in Chicago. In LA for a brief meeting to discuss selling her business, she really needs her boyfriend. Only he's not answering his phone...continually. Where is he? Why doesn't he pick up? Why won't he call back? What isn't Kirsten facing...?",
  "storyline": "Technology is changing the way we die - Kirsten is madly in love with his boyfriend and smiles on the outside. Everyone thinks she's doing fine but inside, she's one step away from the edge.",
  "plot": "College student Yoko Okazaki receives a phone call accompanied by an eerie, unusual ringtone, which goes to voicemail. The call is from Yoko's own number, dated two days to the future. Yoko and her friend Yumi Nakamura listen to the voicemail, hearing Yoko's voice chatting casually, followed by a horrendous scream and then dead silence. Two days later, Yoko calls Yumi that night to discuss shopping plans. Yumi realizes that Yoko is on the exact routine as the voicemail they'd heard before, but can only hear Yoko screaming after she is violently dragged off onto a speeding commuter train, which kills her. Her head then vomits a red candy upon death as her detached hand, still clutching her phone, calls a number. Several days later, Yoko's boyfriend, Kenji Kawai, reveals to Yumi that he had also received a voicemail accompanied by the same ringtone as Yoko's right after her death. Yumi then watches as Kenji is pulled into an empty elevator shaft to his death. He also spits out a red candy and calls a number, like Yoko.\n\nA colleague of Yumi's, Natsumi Konishi, is staying at Yumi's apartment when she receives the cursed voicemail, this time accompanied by a video showing Natsumi being haunted by a ghastly figure. Her attempt to discard the phone is futile as she keeps receiving the mails on other phones, and is taken for an exorcism. Desperate, Yumi meets with Hiroshi Yamashita, a detective who had investigated the curse. Yamashita reveals that his sister, Ritsuko, was a social care worker who had received the voicemail and eventually died from a house fire. Natsumi's exorcism is a disaster and she is killed when her body horribly contorts. Yumi receives the cursed voicemail shortly after.\n\nYumi and Yamashita learn from Ritsuko's journal that she took care of two children, Mimiko and Nanako Mizunuma, whose mother, Marie, was suspected of abusing them for the sake of attention. Mimiko succumbed to her asthma attack a year before, while Marie was last seen in a hospital, now destroyed after a fire. Only Nanako is identifiable; she is mute and carries a doll ringing with the tone that is the ringtone of the cursed voicemail. Yumi visits the abandoned hospital, but is haunted by ghosts until she meets Yamashita. During a lockdown, the two find Marie's decomposed body clutching a cellphone. The body rises and blasts Yamashita out of the room. It follows Yumi, who reminisces of her abusive mother and hugs Marie's body, which becomes inanimate again.\n\nYamashita is called to Nanako's orphanage to watch a nanny cam Marie had used to monitor her children. The cam shows that Marie never abused her children; instead, it was Mimiko, who cut Nanako's hand that resulted in Marie taking Nanako to the hospital while Mimiko succumbed to her asthma. Realizing that Mimiko is behind the curse, Yamashita races to Yumi's apartment as Yumi is haunted by Mimiko's ghost. Yumi stabs Yamashita, and he slips into unconsciousness. Yamashita dreams that he helps a dying Mimiko to breathe with an inhaler. Upon waking, he is in a hospital with Yumi carrying a knife. Spitting a candy for Yamashita to eat, she waits as he chews it and laughs.",
  "synopsis": null
}