{
  "imdb_id": "tt4196450",
  "tmdb_id": "339408",
  "douban_id": "26600422",
  "title": "The Birth of a Nation (2016)",
  "genres": [
    "Biography",
    "Drama",
    "History"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "120 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm1676649",
      "name": "Nate Parker"
    }
  ],
  "writer": [
    {
      "id": "nm1676649",
      "name": "Nate Parker",
      "description": "screenplay"
    },
    {
      "id": "nm1676649",
      "name": "Nate Parker",
      "description": "story by &"
    },
    {
      "id": "nm7473774",
      "name": "Jean McGianni Celestin",
      "description": "story by"
    }
  ],
  "cast": [
    {
      "id": "nm1676649",
      "name": "Nate Parker",
      "character": "Nat Turner"
    },
    {
      "id": "nm2309517",
      "name": "Armie Hammer",
      "character": "Samuel Turner"
    },
    {
      "id": "nm0000542",
      "name": "Penelope Ann Miller",
      "character": "Elizabeth Turner"
    },
    {
      "id": "nm0355097",
      "name": "Jackie Earle Haley",
      "character": "Raymond Cobb"
    },
    {
      "id": "nm0095478",
      "name": "Mark Boone Junior",
      "character": "Reverend Walthall"
    },
    {
      "id": "nm0231458",
      "name": "Colman Domingo",
      "character": "Hark"
    },
    {
      "id": "nm0254712",
      "name": "Aunjanue Ellis",
      "character": "Nancy"
    },
    {
      "id": "nm4833412",
      "name": "Dwight Henry",
      "character": "Isaac Turner"
    },
    {
      "id": "nm3813115",
      "name": "Aja Naomi King",
      "character": "Cherry"
    },
    {
      "id": "nm0779126",
      "name": "Esther Scott",
      "character": "Bridget"
    },
    {
      "id": "nm0809793",
      "name": "Roger Guenveur Smith",
      "character": "Isaiah"
    },
    {
      "id": "nm0005517",
      "name": "Gabrielle Union",
      "character": "Esther"
    },
    {
      "id": "nm3934745",
      "name": "Tony Espinosa",
      "character": "Young Nat Turner"
    },
    {
      "id": "nm1842948",
      "name": "Jayson Warner Smith",
      "character": "Earl Fowler"
    },
    {
      "id": "nm0835725",
      "name": "Jason Stuart",
      "character": "Joseph Randall"
    },
    {
      "id": "nm1347064",
      "name": "Chiké Okonkwo",
      "character": "Will"
    },
    {
      "id": "nm2095613",
      "name": "Katie Garfield",
      "character": "Catherine Turner"
    },
    {
      "id": "nm6487878",
      "name": "Kai Norris",
      "character": "Jasper"
    },
    {
      "id": "nm2444298",
      "name": "Chris Greene",
      "character": "Nelson"
    },
    {
      "id": "nm5123156",
      "name": "Kelvin Harrison Jr.",
      "character": "Simon"
    },
    {
      "id": "nm0183548",
      "name": "Steve Coulter",
      "character": "General Childs"
    },
    {
      "id": "nm1367802",
      "name": "Jeryl Prescott",
      "character": "Janice"
    },
    {
      "id": "nm6119252",
      "name": "Justin Randell Brooke",
      "character": "Guiles Reese"
    },
    {
      "id": "nm1665054",
      "name": "Dominic Bogart",
      "character": "Hank Fowler"
    },
    {
      "id": "nm8486019",
      "name": "Justin M. Smith",
      "character": "Jethro"
    },
    {
      "id": "nm3979406",
      "name": "Allen Phoenix",
      "character": "Abner       (as Allen Scott)"
    },
    {
      "id": "nm5583008",
      "name": "Aiden Flowers",
      "character": "Young John Clarke"
    },
    {
      "id": "nm2474245",
      "name": "Dane Davenport",
      "character": "John Clarke"
    },
    {
      "id": "nm2528977",
      "name": "Ryan Mulkay",
      "character": "Jesse"
    },
    {
      "id": "nm0899087",
      "name": "Danny Vinson",
      "character": "Benjamin Turner"
    },
    {
      "id": "nm0698354",
      "name": "Tom Proctor",
      "character": "E.T. Brantley"
    },
    {
      "id": "nm0184974",
      "name": "Dan Cox",
      "character": "Sheriff"
    },
    {
      "id": "nm1677807",
      "name": "Brad Schmidt",
      "character": "Lieutenant Akers"
    },
    {
      "id": "nm1151972",
      "name": "William Mark McCullough",
      "character": "White Man       (as Mark Mccullough)"
    },
    {
      "id": "nm8486020",
      "name": "Chief Olaitan",
      "character": "Ezekiel"
    },
    {
      "id": "nm3564864",
      "name": "Coletrane Williams",
      "character": "Rebel Boy #1"
    },
    {
      "id": "nm7379654",
      "name": "Elijah C. Walker",
      "character": "Rebel Boy #2"
    },
    {
      "id": "nm5817847",
      "name": "Alkoya Brunson",
      "character": "Young Hark"
    },
    {
      "id": "nm0831902",
      "name": "Hank Stone",
      "character": "Slave Driver"
    },
    {
      "id": "nm1150144",
      "name": "Cullen Moss",
      "character": "Man"
    },
    {
      "id": "nm8486021",
      "name": "Gabriela Novogratz",
      "character": "Woman"
    },
    {
      "id": "nm3573350",
      "name": "Griffin Freeman",
      "character": "Young Samuel Turner"
    },
    {
      "id": "nm4384994",
      "name": "Courtney Julien",
      "character": "Rebel Slave #1"
    },
    {
      "id": "nm0563868",
      "name": "Tim McAdams",
      "character": "Rebel Slave #2"
    },
    {
      "id": "nm0856086",
      "name": "Todd Terry",
      "character": "Rebel Slave #3"
    },
    {
      "id": "nm0621707",
      "name": "David Andrew Nash",
      "character": "Rebel Slave #4"
    },
    {
      "id": "nm3675340",
      "name": "Jaye Tyroff",
      "character": "Armed White #1"
    },
    {
      "id": "nm0520416",
      "name": "David Paul Lord",
      "character": "Armed White #2       (as David Lord)"
    },
    {
      "id": "nm3300498",
      "name": "Scott Loeser",
      "character": "Armed White #3"
    },
    {
      "id": "nm1829945",
      "name": "Greg Sproles",
      "character": "Armed White #4"
    },
    {
      "id": "nm8486022",
      "name": "Andy Martin",
      "character": "White Townsman"
    },
    {
      "id": "nm7407110",
      "name": "Kemuel Crossty",
      "character": "Rebel Man"
    },
    {
      "id": "nm6031337",
      "name": "Christian I. Noble",
      "character": "Rebel Slave"
    }
  ],
  "overview": "Nat Turner, a former slave in America, leads a liberation movement in 1831 to free African-Americans in Virgina that results in a violent retaliation from whites.",
  "storyline": "Set against the antebellum South, THE BIRTH OF A NATION follows Nat Turner (Nate Parker), a literate slave and preacher, whose financially strained owner, Samuel Turner (Armie Hammer), accepts an offer to use Nat's preaching to subdue unruly slaves. As he witnesses countless atrocities - against himself and his fellow slaves - Nat orchestrates an uprising in the hopes of leading his people to freedom.",
  "plot": null,
  "synopsis": "The film opens with a dream sequence of a young Nat Turner (Tony Espinosa) being taken into the woods to meet with a tribe of natives. The tribe leader notes that children that were marked at birth (Nat has three vertical marks going down his chest) were meant to be chosen for something important.Southampton County, Virginia, 1809Nat lives as a slave with his mother Nancy (Aunjanue Ellis), father Isaac (Dwight Henry), and grandmother Bridget (Esther Scott). They are owned by the Turner family. Nat frequently plays with the Turner's young son Samuel. After his mother Elizabeth (Penelope Ann Miller) calls her in, Nat spots a book sitting on the rocking chair on the porch.At night, Isaac is caught stealing food by three white men led by Raymond Cobb (Jackie Earle Haley). Isaac is nearly shot, but he grabs Cobb's gun and causes one of the men to get shot in the head. Isaac flees and spots Nat in the woods. He takes him back home to safety. Isaac tells Nancy that he must leave. Cobb and another man show up at Nat's house to find out where Isaac is. Nancy and Bridget say they don't know, and Nat never speaks a word.Elizabeth speaks to Nancy as she is hanging up the laundry. She tells Nancy that she found out Nat knows how to read, to his mother's disbelief. Elizabeth offers to teach Nat to read. She brings him into the house and teaches him with the Bible. Nat is later seen giving a sermon at church.Benjamin Turner passes away, so Nat is taken in by the Turner family to work on the field. He picks cotton for years, until he is an adult man (now played by Nate Parker), now set in the year 1831. He and Samuel (now played by Armie Hammer) are riding by a slave auction. Nat is taken with a \"wench\" named Cherry (Aja Naomi King) that is being sold off. He convinces Samuel to buy her for $275.On the way home, Nat picks up a toy for a white boy and informs his thankful mother, but her husband smacks Nat with a rod for talking to his wife. He continues to hit Nat until Nat grabs the rod. The man complains to Samuel that Nat assaulted him and his wife, but Samuel threatens to retaliate if the man doesn't leave Nat alone. When they get home, Nat speaks to Cherry, who attacks him. She is pulled off and later fixed up to look nicer so she may be given to Samuel's sister Catherine (Katie Garfield).Reverend Walthall (Mark Boone Jr.) approaches Samuel and suggests that Nat go on a tour to preach to the other negro slaves in the county, and in return, Samuel and his family would receive monetary compensation.Nat gets closer to Cherry, whose real name is Madison. Eventually, Nat proposes, and they are married in the woods by Bridget. Over the years, as Nat does his work in preaching, they become parents to a girl named Joanna.On Nat's travels in his preachings, he becomes aware of the cruelty of the plantation owners toward their slaves. Nat and Samuel watch as a man breaks out all of a slave's teeth and force-feed him through a funnel. In another instance, he sees as one of Samuel's friends requests a married slave, Esther (Gabrielle Union), to his quarters. She later exits the house in tears as her husband goes to console her and ask Nat where God is now.Cobb and his men find Cherry in the woods doing a chore. They violently assault her, and Nat goes home to find her battered face as she lies in bed.Nat's preaching becomes more impassioned, but he no longer holds any respect for his owners. When he talks back to Samuel and Walthall, Samuel whacks Nat in the mouth with the butt of his rifle. Nat is then brought into the middle of the town for a whipping.Nat's wounds are later treated by Bridget, who discusses her experiences of seeing acts such as this. Later, Bridget dies in her rocking chair. Nat buries her in the yard.Nat gathers a number of slaves in the community and rounds them up at night. They go into Samuel's home, where Nat strikes him in the chest with a hatchet. Samuel crawls out of his room before succumbing to the wound. The slaves go around to numerous houses to kill white men. One slave decapitates a man in front of his own house. A group of white men find the slaves in the woods and start shooting at them after a young slave boy informs the men of Nat's actions.Nat and his group are later confronted by Cobb and an angry mob of men. They charge into battle and brutally attack one another. Cobb shoots Nat through the shoulder and tries to kill him. Nat grabs his knife and sticks it through Cobb's throat. The surviving slaves retreat as soldiers arrive. Nat and two other men are cornered in a barn. The soldiers blast through the barn with a cannon. Only Nat survives.The white men retaliate against the black community by killing many black people, regardless of whether or not they are slaves or freed, or men, women or children. Nat finds Cherry doing a chore, but he speaks to her while staying hidden. She says she, Joanna, and Nancy are all safe, but the killing won't stop until Nat is found.Nat turns himself in before an angry group of white people. They begin to beat and kick him down, but the sheriff orders them to stop and wait for Nat to be hanged.Nat is brought to the gallows in front of a large crowd, made up of both black and white people. The white people jeer and shout insults at Nat while some manage to strike him. The black people are silent as they watch Nat being taken to his death. When asked if he has any last words, he simply says, \"I'm ready.\" Nat is hung until dead, and the last thing he sees is Cherry in the form of an angel. We then see the boy that alerted the men earlier during the uprising, watching with tears in his eyes. The final shot jumps forward to his adulthood as he fights alongside other black soldiers in the civil war.The closing text reads that the 1831 slave rebellion lasted nearly 48 hours, and over 60 white individuals were killed, leading to an even larger number in deaths of black individuals. Nat Turner's body was dismembered, flayed, and his remains were made into relics, all for the sake of preventing a legacy."
}