{
  "imdb_id": "tt4156148",
  "tmdb_id": "410069",
  "douban_id": null,
  "title": "Yaar (2014)",
  "genres": [
    "Documentary",
    "Short"
  ],
  "country": "Belgium",
  "version": [
    {
      "runtime": "20 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm6007799",
      "name": "Simon Gillard"
    }
  ],
  "writer": [
    {
      "id": "nm6007799",
      "name": "Simon Gillard",
      "description": null
    }
  ],
  "cast": null,
  "overview": "In the heart of the bush where the gravel is hollowed, a stubborn civilisation hunts out its future below the earth's surface. Blind, or perhaps all too seeing, they dig away, night and day, spurred on by the  madness that drives man to his death.",
  "storyline": null,
  "plot": "Childhood friends Chintan \"Chako\" (Divyang Thakkar) and Tapan \"Tino\" (Pratik Gandhi) aspire to invest in a real estate project called The Other Side, located near the scenic Nal Savorar area and their residence of Ahmedabad. They currently work as MRs while hoping to make quick money through a Godman who promises to triple their profit. The Godman turns out to be part of a larger con and his scheme is discovered by the police. As a result, Chako and Tino are scammed out of ₹1,80,000 (or 180,000 rupees).\n\nChako's father, Jeetu (Darshan Jariwala), runs a small local tea stall, in which hangs a painting from a prominent artist named M.F. Hassan (based on the late M.F. Husain). The piece was gifted to Jeetu as a sign of their close friendship, before Hassan's rise to prominence and eventual death. Upon learning that Jeetu's tea stall painting is highly coveted, Tino comes up with another idea to secure an investment with The Other Side: secretly replace the painting with an identical fake one, and then loan the original for cash. Initially hesitant but desperate, Chako assists in the plan along with their friend Uday (Kavin Dave), an avid painter who begrudgingly agrees to compose an exact copy of the piece himself.\n\nWith the switch successful, Chako and Tino mortgage the original painting to a local art dealer, Y.B. Gandhi (Manoj Joshi). Shortly thereafter, however, Gandhi informs Chako that the painting he received is fake, and that someone else had tried to sell the same painting to another dealer. Gandhi convinces Chako that either Tino had double-crossed him, or that his father had been lying about the painting's authenticity. Chako returns the money back to Gandhi, and angrily confronts Tino, who indeed went to a separate dealer, but was sent by Uday for an art survey only. Chako then meets his father and accuses him of confabulating a friendship. Angered by the accusations and hurt by Chako's loss of the painting, Jeetu kicks him out of the house.\n\nThe M.F. Hassan painting, however, was an original all along, and Gandhi - whom Hassan hated and never lent his work to - had cheated Chako and Tino out of the painting. Gandhi then publicly humiliates Jeetu by telling the press he never had a friendship with Hassan, and that the stories of him making his paintings at the tea stall are all false.\n\nHoping to redeem themselves, Chako and Tino devise a plan to take advantage of Gandhi's own greed in order to get the painting back for Jeetu. Helping with the elaborate scheme include Uday and Jigisha (Samvedna Suwalka), Tino's girlfriend. They hire a method actor named Pranav (Amit Mistry) to pose as \"Prabodh Gupta\", a fictitious international artist from Bihar whose work has yet to be exhibited in India. The group successfully lures Gandhi into funding a fabricated NGO and conducting Prabodh's supposed lucrative first exhibition in India, in exchange for the tea stall painting.\n\nPranav and Uday narrowly retrieve the painting on the day of the held exhibition, just as Gandhi realizes that Prabodh is a fraud. He confronts the place of the fake NGO but encounters Chako, Tino, and Jeetu. Chako and Tino demand that he publicly retract his earlier statements about Jeetu, or else be arrested for selling fake paintings and creating the fictitious \"Prabodh Gupta\" himself (since Gandhi was tricked earlier into funding the fake NGO). Realizing his defeat, Gandhi tries to offer money, but Jeetu declines and chastises him for his greed being the reason Hassan never worked with large art curators.\n\nGandhi holds a televised news conference the next morning, apologizing for his previous accusations against Jeetu. Hassan's piece is returned to Jeetu's shop, after he and Chako fully reconcile. Uday, whose own paintings were used as Prabodh's work from earlier, is offered his own local exhibition, attended by much happier Chako and Tino.",
  "synopsis": null
}