{
  "imdb_id": "tt4105970",
  "tmdb_id": "325302",
  "douban_id": null,
  "title": "They Look Like People (2015)",
  "genres": [
    "Drama",
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "80 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm2736593",
      "name": "Perry Blackshear"
    }
  ],
  "writer": [
    {
      "id": "nm2736593",
      "name": "Perry Blackshear",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm1423231",
      "name": "MacLeod Andrews",
      "character": "Wyatt"
    },
    {
      "id": "nm3602411",
      "name": "Evan Dumouchel",
      "character": "Christian"
    },
    {
      "id": "nm3321746",
      "name": "Margaret Ying Drake",
      "character": "Mara"
    },
    {
      "id": "nm1966332",
      "name": "Mick Casale",
      "character": "Psychiatrist"
    },
    {
      "id": "nm3106462",
      "name": "Elena Greenlee",
      "character": "Sandy"
    },
    {
      "id": "nm4127313",
      "name": "Laura Ambrose",
      "character": "Co-worker"
    },
    {
      "id": "nm9071445",
      "name": "Ben Blackshear",
      "character": "Hipster"
    },
    {
      "id": "nm2736593",
      "name": "Perry Blackshear",
      "character": "Polish Guy"
    },
    {
      "id": "nm7745699",
      "name": "Julia Guo",
      "character": "Kat       (voice)"
    },
    {
      "id": "nm9071444",
      "name": "Amaani Hamid",
      "character": "Girl at Work"
    },
    {
      "id": "nm9071443",
      "name": "Jessie Kim",
      "character": "Hannah       (voice)"
    },
    {
      "id": "nm3063252",
      "name": "Sang Wook Kim",
      "character": "Co-worker"
    },
    {
      "id": "nm9071447",
      "name": "Matt Lawrence",
      "character": "Co-worker"
    },
    {
      "id": "nm9071446",
      "name": "Eric Ohrt",
      "character": "Man in Subway"
    },
    {
      "id": "nm8251016",
      "name": "Carlos Palacio",
      "character": "Co-worker"
    },
    {
      "id": "nm9071441",
      "name": "Kimberly Parker",
      "character": "Hannah"
    },
    {
      "id": "nm3034692",
      "name": "Lauren Parkinson",
      "character": "Hannah       (archive footage)"
    }
  ],
  "overview": "Suspecting that people around him are turning into evil creatures, a troubled man questions whether to protect his only friend from an impending war, or from himself.",
  "storyline": "In New York, the shy Christian likes his boss Mara but is afraid to ask her out on a date. When he stumbles upon his old friend Wyatt who is passing through New York, Christian invites him to stay in his apartment. Christian is not aware of the impending doom Wyatt believes is about to befall humanity, as the people Wyatt cares most about turn into evil creatures. The war between humans and these creatures is close, and Wyatt will have to decide who he can trust to survive.",
  "plot": "Close friends Wyatt and Christian reunite in New York City, where Christian invites Wyatt to stay at his apartment. Wyatt has withdrawn into himself, having recently broken up with his fiancee, while Christian, who lost his girlfriend, attempts to counter his insecurities with bodybuilding and aggressive machismo. As the two old friends bond, Christian invites Wyatt along on the date he has with his supervisor, Mara, calling ahead and asking Mara to invite her friend.\n\nWyatt and Christian arrive to find that Mara's friend Sandy has fallen and injured herself. Wyatt examines Sandy and recommends she go to the hospital. Wyatt, Christian and Mara spend the evening in the waiting room until Sandy's release, and Mara gratefully thanks Christian for staying. As Christian walks Mara to the subway, he fails to take the initiative to kiss her goodnight. Wyatt reassures Christian that Mara is probably still interested in him despite the ending. After Christian falls asleep, Wyatt receives an anonymous phone call, where a muddled voice tells him he only has time to save himself, and he must leave the city and prepare for the demonic invasion.\n\nMara and Christian continue seeing each other. Wyatt receives subsequent phone calls, this time in Mara's voice, alerting him to ominous signs of the apocalypse and the nature of the demons, specifically how they infect humans. Wyatt confers with a psychiatrist his fears of psychosis, but cuts the session short when he becomes convinced the psychiatrist himself is possessed by demons. Wyatt stockpiles weapons in Christian's cellar and alternately contemplates both suicide and murder of passerby he believes to be possessed.\n\nWith his newfound assertiveness, Christian believes himself to be in line for a raise, only for Mara to reveal that he has been fired. A note on his computer, signed by his coworkers, accuses him of being an asshole. Christian returns home to find Wyatt waiting for him. Before he can say anything, Mara visits. At first angry, Christian apologizes and invites her in. The three chat amicably, and Christian leaves to get food. Wyatt invites Mara to explore the house and takes her downstairs to show his weapon stash. Wyatt asks her for further information on the demonic invasion, alluding to her voice on the phone. When Mara realizes Wyatt's seriousness, she flees the house. Christian returns, disappointed that she left, and Wyatt becomes highly agitated and rants about the coming demonic invasion. Christian calms Wyatt down and sets him up with a psychiatrist, the same one Christian went to when he previously attempted suicide.\n\nWyatt accosts Mara, trying to apologize, and she lashes out in self-defense, injuring Wyatt. Out of remorse, Mara helps him clean up, but Wyatt becomes horrified as she transforms into a demon. Wyatt runs away and finds Christian preparing to join the Army to conquer his insecurities. Wyatt instead convinces him to leave the city and prepare for the coming apocalypse. Christian agrees, so long as Wyatt attends his psychiatric appointment. As Wyatt sees omens of the apocalypse, he instead insists they barricade the basement. To show his trust in Wyatt, Christian allows himself to be bound and gagged in case he is possessed. On the hour of the apocalypse, Wyatt becomes convinced Christian is possessed, and prepares to kill him as he watches Christian transform. At the last moment, Wyatt realizes he is hallucinating, and recognizing Christian as truly human, frees him. The two embrace, and Christian remarks that he has finally conquered his insecurities by facing death.",
  "synopsis": null
}