{
  "imdb_id": "tt4170330",
  "tmdb_id": "302613",
  "douban_id": null,
  "title": "Lorna (2014)",
  "genres": [
    "Comedy",
    "Romance"
  ],
  "country": "Philippines",
  "version": [
    {
      "runtime": "123 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.8,
  "director": [
    {
      "id": "nm2332718",
      "name": "Sigrid Andrea Bernardo"
    }
  ],
  "writer": [
    {
      "id": "nm2332718",
      "name": "Sigrid Andrea Bernardo",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0148313",
      "name": "Shamaine Buencamino",
      "character": "Lorna"
    },
    {
      "id": "nm0530155",
      "name": "Maria Isabel Lopez",
      "character": "Elvie"
    },
    {
      "id": "nm0898183",
      "name": "Raquel Villavicencio",
      "character": "Miriam"
    },
    {
      "id": "nm0225010",
      "name": "Lav Diaz",
      "character": "Rodolfo"
    },
    {
      "id": "nm1797691",
      "name": "Felix Roco",
      "character": "Ardie"
    },
    {
      "id": "nm2405591",
      "name": "Jim Paredes",
      "character": "Victor"
    },
    {
      "id": "nm1205110",
      "name": "Juan Rodrigo",
      "character": "Bernie"
    },
    {
      "id": "nm0032629",
      "name": "Angel Aquino",
      "character": "Carmina"
    },
    {
      "id": "nm0269292",
      "name": "Miguel Faustmann",
      "character": "Johnny"
    },
    {
      "id": "nm5962106",
      "name": "Karl Medina",
      "character": "Emman the Waiter"
    }
  ],
  "overview": "Lorna is sixty year old woman who is constantly searching for the right man, having failed at so many relationships. Having lived close to a lifetime alone, she decides to take another stab at moving on and more importantly, love.",
  "storyline": "A midlife comedy drama of a woman's romantic life-a story of being alone, growing old, looking for love, and moving on. Lorna, already in her 60's, finds an online lover and an old flame that will turn her life upside down. But at her age, is love too late for a woman like Lorna?",
  "plot": "The publicity to Lorna exclaimed: \"Without artistic surrender, without compromise, without question or apology, an important motion picture was produced: LORNA—a woman too much for one man.\"\n\nLorna (Lorna Maitland) is a sexually unsatisfied young wife married to Jim (James Rucker), who works at a salt mine and spends his evenings studying to become a CPA. When Lorna goes for a nude swim in the river, she is raped by an escaped convict (Mark Bradley), but her frustrated sexuality is awakened. She invites the stranger to their home while Jim is at work.\n\nMeanwhile, Jim's co-workers tease him about his wife's beauty and infidelity. Jim returns home early and discovers Lorna's unfaithfulness. The events take place on Jim and Lorna's anniversary, which Jim has forgot (Jim's army patch is the 6th Armored).",
  "synopsis": null
}