{
  "imdb_id": "tt4112416",
  "tmdb_id": "320933",
  "douban_id": null,
  "title": "Tamaar Padaar (2014)",
  "genres": [
    "Comedy"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "137 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.0,
  "director": [
    {
      "id": "nm4543222",
      "name": "Dileesh Nair"
    }
  ],
  "writer": [
    {
      "id": "nm4543222",
      "name": "Dileesh Nair",
      "description": null
    },
    {
      "id": "nm4544331",
      "name": "Syam Pushkaran",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2055008",
      "name": "Baburaj",
      "character": "Jumper Thambi"
    },
    {
      "id": "nm5584853",
      "name": "Chemban Vinod Jose",
      "character": "Tubelight Mani       (as Vinod Chemban)"
    },
    {
      "id": "nm1335387",
      "name": "Prithviraj Sukumaran",
      "character": "ACP Pouran"
    },
    {
      "id": "nm6684208",
      "name": "Srinda Ashab",
      "character": "Valsamma"
    },
    {
      "id": "nm5444787",
      "name": "Vijay Babu",
      "character": "Purushan Police"
    },
    {
      "id": "nm6836643",
      "name": "Jojet John",
      "character": ""
    },
    {
      "id": "nm6440625",
      "name": "Anjali Nair",
      "character": "Purushan's wife       (as Anjali Aneesh Upasana)"
    },
    {
      "id": "nm8199042",
      "name": "Sandeep Narayan",
      "character": "Lorry Driver - Thief"
    },
    {
      "id": "nm8223791",
      "name": "Manju Sunichen",
      "character": "Kanakam"
    },
    {
      "id": "nm1432578",
      "name": "Shammi Thilakan",
      "character": "Kumaran"
    }
  ],
  "overview": "Tamaar Padaar is the satirical comedy movie directed by scenarist Dileesh Nair. The movie, which stars Prithviraj, Baburaj, Chemban Vinod Jose and Srinda Ashab in central roles, revolves around ACP Pouran, and circus artists Jumber Thambi and Crossbelt Mani who comes into his life.",
  "storyline": "Tubelight Mani and Jumper Thambi, two harmless, self-employed circus performers, gets misunderstood as two terrorists by ACP Pouran. He later understands the truth and now wants them released at all costs.",
  "plot": "Jumper Thambi (Baburaj) and Tubelight Mani (Chemban Vinod Jose) are street performers. Jumper Thambi does stunts like bike Jumping and Tubelight Mani does stunts with Tubelight. They do not know each other in the beginning but once they meet each other at a Temple festival, they instantly becomes good friends. Once they decide to do a stunt together for media visibility. They both tried to squeeze-in through a bicycle tube but ends up getting stuck.\n\nPrithviraj Sukumaran acts as ACP Pouran whose main intention is to stand out among his colleagues misunderstands. While Jumper Thambi and Tubelight Mani are struggling to get out of the bicycle tube, ACP happens to see them by accident. ACP finds resemblance between Jumber Thambi and a notorious terrorist. He arrests them both and puts them in trial. The ruling party takes undue advantage of this situation by taking all credits and meanwhile all international anti-terrorist organizations also wants to get these two in custody. ACP Pauran later understands the truth and now wants them released at all cost. He tries the legal way but gets no help from his superior officers. Finally the duo is sentenced to death penalty. ACP Pauran helps them escape by faking proof that they were hanged. In the end we see both Jumper Thambi and Tubelight Mani living in an unknown place with a bearded look away from their old lives and means.",
  "synopsis": null
}