{
  "imdb_id": "tt4192636",
  "tmdb_id": "334030",
  "douban_id": "25958788",
  "title": "Forget Me Not (2015)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.9,
  "director": [
    {
      "id": "nm0394676",
      "name": "Kei Horie"
    }
  ],
  "writer": [
    {
      "id": "nm6906628",
      "name": "Mizuho Hirayama",
      "description": "based on the novel by"
    },
    {
      "id": "nm5128295",
      "name": "Satoko Okazaki",
      "description": "screenplay &"
    },
    {
      "id": "nm0394676",
      "name": "Kei Horie",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm6327727",
      "name": "Nijirô Murakami",
      "character": "Takashi"
    },
    {
      "id": "nm4009668",
      "name": "Akari Hayami",
      "character": "Azusa"
    },
    {
      "id": "nm1855836",
      "name": "Chiharu",
      "character": ""
    },
    {
      "id": "nm0193459",
      "name": "Mickey Curtis",
      "character": ""
    },
    {
      "id": "nm5156588",
      "name": "Reina Ikehata",
      "character": ""
    },
    {
      "id": "nm1491167",
      "name": "Satoshi Nikaido",
      "character": ""
    },
    {
      "id": "nm6906627",
      "name": "Yoshikazu Nishikawa",
      "character": "Takemura, Hiroto"
    },
    {
      "id": "nm4111995",
      "name": "Hikaru Ohsawa",
      "character": ""
    },
    {
      "id": "nm6655890",
      "name": "Yûtarô Watanabe",
      "character": ""
    },
    {
      "id": "nm1798734",
      "name": "Shigenori Yamazaki",
      "character": ""
    }
  ],
  "overview": "Takashi Hayama (Nijiro Murakami) is a third year high school student. He falls in love with Azusa Oribe (Akari Hayami) at first sight and they begin to date.  One day, Azusa tells Takashi \"people who meet me, forget about me several hours later.\"  Takashi doesn't believe Azusa, but by chance he realizes that he forgot about Azusa. So he won't forget Azusa, Takashi begins to leave a note for himself and Azusa.",
  "storyline": "This film tells the story of a high school student named Takashi (Murakami Nijiro) who falls in love at first sight with a girl along Azusa (Akari Hayami), and then they started dating. One day, Azusa made a strange confession by telling Takashi that everyone including his family will forget about him a few hours after the meeting. At first Takashi do not believe what is said Azusa, but as time went on, Takashi began to realize that she began to forget the details of the time they spent together. Knowing this, he then makes a note documenting their time together so he would not forget. So what happens next?",
  "plot": "The film follows Will Fletcher, a musician, and Eve Fisher, who works in a pub where he is performing, during one night in London. After Will has saved Eve from a drunken customer at closing time, they stay up all night together, meandering through the streets of London and forging a relationship. Next morning, Eve takes him to see her Alzheimer's-suffering grandmother.",
  "synopsis": null
}