{
  "imdb_id": "tt4186118",
  "tmdb_id": "302638",
  "douban_id": null,
  "title": "Iyobinte Pusthakam (2014)",
  "genres": [
    "Action",
    "Adventure",
    "Drama",
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "158 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm2039170",
      "name": "Amal Neerad"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm1335704",
      "name": "Fahadh Faasil",
      "character": "Aloshy"
    },
    {
      "id": "nm1334389",
      "name": "Jayasurya",
      "character": "Angoor Ravuther"
    },
    {
      "id": "nm0482309",
      "name": "Lal",
      "character": "Iyob"
    },
    {
      "id": "nm1690618",
      "name": "Isha Sharvani",
      "character": "Martha"
    },
    {
      "id": "nm4737131",
      "name": "Jinu Joseph",
      "character": "Ivan"
    },
    {
      "id": "nm1728792",
      "name": "Padmapriya",
      "character": "Rahel"
    },
    {
      "id": "nm2035937",
      "name": "Vinayakan",
      "character": "Chemban"
    },
    {
      "id": "nm5584853",
      "name": "Chemban Vinod Jose",
      "character": "Dimitri       (as Vinod Chemban)"
    },
    {
      "id": "nm0712439",
      "name": "T.G. Ravi",
      "character": "Comrade"
    },
    {
      "id": "nm2573453",
      "name": "Sreejith Ravi",
      "character": "Young Comrade"
    },
    {
      "id": "nm3351235",
      "name": "Aashiq Abu",
      "character": "P.J. Antony"
    },
    {
      "id": "nm0019731",
      "name": "Aliyar",
      "character": "Comrade's Assistant"
    },
    {
      "id": "nm8255083",
      "name": "Breena Ilane Balachandran",
      "character": "Young Martha"
    },
    {
      "id": "nm8163960",
      "name": "Nebish Benson",
      "character": "Aloshy (Child)"
    },
    {
      "id": "nm6643390",
      "name": "Shebin Benson",
      "character": "Aloshy (Teenage)"
    },
    {
      "id": "nm8255079",
      "name": "Salam Bukhari",
      "character": "Shemon"
    },
    {
      "id": "nm8255076",
      "name": "Amith Chakalakkal",
      "character": "Nisam Ravuthar       (as Amit Chakkalackal)"
    },
    {
      "id": "nm6120331",
      "name": "Franko Davis",
      "character": "Priest"
    },
    {
      "id": "nm8255081",
      "name": "Chethan Jayalal",
      "character": "Young Chemban       (as Chetan J. Lal)"
    },
    {
      "id": "nm6961283",
      "name": "Joji Jose",
      "character": "Young Ivan"
    },
    {
      "id": "nm4191548",
      "name": "Vijayan Karanthoor",
      "character": "Chacko's Assistant"
    },
    {
      "id": "nm8255078",
      "name": "Sunny Kottayam",
      "character": "Thacho"
    },
    {
      "id": "nm2445419",
      "name": "Lena",
      "character": "Kazhali"
    },
    {
      "id": "nm8255074",
      "name": "Rita Margaritha",
      "character": "Harrison's Wife"
    },
    {
      "id": "nm8255077",
      "name": "Bonny Mary Mathew",
      "character": "Rosamma"
    },
    {
      "id": "nm5583586",
      "name": "Reenu Mathews",
      "character": "Annamma"
    },
    {
      "id": "nm1517903",
      "name": "Anil Murali",
      "character": "Mathuppilla"
    },
    {
      "id": "nm8255080",
      "name": "Ebina Nelson",
      "character": "Servant Girl"
    },
    {
      "id": "nm8255082",
      "name": "Vishnu Noolu",
      "character": "Young Dimithri"
    },
    {
      "id": "nm3898762",
      "name": "Amala Paul",
      "character": "Dancer"
    },
    {
      "id": "nm4584004",
      "name": "Dileesh Pothan",
      "character": "Tea Shop Owner"
    },
    {
      "id": "nm4997683",
      "name": "Saritha",
      "character": "Cheeru"
    },
    {
      "id": "nm6229968",
      "name": "Soubin Shahir",
      "character": "Narayanan"
    },
    {
      "id": "nm4538068",
      "name": "Surjith",
      "character": "Lasar       (as Surjith Gopinath)"
    },
    {
      "id": "nm8255075",
      "name": "Ajith Tripunithura",
      "character": "Chacko"
    },
    {
      "id": "nm6411762",
      "name": "Vishnu Unnikrishnan",
      "character": "Young Iyob"
    },
    {
      "id": "nm6684209",
      "name": "Pauly Valsan",
      "character": "Thresya       (as Pauly)"
    },
    {
      "id": "nm3682633",
      "name": "John Vijay",
      "character": "Ganapathy Iyer"
    },
    {
      "id": "nm8255073",
      "name": "Sal Yusuf",
      "character": "Harrison       (as Sal Yousuf)"
    }
  ],
  "overview": "Iyobinte Pustakam (English: The Book of Iyob) is a Malayalam period thriller film directed, filmed and co-produced by Amal Neerad. Set in the backdrop of the picturesque Munnar, it tells the story of Iyob, a slave-turned-master.",
  "storyline": "The life of a native takes an upturn when a British Businessman Harrison takes him under his wing and christens him Iyob. With all the loyalty shown to his master, Iyob eventually ends up inheriting the tea estates in Munnar after Harrison's demise. With his sons, Ivan, Dmitri & Aloshy, growing up & old age setting in; Iyob is all set to be overthrown by his own children. The story is about how Iyob copes with his decision and their subsequent consequences overlapped with a slick narration by a communist leader.",
  "plot": "The film starts with a message \"The aged aren't always wise, nor do the elderly always understand justice\" Job 32:9. The story is narrated by the communist leader (TG Ravi) who witnessed it. The story is set in 1900 in Munnar in British occupied India. Harrison is a British businessman who comes to Munnar to cultivate tea. Harrison finds an able boy amidst his workers and names him 'Iyob'(Lal). Harrison holds Iyob close and helps him get married to Annamma (Reenu Mathews). Harrison's wife leaves him, later he sees Kazhali (Lena) and becomes interested in her. When Harrison finds out Kazhali's relation with Thacho, one of his servants, he orders Iyob to kill Thacho and Iyob kills him. Afterwards, Harrison takes Kazhali as his mistress and she becomes pregnant. During the First World War, Harrison's business gets affected and he leaves for Britain but dies on the way. Knowing this Iyob throws Kazhali out of the house and takes over all assets of Harrison.\n\nIyob has three sons Dmitri(Chemban Vinod Jose),Ivan(Jinu Joseph) and Aloshy(Fahadh Faasil). Dmitri and Ivan is ruthless like Iyob whereas Aloshy is kind and compassionate like his mother. Aloshy leaves the house as a child after seeing his brothers rape and kill a girl who was a servant there. He runs away to Cochin and stays there. After some years Aloshy joins the Royal Navy.After the Royal Indian Navy mutiny of 1946 he returns to his father and brothers in Munnar, but is upset by the wrongdoings of his father and brothers. When Iyob finds out Aloshy was dismissed from the navy because he defected and became a part of the movement against the British, he orders Aloshy to leave. Aloshy meets his love Martha (Isha Sharvani) who is the daughter of Kazhali and says he will come back for her. He leaves for Cochin, but on his way he is attacked by Dmitri and Ivan who tries to kill him, but Aloshy survives and is found by his childhood friend Chemban (Vinayakan). At this time Iyob's health deteriorates and his sons overpower him making pacts with Angoor Rawther (Jayasurya) despite opposition by Iyob. Dmitri and Ivan finds out Aloshy is alive with Martha.\n\nWhen Dimitri finds out about the illicit relationship of Ivan with his wife Rahel(Padmapriya), Ivan kills Dimitri. It is revealed that Rahel is daughter of Thacho whom Iyob killed and she is taking revenge using Ivan. Iyob escapes from home and ends up under Aloshy's shelter. Iyob reveals that all the assets of Harrison belongs to Kazhali and he was cheating them the whole time. Aloshy is arrested by the police but is liberated by the narrator (played by Sreejith Ravi) who was against Ivan and Angoor Rawther. Ivan knowing that all the assets will be lost, decides to kill Aloshy, but he despises Rahel when he come to know about her real intention. Rahel makes a deal with Angoor Rawther to kill everyone in his way including Ivan and all the assets and Rahel will be his. Iyob and Martha try to escape through the forest, but Iyob is shot down by Angoor Rawther. Aloshy finds Martha sinking into a swamp and tries to help her. Ivan and Angoor Rawther comes towards them, when Angoor tries to shoot Ivan he runs out of bullets and Aloshy stabs Angoor with a ramrod and Ivan shoots Angoor's associate, when Ivan tries to kill Aloshy he is killed by Chemban and Aloshy kills Angoor. Desperate of the situation Rahel shoots herself. Afterwards, Aloshy and Martha is seen leaving Munnar.\n\nAt the end of the film the narrator is arrested by police and he remarks that people like Aloshy would make the life of people much prosperous than it is now.",
  "synopsis": null
}