{
  "imdb_id": "tt4183116",
  "tmdb_id": "334037",
  "douban_id": null,
  "title": "Dead Saturday (2015)",
  "genres": [
    "Short",
    "Drama",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "9 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.8,
  "director": [
    {
      "id": "nm3335753",
      "name": "Benjamin Stark"
    }
  ],
  "writer": [
    {
      "id": "nm1533590",
      "name": "Jeremy Burgess",
      "description": null
    },
    {
      "id": "nm3335753",
      "name": "Benjamin Stark",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4986975",
      "name": "Erich Abbott",
      "character": "Clint"
    },
    {
      "id": "nm6898883",
      "name": "James Boykin",
      "character": "Kyle"
    },
    {
      "id": "nm5386838",
      "name": "Caroline Hebert",
      "character": "Ashley"
    },
    {
      "id": "nm4852204",
      "name": "Kurt Krause",
      "character": "Jimmy"
    },
    {
      "id": "nm0000616",
      "name": "Eric Roberts",
      "character": "Pastor Malcolm"
    }
  ],
  "overview": "Jimmy is convinced he's found a way to release his inner demons without going against the will of God. He believes that on the day between Good Friday and Easter Sunday, when Jesus is “dead”, our sins are overlooked.  Jimmy believes in... DEAD SATURDAY.",
  "storyline": "In small-town Alabama, religion isn't just a part of your upbringing. It's an expectation. After several rounds of questions for Pastor Malcolm at his local church about what's real and what's symbolic, teenaged Jimmy and his misled friends believe they've found a legitimate vessel for releasing their inner demons without going against the will of God: Dead Saturday, the time between Good Friday and Easter Sunday, when Jesus is \"dead\" and our sins are overlooked. But before Jimmy can put his plan into action, he is compelled to have Malcolm acknowledge and corroborate his interpretation. However, Malcolm, not knowing that he planted the seed of misguidedness in Jimmy's mind, doesn't see things the same way. As the two confront each other in the middle of the church, with Jimmy's comrades and an unexpected third party there to witness, the future of their entire community hangs in the balance.",
  "plot": null,
  "synopsis": null
}