{
  "imdb_id": "tt4180514",
  "tmdb_id": "339530",
  "douban_id": null,
  "title": "Tremors 5: Bloodlines (Video 2015)",
  "genres": [
    "Action",
    "Adventure",
    "Comedy",
    "Horror",
    "Sci-Fi",
    "Thriller"
  ],
  "country": "South Africa",
  "version": [
    {
      "runtime": "99 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.3,
  "director": [
    {
      "id": "nm0666806",
      "name": "Don Michael Paul"
    }
  ],
  "writer": [
    {
      "id": "nm7629018",
      "name": "William Truesmith",
      "description": "screenplay as Woodrow Truesmith &"
    },
    {
      "id": "nm7629019",
      "name": "M.A. Deuce",
      "description": "screenplay and"
    },
    {
      "id": "nm0924095",
      "name": "John Whelpley",
      "description": "screenplay"
    },
    {
      "id": "nm7629018",
      "name": "William Truesmith",
      "description": "story as Woodrow Truesmith &"
    },
    {
      "id": "nm7629019",
      "name": "M.A. Deuce",
      "description": "story &"
    },
    {
      "id": "nm7629021",
      "name": "C.J. Strebor",
      "description": "story"
    }
  ],
  "cast": [
    {
      "id": "nm1409827",
      "name": "Brandon Auret",
      "character": "Johan Dreyer"
    },
    {
      "id": "nm1799082",
      "name": "Natalie Becker",
      "character": "Lucia"
    },
    {
      "id": "nm1410288",
      "name": "Emmanuel Castis",
      "character": "Dr. Michael Swan"
    },
    {
      "id": "nm0343447",
      "name": "Michael Gross",
      "character": "Burt Gummer"
    },
    {
      "id": "nm5430058",
      "name": "Zak Hendrikz",
      "character": "Riley"
    },
    {
      "id": "nm1101802",
      "name": "Daniel Janks",
      "character": "Erich Van Wyk"
    },
    {
      "id": "nm1833171",
      "name": "Lawrence Joffe",
      "character": "Basson"
    },
    {
      "id": "nm0005085",
      "name": "Jamie Kennedy",
      "character": "Travis B. Welker"
    },
    {
      "id": "nm0623486",
      "name": "Ernest Ndlovu",
      "character": "Ndebele Chieftain"
    },
    {
      "id": "nm3373960",
      "name": "Rea Rangaka",
      "character": "Baruti"
    },
    {
      "id": "nm0731167",
      "name": "Ian Roberts",
      "character": "Den Bravers"
    },
    {
      "id": "nm0781075",
      "name": "Sello Sebotsane",
      "character": "Thaba"
    },
    {
      "id": "nm7824758",
      "name": "Wayne Smith",
      "character": "Den's Co-Pilot"
    },
    {
      "id": "nm7824759",
      "name": "Matthys Kuhn",
      "character": "Den's Co-Pilot"
    },
    {
      "id": "nm3413191",
      "name": "Pearl Thusi",
      "character": "Dr. Nandi Montabu"
    },
    {
      "id": "nm7639982",
      "name": "Nolitha Zulu",
      "character": "Amahle Montabu"
    }
  ],
  "overview": "The giant, man-eating Graboids are back and even deadlier than before, terrorizing the inhabitants of a South African wildlife reserve as they attack from below-and above.",
  "storyline": "The giant, man-eating Graboids are back and even deadlier than before, terrorizing the inhabitants of a South African wildlife reserve as they attack from below-and above.",
  "plot": "Burt Gummer, now a star in his own survivalist series, and his new cameraman Travis Welker are approached by Erick Van Wyk, who asks them to deal with Ass-Blasters in South Africa. After Erick agrees to pay them for their services, Burt and Travis head to Africa to hunt down the creatures. During the trip, Burt befriends their pilot, Dan Bravers. Upon arrival, Burt's heavy weaponry is impounded due to South African gun laws. Johan Dreyer proudly displays his rhino-tranquilizer rifle but Burt explains that all Graboids are immune to tranquilizers, so he and Travis are instead equipped with a small collection of guns that Van Wyk has gathered. Burt takes the guns but protests that their calibre is far too small to hunt Graboids. They set up their quarters at an animal refuge, where Travis befriends a little girl named Amahle Montabu and meets her mother Nandi. Meanwhile, at a dig site, two paleontologists celebrate after finding the fossilized remains of a Graboid, but they are attacked and eaten. Investigating the scene, Burt sees the fossil and realizes that it is a different breed of Graboid.\n\nThat night, Travis attends a local tribal dance with Nandi. At the refuge, a worker named Thaba is attacked by an Ass-Blaster that carries him away. Burt orders the refuge to be evacuated and reprimands Travis for his absence. He then heads out with Erick and Dreyer to hunt the Ass-Blaster. They find it in a cave, but during the ensuing attack, Dreyer is killed. After Burt finds that the Ass-Blasters have been laying Graboid eggs, Erick reveals himself to be a poacher, planning to sell the eggs on the black market. He knocks Burt out, locks him in the metal cage, and leaves with the eggs. Travis arrives to rescue Burt the next day, but the truck's fuel line is broken by a rock, so they head back to the refuge on foot.\n\nIn the desert, Burt and Travis find Erick's truck crashed, with Erick fleeing from a massive Graboid with detachable and independent tentacles, which Burt dubs \"The Queen Bitch\". Burt shoots the tentacles, but the Queen Bitch eats Erick. Burt agrees to let Travis go back in the cave alone and use a recovered grenade on the nest, while he contacts Dan for transport and back-up. In the cave, Travis encounters the Ass-Blaster; fleeing, he and Burt destroy the nest. While Dan flies them back to their truck, Travis reveals to Burt that he is Burt's son, the child of a one-night stand back in Florida; having heard of Burt's exploits, Travis wanted to be like his father.\n\nAt the refuge, the workers are attacked by Ass-Blasters. Nandi, Amahle, and a worker named Baruti escape and head for the village, where they discover that Amahle is hiding a Graboid egg, which was why the creatures were singling out the refuge for attack. Arriving at the village's gas station, the trio is attacked again, and Amahle wanders away with the egg. Burt and Travis arrive, finding the village under siege by the Queen Bitch's tentacles. Travis retrieves the egg, and Baruti gets Amahle to safety. They shoot the tentacles, but the Queen Bitch arrives. Nandi suggests using the daily thunderstorm to kill it. Travis distracts it as the villagers construct a trap. When the storm erupts, Nandi lures the Queen Bitch in with the egg. Burt, Nandi, and Baruti attack it with their weapons before lightning bolts attracted by the trap strike, destroying the egg and then the graboid.\n\nAfterwards, Burt accepts Travis as his son, inviting him to join him in his work. A mid-credits scene shows Burt and Travis now co-host Burt's reality show, and they kill a variety of monsters around the globe.",
  "synopsis": null
}