{
  "imdb_id": "tt4173614",
  "tmdb_id": "408670",
  "douban_id": null,
  "title": "Ace the Case (2016)",
  "genres": [
    "Family",
    "Mystery"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.0,
  "director": [
    {
      "id": "nm0442194",
      "name": "Kevin Kaufman"
    }
  ],
  "writer": [
    {
      "id": "nm0442194",
      "name": "Kevin Kaufman",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4680144",
      "name": "Ripley Sobo",
      "character": "Olivia Haden"
    },
    {
      "id": "nm1164862",
      "name": "Lev Gorn",
      "character": "The Surgeon"
    },
    {
      "id": "nm0000215",
      "name": "Susan Sarandon",
      "character": "Detective Dottie Wheel"
    },
    {
      "id": "nm0578766",
      "name": "Marc Menchaca",
      "character": "Gunner"
    },
    {
      "id": "nm4068542",
      "name": "Aaron Sauter",
      "character": "Miles Haden"
    },
    {
      "id": "nm1696119",
      "name": "Ivana Kane",
      "character": "Julia Haden"
    },
    {
      "id": "nm5094676",
      "name": "Luca Manganaro",
      "character": "Stefano"
    },
    {
      "id": "nm3594330",
      "name": "Arturo Castro",
      "character": "Juan"
    },
    {
      "id": "nm5943935",
      "name": "Luna Tieu",
      "character": "Mei Wong"
    },
    {
      "id": "nm7170853",
      "name": "Johnny Tran",
      "character": "Shan Wong"
    },
    {
      "id": "nm4765282",
      "name": "Ginna Le Vine",
      "character": "Gena"
    },
    {
      "id": "nm7197662",
      "name": "Thomas Cohen",
      "character": "Detective Regan"
    },
    {
      "id": "nm7205964",
      "name": "Thomas Cohen",
      "character": "Detective Regan"
    },
    {
      "id": "nm5031181",
      "name": "Anthony Wills Jr.",
      "character": "Rob"
    },
    {
      "id": "nm2684348",
      "name": "Amy Chang",
      "character": "Ping"
    },
    {
      "id": "nm3639786",
      "name": "James Kacey",
      "character": "Peter"
    },
    {
      "id": "nm2059593",
      "name": "Christine Kellogg-Darrin",
      "character": "Christina"
    },
    {
      "id": "nm0226912",
      "name": "Scott Dillin",
      "character": "Officer Stratton"
    },
    {
      "id": "nm3309592",
      "name": "Brian Distance",
      "character": "Officer Blunt"
    },
    {
      "id": "nm6909877",
      "name": "Ricky Garcia",
      "character": "Pedro"
    },
    {
      "id": "nm3836667",
      "name": "Shannon Walsh",
      "character": "Lucy       (as Shannon Maree Walsh)"
    },
    {
      "id": "nm6758600",
      "name": "Christopher Dylan White",
      "character": "Drew"
    },
    {
      "id": "nm4274374",
      "name": "Esther Zynn",
      "character": "Jill       (as Esther Zyskind)"
    },
    {
      "id": "nm1200388",
      "name": "Ezra Barnes",
      "character": "Kurt"
    },
    {
      "id": "nm9569340",
      "name": "Harry Halverson",
      "character": "Junior"
    },
    {
      "id": "nm6909974",
      "name": "Angela Chew",
      "character": "Li"
    },
    {
      "id": "nm4039617",
      "name": "Takyrah Jones",
      "character": "Cheryl"
    },
    {
      "id": "nm4095508",
      "name": "Doug Drucker",
      "character": "Doug"
    },
    {
      "id": "nm3390387",
      "name": "Cliff Samara",
      "character": "Neighbor"
    },
    {
      "id": "nm1711408",
      "name": "Clem Cheung",
      "character": "Grandfather"
    },
    {
      "id": "nm6909975",
      "name": "Sophia Fuiamin Karam",
      "character": "Min Min"
    },
    {
      "id": "nm7106961",
      "name": "Mackenzie Dudzik",
      "character": "Bartender"
    },
    {
      "id": "nm1702256",
      "name": "Douglas J. Aguirre",
      "character": "Cop"
    },
    {
      "id": "nm7110309",
      "name": "Korie Lee Blossey",
      "character": "Bouncer"
    },
    {
      "id": "nm3985980",
      "name": "Calvin Ahn",
      "character": "Young Thug       (as E. Calvin Ahn)"
    },
    {
      "id": "nm9569341",
      "name": "Lucita Arriaga",
      "character": "Victim"
    },
    {
      "id": "nm10317673",
      "name": "Chris Simari",
      "character": "Vincent"
    }
  ],
  "overview": "While her mother is away on business, a young girl home alone with her older brother witnesses her neighbor's kidnapping. But no one believes her--not her brother, not the cops. So she takes matters into her own hands putting her life at risk to save her neighbor.",
  "storyline": "When 10-year old Olivia's Mom goes on a business trip for the weekend, she leaves Olivia home alone with her 17-year-old brother Miles in charge. The first night, Olivia falls asleep on the couch, and wakes up, not realizing how late it is. She walks her dog Charlie without Miles knowing, and witnesses a young woman being kidnapped on the empty New York City streets. Olivia runs home and tells Miles, but he doesn't believe her. The next morning, she explains what happened to local cops, and they don't believe her either! Only a cynical female detective named Dottie (played by Academy Award winner Susan Sarandon) listens to Olivia, but she too is skeptical. Undaunted, Olivia bravely launches her own investigation, putting herself into perilous situations. Her can-do spirit ignites one extraordinary adventure after another. Can she outwit the bad guys and convince her brother and Dottie of the truth in time to save the day?",
  "plot": "See also: List of Ace Attorney characters\nPhoenix Wright, a newly-hired defense attorney at the Fey and Co. law firm, agrees to represent his best friend Larry Butz, who has been charged with the murder of his girlfriend, Cindy Stone. With the help of his boss and mentor, Mia Fey, he proves that Frank Sahwit, the prosecution's star witness, is the real murderer. Shortly thereafter, Mia is killed in her office, and her younger sister Maya is arrested after the police find her name on a note left by Mia. Phoenix takes her case, facing off against Miles Edgeworth, an equally-talented prosecutor. Phoenix manages to identify Redd White, a professional blackmailer, as the real killer, only to find himself charged with the killing instead. Representing himself, he exposes White in court and gets justice for Mia. His reputation established, Phoenix takes on another case, this time defending Will Powers, the lead actor in a children's TV show, against accusations that he killed his co-star, Jack Hammer. In a bizarre twist, it is revealed that Dee Vasquez, the show's producer, committed the murder in self-defense after Hammer tried to kill her and frame Powers for her death.\n\nOn Christmas Eve, Edgeworth is arrested for the murder of attorney Robert Hammond. He initially refuses Phoenix's help, but ultimately relents. Manfred Von Karma, Edgeworth's mentor, has himself appointed as a special prosecutor. After Phoenix learns that another man, Yanni Yogi, shot Hammond, he discovers that Von Karma provided him with the gun. Years earlier, Edgeworth's father, Gregory, convinced a judge to penalize Von Karma for misconduct, ruining his spotless record. Unable to deal with such a blemish on his legacy, Von Karma murdered Gregory in cold blood, leaving Edgeworth to believe himself responsible. Phoenix explains that Edgeworth motivated him to become an attorney: When a young Phoenix was accused of stealing money (a crime for which Larry was the true culprit), Edgeworth persuaded his teacher not to punish him. Following his father's murder, however, Edgeworth, motivated by a hatred of criminals, decided to become Von Karma's pupil instead. After Von Karma suffers a breakdown in court and confesses to the cover-up, Edgeworth is set free. Nevertheless, he decides to rethink whether or not he should resume his previous duties. Meanwhile, Maya, who had been acting as Phoenix's assistant, announces that she will be returning to her home village to finish her training as a spirit medium.\n\nIn a fifth and final case, (not present in the original Game Boy Advance release, but added for the DS and subsequent releases) Phoenix, now running Fey's firm as Wright and Co., is hired by teenager Ema Skye to defend her sister Lana, the head of the prosecutor's office, in a case where the body of a detective, Bruce Goodman, was found in the trunk of Edgeworth's car. Together with Ema, Phoenix traces the origins of the murder to an incident two years prior, in which a serial killer allegedly murdered Edgeworth's predecessor while trying to escape custody. Damon Gant, a senior police captain, is tricked into admitting that he framed Ema for the murder in order to manipulate Lana into doing his bidding. Though Lana is cleared of murder charges, she agrees to resign her post in order to face judgement for protecting Gant. With Ema being sent to Europe to continue training as a forensic investigator, Phoenix looks forward to continuing his career defending the innocent.",
  "synopsis": null
}