{
  "imdb_id": "tt4166730",
  "tmdb_id": "396437",
  "douban_id": null,
  "title": "La Comay: Aparente y Alegadamente (2014)",
  "genres": [
    "Documentary"
  ],
  "country": "Puerto Rico",
  "version": [],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm2530139",
      "name": "Andres Ramirez"
    }
  ],
  "writer": [
    {
      "id": "nm1168126",
      "name": "Manolo Travieso",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm3421019",
      "name": "Javier Bellido Cintron",
      "character": "Himself"
    },
    {
      "id": "nm6885158",
      "name": "Liza Lugo",
      "character": "Herelf"
    },
    {
      "id": "nm1168126",
      "name": "Manolo Travieso",
      "character": "Himself"
    }
  ],
  "overview": "The documentary examines two phenomena in the history of Puerto Rican television: the \"Súper Xclusivo\" program, which remained number one in the ratings for 14 years, and the abrupt manner it went off the air, which also represents an unprecedented event on Puerto Rican television.",
  "storyline": "La Comay was a stuffed lifesized puppet which represents a society matron who recounts rumors and gossip that people have told her and comments on social and political news. Kobbo Santarrosa created the show SuperXclusivo for WAPA-TV. He was joined by Cuban actor/comedian Héctor Travieso as host. In recent years, various politicians have been to the show for interviews, or to reach the audience. Governors such as Aníbal Acevedo Vilá, Luis Fortuño and Alejandro García Padilla have made several appearances as both a candidate and a recently sworn-in Governor, and so have several politicians, artists among others. On December 4, 2012 Santrarrosa, through his puppeteering of La Comay, conveyed rumors that the recent murder of a Puerto Rican citizen was related to a sexually promiscuous lifestyle. These comments sparked a backlash on social media, particularly on Twitter and Facebook, and started a movement to boycott the show. The boycott was led by gay activist Pedro Julio Serrano and ...",
  "plot": null,
  "synopsis": null
}