{
  "imdb_id": "tt4195368",
  "tmdb_id": "349498",
  "douban_id": "26259677",
  "title": "Flying Colors (2015)",
  "genres": [
    "Drama"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "117 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.5,
  "director": [
    {
      "id": "nm2391552",
      "name": "Nobuhiro Doi"
    }
  ],
  "writer": [
    {
      "id": "nm0368048",
      "name": "Hiroshi Hashimoto",
      "description": "screenplay"
    },
    {
      "id": "nm6835058",
      "name": "Nobutaka Tsubota",
      "description": "based on the novel by"
    }
  ],
  "cast": [
    {
      "id": "nm4134328",
      "name": "Kasumi Arimura",
      "character": "Sayaka Kudo"
    },
    {
      "id": "nm5157050",
      "name": "Nanami Abe",
      "character": "Sayaka's friend Yui"
    },
    {
      "id": "nm0012886",
      "name": "Morio Agata",
      "character": "Cram-school's president"
    },
    {
      "id": "nm0411682",
      "name": "Atsushi Itô",
      "character": "Tsubota-Sensei"
    },
    {
      "id": "nm1300449",
      "name": "Honami Kurashita",
      "character": "Sayaka's friend Maki"
    },
    {
      "id": "nm5937723",
      "name": "Airi Matsui",
      "character": "Sayaka's friend Mika"
    },
    {
      "id": "nm1600747",
      "name": "Rie Minemura",
      "character": ""
    },
    {
      "id": "nm1933697",
      "name": "Yasuhi Nakamura",
      "character": ""
    },
    {
      "id": "nm3825121",
      "name": "Shûhei Nomura",
      "character": "Reiji"
    },
    {
      "id": "nm5527254",
      "name": "Yûhei Ohuchida",
      "character": "Sayaka's younger brother"
    },
    {
      "id": "nm7344831",
      "name": "Kokoro Okuda",
      "character": "Mayumi Kudo (Sayaka's younger sister)"
    },
    {
      "id": "nm1102301",
      "name": "Tetsushi Tanaka",
      "character": "Toru Kudo"
    },
    {
      "id": "nm0944989",
      "name": "Ken'ichi Yajima",
      "character": ""
    },
    {
      "id": "nm6579369",
      "name": "Mochika Yamada",
      "character": "12 years old Sayaka"
    },
    {
      "id": "nm1904410",
      "name": "Ken Yasuda",
      "character": "Takashi-sensei"
    },
    {
      "id": "nm3846080",
      "name": "Yô Yoshida",
      "character": "Akari Kudo"
    }
  ],
  "overview": "A high school girl, Sayaka Kudō was the bottom of the class. After a year, she improved her deviation value from 30 to 70, then passed Keio University that is considered one of the most difficult to enter in Japan.",
  "storyline": "Sayaka Kudo is a gyaru who wears miniskirts and dyes her hair blonde. Although she is a 2nd year senior high school student, she is on par academically with 4th grade elementary school students. She frequently transfers between school because she is unable to make friends, and was once suspended for being caught with cigarettes. To prepare her for her university entrance examination, her mother decides to send her to Seiho Cram School. However, when the school director, Yoshitaka Tsubota, hears about Sayaka's academic problem, he makes it his personal achievement to help her enter the university of her choice, Keio University, a prestigious university that is considered one of the most difficult to enter in Japan. After her father labels her an \"air-head\", Sayaka became determined to study hard to prove her father wrong. Over the course of the summer holidays of her second year through to the exams at the end of her third year in senior high school, Sayaka studies extremely hard. She ...",
  "plot": "Sayaka Kudo is a gyaru who wears miniskirts and dyes her hair blonde. Although she is a 2nd year senior high school student, she is on par academically with 4th grade elementary school students. She frequently transfers between schools because she is unable to make friends, and was once suspended for being caught with cigarettes. Eventually she attends a private all-girls high school where she plays and enjoys her extra-scholarly activities while skipping study altogether.\n\nTo prepare her for her university entrance examination, her mother decides to send her to Seiho Cram School. However, when the school director, Yoshitaka Tsubota, hears about Sayaka's academic problem, he makes it his personal goal to help her enter the university of her choice, Keio University, a prestigious university that is considered one of the most difficult to enter in Japan and to get back at her father.\n\nAfter her father, whose main goal is to get her brother Ryuta into pro baseball, labels her an \"air-head\" and says she and her mother are being scammed by the cram school only for money, Sayaka becomes determined to study hard to prove her father wrong. Over the course of the summer holidays of her second year through to the exams at the end of her third year in senior high school, Sayaka studies extremely hard and goes without sleep to the extent that she nods off in her high school classes. She even dyes her hair back to black and cuts it to show her resolve. Her results progressively improve on practice tests and her academic deviation value increases tremendously from 30 to 70 in this short span of time.",
  "synopsis": null
}