{
  "imdb_id": "tt4184878",
  "tmdb_id": "311615",
  "douban_id": null,
  "title": "Smosh: The Movie (2015)",
  "genres": [
    "Comedy",
    "Fantasy",
    "Sci-Fi"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.8,
  "director": [
    {
      "id": "nm0935664",
      "name": "Alex Winter"
    }
  ],
  "writer": [
    {
      "id": "nm2342762",
      "name": "Eric Falconer",
      "description": "written by and"
    },
    {
      "id": "nm0549354",
      "name": "Steve Marmel",
      "description": "written by"
    },
    {
      "id": "nm3597252",
      "name": "Ian Hecox",
      "description": "based on the characters created by &"
    },
    {
      "id": "nm3597101",
      "name": "Anthony Padilla",
      "description": "based on the characters created by"
    }
  ],
  "cast": [
    {
      "id": "nm3597101",
      "name": "Anthony Padilla",
      "character": "Anthony"
    },
    {
      "id": "nm3597252",
      "name": "Ian Hecox",
      "character": "Ian"
    },
    {
      "id": "nm2744009",
      "name": "Jillian Nelson",
      "character": "Anna Reed"
    },
    {
      "id": "nm2699047",
      "name": "Brittany Ross",
      "character": "Butt Massage Girl"
    },
    {
      "id": "nm0085438",
      "name": "Michael Ian Black",
      "character": "Steve YouTube"
    },
    {
      "id": "nm0042524",
      "name": "Steve Austin",
      "character": "Steve Austin"
    },
    {
      "id": "nm4615307",
      "name": "Jenna Marbles",
      "character": "Jenna Marbles /              Herself"
    },
    {
      "id": "nm4375857",
      "name": "Harley Morenstein",
      "character": "Mailman"
    },
    {
      "id": "nm4739686",
      "name": "Grace Helbig",
      "character": "Stephanie"
    },
    {
      "id": "nm6290555",
      "name": "Mark Fischbach",
      "character": "Markiplier"
    },
    {
      "id": "nm0106998",
      "name": "Peter Breitmayer",
      "character": "Mr. Ellis"
    },
    {
      "id": "nm1339624",
      "name": "Kristen O'Meara",
      "character": "Bethany"
    },
    {
      "id": "nm0929558",
      "name": "Kevin Will",
      "character": "Phil"
    },
    {
      "id": "nm1260607",
      "name": "Kimmy Gatewood",
      "character": "Diri, Hairstylist       (as Kim Gatewood)"
    },
    {
      "id": "nm5411105",
      "name": "Juliocesar Chavez",
      "character": "Young Kid"
    },
    {
      "id": "nm1364280",
      "name": "Damion Poitier",
      "character": "Super Boring Man"
    },
    {
      "id": "nm2690365",
      "name": "Dominic Sandoval",
      "character": "Nearby Student"
    },
    {
      "id": "nm7503707",
      "name": "Kimoon Kim",
      "character": "PSY Look-Alike"
    },
    {
      "id": "nm7503708",
      "name": "Russell Pitts",
      "character": "Furry Bunny"
    },
    {
      "id": "nm3191813",
      "name": "Eric Acosta",
      "character": "Creepy Guy"
    },
    {
      "id": "nm3114820",
      "name": "Elisha Yaffe",
      "character": "High Driver"
    },
    {
      "id": "nm0484900",
      "name": "Hal Landon Jr.",
      "character": "Butler"
    },
    {
      "id": "nm7503710",
      "name": "Asthon Massey",
      "character": "Kid 1"
    },
    {
      "id": "nm7503711",
      "name": "Alexander Merrit",
      "character": "Kid 2"
    },
    {
      "id": "nm7503712",
      "name": "Jonathan Segura",
      "character": "Kid 3"
    },
    {
      "id": "nm7503713",
      "name": "Ethan Torres",
      "character": "Kid 4"
    },
    {
      "id": "nm3445229",
      "name": "Joshua Ovenshire",
      "character": "Reunion Brawler 1"
    },
    {
      "id": "nm5492352",
      "name": "Matt Sohinki",
      "character": "Reunion Brawler 2"
    },
    {
      "id": "nm3474261",
      "name": "Amra Ricketts",
      "character": "Reunion Brawler 3"
    },
    {
      "id": "nm5493702",
      "name": "David Moss",
      "character": "Reunion Brawler 4"
    },
    {
      "id": "nm4506750",
      "name": "Mari Takahashi",
      "character": "Reunion Brawler 5"
    },
    {
      "id": "nm1568240",
      "name": "G. Grant Jewett",
      "character": "Mr. Todd"
    }
  ],
  "overview": "An embarrassing video of Anthony surfaces online right before his fifth high school reunion. The Smosh dudes then race to pull down the clip before it blows Anthony's chances of reconnecting with his teen crush Anna.",
  "storyline": "Two long life friends, Ian and Anthony, get invited to their 5 year high school reunion. There's a girl who Anthony had a crush on. A video leaks on the school website when he got a mic up his butt singing at his prom. He goes to YouTube to get it removed. The head of YouTube, Steve YouTube, lets them into a portal where they can change the video. With an all star cast Ian Hecox, Anthony Padilla and Michael Ian Black, this is definitely the duo Smosh's best success.",
  "plot": "Anthony (Padilla) and Ian (Hecox) are best friends and live in a small house, with Ian's parents. After going to the Game Bang game center, in which they were bullied by some street kids, due to Anthony's dumb pizza car, they find a video of Anthony reciting the Magic Pocket Slave Monsters theme (an obvious parody of the Pokémon theme song and reference to Smosh's deleted video [their first video]) at their high school graduation. In the video, Anthony attempts to impress his crush, Anna Reed (Nelson), by trying to do a backflip, but he fails, landing on his face, and the microphone lands in his anus. They both decide to pull down the video before it blows Anthony's chances of reconnecting with his crush.\n\nThey travel to the YouTube headquarters, where they meet a receptionist named Stephanie (Helbig) who introduces them to the President of the company, Steve YouTube (Michael Ian Black). Steve explains that the only way to fix the video is by literally going inside YouTube through a portal, and changing the video from the inside. Anthony decides that it is important enough to go through with it, so Ian accompanies him in traveling through YouTube.\n\nSteve provides Smosh with two electronic phones equipped with an artificial intelligence named Diri (a parody of Siri, voiced by Kimmy Gatewood), and then shows them the portal that is behind his closet door, after a wiener joke that the duo see coming. Upon their entrance into YouTube they are taken into an ad, in which Diri skips due to Ian's irritation. After tumbling through a series of YouTube videos, they eventually end up in a Jenna Marbles (herself) vlog. Jenna informs them that once their Diri phones run out of battery, they will be permanently stuck in YouTube, just like her; they find out there are two Jennas.\n\nThey decide to split up, but Ian immediately abandons the mission and travels to his YouTube crush video, \"Butt Massage Girl\" (Brittany Ross), while Anthony escapes a furry party, gets advice from Steve Austin (himself), and finds out that Anna really likes him too. Diri takes Anthony to the Butt Massage Girl video that Ian is getting a massage in. Anthony tells Ian that his and Butt Massage Girl's love is fake and that it's only a video.\n\nThe duo then finally make it to the embarrassing video of Anthony. Anthony figures out that Ian was the one who recorded and uploaded the video. They both engage in a fight that lasts through three YouTube videos, ending with them returning to the start. Ian decides to make it up to Anthony by beating up his past self. Anthony then goes to help him, but past Ian interferes and attacks Anthony, while Ian is trying to knock out past Anthony. In the process, the other students also start to fight one another. During the battle, Diri reveals itself to be Steve YouTube, who tells them that sending the two into YouTube was part of his evil scheme to keep them in YouTube forever.\n\nFrightened, they race to escape YouTube via their video history, but Steve puts up several unsuccessful obstacles on their way, as they make it to the portal only for Steve YouTube to be there waiting for them. But a bear appears and attacks Steve, allowing Smosh to escape YouTube. Returning to the real world, Anthony and Ian discover that, due to their changes to Anthony's embarrassing video, they have become famous, turning the video into the \"Clone Fight\" video; in which they met the President of the United States, created a movie, a TV show, and more. Through this, Ian is dating Butt Massage Girl, Ian's parents live with them, Anthony has several girlfriends (who he immediately gets rid of because he only wants Anna), they live in a much bigger and better house, and Steve \"You-too-bay\" is now a pizza delivery man. Butt Massage Girl accompanies them as they go to their reunion.\n\nAs they arrive to their reunion, they discover they are the most famous ones there. Anthony seeks out Anna and finds her, only to figure out she doesn't like the \"new him\" as she liked his old high school self, to Anthony's shock. He decides that the only way to win her affection is to perform the Magic Pocket Slave Monsters theme he originally performed and failed at their high school dance, again. Anthony attempts the flip, and this time succeeds as Ian joins him in performing the song, with Anthony winning Anna's affection, and they both share a kiss. As Butt Massage Girl meets Anna, she reveals her real name to be Brad, much to Ian's surprise.\n\nIn a post-credits scene, Ian marries Brad with Anthony crying in the background.",
  "synopsis": null
}