{
  "imdb_id": "tt4223366",
  "tmdb_id": "355234",
  "douban_id": null,
  "title": "Parisienne (2015)",
  "genres": [
    "Drama"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "119 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.0,
  "director": [
    {
      "id": "nm0033384",
      "name": "Danielle Arbid"
    }
  ],
  "writer": [
    {
      "id": "nm0033384",
      "name": "Danielle Arbid",
      "description": "dialogue"
    },
    {
      "id": "nm0033384",
      "name": "Danielle Arbid",
      "description": "screenplay"
    },
    {
      "id": "nm1701553",
      "name": "Julie Peyr",
      "description": "collaboration"
    }
  ],
  "cast": [
    {
      "id": "nm6997839",
      "name": "Manal Issa",
      "character": "Lina"
    },
    {
      "id": "nm3228320",
      "name": "Vincent Lacoste",
      "character": "Rafaël"
    },
    {
      "id": "nm5524273",
      "name": "Paul Hamy",
      "character": "Jean-Marc"
    },
    {
      "id": "nm5959033",
      "name": "Damien Chapelle",
      "character": "Julien"
    },
    {
      "id": "nm0086924",
      "name": "Dominique Blanc",
      "character": "Madame Gagnebin"
    },
    {
      "id": "nm2177405",
      "name": "Clara Ponsot",
      "character": "Antonia"
    },
    {
      "id": "nm4280460",
      "name": "India Hair",
      "character": "Victoire"
    },
    {
      "id": "nm3319078",
      "name": "Bastien Bouillon",
      "character": "Arnaud"
    },
    {
      "id": "nm0508888",
      "name": "Alain Libolt",
      "character": "Monsieur Lemernier"
    },
    {
      "id": "nm0958206",
      "name": "Waleed Zuaiter",
      "character": "L'oncle Simon"
    },
    {
      "id": "nm3400818",
      "name": "Mathilde Bisson",
      "character": "Frédérique"
    },
    {
      "id": "nm4765550",
      "name": "Orelsan",
      "character": "L'ami de Julien"
    },
    {
      "id": "nm0530581",
      "name": "Elina Löwensohn",
      "character": "Bogdana - la femme de l'Est"
    },
    {
      "id": "nm0720273",
      "name": "Philippe Résimont",
      "character": "L'avocat"
    },
    {
      "id": "nm6997841",
      "name": "Dima Al Joundi",
      "character": "La mère de Lina"
    },
    {
      "id": "nm0252677",
      "name": "Darina Al Joundi",
      "character": "Mounira - la tante de Lina"
    },
    {
      "id": "nm1885176",
      "name": "Fadi Abi Samra",
      "character": "L'oncle libanais"
    },
    {
      "id": "nm3309177",
      "name": "Lazare Herson-Macarel",
      "character": "Pierre"
    },
    {
      "id": "nm2495268",
      "name": "Pascal Tagnati",
      "character": "L'agresseur skin"
    },
    {
      "id": "nm0797401",
      "name": "Michele Sigal",
      "character": "Madame Berthier"
    },
    {
      "id": "nm6566342",
      "name": "Lily Nambininsoa",
      "character": "Inès"
    },
    {
      "id": "nm4588060",
      "name": "Justine Dhouailly",
      "character": "Nathalie - la militante d'extrême-gauche"
    },
    {
      "id": "nm4683339",
      "name": "Alice Pehlivanyan",
      "character": "La secrétaire de l'université"
    },
    {
      "id": "nm8722455",
      "name": "Vincent Courcelle-Labrousse",
      "character": "Le juge"
    },
    {
      "id": "nm4863413",
      "name": "Marion Ploquin",
      "character": "La voleuse du foyer"
    },
    {
      "id": "nm1934325",
      "name": "Yves Heck",
      "character": "Le second fonctionnaire de la préfecture"
    },
    {
      "id": "nm1708296",
      "name": "Jean-Emmanuel Pagni",
      "character": "Le type au perfecto"
    },
    {
      "id": "nm0895635",
      "name": "Tatiana Vialle",
      "character": "La mère de Rafaël"
    },
    {
      "id": "nm5632727",
      "name": "Henri-Noël Tabary",
      "character": "Le premier policer dans la rue       (as Henri-Noël Tabari)"
    },
    {
      "id": "nm4426690",
      "name": "Jean-Étienne Brat",
      "character": "Le second policier dans la rue"
    },
    {
      "id": "nm4409325",
      "name": "Victor Pontecorvo",
      "character": "L'agresseur skin 2"
    },
    {
      "id": "nm6786420",
      "name": "Anne-Clotilde Rampon",
      "character": "Sophie"
    },
    {
      "id": "nm0408120",
      "name": "Denis Imbert",
      "character": "L'ami de Jean-Marc"
    },
    {
      "id": "nm4631546",
      "name": "Fabien Danesi",
      "character": "Monsieur Gibert -le professeur de macroéconomie       (as Fabien Danési)"
    },
    {
      "id": "nm4151199",
      "name": "Baya Rehaz",
      "character": "La fille qui danse"
    },
    {
      "id": "nm5288171",
      "name": "Sabrina Dina",
      "character": "La jeune toxico du foer"
    },
    {
      "id": "nm1485980",
      "name": "Salima Boutebal",
      "character": "La première fonctionnaire de la préfecture"
    },
    {
      "id": "nm8722456",
      "name": "Caroline Marson",
      "character": "La seconde fonctionnaire de la préfecture"
    },
    {
      "id": "nm8722457",
      "name": "Kevin Kehdi",
      "character": "Le frère de Lina"
    },
    {
      "id": "nm6237137",
      "name": "Leia Hasrouty",
      "character": "L'amie de la plage       (as Leia Hasrouti)"
    },
    {
      "id": "nm8722458",
      "name": "Cédric Gibault",
      "character": "Le patron du restaurant"
    },
    {
      "id": "nm1995359",
      "name": "Nathalie Tocque",
      "character": "La patronne du restaurant"
    },
    {
      "id": "nm3595769",
      "name": "Balla Gagny Diop",
      "character": "L'Africain du restaurant"
    },
    {
      "id": "nm4669406",
      "name": "Marc-Antoine Vaugeois",
      "character": "L'étudiant dans le couloir"
    },
    {
      "id": "nm5631083",
      "name": "Joseph-Marie Ebrard",
      "character": "Le livreur de fleurs       (as Joseph Ebrard)"
    },
    {
      "id": "nm4388792",
      "name": "Camille Fleury",
      "character": "La réceptionniste de l'hôtel"
    },
    {
      "id": "nm8722459",
      "name": "Riyad Rizk",
      "character": "Le père de Lina"
    },
    {
      "id": "nm8468361",
      "name": "Maroun Assaf",
      "character": "L'ami de la famille"
    },
    {
      "id": "nm8722460",
      "name": "Mohammed Atwe",
      "character": "L'enfant sur la plage"
    },
    {
      "id": "nm3780205",
      "name": "Bilal Atwe",
      "character": "L'homme sur la plage"
    },
    {
      "id": "nm0357552",
      "name": "Patrick Hamel",
      "character": "Le chef Lucien"
    },
    {
      "id": "nm8722461",
      "name": "Nadine Caron",
      "character": "La greffière"
    },
    {
      "id": "nm8701041",
      "name": "Thomas Estournel",
      "character": "Thomas - l'étudiant aux diapos"
    },
    {
      "id": "nm8722462",
      "name": "Lou-Teymour Thion",
      "character": "Le fils de Jean-Marc"
    }
  ],
  "overview": "The new film from Lebanese director Danielle Arbid follows a young Arab immigrant in Paris, whose encounters with three men reveal different facets of her new country, and of herself.",
  "storyline": "Lina is a Lebanese Student that just arrived to Paris to continue her studies in a French University in 1993, only to find that the Chaos that was home was no different than what she will witness in the French capital. But Paris will offer her the opportunity to find herself and acquire a new self confidence that she didn't know she had in herself.",
  "plot": "The film presents a week in the life of a Swedish family staying at a luxury resort in the French Alps: a businessman named Tomas, his wife Ebba, their young daughter Vera and preschooler Harry. The family is happy as they ski, ride the ski lift, brush their teeth, sleep, and play with Tomas' new drone toy from the balcony of their ski lodge.\n\nOn their second day of skiing, a controlled avalanche goes awry and threatens them as they are having lunch outdoors on the deck of a restaurant. Tomas, who is filming the avalanche on his phone, panics and runs as the deck quickly empties of patrons, leaving Ebba with their children encased in a dense fog. Silence ensues, and the voice of a waiter says, \"It's over. It's safe now.\" Patrons return to their tables as the fog dissipates. Tomas returns to the table and acts as if nothing happened. No one is hurt, but Ebba and the children are subdued as they eat.\n\nAfter lunch, the cleaning man enters their lodge suite to clean just before they arrive. They insist the kids go inside first so they can talk in the corridor. The kids are upset there is a stranger inside, but the parents are angry with them and don't listen. They enter their lodge suite as the cleaning man exits. The children angrily tell them to leave, as they play a video game.\n\nThat evening they eat dinner with one of Ebba's friends, who has picked up an American man for the evening. Ebba tells the story of the avalanche in English for the benefit of the American, but Tomas insists he did not run away from the table, and in Swedish adds that one cannot run in ski boots. They argue in front of their embarrassed guests. They pick up their kids after the meal and argue again outside the room door. Ebba is angry that he wouldn't admit he ran away from the avalanche abandoning them. He says he remembers it differently.\n\nEbba decides she would like a day of skiing by herself. She has coffee with her friend they had dinner with the night before, as the woman says goodbye to another man. Ebba confronts her friend on her promiscuity, asking her if she loves her husband and children. Her friend says she is fine with having an open relationship with her husband, and that she is happy if he finds a woman to have great sex with, as he is with her. Ebba becomes more insistent, and the friend advises they not argue, and leaves.\n\nLittle Harry is upset as he and his sister and father enter the ski lift. His father wants him to tell him why he is crying. He says he is afraid his parents will divorce.\n\nMats, one of Tomas's old friends, joins them at the resort with his young girlfriend, Fanni. In their lodge suite as they eat pizza, Ebba suggests that Mats and Tomas have a day of skiing together, since she had a day alone. Fanni is upset that she will be left alone for a day without Mats. Ebba is embarrassed. After dinner and lots of wine Ebba recounts the story of the avalanche, to the silent horror of Mats and Fanni. At which point the toy drone comes sailing into the living room and hits Mats, frightening everyone. Tomas carries the drone back out and rebukes Harry for playing with it inside.He curls up with Harry to play a video game, and listens to Mats who insists that we are not ourselves in emergencies, naming the Estonia disaster as an example. Ebba says Tomas won't admit it. Tomas returns and again insists he has a different perspective. So Ebba fetches Tomas's phone and has the four of them watch the video of the incident. Tomas reluctantly agrees \"it does look like someone is running away.\" but is silent when Mats speculates that Tomas was running away so that he could come back and unbury his family later. Tomas cries at the table after Fanni and Mats leave. As they wait for the elevator, Fanni suggests that she would expect Mats to react in the same way as Tomas. Fanni would be attached to her children, and Mats would run. Mats is irritated.\n\nTomas and Mats ride the ski lift in silence. They climb the mountain side on foot and ski down fresh powder. Mats is elated. Tomas is sad. Mats advises him to scream. He says he had two years of therapy which did not help. He needs to scream from his belly. Tomas screams swear words out into the echoing Alps.\n\nTomas exits the suite lodge in his underwear, and waits for Ebba to emerge, she is putting on leggings. He tries to cry in the corridor, but Ebba confronts him as phony. In reality he has no tears. He confesses that he hates himself, his cowardice, his cheating in games with his kids, his unfaithfulness. And he cries. His wife insists he stop crying. He howls, blubbers and yells. His children inside huddle and cry together, hearing their parents argue and howl. Ebba drags Tomas back into their suite where he collapses on a bean bag chair. The children come into the room and Ebba tells them \"Daddy is a little sad, that's all.\" Harry comes to hug his sobbing father. Vera hugs him, but gets up to insist her mother come hug, too. Ebba reluctantly joins the family hug.\n\nOn their final day of skiing, the family enters the elevator with the cleaning man. They ascend in the ski lift silently. Ebba asks if it is safe to ski since the fog is so thick. Tomas says he will go first, then the children, then she can follow. They will stop often. Ebba gets lost in the fog and Tomas briefly leaves the children alone to go rescue her, returning carrying her shortly after. He sets her down, grinning. Ebba stands up and says, \"Okay, is everyone happy now?\" She walks back to get her skis.\n\nAs the family and their friends leave the resort by coach, Ebba decides the driver is dangerously incompetent and demands in a panic to be let off, leaving Tomas and their children on the bus. The passengers all rush for the door. Mats takes charge, insisting that no-one panic, and women and children will get off first. Eventually, all of the passengers get off the bus (except for Ebba's friend with the open marriage) and descend the mountain on foot. Tomas accepts a cigarette from an acquaintance, having first refused it. Surprised, Harry asks Tomas if he smokes, to which he replies, after a pause, \"Yes, I do.\"",
  "synopsis": "Les premiers pas de Lina, 17 ans, seule et étrangère dans le Paris des années 1990.\nTrois rencontres déterminantes lui dévoileront une part delle-même, et de ce pays encore mystérieux. Trois hommes aussi généreux que complémentaires deviennent le miroir de sa transformation"
}