{
  "imdb_id": "tt4298958",
  "tmdb_id": "319373",
  "douban_id": null,
  "title": "Sweet Bean (2015)",
  "genres": [
    "Drama"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "113 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.4,
  "director": [
    {
      "id": "nm0442905",
      "name": "Naomi Kawase"
    }
  ],
  "writer": [
    {
      "id": "nm5734659",
      "name": "Durian Sukegawa",
      "description": "based on the novel by"
    },
    {
      "id": "nm0442905",
      "name": "Naomi Kawase",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0452817",
      "name": "Kirin Kiki",
      "character": "Tokue"
    },
    {
      "id": "nm0619185",
      "name": "Masatoshi Nagase",
      "character": "Sentarô"
    },
    {
      "id": "nm3887352",
      "name": "Kyara Uchida",
      "character": "Wakana"
    },
    {
      "id": "nm0594684",
      "name": "Miki Mizuno",
      "character": ""
    },
    {
      "id": "nm0847602",
      "name": "Miu Takeuchi",
      "character": ""
    },
    {
      "id": "nm7054676",
      "name": "Saki Takahashi",
      "character": ""
    },
    {
      "id": "nm8082722",
      "name": "Yurie Murata",
      "character": ""
    },
    {
      "id": "nm2665929",
      "name": "Taiga",
      "character": "Yôhei"
    },
    {
      "id": "nm3406104",
      "name": "Wakato Kanematsu",
      "character": "Wakato"
    },
    {
      "id": "nm0038273",
      "name": "Miyoko Asada",
      "character": "Shop Owner's Wife"
    },
    {
      "id": "nm0406700",
      "name": "Etsuko Ichihara",
      "character": "Yoshiko"
    }
  ],
  "overview": "Sentaro runs a small bakery that serves dorayaki pastries filled with sweet red bean paste (“an”). When an old lady, Tokue, offers to help in the kitchen he reluctantly accepts. She will soon prove to have magic in her hands…",
  "storyline": "The manager of a pancake stall finds himself confronted with an odd but sympathetic elderly woman looking for work. A taste of her homemade red bean paste convinces him to hire her, which starts a relationship that is about much more than just street food.",
  "plot": "The film centres around Sentaro, a middle-aged man who runs a small dorayaki shop frequented by locals and secondary-school pupils. When he puts up a notice saying that he is looking for a co-worker he is approached by Tokue, a lady in her mid-seventies, who states that she has always wanted to work in a dorayaki shop. Sentaro initially rejects her application, afraid that the work would prove too much for the old lady who, moreover, has somewhat deformed hands. He is swayed, however, when he tries Tokue's bean paste. Its taste and texture are far superior to that of the factory-made bean paste Sentaro has been using. Sentaro asks Tokue to start making bean paste with him, revealing that up till now he did not actually like his own product.\n\nBusiness begins to thrive, and very soon Tokue also starts serving customers and packaging dorayaki. When customers realise that the deformities to Tokue's hand were caused by leprosy they begin staying away, however, and Sentaro is forced to let Tokue go. Wakana, a school girl whom Sentaro has befriended, eventually suggests that they go and visit Tokue at the sanatorium where she and other patients were forced to stay until the 1996 repeal of the 1953 Leprosy Prevention Law. Sentaro feels guilty as he was not able to protect Tokue against the prejudice of their customers, but she assures him that she is grateful for the time she was allowed to spend at the shop.\n\nWhen some months later Tokue dies, she leaves Sentaro her own bean paste making equipment, as well as a cassette recording intended for him and Wakana. In it, Tokue stresses that a person's worth lies not in their career, but, simply, in their being, and that joy comes from taking in the sensory experiences of the world that surrounds us.\n\nThrough most of the film, Sentaro had been a man weighed down by his past. As Sentaro reveals in a letter he sends to Tokue when she no longer works for the shop, he once seriously injured a man in a pub brawl, something of which he is still ashamed. He was subsequently imprisoned and had to pay a large reparation payment to the victim. Physically, Sentaro is tied to the dorayaki shop, which is owned by the loan shark that furnished the money for the reparation payment; money which Sentaro has not yet been able to pay back. Yet at the end of the film Sentaro is seen selling dorayaki from his own stall in the local park, clearly more at ease with his existence.",
  "synopsis": null
}