{
  "imdb_id": "tt4209802",
  "tmdb_id": "300685",
  "douban_id": null,
  "title": "Jeff Dunham: All Over the Map (2014)",
  "genres": [
    "Comedy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "83 min",
      "description": ""
    },
    {
      "runtime": "60 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm4583597",
      "name": "Rob Dipple"
    },
    {
      "id": "nm6922413",
      "name": "Robb Dipple"
    }
  ],
  "writer": [
    {
      "id": "nm0242278",
      "name": "Jeff Dunham",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0242278",
      "name": "Jeff Dunham",
      "character": "Himself /              Walter /              Bubba J /              Achmed /              Peanut /              Jacques"
    },
    {
      "id": "nm0745274",
      "name": "Jeff Rothpan",
      "character": "Himself"
    }
  ],
  "overview": "Jeff Dunham and his iconic creations, Achmed the Dead Terrorist, Walter, Peanut, and Bubba J. have embarked on an unprecedented world tour that has Dunham touching five continents, logging almost 100,000 miles and starring in arenas where few American comedians have dared to perform. Tell the wrong joke in Singapore or United Arab Emirates and risk being handcuffed before you ever leave the stage. Bring Achmed the Dead Terrorist on stage in Malaysia after a government warning forbidding his presence, and you may begin an indefinite vacation in Kuala Lumpur. While Dunham collects and crafts pop culture references that can excite a local audience upon entering each country - Achmed on this trepidation of returning to the Middle East, Walter's (lack of) understanding of current race relations in South Africa, Bubba J. finding kindred spirits in Australia - Jeff shows that humor is truly universal. Most of the time.",
  "storyline": "In this documentary/stand-up special, Jeff takes his friends in the suitcase all around the world, performing in places such as Iceland, Norway, Abu Dhabi, United Arab Emirates, London, and Israel.",
  "plot": null,
  "synopsis": null
}