{
  "imdb_id": "tt4243112",
  "tmdb_id": "359461",
  "douban_id": null,
  "title": "Gazelle: The Love Issue (2014)",
  "genres": [
    "Documentary",
    "Biography",
    "Drama"
  ],
  "country": "Brazil",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm6948654",
      "name": "Cesar Terranova"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm6960425",
      "name": "Gazelle Paulo",
      "character": "Himself"
    },
    {
      "id": "nm1242709",
      "name": "Kenny Kenny",
      "character": "Himself"
    },
    {
      "id": "nm5055370",
      "name": "Paul Alexander",
      "character": "Himself"
    },
    {
      "id": "nm6960426",
      "name": "Scooter LaForge",
      "character": "Himself"
    },
    {
      "id": "nm0233998",
      "name": "Jack Doroshow",
      "character": "Himself"
    },
    {
      "id": "nm7086206",
      "name": "Mark A.",
      "character": "Himself"
    },
    {
      "id": "nm3873681",
      "name": "Olan Montgomery",
      "character": "Himself"
    },
    {
      "id": "nm3847323",
      "name": "Patrick McDonald",
      "character": "Himself"
    },
    {
      "id": "nm6621624",
      "name": "Fernando Carpaneda",
      "character": "Himself"
    },
    {
      "id": "nm6960428",
      "name": "Johnny Luxo",
      "character": "Himself"
    },
    {
      "id": "nm3407575",
      "name": "Chi Chi Valenti",
      "character": "Herself"
    },
    {
      "id": "nm6960429",
      "name": "Brian Christopher Cummings",
      "character": "Himself"
    },
    {
      "id": "nm0616003",
      "name": "Michael Musto",
      "character": "Himself"
    },
    {
      "id": "nm6960430",
      "name": "Ellen Christine",
      "character": "Herself"
    },
    {
      "id": "nm6960431",
      "name": "Alexandre Mury",
      "character": "Himself"
    },
    {
      "id": "nm6960432",
      "name": "Robert Chavez",
      "character": "Himself - MD"
    },
    {
      "id": "nm6960433",
      "name": "Lorna Washington",
      "character": "Herself"
    },
    {
      "id": "nm5759429",
      "name": "Marcelona",
      "character": "Himself"
    },
    {
      "id": "nm3428660",
      "name": "Autumn Stein",
      "character": "Herself"
    },
    {
      "id": "nm4198808",
      "name": "Gerrold Vincent",
      "character": "Himself"
    }
  ],
  "overview": "Paulo is a 45-year-old Brazilian flight attendant. He is internationally famous in the after-hours world for the fabulous persona he has worked tirelessly to create, his artistic alter-ego, Gazelle. Paulo is HIV+ but never got sick before and now he sees his own life is in danger for the first time. With the sudden and tragic sad death of Eric, his partner of seven years, Paulo must pass through a life transformation. Looking to survive, he embarks on a conscious transformation, beginning with filtering what matters in his life. On his path, besides the new lover, he finds collaborators that push him forward in life and show more meanings for the word Love.",
  "storyline": "Paulo is a 45-year-old Brazilian flight attendant. He is internationally famous in the after-hours world for the fabulous persona he has worked tirelessly to create, his artistic alter-ego, Gazelle. Paulo is HIV+ but never got sick before and now he sees his own life is in danger for the first time. With the sudden and tragic sad death of Eric, his partner of seven years, Paulo must pass through a life transformation. Looking to survive, he embarks on a conscious transformation, beginning with filtering what matters in his life. On his path, besides the new lover, he finds collaborators that push him forward in life and show more meanings for the word Love.",
  "plot": null,
  "synopsis": "Paulo is a 45-year-old Brazilian flight attendant. He is internationally famous in the after-hours world for the fabulous persona he has worked tirelessly to create, his artistic alter-ego, Gazelle. Appearing in clubs around the world in boldly conceived but carefully created costumes, Gazelle is a human sculpture, a magical ever-changing creature of the night. But being Gazelle isnt easy.Gazelle became especially well known when he created the underground publication GAZELLAND, a beautifully designed magazine, a documentation of, and homage to, the artists, photographers, performers, and designers of a particular gay and trans nightlife community of London, New York and Sao Paulo. With the magazine, Gazelle more than anyone is able to capture the transitory delights and astonishing creativity, of an international but still underground scene. Gazelle upgraded the term \"Club Kids\" to \"Freak Chics\" when referring to these creatures of the night due to the fashion evolution of their ensembles, which no longer carried just a costume concept.\nWith the sudden and tragic sad death of Eric, his partner of seven years, Paulo must pass through a life transformation.Paulo is HIV+ but never got sick before and now he sees his own life is in danger for the first time. Looking to survive, he embarks on a conscious transformation, beginning with filtering what matters in his life. After his first grief, we see that Gazelle becomes a even stronger presence in his life as he begins to use his alter ego to express his deepest feelings and dreams.The film will bring us into Paulos search for a meaningful way to deepen Gazelles life. Paulo digs into his emotional depths and transforms them into artistic expression that plays with the Past and Present through symbolic use of references, from personal experiences and artistic iconography.On his path, besides the new lover, he finds collaborators that push him forward in life, show more meanings for the word Love and brings Gazelles work to his highest level."
}