{
  "imdb_id": "tt4262980",
  "tmdb_id": "315011",
  "douban_id": null,
  "title": "Shin Godzilla (2016)",
  "genres": [
    "Action",
    "Adventure",
    "Drama",
    "Horror",
    "Sci-Fi"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "120 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm0030417",
      "name": "Hideaki Anno"
    },
    {
      "id": "nm0383688",
      "name": "Shinji Higuchi"
    }
  ],
  "writer": [
    {
      "id": "nm0030417",
      "name": "Hideaki Anno",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm4056296",
      "name": "Hiroki Hasegawa",
      "character": "Rando Yaguchi"
    },
    {
      "id": "nm0847570",
      "name": "Yutaka Takenouchi",
      "character": "Hideki Akasaka"
    },
    {
      "id": "nm1595000",
      "name": "Satomi Ishihara",
      "character": "Kayoko Ann Patterson"
    },
    {
      "id": "nm0652592",
      "name": "Ren Osugi",
      "character": "Prime Minister Seiji Okochi       (as Ren Ôsugi)"
    },
    {
      "id": "nm0256628",
      "name": "Akira Emoto",
      "character": "Ryuta Azuma"
    },
    {
      "id": "nm2246282",
      "name": "Kengo Kôra",
      "character": "Yusuke Shimura, Deputy Chief Cabinet Secretary"
    },
    {
      "id": "nm0406732",
      "name": "Mikako Ichikawa",
      "character": "Hiromi Ogashira, Deputy Director of Nature Conservation Bureau"
    },
    {
      "id": "nm0475165",
      "name": "Jun Kunimura",
      "character": "Masao Zaizen, Integrated Chief of Staff"
    },
    {
      "id": "nm0847651",
      "name": "Pierre Taki",
      "character": "Saigo, Combat Leader"
    },
    {
      "id": "nm0793562",
      "name": "Kyûsaku Shimada",
      "character": "Katayama, Minister of Foreign Affairs"
    },
    {
      "id": "nm0594073",
      "name": "Ken Mitsuishi",
      "character": "Kozuka, Governor of Tokyo"
    },
    {
      "id": "nm0875457",
      "name": "Shingo Tsurumi",
      "character": "Yajima, Joint Staff Deputy"
    },
    {
      "id": "nm0948263",
      "name": "Kimiko Yo",
      "character": "Reiko Hanamori, Defense Minister"
    },
    {
      "id": "nm1102191",
      "name": "Takumi Saitoh",
      "character": "Ikeda, Tank Captain       (as Takumi Saitô)"
    },
    {
      "id": "nm1148757",
      "name": "Takashi Fujiki",
      "character": "Tokyo Lieutenant Governor"
    },
    {
      "id": "nm2867723",
      "name": "Yû Kamio",
      "character": "Ministry of Foreign Affairs"
    },
    {
      "id": "nm0559618",
      "name": "Suzuki Matsuo",
      "character": "Journalist"
    },
    {
      "id": "nm3627424",
      "name": "Takahiro Miura",
      "character": "Journalist"
    },
    {
      "id": "nm4962261",
      "name": "Bob Werley",
      "character": "Embassy Staff"
    },
    {
      "id": "nm3194537",
      "name": "Mark Chinnery",
      "character": "Newscaster"
    },
    {
      "id": "nm1880510",
      "name": "Atsuko Maeda",
      "character": "Refugee"
    },
    {
      "id": "nm0605290",
      "name": "Ren Mori",
      "character": "Refugee"
    },
    {
      "id": "nm0361672",
      "name": "Kazuo Hara",
      "character": "Biologist"
    },
    {
      "id": "nm0875354",
      "name": "Shin'ya Tsukamoto",
      "character": "Biologist"
    },
    {
      "id": "nm0644517",
      "name": "Akira Ogata",
      "character": "Marine Biologist"
    },
    {
      "id": "nm0357249",
      "name": "Akira Hamada",
      "character": "Minister"
    },
    {
      "id": "nm7777136",
      "name": "Alex Hormigo",
      "character": "American Military"
    },
    {
      "id": "nm4071896",
      "name": "Shôhei Abe",
      "character": ""
    },
    {
      "id": "nm1372573",
      "name": "Makoto Awane",
      "character": ""
    },
    {
      "id": "nm8071139",
      "name": "Christiane Brew",
      "character": "Researcher"
    },
    {
      "id": "nm0299210",
      "name": "Arata Furuta",
      "character": "National Police Agency Commissioner General"
    },
    {
      "id": "nm0323102",
      "name": "Charles Glover",
      "character": "Ambassador Lansing"
    },
    {
      "id": "nm8788150",
      "name": "Toyotaka Hanazawa",
      "character": ""
    },
    {
      "id": "nm0361660",
      "name": "Chisako Hara",
      "character": ""
    },
    {
      "id": "nm1408555",
      "name": "Jun Hashimoto",
      "character": "Official of Japan Self-Defense Forces"
    },
    {
      "id": "nm0386217",
      "name": "Sei Hiraizumi",
      "character": "Minister of Agriculture, Forestry and Fisheries"
    },
    {
      "id": "nm0409459",
      "name": "Isshin Inudô",
      "character": "Ancient Organism Scholar"
    },
    {
      "id": "nm7297900",
      "name": "Mafia Kajita",
      "character": ""
    },
    {
      "id": "nm0441098",
      "name": "Hairi Katagiri",
      "character": "Official Residence Employee"
    },
    {
      "id": "nm3513195",
      "name": "Kosei Kato",
      "character": "National Police Agency Personnel       (as Kôsei Katô)"
    },
    {
      "id": "nm2156656",
      "name": "Takashi Kobayashi",
      "character": "Official of Japan Self-Defense Forces"
    },
    {
      "id": "nm1845421",
      "name": "Keisuke Koide",
      "character": "Fire Brigade Chief"
    },
    {
      "id": "nm1866117",
      "name": "Kreva",
      "character": "Official of Japan Self-Defense Forces"
    },
    {
      "id": "nm3300305",
      "name": "Daisuke Kuroda",
      "character": "Nuclear Regulation Authority"
    },
    {
      "id": "nm8956736",
      "name": "Kô Maehara",
      "character": ""
    },
    {
      "id": "nm2865407",
      "name": "Satoru Matsuo",
      "character": ""
    },
    {
      "id": "nm0606085",
      "name": "Moro Morooka",
      "character": "Criminal Investigation Bureau director of National Police Agency"
    },
    {
      "id": "nm2750611",
      "name": "Inge Murata",
      "character": "German Scientist"
    },
    {
      "id": "nm5460030",
      "name": "Markus Müller",
      "character": "German Scientist       (as Markus M)"
    },
    {
      "id": "nm0620142",
      "name": "Ikuji Nakamura",
      "character": "Minister of State for Special Missions"
    },
    {
      "id": "nm2867865",
      "name": "Tôru Nomaguchi",
      "character": "Bureaucrat of Ministry of Economy, Trade and Industry"
    },
    {
      "id": "nm1334850",
      "name": "Mansai Nomura",
      "character": "Godzilla"
    },
    {
      "id": "nm0644561",
      "name": "Mayumi Ogawa",
      "character": ""
    },
    {
      "id": "nm5404902",
      "name": "Shô Oyamada",
      "character": "Akihisa Yanagi"
    },
    {
      "id": "nm5690562",
      "name": "Kôji Seki",
      "character": "(as Kouji Seki)"
    },
    {
      "id": "nm1177230",
      "name": "Seikô Senô",
      "character": ""
    },
    {
      "id": "nm0840486",
      "name": "Tarô Suwa",
      "character": "Chief of Disaster Prevention Division"
    },
    {
      "id": "nm1534063",
      "name": "Issey Takahashi",
      "character": "Bureaucrat of The Ministry of Education, Culture, Sports, Science and Technology       (as Issei Takahashi)"
    },
    {
      "id": "nm4585194",
      "name": "Shota Taniguchi",
      "character": "Taiji Sodehara"
    },
    {
      "id": "nm0856808",
      "name": "Tôru Tezuka",
      "character": "Minister of Education, Culture, Sports, Science and Technology"
    },
    {
      "id": "nm0875244",
      "name": "Kanji Tsuda",
      "character": "Bureaucrat of Ministry of Health, Labour, and Welfare"
    },
    {
      "id": "nm0913880",
      "name": "Tetsu Watanabe",
      "character": "Deputy Chief Cabinet Secretary for Crisis Management"
    },
    {
      "id": "nm0944989",
      "name": "Ken'ichi Yajima",
      "character": "Minister of Land, Infrastructure, Transport and Tourism"
    },
    {
      "id": "nm0959973",
      "name": "Takeshi Ôbayashi",
      "character": ""
    },
    {
      "id": "nm4571394",
      "name": "Ippei Ôsako",
      "character": "Yuminari"
    }
  ],
  "overview": "Japan is plunged into chaos upon the appearance of a giant monster.",
  "storyline": "An unknown accident occurs in Tokyo Bay's Aqua Line, which causes an emergency cabinet to assemble. All of the sudden, a giant creature immediately appears, destroying town after town with its landing reaching the capital. This mysterious giant monster is named \"Godzilla\".",
  "plot": "As the Japanese coast guard investigates an abandoned yacht in Tokyo Bay soon the water erupts with a strange red liquid. Soon afterward, the Tokyo Bay Aqua-Line is mysteriously flooded and collapses. After seeing a viral video showing a large entity moving in the area, Japan's Deputy Chief Cabinet Secretary Rando Yaguchi is certain that the incident was caused by a large marine creature swimming in the bay. His theory is initially dismissed but later confirmed when news reports show a massive tail coming out of the ocean. Later, a massive aquatic creature appears and moves inland via rivers. The Japanese Prime Minister assures the public that the creature is unable to come onto land due to its weight, only to be informed that the creature has made landfall. The creature moves through the city, leaving a massive wake of destruction and civilian casualties, before evolving into a significantly larger, red-skinned creature that can stand upright on its hind legs. The creature then returns to the ocean.\n\nThe top government officials focus on military strategy and civilian safety, while Yaguchi placed in charge of a small task force to research the creature. Due to high radiation readings, the creature is theorized to take its energy through nuclear fission. The U.S. sends a special envoy, Kayoko Ann Patterson, who reveals that a disgraced, vehemently anti-nuclear zoology professor, Goro Maki, had been studying mutations due to radioactive contamination and theorized the appearance of the creature but the U.S. covered it up. According to the notes, Maki had named one of the creatures he discovered \"Gojira\", meaning \"incarnation of God.\" The yacht abandoned in Tokyo Bay had belonged to Maki, and he had left his investigative notes, encrypted into a mysterious code to prevent its use, there before disappearing.\n\nThe creature, now named \"Godzilla\" after Maki's research, reappears, now twice his previous size, and makes landfall near Kamakura en route for Tokyo. The Japanese Self Defense Forces respond, but their tank, air and artillery strikes have no effect on Godzilla, and they suffer significant casualties, while Godzilla enters Tokyo. The Japanese government, in desperation, appeal for and receive American support. U.S. Air Force B-2 stealth bombers attack Godzilla and successfully wound him with Massive Ordnance Penetrator bunker-buster bombs, but this inadvertently forces Godzilla to respond with highly destructive atomic rays fired from his mouth and dorsal fins. The battle destroys large swathes of Tokyo, all of the stealth bombers, and kills most of the top government leaders, including the Prime Minister. After depleting his energy, Godzilla enters a dormant state and becomes immobile.\n\nYaguchi's team discovers that Godzilla's dorsal plates and blood work as a cooling system, and theorize that through the use of a coagulating agent, they could trigger a reactor scram and cause Godzilla to freeze over entirely to stay alive. Furthermore, after analyzing tissue samples, they find that Godzilla could survive as long as air and water are available and that the monster is able to reproduce asexually. The U.N., unaware of this crucial development, informs Japan that the use of thermonuclear weapons against Godzilla is inevitable, and gives it a short deadline when, should the Japanese be unable to put down Godzilla on their own, an American-led multinational task force will be authorized to use nuclear weapons against the monster. Unwilling to see nuclear weapons detonated in Japan for a third time, Patterson decides to use her political connections to buy Yaguchi's team as much time as possible to finish the plan, even if it puts her career at stake. Her efforts are rewarded when she is able to convince France to have the U.N. extend the deadline. In the meantime, Yaguchi's team is finally able to decode Maki's research, which contains comprehensive data on Godzilla that can be used to increase the coagulant's potency and give it a better chance of success.\n\nAgainst international pressure and the lack of faith from the interim government, the team manages to procure enough coagulant and enacts their plan, named Operation Yashiori, after a mythical drink. They awaken Godzilla using explosives-laden trains and hundreds of American drone aircraft, provoking him into using his atomic breath until his energy stores are once again depleted. The team then detonates explosives in the nearby buildings, knocking Godzilla down onto the train station and giving the first platoon of modified tankers full of coagulant an opportunity to inject into Godzilla's mouth. However, the monster unexpectedly recovers and uses his beam, annihilating the unit. More of the explosive trains hit Godzilla and detonate, knocking Godzilla down once more and giving them another chance to inject the coagulant. After emptying the coagulant stores, Godzilla awakens again and prepares to unleash his beam, but suddenly freezes completely.\n\nIn the aftermath, as recovery and rebuilding efforts begin, the international community agrees to call off the nuclear strike but have the new Japanese government agree that, in the event of Godzilla's reawakening, a thermonuclear bomb will be launched at him, forcing the Japanese people to have to co-exist with the beast. Meanwhile, dozens of frozen humanoid skeletons resembling Godzilla are seen splitting off from the tip of his tail.",
  "synopsis": null
}