{
  "imdb_id": "tt4248930",
  "tmdb_id": "327911",
  "douban_id": null,
  "title": "Flowers (2015)",
  "genres": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "79 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.0,
  "director": [
    {
      "id": "nm6953494",
      "name": "Phil Stevens"
    }
  ],
  "writer": [
    {
      "id": "nm6953494",
      "name": "Phil Stevens",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm6953495",
      "name": "Colette Kenny Mckenna",
      "character": "Flower #1"
    },
    {
      "id": "nm6953496",
      "name": "Krystle Fitch",
      "character": "Flower #2"
    },
    {
      "id": "nm7011703",
      "name": "Anastasia Blue",
      "character": "Flower #3"
    },
    {
      "id": "nm5225064",
      "name": "Tanya Erin Paoli",
      "character": "Flower #4"
    },
    {
      "id": "nm6953497",
      "name": "Kara A. Christiansen",
      "character": "Flower #5"
    },
    {
      "id": "nm5555173",
      "name": "Makaria Tsapatoris",
      "character": "Flower #6"
    },
    {
      "id": "nm6953498",
      "name": "Bryant W. Lohr Sr.",
      "character": "The Exile"
    },
    {
      "id": "nm6843269",
      "name": "Raychelle Keeling",
      "character": "Victim"
    }
  ],
  "overview": "An abstract, surreal horror film centering on six dead women waking up in the crawl space below their killer's house.",
  "storyline": "An abstract, surreal horror film centering around six dead women waking up in the crawl space below their killer's house only to discover that they are trapped in their own limbo and purgatory. The house itself contains many rooms revealing hints and clues to their past lives and how they've come to end up where they are. One by one and alone, each girl is forced to accept their fate or remain in place, between the walls of a rotting house. A movie that tells it's story in silence. Without any spoken dialog and surrounded in a cryptic and dark visual atmosphere, FLOWERS is a film that builds on the journey and not the destination.",
  "plot": "Clea DuVall stars as Cally, a 17-year-old who has been raised by her father, not knowing her mother. When Cally meets a mysterious woman called Sabine, she becomes obsessed with her.",
  "synopsis": "Abstract and surreal, FLOWERS is a return to the dark art-house horror film. A movie that tells it's story in silence. Without any spoken dialog and surrounded in a cryptic and dark visual atmosphere, FLOWERS is a film that builds on the journey and not the destination. Six dead women wake up in the crawl space below their killer's house only to discover that they are trapped in their own limbo and purgatory. The house itself contains many rooms revealing hints and clues to their past lives and how they've come to end up where they are. One by one and alone, each girl is forced to accept their fate or remain in place, between the walls of a rotting house."
}