{
  "imdb_id": "tt4289100",
  "tmdb_id": "333111",
  "douban_id": null,
  "title": "This Is Drag (2015)",
  "genres": [
    "Documentary"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "60 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.6,
  "director": [
    {
      "id": "nm1615948",
      "name": "Mark Kenneth Woods"
    }
  ],
  "writer": [
    {
      "id": "nm1615948",
      "name": "Mark Kenneth Woods",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1004435",
      "name": "Roy Haylock",
      "character": "Himself       (as Bianca Del Rio)"
    },
    {
      "id": "nm2924001",
      "name": "Danny Noriega",
      "character": "Himself       (as Adore Delano)"
    },
    {
      "id": "nm1468208",
      "name": "Shane Jenek",
      "character": "Himself       (as Courtney Act)"
    },
    {
      "id": "nm6215524",
      "name": "Greg Meyer",
      "character": "Himself       (as Darienne Lake)"
    },
    {
      "id": "nm3932141",
      "name": "Alyssa Edwards",
      "character": "Himself"
    },
    {
      "id": "nm3842784",
      "name": "D.J. 'Shangela' Pierce",
      "character": "Himself       (as Shangela)"
    },
    {
      "id": "nm1615948",
      "name": "Mark Kenneth Woods",
      "character": "Himself"
    }
  ],
  "overview": "An intimate, behind-the-scenes look at performance, glamor, fame, family, love and sacrifice as some of the world's most renowned drag queens come together for World Pride in Toronto.",
  "storyline": "An intimate, behind-the-scenes look at performance, glamor, fame, family, love and sacrifice as some of the world's most renowned drag queens come together for World Pride in Toronto.",
  "plot": "The drama is a coming-of-age genre film, and centers on fictional Danny Winters, a gay white teenage boy from Indiana, who flees the conservative countryside in the late 1960s and moves to New York City. Shortly before leaving, he is discovered by friends while making love with his boyfriend. His father is upset, and while his mother is ambivalent as she feels for her son, she does not stand up to her husband either. His father then refuses to sign the scholarship application for Columbia University where Danny is supposed to attend.\n\nDanny leaves for New York anyway, leaving behind his supportive younger sister Phoebe. After reaching Christopher Street in Greenwich Village, he is befriended by a multiracial group of young, gay, and genderfluid street kids and drag queens, and witnesses police violence against them. Danny goes into the Stonewall Inn accompanied by his friends, including Ray, and is asked for a dance by an older man Trevor, who is a member of the Mattachine Society. Later that night, the police raids the bar and arrests some customers. Danny, who did not get arrested because he was not cross-dressing, picks up Ray at the police station next day. Danny, destitute, then turns to prostitution and is seen disgraced while being fellated by a middle-aged man. Danny then goes to a meeting of the Mattachine Society, which purports to attain gay rights through conforming to society rather than radicalism. There he finds Trevor, and though they differ in opinion, they end up spending the night together.\n\nDanny soon finds Trevor with another young man, and, heartbroken, he decides to leave the Village. But immediately after, he is abducted and forcibly sent out to a high-class prostitution business, at the direction of Ed Murphy, who runs the Stonewall Inn. Murphy has colluded with corrupt policemen and exploited homeless gay youth to his own advantage. Danny escapes with the help of Ray and the two go to the bar to confront Murphy. Then the police raids the bar and arrests some customers again. Danny is thrown onto the street as well as the rest of the customers, and, despite Trevor's dissuasion, hurls a brick into one of the bar's windows, screaming \"Gay power!\" This instigates the crowd to attack the policemen, who lock themselves up in the bar in response.\n\nOne year later, after finishing the first year at the university, Danny returns to home and tells his sister that he is going to attend the gay liberation march on Christopher Street. The film ends on the day of the parade where he is marching in the street after reuniting with his friends and discovers his mother and sister on the sidewalk.",
  "synopsis": null
}