{
  "imdb_id": "tt4288636",
  "tmdb_id": "312804",
  "douban_id": null,
  "title": "James White (2015)",
  "genres": [
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm1317614",
      "name": "Josh Mond"
    }
  ],
  "writer": [
    {
      "id": "nm1317614",
      "name": "Josh Mond",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm3571592",
      "name": "Christopher Abbott",
      "character": "James White"
    },
    {
      "id": "nm0633223",
      "name": "Cynthia Nixon",
      "character": "Gail White"
    },
    {
      "id": "nm3264596",
      "name": "Kid Cudi",
      "character": "Nick       (as Scott Mescudi)"
    },
    {
      "id": "nm4689170",
      "name": "Makenzie Leigh",
      "character": "Jayne"
    },
    {
      "id": "nm0169753",
      "name": "Scott Cohen",
      "character": "Barry White"
    },
    {
      "id": "nm1964247",
      "name": "David Call",
      "character": "Elliot"
    },
    {
      "id": "nm0515296",
      "name": "Ron Livingston",
      "character": "Ben"
    },
    {
      "id": "nm8624882",
      "name": "Laura Johnston",
      "character": "Genie"
    },
    {
      "id": "nm4521141",
      "name": "Jeanette Dilone",
      "character": "Irene (Spanish Girl)"
    },
    {
      "id": "nm3024380",
      "name": "Bhavesh Patel",
      "character": "Dr. Lobo"
    },
    {
      "id": "nm8624883",
      "name": "Linda Powell",
      "character": "Nurse"
    },
    {
      "id": "nm8624884",
      "name": "Jessica Wong",
      "character": "Jesse"
    },
    {
      "id": "nm1682390",
      "name": "Sue Jean Kim",
      "character": "Karen"
    },
    {
      "id": "nm2428854",
      "name": "Hubert Point-Du Jour",
      "character": "EMT #1"
    },
    {
      "id": "nm8624885",
      "name": "Bradley Fleischer",
      "character": "EMT #2"
    },
    {
      "id": "nm5939164",
      "name": "Zazie Beetz",
      "character": "Girl #1"
    },
    {
      "id": "nm5035600",
      "name": "Jasmin Gabrielle",
      "character": "Girl #2"
    },
    {
      "id": "nm3594372",
      "name": "Adriana DeGirolami",
      "character": "Waitress"
    },
    {
      "id": "nm3158498",
      "name": "Khalil Muhammad",
      "character": "Club Guy"
    },
    {
      "id": "nm3014031",
      "name": "Rachel Brosnahan",
      "character": "Woman (Ellen)"
    },
    {
      "id": "nm0213446",
      "name": "David Deblinger",
      "character": "Man #1"
    },
    {
      "id": "nm0364593",
      "name": "David Harris",
      "character": "Joe"
    },
    {
      "id": "nm0014483",
      "name": "Betsy Aidem",
      "character": "Woman #2"
    },
    {
      "id": "nm2727142",
      "name": "Patrick Murney",
      "character": "Bartender"
    },
    {
      "id": "nm0129812",
      "name": "David Cale",
      "character": "Grief Counselor"
    },
    {
      "id": "nm1760272",
      "name": "Margarita Levieva",
      "character": "Secretary"
    },
    {
      "id": "nm5082412",
      "name": "Benjamin Bass",
      "character": "Leland"
    },
    {
      "id": "nm2674188",
      "name": "Rosemary Howard",
      "character": "Second Nurse"
    },
    {
      "id": "nm0867704",
      "name": "Richard Topol",
      "character": "Pharmacist       (as Rich Topol)"
    },
    {
      "id": "nm0520265",
      "name": "Rodrigo Lopresti",
      "character": "Bar Patron #2"
    },
    {
      "id": "nm8624886",
      "name": "Carlos Gonzalez",
      "character": "Down Low Guy"
    },
    {
      "id": "nm1422146",
      "name": "Patrick M. Walsh",
      "character": "Bar Patron #1       (as Patrick M. Walsh. Jr.)"
    }
  ],
  "overview": "James White (Christopher Abbott) is a troubled twentysomething trying to stay afloat in a frenzied New York City. As he retreats further into a hedonistic lifestyle, his mother's battle with a serious illness faces a series of setbacks that force him to assume more responsibility. With the pressure on him mounting, James must find new reserves of strength or risk imploding completely.",
  "storyline": "James White (Christopher Abbott) is a troubled twenty-something trying to stay afloat in a frenzied New York City. He retreats further into a self-destructive, hedonistic lifestyle, but as his mother (Cynthia Nixon) battles a serious illness James is forced to take control of his life. As the pressure on him mounts, James must find new reserves of strength or risk imploding completely.",
  "plot": "Following Gareth Mallory's promotion to M, James Bond takes leave from MI6. Receiving a posthumous message from the previous M, Bond carries out an unauthorised mission in Mexico City, killing three men plotting a terrorist bombing on a stadium during Day of the Dead celebrations, before giving chase to their leader, Marco Sciarra. In the ensuing struggle, Bond steals Sciarra's ring, which is emblazoned with a stylised octopus, and kills him. Upon returning to London, Bond is indefinitely suspended from field duty by M. Parallel to this, M is in the midst of a power struggle with Max Denbigh (whom Bond dubs \"C\"), the head of a privately backed agency, the Joint Intelligence Service. C campaigns for Britain to form \"Nine Eyes\", a global surveillance and intelligence co-operation initiative and uses his influence to close down the '00' section as he believes it to be outdated.\n\nBond disobeys M's order and travels to Rome to attend Sciarra's funeral. That evening he seduces Sciarra's widow Lucia, who tells him about Spectre, an organisation of businessmen with criminal and terrorist connections to which her husband belonged. Bond uses Sciarra's ring to infiltrate a Spectre meeting, where he identifies the leader, Franz Oberhauser. When Oberhauser addresses Bond by name, he is pursued across the city by Spectre's assassin, Mr. Hinx. Moneypenny informs Bond that the information he collected leads to Mr. White, a former member of Quantum—a subsidiary of Spectre—who has fallen afoul of Oberhauser and has been marked for assassination. Bond asks her to investigate Oberhauser, who was presumed dead years earlier.\n\nBond locates White in Austria, where he learns that White is dying of thallium poisoning. He admits to having grown disenchanted with Quantum and tells Bond to find and protect his daughter, Dr. Madeline Swann, who will take him to L'Américain; this will in turn lead him to Spectre. White then commits suicide. Bond approaches Swann, and after he rescues her from Hinx, the two meet Q. Through Sciarra's ring, Q forensically links Oberhauser to Bond's previous missions, identifying Le Chiffre, Dominic Greene and Raoul Silva as Spectre agents. Swann reveals that L'Américain is a hotel in Tangier.\n\nThe two travel to the hotel and discover White left evidence directing them to Oberhauser's operations base in the desert. After an encounter with Hinx that sees the assassin killed, Bond and Swann are escorted to Oberhauser's base. There, Oberhauser reveals that Spectre has been funding the Joint Intelligence Service while staging terrorist attacks around the world, creating a need for the Nine Eyes programme. In return C will give Spectre unlimited access to intelligence gathered by Nine Eyes, allowing them to anticipate and counter-act investigations into their operations. Bond is tortured as Oberhauser discusses their shared history: after the younger Bond was orphaned, Oberhauser's father, Hannes, became his temporary guardian. Believing that Bond supplanted his role as son, Oberhauser killed his father and staged his own death, subsequently adopting the name Ernst Stavro Blofeld and going on to form Spectre. Bond and Swann overpower him and escape, destroying the base in an explosion and leaving Blofeld to die.\n\nAs the Moroccan facility was one node in a wider network, Bond and Swann return to London where they meet M, Bill Tanner, Q, and Moneypenny with the intention of arresting C and stopping Nine Eyes from being activated. Swann and Bond are abducted separately, while the rest of the group proceed with the plan. After Q succeeds in preventing the Nine Eyes from going online, a brief struggle between M and C ends with C falling to his death. Meanwhile, Bond is taken to the old MI6 building, which is scheduled for demolition. Moving throughout a ruined labyrinth, he encounters a disfigured Blofeld, who tells him that he has a choice between escaping the building before explosives are detonated or die trying to save Swann. Bond finds Swann and the two escape by boat as the building collapses.\n\nBond gives chase and manages to shoot down Blofeld's helicopter, which crashes onto Westminster Bridge. Blofeld crawls away from the wreckage and is confronted by Bond, with Blofeld attempting to goad Bond into shooting him. Bond unloads his gun, sparing Blofeld. As Blofeld is arrested by M, Bond throws his gun into the Thames and leaves the bridge with Swann.",
  "synopsis": null
}