{
  "imdb_id": "tt4270516",
  "tmdb_id": "309304",
  "douban_id": null,
  "title": "Grandma (2015)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "79 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.7,
  "director": [
    {
      "id": "nm0919369",
      "name": "Paul Weitz"
    }
  ],
  "writer": [
    {
      "id": "nm0919369",
      "name": "Paul Weitz",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0005499",
      "name": "Lily Tomlin",
      "character": "Elle"
    },
    {
      "id": "nm0339460",
      "name": "Judy Greer",
      "character": "Olivia"
    },
    {
      "id": "nm3400186",
      "name": "Julia Garner",
      "character": "Sage"
    },
    {
      "id": "nm3163793",
      "name": "Carlos Miranda",
      "character": "Young Man"
    },
    {
      "id": "nm0158626",
      "name": "John Cho",
      "character": "Chau"
    },
    {
      "id": "nm1822659",
      "name": "Nat Wolff",
      "character": "Cam"
    },
    {
      "id": "nm1209545",
      "name": "Laverne Cox",
      "character": "Deathy"
    },
    {
      "id": "nm3915431",
      "name": "Aaron Bilyeu",
      "character": "Tattoo Artist"
    },
    {
      "id": "nm0001615",
      "name": "Elizabeth Peña",
      "character": "Carla"
    },
    {
      "id": "nm0131974",
      "name": "Colleen Camp",
      "character": "Bonobo Customer"
    },
    {
      "id": "nm0000385",
      "name": "Sam Elliott",
      "character": "Karl"
    },
    {
      "id": "nm4263987",
      "name": "Mo Zelof",
      "character": "Ian       (as Mo Aboul-Zelof)"
    },
    {
      "id": "nm0001315",
      "name": "Marcia Gay Harden",
      "character": "Judy"
    },
    {
      "id": "nm5976690",
      "name": "Meg Crosbie",
      "character": "Wendy"
    },
    {
      "id": "nm1901220",
      "name": "Sarah Burns",
      "character": "Jill"
    },
    {
      "id": "nm1671191",
      "name": "Missy Doty",
      "character": "Mom"
    },
    {
      "id": "nm0573134",
      "name": "Don McManus",
      "character": "Dad"
    },
    {
      "id": "nm6126968",
      "name": "Willem Miller",
      "character": "Kid"
    },
    {
      "id": "nm6730267",
      "name": "Skya Chanadet",
      "character": "Sister"
    },
    {
      "id": "nm9259002",
      "name": "Sarah Burns",
      "character": "Protestor"
    },
    {
      "id": "nm0866300",
      "name": "Lauren Tom",
      "character": "Doctor"
    },
    {
      "id": "nm0779427",
      "name": "Kelsey Scott",
      "character": "Nurse"
    },
    {
      "id": "nm3178892",
      "name": "Marlene Martinez",
      "character": "Receptionist"
    },
    {
      "id": "nm2078516",
      "name": "Reggie Watkins",
      "character": "Mechanic"
    },
    {
      "id": "nm1197519",
      "name": "Amir Talai",
      "character": "Omid"
    },
    {
      "id": "nm0172806",
      "name": "Frank Collison",
      "character": "Mike"
    },
    {
      "id": "nm0002096",
      "name": "Judy Geeson",
      "character": "Francesca"
    }
  ],
  "overview": "Self-described misanthrope Elle Reid has her protective bubble burst when her 18-year-old granddaughter, Sage, shows up needing help. The two of them go on a day-long journey that causes Elle to come to terms with her past and Sage to confront her future.",
  "storyline": "Lily Tomlin stars as Elle who has just gotten through breaking up with her girlfriend when Elle's granddaughter Sage unexpectedly shows up needing six hundred dollars before sundown. Temporarily broke, Grandma Elle and Sage spend the day trying to get their hands on the cash as their unannounced visits to old friends and flames end up rattling skeletons and digging up secrets.",
  "plot": "Divided over six chapters, the film tells the story of Elle, a lesbian poet coping with the recent death of her long-term life partner. She ends a four-month relationship with a younger admirer, Olivia, before receiving a visit from her 18-year-old granddaughter Sage, who is pregnant and requests $630 for an abortion. As Elle is broke and Sage has had her credit card confiscated by her overbearing mother, the two embark on a road trip to come to terms with their troubles.\n\nElle forcefully extorts $50 from the father of the child, and then tries to call in a $400 debt from her friend Deathy, a tattoo artist. Because she is also broke at the time, Deathy cannot help Elle and Sage beyond some $60 she borrows from the register, but gives Elle a new tattoo that looks like the letter \"O\", probably Olivia's initial, though Elle insists it is only meant to be a circle. Elle tries to sell some of her rare books to an acquaintance who owns a café, but gets into a fight with Olivia, who is working at that cafe. Elle storms out when her friend, who is much more tech-savvy than Elle, gauges the price on eBay and offers her a paltry $60, and Olivia berates her as they leave.\n\nGetting desperate, they visit Elle's ex-husband Karl, whom Elle has not seen in decades. Elle tells him she needs to borrow the money for rent, and he requests a kiss in return. This leads to an argument over how Elle left the relationship, but when she pleads with him, he agrees to hand over the cash. After retrieving it from a strongbox he asks them to be honest about the reason for the money. Elle tells him that Sage needs an abortion, and Karl becomes angry and emotional because Elle aborted his child without telling him, yet went on to give birth to a baby born from a one-night stand. Elle explains that she wanted a child but not a husband, and Karl angrily says he will not pay for an abortion.\n\nElle and Sage work up the courage to visit Sage's busy mother, who is furious to learn she is pregnant in spite of having given her condoms. Her mom hands over the money, after which Elle attempts to drive Sage to the clinic, however their car breaks down. They hitch a ride and Sage has the procedure. Sage is forgiven by her mother, and is taken home. Elle is later seen having her car repaired at a garage. She takes a cab home, and on the way, spends her time giggling and rejoicing at the memories her partner Violet left behind. Before getting home, she makes a short stop at Olivia's house to apologize for saying their relationship meant nothing. She then leaves, only to find the cabdriver has left. The final scene shows Elle walking down the sidewalk, laughing, on her way home.",
  "synopsis": null
}