{
  "imdb_id": "tt4291436",
  "tmdb_id": "325654",
  "douban_id": null,
  "title": "When Will You Get Married? (2015)",
  "genres": [
    "Comedy",
    "Romance"
  ],
  "country": "Indonesia",
  "version": [],
  "imdb_rating": 7.9,
  "director": [
    {
      "id": "nm2678073",
      "name": "Ody C. Harahap"
    }
  ],
  "writer": [
    {
      "id": "nm1302043",
      "name": "Robert Ronny",
      "description": "written by"
    },
    {
      "id": "nm1295189",
      "name": "Monty Tiwa",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm6996029",
      "name": "Ellis Alisha",
      "character": "Eva"
    },
    {
      "id": "nm3992780",
      "name": "Febby Febiola",
      "character": "Nadya"
    },
    {
      "id": "nm6996030",
      "name": "Firman Ferdiansyah",
      "character": "William"
    },
    {
      "id": "nm0475643",
      "name": "Adi Kurdi",
      "character": "Gatot"
    },
    {
      "id": "nm3024307",
      "name": "Reza Rahadian",
      "character": "Satrio"
    },
    {
      "id": "nm2620507",
      "name": "Erwin Sutodihardjo",
      "character": "Jerry"
    },
    {
      "id": "nm3201792",
      "name": "Ivanka Suwandi",
      "character": "Dewi"
    },
    {
      "id": "nm3207134",
      "name": "Yayu A.W. Unru",
      "character": "Wisnu"
    },
    {
      "id": "nm1138642",
      "name": "Adinia Wirasti",
      "character": "Dinda"
    }
  ],
  "overview": "Dinda is a successful Hotel Manager in Jakarta, but her parents think that she's a failure because she's still single in her 30s. An unacceptable thing for her parents who keeps their traditional culture by heart, where women should have babies in their early 20s. Dinda finally give in by her parents' pressure. She devise a plan to hire an actor, Satrio, to pretend to become her boyfriend for a week. She brings along Satrio to Jogjakarta for her parents' wedding anniversary party. But what it seems as a harmless plan turns into chaos. All Dinda's plan didn't work out as she hope to be. Satrio turns out to be an idealistic and eccentric actor who never follow Dinda's scenario and always has his own act to charm Dinda's parents. Dinda is trying juggling everything in order,but little does she knows that her parents also has their own scenario for Dinda. Hilarity ensues.",
  "storyline": "Dinda is a successful Hotel Manager in Jakarta, but her parents think that she's a failure because she's still single in her 30s. An unacceptable thing for her parents who keeps their traditional culture by heart, where women should have babies in their early 20s. Dinda finally give in by her parents' pressure. She devise a plan to hire an actor, Satrio, to pretend to become her boyfriend for a week. She brings along Satrio to Jogjakarta for her parents' wedding anniversary party. But what it seems as a harmless plan turns into chaos. All Dinda's plan didn't work out as she hope to be. Satrio turns out to be an idealistic and eccentric actor who never follow Dinda's scenario and always has his own act to charm Dinda's parents. Dinda is trying juggling everything in order,but little does she knows that her parents also has their own scenario for Dinda. Hilarity ensues.",
  "plot": "The tomboy Mae (Nirina Zubir) and her three male friends Eman (Aming), Beni (Ringgo Agus Rahman) and Guntoro (Deddy Mahendra Desta) live in village in Jakarta. Each is miserable due to not achieving his or her goals. Meanwhile, Mae's parents (Jaja Mihardja and Meriam Bellina), realise that their daughter has never acted feminine nor begun working, which they fear will make her undesirable to prospective husbands. They also fear that her friendship with Eman, Beni, and Guntoro will give pause to any interested men.\n\nAt first, the parents find some teachers, then a young athlete; Mae is not interested, and&#160;– using a red handkerchief&#160;– signals to her friends to chase them away. When the athlete tells his boss, Rendy (Richard Kevin), about Mae, the latter decides to visit. She falls in love at first sight. Rendy, who is being hounded by his mother to marry quickly, is tall, handsome, wealthy, and well educated. Rendy, who is looking for a girl like no other, likewise falls in love with Mae. As Eman, who is standing watch, is colour blind, he misinterprets the signal and together with Beni and Guntoro he accosts Rendy and pummels him.\n\nMae's mother, distraught that Mae has still not married, falls ill and threatens to return as a ghost. Mae promises to marry quickly, and tells Eman, Beni, and Guntoro to choose who should marry her. In a competition, it is decided that Guntoro should be the groom. However, after he and Eman fall ill, Ben is chosen. The ceremony is interrupted by Rendy, who comes with his motorcycle gang and begins fighting with the villagers to take revenge for his lost honour. After Mae, who has joined the fight in her wedding kebaya, meets him, the two are able to stop the fight. Rendy and Mae are then married, with the motorcycle gang and villagers in attendance.",
  "synopsis": null
}