{
  "imdb_id": "tt4271820",
  "tmdb_id": "329135",
  "douban_id": null,
  "title": "OK Kanmani (2015)",
  "genres": [
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "139 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm0711745",
      "name": "Mani Ratnam"
    }
  ],
  "writer": [
    {
      "id": "nm0711745",
      "name": "Mani Ratnam",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4921260",
      "name": "Dulquer Salmaan",
      "character": "Aditya Varadharajan (aka Aadi)"
    },
    {
      "id": "nm3383930",
      "name": "Nithya Menon",
      "character": "Tara"
    },
    {
      "id": "nm0695177",
      "name": "Prakash Raj",
      "character": "Ganapathy"
    },
    {
      "id": "nm7118554",
      "name": "Leela Samson",
      "character": "Bhavani"
    },
    {
      "id": "nm6678966",
      "name": "Vinodhini Vaidynathan",
      "character": "Saroja       (as Vinodhini)"
    },
    {
      "id": "nm6427403",
      "name": "Ramya Subramanian",
      "character": "Ananya"
    },
    {
      "id": "nm1249710",
      "name": "Siva Ananth",
      "character": "Vasu       (as A. Sivakumar)"
    },
    {
      "id": "nm7267543",
      "name": "John Devasahayam",
      "character": "John"
    },
    {
      "id": "nm7240396",
      "name": "Prabhu Lakshman",
      "character": "Buddy"
    },
    {
      "id": "nm4273272",
      "name": "Baby Rakshana",
      "character": "Aadhi's Niece"
    },
    {
      "id": "nm1701016",
      "name": "Kaniha",
      "character": "Cameo Appearance       (as Kanika)"
    },
    {
      "id": "nm1538894",
      "name": "Balkrishna Doshi",
      "character": "Cameo Appearance"
    },
    {
      "id": "nm3376240",
      "name": "Padam Bhola",
      "character": "Cameo Appearance"
    },
    {
      "id": "nm7796389",
      "name": "Arav",
      "character": "Adhi's co-worker"
    },
    {
      "id": "nm10002660",
      "name": "Melvin M. Ranjan",
      "character": ""
    }
  ],
  "overview": "Adhi and Tara are in a live-in relationship and but they are both unwilling to get married. How do they realize that marriage is just a natural progression of their relationship?",
  "storyline": "Adhi (Dulquer) a happy-go-lucky lad, bumps into Tara (Nithya Menon), a bubbly girl loaded with energy and fall in love. The duo have plenty in common and the most striking one is that they both hate marriage. So after flirting with each other, they move in together for a live-in relationship. Their jolly go stint rocks on until that juncture comes when they have to answer the big question of whether to move forward or not.",
  "plot": "Aditya Varadarajan is a video game developer who accidentally meets Taara Kalingarayar at his friend/colleague's wedding. He later finds out she is planning to pursue her studies in Paris. They soon begin to call each other often, go out together, and start to fall in love during a holiday they take together. They agree that marriage is not for them and decide to have a live-in relationship instead, and Taara moves into Adhi's place, rented from Ganapathy. They wish to spend their time with each other before they go their separate ways for their respective careers. Taara and Adhi live happily, being playful with each other.\n\nOne midnight, Tara has a conversation with Ganapathy. She tells him that she might get her visa approved for going to Paris, and that it's hard for her to leave Adhi and go far away. The next day Taara goes to Jaipur for her business, and Aditya starts to miss her terribly. Upon seeing the love and patience his houseowner Ganapathy has for his wife, Bhavani, an Alzheimer's patient, who one day even forgets the way to her own house, they begin to understand the importance of each other's presence in their life.\n\nSoon, Adhi is selected to develop his skills in video games and to go United States. He tells his colleague that it's hard for him to leave Taara. The next day, both of them make an agreement to enjoy themselves to the maximum for the 10 days left before they separate. Nearing the last day, they begin to have little fights and arguments, which don't last long.\n\nOne day, Bhavani goes missing again, as she did when she forgot her house address. While looking for her, they continue arguing about their relationship and finally Adhi proposes to Taara and they decide to get married. Post marriage, both of them continue to accomplish their own dreams, one in Paris, another in US. And they live happily, married and in love.",
  "synopsis": null
}