{
  "imdb_id": "tt4256544",
  "tmdb_id": "328037",
  "douban_id": null,
  "title": "Monty Python: The Meaning of Live (TV Movie 2014)",
  "genres": [
    "Documentary"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.5,
  "director": [
    {
      "id": "nm0333637",
      "name": "Roger Graef"
    },
    {
      "id": "nm0974853",
      "name": "James Rogan"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm0000092",
      "name": "John Cleese",
      "character": "Himself"
    },
    {
      "id": "nm0000416",
      "name": "Terry Gilliam",
      "character": "Himself"
    },
    {
      "id": "nm0001385",
      "name": "Eric Idle",
      "character": "Himself"
    },
    {
      "id": "nm0001402",
      "name": "Terry Jones",
      "character": "Himself"
    },
    {
      "id": "nm0001589",
      "name": "Michael Palin",
      "character": "Himself"
    },
    {
      "id": "nm0063473",
      "name": "Jim Beach",
      "character": "Himself"
    },
    {
      "id": "nm0001037",
      "name": "Graham Chapman",
      "character": "Himself       (archive footage)"
    },
    {
      "id": "nm0166470",
      "name": "Carol Cleveland",
      "character": "Herself"
    },
    {
      "id": "nm2207118",
      "name": "Brian Cox",
      "character": "Himself"
    },
    {
      "id": "nm0319104",
      "name": "Holly Gilliam",
      "character": "Herself"
    },
    {
      "id": "nm0370071",
      "name": "Stephen Hawking",
      "character": "Himself"
    },
    {
      "id": "nm0000196",
      "name": "Mike Myers",
      "character": "Himself"
    }
  ],
  "overview": "With unprecedented access, this program reveals the humour, chaos and passion that went into bringing the Flying Circus to the stage cumulating in the legendary One Down, Five To Go.",
  "storyline": "Uniquely intimate documentary following the stars of Monty Python as they reunite for a final time to stage a marathon ten shows of Monty Python Live (mostly) - One Down Five to Go at The O2, London in July 2014.",
  "plot": "The film begins with the short film The Crimson Permanent Assurance, where a group of elderly office clerks work in a small accounting firm. They rebel against yuppie corporate masters, transform their office into a pirate ship, and raid a large financial district. The rest of the film is split into seven chapters made up of distinct sketches.\n\nThe first, “The Miracle of Birth”, features a woman in labour being ignored by the doctors in favour of impressing the hospital’s administrator. In Yorkshire, a Roman Catholic man loses his jobs and returns home, instructing his children on the church’s opposition to contraception, leading to the musical number “Every Sperm is Sacred”, before selling his children off for scientific experiments. Meanwhile, a Protestant man and his wife discuss having non-reproductive sex.\n\nIn “Growth and Learning”, a class of boys are taught school etiquette and then watch their teacher make love to his wife as part of their sex education. One boy laughs, and is forced into a violent rugby match against the teachers as punishment. “Fighting Each Other” first focuses on a World War I officer trying to rally his men to find cover during an attack, but they insist on celebrating his birthday; then, an army RSM attempts to drill his platoon but ends up excusing them all to pursue leisure activities. In 1879, during the Anglo-Zulu War, a soldier finds his leg has been bitten off. Suspecting a tiger, despite being in Africa, the soldiers hunt for it and find two men suspiciously wearing two halves of a tiger costume.\n\n“The Middle of the Film” briefly introduces a segment called “Find the Fish”, a surreal scene where bizarre characters asks the audience to find a fish hidden in the sequence. “Middle Age” involves a middle-aged American couple visiting a dungeon-themed restaurant and dislike the literal conversation offered by the waiters about the meaning of life. “Live Organ Transplants” involves two paramedics visiting Mr. Brown, a card-carrying organ donor, forcefully removing his liver whilst he is still alive. Brown’s mother speaks with a musician who performs “Galaxy Song” while discussing man’s insignificance in the universe. The Crimson Permanent Assurance return to invade a corporate boardroom discussing the meaning of life, but a tumbling skyscraper ends their assault.\n\n“The Autumn Years” features a posh restaurant being visited by the horribly obese Mr. Creosote, who vomits continuously and devours an enormous meal. When the maître d' gives him a wafer-thin mint, Creosote’s stomach explodes, the maître d' then giving him the bill. Two staff members clean up Creosote’s remains while discussing the meaning of life. One leads the audience to his house, spouts some philosophy, and then angrily dismisses them.\n\n“Death” features a condemned man choosing the manner of his own execution: being chased off a cliff by topless women and falls into his own grave below. The Grim Reaper enters an isolated country house and invites himself to dinner. The guests try to guess who he is until the Reaper tells them they all died from food poisoning. They accompany the Grim Reaper to Heaven, depicted as a Las Vegas-style hotel in perpetual Christmas, where a Tony Bennett-lookalike performs “Christmas in Heaven” to the cast.\n\n“The End of the Film” epilogue features the host of “The Middle of the Film” being handed an envelope containing the meaning of life. She reads it out: “Try and be nice to people, avoid getting fat, read a good book every now and then, get some walking in, and try to live together in peace and harmony with people of all creeds and nations.” She then introduces the end credits.",
  "synopsis": null
}