{
  "imdb_id": "tt4235342",
  "tmdb_id": "311146",
  "douban_id": null,
  "title": "The Golden Cane Warrior (2014)",
  "genres": [
    "Action",
    "Drama"
  ],
  "country": "Indonesia",
  "version": [
    {
      "runtime": "111 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm2856917",
      "name": "Ifa Isfansyah"
    }
  ],
  "writer": [
    {
      "id": "nm2856917",
      "name": "Ifa Isfansyah",
      "description": null
    },
    {
      "id": "nm0504205",
      "name": "Mira Lesmana",
      "description": null
    },
    {
      "id": "nm1127154",
      "name": "Jujur Prananto",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4620730",
      "name": "Tara Basro",
      "character": "Gerhana"
    },
    {
      "id": "nm0354604",
      "name": "Christine Hakim",
      "character": "Cempaka"
    },
    {
      "id": "nm3446996",
      "name": "Eva Celia Latjuba",
      "character": "Dara"
    },
    {
      "id": "nm3024307",
      "name": "Reza Rahadian",
      "character": "Biru"
    },
    {
      "id": "nm1127373",
      "name": "Nicholas Saputra",
      "character": "Elang"
    }
  ],
  "overview": "Cempaka, a respected warrior and highly respected in the world of martial is a great holder of lethal weapons, Golden Cane. Cempaka will pass the weapon to one of her students.  Murder and betrayal occurs before the martial world know who the heirs. Golden Cane fall into the wrong hands and can not be avoided, chaos ensued. The only person who can help take over the Golden Cane is the White Dragon Warrior, former spouse of Cempaka, which has long disappeared.",
  "storyline": "The Golden Cane: a relic of incomparable force, coveted by all. And with it, the training of a technique so unrivaled, it vanquishes all who dare oppose its power. As Master Cempaka and her four disciples - orphans of her enemies, now heirs to the Cane - prepare for the new warrior guardian to ascend, an act of villainous betrayal threatens to destroy the clan and destabilize the realm. Their only hope to restore order lies in finding the elusive White Dragon, the only remaining pupil still equipped to unlock the mysteries of the Golden Cane.",
  "plot": "Cempaka (Christine Hakim) is a silat master known as The Golden Cane Warrior. She has four disciples: Biru (Reza Rahadian), Gerhana (Tara Basro), Dara (Eva Celia), and Angin (Aria Kusumah); all of whom are the children of the enemies she defeated in the past. She plans to bequeath her powerful Golden Cane along with the ultimate technique which has helped her to be undefeated to one of her four disciples. She eventually chooses Dara, who initially feels uneasy about being the heir to the Golden Cane, to be her successor as The Golden Cane Warrior.\n\nHowever, before she gets to teach the ultimate technique to Dara, she is betrayed and ambushed by Biru and Gerhana who want the Golden Cane for themselves on the journey to the place where she plans to teach Dara along with Angin whom she brings along to care for her deteriorating health. To give Dara and Angin the window to flee and save themselves, Cempaka fights Biru and Gerhana who manage to defeat and kill Cempaka whose health is getting worse. It is later known that Gerhana is the one who had been poisoning Cempaka with deadly snake venom.\n\nShocked by the betrayals of Biru and Gerhana as well as the death of Cempaka, Dara and Angin flee the scene but Biru and Gerhana catch up and attack them. During the fight between the four of them, Dara and Angin fall down a cliff but saved by a mysterious man. Waking up from her unconsciousness, Dara finds out that the man who saved her and Angin was Elang (Nicholas Saputra) who take them to his barn. Dara and Angin decide to embark on a mission to find The White Dragon Warrior, Cempaka's partner in the past who is the only person left to teach Dara the ultimate technique of the Golden Cane. However, Elang warns them that they're not ready to find the warrior.\n\nAngin is later caught by a group of Red Wing Warriors who are deceived by Biru and Gerhana into believing that Dara and Angin are responsible for the death of Cempaka after betraying her. The master of the Red Wing Warriors (Whani Darmawan), a close friend of Cempaka, help Biru and Gerhana to hunt Dara and Angin down not knowing that the real betrayers are indeed the ones he trust. Dara exchanges the Golden Cane in return for Angin alive with Biru and Gerhana, who promised to let them go only to go back on his words. Trying to save Dara, Angin is later killed fighting Biru and Gerhana all by himself.\n\nAngered by the death of Angin, Dara sneaks into the Red Wing Warriors compound which Biru and Gerhana has taken over after killing the master with the same snake venom they used to poison Cempaka. Elang intervenes and takes her with him knowing that she's not ready to fight Biru and Gerhana yet.\n\nElang apologizes to Dara saying that he should have helped her saving Angin earlier but he can't do so because he promised his father, who is later revealed to be The White Dragon Warrior (Darius Sinathriya), never to have anything to do with Cempaka, who is in fact White Dragon's past lover and his birth mother. He tells Dara that his father is dead and he is the only remaining person who knows the secret of the Golden Cane's ultimate technique; revealed to be a technique that can only be done by two warriors. Dara realizes at that moment that Cempaka meant to teach her and Angin the technique. She begs Elang to take her as his disciple, which he agrees to despite knowing that he is breaking the promise he made to his father. The Leader of the High Council (Slamet Rahardjo) advises against him teaching Dara, but he decides to do otherwise.\n\nBack at the former Red Wing Warriors compound, which Biru and Gerhana have transformed into their Golden Cane Warriors compound, Biru has become very violent; killing anyone unwilling to obey his words. It is later revealed as well that Biru and Gerhana are in fact lovers.\n\nOne day, Dara and Elang invade the compound. She demands Biru to return the Golden Cane which is rightfully hers in peace and there will be no blood spilled, but Biru refuses. Dara then challenges Biru and Gerhana to fight her and Elang fairly allowing no one to intervene. During the fight between Dara and Gerhana, a girl walks out of a room and Dara asks Gerhana to take the fight somewhere else as she doesn't want to kill Gerhana in front of her daughter. They pause for a moment but Gerhana attacks Dara who is off-guard. Dara manages to defeat and kill Gerhana; making Biru angry. Biru blindly attacks Dara and Elang but is taken down by a blow, allowing Dara to snatch the Golden Cane. Biru gets up, attacking Dara and Elang with a huge tree trunk. Dara and Elang starts to spin holding the Golden Cane together; performing the Golden Cane's ultimate technique which kills Biru in a single blow.\n\nDara and Elang are later seen kissing and hugging; indicating that they have feelings for each other. However, the next morning, Elang leaves Dara who is saddened by his departure. Elang is seen talking to the Leader of the High Council, also Elang's Uncle, saying he is ready to serve the punishment for breaking the promise he made to his father. Dara, back at Cempaka's old barn, is seen teaching Biru and Gerhana's daughter martial arts; just as Cempaka took the children of her defeated enemies as her disciples.",
  "synopsis": null
}