{
  "imdb_id": "tt4223196",
  "tmdb_id": "339283",
  "douban_id": null,
  "title": "Forget Not (2014)",
  "genres": [
    "Documentary"
  ],
  "country": "USA",
  "version": [],
  "imdb_rating": 8.4,
  "director": [
    {
      "id": "nm6933806",
      "name": "Derek Scearcé"
    }
  ],
  "writer": null,
  "cast": null,
  "overview": "The Chariot are one of those bands that don’t exist anymore but whose mark on the scene cannot be overestimated. Blending intensely emotional music with the most amazing live shows in recent years, their hardcore mentality has touched almost every part of the genre today. Their disbandment came as a blow to many, as their unique spark was set to disappear. Now, fans and new comers alike can get a glimpse into the engine that burned behind The Chariot, with their new documentary, Forget Not.",
  "storyline": "November 23, 2013, The Chariot played their final show. This is the story of the final tour leading up to Douglasville, GA.",
  "plot": "This article's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (September 2014) (Learn how and when to remove this template message)\nThe film opens with a little girl crying and running through a graveyard. She makes it to her house and her parents ask her what's wrong. The girl responds, \"I don't remember.\"\n\nYears later, Sandy Channing and her brother, Eli, are college students who attend a party at their friend T.J.'s house. Everyone goes to the graveyard to play a game. A new girl their age joins them. They play a ghost version of 'Tag', and the new girl wins. The girl asks Sandy if she remembers her. Sandy tells her she does not, and the girls states, \"You will,\" before jumping from the cliff behind her. The police arrive but are unable to find a body. There is a flashback to two girls playing The Game in the graveyard during the day, one is Sandy and the other is presumably the girl who jumped off this cliff. Sandy is the ghost during the game and when she finds the other girl, who requires an inhaler, they sit and talk, the other girl explains that the flower in her hair is a Forget Me Not, which is put on the graves so they remember the dead. Sandy says she doesn't know any dead people, and the girl replies, \"I do\". She gives the flowers to Sandy proclaiming them best friends, to which Sandy replies, \"Best Friends Forever.\"\n\nThe next day, Layla and Chad have sex in Chad's car, after which Chad tells Layla he wants to break up. Furious, Layla throws his class ring, which was hanging on her necklace, into the lake. Chad drives off and leaves her alone. Layla goes into the lake to retrieve the necklace when she sees a mysterious girl in the water. She is then drowned by the girl, who is revealed to be a demonic incarnation of the new girl who had disappeared the night before. Meanwhile, Chad arrives at Sandy and Eli's house, and when Sandy mentions Layla, Chad seems to have forgotten who she is.\n\nThe rest of the group is waiting for T.J. to come so they can go on their spring break trip. T.J. is negotiating a deal to buy an engagement ring for his girlfriend, Lex. He is soon killed by the now-demonic Layla. When Sandy mentions T.J. to her boyfriend Jake, he and the rest of the group have no memory of T.J., just like Layla. Sandy then finds T.J.'s contact information erased from her cell.\n\nThe group stops at a convenience store, with Lex distracting the cashier by having sex with him while everyone else steals liquor and food. Frustrated with Lex's promiscuous behavior despite dating T.J., Sandy walks off. Chad is killed next when the ghosts make his car explode. Sandy yells at Eli to pull over when she sees Chad's car. However, no one but Sandy remembers who Chad is, and they drive to T.J.'s house, which appears vacant and in ruin. As Sandy goes into the house with Jake and Eli, Lex and Hannah get into an argument in the car. Sandy begins to remember the unnamed girl from the graveyard as her childhood friend. Lex is killed by undead versions of her murdered friends. The other three think Sandy is crazy, as none of them remember Lex anymore.\n\nSandy and the others go to the police station, where they learn the mysterious girl's name is Angela Smith and she lives in a convent. At a hotel, Hannah and Eli go to the pool and have sex, after which Hannah is killed by the ghosts. Sandy and Jake then discover Angela is in a coma. At the convent, Jake is killed and Eli doesn't remember Jake anymore. He realizes that they are being erased from time, just like the rhyme they sang before playing the game in the graveyard. After heading home, Sandy, whose parents believe she has become depressed, is sedated and taken to the hospital. While there, Eli is killed by his friends' ghosts. At the hospital, Sandy asks for Eli, of whom her parents have no recollection at all.\n\nSandy dreams of a time where she and her friends played a scary prank on Angela, who had a seizure in front of the convent after knocking her head into the door. Angela's mom then comes out of her home and screams who did this to her. It is revealed that the little girl at the beginning of the film is a young Sandy, and the girl who mysteriously vanished and has been committing the murders is Angela. Sandy awakes and, recalling the rhyme to \"kill the ghost or seal your fate\", goes to Angela's room and switches off her life support. However, she then finds Angela sitting up in bed. Sandy is chased up to the roof by the ghosts of her friends, and encounters the young version of Angela. After Sandy's failed attempt to reason with her, young Angela hands her a bouquet of flowers (called Forget-me-not) and looks up, a demonic expression on her face as she says, \"Best friends forever, right, Sandy?\" This scares Sandy, and she falls from the roof. The film ends with Angela \"miraculously\" awakening from her coma, while Sandy is revealed to have taken her place in a coma of her own.",
  "synopsis": null
}