{
  "imdb_id": "tt4329054",
  "tmdb_id": "338990",
  "douban_id": null,
  "title": "I Want to Be a King (2015)",
  "genres": [
    "Documentary",
    "Drama",
    "Family"
  ],
  "country": "Iran",
  "version": [
    {
      "runtime": "70 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.0,
  "director": [
    {
      "id": "nm3882679",
      "name": "Mehdi Ganji"
    }
  ],
  "writer": [
    {
      "id": "nm3882679",
      "name": "Mehdi Ganji",
      "description": "writer"
    }
  ],
  "cast": null,
  "overview": "Documentary about a tourism entrepreneur and his family who hates him.",
  "storyline": "Abbas has turned his own home to a guest house in a nomadic area of Iran. With the support of his wife and three children, he runs a successful Eco-tourism business. He has an ambitious dream, creating a new tribe by his own and becoming the sovereign. Therefore, he plans seriously to fulfill his dream and searching for a nomadic girl to be the queen of his tribe. Since he is Muslim, he has the right of taking more than one wife at the same time. His current wife and children are against this idea and break up with him.",
  "plot": "Michelle Mulan is a 40-something real estate broker who has recently been promoted as a chairperson to a failing firm, even though she is fully qualified, she had only been promoted because of her father Walter's, status as chairman. While other chairmen want to sell the firm, she sees more advantage in merging with a larger company. Despite having a boyfriend, George (Mark McClain Wilson), Michelle does cheat on him to satiate her sexual desires. Also a single mother, she struggles to get her teenage daughter, Dara, on the right track and takes her to dinner at a local restaurant. There, a man fifteen years her junior becomes enamored with her. After dropping Dara off at home, Michelle returns to the restaurant and finds Ryan trying to seduce her, but manages to ward him off. Still taking his number, Michelle initially decides not to meet him, but the next day after getting a meeting enabling the merger, decides to do so. After rejecting a marriage proposal from George, Michelle goes out with Ryan. On their date, he introduces her to the world of BDSM after which Michelle cheats on George with Ryan. After breaking up with George, Michelle begins to date Ryan and easily gives in to his dominating personality.\n\nFalling in love, Michelle begins to call Ryan her 'master' and refers to herself as a 'messy whore'. At a benefit dinner, Ryan begins to insult Michelle's client and operate a vibrator egg she is wearing while she is with the client. Despite this, she manages to get the client to consider a merger. While trying to get Dara on the right track, Michelle also decides to learn more about being dominated and very quickly finds that she enjoys submitting to Ryan's will. After learning Ryan has a criminal record as a result of being a car thief from her father, Michelle continues to try and negotiate a deal with the client to save the firm. Michelle continues seeing Ryan and gives herself in to him completely while also learning more and more about the submissive lifestyle. Along the way, however, she also learns how to become a dominant and a woman at a BDSM club Ryan introduced her tells her that Ryan is a predator.\n\nUnknown to her, Ryan also seduces Dara and has made her a submissive. Seeing this, she finally overthrows Ryan's bonds and uses her new-found sexual prowess to take control of her life. Ryan assaults her when she goes to confront him at his loft about his affair with Dara, but Michelle knocks him unconscious with a camera tripod. She proceeds to take him to his private dungeon and bind him, turning him into the submissive. After torturing Ryan, Michelle turns him over to the police for having sex with her underage daughter. With her newfound confidence, Michelle seals the deal with her client and the merger of Walter's company to the client's is successful. Afterwords in the final scene, Michelle signs the paperwork involving the merger with the clinet... and also making him her submissive.",
  "synopsis": null
}