{
  "imdb_id": "tt4313594",
  "tmdb_id": "346307",
  "douban_id": null,
  "title": "Eva & Leon (2015)",
  "genres": [
    "Drama"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "72 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm1014584",
      "name": "Emilie Cherpitel"
    }
  ],
  "writer": [
    {
      "id": "nm1014584",
      "name": "Emilie Cherpitel",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm1202905",
      "name": "Clotilde Hesme",
      "character": "Eva"
    },
    {
      "id": "nm6778210",
      "name": "Florian Lemaire",
      "character": "Léon"
    },
    {
      "id": "nm0158898",
      "name": "Yannick Choirat",
      "character": "Simon"
    },
    {
      "id": "nm0001075",
      "name": "Peter Coyote",
      "character": "Le père d'Eva"
    },
    {
      "id": "nm1165424",
      "name": "Keziah Jones",
      "character": "John"
    },
    {
      "id": "nm0183660",
      "name": "Clotilde Courau",
      "character": "Lucie"
    },
    {
      "id": "nm0147544",
      "name": "Idit Cebula",
      "character": "Mme Agostini, la psy"
    },
    {
      "id": "nm2035281",
      "name": "Christophe Dimitri Réveille",
      "character": "Jérôme"
    },
    {
      "id": "nm1071149",
      "name": "Grégoire Bonnet",
      "character": "Le psy du centre"
    },
    {
      "id": "nm0869478",
      "name": "Guillaume Toucas",
      "character": "Le vendeur taxidermiste"
    },
    {
      "id": "nm3383155",
      "name": "Victoria Olloqui",
      "character": "Dolorès"
    },
    {
      "id": "nm3033378",
      "name": "Joséphine de La Baume",
      "character": "Simone"
    },
    {
      "id": "nm3936985",
      "name": "Vincent Marie",
      "character": "Ben, le barman"
    },
    {
      "id": "nm4804841",
      "name": "Karine Valmer",
      "character": "La policière"
    },
    {
      "id": "nm1903920",
      "name": "Gaelle Hausermann",
      "character": "Madame Bérenge"
    },
    {
      "id": "nm0373661",
      "name": "Mona Heftre",
      "character": "La mère d'Eva"
    },
    {
      "id": "nm7114104",
      "name": "Andrew Aldridge",
      "character": "Le majordome"
    },
    {
      "id": "nm7114105",
      "name": "Edouard Thébaut",
      "character": "Le stewart"
    },
    {
      "id": "nm7114106",
      "name": "Lionel Maarek",
      "character": "L'épicier"
    },
    {
      "id": "nm0686409",
      "name": "Dominique Plaideau",
      "character": "Voix Centre pour l'enfance       (voice)"
    },
    {
      "id": "nm8060744",
      "name": "Candice Ford",
      "character": "Petite amie de Simon"
    },
    {
      "id": "nm3424386",
      "name": "David Serero",
      "character": "Italian Crooner"
    }
  ],
  "overview": null,
  "storyline": "A privileged woman and an orphan boy meet and somehow become friends.",
  "plot": "See also: List of Neon Genesis Evangelion episodesTitle card for the anime series\nIn 2015, fifteen years after a global cataclysm known as the Second Impact, teenager Shinji Ikari is summoned to the futuristic city of Tokyo-3 by his estranged father Gendo Ikari, the director of the special paramilitary force NERV. Shinji witnesses the United Nations forces battling an Angel: one of a race of giant monstrous beings whose awakening was foretold by the Dead Sea Scrolls. Because of the Angels' near-impenetrable force-fields, NERV's giant Evangelion bio-machines, synchronized to the nervous systems of their pilots and possessing their own force-fields, are the only weapons capable of keeping the Angels from annihilating humanity. NERV officer Misato Katsuragi escorts Shinji into the NERV complex beneath the city, where his father pressures him into piloting the Evangelion Unit-01 against the Angel. Without training, Shinji is quickly overwhelmed in the battle, causing the Evangelion to go berserk and savagely kill the Angel on its own.\n\nFollowing hospitalization, Shinji moves in with Misato and begins settling into life in Tokyo-3. In his second battle, Shinji destroys an Angel but runs away after the battle, distraught. Misato confronts Shinji and he decides to remain a pilot. Evangelion Unit-00 is repaired and Shinji tries to befriend its pilot, a mysterious, and socially isolated teenage girl named Rei Ayanami. With Rei's help, Shinji defeats another Angel.\n\nRitsuko Akagi, NERV's chief scientist, reveals that the Second Impact was not caused by a meteor strike as officially reported, but instead resulted when the first Angel to arrive on Earth, codenamed Adam, exploded in the Antarctic. The pilot of Evangelion Unit-02, teenage girl Asuka Langley Soryu, moves in with Misato and Shinji and joins her fellow pilots in defeating the next Angels. Shinji's schoolfriend Toji Suzuhara is selected for Unit-03, but during his first test synchronization with the Evangelion, Unit-03 is hijacked by an Angel. When Shinji refuses to destroy the rogue unit, his control over Unit-01 is cut off and supplanted by a prototype autopilot system known as the \"Dummy Plug\" system, and his Evangelion rips apart Unit-03 crushing Toji's cockpit. Shinji is devastated and quits piloting the Evangelion, but is forced to return to destroy an Angel that has defeated both Asuka and Rei. Asuka loses her self-confidence following her defeat, and spirals into a deep depression. This is worsened by her next fight, against an Angel which attacks her mind. In the next battle, Rei self-destructs Unit-00 and dies to save Shinji's life. Misato and Shinji later visit the hospital where they find Rei alive but claiming she is \"the third Rei\". Misato forces Ritsuko to reveal the dark secrets of NERV, the Evangelion graveyard and the Dummy Plug system which operates using clones of Rei.\n\nAsuka is reduced to a catatonic state by her depression, and Kaworu Nagisa replaces her as pilot of Unit-02. Kaworu, who initially befriends Shinji, is revealed to be the final Angel. Kaworu fights Shinji, then realizes that he must die if humanity is to thrive and asks Shinji to kill him. Despite his initial hesitation, Shinji kills Kaworu. Soon after this act, NERV and SEELE trigger the forced evolution of humanity, termed the \"Human Instrumentality Project\", in which the souls of all mankind are merged into one through Rei. Shinji's soul grapples with the reason for his existence and reaches an epiphany that he needs others to thrive, enabling him to destroy the wall of negative emotions that torment him. This allows him to be reunited with all of the main characters, who congratulate him.",
  "synopsis": null
}