{
  "imdb_id": "tt4333210",
  "tmdb_id": "325843",
  "douban_id": null,
  "title": "The Outfield (2015)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.0,
  "director": [
    {
      "id": "nm1389536",
      "name": "Michael Goldfine"
    },
    {
      "id": "nm1864154",
      "name": "Eli Gonda"
    }
  ],
  "writer": [
    {
      "id": "nm5849613",
      "name": "Lydia Genner",
      "description": null
    },
    {
      "id": "nm1389536",
      "name": "Michael Goldfine",
      "description": "screen story"
    }
  ],
  "cast": [
    {
      "id": "nm6594362",
      "name": "Nash Grier",
      "character": "Jack Sanders       (as Hamilton Nash Grier)"
    },
    {
      "id": "nm6811460",
      "name": "Cameron Dallas",
      "character": "Frankie Payton"
    },
    {
      "id": "nm4192879",
      "name": "Joey Bragg",
      "character": "Austin York"
    },
    {
      "id": "nm3552184",
      "name": "Olivia Stuck",
      "character": "Kelsey Meola"
    },
    {
      "id": "nm3089868",
      "name": "Caroline Sunshine",
      "character": "Emily Jordan"
    },
    {
      "id": "nm0810770",
      "name": "Alan Smyth",
      "character": "Roger Sanders"
    },
    {
      "id": "nm0185832",
      "name": "Deborah S. Craig",
      "character": "Adrienne Rachels"
    },
    {
      "id": "nm7728072",
      "name": "Connor Green",
      "character": "Henry Meola"
    },
    {
      "id": "nm0034733",
      "name": "Yancey Arias",
      "character": "Charles"
    },
    {
      "id": "nm0601609",
      "name": "Melanie Paxson",
      "character": "Judith Meola"
    },
    {
      "id": "nm1617834",
      "name": "Fawnda McMahan",
      "character": "Laura Payton"
    },
    {
      "id": "nm2674507",
      "name": "John Barbolla",
      "character": "Frank Payton Sr."
    },
    {
      "id": "nm7199545",
      "name": "Alex Bentley",
      "character": "Baseball Player"
    },
    {
      "id": "nm7437691",
      "name": "Bobby Bitton",
      "character": ""
    },
    {
      "id": "nm0002438",
      "name": "Burnie Burns",
      "character": "Theo Rasmussen"
    },
    {
      "id": "nm4742598",
      "name": "Jordan Diambrini",
      "character": "Joey"
    },
    {
      "id": "nm0267880",
      "name": "Shannon Farnon",
      "character": "Mrs. Covington"
    },
    {
      "id": "nm0405094",
      "name": "Michael Hyland",
      "character": "Coach Schoffman"
    },
    {
      "id": "nm1828374",
      "name": "Bobby Kruger",
      "character": "Baseball Announcer"
    },
    {
      "id": "nm6327104",
      "name": "Jesse Rapaport",
      "character": "Tommy"
    },
    {
      "id": "nm1740248",
      "name": "Jon Ray",
      "character": "School Principal"
    },
    {
      "id": "nm3072297",
      "name": "Rosa",
      "character": "Ackerman"
    },
    {
      "id": "nm7728071",
      "name": "Darrin Rossi",
      "character": "Umpire"
    },
    {
      "id": "nm3512523",
      "name": "Sheldon White",
      "character": "Jeremy Porro"
    }
  ],
  "overview": "The film follows a trio of varsity baseball players as they enter their senior year of high school and navigate difficult choices on and off the field.",
  "storyline": "Jack Sanders (Nash Grier), star center fielder of the Peoria Owls, is going to play baseball for State. But when a new teacher recognizes his gift for art, Jack's future is suddenly thrown in limbo. With the help of his best friends, Frankie (Cameron Dallas) and Austin (Joey Bragg), Jack must deal with the aspirations of his father and the pressures of the entire town as he struggles to discover what's important to him and who he wants to be.",
  "plot": "With baseball's Pittsburgh Pirates in last place, their combative, foul-mouthed manager Guffy McGovern has plenty to complain about. All this changes when, while wandering through Forbes Field in search of his good luck charm one night, Guffy is accosted by the voice of an angel (voice of James Whitmore), who hints at having been a ballplayer during his earthly life.\n\nAs the spokes-angel for the Heavenly Choir Nine, a celestial team of deceased ballplayers, he begins bestowing \"miracles\" upon the Pirates—but only on the condition that McGovern put a moratorium on swearing and fighting.\n\nWith the help of the invisible ghosts of past baseball greats, the Pirates make it into the pennant race. During a game, 8-year-old orphan Bridget White insists that she can see the angels helping out the \"live\" ballplayers—understandably so, since it was Bridget's prayers to the Archangel Gabriel that prompted the angel to visit McGovern in the first place.\n\nLocal newspaper reporter and former \"household hints\" writer Jennifer Paige inadvertently transforms Bridget's angelic visions into a nationwide news story, causing McGovern no end of trouble. After Guffy is beaned during a game and himself confirms Bridget's claims, he falls into the hands of vengeful sportscaster Fred Bayles, who has been scheming to have McGovern thrown out of baseball and persuades the Commissioner of Baseball to investigate McGovern's fitness as a manager.\n\nComplication piles upon complication until the pennant-deciding game, wherein Guffy is forced to rely exclusively upon the talents of his ballplayers—notably \"over the hill\" pitcher Saul Hellman (who, the angel has told Guffy, will be \"signed up\" by the Heavenly Choir team shortly). Guffy also wins over Jennifer, and they plan to adopt young Bridget.\n\nThe angels themselves are never actually seen by the viewing audience, just the effects of their presence—a feather dropping, or someone being jostled from time to time. The angel who talks to Guffy never reveals who he was in life. It being a time when profanity was never used in films, the \"swearing\" uttered by Guffy is audio gibberish, scrambled recordings of his own voice.",
  "synopsis": "Jack Sanders (Nash Grier) is full of life and love with his wonderful girlfriend Emily (Caroline Sunshine) and his best friends Frankie (Cameron Dallas) and Austin (Joey Bragg) playing for the varsity baseball Peoria town team. When arts teacher Mrs. Rachels (Deborah S. Craig) notices a true talent in Jack and gives him advice to apply for the California Institute of the Arts, Jack must decide between his dad's wanting and his possible true passion. When all odds are against him, he must pull through and understand the full meaning of all the wonderful possibilities that may come for him."
}