{
  "imdb_id": "tt4340740",
  "tmdb_id": "363114",
  "douban_id": null,
  "title": "Inspired to Ride (2015)",
  "genres": [
    "Documentary"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "88 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.8,
  "director": [
    {
      "id": "nm3654342",
      "name": "Mike Dion"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm7043258",
      "name": "Mike Hall",
      "character": "Himself"
    },
    {
      "id": "nm3185283",
      "name": "Juliana Buhring",
      "character": "Herself"
    },
    {
      "id": "nm5849526",
      "name": "Jason Lane",
      "character": "Himself"
    },
    {
      "id": "nm7043264",
      "name": "Ed Pickup",
      "character": "Himself"
    },
    {
      "id": "nm7043261",
      "name": "Jesse Stauffer",
      "character": "Himself"
    },
    {
      "id": "nm0824498",
      "name": "Brian Steele",
      "character": "Himself"
    },
    {
      "id": "nm7043259",
      "name": "Billy Rice",
      "character": "Himself"
    },
    {
      "id": "nm7043260",
      "name": "Adam Guske",
      "character": "Himself"
    },
    {
      "id": "nm7043267",
      "name": "James Barringer",
      "character": "Himself"
    },
    {
      "id": "nm7043263",
      "name": "David Goldberg",
      "character": "Himself"
    },
    {
      "id": "nm7043262",
      "name": "Nathan Jones",
      "character": "Himself"
    },
    {
      "id": "nm7043265",
      "name": "Paolo Laureti",
      "character": "Himself"
    },
    {
      "id": "nm7043266",
      "name": "Giorgio Murari",
      "character": "Himself"
    }
  ],
  "overview": "On June 7, 2014, forty-five cyclists from around the world set out on the inaugural Trans Am Bike Race, following the famed TransAmerica Trail. Their mission is to cover 4,233 miles in one enormous stage race, traversing through ten states in a transcontinental adventure of epic proportions.  Inspired To Ride follows closely the journey of a handful of these cyclists as they prepare, compete and experience what riding 300 miles a day feels like with only a few hours sleep. They will rely solely on their fitness, meticulously chosen gear and mental fortitude to get them to the finish. And to make it even more interesting, they’ll be self-supported – no crew, no follow vehicles and no prize money waiting at the end.",
  "storyline": "On June 7, 2014, forty-five cyclists from around the world set out on the inaugural Trans Am Bike Race, following the famed TransAmerica Trail. Their mission is to cover 4,233 miles in one enormous stage race, traversing through ten states in a transcontinental adventure of epic proportions. Inspired To Ride follows closely the journey of a handful of these cyclists as they prepare, compete and experience what riding 300 miles a day feels like with only a few hours sleep. These racers will rely solely on their fitness, meticulously chosen gear and mental fortitude to get them to the finish. There are no support teams, no follow vehicles and no prize money waiting at the end. They will endure agonizing climbs in the Rockies, driving winds in the Great Plains and sawtooth switchbacks in the Appalachians all for a pat on the back, bragging rights and a cold beer when its all over. Some are out to win, while others are simply trying to finish. Ultimately, this is a story of the human ...",
  "plot": null,
  "synopsis": null
}