{
  "imdb_id": "tt4309834",
  "tmdb_id": "308715",
  "douban_id": null,
  "title": "Away and Back (TV Movie 2015)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "96 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.1,
  "director": [
    {
      "id": "nm0088121",
      "name": "Jeff Bleckner"
    }
  ],
  "writer": [
    {
      "id": "nm3463116",
      "name": "Jonah Lisa Dyer",
      "description": "written by"
    },
    {
      "id": "nm0245791",
      "name": "Stephen Dyer",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0005134",
      "name": "Jason Lee",
      "character": "Jack Peterson"
    },
    {
      "id": "nm1310368",
      "name": "Minka Kelly",
      "character": "Jennie Newsom"
    },
    {
      "id": "nm1369619",
      "name": "Maggie Elizabeth Jones",
      "character": "Frankie Peterson"
    },
    {
      "id": "nm3469242",
      "name": "Jaren Lewison",
      "character": "Kyle Peterson"
    },
    {
      "id": "nm5609065",
      "name": "Connor Paton",
      "character": "Stretch Peterson"
    },
    {
      "id": "nm7093927",
      "name": "Stephen Miller",
      "character": "Box Elder"
    },
    {
      "id": "nm0371671",
      "name": "David Haysom",
      "character": "Lars Hensel"
    },
    {
      "id": "nm3523076",
      "name": "Jarod Joseph",
      "character": "Tim McMurray"
    },
    {
      "id": "nm7093928",
      "name": "Michaela Gilchrist",
      "character": "Amanda Nethercott"
    },
    {
      "id": "nm0636092",
      "name": "Ryan Northcott",
      "character": "Dr. John Betts"
    },
    {
      "id": "nm7093929",
      "name": "Chris Shields",
      "character": "Ranger Lester Biggs"
    },
    {
      "id": "nm0006511",
      "name": "David LeReaney",
      "character": "Sheriff"
    },
    {
      "id": "nm1662261",
      "name": "Bernard Starlight",
      "character": "Concession Worker"
    },
    {
      "id": "nm7093930",
      "name": "Colton Short",
      "character": "Backhoe Driver"
    },
    {
      "id": "nm4307467",
      "name": "Roger LeBlanc",
      "character": "Man at Swan Centre"
    },
    {
      "id": "nm5718373",
      "name": "Joel Jackshaw",
      "character": "Hunter"
    },
    {
      "id": "nm5696487",
      "name": "Carly McKee",
      "character": "Teacher"
    },
    {
      "id": "nm3899911",
      "name": "Anna Quick",
      "character": "Cheering Girl"
    },
    {
      "id": "nm6414119",
      "name": "Tanya Wttewaall",
      "character": "Fan"
    }
  ],
  "overview": "When a family of swans make their home on the Peterson farm, it’s love at first sight for 10-year-old daughter Frankie.  But along comes no-nonsense ornithologist Ginny Newsom, who rushes in to “save” the majestic birds.  For Frankie’s dad Jack, it’s dislike at first sight when he encounters pushy, know-it-all Ginny. Frankie and her brothers are anything but neutral observers as they watch the initial hostility between their widowed father and the strong-willed Ginny transform into something else.  Could that be romance in the air?",
  "storyline": "When a rare swan lands on his farm, a widower and his 3 children must contend with the large large birds and the ambitious ornithologist who arrives to study them, a willful woman who is more interested in the avian family than the human one.",
  "plot": "Young Murphy (Gordon Gebert) grows up in a large, poor sharecropper family in Texas. His father deserts them around 1939–40, leaving his mother (Mary Field) barely able to feed her nine children. As the eldest son, Murphy works from an early age to help support his siblings, and when his mother dies in 1941 he becomes head of the family. His brothers and sisters are sent to an elder sister, Corrine, to whom Murphy sends his GI pay allotment.\n\nWhen the US enters World War II, Murphy is eager to enlist, but he is rejected by the Marines, the Navy, and the Army paratroopers due to his small size and youthful appearance. Finally, the Army accepts him as an ordinary infantryman. After basic training and infantry training, Murphy is shipped to the 3rd Infantry Division in North Africa, as a replacement. Because of his youthful looks, he endures jokes about \"infants\" being sent into combat.\n\nMurphy soon proves himself in battle, however, and he is steadily promoted, first against his will, and eventually receives a battlefield commission in the rank of second lieutenant. During his many battles in Sicily, Italy and France, he gains the respect of his men and becomes especially close to fellow soldiers Johnson, a man who claims to be a womanizer, Brandon, a man who ran out on his wife and daughter, Kerrigan a man who jokes at unusual times, Kovak a Polish immigrant who wants to become an American citizen, Swope an native American who smokes cigars a lot, and Valentino who has relatives in Naples.\n\nThe action for which Murphy was awarded the Medal of Honor is depicted near the end of the film. In January 1945, near Holtzwihr, France, Murphy's company is forced to retreat in the face of a fierce German attack. However, Murphy remains behind, at the edge of a forest, to direct artillery fire on the advancing enemy infantry and armor. As the Germans close on his position, Murphy jumps onto an abandoned M4 Sherman tank (he actually performed this action atop an M10 tank destroyer) and uses its .50-caliber machine gun to hold the enemy at bay, even though the vehicle is on fire and may explode at any moment. Although wounded and dangerously exposed to enemy fire, Murphy single-handedly turns back the German attack, thereby saving his company. While the film depicts this action as having taken place in balmy weather and good visibility in rolling terrain, it actually took place in the bitter winter of 1945, at the edge of a forest on the flat Alsatian Plain in conditions of poor visibility. After a period of hospitalization, he is returned to duty. The film concludes with Murphy's Medal of Honor ceremony shortly after the war ends, as Murphy remembers his fellow soldiers who were killed in action.",
  "synopsis": null
}