{
  "imdb_id": "tt4333662",
  "tmdb_id": "324322",
  "douban_id": null,
  "title": "They Will Have to Kill Us First (2015)",
  "genres": [
    "Documentary"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "100 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.7,
  "director": [
    {
      "id": "nm2162785",
      "name": "Johanna Schwartz"
    }
  ],
  "writer": [
    {
      "id": "nm3139341",
      "name": "Andy Morgan",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm7882275",
      "name": "Aliou Touré",
      "character": "Himself - Lead Singer, Songhoy Blues"
    },
    {
      "id": "nm7882277",
      "name": "Oumar Touré",
      "character": "Himself - Guitar, Songhoy Blues"
    },
    {
      "id": "nm7882278",
      "name": "Garba Touré",
      "character": "Himself - Guitar, Songhoy Blues"
    },
    {
      "id": "nm7882279",
      "name": "Nathanael Dembélé",
      "character": "Himself - Drummer, Songhoy Blues"
    },
    {
      "id": "nm7134335",
      "name": "Khaira Arby",
      "character": "Herself - Singer"
    },
    {
      "id": "nm7882276",
      "name": "Fadimata 'Disco' Walett Oumar",
      "character": "Herself - Singer"
    },
    {
      "id": "nm7134333",
      "name": "Moussa Sidi",
      "character": "Himself - Guitarist       (as Moussa Ag Sidi)"
    },
    {
      "id": "nm7882280",
      "name": "Hassan Mehdi",
      "character": "Himself - Former Mouvement National de Liberation de l'Azawad Fighter"
    },
    {
      "id": "nm1132875",
      "name": "Marc-Antoine Moreau",
      "character": "Himself - Music Manager"
    },
    {
      "id": "nm1742649",
      "name": "Nick Zinner",
      "character": "Himself - Guitarist, Yeah Yeah Yeahs"
    },
    {
      "id": "nm7882281",
      "name": "Fadi",
      "character": "Herself - Moussa Ag Sidi's Wife"
    },
    {
      "id": "nm2960369",
      "name": "Tartit",
      "character": "Themselves"
    }
  ],
  "overview": "In 2012, jihadists took control of northern Mali. They imposed one of the strictest interpretations of sharia law in history. On August 12th they banned music - radio stations destroyed, instruments burned and musicians facing torture, even death. Overnight, Mali’s most revered members of society – the musicians – were forced into hiding or exile. This film follows Mali’s musicians as they fight to keep music alive in their country. We witness fierce battles between the army and the jihadists, capture life over borders at refugee camps where money and hope are scarce, follow perilous journeys home to war ravaged cities, and for one band, Songhoy Blues, their path to international stardom.",
  "storyline": "In 2012, jihadists took control of Northern Mali, imposing one of the harshest interpretations of sharia law in recent years and, crucially for Mali, banning music. Radio stations were destroyed, instruments were burned and overnight, Mali's musicians were forced into hiding or exile where many remain even now. Follow these musicians as they fight to keep music alive. Featuring rare footage of the jihadists, a glimpse at life in refugee camps and the perilous journeys home to war-ravaged cities, THEY WILL HAVE TO KILL US FIRST is a tale of courage in the face of conflict as Malian musicians refuse to give up the fight for their right to sing.",
  "plot": "Facing numerous assassination attempts, a Swedish scientist who has invented an anti-gravity device and his daughter seek to provide the invention to the United Kingdom. With James Bond unavailable, H.M. Government provides Agent Charles Vine (Tom Adams), a former mathematician, as a bodyguard and exterminator.",
  "synopsis": "Islamic extremists have banned music in Mali, but its world famous musicians wont give up without a fight. They Will Have To Kill Us First tells the story of Malis musicians, as they fight for their right to sing. With a specially commissioned soundtrack from some of Malis most exciting artists, the film features musicians: Khaira Arby, Fadimata Disco Walet Oumar, Malian superstar Amkoullel, Moussa Sidi and introducing Songhoy Blues.Music is the beating heart of Malian culture, but when Islamic jihadists took control of northern Mali in 2012, they enforced one of the harshest interpretations of sharia law in history: They banned all forms of music. Radio stations were destroyed, instruments burned and Malis musicians faced torture, even death. Overnight, Malians revered musicians were forced into hiding or exile where most remain, even now. But rather than lay down their instruments, the musicians are fighting back, standing up for their cultural heritage and identity. Throughout their struggle, they have used music as their weapon against ongoing violence that has left Mali ravaged.\nThey Will Have to Kill Us First sees musicians on the run, tells the story of the uprising of Touareg separatists, reveals rare footage of the jihadists, captures life at refugee camps where money and hope are scarce, charts perilous journeys home to war-ravaged cities, and follows our characters as they set up and perform at the first public concert in Timbuktu since the music ban."
}