{
  "imdb_id": "tt4360270",
  "tmdb_id": "359371",
  "douban_id": null,
  "title": "Run Free: The True Story of Caballo Blanco (2015)",
  "genres": [
    "Documentary",
    "Biography",
    "Drama",
    "Sport"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "92 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.4,
  "director": [
    {
      "id": "nm4116209",
      "name": "Sterling Noren"
    }
  ],
  "writer": [
    {
      "id": "nm4116209",
      "name": "Sterling Noren",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm7289382",
      "name": "Micah True",
      "character": "Micah True"
    },
    {
      "id": "nm3919484",
      "name": "Christopher McDougall",
      "character": "Christopher McDougall"
    },
    {
      "id": "nm4515375",
      "name": "Scott Jurek",
      "character": "Scott Jurek"
    },
    {
      "id": "nm7289383",
      "name": "Barefoot Ted McDonald",
      "character": "Barefoot Ted McDonald"
    },
    {
      "id": "nm7289384",
      "name": "Luis Escobar",
      "character": "Luis Escobar"
    }
  ],
  "overview": "American ultra running legend Micah True (Caballo Blanco, or the White Horse) lived and ran with the Tarahumara Indians in Northern Mexico. The Tarahumara (also known as the Rarámuri or the Running People) are some of the best long distance runners in the world. This award-winning feature-length documentary chronicles Micah's quest to promote and preserve Tarahumara running tradition by creating a 50-mile foot race known as the Copper Canyon Ultra Marathon, which was portrayed in Christopher McDougall’s best-selling book \"Born to Run – A Hidden Tribe, Super Athletes and the Greatest Race the World Has Never Seen\".",
  "storyline": "Run Free is a movie about Micah True (Caballo Blanco, or the White Horse), an American ultra runner who helped the Tarahumara Indians of Mexico preserve their traditional running culture by creating a 50-mile ultra marathon which combines aspects of traditional Tarahumara running with the ideology of modern ultra running. Micah True and the Copper Canyon Ultra Marathon were subjects in the best-selling book 'Born to Run - A Hidden Tribe, Superathletes & the greatest Race the World has Never Seen' by Christopher McDougall.",
  "plot": null,
  "synopsis": null
}