{
  "imdb_id": "tt4301242",
  "tmdb_id": "336739",
  "douban_id": null,
  "title": "Ghost Rockets (2015)",
  "genres": [
    "Documentary",
    "Adventure",
    "Mystery",
    "Sci-Fi"
  ],
  "country": "Sweden",
  "version": [
    {
      "runtime": "70 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.5,
  "director": [
    {
      "id": "nm3388237",
      "name": "Michael Cavanagh"
    },
    {
      "id": "nm3388633",
      "name": "Kerstin Übelacker"
    }
  ],
  "writer": [
    {
      "id": "nm3388237",
      "name": "Michael Cavanagh",
      "description": "writer"
    },
    {
      "id": "nm3388633",
      "name": "Kerstin Übelacker",
      "description": "writer"
    }
  ],
  "cast": null,
  "overview": "Ghost Rockets centers on human desire to explore and explain the unknown. The film weaves together an ambitious UFO investigation with a personal story that gives a rare insight into the hearts and minds of a UFO-investigator.  Every year, the organization UFO‐Sweden receives numerous reports about inexplicable occurrences ‐ usually dismissed as having to do with the moon, airplanes, satellites or mental instability on the part of the witness. Sometimes, though, they get a report that they are unable to explain, one of them being the story of the ghost rocket.",
  "storyline": "The Ghost Rockets documentary centers on the key premise of curiosity and the universal human desire to explore and explain the unknown. We follow the members of an organization called UFO-Sweden as they attempt to solve a mystery that has baffled even the Swedish government, the Ghost Rockets. The documentary will weave together an ambitious UFO-investigation with a personal story that gives rare insight into the hearts and minds of a UFO-investigator. The Ghost Rockets project includes a fully funded transmedia project that invites the audience to collaborate in an online investigation into a previously classified military archive.",
  "plot": null,
  "synopsis": "Ghost Rockets centers on human desire to explore and explain the unknown. The film weaves together an ambitious UFO investigation with a personal story that gives a rare insight into the hearts and minds of a UFO-investigator.Every year, the organization UFOSweden receives numerous reports about inexplicable occurrences usually dismissed as having to do with the moon, airplanes, satellites or mental instability on the part of the witness. Sometimes, though, they get a report that they are unable to explain, one of them being the story of the ghost rocket. Under the leadership of journalist Clas Svahn, the organisation starts a costly expedition trying to find the strange craft. Its thrilling premise notwithstanding, Ghost rockets is not primarily a film about UFOs. It is a film about enthusiasts with a fervent interest, about an organisation struggling with their finances and shrinking membership numbers, about annual meetings over coffee and pastry, about existential issues debated in the summer night and about our need to believe that the world is bigger than we think."
}