{
  "imdb_id": "tt4365518",
  "tmdb_id": "371463",
  "douban_id": null,
  "title": "Sand Storm (2016)",
  "genres": [
    "Drama"
  ],
  "country": "Israel",
  "version": [
    {
      "runtime": "87 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm1938355",
      "name": "Elite Zexer"
    }
  ],
  "writer": [
    {
      "id": "nm1938355",
      "name": "Elite Zexer",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm7230835",
      "name": "Lamis Ammar",
      "character": "Layla"
    },
    {
      "id": "nm1569162",
      "name": "Ruba Blal",
      "character": "Jalila       (as Ruba Blal-Asfour)"
    },
    {
      "id": "nm5674975",
      "name": "Hitham Omari",
      "character": "Suliman       (as Haitham Omari)"
    },
    {
      "id": "nm7766289",
      "name": "Khadija Al Akel",
      "character": "Tasnim       (as Khadija Alakel)"
    },
    {
      "id": "nm6582066",
      "name": "Jalal Masrwa",
      "character": "Anwar       (as Jalal Masarwa)"
    },
    {
      "id": "nm8926048",
      "name": "Elham Araf",
      "character": "(as Elham Arraf)"
    },
    {
      "id": "nm8369605",
      "name": "Shaden Kanboura",
      "character": "Alakel"
    },
    {
      "id": "nm10179006",
      "name": "May Azliah",
      "character": ""
    },
    {
      "id": "nm8785647",
      "name": "Omar El Nasasreh",
      "character": "Munir"
    }
  ],
  "overview": "A Bedouin village in Northern Israel. When Jalila's husband marries a second woman, Jalila and her daughter's world is shattered, and the women are torn between their commitment to the patriarchal rules and being true to themselves.",
  "storyline": "Desert noon in a Bedouin village in Southern Israel. Jalila is hosting an awkward celebration - the marriage of her husband to a second, much younger wife - while trying to conceal the insult that boils inside her. Her daughter Layla is preoccupied with a different matter. Her secret, strictly forbidden, love affair with Anuar was just unveiled by her mother. Jalila believes that the world is harsh and cruel, and the only way to win - is to keep your mouth shut, your head as high as possible without raising too much attention, and struggle from inside the limits of the traditional world surrounding you. Layla believes that there are no limits to the world surrounding her. Everything can be hers if she only wished hard enough. But, as the story unfolds, they each fail in her individual battle. Their whole family falls apart and everything they believe in shatters. Now, the two women are forced to understand that, if they wish to survive, they will have to start seeing the world from ...",
  "plot": null,
  "synopsis": null
}