{
  "imdb_id": "tt4300480",
  "tmdb_id": "375572",
  "douban_id": null,
  "title": "Italian Race (2016)",
  "genres": [
    "Drama",
    "Sport"
  ],
  "country": "Italy",
  "version": [
    {
      "runtime": "118 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.5,
  "director": [
    {
      "id": "nm2100536",
      "name": "Matteo Rovere"
    }
  ],
  "writer": [
    {
      "id": "nm2100536",
      "name": "Matteo Rovere",
      "description": "story"
    },
    {
      "id": "nm2100536",
      "name": "Matteo Rovere",
      "description": "screenplay and"
    },
    {
      "id": "nm2738907",
      "name": "Filippo Gravino",
      "description": "screenplay and"
    },
    {
      "id": "nm3812261",
      "name": "Francesca Manieri",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0009629",
      "name": "Stefano Accorsi",
      "character": "Loris"
    },
    {
      "id": "nm7006860",
      "name": "Matilda De Angelis",
      "character": "Giulia"
    },
    {
      "id": "nm0337220",
      "name": "Paolo Graziosi",
      "character": "Tonino"
    },
    {
      "id": "nm0320232",
      "name": "Lorenzo Gioielli",
      "character": "Ettore Minotti"
    },
    {
      "id": "nm3642867",
      "name": "Roberta Mattei",
      "character": "Annarella"
    },
    {
      "id": "nm9028199",
      "name": "Giulio Pugnaghi",
      "character": "Nico"
    },
    {
      "id": "nm2134645",
      "name": "Luca Bondioli",
      "character": "Pusher"
    },
    {
      "id": "nm3413749",
      "name": "Pier Paolo Paganelli",
      "character": "Novo"
    },
    {
      "id": "nm10601957",
      "name": "Mario Gatti",
      "character": "Pino"
    },
    {
      "id": "nm10601958",
      "name": "Mauro Onali",
      "character": "Pino"
    },
    {
      "id": "nm10601959",
      "name": "Brian Lombardi",
      "character": "Michele"
    },
    {
      "id": "nm10601960",
      "name": "Jacopo Volta",
      "character": "Giulio"
    },
    {
      "id": "nm10601961",
      "name": "Andrea Kimi Antonelli",
      "character": "Matteo"
    },
    {
      "id": "nm1001515",
      "name": "Alexia Murray",
      "character": "Flavia"
    },
    {
      "id": "nm0818821",
      "name": "Cristina Spina",
      "character": "Assistente Sociale"
    },
    {
      "id": "nm9034613",
      "name": "Giuseppe Gaiani",
      "character": "Mario De Martino"
    },
    {
      "id": "nm2504846",
      "name": "Federico Mutti",
      "character": "Pilota"
    },
    {
      "id": "nm2496647",
      "name": "Laura Mazzi",
      "character": "Preside"
    },
    {
      "id": "nm5033727",
      "name": "Mariangela Granelli",
      "character": "Madre Nicola"
    },
    {
      "id": "nm2557969",
      "name": "Rinat Khismatouline",
      "character": "Rinat"
    },
    {
      "id": "nm4043903",
      "name": "Tatiana Luter",
      "character": "Eva"
    },
    {
      "id": "nm2043905",
      "name": "Lorenzo Patané",
      "character": "Jim"
    },
    {
      "id": "nm0280675",
      "name": "Davide Dal Fiume",
      "character": "Commissario Gara"
    },
    {
      "id": "nm6023561",
      "name": "Patrizia Bollini",
      "character": "Infermiera"
    },
    {
      "id": "nm0053539",
      "name": "Franco Barbero",
      "character": "Ezio"
    },
    {
      "id": "nm1035456",
      "name": "Claudio Guain",
      "character": "Custode Cimitero"
    },
    {
      "id": "nm3732071",
      "name": "Giuseppe Tafuri",
      "character": "Operaio Cimitero"
    },
    {
      "id": "nm10601962",
      "name": "Massimo La Pina",
      "character": "Team Antonelli"
    },
    {
      "id": "nm10601963",
      "name": "Davide Bandiera",
      "character": "Team Antonelli"
    },
    {
      "id": "nm10601964",
      "name": "Luca Marchesini",
      "character": "Team Antonelli"
    },
    {
      "id": "nm10601965",
      "name": "Giampaolo Meletti",
      "character": "Meccanico"
    },
    {
      "id": "nm10601966",
      "name": "Alessandro Piombo",
      "character": "Ingegnere Turbo 16"
    },
    {
      "id": "nm10601967",
      "name": "Stefano Reali",
      "character": "Speaker       (voice)"
    }
  ],
  "overview": "Giulia De Martino is a pilot. At seventeen she partecipates in the GT Championship, under the guidance of her father Mario. But one day everything changes and Giulia has to face alone both the track and her own life.",
  "storyline": "Giulia is a young promise of GT racing. When her life falls apart, her only hope is her brother, a drug addict and former rally champion.",
  "plot": "In AD 26, Judah Ben-Hur (Charlton Heston) is a wealthy prince and merchant in Jerusalem, who lives with his mother, Miriam (Martha Scott); his sister, Tirzah (Cathy O'Donnell); their loyal slave, Simonides (Sam Jaffe) and his daughter, Esther (Haya Harareet). Esther loves Judah but is committed to another. Judah's childhood friend, the Roman citizen Messala (Stephen Boyd), is now a tribune. After several years away from Jerusalem, Messala returns as the new commander of the Roman garrison. Messala believes in the glory of Rome and its imperial power, while Judah is devoted to his faith and the freedom of the Jewish people. This difference causes tension between the friends, and results in their split after Messala issues an ultimatum to Judah.\nCharlton Heston as Judah Ben-Hur\nDuring the parade for the new governor of Judea, Valerius Gratus, loose tiles fall from the roof of Judah's house. Gratus is thrown from his spooked horse and nearly killed. Although Messala knows this was an accident, he condemns Judah to the galleys and imprisons Miriam and Tirzah. By punishing a known friend and prominent citizen, he hopes to intimidate the Jewish populace. Judah swears to take revenge.\n\nAfter three years as a galley slave, Judah is assigned to the flagship of the Roman Consul Quintus Arrius (Jack Hawkins), who has been charged with destroying a fleet of Macedonian pirates. Arrius admires Judah's determination and self-discipline and offers to train him as a gladiator or charioteer. Judah declines the offer, declaring that God will aid him in his quest for vengeance. When the Roman fleet encounters the Macedonians, Arrius orders all the rowers except Judah to be chained to their oars. Arrius' galley is rammed and sunk, but Judah unchains the other rowers, and rescues Arrius. In despair, Arrius wrongly believes the battle ended in defeat and attempts to atone in the Roman way by \"falling on his sword\", but Judah stops him. They are rescued, and Arrius is credited with the Roman fleet's victory.\n\nArrius successfully petitions Emperor Tiberius (George Relph) to free Judah, and adopts him as his son. Another year passes. Wealthy again, Judah learns Roman ways and becomes a champion charioteer, but still longs for his family and homeland.\nHugh Griffith as Arab Sheik Ilderim\nJudah returns to Judea. Along the way, he meets Balthasar (Finlay Currie) and an Arab, Sheik Ilderim (Hugh Griffith). The sheik has heard of Judah's prowess as a charioteer, and asks him to drive his quadriga in a race before the new Judean governor Pontius Pilate (Frank Thring). Judah declines, even after he learns that Messala will also compete.\n\nJudah returns to his home in Jerusalem. He meets Esther, and learns her arranged marriage did not occur and that she is still in love with him. He visits Messala and demands his mother and sister's freedom. The Romans discover that Miriam and Tirzah contracted leprosy in prison, and expel them from the city. The women beg Esther to conceal their condition from Judah so that he may remember them as they were before, so she tells him that they died. It is then that he changes his mind and decides to seek vengeance on Messala by competing against him in the chariot race.\n\nDuring the chariot race, Messala drives a Greek chariot with blades on the hubs to tear apart competing vehicles; he attempts to destroy Judah's chariot but destroys his own instead. Messala is fatally injured, while Judah wins the race. Before dying, Messala tells Judah that \"the race is not over\" and that he can find his family \"in the Valley of the Lepers, if you can recognize them.\" Judah visits the nearby leper colony, where (hidden from their view) he sees his mother and sister.\n\nBlaming Roman rule for his family's fate, Judah rejects his patrimony and Roman citizenship. Learning that Tirzah is dying, Judah and Esther take her and Miriam to see Jesus Christ (Claude Heater), but the trial of Jesus before Pontius Pilate has begun. Judah witnesses the crucifixion of Jesus, and Miriam and Tirzah are miraculously healed during the rainstorm following the crucifixion. Judah declares, \"And I felt His voice take the sword out of my hand.\"",
  "synopsis": null
}