{
  "imdb_id": "tt4379728",
  "tmdb_id": "373922",
  "douban_id": "26235349",
  "title": "Three (2016)",
  "genres": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "country": "Hong Kong",
  "version": [
    {
      "runtime": "88 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm0864775",
      "name": "Johnnie To"
    }
  ],
  "writer": [
    {
      "id": "nm1210118",
      "name": "Ho Leung Lau",
      "description": "screenplay"
    },
    {
      "id": "nm4273743",
      "name": "Tin Shu Mak",
      "description": "screenplay"
    },
    {
      "id": "nm0946883",
      "name": "Nai-Hoi Yau",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0955505",
      "name": "Wei Zhao",
      "character": "Dr. Tong Qian"
    },
    {
      "id": "nm0465503",
      "name": "Louis Koo",
      "character": "Chief inspector Ken"
    },
    {
      "id": "nm7324058",
      "name": "Kathy Wu",
      "character": "Nurse"
    },
    {
      "id": "nm0161308",
      "name": "Wallace Chung",
      "character": "Shun"
    },
    {
      "id": "nm0482695",
      "name": "Suet Lam",
      "character": "Fatty"
    },
    {
      "id": "nm0874864",
      "name": "Michael Tse",
      "character": "Whistling Gangster"
    },
    {
      "id": "nm5669066",
      "name": "Jonathan Wong Chee Hynn",
      "character": "He Jianzhuang       (as Jonathan Wong)"
    },
    {
      "id": "nm8121028",
      "name": "Adrian Wong",
      "character": "Nurse"
    },
    {
      "id": "nm0156567",
      "name": "Siu-Fai Cheung",
      "character": "Dr. Fok"
    },
    {
      "id": "nm1319395",
      "name": "Hoi-Pang Lo",
      "character": "Chung"
    },
    {
      "id": "nm0376985",
      "name": "Benjamin Yeung",
      "character": "Radiologist"
    },
    {
      "id": "nm9265716",
      "name": "Zhenhui Li",
      "character": ""
    }
  ],
  "overview": "Realising that he will be defeated in no time during a police showdown, a thug shoots himself to force the cops to cease fire and take him to the hospital. In the hospital, he claims human rights to refuse immediate treatment in order to bide time for his underlings to rescue him. The detective in charge sees through his scheme but decides to play along so as to capture his whole gang once and for all.",
  "storyline": "Realizing that he will be defeated in no time during a police showdown, a thug shoots himself to force the cops to cease fire and take him to the hospital. In the hospital, he claims human rights to refuse immediate treatment in order to bide time for his underlings to rescue him. The detective in charge sees through his scheme but decides to play along so as to capture his whole gang once and for all.",
  "plot": "Harvard University professor Robert Langdon (Tom Hanks) awakens in a hospital room in Florence, Italy, with no memory of what has transpired over the last few days, but being plagued with visions of a scorched Earth. Dr. Sienna Brooks (Felicity Jones), one of the doctors tending to him, reveals that he is suffering from amnesia as a result of a bullet wound to the head. Another doctor says the police are there to question Langdon but the officer turns out to be Vayentha (Ana Ularu), an assassin, who shoots another doctor while heading down the hall towards Langdon's room. Sienna helps Langdon to escape, and they flee to her apartment.\n\nAmong Langdon's personal belongings, Langdon and Sienna find a \"Faraday pointer\", a miniature image projector with a modified version of Sandro Botticelli's Map of Hell, which itself is based on Dante's Inferno. They soon realize this is the first clue in a trail left by Bertrand Zobrist (Ben Foster), a billionaire geneticist who believed that rigorous measures were necessary to reduce the Earth's growing population, and who committed suicide after being chased by armed government agents.\n\nLangdon and Sienna figure out that Zobrist, who is obsessed with Dante, has created a virus he has dubbed \"Inferno\", with the potential of halving the world's population. In the meantime, they have been traced by both Vayentha and agents from the World Health Organization (WHO), who raid the apartment, forcing them to flee again. Langdon's knowledge of Dante's work and history, and of hidden passages in Florence, allows the two to follow clues such as letters and phrases which lead to various locations in Florence and Venice, while evading the assassin and WHO. Along the way, Langdon discovers that he stole and hid the Dante Death Mask, a crucial clue, an event he also does not remember.\n\nVayentha reports to her employer Harry Sims (Irrfan Khan), the CEO of a private security company called \"The Consortium\", who is acting on behalf of Zobrist. The WHO agents are headed by Elizabeth Sinskey (Sidse Babett Knudsen), an old lover of Langdon's, and are trying to prevent the release of the virus. Zobrist has provided Sims with a video message about the virus, to be broadcast after it has been released. Shocked by its content, Sims allies with Sinskey to prevent the outbreak. However, Langdon and Sienna are contacted by Christoph Bouchard (Omar Sy), a man purporting to be working for WHO, warning them that Sinskey has a double agenda and is after the Inferno virus for her own profit. The three cooperate for a while, until Langdon realizes that Bouchard is lying and seeking to profit from Inferno himself, forcing the duo to flee on their own again.\n\nLangdon figures out that the virus is in the Hagia Sophia in Istanbul. With that knowledge, Sienna abandons Langdon, revealing that she was Zobrist's lover and that she will ensure the release of the virus. Zobrist and Sienna used to play treasure hunt games; this trail was the backup plan in case something happened to Zobrist. Langdon is recaptured by Bouchard, but is rescued by Sims and re-teams with Sinskey, who asked him for help in interpreting the imagery from the Faraday pointer. Sims reveals he was hired by Sienna to kidnap Langdon when Zobrist had been killed, and drugged with benzodiazepine to induce a memory loss; the events in the hospital were all staged.\n\nThey realize the virus is in a plastic bag hidden under water in the Basilica Cistern in Istanbul. The WHO team–along with Langdon, Sims, and Sinskey–race to locate and secure the bag, while Sienna and her allies attempt to detonate an explosive that will rupture the bag and aerosolize the virus. Sims is killed by Sienna, and when Langdon confronts her, she commits suicide in an attempt to release the virus. The detonation is able to rupture the bag but because it was already contained in a special containment unit, the virus was secured in time and Sienna's enforcers are killed. The virus is then taken by WHO, and Langdon goes back to Florence in order to return the Dante Death Mask.",
  "synopsis": null
}