{
  "imdb_id": "tt4361050",
  "tmdb_id": "335796",
  "douban_id": "26602794",
  "title": "Ouija: Origin of Evil (2016)",
  "genres": [
    "Drama",
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "99 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm1093039",
      "name": "Mike Flanagan"
    }
  ],
  "writer": [
    {
      "id": "nm1093039",
      "name": "Mike Flanagan",
      "description": "written by &"
    },
    {
      "id": "nm3670452",
      "name": "Jeff Howard",
      "description": "written by"
    },
    {
      "id": "nm0925482",
      "name": "Stiles White",
      "description": "characters"
    },
    {
      "id": "nm1340000",
      "name": "Juliet Snowden",
      "description": "characters"
    }
  ],
  "cast": [
    {
      "id": "nm2399383",
      "name": "Annalise Basso",
      "character": "Lina Zander"
    },
    {
      "id": "nm0714147",
      "name": "Elizabeth Reaser",
      "character": "Alice Zander"
    },
    {
      "id": "nm5157662",
      "name": "Lulu Wilson",
      "character": "Doris Zander"
    },
    {
      "id": "nm0001794",
      "name": "Henry Thomas",
      "character": "Father Tom"
    },
    {
      "id": "nm3915884",
      "name": "Parker Mack",
      "character": "Mikey"
    },
    {
      "id": "nm3977272",
      "name": "Halle Charlton",
      "character": "Ellie"
    },
    {
      "id": "nm5359536",
      "name": "Alexis G. Zall",
      "character": "Betty"
    },
    {
      "id": "nm0427964",
      "name": "Doug Jones",
      "character": "Ghoul Marcus"
    },
    {
      "id": "nm2318089",
      "name": "Kate Siegel",
      "character": "Jenny Browning"
    },
    {
      "id": "nm0027402",
      "name": "Sam Anderson",
      "character": "Mr. Browning"
    },
    {
      "id": "nm3748393",
      "name": "Chelsea Gonzalez",
      "character": "Gloria"
    },
    {
      "id": "nm5576756",
      "name": "Lincoln Melcher",
      "character": "Jack"
    },
    {
      "id": "nm5938574",
      "name": "Nicholas Keenan",
      "character": "Walter"
    },
    {
      "id": "nm0915919",
      "name": "Michael Weaver",
      "character": "Roger Zander"
    },
    {
      "id": "nm0444185",
      "name": "Ele Keats",
      "character": "Ellie's Mom"
    },
    {
      "id": "nm0072126",
      "name": "Eve Gordon",
      "character": "Joan"
    },
    {
      "id": "nm7294611",
      "name": "Chad Heffelfinger",
      "character": "Male Ghoul"
    },
    {
      "id": "nm3201318",
      "name": "Nina Mansker",
      "character": "Female Ghoul"
    },
    {
      "id": "nm0698763",
      "name": "John Prosky",
      "character": "Doctor Fuller"
    },
    {
      "id": "nm0005417",
      "name": "Lin Shaye",
      "character": "Lina Zander (2013)"
    }
  ],
  "overview": "In 1965 Los Angeles, a widowed mother and her two daughters add a new stunt to bolster their séance scam business and unwittingly invite authentic evil into their home. When the youngest daughter is overtaken by the merciless spirit, this small family confronts unthinkable fears to save her and send her possessor back to the other side.",
  "storyline": "In 1967 Los Angeles, a young widow named Alice Zander works out of her suburban home as a spiritual medium, accompanied by her daughters, 15-year-old Paulina \"Lina\" and 9-year old Doris. The family is still reeling over the recent death of Roger, Alice's husband and the kids' father. At Lina's suggestion, Alice incorporates a Ouija board into her readings. While trying out the board, she unknowingly contacts a spirit named Marcus that begins to possess Doris. Alice receives a notice that the bank intends to foreclose on their home. Doris contacts the board for help, believing she is communicating with her dead father. The spirit leads her to a secret compartment behind the basement wall containing a pouch of cash. When she gives the money to her mother, the family has an Ouija session, believing they can contact Roger. When the board answers a question only Roger would know the answer to, a thrilled Alice begins believing that they are in contact with her dead husband..",
  "plot": "Set in 1967 Los Angeles, a widow named Alice Zander works out of her suburban home as a spiritual medium, accompanied by her daughters, 15-year-old Paulina \"Lina\" and 9-year old Doris; although they stage their seances, Alice's real intent is to help people move on. The family is still reeling over the recent death of Roger, Alice's husband and the kids' father. After Lina suggests that Alice incorporate a Ouija board into her readings, Alice does so, and unknowingly contacts a spirit named Marcus that begins to possess Doris. This is breaking one of the three rules: never play alone, never play in a graveyard, and always say goodbye.\n\nAlice receives a foreclosure note, meaning they may lose their house. Doris contacts the board for help, believing she is communicating with her dead father, and the spirit leads her to a secret compartment behind the basement wall containing a pouch of cash. Doris, breaking another of the three rules, forgets to say goodbye to the spirits. When she gives the money to her mother, the family has a Ouija session, believing they can contact Roger. When the board answers a question only Roger would know the answer to, a thrilled Alice begins believing that they are in contact with her dead husband.\n\nSoon, Doris becomes possessed by a shadowy spirit. Lina, who is becoming disturbed by the changes in her sister, finds papers written by Doris in fluent Polish, a language she does not know, and brings them to Father Tom to translate. Troubled, Father Tom visits them for a Ouija session under the pretense of contacting his dead wife Gloria. Although the session appears to be successful, Father Tom later explains to Alice and Lina that Doris did not contact Gloria. Instead, for every question he asked, she read his thoughts and repeated the answers he was thinking in his mind. He reveals that the pages are entries written by a Polish immigrant named Marcus, who was taken captive during World War II by a sadistic doctor who conducted experiments on him and other captives inside the house's basement. These spirits knew answers that only Roger would know because they have been watching the family since the day they moved in.\n\nMeanwhile, Doris kills Lina's boyfriend Mikey and she hangs his body. Upon seeing this, Father Tom, Alice, and Lina burn the Ouija board downstairs. When Father Tom discovers skeletal remains in the basement wall, they realize that they have been using the Ouija board in a graveyard all this time. Father Tom finds the secret room where the experiments were conducted, and is possessed by the spirits. He attacks Alice and Lina, but momentarily seizes clarity, only to be killed by Doris. Alice is captured, while Roger's spirit carries an unconscious Lina to her bed. Lina wakes up and recalls an earlier moment where her doll's mouth was stitched by her father's spirit \"to shut out the voices\", realizing that she must sew Doris' mouth shut to quiet the spirits' voices and stop the evil. During the struggle, she successfully sews Doris' mouth shut and Doris dies, reuniting with her father. After this, Lina is temporarily possessed and stabs Alice. While dying, Alice sees Roger and Doris together, and happily joins them, leaving behind a sobbing Lina.\n\nTwo months later, Lina remains committed in a mental hospital for the suspected murder of her mother. She is interviewed by a doctor and is unable to say what happened to Doris' body, but states that she, Lina, will never be alone again. She tries summoning her sister inside her cell and the doctor watches, unbeknownst that the possessed Doris skitters across the ceiling towards him. In a post-credits scene set in the present, a now elderly Lina remains in the asylum and receives a visit from someone claiming to be her niece.",
  "synopsis": "Los Angeles, 1967Mr. Browning (Sam Anderson) and his younger wife Jenny (Kate Siegel) are at the home of Alice Zander (Elizabeth Reaser), a fortune teller. Alice gathers the couple around a table for a seance. Mr. Browning wants to speak to his deceased wife and ask her questions. Jenny isn't convinced and thinks they're getting ripped off. When Mr. Browning asks about giving money to Jenny, something that supposedly represents his dead wife's spirit creeps behind the curtains and lunges out toward them. Mr. Browning is frightened beyond belief. He attempts to pay Alice, but she declines out of guilt.The spirit is actually Alice's teenage daughter Paulina (Annalise Basso), while her younger daughter Doris (Lulu Wilson) was hiding to create the effects of candles blowing out. Alice scolds Lina for scaring Mr. Browning and costing them their pay, but Lina defends her actions because she thinks Jenny was a bitch. Alice agrees.Lina sneaks out at night to go to her friend Ellie's (Halle Charlton) house. The two of them, plus Lina's boyfriend Mikey (Parker Mack) and other friend Betty (Alexis G. Zall) play with a Ouija board game. They try to contact a spirit, which creeps the hell out of Betty. Ellie's mom bursts through the door, making Betty scream. Alice later picks up Lina, upset with her.While the girls are at school, Alice goes to find a Ouija board of her own after Lina suggests it could be good for business. At night, Alice uses the board and unknowingly makes contact with a spirit named Marcus, who speaks through Doris. Doris responds to Alice's questions, to Lina's confusion.Doris uses the Ouija board on her own - despite the first rule of the game being not to play alone - in the hopes of making contact with her dead father Roger (Michael Weaver).At school, Father Tom (Henry Thomas) calls Alice in to review Doris's homework. It's all written in cursive, despite no one having knowledge of Doris ever learning how to write like that.Alice and the girls return home to find a notice of foreclosure on their door. Doris returns with a pouch full of money that she claims Roger told her about. She shows her mom and sister a space in the basement wall that contained the money. Later, Doris shows Alice and Lina how she communicated with Roger. To their astonishment, the planchette moves on its own when Alice asks the spirit where Roger was when she told him she was pregnant with Lina. The planchette moves around to spell \"SHOWER\". When Alice asks if Roger is really there, it moves to YES. The girls look through the planchette lens to see if they spot anything, but Lina is too freaked out to keep looking.Alice starts to keep Doris home from school to work with her. Using the Ouija board, they have been generating more business, as customers are convinced with Doris speaking in voices that aren't hers and is answering questions only the deceased would know. Doris later starts to experience a pain in the back of her neck. After Lina gives her medicine, Doris looks through the planchette in the mirror and sees a tall, black spirit with its mouth sewn shut. Doris screams, and the spirit sticks its arm down her mouth as it possesses her.Alice goes out with Father Tom for the night while Lina has Mikey come over as Doris watches TV. Tom chooses not to pursue other relationships after his wife's passing, as well as to keep with his faith. Lina and Mikey spend a brief time together and only kiss before she kicks him out. As Mikey is leaving, Doris startles him as she appears out of nowhere. She then starts to describe being strangled to death in graphic and disturbing detail.Lina brings a bunch of papers written by Doris to Tom at school. They are written in Polish, and Tom says he knows someone at the school who can translate them for her.In the schoolyard, two boys that make fun of Doris are sitting on a bench when one of them aims his slingshot at her head. Doris turns around and stares the bully down and causes the kid to strike himself in the face.Lina finds one of her dolls has what look like stitches drawn onto its mouth. She confronts Doris about it, but Doris claims it was their dad that did it to \"stop the voices\".Tom visits the Zanders for a seance with Alice and Doris. He tries to have them make contact with his deceased wife Gloria. He asks what Gloria's middle name was. The planchette moves around to spell Lynn. It then moves around to indicate a fight that happened between them that Gloria forgives Tom for. Doris also makes a voice that sounds like a grown woman. Tom then brings Alice and Lina upstairs to tell them that Gloria's real middle name was Catherine, and that he tried to manipulate the entity into doing what it did. He then explains to the ladies what Doris wrote in her letters - it's a journal entry from Marcus about a man they called the \"Death Doctor\", who tortured people in that house with his experiments.Mikey shows up downstairs for Lina, and Doris greets him. She takes him to the basement to show him something \"cool\". He sticks his hand in the spot where the money was found. A mouthless skull pops out. Doris's eyes go demonic and she starts rapidly whispering something into Mikey's ear. Alice, Lina, and Tom go downstairs and see Mikey's body drop with a noose around his neck. Lina freaks out, but Alice tells her to calm down and find Doris.The three take the Ouija board downstairs to burn it in the furnace. They discover the skull, as well as other bones from the people described in the journals, which means they were playing in a graveyard this whole time (which is against rule #2). The phonograph in the basement turns on, and they hear Doris screaming. Tom crawls through a vent and finds Doris. She attacks him with supernatural force and causes him to break his neck as he is flown down the stairs.Upstairs, Alice and Lina find the Ouija board intact on the table. Alice is grabbed by an unseen force, while Mikey's corpse swings by and grabs Doris, throwing her to the stairs. Doris appears and starts whispering things into Lina's ear. Alice pleads with the spirits to take her instead of her daughters. The voices say they'll take all of them.Lina is pulled into her bedroom the day she confronted Doris about her doll. She sees her father and understands now what Doris meant by \"stopping the voices\".Alice is being dragged in the basement. Lina faces off Doris and the spirits. The spirits try pulling Lina away as she reluctantly sews Doris's mouth shut. When she is done, Doris appears normal and wakes up. She is pulled up by Roger. In reality, Alice and Lina cry over Doris's body. Lina is momentarily possessed and she stabs Alice. When she reverts to normal, she tearfully begs her mother for forgiveness, but Alice says she knows it wasn't her. She sees Roger and Doris standing behind Lina before she dies.Two months later, Lina is in a mental hospital talking to Dr. Fuller (John Prosky) about what happened to Doris's body. In her room, Lina makes her own Ouija board on the floor with her blood and an eyeglass to contact Doris. Fuller passes by Lina's room and sees what looks like Lina and Doris sitting next to each other on the bed. When he turns to look back, he just sees Lina staring at him. He doesn't see Doris running on the ceiling toward him...After the credits, we see an old Lina (Lin Shaye) in her room as she is told someone claiming to be her niece is there to see her (just like the first movie)."
}