{
  "imdb_id": "tt4372390",
  "tmdb_id": "356500",
  "douban_id": null,
  "title": "Detour (2016)",
  "genres": [
    "Action",
    "Thriller"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm1247462",
      "name": "Christopher Smith"
    }
  ],
  "writer": [
    {
      "id": "nm1247462",
      "name": "Christopher Smith",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4446467",
      "name": "Tye Sheridan",
      "character": "Harper James"
    },
    {
      "id": "nm2525790",
      "name": "Bel Powley",
      "character": "Cherry"
    },
    {
      "id": "nm1710309",
      "name": "Emory Cohen",
      "character": "Johnny Ray"
    },
    {
      "id": "nm0001487",
      "name": "John Lynch",
      "character": "Frank"
    },
    {
      "id": "nm0610459",
      "name": "Stephen Moyer",
      "character": "Vincent Reed"
    },
    {
      "id": "nm1782153",
      "name": "Gbenga Akinnagbe",
      "character": "Officer Mike Andrews"
    },
    {
      "id": "nm4245462",
      "name": "Jared Abrahamson",
      "character": "Paul"
    },
    {
      "id": "nm6868308",
      "name": "Reine Swart",
      "character": "Claire (waitress)"
    },
    {
      "id": "nm0095930",
      "name": "Nick Boraine",
      "character": "Lecturer"
    },
    {
      "id": "nm1824509",
      "name": "Deon Lotz",
      "character": "Mr. Parfitt"
    },
    {
      "id": "nm0449044",
      "name": "Danny Keogh",
      "character": "Business Man"
    },
    {
      "id": "nm3116102",
      "name": "Tamer Burjaq",
      "character": "Ralph"
    },
    {
      "id": "nm1978748",
      "name": "Joe Vaz",
      "character": "Barman"
    },
    {
      "id": "nm5972429",
      "name": "Michael Bundred",
      "character": "Car Hire Man"
    },
    {
      "id": "nm3662636",
      "name": "Francis Chouler",
      "character": "Las Vegas Policeman"
    },
    {
      "id": "nm4007984",
      "name": "Dylan Edy",
      "character": "Johnny's Friend #2"
    },
    {
      "id": "nm2674546",
      "name": "Daniel Fox",
      "character": "Officer Stanwyck"
    },
    {
      "id": "nm3688478",
      "name": "Chi Mhende",
      "character": "Hospital Receptionist       (voice)"
    },
    {
      "id": "nm4479052",
      "name": "Sibongile Mlambo",
      "character": "Hotel Receptionist"
    },
    {
      "id": "nm3797176",
      "name": "Nic Rasenti",
      "character": "Johnny's friend #1"
    },
    {
      "id": "nm3089615",
      "name": "Jenna Saras",
      "character": "Hotel Bar Woman"
    },
    {
      "id": "nm9243794",
      "name": "Loulou Taylor",
      "character": "Bank Teller"
    },
    {
      "id": "nm0916645",
      "name": "Kal Weber",
      "character": "Dr. Ulmer       (voice)"
    }
  ],
  "overview": "A young law student who, while grieving for his dying mother, struggles to decide whether he should kill his unfaithful step-father.",
  "storyline": "Law student and all round good guy, Harper, suspects that his scheming step-father, Vincent, is responsible for the car crash that sent his mother into a coma. Drowning his sorrows one evening in a seedy L.A whiskey bar, Harper is interrupted by a tough looking redneck called Johnny Ray who offers to 'take care' of his step-dad for the cool sum of US$20,000. Angry, intent on revenge and fuelled by alcohol, Harper agrees to the deal and spends the rest of his evening downing shots with Johnny Ray. The next morning, Harper awakes to the mother of all hangovers with hazy memory of the previous night's events. Answering a knock at the front door, he is surprised to find Johnny Ray and his beautiful but distant girlfriend, Cherry, ready and waiting to drive to Vegas to kill Vincent. Harper's claims that he was drunk and didn't know what he was doing mean nothing to Johnny Ray who is more threatening than ever in the cold light of day. Harper quickly realises that there is no easy way out; ...",
  "plot": "Piano player Al Roberts (Tom Neal) is drinking coffee at a roadside diner in Reno, hitchhiking east from California, when a fellow patron plays a song on the jukebox that reminds him of his former life in New York City. At the time, Al was bitter about squandering his talent working in a cheap nightclub. After his girlfriend Sue Harvey (Claudia Drake), the nightclub vocalist, leaves to seek fame in Hollywood, he decides to go to California and marry her. With little money, he is forced to hitchhike his way across the country.\n\nIn Arizona, bookie Charles Haskell, Jr. (Edmund MacDonald) gives Al a ride in his convertible and tells him that he's in luck: he's driving all the way from Florida to Los Angeles to place a bet on a horse. During the drive, he has Al pass him pills several times. That night, Al is driving while Haskell sleeps. When a rainstorm forces Al to pull over to put up the top, he is unable to rouse Haskell. Al opens the passenger-side door and Haskell falls out, striking his head on a rock. Al then realizes the bookie is dead. Fearful that the police will believe he killed Haskell, Al drags the body off the road, takes the dead man's money, clothes, and identification, and drives away.\n\nAfter spending the night in a California motel, Al decides to drive to an urban area and ditch the car. At a gas station, he picks up another hitchhiker, Vera (Ann Savage). After some time, she suddenly asks him what he did with the real owner of the car. It turns out she had been picked up by Haskell in Louisiana; she scratched him and got out in Arizona after he tried to become too friendly. Al claims to be Haskell, but she calls his bluff and blackmails him by threatening to turn him in. She tells him that they should sell the car rather than abandon it.\n\nIn Hollywood, they rent an apartment, posing as Mr. and Mrs. Haskell to provide an address when they sell the car. However, Vera learns from a newspaper that Haskell's wealthy father is near death and looking for his son, who ran away as a youth after accidentally injuring his friend. Vera demands that Al impersonate Haskell as soon as the father dies, but Al balks at this notion, pointing out that he knows next to nothing about either man.\n\nBack at the apartment, Vera gets drunk and they begin arguing. She threatens to call the police, running into the bedroom with the telephone and locking the door. She falls into a stupor on the bed with the telephone cord tangled around her neck. Al pulls on the cord in an effort to break it. When he finally breaks down the door, he sees that he has accidentally strangled her. He gives up ever seeing his girlfriend Sue again and returns to hitchhiking instead, imagining his probable future arrest by the police.\nAnn Savage and Tom Neal.",
  "synopsis": null
}