{
  "imdb_id": "tt4332114",
  "tmdb_id": "320024",
  "douban_id": null,
  "title": "Dolly Ki Doli (2015)",
  "genres": [
    "Comedy",
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "98 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.6,
  "director": [
    {
      "id": "nm5581835",
      "name": "Abhishek Dogra"
    }
  ],
  "writer": [
    {
      "id": "nm5581835",
      "name": "Abhishek Dogra",
      "description": null
    },
    {
      "id": "nm7035720",
      "name": "Uma Shankar Singh",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0037019",
      "name": "Malaika Arora",
      "character": "Dancer"
    },
    {
      "id": "nm6093848",
      "name": "Karan Ashar",
      "character": "Gujarati guy in Title Track"
    },
    {
      "id": "nm4269474",
      "name": "Mohammed Zeeshan Ayyub",
      "character": ""
    },
    {
      "id": "nm4113243",
      "name": "Karim Hajee",
      "character": "Dulha"
    },
    {
      "id": "nm2240044",
      "name": "Brijendra Kala",
      "character": "Sub Inspector Khan"
    },
    {
      "id": "nm2128238",
      "name": "Sonam Kapoor",
      "character": "Dolly"
    },
    {
      "id": "nm0451307",
      "name": "Saif Ali Khan",
      "character": "Cameo"
    },
    {
      "id": "nm8733776",
      "name": "Umar Raza Khan",
      "character": "Muslim Husband"
    },
    {
      "id": "nm3822770",
      "name": "Rajkummar Rao",
      "character": "Sonu Sarawat"
    },
    {
      "id": "nm4992002",
      "name": "Pulkit Samrat",
      "character": "Robin Singh"
    },
    {
      "id": "nm5607349",
      "name": "Varun Sharma",
      "character": "Manjot"
    },
    {
      "id": "nm0700687",
      "name": "Archana Puran Singh",
      "character": ""
    }
  ],
  "overview": "Dolly, an attractive woman, fakes marriages and runs away stealing all the precious belongings of the groom and his family. Dolly's modus operandi is to get her fake brother to identify prospective grooms &amp; then entice these men to fall in love with her. Attracted by her charms, these prospective grooms are ready to do anything for dolly including going against their parents' wishes to marry her.",
  "storyline": "Dolly (Sonam Kapoor) seems like the perfect bride to go with the perfect family, maybe too perfect as her unsuspecting grooms from all sorts of ethnic and religious backgrounds find out the hard way that she's a serial con artist who makes away with their wealth after wedding them. Its upto police inspector Robin (Pulkit Samrat) and two disgruntled grooms Sonu (Rajkumar Rao) and Manjot (Varun Sharma) to catch the group of thieves in the act.",
  "plot": "The movie centres around a young woman, Dolly (Sonam Kapoor), who is a young con artist. First she married Sonu Sherawat (Rajkummar Rao). She marries men from different religions and runs away with their wealth on the night of the wedding. Her entire family consists of con artists. After conning a number of rich men, she gets media attention, who label her as \"looteri dulhan\". A cop Robin Singh (Pulkit Samrat) decides to catch Dolly. When she tries to con Delhi boy Manjot (Varun Sharma), she slips and her photographs are splashed all over the media.\n\nWhen Dolly and her gang try to con a prince (Saif Ali Khan), they are arrested by Robin Singh. Then it is revealed that Robin Singh and Dolly have a past. She is put behind bars but she escapes with Robin's help and they get married. But she leaves him too and regroups with her old gang members and goes in search of their next victim.",
  "synopsis": null
}