{
  "imdb_id": "tt4305802",
  "tmdb_id": "308279",
  "douban_id": null,
  "title": "Ormayundo Ee Mukham (2014)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "India",
  "version": [],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm7011994",
      "name": "Anvar Sadik"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm1695513",
      "name": "Anju Aravind",
      "character": "Hema's Mother"
    },
    {
      "id": "nm1434433",
      "name": "Idavela Babu",
      "character": "Hema's Father"
    },
    {
      "id": "nm3614140",
      "name": "Reena Bashir",
      "character": ""
    },
    {
      "id": "nm2522571",
      "name": "Muktha George",
      "character": "Hema"
    },
    {
      "id": "nm0482285",
      "name": "Lakshmi",
      "character": "Gautham's Grandmother"
    },
    {
      "id": "nm4027847",
      "name": "Bhagath Baby Manuel",
      "character": ""
    },
    {
      "id": "nm0611481",
      "name": "Mukesh",
      "character": "Nithya's Doctor"
    },
    {
      "id": "nm5166292",
      "name": "Namitha Pramod",
      "character": "Nithya"
    },
    {
      "id": "nm0712469",
      "name": "Raveendran",
      "character": "Gautham's Father       (as Ravindran)"
    },
    {
      "id": "nm1094188",
      "name": "Rohini",
      "character": "Vasundhara Devi"
    },
    {
      "id": "nm9321875",
      "name": "Soumya Sadanandan",
      "character": "Neethu, Nithya's Sister"
    },
    {
      "id": "nm2068971",
      "name": "Vineeth Sreenivasan",
      "character": "Gautham"
    },
    {
      "id": "nm4028151",
      "name": "Aju Varghese",
      "character": "Apoorva"
    }
  ],
  "overview": "Goutham is a young businessman who lives with his mother and grandmother. Goutham's mother Vasundara Devi is the head of their family business. Vasundara Devi is a strict mother; but grand motheris extremely friendly with Goutham. Apporva is Goutham's best pal.  Then enters Nithya, a sand animation artist. Goutham meets Nithya and after a series of incidents, the couple falls in love. But Nithya, who has a memory loss problem due to a major accident,can't remember anything more than a day. This problem creates obstacles in Goutham and Nithya's relationship and this forms the crux of the story.",
  "storyline": "A young businessman falls for a girl with short-term memory loss.",
  "plot": "The story first shows Nithya (Namitha Pramod) a sand artist doing her program. When she is on her way home, she meets with an accident which leads to memory loss that can allow her remember anything for just 24 hours. She keeps a memory book (orma pusthakam) where she jots down all her memories. Then we meet Gautham (Vineeth Sreenivasan), a young businessman who also suffers from temporary memory problems. His mother (Rohini) get annoyed with him and asks him to marry a girl, Hema (Muktha), whom he doesn't like. Angry with his mother because of this, he and his grandmother (Lakshmi) make a plan. The plan is that he will say that he is in love with another girl and the next day they are going to have a date. The next morning he goes for a walk around the city instead for a date. He then meets Nithya and watches her sand art and memory show. They fall in love. Nithya does not write her memories in her memory book as she thinks if they are real soul mates then this magic will happen. The next day they meet, but Nithya does not recognize Gautham. Then Gautham, his friend Apoorva (Aju Vargese) and Nithya's sister Neetu (Soumya Sadanandan) make up plans and at last he succeeds. He tells his mother that he loves Nithya and then brings her to Gautham's House. There they realize their love for each Other. But the next day Nithya forgets him, but reminds herself about him after reading her memory book. She then says that they can never stay together and so tears his memories from her book. They go their separate ways. Later Gautham is travelling to the USA for a meeting, and he meets Neetu at the airport. She says that Nithya is fine. She then shows him the video of Nithya's program. He sees that the pictures drawn were related to him. That moment he abandons his trip and goes to watch Nithya's show. When she sees him there, she gets emerged up and draws her image with inner strength. But when he asks her whether she remembers him, she says no. Gautham returns and then sees his mother in the auditorium. His mother asks him to turn back. When he looks at the screen he sees Nithya drawing his face. Gautham runs back to the stage and asks her \"whether she really does not know him.\" She replies that \"even without knowing who you are I used to draw your pictures.\" Then they understand that even though she forgets everything after 24 hours, she will never be able to forget him as she loves him. Then they marry and live happily ever after.",
  "synopsis": null
}