{
  "imdb_id": "tt4309446",
  "tmdb_id": "324514",
  "douban_id": null,
  "title": "Triangle (2014)",
  "genres": [
    "Documentary"
  ],
  "country": "Italy",
  "version": [
    {
      "runtime": "63 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm0702997",
      "name": "Costanza Quatriglio"
    }
  ],
  "writer": [
    {
      "id": "nm5188324",
      "name": "Nella Condorelli",
      "description": "story"
    },
    {
      "id": "nm0702997",
      "name": "Costanza Quatriglio",
      "description": "screenplay"
    },
    {
      "id": "nm0702997",
      "name": "Costanza Quatriglio",
      "description": "story"
    }
  ],
  "cast": [
    {
      "id": "nm7014844",
      "name": "Mariella Fasanella",
      "character": ""
    }
  ],
  "overview": "Barletta, Italy, 2011: one hundred years after the 1911 Fire at the Triangle factory in New York, several textile workers die because of the collapse of the building in which they used to work as employees of an unauthorized knitwear factory. Mariella Fasanella is the only survivor among the women who worked there. Through her words we experience a century-long journey through the rise and fall of manual labour and industrialism in the Western world.",
  "storyline": "Barletta, Italy, 2011: one hundred years after the 1911 Fire at the Triangle factory in New York, several textile workers die because of the collapse of the building in which they used to work as employees of an unauthorized knitwear factory. Mariella Fasanella is the only survivor among the women who worked there. Through her words we experience a century-long journey through the rise and fall of manual labour and industrialism in the Western world.",
  "plot": "Jang Dong-soo, Jang Dong-chul and Jang Dong-woo are three brothers who got separated at a young age after their father died and their mother left them. They meet again twenty years later, but unaware of their blood ties, their ill-fated paths converge on casino territory where they find themselves at odds with each other.\n\nEldest brother Jang Dong-soo (Lee Beom-soo) followed in the footsteps of his father and became a detective. His greatest hope is to find his two brothers again and for the siblings to finally be reunited. Due to their different approaches to crime solving, Dong-soo clashes with Hwang Shin-hye (Oh Yeon-soo), a profiler who recently returned to Korea after studying overseas. They eventually gain a mutual respect for each other as colleagues, but find themselves in conflict once again when they learn that the gangster they're after is Dong-soo's own brother, Dong-chul.\n\nMiddle brother Jang Dong-chul (Kim Jae-joong) grew up as a petty thug on the streets, using his fists and wits to survive until he climbs to the top of a crime syndicate. Now a gang boss, he conceals his real identity and uses the name Heo Young-dal.\n\nYoungest brother Jang Dong-woo (Yim Si-wan) was adopted by a rich chaebol family, and now under the name Yoon Yang-ha, is being groomed as the heir to a casino empire. With no memory of his biological family and raised believing that the world revolves around money, Yang-ha is cynical and cold-hearted. Until he meets Oh Jung-hee (Baek Jin-hee), a poor girl supporting her family by working as a casino dealer, who changes the way Yang-ha sees the world. But he has a rival for her heart, Heo Young-dal. After losing a high-stakes game of Texas hold 'em to Young-dal, Yang-ha becomes furious and lands both Young-dal and Dong-soo in jail. Upon release, the two decide to embark on a mission to get revenge on everyone who has wronged them, including Dong-woo's father, Yoon Tae-joon, the CEO of Daejung group and Go Bok-Tae, the gang boss who helped Yang-ha put Young-dal in jail.",
  "synopsis": null
}