{
  "imdb_id": "tt4302956",
  "tmdb_id": "358985",
  "douban_id": null,
  "title": "Kis Kisko Pyaar Karoon (2015)",
  "genres": [
    "Comedy"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "133 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm0122216",
      "name": "Abbas Alibhai Burmawalla"
    },
    {
      "id": "nm0122217",
      "name": "Mastan Alibhai Burmawalla"
    }
  ],
  "writer": [
    {
      "id": "nm6642452",
      "name": "Anukalp Goswami",
      "description": "story"
    },
    {
      "id": "nm6642452",
      "name": "Anukalp Goswami",
      "description": "screenplay &"
    },
    {
      "id": "nm1941818",
      "name": "Dheeraj Sarna",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm6151574",
      "name": "Kapil Sharma",
      "character": "Shiv Ram Kishan Kumar"
    },
    {
      "id": "nm3080120",
      "name": "Simran Kaur Mundi",
      "character": "Simran"
    },
    {
      "id": "nm1967908",
      "name": "Manjari Fadnnis",
      "character": "Juhi       (as Manjari Fadnis)"
    },
    {
      "id": "nm5262126",
      "name": "Sai Lokur",
      "character": "Anjali"
    },
    {
      "id": "nm5675978",
      "name": "Elli Avrram",
      "character": "Deepika       (as Elli Avram)"
    },
    {
      "id": "nm5607349",
      "name": "Varun Sharma",
      "character": "Karan (Lawyer)"
    },
    {
      "id": "nm0451170",
      "name": "Arbaaz Khan",
      "character": "Tiger Bhai"
    },
    {
      "id": "nm0665554",
      "name": "Supriya Pathak",
      "character": "Shiv's Mother"
    },
    {
      "id": "nm0768296",
      "name": "Sharat Saxena",
      "character": "Shiv's Father"
    },
    {
      "id": "nm1259084",
      "name": "Manoj Joshi",
      "character": "Deepika's Father"
    },
    {
      "id": "nm0153241",
      "name": "Charlie",
      "character": "Charlie"
    },
    {
      "id": "nm9304136",
      "name": "Sunny Cheema",
      "character": "Anil"
    },
    {
      "id": "nm5035071",
      "name": "Nataliya Kozhenova",
      "character": "Lily"
    },
    {
      "id": "nm9470554",
      "name": "Jamie Lever",
      "character": "Champa"
    },
    {
      "id": "nm6934209",
      "name": "RajeshB.",
      "character": "Interview Candidate"
    },
    {
      "id": "nm2520787",
      "name": "Sharad Sankla",
      "character": "Charlie"
    }
  ],
  "overview": "A comedy or errors, wherein a married man attempts to juggle his three wives along with his current girlfriend.",
  "storyline": "The film tells the story of a man who goes by 3 identities: Shiv, Ram and Kishan. Every time Kumar Shiv Ram Kishan lands up helping a girl in distress, he lands up marrying that girl! That establishes the fact as to how he gets married to Juhi, Simran and Anjali. As luck would have it, all his wives live in the same apartment. Kumar Shiv Ram Kishan very successfully hides his marriage from all the three wives. And none of them knows the fact that Shiv, Ram and Kishan are one and the same man and cheating on them. The plot gets twistier with the entry of Deepika, the girl he really loves. He plans to marry Elli Avram as well due to fear of losing her. But before he can execute another marriage, his parents arrived. The plot gets further murkier when all the three wives become best of friends. The confusion increases when all his three wives are invited on their best friend wedding.",
  "plot": "This section may require copy editing for grammar, style, cohesion, tone, or spelling. You can assist by editing it. (October 2016) (Learn how and when to remove this template message)\nThe movie starts with Shiv Ram Kishan Kumar (Kapil Sharma) marrying three different girls: Juhi (Manjari Fadnis), Anjali (Sai Lokur) and Simran (Simran Kaur Mundi) due to different circumstances against his own wish. But he had to marry them or else they would commit suicide. He makes excuses so that he can spend one night with each wife. On his friend Karan's advice (Varun Sharma), he buys three flats on different floors in one building for each wife. He and Karan experience hilarious circumstances with each of his wives. He also has a girlfriend, Deepika (Elli Avram), who he thinks is first wife whom he'll be marrying according to his will under the name, Kumar. Deepika's father (Manoj Joshi) accepts him as his son-in-law. On one evening before 'Karva Chauth', Deepika's father notices Kumar with all his three wives one-by-one, but Kumar succeeds in escaping by telling a lie that it was an April Fool triggered by all of wives. In the meantime, all his wives become good friends. Deepika's father again has a problem with Kumar that the employee working in his office is engaged to the given photo, as it showed Kumar to Deepika's father. Due to this, Deepika decides to marry in court and Kumar agrees that will be the easiest way to marry without any tensions, but the relationship of his mother and father, which was ruined fifteen years ago when his father married someone else started liking each other again. The two knew that Kumar have two wives, but not yet of the full truth, they come to know that he's gonna marry the third one; Deepika. Karan and Deepika keep waiting. After waiting for a long time, Kumar comes to Deepika, but as he sees his three other wives, he hides behind a wall. Karan tells Deepika and her friends that Kumar went hospital to help his friend, as one of his wives praised, 'God gives that husband to everyone', which is disliked dialogue by Kumar from all her three wives. Karan tells to postpone the marriage to two days later, her friends went away, left is Deepika who is sad, but Kumar comes from the wall telling his friend is okay; a lie, and now they can marry, but Deepika tries to call her friends, and is stopped by Kumar as he says to go to temple to marry as it is late already and sends Karan to bring Temple marrying things. In time, Deepika's father arrives and takes them to office and calls his employee and asks if Kumar is engaged to her. The lady says no and Deepika's father apologizes to Deepika and Kumar as he knows that Deepika put the photo there too as the employee did and she didn't show it as she was frightened and Deepika's father decided to fire his employee to make him doubt on his future son-in-law but Kumar saves her job and deepu's father decides to celebrate the marriage pleasantly. On the day of their marriage, all his three wives arrive. Shiv Ram Kishan's parents also arrive, as it is too hard to know the face as Kumar and Debika decided to make everyone dressed in marriage clothes so nobody can recognize Kumar or even themselves. Tiger (Arbaaz Khan) is in the search of a guy, so he makes everyone to put down their 'pagdi' as Kumar had to put his padgi down which he didn't but in time, Tiger's(Anjali's brother) men brought the guy and Kumar is saved. The marriage keeps going. By chance the face of Shiv Ram Kishan comes in front of fire as he tried to put all mud in the fire and all four of them come to know the truth along with his parents that he didn't break heart of his three wives. They forcefully made Kumar to marry, someone didn't even listen to him, or even asked him that is he married as someone was about to commit suicide by falling into the well and he cannot leave them commit suicide by telling that they are already married, the one whose heart he broke is Deepika, his true love. As soon he ends, everyone cries and her mother hugs him tightly and Deepika's father asks Deepika for what's her choice. At climax, all the four wives are shown together as they accept each other, everyone knew it except for Tiger, as he can't hear, he cannot even understand that it was a tragedy or comedy.",
  "synopsis": null
}