{
  "imdb_id": "tt4334840",
  "tmdb_id": "367117",
  "douban_id": null,
  "title": "Introducing Parker Dowd (2015)",
  "genres": [
    "Short",
    "Comedy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "18 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm3354777",
      "name": "Lauren Ashley Carter"
    }
  ],
  "writer": [
    {
      "id": "nm7038329",
      "name": "Rebecca Blaine Carton",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm2209452",
      "name": "Anita Anthonj",
      "character": "Jenna"
    },
    {
      "id": "nm0085400",
      "name": "Lewis Black",
      "character": "Drew"
    },
    {
      "id": "nm7038330",
      "name": "Sal Cacciato",
      "character": "Newsstand Owner"
    },
    {
      "id": "nm7038329",
      "name": "Rebecca Blaine Carton",
      "character": "Katie Schadenberg"
    },
    {
      "id": "nm2680952",
      "name": "Neimah Djourabchi",
      "character": "Policeman"
    },
    {
      "id": "nm0231513",
      "name": "Dan Domingues",
      "character": "Sound Technician"
    },
    {
      "id": "nm3780621",
      "name": "Nahuel Gorosito",
      "character": "Photographer"
    },
    {
      "id": "nm1040539",
      "name": "Harriet Koppel",
      "character": "Older Woman"
    },
    {
      "id": "nm0557838",
      "name": "Michael Mastro",
      "character": "Business Man"
    },
    {
      "id": "nm2086132",
      "name": "Kira McCarthy",
      "character": "Ingenue"
    },
    {
      "id": "nm2280435",
      "name": "Topher Mikels",
      "character": "Chase"
    },
    {
      "id": "nm1911660",
      "name": "Justin Morck",
      "character": "Photographer"
    },
    {
      "id": "nm4957085",
      "name": "Chris Morriss",
      "character": "Friend #3"
    },
    {
      "id": "nm4097442",
      "name": "Julian Mosley",
      "character": "Photographer"
    },
    {
      "id": "nm3118047",
      "name": "Matthew Murumba",
      "character": "Sound Technician"
    },
    {
      "id": "nm6086970",
      "name": "Kyle Nunn",
      "character": "Friend 2"
    },
    {
      "id": "nm2801189",
      "name": "Tim Rerucha",
      "character": "Personal Security Guard"
    },
    {
      "id": "nm3310191",
      "name": "Jacob Rosenbaum",
      "character": "Hipster PA"
    },
    {
      "id": "nm6529588",
      "name": "Harlan Short",
      "character": "Security Guard"
    },
    {
      "id": "nm3399378",
      "name": "Nina Wray",
      "character": "Ingenue's Friend"
    },
    {
      "id": "nm1883590",
      "name": "Tim Wu",
      "character": "Neighbor"
    }
  ],
  "overview": "A struggling actress loses a role to her dog and must watch him skyrocket to celebrity as she descends into vengeful madness. Written and starring Rebecca Blaine Carton with Lewis Black as the agent and directed by Lauren Ashley Carter.",
  "storyline": "A struggling actress loses a role to her dog and must watch him sky rocket to celebrity while she descends into vengeful madness.",
  "plot": "Parker (Jason Statham) is a professional thief, specializing in big robberies, who follows a unique code—he doesn't steal from the poor or hurt innocent people. His mentor Hurley (Nick Nolte) asks him take charge of a job with a crew he doesn't know, consisting of Melander (Michael Chiklis), Carlson (Wendell Pierce), Ross (Clifton Collins Jr.), and Hardwicke (Micah Hauptman). The job, taking the gate money from the Ohio State Fair, is successful, but Hardwicke ignored instructions, resulting in him needlessly killing a man in a fire that was set as a distraction.\n\nParker, disgusted with the crew's unprofessional standards, refuses to participate in another robbery that could net them millions. Needing his share of the Ohio loot to finance the bigger job, Melander's crew decides to shoot Parker and leave him to die alongside a road. Having barely survived, Parker is found by a family of tomato farmers who take him to the hospital, where he subdues a male nurse, steals his uniform, and escapes. He then robs a check-cashing store, shooting the proprietor in the leg, ties up both the proprietor and his employee, gagging them with duct tape, then steals a woman's car.\n\nParker tells Hurley he wants to go after the double-crossing Melander, who has gone to Palm Beach, Florida for another heist. Upon learning that Parker is alive, the crew uses mob connections to hire a hitman named Kroll (Daniel Bernhardt). Kroll tries to kidnap Parker's girlfriend Claire (Emma Booth), who is Hurley's daughter. She narrowly escapes and goes into hiding. Hurley is worried and suggests Parker run away with her, but Parker is completely intent on revenge.\n\nIn Palm Beach, Parker poses as a wealthy Texan named Daniel Parmitt, looking for a place to live. Leslie Rodgers (Jennifer Lopez) is a depressed, unsuccessful real-estate agent living with her mother (Patti LuPone), struggling financially after a divorce. She is thrilled when Parker (as Parmitt) appears to become interested in her properties because she is desperate for a commission.\n\nLeslie becomes suspicious when Parker only shows interest in a house that a man named Rodrigo recently purchased and is remodelling. In reality, Rodrigo is Melander, who is staying in the house with the crew in anticipation of a $50 million jewelry auction they plan to rob. Parker returns to the house to plant his guns, find their weapons and disable the firing pins.\n\nLeslie finds out that Parker is using a fake identity. She offers her local knowledge in exchange for a commission of the robbery. He considers it only after making Leslie strip to show she isn't wearing a wire. Together, they plan to steal the jewels from Melander after he robs them from the auction. Leslie makes a pass at Parker, but he remains distant, though obviously attracted to her.\n\nMelander's crew disguise themselves as delivery men. Meanwhile, Kroll learns that Parker is in Palm Beach, and he attempts to kill him. After a brutal and bloody fight, Kroll stabs Parker through the hand, but ends up falling to his death from Parker's hotel balcony.\n\nThe next morning, Palm Beach Sheriff's Deputy Jake Fernandez (Bobby Cannavale) arrives with questions for Leslie after learning that she was in business with Daniel Parmitt. She is shocked when she discovers a bloody Parker hiding in her house with her mother's permission. At her workplace, Leslie is horrified when she watches a video of Kroll's death online, which was filmed by local onlookers. At Parker's request, she contacts Claire, who comes to stitch up his wounds. Their subsequent encounter makes it clear to Leslie that Claire is the woman in his life.\n\nThe crew successfully steals the jewels. They swim back to the house, where a weak and injured Parker is waiting to ambush them. Worried that Parker might need help, Leslie begins snooping around the garden. She is found and taken inside, where the crew abuse and question her, assuming she and Parker are working together. Ross goes outside where he is killed by Parker, stabbing him in the neck. Melander's other men begin to panic.\n\nMelander finds Parker and a fight ensues. Carlson starts to molest Leslie, but she shoots him with a gun she noticed under the table that Parker had planted. Parker, in spite of his wounds, is able to kill Melander. All members of the crew end up dead. Parker and Leslie arrange for the jewels to be hidden and for her to be sent her cut. They part ways, Parker showing some regret as she leaves.\n\nSix months later, Parker goes to Chicago and kills the syndicate boss who hired Kroll to kill him. One year later, Leslie receives two hefty boxes in the mail containing several million dollars. The tomato farmers who saved Parker's life are shown talking to somebody about how they somehow got a great deal of money that has changed their lives. They credit the stranger, thinking he must have been an angel sent to test them.",
  "synopsis": null
}