{
  "imdb_id": "tt4390908",
  "tmdb_id": "346560",
  "douban_id": null,
  "title": "Legend of Dark Rider (2019)",
  "genres": [
    "Action",
    "Adventure",
    "Fantasy"
  ],
  "country": "Sweden",
  "version": [],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm3736022",
      "name": "Titus Paar"
    }
  ],
  "writer": [
    {
      "id": "nm3736022",
      "name": "Titus Paar",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0920460",
      "name": "Vernon Wells",
      "character": "The Witch King"
    },
    {
      "id": "nm1779355",
      "name": "Yohanna Idha",
      "character": "The Black Witch Queen"
    },
    {
      "id": "nm6224536",
      "name": "Andreas Cahling",
      "character": "Baron"
    },
    {
      "id": "nm2800616",
      "name": "Dragomir Mrsic",
      "character": "General Zodd"
    },
    {
      "id": "nm2018573",
      "name": "Sean Cronin",
      "character": "Stefan"
    },
    {
      "id": "nm2309662",
      "name": "Andreas Rylander",
      "character": "Captain"
    },
    {
      "id": "nm0075049",
      "name": "Urban Bergsten",
      "character": "Vincent"
    },
    {
      "id": "nm4323217",
      "name": "John Wells",
      "character": "Tezzin leader of the Hawks"
    },
    {
      "id": "nm3736022",
      "name": "Titus Paar",
      "character": "Drunk man in bar"
    },
    {
      "id": "nm0617450",
      "name": "Jarmo Mäkinen",
      "character": "Guts"
    },
    {
      "id": "nm2972731",
      "name": "Pontus Olgrim",
      "character": "Sergeant"
    },
    {
      "id": "nm5099218",
      "name": "Alan Adler",
      "character": "Stefan Barath"
    },
    {
      "id": "nm1291116",
      "name": "Ralf Beck",
      "character": "Vlademir"
    },
    {
      "id": "nm4512373",
      "name": "Stefan Cronwall",
      "character": "Dark Rider"
    },
    {
      "id": "nm4464592",
      "name": "Tommi Korkeamäki",
      "character": "Hanso"
    },
    {
      "id": "nm3913660",
      "name": "Josh Lenn",
      "character": "Bartender#2"
    },
    {
      "id": "nm7154185",
      "name": "Louie Marti",
      "character": "Grieg"
    },
    {
      "id": "nm7081289",
      "name": "Faravid Af Ugglas",
      "character": "Guest"
    },
    {
      "id": "nm3362280",
      "name": "Christian De Flon",
      "character": "Arrow Game Soldier"
    },
    {
      "id": "nm7081288",
      "name": "Linda Palmcrantz",
      "character": "Casandra"
    }
  ],
  "overview": "A story that has lasted for generations, about the Dark Rider. A beast none has survived, a monster, not human. In time the story becomes legend, but the man they call Dark Rider is a man with no memory carrying a silver locket shaped like the head of a wolf. When threaten it unleashes a dark power in him and slays whoever stands in his way. All he can remember is waking up on the bottom of a cliff with his right eye torn out by the blade of an axe, holding this locket. Beside him lays a dead beautiful woman he assumes it's his wife, all he has is the name \"Vladimir\" written on a piece of fabric. Every night he is hunted by a vision of a man part snake sitting on a golden throne screaming \"Give it back to me\". He travels the snowy north, looking for the man Vladimir in hope that this man can finally tell him who he is, what he is and take his revenge.",
  "storyline": "A Legend passed down from generation to generation. The Dark Rider, a rapacious beast no man has survived. But the brute behind the legend is a tortured soul with one mysterious and crippling flaw. He has no memory of who he was or why he's being chased by the kings soldiers. He wanders through the barren northern landscape clutching a silver wolf shaped locket. Whenever threatened the locket unleash an intense dark power within him which turns him part wolf and slays anyone who stands in his way. The only clue he has to his past is a piece of fabric with the name \"Vladimir\" written upon it. Every night Dark Rider is tortured by the haunting vision of a creature, part man part snake, perched on an ornate throne, screaming \"Give it back to me\". Dark Rider has come to this northern wintry wasteland on a quest to find \"Vladimir\". On his quest he crosses paths with a small but strong army rebelling against the tyranny of the King in the mountains that has turned the world into a dark and ...",
  "plot": "Valerie is a young woman who lives in the village of Daggerhorn, on the edge of a forest plagued by a werewolf, with her parents, Cesaire and Suzette, and older sister Lucie. She is in love with the town woodcutter Peter, but her parents have arranged for her to marry Henry Lazar, son of the wealthy blacksmith Adrien Lazar. Valerie and Peter plan to run away together, only to learn that the Wolf has broken its truce not to prey on the townspeople in exchange for cattle stock sacrifices and has murdered Lucie, who is revealed to have had a crush on Henry Lazar.\n\nSuzette learns of Peter and Valerie's love, telling Valerie she too did not love her husband at first, but learned to love him – that she had loved another. Father August, the local preacher, calls for the famous witch hunter, Father Solomon, to help them but the townspeople decide to venture into the Wolf's lair to destroy it. They divide into groups, with one consisting of Peter, Henry, and Adrien. Peter separates from them moments before the Wolf attacks and murders Adrien. The Wolf is cornered by the men and killed. Valerie finds Suzette mourning Adrien and figures out that he was her love. She also realizes that Lucie, being the older daughter, should've been the first to wed and should have been engaged to Henry, but could not as she was the illegitimate daughter of Adrien, making her Henry's half-sister.\n\nThe following day, as the people celebrate, Father Solomon arrives and reveals that, had they killed the Wolf, it would have returned to its human form as it is a werewolf, but what they slew was a common grey wolf. He also reveals that they've entered the Blood Moon Week, an event that happens every thirteen years, in which whoever is bitten by the Wolf is cursed to become one as well. Father Solomon's men, led by The Captain (Adrian Holmes), isolate Daggerhorn and begin to investigate its people in search of the Wolf. That night, the Wolf attacks and, while the townspeople rush to the Church (as the Wolf is unable to step onto holy ground), Valerie and her friend Roxanne venture into the village to search for Roxanne's autistic brother, Claude. They are cornered by the creature and Valerie discovers that she is able to understand the Wolf's sounds. It threatens to kill Roxanne and destroy the village if Valerie doesn't leave with it. The Wolf then escapes, vowing to return to learn Valerie's decision.\n\nThe following day, Claude is captured by Father Solomon's men. Having witnessed Claude performing a card trick earlier, Father Solomon claims he's a student of the dark arts and attempts to force the frightened Claude to reveal the Wolf's identity. When Claude is unable to do so, Father Solomon locks him up in a large iron elephant brazen bull. In exchange for Claude's release, Roxanne reveals that Valerie is able to communicate with the Wolf but Claude is already dead by the time the Captain opens the elephant. Believing Valerie to be a witch, Father Solomon has her captured and displayed at the town's square in order to lure the Wolf out so he can kill it. Henry and Peter join forces and help Valerie to escape. Peter is captured by the Captain and thrown into the elephant, while Father Solomon orders Henry to be killed for helping Valerie. Father Auguste saves Henry and is then killed by Father Solomon.\n\nHenry takes Valerie to the church, but they are attacked by the Wolf, who bites off Father Solomon's hand, which contains silver-coated fingernails. The townspeople shield Valerie from the Wolf, who is once again forced to flee, but not before burning a paw by touching holy land. Valerie dreams that the Wolf is her grandmother, who lives in a cabin in the nearby woods, so she goes to check on her. Father Solomon, having been cursed, is killed by the Captain.\n\nAfter retrieving Father Solomon's hand, Valerie rushes to her grandmother's cabin, but is confronted on the way by Peter. She then notices that he is wearing a glove on his right hand, the same paw that the Wolf burned trying to enter the church, Valerie assumes Peter is the Wolf and stabs him. Arriving at Grandmother's house, Valerie is horrified to find her dead, and learns that the Wolf is her father, Cesaire. He reveals that the curse was passed to him by his own father, and he intended to leave the village but wanted to take his children with him. He sent a note to Lucie pretending to be Henry to meet him at night so he could ask her to accept her \"gift\". However, when he confronted her, she couldn't understand him. Realizing Lucie was not his daughter, he murdered her in a fit of rage. He then took revenge against Adrien, his wife's lover, and now wants Valerie to accept the curse.\n\nValerie refuses, just as Peter appears and confronts Cesaire, who bites Peter (thus giving him the curse) and tosses him aside. Peter is able to throw an axe into Cesaire's back, distracting him. Valerie stabs Cesaire to death with Father Solomon's hand. Valerie and Peter fill Cesaire's body with rocks so he can never be found and dump the body in the lake. Peter departs in order to learn how to control his curse, vowing to return only when he's able to ensure Valerie's safety. Valerie narrates that Henry found his courage and joins the ranks of the Captain's monster hunters. Valerie's mother finally accepts that her husband will never come home, and the village continues to live in fear even though the wolf never returned. She then moves to her grandmother's house, leaving her old life behind as she can't go back to the village because she is married to the wolf (Peter) and wants to keep that a secret.\n\nThe last scene shows Valerie outside the cabin on a full moon. She hears a slight growl, turns around and sees Peter in wolf form as she begins to smile. In an alternate ending, Valerie is seen holding a baby, which is her baby with Peter.",
  "synopsis": null
}