{
  "imdb_id": "tt4381242",
  "tmdb_id": "364810",
  "douban_id": null,
  "title": "Triple Trouble (2015)",
  "genres": [
    "Comedy"
  ],
  "country": "Vietnam",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm5365425",
      "name": "Tan Binh Vo"
    }
  ],
  "writer": [
    {
      "id": "nm5365425",
      "name": "Tan Binh Vo",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1738665",
      "name": "Nga Thúy",
      "character": "Dung"
    },
    {
      "id": "nm1835940",
      "name": "Kathy Uyen",
      "character": "My"
    },
    {
      "id": "nm7072367",
      "name": "Hoang Anh Ngoc Vu",
      "character": "Vy"
    },
    {
      "id": "nm6679596",
      "name": "Hieu Nguyen",
      "character": "Tuan"
    }
  ],
  "overview": "The city girls include : Royal American ( Kathy Uyen ) , Tuyet Dung ( Thuy Nga ) and Ngoc Vy ( Hoang Oanh ) bumped into each other while sitting together boat. Each of her own purpose for the trip , but they decided to make friends to enjoy the happy moments in the isle . After a night of partying \"drop door \" , the three wake up in the boat with the ragged shape and clean forget what happened to me the day before. Trip down \" what has happened \" about their group's fall resulted in itinerary are gangsters chase group .",
  "storyline": "Vy is a young journalist who is very shy and dares not lose her virginity. My is a sexy independent woman. Dung is a family woman who acts more like a maid to her husband. One day, these three women wake up on an island near Hoi An, each in a very strange situation and unable to remember what happened the previous night. Vy believes she lost her virginity, Dung looks like a rebellions punk teenager and My has a long cut on her face. Later, Tuan, a handsome but strange young man joins them on their journey. They are threatened with death if they don't return the island's sacred treasure they've accused of stealing, but none has any idea where it is. Following the traces of the prior crazy night, they eventually find a realtor who stole the treasure in order to trick the villagers into selling their land. The girls finally finds the treasure, reveal the truth about the realtor and save the residents from losing their home. They also find out who each of them truly is.",
  "plot": "The boys are on their way home from a masquerade party when they hear noises in a warehouse and decide to investigate. They find the warehouse is being robbed and they are mistakenly captured by the police and sentenced for robbing it. Gabe, as their lawyer, gets them off with just probation but Slip insists that he and Sach accept jail time in order to find out who is behind the series of robberies in the neighborhood. He deduces that the instructions are being sent from inside the prison via a short wave radio.\n\nUpon entering the prison they are mistaken for notorious criminals and make fast friends with the masterminds behind the robberies. Whitey, who owns a short wave radio, overhears the plans and informs Louie who runs out into the street and tells the police of the plans that his sweet shop will be robbed next. The cop doesn't believe him, but eventually Louie is able to persuade the warden of the prison when Whitey hears about a jailbreak attempt. The warden sets up a sting operation and catches the gang that was behind the robberies and the boys are exonerated.",
  "synopsis": null
}