{
  "imdb_id": "tt4374384",
  "tmdb_id": "348891",
  "douban_id": null,
  "title": "Beyond Here (2015)",
  "genres": [
    "Drama"
  ],
  "country": "Belgium",
  "version": [
    {
      "runtime": "72 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm7066946",
      "name": "Hugo Bousquet"
    }
  ],
  "writer": [
    {
      "id": "nm7066946",
      "name": "Hugo Bousquet",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4262122",
      "name": "Leslie Bouchet",
      "character": "Léa"
    },
    {
      "id": "nm7066948",
      "name": "Frédéric Evrard",
      "character": "Marcus"
    },
    {
      "id": "nm7066947",
      "name": "Yoan Robin",
      "character": "Basile"
    }
  ],
  "overview": "A desolate mountainous region, a young couple exhausted from a long journey, an abandoned house discovered by chance, and finally the arrival of a mysterious stranger speaking an unfamiliar language.",
  "storyline": "Basile and Lea walk across mountains. They rob every shelters and huts found on the road, carrying away what may be. They seek to reach Gondolin. Basile hopes to cross the pass before winter but Léa is exhausted. A comfortably equipped refuge with significant reserves in food, firearms and ammunition, allows them some rest. After a few days Basile wants to leave. But while she appropriates the place, Léa tries to delay their departure.",
  "plot": "In Louisiana's Seven Doors Hotel in 1927, a lynch mob murders an artist named Schweick, whom they believe to be a warlock. This opens one of the Seven Doors of Death, allowing the dead to cross into the world of the living. Several decades later, Liza, a young woman from New York, inherits the hotel and plans to re-open it. Her renovation work activates the hell portal, and she contends with increasingly strange incidents. A plumber named Joe investigates flooding in the cellar and a demonic hand gouges out his eye. His body and another are later discovered by a hotel maid, Martha.\n\nLiza encounters a blind woman named Emily, who warns that reopening the hotel would be a mistake. Joe's wife Mary-Anne and their daughter Jill arrive at the hospital morgue to claim Joe's corpse. Jill finds her mother lying on the floor unconscious, her face burned by acid. Liza meets with Dr. John McCabe, and receives a phone call informing her of Mary-Anne's death. After the funerals, Liza encounters Emily at the hotel. Emily tells Liza the story of Schweick, and warns her to not enter room 36. When Emily examines Schweick's painting, she begins to bleed and flees the hotel.\n\nLiza ignores Emily's advice, and investigates room 36. She discovers an ancient book titled Eibon. She sees Schweick's corpse nailed to the bathroom wall. She flees the room in terror, but is stopped by John. She takes him to room 36 but both the corpse and the book are gone. Liza describes her fearful encounters with Emily, but John insists that Emily is not real. While in town, Liza spots a copy of Eibon in the window of a book store, but when she rushes in to grab it, a different book is in its place. The shop owner says the book has been there for years, prompting Liza to remark to John that perhaps it is all in her head. At the hotel, a worker named Arthur attempts to repair the same leak as Joe, but is killed off-screen by ghouls.\n\nLiza's friend Martin visits the public library to find the hotel's blueprints. He is struck by a sudden force and falls from a ladder, resulting in paralysis. Spiders ravage his face and kill him. Martha is cleaning the bathroom in Room 36 when Joe's animated corpse emerges from the bathtub. Joe pushes her head into an exposed nail, killing her and destroying one of her eyes. The walking corpses of Schweik, Joe, Mary-Anne, Martin and Arthur invade Emily's house. She pleads with them to leave her alone, and insists she will not return with Schweik. She commands her guide dog to attack the corpses, but the dog turns on Emily, tearing out her throat.\n\nAt the hotel, spirits terrorize Liza. John breaks into Emily's house, which appears to have been abandoned for years, and finds Eibon. He returns to the hotel and tells Liza that it is a gateway to Hell. They flee to the hospital, but it has been overrun by zombies. Liza is attacked, but John gets a gun out of his desk and shoots the shambling corpses. Only Harris and Jill are found still alive, but Harris is killed by flying shards of glass. Jill, having shown signs of possession since the funeral, finally attacks Liza. John is forced to kill Jill.\n\nEscaping the zombies, John and Liza rush down a set of stairs but find themselves back in the basement of the hotel. They move forward through the flooded labyrinth and stumble into a supernatural wasteland of dust and corpses. No matter which direction they travel, they find themselves back at their starting point. They are ultimately blinded just like Emily, succumb to the darkness, and disappear.",
  "synopsis": null
}