{
  "imdb_id": "tt4380748",
  "tmdb_id": "317118",
  "douban_id": null,
  "title": "I Do, I Do, I Do (TV Movie 2015)",
  "genres": [
    "Comedy",
    "Fantasy",
    "Romance"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.3,
  "director": [
    {
      "id": "nm0646987",
      "name": "Ron Oliver"
    }
  ],
  "writer": [
    {
      "id": "nm0799012",
      "name": "Nancey Silvers",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1032208",
      "name": "Autumn Reeser",
      "character": "Jaclyn Palmer"
    },
    {
      "id": "nm1650932",
      "name": "Ali Liebert",
      "character": "Kate Palmer"
    },
    {
      "id": "nm0731575",
      "name": "Shawn Roberts",
      "character": "Max Lorenzo"
    },
    {
      "id": "nm0929794",
      "name": "Christine Willes",
      "character": "Margaret Lorenzo"
    },
    {
      "id": "nm1182955",
      "name": "Antonio Cupo",
      "character": "Peter Lorenzo"
    },
    {
      "id": "nm0106319",
      "name": "Jay Brazeau",
      "character": "Phillip Lorenzo"
    },
    {
      "id": "nm7381388",
      "name": "Rita Luca",
      "character": "Nona Rosa"
    },
    {
      "id": "nm0310240",
      "name": "Chris Gauthier",
      "character": "Priest       (as Christopher Gauthier)"
    },
    {
      "id": "nm4285727",
      "name": "Kwasi Thomas",
      "character": "DJ"
    },
    {
      "id": "nm1900659",
      "name": "Nelson Wong",
      "character": "Gerry"
    },
    {
      "id": "nm4541220",
      "name": "Sergio Osuna",
      "character": "Kenneth"
    },
    {
      "id": "nm0732918",
      "name": "Michael Robinson",
      "character": "Doctor"
    },
    {
      "id": "nm3944811",
      "name": "Darla Taylor",
      "character": "Sales Lady"
    },
    {
      "id": "nm0612775",
      "name": "Kevin Mundy",
      "character": "Caddy"
    },
    {
      "id": "nm1986867",
      "name": "Andrea Stefancikova",
      "character": "Italian teacher       (voice)"
    }
  ],
  "overview": "An architect heads to the altar with her fiancé, unsure of  her marriage and their future. She relives her disastrous  wedding day, put together by her fiance’s overbearing  mother, over and over until, with the help of his brother,  she begins to face her biggest fears and discover what she  really wants in herself and in her life.",
  "storyline": "A young lady gets engaged to the \"perfect man\". The groom's mother plans everything for the wedding (in a week). The wedding is over the top when it was supposed to be small and elegant. It turns out to be a miserable day for the bride and she wishes for a do-over. She gets her wish over and over until she finally realizes exactly what she wants.",
  "plot": "Rusty Griswold (Ed Helms) is now an adult working as a pilot for a low budget airline called Econo-Air, and he shares a stale relationship with his wife Debbie (Christina Applegate) and their two sons, their shy and awkward 14-year-old son James (Skyler Gisondo), and their sadistic and intimidating 12-year-old son Kevin (Steele Stebbins). The gloating from his friends Jack (Keegan-Michael Key) and Nancy Peterson (Regina Hall) about a family trip they had in Paris doesn't help his situation. He desires to relive the fun of his family vacations from his childhood (such as their trip to Vegas, Europe, Walley World, and even staying home for Christmas). These memories prompt him to abandon his family's annual trip to their cabin in Cheboygan, Michigan (which the rest of the family secretly hate) and instead drive cross country to Walley World, just like he did years before with his parents and sister. For the trip, Rusty hires a Tartan Prancer, an ugly, over-complicated Albanian SUV.\n\nAlong the way, the Griswolds take many detours. The first is Memphis, where it's revealed that the otherwise mild-mannered Debbie was an extremely promiscuous Tri Pi sorority sister in college nicknamed 'Debbie Do Anything' even when they meet a sorority member named Heather (Elizabeth Gillies). While staying at a motel, James meets Adena (Catherine Missal), a girl his age that he saw while driving on the highway, but is scared away by Rusty trying to entice her towards him in a very embarrassing and weird way.\n\nIn Arkansas, they are led to a supposedly hidden hot spring by a \"helpful\" local, eventually realizing that it's a sewage dump. They return to the Prancer only to see it's been broken into, their luggage and cash stolen, and then sprayed with graffiti.\n\nNext they stop in Texas to get help from Rusty's sister, Audrey (Leslie Mann), and her husband, Stone Crandall (Chris Hemsworth). Rusty begins to suspect problems in his relationship with Debbie due to Stone's obviously outward sexual behavior and actions, but she rebuffs his suspicions. One night, Stone walks in on the couple and makes a show of his attractive body and oversized member.\n\nSpending the following night at an Arizona campsite, Rusty and Debbie sneak away to attempt to have sex at the Four Corners monument, where officers from all four states confront the couple and each other, allowing them to escape. James finally asserts himself against Kevin with encouragement from Adena, who they encounter again. The next morning, after nearly getting killed by a suicidal Grand Canyon rafting guide (Charlie Day), who has just been dumped by his fiancée, the Prancer runs out of gas in the middle of the desert and explodes, leading Rusty to think about the disastrous trip and walk off dispirited and alone. After being tracked-down by a seemingly unstable truck driver (Norman Reedus), who they think has been stalking them throughout the trip, he instead returns Debbie's missing wedding ring and gives them a lift to San Francisco, where they spend the night at a bed and breakfast run by Rusty's parents, Clark (Chevy Chase) and Ellen (Beverly D'Angelo). They intend to fly home to Chicago the next day, but Rusty and Debbie confront each other about their stale marriage and decide to start over again.\n\nWith some encouragement from Clark the next morning, Rusty borrows his father's Wagon Queen Family Truckster and drives Debbie and the boys to Walley World to ride their newest roller coaster, Velociraptor. After spending the entire day waiting in line, they are cut off by Ethan (Ron Livingston), a more successful airline pilot rival of Rusty's, and his family before the announcement of the park's closing. A fight breaks out, which the Griswolds win, forcing the other family to flee. The Griswolds finally board the ride, but it stalls halfway up a loop, and they are rescued after several hours.\n\nThey are brought closer by the experience, and Rusty uses his airline connections to book a relaxing vacation in Paris alone with Debbie, while sending the boys home where the Petersons will look after them. As the film end, we see them on the plane to Paris sitting in a pair of uncomfortable seats right next to a lavatory. Exasperated, Debbie asks and learns that it will be a 12-hour flight.",
  "synopsis": null
}