{
  "imdb_id": "tt4430136",
  "tmdb_id": "363413",
  "douban_id": null,
  "title": "Pyaar Ka Punchnama 2 (2015)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "137 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.4,
  "director": [
    {
      "id": "nm3060331",
      "name": "Luv Ranjan"
    }
  ],
  "writer": [
    {
      "id": "nm3060331",
      "name": "Luv Ranjan",
      "description": "story"
    },
    {
      "id": "nm5303169",
      "name": "Rahul Mody",
      "description": "screenplay &"
    },
    {
      "id": "nm4812773",
      "name": "Tarun Jain",
      "description": "screenplay &"
    },
    {
      "id": "nm3060331",
      "name": "Luv Ranjan",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm4449711",
      "name": "Kartik Aaryan",
      "character": "Anshul       (as Kartik Tiwari)"
    },
    {
      "id": "nm0438484",
      "name": "Omkar Kapoor",
      "character": "Tarun"
    },
    {
      "id": "nm5478232",
      "name": "Sunny Singh Nijjar",
      "character": "Chauka"
    },
    {
      "id": "nm2410391",
      "name": "Nushrat Bharucha",
      "character": "Chiku"
    },
    {
      "id": "nm7674770",
      "name": "Ishita Raj",
      "character": "Kusum       (as Ishita Raj Sharma)"
    },
    {
      "id": "nm4449715",
      "name": "Sonnalli Seygall",
      "character": "Supriya       (as Sonalli Sehgal)"
    },
    {
      "id": "nm1263050",
      "name": "Mona Ambegaonkar",
      "character": "Supriya's mother"
    },
    {
      "id": "nm4442569",
      "name": "Joy Badlani",
      "character": "Anshul's father"
    },
    {
      "id": "nm7648624",
      "name": "Ratnesh Mani",
      "character": "Chucha's Friend"
    },
    {
      "id": "nm8255023",
      "name": "Rumana Molla",
      "character": "Ruchi"
    },
    {
      "id": "nm0768296",
      "name": "Sharat Saxena",
      "character": "Supriya's father"
    },
    {
      "id": "nm8249479",
      "name": "Karishma Sharma",
      "character": "Tina"
    }
  ],
  "overview": "After falling in love, three roommates experience changes in their lives.",
  "storyline": "Three simple and fun loving guys living in Gurgaon are looking for love. Each finds a girl of their tastes and all seems well. As time moves on, slowly and steadily they begin to wonder if their other halves are actually in love with them? What makes them think so? Are they right? Will their efforts of finding and keeping love pay off?",
  "plot": "Rajat (Kartik Aaryan), Nishant \"Liquid\" Agarwal (Divyendu Sharma) and Vikrant Chaudhary (Raayo S Bakhirta) are bachelors who live together in a flat in Noida. Rajat falls in love with Neha (Nushrat Bharucha). Nishant falls for Charu (Ishita Raj Sharma) who is his colleague. She makes him do a good part of her own work in office and also makes him foot her beauty parlour bills but he is naive enough to not understand that she is only using him for financial assistance and moral support. Charu has a boyfriend, Abhi, but they aren’t on the best of terms. Vikrant loves Riya (Sonalli Sehgall) who also can’t get over her boyfriend of 5 years, Varun. Rajat leaves the bachelor pad. Vikrant, however is aware of Varun, and also knows that Riya has not yet called off that relationship but he doesn’t mind waiting because he is besotted by Riya. On her part, Riya keeps assuring him that she will end the relationship but actually ends up sleeping with Varun while she is dating Vikrant. Missing their meetings and bar-hopping, the trio decide to take a time-out by themselves. All three women, however, find out and decide to accompany them to the beach where they eventually mingle. Charu here kisses Nishant, while Rajat has a fight with Neha back at home. Charu starts to ignore Nishant and ends up eventually insulting him openly at work. Rajat and Neha eventually work out their differences, but soon after, further problems arise between them (such as Neha's constant tantrums). Rajat becomes so frustrated that he walks out on Neha, telling her that she is 'not worthy' of him. Nishant goes into depression but is brought back to reality by his two friends Vikrant and Rajat who drive him to Charu's house and Nishant slaps Charu's boyfriend. Vikrant finds out that Riya slept with her ex and leaves her.\n\nIn the end the trio are seen sitting together, laughing and feeling happy with the moment they have with each other. In the end credits, the three girls whom the trio fell for are shown having new boyfriends.",
  "synopsis": "Anshul a.k.a. Gogo (Kartik Aaryan), Siddharth a.k.a. Chauka (Sunny Nijar) and Tarun a.k.a. Thakur (Omkar Kapoor) are flatmates and best friends. Gogo meets Ruchika a.k.a. Chiku (Nushrat Bharucha) and gives her his number. Siddharth ends up meeting Supriya (Sonnalli Seygall) at a family wedding and instantly falls for her. Thakur meets Kusum (Ishita Raj Sharma) while working out at the gym and they start seeing each other. The guys get into relationships with the girls. However, love gets lost in a while. Gogo disapproves of the proximity between Chiku and Sunny, her best friend. Siddharth helps Supriya and her family in their chores, but Supriya is not willing to take the relationship forward. Kusum does not support Thakur in his business adventure and is using him for her luxuries. After some time, Gogo finds out that Chiku always badmouths about him with her friends, Thakur has an argument with Kusum about his business and he realizes that Kusum is selfish. Supriya's marriage is fixed with an NRI Pankaj, when her parents find out about Siddharth's love for her they disapprove the match. That night Supriya arrives and says she will only marry Siddharth, The following morning Supriya's father arrives with police. Supriya testifies against Siddharth due to her father's threatening. Siddharth explains to her father that he will never see Supriya again and she can marry Pankaj without expecting any hindrances from him in exchange for dropping the police case against him. All three boys leave the girls. The film ends with them acknowledging that the only place where they can get true love is from their mother."
}