{
  "imdb_id": "tt4486728",
  "tmdb_id": "392033",
  "douban_id": null,
  "title": "Saved by Grace (2016)",
  "genres": [
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm3172831",
      "name": "Johnny Remo"
    }
  ],
  "writer": [
    {
      "id": "nm1680680",
      "name": "Lance Bachelder",
      "description": "screenplay"
    },
    {
      "id": "nm4582478",
      "name": "Kenneth Lemm",
      "description": "screenplay"
    },
    {
      "id": "nm4582478",
      "name": "Kenneth Lemm",
      "description": "treatment"
    },
    {
      "id": "nm3172831",
      "name": "Johnny Remo",
      "description": "co-writer"
    },
    {
      "id": "nm3172831",
      "name": "Johnny Remo",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm1827568",
      "name": "Catalina Rodriguez",
      "character": "Grace"
    },
    {
      "id": "nm0002901",
      "name": "Muse Watson",
      "character": "Jeremiah"
    },
    {
      "id": "nm0726939",
      "name": "Robin Riker",
      "character": "Anne"
    },
    {
      "id": "nm3816748",
      "name": "Candice Michele Barley",
      "character": "Jenna"
    },
    {
      "id": "nm7377716",
      "name": "Zachary Legendre",
      "character": "Luke"
    },
    {
      "id": "nm3675178",
      "name": "Terri Minton",
      "character": "Belle"
    },
    {
      "id": "nm1734712",
      "name": "Geoff Falk",
      "character": "David"
    },
    {
      "id": "nm0584091",
      "name": "Christopher Michael",
      "character": "Captain Moss Williams"
    },
    {
      "id": "nm1456571",
      "name": "Michael Joiner",
      "character": "Sam Jenkins"
    },
    {
      "id": "nm7378285",
      "name": "Holden Donnelly",
      "character": "Young Luke"
    },
    {
      "id": "nm7330486",
      "name": "Coulton Clark Hodges",
      "character": "Tommy"
    },
    {
      "id": "nm0005129",
      "name": "Joey Lawrence",
      "character": "Rick       (as Joseph Lawrence)"
    }
  ],
  "overview": "A retired police officer, despondent over the loss of his family, contemplates a dramatic decision which will change his life forever, until he meets a mysterious woman who, through her personal stories, gives him a reason to re-examine what is most important to him.",
  "storyline": "A retired police officer, despondent over the loss of his family, contemplates a dramatic decision which will change his life forever, until he meets a mysterious woman who, through her personal stories, gives him a reason to re-examine what is most important to him.",
  "plot": "Ohio high-schooler Cassie Sullivan, armed with an M4 carbine, emerges from the woods to raid an abandoned gas station. Upon entering, she hears a male voice calling for help. She finds a wounded man, who points a gun at her, but they each put their weapons down. His hand is under his jacket and as he takes it out, she sees a glint of metal and kills him. He was holding a crucifix and the screen cuts to black to show her backstory.\n\nA city-sized alien spaceship is circling Earth containing extraterrestrials referred to as \"The Others.\" Ten days later, The Others unleash their 1st Wave, an electromagnetic pulse that permanently destroys all electrical power, including vehicles and causing flying aircraft to fall. The 2nd Wave has The Others manipulate the Earth's fault lines, causing earthquakes and tsunamis that kill those living in coastal cities. For the 3rd Wave, The Others weaponize a strain of avian flu, using birds as carriers of the virus killing Cassie's mother.\n\nCassie, her father and her younger brother, Sam, find a refugee camp in the woods with roughly 300 survivors. A few days later, an army unit with working vehicles rolls into the camp. The unit's commander, Colonel Vosch, claims there is an imminent threat of a 4th Wave and they will take the children to safety at Wright-Patterson Air Force Base, intending to bring the buses back to retrieve the adults. Cassie is separated from Sam, and witnesses the adults being massacred by the army.\n\nCassie scavenges her way toward the base, but is shot in the leg by an unseen enemy and passes out. About a week later, she wakes up in the farmhouse of Evan Walker, who saved her. Cassie leaves towards the base with Evan, but learns that he is an Other, sent years ago as a sleeper agent and merged his consciousness into a human host. The sleepers roam their designated zones, killing human survivors. Evan admits his humanity was reactivated when he saw her, disagrees with the invasion and lets her leave. He warns that Colonel Vosch and the military are possessed by the consciousness of individual Others.\n\nAt the base, the military have used deception and technology to convince the rescued children that the humans outside the base have been possessed. They provide military training to the children, forming them into squads to go on kill missions outside the base. Sam has been placed into a squad led by Ben, a boy Cassie had a crush on, along with Ringer, a tough teenager, Dumbo and Teacup. While out on a kill mission, Ringer removes her military implant, causing her to register as an Other-possessed human on the squad's scopes. The squad deduces the plan to have them kill real humans, making them the 5th Wave. Ben sends his squad into the woods and returns to base, claiming his squad was killed, for the purpose of retrieving Sam, who was left behind.\n\nBen confronts Colonel Vosch about child warriors being the 5th Wave and Cassie kills Sergeant Reznik during her one-on-one indoctrination spiel. Ben and Cassie find each other and leave to find Sam. Evan sets off numerous bombs and advises them to quickly find Sam before the destruction of the entire facility. Colonel Vosch and the surviving military evacuate with the human children by military aircraft. Cassie, Ben, and Sam escape, with help from Ringer, just as Evan completes the destruction of the base. Ben's squad is reunited and Cassie ponders the strength of hope as humanity's driving force for survival.",
  "synopsis": "Rick, a retired police officer, is despondent over a personal loss and contemplates a dramatic decision of which will change his life forever. At a critical time in his life he meets a mysterious woman who, through her personal stories, gives him a reason to re-examine what is most important to him, Family."
}