{
  "imdb_id": "tt4446656",
  "tmdb_id": "321296",
  "douban_id": null,
  "title": "Fifty Shades Uncovered (2015)",
  "genres": [
    "Documentary"
  ],
  "country": "UK",
  "version": [],
  "imdb_rating": 5.2,
  "director": [
    {
      "id": "nm2078601",
      "name": "Sonia Anderson"
    }
  ],
  "writer": [
    {
      "id": "nm2078601",
      "name": "Sonia Anderson",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm7121537",
      "name": "Emily Agnes",
      "character": "Herself"
    },
    {
      "id": "nm7121535",
      "name": "Aura Borealis",
      "character": "Herself"
    },
    {
      "id": "nm7131622",
      "name": "Lauren Bowgen",
      "character": ""
    },
    {
      "id": "nm7131621",
      "name": "Eugene Doyle",
      "character": ""
    },
    {
      "id": "nm0248759",
      "name": "Jenny Eclair",
      "character": "Herself"
    },
    {
      "id": "nm7121539",
      "name": "Simon Francis",
      "character": "Himself"
    },
    {
      "id": "nm5988606",
      "name": "Tessa Gaukroger",
      "character": "Herself"
    },
    {
      "id": "nm7121540",
      "name": "Philip Goulding",
      "character": "Himself"
    },
    {
      "id": "nm2644578",
      "name": "Phillip Hodson",
      "character": "Himself"
    },
    {
      "id": "nm2682570",
      "name": "Katie Hopkins",
      "character": "Herself"
    },
    {
      "id": "nm1093317",
      "name": "E.L. James",
      "character": "Herself"
    },
    {
      "id": "nm7121536",
      "name": "Mistress Josephine",
      "character": "Herself"
    },
    {
      "id": "nm7131637",
      "name": "Joanna Kite",
      "character": "Herself"
    },
    {
      "id": "nm7131638",
      "name": "Sara Nelson",
      "character": "Herself"
    },
    {
      "id": "nm6394666",
      "name": "Marina O'Shea",
      "character": "Herself"
    },
    {
      "id": "nm4355037",
      "name": "David Wartnaby",
      "character": "Himself       (voice)"
    },
    {
      "id": "nm7121538",
      "name": "Chris White",
      "character": "Himself"
    }
  ],
  "overview": "As the 50 Shades craze continues to smash sales records, this documentary provides an intimate look into why the books have become such a success. Featuring exclusive interviews with archive from the twilight zone of submissive romance.",
  "storyline": "The bestselling adult novel of all time has introduced bondage into the bedroom with sales surpassing both The Da Vinci Code and the entire Harry Potter series. The novels are classified as erotic fiction, but author E.L. James calls it adult romance and its inspiration was to be erotic fan fiction for the Twilight saga. Fifty Shades Uncovered is a brand new feature documentary filmed in London and New York which explores the twilight zone of submissive romance and the power of the Fifty Shades of Grey film and books. Featuring the latest interviews from authors, stars and fans, Fifty Shades Uncovered lifts the lid on a cultural and sexual phenomenon that just won't be restrained anymore!",
  "plot": "Twenty-one-year-old Anastasia \"Ana\" Steele (Dakota Johnson) is an English literature major at Washington State University (\"WSU\")'s satellite campus near Vancouver, Washington. Her roommate, Kate Kavanagh (Eloise Mumford), becomes ill and is unable to interview Christian Grey (Jamie Dornan), a 27-year-old billionaire entrepreneur, for the college newspaper. Ana agrees to go in her place and meets Christian at his Seattle headquarters, literally stumbling her way through the meeting. Christian, who is that year's WSU commencement speaker, takes an interest in her; soon afterward, he visits the hardware store where Ana works. He agrees to Ana's request for a photo shoot to accompany the article.\n\nAfter the photo shoot, Christian invites Ana for coffee, but he leaves abruptly, saying he is not the man for her. Christian later sends Ana first edition copies of two Thomas Hardy novels, including Tess of the d'Urbervilles, as a gift.\n\nAna and her friends go to a bar to celebrate graduation, and Ana spontaneously calls Christian, saying she is returning the books and berating his behavior towards her. He goes to the bar to find Ana, even though she doesn't tell him where she is. While they are talking at the bar, Ana passes out. She wakes up the next morning in Christian's hotel room and is relieved when he says they were not intimate.\n\nAna and Christian begin seeing each other, though he insists that she sign a non-disclosure agreement preventing her from revealing details about their alliance. Christian explains that he only has interrelations involving bondage that is clearly defined in a signed contract. Ana reveals that she is a virgin. While considering the agreement and negotiating her own terms, and after visiting his \"playroom\", a room stocked with a variety of BDSM toys, furniture, and gear, she and Christian have sex.\n\nChristian bestows Ana with gifts and favors, such as a new car and laptop computer. After Ana and Kate move to Seattle, Ana grows closer to Christian. One night, she accompanies him to his parents' house. During dinner, Ana suddenly mentions she is leaving the next day to visit her mother in Georgia. Later, Christian becomes frustrated when Ana expresses she wants romance rather than the one-sided relationship he proposes. She is shocked when Christian unexpectedly arrives in Georgia and meets her in the hotel where she is dining with her mother. He takes Ana on a glider flight, and she feels thrilled. He leaves soon afterward, to tend to an emergency in Seattle.\n\nAfter returning home, Ana continues seeing Christian, who wants further sexual experimentation. Ana initially consents and participates willingly. Christian, however, keeps Ana emotionally distant, upsetting her. While still considering the contract, and in an effort to understand Christian psychologically, Ana asks him to demonstrate how he would \"punish\" her for rule breaking. Christian whips Ana's buttocks six times with a belt, making her count out each strike. When he attempts to help her up, she angrily shoves him away, upset and disgusted. That treatment is far from Ana's romantic expectations, and she leaves after concluding that Christian is wrong for her, and that his practices border on being deviant and excessive.\n\nIn an alternate ending, both Ana and Christian experience flashbacks. Christian jogs in the rain, while Ana sobs in her apartment. Christian encounters a gift Ana gave him with the note: \"This reminded me of a happy time. —Ana\".",
  "synopsis": null
}