{
  "imdb_id": "tt4409912",
  "tmdb_id": "389864",
  "douban_id": null,
  "title": "The Marriage of Reason & Squalor (2015)",
  "genres": [
    "Comedy",
    "Drama",
    "Fantasy",
    "Romance"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "86 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.5,
  "director": [
    {
      "id": "nm2064539",
      "name": "Jake Chapman"
    }
  ],
  "writer": [
    {
      "id": "nm2064539",
      "name": "Jake Chapman",
      "description": "novel"
    },
    {
      "id": "nm0635431",
      "name": "Brock Norman Brock",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0025852",
      "name": "Ronni Ancona",
      "character": "Hen 3"
    },
    {
      "id": "nm7150190",
      "name": "Nnenna Ani",
      "character": "Choir leader"
    },
    {
      "id": "nm1282920",
      "name": "Noma Dumezweni",
      "character": "Maman Terreblanche"
    },
    {
      "id": "nm0248759",
      "name": "Jenny Eclair",
      "character": "Hen 4"
    },
    {
      "id": "nm0280332",
      "name": "Michael Fitzgerald",
      "character": "Captain Oceanic"
    },
    {
      "id": "nm2529765",
      "name": "Chloe Hayward",
      "character": "Hen 2"
    },
    {
      "id": "nm0406975",
      "name": "Rhys Ifans",
      "character": "Helmut Mandragorass /              Dr. Algernon Hertz"
    },
    {
      "id": "nm4080531",
      "name": "Sophie Kennedy Clark",
      "character": "Lydia"
    },
    {
      "id": "nm5438664",
      "name": "Paul Low-Hang",
      "character": "Voodoo Priest       (credit only)"
    },
    {
      "id": "nm1277450",
      "name": "Kellie Shirley",
      "character": "Hen 2"
    }
  ],
  "overview": "With a name like Chlamydia Love, it comes as no surprise that the young lady in question is considered to be the office slut. Her colleagues also do not miss an occasion to ridicule her when she talks about her imaginary prince on a white horse. Chlamydia couldn’t care less. She just has to jump into a flushing toilet bowl to meet her beloved, the handsome surgeon Algernon Hertz. But her precious prince keeps her waiting and locals turn out to be a whole lot more savage that what is mentioned in the glossy tourist brochures. Chlamydia has to go on the run and ends up in the lair of the misanthropic scientist Helmut Mandragorass, a specimen of the male race not exactly blessed with dashing looks as his protruding forehead dwarves everything else. Paradise isn’t always what it seems to be.",
  "storyline": "A young girl visits the island that her fiance gave her as a wedding gift, only to find that it is full of surprises.",
  "plot": null,
  "synopsis": "Mills And Doom: The Marriage Of Reason And Squalor is adapted from Jake Chapmans 2008 debut novel of the same name, which was a satire of the paperback romance.It follows Lydia (Sophie Kennedy Clark) whose dashing surgeon fiancé has given her a desert island as a wedding present. She travels to the island to wait for him, but meets Helmut (Rhys Ifans), a reclusive and misshapen author. Helmut exerts a strange control over Lydia who, battling with her emotions, begins to suspect that all is not what it seems on the island. As she awaits the return of her beloved fiancé, she begins to question everything around her and fights desperately to determine what is real and what is her own fantasy."
}