{
  "imdb_id": "tt4454246",
  "tmdb_id": "331187",
  "douban_id": null,
  "title": "Superwelt (2015)",
  "genres": [
    "Drama"
  ],
  "country": "Austria",
  "version": [
    {
      "runtime": "120 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.3,
  "director": [
    {
      "id": "nm0548686",
      "name": "Karl Markovics"
    }
  ],
  "writer": [
    {
      "id": "nm0548686",
      "name": "Karl Markovics",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0067235",
      "name": "Ulrike Beimpold",
      "character": "Gabi Kovanda"
    },
    {
      "id": "nm3165603",
      "name": "Nikolai Gemel",
      "character": "Ronnie Kovanda"
    },
    {
      "id": "nm2464621",
      "name": "Simon Jaritz",
      "character": "Zeuge Jehovas"
    },
    {
      "id": "nm2702667",
      "name": "Thomas Mraz",
      "character": "Georg"
    },
    {
      "id": "nm6170086",
      "name": "Angelika Strahser",
      "character": "Sabine Kovanda"
    },
    {
      "id": "nm3776873",
      "name": "Rainer Wöss",
      "character": "Hannes Kovanda"
    },
    {
      "id": "nm4675314",
      "name": "Kati Zambito",
      "character": "Zeugin Jehovas"
    }
  ],
  "overview": "SUPERWORLD is a story about God and the world: a world whose heroine WORKS the till and a God we never see nor hear, but whose presence we feel throughout the film. Lead actress Ulrike Beimpold delivers a remarkable, moving performance as a woman under divine influence, a woman in crisis who sends shock waves through her whole family. While director Karl Markovics consistently works in a realistic mode, his narrative approach is often operatic, with elaborate bird’s eye shots and strikingly composed images of biblical proportions that make God’s presence manifest. Until, that is, the twilight of the gods descends and the heavens come crashing down on the plot. All good things come from above, after all. SUPERWORLD is like a small miracle. A super good one.",
  "storyline": "Gabi is a cashier at a local supermarket in a small town in Austria. A middle aged plump woman, she is married to a community worker and has two grown kids. Her life consists mainly of routine and her husband does not show much interest for her anymore. One day she begins to feel stalked by voices only she can hear. The voices become more and more regular and she begins to listen to them while she struggles to keep up with her daily chores. She neglects her housekeeping duties and prefers long walks instead. Her family becomes aware of her strange behavior and when they question her she leaves home. Gabi's flight turns into an odyssey through the surrounding nature while she is completely possessed to the voices. After a while she begins to get angry about them since they seem to ask questions and demand actions but don't give advise. Since she does not come home anymore her worried husband starts to search for her. Meanwhile she realizes that while she hoped for answers all she got ...",
  "plot": null,
  "synopsis": null
}