{
  "imdb_id": "tt4410798",
  "tmdb_id": "356606",
  "douban_id": null,
  "title": "Mang long te jiong (2015)",
  "genres": [
    "Action",
    "Comedy"
  ],
  "country": "Hong Kong",
  "version": [
    {
      "runtime": "114 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.7,
  "director": [
    {
      "id": "nm2734866",
      "name": "Mark Wu"
    }
  ],
  "writer": [
    {
      "id": "nm2734866",
      "name": "Mark Wu",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0155617",
      "name": "Ronald Cheng",
      "character": "Dream Dragon"
    },
    {
      "id": "nm7823761",
      "name": "Jessy Li",
      "character": "Baby"
    },
    {
      "id": "nm3524987",
      "name": "Ava Liu",
      "character": "Kwan"
    },
    {
      "id": "nm2734866",
      "name": "Mark Wu",
      "character": "James"
    },
    {
      "id": "nm6184064",
      "name": "Jianping Yang",
      "character": "Killer       (as JianPing Yang)"
    },
    {
      "id": "nm0376985",
      "name": "Benjamin Yeung",
      "character": "Participant"
    }
  ],
  "overview": "Roger Li, the son of the richest man in town, is involved in a car accident which has soon become the talk of the town. The only witness James, nervous and terrified, denies witnessing the accident and seems to withhold the truth. Veteran undercover cop Dream Dragon and James are old time buddies; with an intention to take advantage of their relationship, Dragon approaches James to investigate this suspected substitute case.  James’ beloved sister Kwan is born with a serious eye disease. Her only wish before losing her sight totally is for James to realise his dream of being a popular superstar. It is the motivation for James to join the male pageant “Man of China” in hope to win the competition. Meanwhile, James is invited by a renowned director to work abroad on his new international project. However, the shooting period overlaps with the court date of the case.  It turns out that everything is controlled by a mastermind with a premeditated intention yet to be revealed…",
  "storyline": "Undercover cop Dream Dragon takes on a special operation, which is to protect his old-time buddy, flaunty James, during a male pageant contest. James being the only witness of a suspected substitute case that involves the son of the richest developer, the police uses the chance to bait the killer. But Dragon and James' incompatibility complicates matter for the operation.",
  "plot": null,
  "synopsis": null
}