{
  "imdb_id": "tt4450706",
  "tmdb_id": "332788",
  "douban_id": null,
  "title": "Husband Factor (2015)",
  "genres": [
    "Comedy",
    "Drama",
    "Fantasy",
    "Romance"
  ],
  "country": "Turkey",
  "version": [
    {
      "runtime": "108 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm1738966",
      "name": "Kivanc Baruonu"
    }
  ],
  "writer": [
    {
      "id": "nm1738966",
      "name": "Kivanc Baruonu",
      "description": "co-writer"
    },
    {
      "id": "nm7124861",
      "name": "Sebnem Burcuoglu",
      "description": "co-writer"
    }
  ],
  "cast": [
    {
      "id": "nm1256344",
      "name": "Bora Akkas",
      "character": "Mehmet Lütfi"
    },
    {
      "id": "nm7810811",
      "name": "Gül Arici",
      "character": "Gül"
    },
    {
      "id": "nm1758599",
      "name": "Enis Arikan",
      "character": "Mehmet"
    },
    {
      "id": "nm7124861",
      "name": "Sebnem Burcuoglu",
      "character": "Selin"
    },
    {
      "id": "nm1699313",
      "name": "Ebru Cündübeyoglu",
      "character": "Nur"
    },
    {
      "id": "nm6102521",
      "name": "Eda Ece",
      "character": "Ceren"
    },
    {
      "id": "nm9483639",
      "name": "Ilkay Eren",
      "character": "Ali"
    },
    {
      "id": "nm3734280",
      "name": "Leyla Giraud",
      "character": "Burcu       (as Leyla Erdogan)"
    },
    {
      "id": "nm2387600",
      "name": "Esin Gündogdu",
      "character": "Saniye"
    },
    {
      "id": "nm0962246",
      "name": "Ismail Incekara",
      "character": "Oktay"
    },
    {
      "id": "nm8404449",
      "name": "Caner Kadayifçi",
      "character": "Hayrican"
    },
    {
      "id": "nm3459164",
      "name": "Gülenay Kalkan",
      "character": "Gonul"
    },
    {
      "id": "nm3066794",
      "name": "Pelin Ekinci Kaya",
      "character": "Astrolog"
    },
    {
      "id": "nm1487121",
      "name": "Cem Kiliç",
      "character": "Timur"
    },
    {
      "id": "nm6234841",
      "name": "Cem Korkmaz",
      "character": "Bickin"
    },
    {
      "id": "nm9483638",
      "name": "Ayten Misirlioglu",
      "character": "Türesin"
    },
    {
      "id": "nm1759326",
      "name": "Ezgi Mola",
      "character": "Efsun"
    },
    {
      "id": "nm2999575",
      "name": "Serdar Ortaç",
      "character": "Serdar Ortac"
    },
    {
      "id": "nm6181587",
      "name": "Efecan Senolsun",
      "character": "Murat"
    },
    {
      "id": "nm0785040",
      "name": "Nevra Serezli",
      "character": "Peyker"
    },
    {
      "id": "nm0845578",
      "name": "Sebnem Sönmez",
      "character": "Aysel"
    },
    {
      "id": "nm8039929",
      "name": "Erkin Can Tanisan",
      "character": "Maki"
    },
    {
      "id": "nm5547533",
      "name": "Burak Topaloglu",
      "character": "Alpdirek"
    },
    {
      "id": "nm1959252",
      "name": "Muhammet Uzuner",
      "character": "Yazar"
    },
    {
      "id": "nm1732318",
      "name": "Murat Yildirim",
      "character": "Sinan"
    },
    {
      "id": "nm4365972",
      "name": "Sirincan Çakiroglu",
      "character": "Seval"
    },
    {
      "id": "nm9539283",
      "name": "Ülkü Hilal Çiftçi",
      "character": ""
    },
    {
      "id": "nm5271258",
      "name": "Begüm Öner",
      "character": "Merve"
    },
    {
      "id": "nm7682440",
      "name": "Romina Özipekçi",
      "character": "Ferda"
    },
    {
      "id": "nm7393774",
      "name": "Emine Gülsüm Özümer",
      "character": "Üresin"
    }
  ],
  "overview": "A traditional Turkish woman tries to find love and is forced by her family members to get married.",
  "storyline": "The Husband Factor is the story of Efsun (30) who seeks true love and a romantic relationship rather than a husband. She is the black sheep of her peers and the women of her family who are programmed for marriage. She is seeking love yet she does not know what most girls know; how to strike an attitude, or how to manipulate a man. Hence, she has not had a single steady relationship to date. The good news is that her family is dedicated to initiating Efsun into the intricacies of womanhood and ensuring that she gets hitched into the happily ever after. Efsun surrenders herself into the capable hands of these women. As they are getting ready to re-launch her, Efsun runs into her high school friend and former flame Sinan. He is the one, the boyfriend she was never able to get over or replace.",
  "plot": "In the 1970s, in France, an American couple, former dancer Vanessa and her husband Roland, a successful writer, have been married 14 years. They drive to a coastal hotel. Roland wants to write a story while staying there. The two are barely on speaking terms; Vanessa is withdrawn and grieving for an unknown reason. Roland appears to drink too much and seems unhappy that Vanessa is no longer interested in him sexually.\n\nRoland becomes friendly with the local cafe owner, an older man still grieving his much-loved late wife, but who carries on, cheerfully accepting what life has given him. Vanessa watches a local fisherman who goes out every day on the outgoing tide and returns on the incoming one, catching few fish, but contented.\n\nVanessa and Roland strike up a friendship with an attractive young couple staying in the room next to them. Soon after, they discover that the wall between their two rooms has a disused radiator pipe hole, enabling them to watch the couple in their bedroom talking and having sex.\n\nGradually their experiences at the hotel enable Vanessa and Roland to start patching up their relationship. However, Vanessa attempts a liaison with the young husband in the next room, interrupted violently by Roland, who has been watching through the wall. He bruises the husband, who must later explain to his wife and does so truthfully, seriously damaging the relationship between the young couple. This also triggers a confrontation between Vanessa and Roland, during which he tells her that if she wishes to hurt him, she should just go ahead and hurt him physically. Roland asserts that her seduction of the husband was motivated by his wife's envy of the young couple - particularly of their ability to bear children. Roland physically restrains Vanessa against a wall and makes her speak of herself being barren which they haven't been able to talk about. After a short struggle, Vanessa breaks down and weeps for her loss. Later, Roland explains to the young wife that two miscarriages caused Vanessa's lasting grief, withdrawal and behavior toward her husband.\n\nHaving finally come to terms with their life together, Vanessa seems able to go on and Roland is able to finish writing a new book. It seems also that the young couple next door may be able to work their way through the episode as well, and come out stronger on the other side.\n\nAs Vanessa and Roland leave the hotel and drive away, they appear to be reconciled.",
  "synopsis": null
}