{
  "imdb_id": "tt4460546",
  "tmdb_id": "356380",
  "douban_id": null,
  "title": "Long Live the Bride (2015)",
  "genres": [
    "Drama"
  ],
  "country": "Italy",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.2,
  "director": [
    {
      "id": "nm2141178",
      "name": "Ascanio Celestini"
    }
  ],
  "writer": [
    {
      "id": "nm2141178",
      "name": "Ascanio Celestini",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2141178",
      "name": "Ascanio Celestini",
      "character": "Nicola"
    },
    {
      "id": "nm2130040",
      "name": "Alba Rohrwacher",
      "character": "Sofia"
    },
    {
      "id": "nm3013374",
      "name": "Salvatore Striano",
      "character": "Sasà"
    },
    {
      "id": "nm7202169",
      "name": "Francesco De Miranda",
      "character": "Salvatore"
    },
    {
      "id": "nm4134670",
      "name": "Veronica Cruciani",
      "character": "Anna"
    },
    {
      "id": "nm1271717",
      "name": "Pietro Faiella",
      "character": "Abruzzese"
    },
    {
      "id": "nm7217179",
      "name": "Mario Sgueglia",
      "character": "Michele"
    },
    {
      "id": "nm6650802",
      "name": "Gianni D'Addario",
      "character": "Marino"
    },
    {
      "id": "nm0969364",
      "name": "Corrado Invernizzi",
      "character": "Concellino"
    },
    {
      "id": "nm0885295",
      "name": "Barbara Valmorin",
      "character": "Madre di Nicola"
    },
    {
      "id": "nm0738873",
      "name": "Dora Romano",
      "character": "Madre di Sasà"
    },
    {
      "id": "nm7599186",
      "name": "Mimi Gunnarsson",
      "character": "Sposa americana"
    },
    {
      "id": "nm0010271",
      "name": "Francesco Acquaroli",
      "character": "Carmine"
    },
    {
      "id": "nm0273927",
      "name": "Pieraldo Ferrante",
      "character": "Vecchio della villa di lusso"
    },
    {
      "id": "nm4157641",
      "name": "David Gallarello",
      "character": "Poliziotto 2"
    },
    {
      "id": "nm6591076",
      "name": "Diego Maiello",
      "character": "Padre del bambino"
    },
    {
      "id": "nm4041800",
      "name": "Mauro Marchetti",
      "character": "Gnorri incidente"
    },
    {
      "id": "nm0637018",
      "name": "Alessandro Novelli",
      "character": "Poliziotto 1"
    },
    {
      "id": "nm2580188",
      "name": "Paolo Perinelli",
      "character": "Vecchio in motorino"
    },
    {
      "id": "nm6607538",
      "name": "Gabriele Picciotto",
      "character": "Testimone incidente"
    },
    {
      "id": "nm8049068",
      "name": "Laura Riccioli",
      "character": "Signora in motorino"
    },
    {
      "id": "nm4134653",
      "name": "Annamaria Spalloni",
      "character": "Inserviente"
    },
    {
      "id": "nm7643467",
      "name": "Matteo Vignati",
      "character": "Poliziotto 3"
    },
    {
      "id": "nm1563975",
      "name": "Marco Zangardi",
      "character": "Macchinone"
    }
  ],
  "overview": "In a despairing, fatalistic Rome, Nicola finds himself flirting with the city’s dark side. Drinking too much and living among drifters, petty criminals and anxious immigrants, Nicola becomes entwined in an insurance scam that leads him further into a netherworld he may never escape.",
  "storyline": "The plot is about the brutal killing of Giuseppe Uva. Every suspects are on police.",
  "plot": "Dr. Frederick Frankenstein (Gene Wilder) is a lecturing physician at an American medical school and engaged to the tightly wound socialite Elizabeth (Madeline Kahn). He becomes exasperated when anyone brings up the subject of his grandfather, the infamous mad scientist; to dissociate himself from his forebear, Frederick insists that his surname is pronounced \"Fronkensteen.\" When a solicitor informs him that he has inherited his family's estate in Transylvania after the death of his great-grandfather, the Baron Beaufort von Frankenstein, Frederick travels to Europe to inspect the property. At the Transylvania train station, he is met by a hunchbacked, bug-eyed servant named Igor (Marty Feldman), and a lovely young personal assistant named Inga (Teri Garr).\n\nUpon arrival at the estate, Frederick meets the forbidding housekeeper Frau Blücher (Cloris Leachman). Upon discovering the secret entrance to his grandfather's laboratory and reading his private journals, Frederick is so captivated that he decides to resume his grandfather's experiments in re-animating the dead. He and Igor steal the corpse of a recently executed criminal, and Frederick sets to work experimenting on the large corpse. Matters go awry when Igor is sent to steal the brain of a deceased revered historian, Hans Delbrück; startled by lightning, he drops and ruins Delbrück's brain. Taking a second brain, Igor returns with a brain labeled \"Do Not Use This Brain! Abnormal\", which Frederick unknowingly transplants into the corpse.\n\nSoon, Frederick is ready to re-animate his creature (Peter Boyle), who is eventually brought to life by electrical charges during a lightning storm. The creature makes its first halting steps, but, frightened by Igor lighting a match, he attacks Frederick and must be sedated. Meanwhile, the townspeople are uneasy at the possibility of Frederick continuing his grandfather's work, unaware of the creature's existence; most concerned is Inspector Kemp (Kenneth Mars), a one-eyed police official with a prosthetic arm and a thick German accent. Kemp visits the doctor and subsequently demands assurance that he will not create another monster. Upon returning to the lab, Frederick discovers Blücher setting the creature free. After she reveals the monster's love of violin music and her own romantic relationship with Frederick's grandfather, the creature is enraged by sparks from a thrown switch and escapes from the Frankenstein castle.\n\nWhile roaming the countryside, the monster has frustrating encounters with a young girl and a blind hermit (Gene Hackman). Frederick recaptures the monster and locks the two of them in a room, where he calms the monster's homicidal tendencies with flattery and fully acknowledges his own heritage, shouting out emphatically, \"My name is Frankenstein!\". Frederick offers the sight of \"The Creature\" following simple commands to a theater full of illustrious guests. The demonstration continues with Frederick and the monster launching into the musical number \"Puttin' On the Ritz\". However, the routine ends disastrously when a stage light explodes and frightens the monster, who becomes enraged and charges into the audience, where he is captured and chained by police. Back in the laboratory, Inga attempts to comfort Frederick and the two wind up sleeping together on the suspended reanimation table.\n\nThe monster escapes with Elizabeth when she arrives unexpectedly for a visit. Elizabeth falls in love with the creature due to his inhuman stamina and his enormous penis (referred to as Schwanstuker or Schwanzstück). The townspeople hunt for the monster. Desperate to get the creature back, Frederick plays the violin to lure his creation back to the castle. Just as the Kemp-led mob storms the laboratory, Frankenstein transfers some of his stabilizing intellect to the creature who, as a result, is able to reason with and placate the mob. Elizabeth marries the now erudite and sophisticated monster—with her hair styled identically to that of the female creature from the Bride of Frankenstein, while Inga joyfully learns what her new husband Frederick got in return during the transfer procedure—the monster's Schwanzstücker.",
  "synopsis": null
}