{
  "imdb_id": "tt4463248",
  "tmdb_id": "359538",
  "douban_id": null,
  "title": "The Canterville Ghost (2016)",
  "genres": [
    "Comedy",
    "Fantasy",
    "Romance"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.7,
  "director": [
    {
      "id": "nm1367933",
      "name": "Yann Samuell"
    }
  ],
  "writer": [
    {
      "id": "nm1367933",
      "name": "Yann Samuell",
      "description": "adaptation"
    },
    {
      "id": "nm1367933",
      "name": "Yann Samuell",
      "description": "dialogue"
    },
    {
      "id": "nm1367933",
      "name": "Yann Samuell",
      "description": "screenplay"
    },
    {
      "id": "nm0928492",
      "name": "Oscar Wilde",
      "description": "novel"
    }
  ],
  "cast": [
    {
      "id": "nm1109153",
      "name": "Audrey Fleurot",
      "character": "Aliénor de Canterville"
    },
    {
      "id": "nm0949210",
      "name": "Michaël Youn",
      "character": "Gwilherm"
    },
    {
      "id": "nm0488477",
      "name": "Michèle Laroque",
      "character": "Elisabeth"
    },
    {
      "id": "nm0040005",
      "name": "Lionnel Astier",
      "character": "Alain"
    },
    {
      "id": "nm7878402",
      "name": "Mathilde Daffe",
      "character": "Virginia"
    },
    {
      "id": "nm2486832",
      "name": "Julien Frison",
      "character": "Erwan"
    },
    {
      "id": "nm8575034",
      "name": "Djelhan Wague",
      "character": "Eusèbe"
    },
    {
      "id": "nm8575035",
      "name": "Luka Micheli",
      "character": "Zachary"
    },
    {
      "id": "nm6397847",
      "name": "Finn Bell",
      "character": "Patron bistrot"
    },
    {
      "id": "nm0649817",
      "name": "Françoise Oriane",
      "character": "Grand-mère d'Erwan"
    },
    {
      "id": "nm1143841",
      "name": "Nicole Shirer",
      "character": "Mamie sourde"
    },
    {
      "id": "nm7281567",
      "name": "Chloé de Grom",
      "character": "Assistante Castel-Bernier"
    },
    {
      "id": "nm0315146",
      "name": "Didier Gesquière",
      "character": "Castel-Bernier"
    },
    {
      "id": "nm1280304",
      "name": "Michelangelo Marchese",
      "character": "Gauvain"
    },
    {
      "id": "nm3845185",
      "name": "Jean-Marie Debol",
      "character": "Agent immobilier       (as Jean-Marie de Bol)"
    },
    {
      "id": "nm1389632",
      "name": "Emmanuelle Grönvold",
      "character": "Professeur d'art dramatique"
    },
    {
      "id": "nm4066639",
      "name": "Sarah Ber",
      "character": "Elève art dramatique (Roxane)"
    },
    {
      "id": "nm4516761",
      "name": "Arthur Buyssens",
      "character": "Elève art dramatique (Christian)       (as Arths Buyssens)"
    },
    {
      "id": "nm5744632",
      "name": "Lucas Moreau",
      "character": "Elève conservatoire (Cyrano)"
    },
    {
      "id": "nm4192555",
      "name": "Théo Dardenne",
      "character": "Elève conservatoire (Christian)"
    },
    {
      "id": "nm7675099",
      "name": "Julie Janssens",
      "character": "Doublure escrime"
    }
  ],
  "overview": null,
  "storyline": "In the depths of a British legend, the ghost of Eleanor Canterville is condemned to haunt the castle of his family and to scare away any inhabitant. It fulfills this task perfectly, helped by Gwilherm, his faithful servant. But when Otis, a family fleeing Parisian life, buy the castle, Eleanor is upset because she cannot scare this tribe of the twenty-first century. Worse yet, children ridicule and parents are unaware. Only Virginia Otis, aged fifteen, moved by the fate of Canterville Ghost, will seek to deliver from curse on it.",
  "plot": "The story begins when Mr Otis and family move into Canterville Chase, despite warnings from Lord Canterville that the house is haunted. Mr Otis says that he will take the furniture as well as the ghost at valuation. The Otis family includes Mr and Mrs Otis, their eldest son Washington, their daughter Virginia and the Otis twins. The other characters include the Canterville Ghost, the Duke of Cheshire (who wants to marry Virginia), Mrs Umney (the housekeeper), and Rev. Augustus Dampier. At first, none of the Otis family believe in ghosts, but shortly after they move in, none of them can deny the presence of Sir Simon de Canterville . The family hears clanking chains, they witness reappearing bloodstains \"on the floor just by the fireplace\", which are removed every time they appear in various forms. But, humorously, none of these scare the Otis family in the least. In fact, upon hearing the clanking noises in the hallway, Mr Otis promptly gets out of bed and pragmatically offers the ghost Tammany Rising Sun Lubricator to oil his chains.\n\nDespite the ghost's efforts to appear in the most gruesome guises, the family refuses to be frightened, and Sir Simon feels increasingly helpless and humiliated. When Mrs Otis notices a mysterious red mark on the floor, she simply replies that she does \"not at all care for blood stains in the sitting room\". When Mrs Umney informs Mrs Otis that the blood stain is indeed evidence of the ghost and cannot be removed, Washington Otis, the eldest son, suggests that the stain will be removed with Pinkerton's Champion Stain Remover and Paragon Detergent: a quick fix, like the Tammany Rising Sun Lubricator, and a practical way of dealing with the problem.\n\nWilde describes Mrs Otis as \"a very handsome middle-aged woman\" who has been \"a celebrated New York belle\". Her expression of \"modern\" American culture surfaces when she immediately resorts to giving the ghost \"Doctor Dobell's tincture\", thinking he was screaming due to indigestion, at the family's second encounter with the ghost, and when she expresses an interest in joining the Psychical Society to help her understand the ghost. Mrs Otis is given Wilde's highest praise when he says: \"Indeed, in many respects, she was quite English...\"\n\nThe most colourful character in the story is undoubtedly the ghost himself, Sir Simon, who goes about his duties with theatrical panache and flair. He assumes a series of dramatic roles in his failed attempts to impress and terrify the Otises, making it easy to imagine him as a comical character in a stage play. The ghost has the ability to change forms, so he taps into his repertoire of tricks. He takes the role of ghostly apparitions such as a Headless Earl, a Strangled Babe, the Blood-Sucker of Bexley Moor, Suicide's Skeleton, and the Corpse-Snatcher of Chertsey Barn, all having succeeded in horrifying previous castle residents over the centuries. But none of them works with these Americans. Sir Simon schemes, but even as his costumes become increasingly gruesome, his antics do nothing to scare his house guests, and the Otises beat him every time. He falls victim to tripwires, peashooters, butter-slides, and falling buckets of water. In a particularly comical scene, he is frightened by the sight of a \"ghost\" rigged up by the mischievous twins.\n\nDuring the course of the story, as narrated from Sir Simon's viewpoint, he tells us the complexity of the ghost's emotions: he sees himself brave, frightening, distressed, scared, and finally, depressed and weak. He exposes his vulnerability during an encounter with Virginia, the Otis's fifteen-year-old daughter. Virginia is different from everyone else in the family, and Sir Simon recognizes this. He tells her that he has not slept in three hundred years and wants desperately to do so. The ghost reveals to Virginia the tragic tale of his wife, Lady Eleanor de Canterville.\n\nUnlike the rest of her family, Virginia does not dismiss the ghost. She takes him seriously: she listens to him and learns an important lesson, as well as the true meaning behind a riddle. Sir Simon de Canterville says that she must weep for him, for he has no tears; she must pray for him, for he has no faith; and then she must accompany him to the angel of death and beg for Death's mercy upon Sir Simon. She does weep for him and pray for him, and she disappears with Sir Simon through the wainscoting and goes with him to the Garden of Death and bids the ghost farewell. Then she reappears at midnight, through a panel in the wall, carrying jewels and news that Sir Simon has passed on to the next world and no longer resides in the house.\n\nVirginia's ability to accept Sir Simon leads to her enlightenment: Sir Simon, she tells her husband several years later, helped her understand \"what Life is, what Death signifies, and why Love is stronger than both\". The story ends with Virginia marrying the Duke of Cheshire after they both come of age.",
  "synopsis": null
}