{
  "imdb_id": "tt4411504",
  "tmdb_id": "352161",
  "douban_id": null,
  "title": "The Clan (2015)",
  "genres": [
    "Biography",
    "Crime",
    "Drama",
    "Thriller"
  ],
  "country": "Argentina",
  "version": [
    {
      "runtime": "108 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.0,
  "director": [
    {
      "id": "nm0871086",
      "name": "Pablo Trapero"
    }
  ],
  "writer": [
    {
      "id": "nm2265326",
      "name": "Julian Loyola",
      "description": null
    },
    {
      "id": "nm1167870",
      "name": "Esteban Student",
      "description": null
    },
    {
      "id": "nm0871086",
      "name": "Pablo Trapero",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0289856",
      "name": "Guillermo Francella",
      "character": "Arquímedes Puccio"
    },
    {
      "id": "nm7506705",
      "name": "Gastón Cocchiarale",
      "character": "Maguila Puccio"
    },
    {
      "id": "nm2306611",
      "name": "Peter Lanzani",
      "character": "Alejandro Puccio"
    },
    {
      "id": "nm7506707",
      "name": "Stefanía Koessl",
      "character": "Mónica"
    },
    {
      "id": "nm1244060",
      "name": "Aníbal Barengo",
      "character": "Basualdo"
    },
    {
      "id": "nm6120099",
      "name": "Aldo Onofri",
      "character": "Ordoñez"
    },
    {
      "id": "nm3491290",
      "name": "Rubén Estévez",
      "character": "Comisario"
    },
    {
      "id": "nm8097540",
      "name": "Miguel Ángel Lembo",
      "character": "Comodoro"
    },
    {
      "id": "nm0039968",
      "name": "Fabio Aste",
      "character": "Secretario Comodoro"
    },
    {
      "id": "nm4270735",
      "name": "Fernando Miró",
      "character": "Gordon"
    },
    {
      "id": "nm7519748",
      "name": "Juan Cruz Márquez de la Serna",
      "character": "Oveja Gonzalo"
    },
    {
      "id": "nm7102609",
      "name": "Santiago Privitera",
      "character": "Eduardo Aulet       (as Juan Santiago Privitera)"
    },
    {
      "id": "nm4714116",
      "name": "Franco Masini",
      "character": "Guillermo Puccio"
    },
    {
      "id": "nm3741238",
      "name": "Antonia Bengoechea",
      "character": "Adriana Puccio"
    },
    {
      "id": "nm1840673",
      "name": "Lili Popovich",
      "character": "Epifanía Puccio"
    },
    {
      "id": "nm7239589",
      "name": "Giselle Motta",
      "character": "Silvia Puccio"
    },
    {
      "id": "nm2757251",
      "name": "Tomas de las Heras",
      "character": "Benito       (as Tomás de las Heras)"
    },
    {
      "id": "nm1892476",
      "name": "Joaquín Berthold",
      "character": "Caña Varela"
    },
    {
      "id": "nm5869319",
      "name": "Raymond E. Lee",
      "character": "Dirigente Anglófono #1"
    },
    {
      "id": "nm8041900",
      "name": "Steve Kisicki",
      "character": "Dirigente Anglófono #2       (as Steve Kisicky)"
    },
    {
      "id": "nm4150748",
      "name": "Tomás Mejía",
      "character": "Amigo #1"
    },
    {
      "id": "nm9836641",
      "name": "Rodrigo Joaquín Fernandez",
      "character": "Amigo #2"
    },
    {
      "id": "nm0754537",
      "name": "Jorge Sabate",
      "character": "Florencio Varela"
    },
    {
      "id": "nm3779790",
      "name": "Francisco Donovan",
      "character": "Ricardo Manoukian"
    },
    {
      "id": "nm9836642",
      "name": "Soledad Gómez Schweizer",
      "character": "Sandra"
    },
    {
      "id": "nm9836643",
      "name": "Silvina Gómez Schweizer",
      "character": "Sonia"
    },
    {
      "id": "nm1005439",
      "name": "Luis Armesto",
      "character": "Laborde"
    },
    {
      "id": "nm3389171",
      "name": "Pablo Caramelo",
      "character": "Diaz"
    },
    {
      "id": "nm9836644",
      "name": "Pablo Palacio",
      "character": "Vecino verborrágico"
    },
    {
      "id": "nm4835800",
      "name": "Jorge Ondarza",
      "character": "Padre Manoukian"
    },
    {
      "id": "nm0073527",
      "name": "Jesús Berenguer",
      "character": "Contempomi"
    },
    {
      "id": "nm9836645",
      "name": "Adolfo Allende",
      "character": "Florencio Aulet"
    },
    {
      "id": "nm9836646",
      "name": "Julia Perette",
      "character": "Rolly Pozzi"
    },
    {
      "id": "nm7200031",
      "name": "Florencia Dávila",
      "character": "Doble Rolly       (as Florencia Davila)"
    },
    {
      "id": "nm9836647",
      "name": "Héctor Oscar Aguirre",
      "character": "Doble Arquímedes"
    },
    {
      "id": "nm9836648",
      "name": "Felipe García Coni",
      "character": "Cliente Hobby Wind"
    },
    {
      "id": "nm0882133",
      "name": "María Nydia Ursi",
      "character": "Nélida       (as María Nydia Ursi-Ducó)"
    },
    {
      "id": "nm9836649",
      "name": "Seann Wolf",
      "character": "Dueño restaurante"
    },
    {
      "id": "nm9314943",
      "name": "Claudio Creimer",
      "character": "Vendedor zapatos"
    },
    {
      "id": "nm7202411",
      "name": "Martín Tecchi",
      "character": "Emilio Naum"
    },
    {
      "id": "nm5304884",
      "name": "Guido Gastaldi",
      "character": "Compañero Guillermo"
    },
    {
      "id": "nm0891391",
      "name": "Ramiro Vayo",
      "character": "Familiar Prado"
    },
    {
      "id": "nm9836650",
      "name": "Jimena Juez",
      "character": "Oficial encubierto femenino"
    },
    {
      "id": "nm9836651",
      "name": "Pablo Cernadas",
      "character": "Oficial encubierto masculino"
    },
    {
      "id": "nm8361245",
      "name": "Néstor Castro",
      "character": "Guardiacarcel #1"
    },
    {
      "id": "nm9836652",
      "name": "Esteban Elverdin",
      "character": "Guardiacarcel #2"
    },
    {
      "id": "nm9836653",
      "name": "Alejandro Giroto",
      "character": "Secretario judicial"
    },
    {
      "id": "nm9836654",
      "name": "Francisco Gowland",
      "character": "Secretario Juez"
    },
    {
      "id": "nm0180767",
      "name": "Gabo Correa",
      "character": "Juez"
    },
    {
      "id": "nm10083250",
      "name": "Laura Lértora",
      "character": "Periodista"
    },
    {
      "id": "nm8022846",
      "name": "Nico Piccardo",
      "character": "Pedro Borello"
    }
  ],
  "overview": "The disappeared — los desaparecidos — are words that carry special resonance in Argentina. Long associated with the crimes of the military junta of the 1970s, the term takes on a different, but no less chilling, meaning in the hands of filmmaker Pablo Trapero. Based on a true story that rocked Argentina, The Clan tells the almost unbelievable tale of the Clan Puccio, a seemingly normal middle-class family who kidnapped wealthy people off the street, held the victims for ransom, and, once paid, killed them.",
  "storyline": "The Puccios...? A model family! They are few, those that could match them. The father? A dignified man, (honest) storekeeper by trade, who cares about his five children, going as far as to supervise the homework of his youngest daughter. The mother? Both a dedicated teacher and a regular Martha Stewart. The children? Well-educated and promised to a bright future. Alejandro, for one, is already an admired rugby star. Except that... all this respectability is nothing but a smokescreen! The truth is that Arquimedes Puccio is also - and mainly - the tyrannical leader of a criminal gang composed of... his wife and children. Puccio's undercover activities ? Well, they consist in kidnapping rich people (preferably young), detaining them in his own house, torturing them gratuitously and doing away with them after cashing the ransom. The Puccios, a model family? Yes, but a model evil family!",
  "plot": "Opening narration\n\nFrom the dawn of time we came; moving silently down through the centuries, living many secret lives, struggling to reach the time of the Gathering; when the few who remain will battle to the last. No one has ever known we were among you... until now.\nJuan Sánchez Villa-Lobos Ramírez\nIn 1985, Connor MacLeod, also known as the Highlander, is in New York City. In an arena parking garage, Connor is confronted by fellow immortal Iman Fasil, and decapitates him, upon which an energy surge destroys several cars around him. He hides his sword just as police swarm the exit to the garage, and arrest Connor.\n\nThe story then flashbacks in time to the 16th century Scottish Highlands, in the village of Glenfinnan on the shores of Loch Shiel. Connor and his clan, the Clan MacLeod, prepare for battle. In 1985, the police release Connor, as they have failed to get any information from him. One of the detectives involved, Brenda Wyatt, is an expert in metallurgy and recognises Fasil's sword as an extremely rare Toledo Salamanca broadsword. Later, Connor returns to the garage to retrieve his own sword but sees Brenda is looking at the crime scene. She finds metal shards embedded in a concrete column and saves them for analysis.\n\nIn another flashback to the Highlands, The Kurgan, assists the clan Fraser against the Clan MacLeod in exchange for the sole right to slaying Connor. In the resulting confrontation the Kurgan stabs Connor but is then driven off by the MacLeod clansmen, before he can decapitate him. The wounded Connor is taken back to the village, and everyone assumes he will die. In the evening, Connor succumbs to his battlefield injuries and dies. When he makes a full, remarkable overnight recovery and comes back to life, the village is convinced that it is the work of the devil. The villagers attempt to have Connor executed, but he is instead exiled by the clan leader out of mercy.\n\nIn 1985, Connor lives under the alias Russell Nash and is a wealthy antiquities dealer. Meanwhile, the Kurgan takes up residence at a seedy motel. Connor tails Brenda to a bar, but she leaves quickly. She then tails Connor, but the Kurgan attacks them both. The fight is interrupted by a police helicopter, and everybody flees. Brenda analyzes the metal fragments and discovers them to be from a Japanese katana, dated about 600 B.C. but made with advanced technology for the era. She makes a date with Connor in an attempt to entrap him. Connor recognises the ruse, tells her to stop digging, and leaves.\n\nIn the past, Connor lived an idyllic life with his wife Heather. One day, the mysterious and flamboyant Juan Sánchez Villa-Lobos Ramírez appears and begins tutoring Connor in the history of immortals and sword-fighting. Ramirez explains that they both belong to a group of immortals, who constantly fight one another but can only be killed by complete decapitation. When one immortal decapitates another, the winner receives a transfer of power from his/her fallen opponent called \"The Quickening\". Eventually, all the immortals must do battle until there is only one left alive; the last survivor will receive \"The Prize\". Ramirez tells Connor that the Kurgan, by that time the strongest of the immortals, must not win the Prize, or mankind will enter an eternal dark age. One night while Connor is away, the Kurgan attacks, decapitating Ramirez and raping Heather.\n\nIn Central Park, Connor meets a long-time friend, fellow immortal Sunda Kastagir. They talk about \"The Gathering\", an impending gathering of immortals which precedes the final battle, and they joke about old times. Brenda has by now discovered that Connor has been alive for centuries, living under false identities, faking his death every few decades, signing his assets over to children who had died at birth, and assuming their identities. She confronts Connor, who demonstrates his immortality. After this revelation, Brenda and Connor become lovers although Connor is reluctant, following a flashback in which Connor's wife, Heather, dies of old age in his arms in 16th century Scotland. Ramirez has earlier explained that immortals cannot have children and must let go of people in their lives, including loved ones. Ramirez reveals his Japanese katana was made specifically for him by the father of his third wife and remarks that like her, his katana is one of a kind.\n\nThe Kurgan finds Kastagir, killing him and grievously wounding a man who witnesses his beheading. When the Kurgan finds out about Connor's relationship with Brenda as he stalked them at the zoo, he kidnaps her to draw Connor out. After a climactic battle at the Silvercup Studios in Queens, Connor defeats and beheads the Kurgan. He receives the Prize, which manifests itself as a massive Quickening. Now mortal and capable of having children, Connor returns to Scotland with Brenda. Connor now has awareness of people's thoughts around the world, and promises to use his gift to encourage cooperation and peace in mankind.",
  "synopsis": null
}