{
  "imdb_id": "tt4483424",
  "tmdb_id": "338330",
  "douban_id": null,
  "title": "Doglegs (2015)",
  "genres": [
    "Documentary",
    "Action",
    "Drama",
    "Sport"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "89 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.2,
  "director": [
    {
      "id": "nm1502660",
      "name": "Heath Cozens"
    }
  ],
  "writer": [
    {
      "id": "nm1502660",
      "name": "Heath Cozens",
      "description": "writer"
    }
  ],
  "cast": null,
  "overview": "Doglegs is a cheerfully iconoclastic underground scene where the disabled battle the able-bodied - all in the name of exploding stereotypes. When the disabled champ seeks life and love beyond the ring, his idol, the able-bodied organizer, tries to sabotage his bid for independence. In a battle of the human spirit, can the power of disability win our hero his dreamgirl?",
  "storyline": "Shintaro is a Tokyo janitor who moonlights as a pro wrestler in an underground league called Doglegs. He's had 20 glorious years in the ring but now he's getting old and wants to pursue his regular-Joe dream: success at work, and hopefully, settling down with his secret dream-girl, but Kitajima, the group's volunteer organizer, has other plans. Shintaro's oldest rival, 'Antithesis' Kitajima, is billed as \"the man who has beaten up the disabled for twenty years\". He believes that sparing the kid gloves is a sign of respect. Shintaro challenges Kitajima for one last fight. Kitajima accepts, on one condition: that the winner, and only the winner, can retire - no easy feat considering how far back Shintaro's losing streak against Kitajima stretches. Meanwhile, another Doglegs regular is facing his own challenge. L'Amant ('the Lover') has severe cerebral palsy and near-total paralysis. He spends his days self-medicating with alcohol despite the protestations of his able-bodied wife and son...",
  "plot": "Countless mountains in Norway are unstable, and tectonic shift can cause large pieces to tear off and displace a massive amount of water in nearby rivers/lakes, resulting a tidal wave equal with an underwater volcanic eruption. The movie presents a futuristic event in Møre og Romsdal for the Åkerneset crevasse to end in disaster; an avalanche resulting an 80 meter tall tsunami that will destroy any nearby towns and attraction spots to sufficiently above sea level.\n\nKristian Eikjord (Joner), an experienced geologist is having his final day in Geiranger; a tourist destination in Geirangerfjord, with his family scheduled to move to Stavanger. After having a small farewell party with his colleagues in the Åkerneset monitoring station, Kristian and his children head off to catch the ferry to Stavanger, while his wife Idun (Ane Dahl Torp) remains working at a local hotel for a few more days. Kristian had earlier expressed concerns about some sensors shutting down which could be the signal of an imminent avalanche, but had been assured by his former co-workers that their readings show the crevasse was stable.\n\nWhile waiting for the ferry, Kristian has an epiphany after observing surrounding events, and drives back to the geology center he just left, leaving his son Sondre (Hoff Oftebro) and youngest child Julia in the car. He explains his realization: earlier readings had shown various groundwater deposits 'disappearing'. Since the water cannot just vanish, it means it is moving through the mountain, between the plates of rock, reducing friction. This could allow slippage that would not only weaken and damage the wires connecting instruments within the crevasse to their monitors, but increase the chance of causing the 'stacked' rock plates to be shifted too far, causing a massive avalanche. To ensure the safety of the town, he and his partner Jacob head to the crevasse by helicopter, where they find that the wires connecting to their instruments have snapped.\n\nBack at the geology center, Kristian's worries are semi-dismissed; his former boss Arvid (Såheim) agrees to go to a higher state of alert, but declines to sound an evacuation alarm based on the current evidence; it could be nothing, and sounding an alert would ruin the tourist season. Having done what he can, Kristian returns to his car, but his children are gone; a note on the windscreen tells him they went to the hotel because of being bored. He heads to the hotel, and apologizes for leaving his children behind for hours. Idun gives the children a chance to sleep at the hotel before heading to Stavanger the next day, but Julia wants to say goodbye to their house. Kristian drives home with Julia to stay there one last time, fishing a mattress and chair out of their garbage container to sleep on. Meanwhile, Sondre becomes bored in his hotel room and heads down to the basement to skateboard with headphones.\n\nInstrument calculations result contraction changes in the crevasse, thus Arvid and Jacob head there to check the \"C-pumps\" which measure conditions. They discover the measurements being accurate. Meanwhile, Kristian observes his old documents and discovers that the contractions are also a sign of an upcoming avalanche, due to how they can shift water pressure within the mountain. Kristian calls the station to explain and orders his colleagues to get Arvid and Jacob up from the crevasse instantly and sound the alarm to alert the inhabitants of Geiranger that they are in danger from the imminent tsunami. Moments later, the avalanche begins; Jacob's foot is trapped in the initial downfall, and Arvid ultimately sacrifices himself to link Jacob to their zip-line brace. The rockslide, as feared, develops a giant 80 meter tsunami that barrels towards Geiranger and all the other homes within the range.\n\nWith ten minutes on the countdown before the tsunami impacts, Kristian races to Geiranger with Julia to pick up Idun and Sondre, but Idun (via phone) orders Kristian to transfer Julia to safety. Idun and her colleague Vibeke desperately attempt to evacuate the hotel patrons onto a waiting bus, but can't find Sondre anywhere. With time of the essence, Vibeke recalls that she saw Sondre near the basement corridor, and Idun runs back into the hotel, with two Danish tourists following her; the wife, Maria Poulsen (Horn), wants to help rescue Sondre, while her husband Phillip (Larsen) follows mainly to chase after his wife.\n\nKristian and Julia run into a massive traffic jam clogging the upward road. Realizing they are nowhere near enough altitude of safety, they begin to run up the road on foot, yelling for everyone else to do likewise. Kristian encounters his friend and former neighbor Anna, fleeing with her family. However, her son Thomas fails to set the car's brake when he disembarks, causing it to roll backwards and trap Anna's leg. Kristian orders Thomas to bring his sister and get to higher altitude while he assists Anna. Realizing time has run out, Kristian seats himself and Anna in a van in one last desperate attempt to survive. The tsunami engulfs the car, shatters the windows and traps the pair in a chaotic underwater maelstrom filled with debris. At the hotel, Idun locates her son and the four run back to the bus, but it has already left and the tsunami is about to strike. Running back into the bomb shelter in the hotel's basement, the wave strikes the hotel violently, causing Maria to be washed away, forcing Idun to close the shelter's door.\n\nKristian regains consciousness, realizing he has miraculously survived the tsunami impact, but Anna is killed by heavy contact of debris that impaled her. Freeing himself, he walks up the mountain where he finds Julia safe, and tells her to stay with Thomas and his daughter, while heading back to Geiranger to find the rest of his family. The entire town has been completely wiped off the map, and during his search, he discovers the hotel bus, but with no survivors. After confirming Idun and Sondre are not among the passengers, he heads to the remains of the hotel. Down in the bomb shelter, the rising water level fills the basement and deforms the door, causing water to flood the room to capacity. An attempt to open the door to flee is thwarted by debris covering in front it. The three are forced to retreat to a shaft in the ceiling for air after the shelter in engulfed in water. Philip panics, pushing Sondre and Idun underwater in a frenzied attempt to stay above water. Unable to calm him down, Idun is forced to drown him with her legs in self-defense.\n\nKristian enters the hotel, but after finding his son's backpack, he surmises they have perished. Enraged, he angrily bangs some exposed tubes with a metal rod. However, his banging noises are heard by Idun and Sondre, and they respond by doing their own banging noises. Kristian follows the sound to the basement, but as he does so, further damage occurs to the hotel's ruins, causing water to begin flooding the shaft Idun and Sondre are taking refuge in. Kristian reaches the door and removes the debris, Idun meets him at the door; she swims to safety as Kristian goes for Sondre. Sondre is also succumbing to panic, and while Kristian manages to convince him to swim for safety, Sondre ends up succumbing to panic halfway there, exhausting his oxygen. Kristian transfers his air to his son via the breath of life technique, which gives Sondre the energy to escape, but Kristian runs out of air and accidentally inhales water. Realizing her husband has not returned with her son, Idun heads back into the submerged hallway to retrieve Kristian, desperately trying to revive him by CPR. While it looks like Kristian has drowned and Idun accepts his death, Sondre desperately tries one last frantic attempt at revival, which pays off at the last moment.\n\nThe family is reunited at the Ørnesvingen, and the film closes with a title card saying that while the Åkerneset crevasse is monitored around the clock, the movement of its tectonic plates indicate there will be a real-life rockslide similar to the film's perspective; scientists have agreed it will occur - they simply just can't say when.",
  "synopsis": null
}