{
  "imdb_id": "tt4480940",
  "tmdb_id": "365762",
  "douban_id": null,
  "title": "Angels in the Snow (TV Movie 2015)",
  "genres": [
    "Family"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.5,
  "director": [
    {
      "id": "nm0259821",
      "name": "George Erschbamer"
    }
  ],
  "writer": [
    {
      "id": "nm0040338",
      "name": "Kenneth Atchity",
      "description": "based on a story by as Ken Atchity and"
    },
    {
      "id": "nm0938995",
      "name": "Chi-Li Wong",
      "description": "based on a story by and"
    },
    {
      "id": "nm2605154",
      "name": "Julie Brazier",
      "description": "based on a story by"
    },
    {
      "id": "nm7152746",
      "name": "Rexanne Becnel",
      "description": "novel"
    },
    {
      "id": "nm2605154",
      "name": "Julie Brazier",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0001785",
      "name": "Kristy Swanson",
      "character": "Judith Montgomery"
    },
    {
      "id": "nm0693243",
      "name": "Chris Potter",
      "character": "Charles Montgomery"
    },
    {
      "id": "nm0492687",
      "name": "Colin Lawrence",
      "character": "Joe Tucker"
    },
    {
      "id": "nm0521723",
      "name": "Catherine Lough Haggquist",
      "character": "Amy Tucker"
    },
    {
      "id": "nm4729403",
      "name": "Nick Purcha",
      "character": "Alexander Montgomery"
    },
    {
      "id": "nm4703128",
      "name": "Lizzie Boys",
      "character": "Jennifer Montgomery"
    },
    {
      "id": "nm6871540",
      "name": "Jaeda Lily Miller",
      "character": "Emily Montgomery"
    },
    {
      "id": "nm4586797",
      "name": "Kolton Stewart",
      "character": "Robbie Tucker"
    },
    {
      "id": "nm7152745",
      "name": "Alexandra Siouras",
      "character": "Lucie Tucker"
    },
    {
      "id": "nm0262957",
      "name": "Kurt Evans",
      "character": "Jason"
    }
  ],
  "overview": "In Angels in the Snow, the affluent, yet troubled Montgomery family hits the road for a special Christmas in the mountains.",
  "storyline": "The Montgomerys - parents Charles and Judith, and their three children, fifteen-year-old Alexander, fourteen-year-old Jennifer, and 8-year old Emily - are spending Christmas at a new, isolated, state-of-the-art mountain cabin built by Charles' development company in upstate New York. Outwardly Charles built it so that they can spend time there to reconnect as a family, but they all know that he really built it to support the business. They as a family have long not been happy, as workaholic Charles is always concerned the company is close to folding, especially if he doesn't keep an eye on matters, while Judith feels like he treats their entire family as second priority to the work and the associated money and material wealth. They make it to the cabin just before a major snowstorm hits the area. They receive a surprise knock on their door from the Tuckers - parents Joe and Amy, and their two children, fifteen year old Robbie and fourteen year old Lucie - who ran off the road in their...",
  "plot": "On a cold afternoon, with snow on the ground, a high school band is practicing for the last football game, when they hear gunshots. The film abruptly flashes back to a few weeks before, to a Chinese restaurant where a high school boy named Arthur (Michael Angarano) buses tables, and his ex-babysitter, Annie (Kate Beckinsale), and her best friend, Barb (Amy Sedaris), are waitresses. Arthur, who's a bit of a misfit, has a troubled home life caused by his constantly clashing parents, both of whom often forget about him. Annie's life isn't faring much better: she's now a single mother with an ill mother, separated from her husband, Glenn (Sam Rockwell), who's on the wagon and becoming a born-again Christian in order to prove that he is responsible enough to spend time with their young daughter, Tara. Depressed and lonely, Annie is having an affair with Barb's husband, Nate (Nicky Katt), which eventually serves to only make her unhappier, as she feels great guilt over betraying her best friend. Desperate to prove himself and still harboring feelings for his estranged wife (whom he suspects is seeing someone), Glenn gets a new job and spends as much time as possible with Tara. Meanwhile, Arthur finds himself growing close to Lila (Olivia Thirlby), a new student at the high school who has a knack for photography. The film focuses heavily on how people's lives can cross in a small town, especially when Tara wanders out of the house and goes missing while Annie, having just lost her best friend over the affair, is sleeping. The whole town spends hours desperately searching for Tara, before Arthur finds her body while smoking pot with his friend. To Annie's horror, Tara fell into the lake while playing and drowned when the water froze over. This turn of events leads to Glenn having a complete breakdown, which results in his murder of Annie and subsequent suicide.",
  "synopsis": null
}