{
  "imdb_id": "tt4450396",
  "tmdb_id": "349158",
  "douban_id": null,
  "title": "My Little Pony: Equestria Girls",
  "genres": [
    "Animation",
    "Family",
    "Fantasy",
    "Musical"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "72 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm2154278",
      "name": "Ishi Rudell"
    },
    {
      "id": "nm2149505",
      "name": "Jayson Thiessen"
    }
  ],
  "writer": [
    {
      "id": "nm0269260",
      "name": "Lauren Faust",
      "description": "characters uncredited"
    },
    {
      "id": "nm1285303",
      "name": "Josh Haber",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0152839",
      "name": "Tara Strong",
      "character": "Sci-Twi /              Midnight Sparkle /              Twilight Sparkle       (voice)"
    },
    {
      "id": "nm1690630",
      "name": "Rebecca Shoichet",
      "character": "Sunset Shimmer /              Sci-Twi - singing       (voice)"
    },
    {
      "id": "nm1868320",
      "name": "Ashleigh Ball",
      "character": "Rainbow Dash /              Applejack       (voice)"
    },
    {
      "id": "nm0508877",
      "name": "Andrea Libman",
      "character": "Pinkie Pie /              Fluttershy /              Bon Bon       (voice)"
    },
    {
      "id": "nm0319308",
      "name": "Tabitha St. Germain",
      "character": "Rarity /              Vice Principal Luna       (voice)"
    },
    {
      "id": "nm0921699",
      "name": "Cathy Weseluck",
      "character": "Spike the Dog       (voice)"
    },
    {
      "id": "nm0703861",
      "name": "Iris Quinn",
      "character": "Principal Abacus Cinch       (voice)"
    },
    {
      "id": "nm0646955",
      "name": "Nicole Oliver",
      "character": "Principal Celestia       (voice)"
    },
    {
      "id": "nm0571741",
      "name": "Britt McKillip",
      "character": "Dean Cadance       (voice)"
    },
    {
      "id": "nm1925154",
      "name": "Vincent Tong",
      "character": "Flash Sentry /              Bus Driver       (voice)"
    },
    {
      "id": "nm0290075",
      "name": "Andrew Francis",
      "character": "Shining Armor       (voice)"
    },
    {
      "id": "nm3703274",
      "name": "Sienna Bohn",
      "character": "Sugarcoat       (voice)"
    },
    {
      "id": "nm0018746",
      "name": "Sharon Alexander",
      "character": "Sour Sweet       (voice)"
    },
    {
      "id": "nm0792198",
      "name": "Kelly Sheridan",
      "character": "Indigo Zap       (voice)"
    },
    {
      "id": "nm0410127",
      "name": "Britt Irvin",
      "character": "Sunny Flare       (voice)"
    },
    {
      "id": "nm1275101",
      "name": "Shannon Chan-Kent",
      "character": "Lemon Zest /              Pinkie Pie - singing       (voice)"
    },
    {
      "id": "nm2831024",
      "name": "Kazumi Evans",
      "character": "Rarity       (singing voice)"
    },
    {
      "id": "nm8712579",
      "name": "Arief Fadhilah",
      "character": "Colter Griffon       (voice)"
    }
  ],
  "overview": "Canterlot High meets its rival school, Crystal Prep Academy, in a competition that’s a long-standing tradition – The Friendship Games. Sunset Shimmer is tasked with keeping magic out of the games to avoid the appearance of impropriety while she and her friends compete against Crystal Prep’s top students led by someone with an equal amount of interest in Equestrian magic – this world’s TWILIGHT SPARKLE.",
  "storyline": "Every four years, Canterlot High has 'The Friendship Games' where they must rival with different schools with a series of different sporting events and every year, the cup has gone to Crystal Prep. So Fluttershy, Pinkie Pie, Rainbow Dash, Rarity, Applejack, and Sunset Shimmer must work together to win the cup. But they find out that the other Twilight Sparkle is on the opposing team.",
  "plot": "The students of Canterlot High School prepare for the Friendship Games, an academic and sporting competition regularly held between their school's team, the Wondercolts, and the undefeated Shadowbolts from Crystal Prep Academy. Sunset Shimmer, who has been observing her friends' magical ability to \"pony up\" (grow pony-like ears, tails, and wings) whenever they play musical instruments, becomes concerned when Rainbow Dash transforms during a pep rally, seemingly at random. Tasked with finding the cause of this development, Sunset attempts to contact Twilight Sparkle in Equestria for advice, but receives no response.\n\nMeanwhile, Crystal Prep is attended by the counterpart of Twilight, a school outcast who has been investigating the magical activity surrounding Canterlot High. Twilight builds a locket-like device with which to detect and contain the magic for further study, hoping this will secure her application for Everton, a coveted independent study program. However, Abacus Cinch, her school principal, threatens to revoke the application so as to blackmail Twilight into participating in the Friendship Games and maintain Crystal Prep's victory record.\n\nUpon Twilight's arrival at Canterlot High, her device detects Sunset and her friends' magic and leads Twilight to them; as she approaches, the device inadvertently drains Rarity's magic when she \"ponies up\" after making uniforms for her friends. Sunset, initially mistaking Twilight for her pony counterpart, quickly realizes the misunderstanding and considers consulting the pony Twilight in person. When Crystal Prep's Twilight follows her to the portal to Equestria, the device absorbs its magic and deactivates it. The device similarly affects Pinkie Pie and Fluttershy when they attempt to befriend Twilight during the games, briefly tearing open dimensional rifts to Equestria as a result each time.\n\nFollowing Twilight's victory in the games' academic decathlon, the games continue with a \"tricross relay\", a relay race between archery, speed skating and motocross. Applejack transforms after advising a struggling Twilight in her stage of the race, causing the device to steal Applejack's magic and create a rift that temporarily brings monstrous plants through. Rainbow Dash \"ponies up\" to save the other competitors before losing her own magic, allowing Canterlot High to win the event to tie with Crystal Prep, but causing Cinch to accuse Canterlot High of cheating due to their perceived advantage through magic.\n\nBefore the final event, Cinch and the Shadowbolts pressure Twilight into releasing the accumulated magic within her device to harness it against the Wondercolts. The magic instead corrupts Twilight, turning her into a winged and horned monster,[N 1] and she proceeds to obsessively open more rifts that threaten to destroy the parallel world. As the Wondercolts and Shadowbolts work together to save their classmates, Sunset notices her friends' magical auras and realizes that their magic manifests when they exhibit the same traits as the Elements of Harmony. Gathering their magic with the device, Sunset assumes an angelic form[N 2] and closes the rifts. She then helps Twilight regain her senses alongside Spike, Twilight's dog, returning her to normal.\n\nBoth schools, including the repentant Shadowbolts, accost Cinch for manipulating Twilight. Refusing to relent, Cinch threatens to report the incident to the school board. When taunted that no one would believe her account of the magical incidents, however, she concedes to a tie that is celebrated by both teams. Twilight, reconsidering her Everton application, realizes she is happier at Canterlot High and transfers there, where Sunset and the other students welcome her as a new friend.\n\nIn a pre-credits scene, the Twilight from Equestria emerges from the reactivated portal with the counterparts of her friends gathered around it. She apologizes for her absence, explaining that she has just escaped from a time travel loop, before gawking at the sight of her own counterpart.",
  "synopsis": "Sunset Shimmer, Applejack, Fluttershy, Pinkie Pie, and Rarity meet Rainbow Dash in front of Canterlot High School due to an emergency text...but are all rather put-off that Dash mainly called them as one of her guitar strings broke.As the group disperses, Sunset Shimmer writes to Twilight Sparkle in the Pony-verse, in her special journal. However, her attention is drawn to a hooded figure, that is poking around the statue in front of the high school. When Sunset inquires what the girl is doing, the hooded girl flees onto a nearby bus, headed towards the city.Sunset tells the others about this the next day, with Rainbow Dash thinking the girl may have been from their crosstown rival, Crystal Prep Academy. Crystal Prep has constantly beat Canterlot High in a number of sporting events. As well, both schools compete in The Friendship Games every four years, and this year, the schools will be competing...though Rainbow Dash feels with their 'pony-up' powers, they'll be able to have an advantage over the other school.Dash also uses her enthusiasm and the school's marching band, to energize the school's rather depressing rally for the upcoming games. Dash's ponying-up during the rally, has Principal Celestia and Vice-Principal Luna a little concerned. As Dash and the others don't know what causes them to 'pony-up,' they ask Sunset Shimmer to research why this could be, wanting to be sure they can suppress these 'outbursts,' to keep from being accused of cheating.Meanwhile, across town at Crystal Prep Academy, we find out that the hooded figure was actually this world's Twilight Sparkle, who has been investigating mysterious goings-on at Canterlot High. Isolating herself in a room in the school, she has come up with a special device that can detect magical energy spikes, and is eager to try it out around Canterlot High during the games...of which she is not planning to participate in.Her work is interrupted by Dean Cadance, who tells Twilight that she is concerned about her isolationist attitude, though"
}