{
  "imdb_id": "tt4448372",
  "tmdb_id": "329591",
  "douban_id": null,
  "title": "Nannbenda (2015)",
  "genres": [
    "Comedy",
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "148 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm7122738",
      "name": "A. Jagadesh"
    }
  ],
  "writer": [
    {
      "id": "nm7122738",
      "name": "A. Jagadesh",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3561350",
      "name": "Udhayanidhi Stalin",
      "character": "Sathya"
    },
    {
      "id": "nm1521381",
      "name": "Nayanthara",
      "character": "Ramya"
    },
    {
      "id": "nm1962272",
      "name": "Santhanam",
      "character": "Sivakozhundhu"
    },
    {
      "id": "nm5369429",
      "name": "Karunakaran",
      "character": "Thangadurai"
    },
    {
      "id": "nm1696698",
      "name": "Sherin",
      "character": "Preethi"
    },
    {
      "id": "nm1007581",
      "name": "Manobala",
      "character": "Senthamarai"
    },
    {
      "id": "nm3327356",
      "name": "Motta Rajendran",
      "character": "Scorpio Shankar       (as Rajendran)"
    },
    {
      "id": "nm1420794",
      "name": "Chitra Lakshmanan",
      "character": "Hotel manager"
    },
    {
      "id": "nm0793851",
      "name": "Sayaji Shinde",
      "character": "Sathya's Father"
    },
    {
      "id": "nm2696440",
      "name": "Pattimandram Raja",
      "character": "Preethi's Father"
    },
    {
      "id": "nm7023816",
      "name": "Rajasimman",
      "character": "Baby Kumar"
    },
    {
      "id": "nm1560660",
      "name": "Sriranjani",
      "character": "Sathya's Mother"
    },
    {
      "id": "nm6001916",
      "name": "Suzane George",
      "character": "Ramya's Hostelmate       (as Susan George)"
    },
    {
      "id": "nm5411911",
      "name": "Pooja Ramachandran",
      "character": "Ramya's Friend"
    },
    {
      "id": "nm7421803",
      "name": "Nagu",
      "character": "Prostitute"
    },
    {
      "id": "nm6678966",
      "name": "Vinodhini Vaidynathan",
      "character": "Ramya's Colleague       (as Vinodhini)"
    },
    {
      "id": "nm4942787",
      "name": "Lollusabha Manohar",
      "character": "Sevva"
    },
    {
      "id": "nm5042878",
      "name": "Muthuraman",
      "character": "Police Officer"
    },
    {
      "id": "nm1961459",
      "name": "Tamannaah Bhatia",
      "character": "Cameo Appearance"
    }
  ],
  "overview": "Sathya falls in love with Ramya at first sight and starts wooing her. But how will he take the revelations of his girlfriend's past?",
  "storyline": "Sathya, a jobless young man from Thanjavur, meets the girl of his dreams, Ramya when he visits his friend Sivakozhundhu in Trichy. In his tryst to woo her, Sathya gets a job in the same hotel as his friend and continues to put in efforts to impress her. Ramya is soon impressed & she finally opens out to Sathya about her past. However when he laughs at her sorrow past, Ramya starts to avoid him & Sathya is back to square one.",
  "plot": "Sathya is an unemployed youth from Thanjavur, who goes to Trichy every month to meet his friend Sivakozhundhu and spend his day with the latter's salary. One such time, he meets Ramya and falls in love with her. He believes that if he sees a girl three times a day casually, she will be her lucky lady. He meets Ramya twice and goes all over Trichy with Sivakonzhundhu in search of her. He decides to stay there that night. Just before 12'o clock, he sees Ramya celebrating her birthday in the hostel opposite to Sivakozhundhu's room. The next day he proposes to her in her bank.\n\nMeanwhile, Sivakozhundhu decides to send Sathya off by all means. But Sathya is in turn appointed as Sivam's assistant in 2.5 star hotel where Sivam worked earlier. To improve their hotel's condition, he asks for a loan from Ramya's bank and uses it. The hotel is developed. One day, Sathya and Ramya are chased by thugs who are the men of a lady whom Ramya chucked out of the hostel as she had stolen other's valuables. Sathya saves Ramya from the thugs. The next day, Ramya tells that she had once committed a murder and has gone to prison for the offense. This frightens Sathya. But Ramya says that once in Chennai, she was chased by a dog. She kicks the dog and it dies. But the Blue Cross members see this and take Ramya to the court, where she is imprisoned for 10 days and fined Rs.5000 for killing the dog. Sathya laughs at this. Ramya is hurt and asks him to get out of station or else she would go out of town. That night, Sathya and Sivakozhundhu decide to commit a crime and go to jail so that they could understand the pain of being in jail. They get heavily drunk and beat up Scorpio Shankar, a local don.\n\nThe next day, Scorpio Shankar confronts them while they were going to the bus stand to send Sathya to Thanjavur. He says that Ramya had seized his beloved Scorpio car as he had not paid his installments to the bank. So he had planned to assassinate Ramya that night. Shankar thinks that Sathya and Sivakozhundhu had known his plans and had knowingly hit him and sent him in a lorry. Shankar chases the two to a local park. When he comes to kill them, Sathya and Sivakozhundhu punch him and he falls upside down. When they rotate him, they are shocked to see a knife in his heart and he had died. The public witnesses this and complains to the police that the two had killed Scorpio Shankar.\n\nThe inspector in-charge of this case is Sathya's and Sivam's old friend, Thangadurai. But Thangam does not help them. He wants to seek revenge against them as they had humiliated him when the three of them were in school. He comes to them in prison and informs them that he had found the real murderer, but he won't say it to the judge until they sentence the two of them to life imprisonment or death. That night, Sathya and Sivam escape the jail so that they could murder Thangam for doing this to them. On their way, Sathya goes to Ramya's hostel to meet her for one last time. Ramya says that she had used the surveillance camera in the park and given it to Thangam, who found out that Baby Kumar, Scorpio Shankar's enemy had thrown the knife from a distance when he was falling down. Thangam thanked Ramya and had said that whatever it might be, but Sathya and Sivam are his friends and he would release them as soon as possible. But Thangam had mockingly cheated the two so that they would be restless that whole night.\n\nAfraid of what would happen if they are not in jail that morning, Sathya and Sivam search the outlet from where they had escaped, but they could not find it. After losing hopes, they find another two prisoners escape from that route. Instead of going inside the tunnel they had come from, the two chase the other two prisoners and hand them over to the police, excusing themselves, saying that they had gone through tunnel only to catch those two guys. They are then successfully released from prison the next morning and Baby Kumar is arrested for murdering Scorpio Shankar.",
  "synopsis": null
}