{
  "imdb_id": "tt4428788",
  "tmdb_id": "352157",
  "douban_id": "26326703",
  "title": "Marguerite (2015)",
  "genres": [
    "Comedy",
    "Drama",
    "Music"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "129 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.0,
  "director": [
    {
      "id": "nm0316306",
      "name": "Xavier Giannoli"
    }
  ],
  "writer": [
    {
      "id": "nm0738925",
      "name": "Marcia Romano",
      "description": "collaborating writer"
    },
    {
      "id": "nm0316306",
      "name": "Xavier Giannoli",
      "description": "dialogue"
    },
    {
      "id": "nm0316306",
      "name": "Xavier Giannoli",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0296594",
      "name": "Catherine Frot",
      "character": "Marguerite Dumont"
    },
    {
      "id": "nm0545838",
      "name": "André Marcon",
      "character": "Georges Dumont"
    },
    {
      "id": "nm0268949",
      "name": "Michel Fau",
      "character": "Atos Pezzini"
    },
    {
      "id": "nm1817887",
      "name": "Christa Théret",
      "character": "Hazel"
    },
    {
      "id": "nm0530781",
      "name": "Denis Mpunga",
      "character": "Madelbos"
    },
    {
      "id": "nm2306276",
      "name": "Sylvain Dieuaide",
      "character": "Lucien Beaumont"
    },
    {
      "id": "nm2517999",
      "name": "Aubert Fenoy",
      "character": "Kyrill Von Priest"
    },
    {
      "id": "nm0495844",
      "name": "Sophia Leboutte",
      "character": "Félicité la barbue"
    },
    {
      "id": "nm4965045",
      "name": "Théo Cholbi",
      "character": "Diego"
    },
    {
      "id": "nm2182605",
      "name": "Astrid Whettnall",
      "character": "Françoise Bellaire"
    },
    {
      "id": "nm0773460",
      "name": "Vincent Schmitt",
      "character": "Le médecin"
    },
    {
      "id": "nm0673094",
      "name": "Christian Pereira",
      "character": "Militaire récital"
    },
    {
      "id": "nm0664288",
      "name": "Martine Pascal",
      "character": "La colonel"
    },
    {
      "id": "nm4651461",
      "name": "Grégoire Strecker",
      "character": "Michel Aurenbach"
    },
    {
      "id": "nm0861980",
      "name": "Jean-Yves Tual",
      "character": "Monsieur Taupe"
    },
    {
      "id": "nm0404941",
      "name": "Boris Hybner",
      "character": "M. Callot"
    },
    {
      "id": "nm1738299",
      "name": "Pierre Peyrichout",
      "character": "Invité 1 /              Spectateur cabaret"
    },
    {
      "id": "nm7614994",
      "name": "Joël Bros",
      "character": "Invité 2"
    },
    {
      "id": "nm7614995",
      "name": "Lucie Strourackova",
      "character": "Petite fille"
    },
    {
      "id": "nm2208237",
      "name": "Petra Nesvacilová",
      "character": "Soprano Nedda"
    },
    {
      "id": "nm0895230",
      "name": "Lubos Veselý",
      "character": "Régisseur opéra comique"
    },
    {
      "id": "nm2812894",
      "name": "Damian Odess-Gillett",
      "character": "Gardien château"
    },
    {
      "id": "nm0806882",
      "name": "Jaroslav Smíd",
      "character": "Domestique Christian"
    },
    {
      "id": "nm7614996",
      "name": "Iva Paulusova",
      "character": "Domestique Catherine"
    },
    {
      "id": "nm0295780",
      "name": "Jean-Marie Frin",
      "character": "Militaire chasse"
    },
    {
      "id": "nm7614997",
      "name": "Stéphane Poignant",
      "character": "Homme sandwich"
    },
    {
      "id": "nm0071406",
      "name": "Artemio Benki",
      "character": "Homme avec cylindre"
    }
  ],
  "overview": "Paris in the 1920s. Marguerite Dumont is a wealthy woman with a passion for music and the opera. For years, she has performed regularly for a circle of guests. But Marguerite sings tragically out of tune and no one has ever told her. Her husband and her close friends have always encouraged her in her illusions. Things become very complicated the day she gets it into her head to perform in front of a genuine public, at the Opera.",
  "storyline": "Paris, 1920s. Marguerite Dumont is a wealthy woman, lover of the music and the opera. She loves to sing for her friends, although she's not a good singer. Both her friends and her husband have kept her fantasy. The problem begins when she decides to perform in front of a real audience.",
  "plot": null,
  "synopsis": "Marguerite, Baronne Dumont (possibly a nod here to the majestic Margaret Dumont in the Marx Bros films) may have married her husband Georges for his title (and he her for her money) but she genuinely loves him; and her horribly misplaced musical ambition is to make him proud. He, however, addresses her as \"vous\" throughout the story, and is having an affair with a mutual friend, using his temperamental motor-car \"breakdowns\" as excuses to miss her singing whenever possible. Her musical social circle are all too aware that Marguerite lacks any singing talent, but her neighbours enjoy her lavish hospitality; avant-garde poets and performance artists hijack her bizarre renditions for their own ends; and others simply haven't the heart to break hers by telling her the truth, especially as she's helping raise money for war orphans (it's 1920).Marguerite's butler Madelbos is a keen amateur photographer who intends his shots of her operatic costumed poses to make his name when eventually she performs in public and becomes famous - for the wrong reasons. He even uses photos to blackmail washed-up gay tenor Pezzini to take the job of Marguerite's voice coach, to the despair of Georges who had hoped Pezzini would tell the truth.Pezzini makes the most of his enforced role, bringing his retinue to stay and putting Marguerite through a variety of bizarre exercises. A benefit concert of solo operatic showpieces is arranged. Just before it, Marguerite discovers Georges' infidelity and is devastated, though dignified. Georges says the affair is now over. He resolves to attend the concert, though dreading the ridicule. Marguerite begins; the house freezes then collapses into incredulous laughter. But for a few moments, as Marguerite sees Georges in the audience, she sings true: then collapses, coughing blood.A voice doctor pronounces that her voice just needs rest. But Marguerite is losing touch with reality as her dreams of an international singing career become a reality to her. The doctor records her spoken \"memoirs\" of concert engagements on a phonograph. Georges decides that the doctor should record Marguerite's singing to shake her out of her delusions; but regrets his decision and dashes to the hospital. He's delayed by his car - genuinely - breaking down, and arrives just in time to catch Marguerite's fatal collapse as she finally hears the truth. Madelbos captures her last moment of life, cradled at last in Georges' arms."
}