{
  "imdb_id": "tt4486006",
  "tmdb_id": "410540",
  "douban_id": null,
  "title": "Tarpan: Repainting an Ancient Picture (2014)",
  "genres": [
    "Documentary",
    "Short",
    "Adventure"
  ],
  "country": "Bulgaria",
  "version": [
    {
      "runtime": "28 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm5540071",
      "name": "Jen Miller"
    },
    {
      "id": "nm0670426",
      "name": "Sophie Dia Pegrum"
    }
  ],
  "writer": [
    {
      "id": "nm5540071",
      "name": "Jen Miller",
      "description": "writer"
    }
  ],
  "cast": null,
  "overview": "This is the story of mankind’s attempt to bring back a horse from the dead. Tarpan had roamed in wild herds across Europe for millennia, running through the dreams of our ancient ancestors. The film illuminates the dark past of the hunting lodges of Europe, miraculous scientific coincidence and the chilling efforts of the genetic breeders of the past.  World Wars and doomed attempts to re-engineer the horse left a hopeless situation.  Finally the careful work of an international group including the Polish State Studs, the work of biologists in the Netherlands and the tireless efforts of a dedicated group in Bulgaria brought a small herd of modern Tarpan to the remote mountains of Eastern Europe.  Here the horse faces a whole new challenge, struggling to become wild once again and their ability to adapt to a thriving wolf population.  As they bravely learn to find a way back to their ancient selves, heir future still hangs in a delicate balance.",
  "storyline": "This is the story of mankind's attempt to bring back a horse form the dead. Tarpan roamed in wild herds across Europe for millennia, running through the dreams of our ancient ancestors and onto prehistoric cave walls. The film takes us on a journey of discovery, illuminating the dark past of the hunting lodges of Europe, miraculous scientific coincidence and the chilling efforts of the genetic breeders of the past. World Wars and doomed attempts to re-engineer the horse left a hopeless situation. Finally a group in Bulgaria brought a herd of modern Tarpan to the mountains of Eastern Europe. Here the horse faces a whole new challenge, struggling to become wild again and finding a way back to their ancient selves.",
  "plot": null,
  "synopsis": null
}