{
  "imdb_id": "tt4412268",
  "tmdb_id": "389856",
  "douban_id": null,
  "title": "Laundry Man (2016)",
  "genres": [
    "Horror"
  ],
  "country": "Belgium",
  "version": [
    {
      "runtime": "111 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.8,
  "director": [
    {
      "id": "nm0888931",
      "name": "Johan Vandewoestijne"
    }
  ],
  "writer": [
    {
      "id": "nm0888931",
      "name": "Johan Vandewoestijne",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm7934562",
      "name": "Sharon Slosse",
      "character": "Laurie"
    },
    {
      "id": "nm7143499",
      "name": "Adam Fellows",
      "character": "Worker 2"
    },
    {
      "id": "nm7615376",
      "name": "Ignace Paepe",
      "character": "Sam Kruger"
    },
    {
      "id": "nm7588708",
      "name": "Thierry Wybauw",
      "character": "Cop interrogation room"
    },
    {
      "id": "nm7126905",
      "name": "Dan Rutter",
      "character": "Worker 3"
    },
    {
      "id": "nm7094278",
      "name": "Ziva Marshall",
      "character": "Julie"
    },
    {
      "id": "nm8068811",
      "name": "Kristel Breugelmans",
      "character": "Barbara"
    },
    {
      "id": "nm7094279",
      "name": "Eddy Van de Putte",
      "character": "Worker 1"
    },
    {
      "id": "nm5626828",
      "name": "Martin van Maris",
      "character": "Ray"
    },
    {
      "id": "nm5638992",
      "name": "Gunther Vanhuysse",
      "character": "Jeffrey Damen"
    }
  ],
  "overview": "On an obscure chat site, Jeff pretends to be an SM mistress who’s looking for a sister to her slave Julie. That way Jeff manages to gain the trust of his victims and lure them to his flat, where a gruesome fate awaits them.",
  "storyline": "Laundry Man is the story about a rather clumsy serial killer. It is partly based on the crimes committed by American serial killer Jeffrey Dahmer and those committed by the Belgian-Hungarian pastor Andras Pandy.",
  "plot": "In a run-down neighborhood, Frank Castle wakes up and exits his van to get his laundry done. On his way to the coin-op laundromat, he witnesses a street gang stop and confront three prostitutes before Goldtooth, the gang leader, takes one of them to a back alley and rapes her. Despite hearing her screams from a distance, Frank minds his business and places his laundry in a washing machine.\n\nMinutes later, a boy named DeShawn crosses through the neighborhood and is harassed by the gang while Goldtooth offers him an opportunity to sell drugs for them. When DeShawn refuses, the gang members begin to mug him. After a brief verbal confrontation with Goldtooth, Frank walks to a liquor store across the street to get a bottle of Yoo-hoo. There, a handicapped store clerk named Big Mike tells him that two years ago, he witnessed a similar situation and insinuates that he wound up crippled for confronting the criminals.\n\nFrank pays for the Yoo-hoo and also buys a bottle of Jack Daniel's, which he uses to club some of the gang members to death, while killing others with their own guns and knives. After killing the thugs, he breaks Goldtooth's right arm and both legs before asking him if he knows what the difference between justice and punishment is, while pouring the whiskey on him. He then pulls out a lighter, and places it on the ground before returning to the laundromat.\n\nThe battered prostitute returns to the scene to pick up the lighter and sets the gang leader on fire as Frank walks back to his van with his laundry. DeShawn approaches him to return a T-shirt he dropped, but Frank tells him to keep it. As Frank drives off, the boy unfolds the shirt to reveal the Punisher symbol.",
  "synopsis": null
}