{
  "imdb_id": "tt4401884",
  "tmdb_id": "280883",
  "douban_id": null,
  "title": "Isai (2015)",
  "genres": [
    "Musical",
    "Romance",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "190 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm0754184",
      "name": "Surya S.J."
    }
  ],
  "writer": [
    {
      "id": "nm0754184",
      "name": "Surya S.J.",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0754184",
      "name": "S.J. Surya",
      "character": "A. K. Shiva"
    },
    {
      "id": "nm0766470",
      "name": "Sathyaraj",
      "character": "Vetriselvan"
    },
    {
      "id": "nm4540889",
      "name": "Sulagna Panigrahi",
      "character": "Jenny"
    },
    {
      "id": "nm4446366",
      "name": "Thambi Ramayya",
      "character": "Church Priest       (as Thambi Ramaiah)"
    },
    {
      "id": "nm2128968",
      "name": "'Ganja' Karuppu",
      "character": "Karuppu"
    },
    {
      "id": "nm1386816",
      "name": "Azhagam Perumal",
      "character": "Director Gunasekhar"
    },
    {
      "id": "nm5210876",
      "name": "Monali Sehgal",
      "character": "Lilly"
    },
    {
      "id": "nm4137528",
      "name": "Gibran Osman",
      "character": "Peter"
    },
    {
      "id": "nm5366647",
      "name": "Sharad K.R.G.",
      "character": "Manager Sharad"
    },
    {
      "id": "nm0839045",
      "name": "Raju Sundaram",
      "character": "Cameo Appearance"
    },
    {
      "id": "nm1436693",
      "name": "A.R. Murugadoss",
      "character": "Cameo Appearance"
    },
    {
      "id": "nm3315387",
      "name": "Vishnuvardhan",
      "character": "Cameo Appearance"
    },
    {
      "id": "nm1853502",
      "name": "Meera Chopra",
      "character": "Cameo Appearance"
    }
  ],
  "overview": "A once-successful veteran is envious of the success that his one-time assistant as a music director and plots to bring him down by ruining both his career and life.",
  "storyline": "The invincible film music composer, Vetrichelvan is displaced from his top position by his erstwhile assistant, Shiva. While Shiva's refreshing music wins him offers & plaudits left, right & center, and even a charming young wife, Vetrichelvan is forced to stay indoors and ruminate on his long-forgotten heydays. Jealously engulfs him and he plots the downfall of Shiva.",
  "plot": "Vetriselvan (Sathyaraj) is an established and an old fashioned music director in the industry. He is loved and respected for his works and is termed as the greatest musician of our times. A. K. Shiva (S. J. Surya) who works as an assistant under Vetriselvan gets an opportunity to compose music for a small-time film. When he seeks permission from Vetriselvan to go ahead with his first venture as a music director, Vetriselvan doesn't oppose the idea as he wouldn't have imagined even in his wildest dream that one day A. K. Shiva would surpass him in the musical world.\n\nWhen A. K. Shiva introduces new techniques and pioneers the use of synthesizers, his music gets the attention of all music lovers. Due to the freshness and modernity his music possesses, he gradually becomes the most sought after musician and finally overtakes Vetriselvan. A. K. Shiva becomes the number one musician and also builds his own studio. Meanwhile, he falls in love with Jenny (Sulagna Panigrahi) and also marries her.\n\nWhen it seems everything he touches turns to gold, Vetriselvan displays his true colors. To get his glory back, Vetriselvan does whatever it takes to label A. K. Shiva unfit to compose music. Can A. K. Shiva bounce back despite his new and unwanted status forms the rest of the story?",
  "synopsis": null
}