{
  "imdb_id": "tt4439120",
  "tmdb_id": "340176",
  "douban_id": "26326395",
  "title": "Tag (2015)",
  "genres": [
    "Action",
    "Fantasy",
    "Horror",
    "Mystery"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.1,
  "director": [
    {
      "id": "nm0814469",
      "name": "Sion Sono"
    }
  ],
  "writer": [
    {
      "id": "nm2179863",
      "name": "Yûsuke Yamada",
      "description": "based on the original story by"
    },
    {
      "id": "nm0814469",
      "name": "Sion Sono",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3980160",
      "name": "Reina Triendl",
      "character": "Mitsuko"
    },
    {
      "id": "nm3380697",
      "name": "Mariko Shinoda",
      "character": "Keiko"
    },
    {
      "id": "nm3940196",
      "name": "Erina Mano",
      "character": "Izumi"
    },
    {
      "id": "nm5155828",
      "name": "Yuki Sakurai",
      "character": "Aki"
    },
    {
      "id": "nm7162479",
      "name": "Aki Hiraoka",
      "character": "Taeko"
    },
    {
      "id": "nm5657152",
      "name": "Ami Tomite",
      "character": "Sur"
    },
    {
      "id": "nm4081338",
      "name": "Mika Akizuki",
      "character": "Mitsuko's classmate"
    },
    {
      "id": "nm10198481",
      "name": "Misaki Amano",
      "character": ""
    },
    {
      "id": "nm7170648",
      "name": "Urara Aryû",
      "character": ""
    },
    {
      "id": "nm7170647",
      "name": "Mao Asou",
      "character": "Akane       (as Mao Asô)"
    },
    {
      "id": "nm7170644",
      "name": "Nanami Hidaka",
      "character": ""
    },
    {
      "id": "nm5993079",
      "name": "Rin Honoka",
      "character": ""
    },
    {
      "id": "nm7032049",
      "name": "Hikaru Horiguchi",
      "character": ""
    },
    {
      "id": "nm5626883",
      "name": "Rika Hoshina",
      "character": ""
    },
    {
      "id": "nm5126814",
      "name": "Nanami Ishimaru",
      "character": ""
    },
    {
      "id": "nm1402449",
      "name": "Sayaka Isoyama",
      "character": "Matsuko"
    },
    {
      "id": "nm7170645",
      "name": "Fûka Iwasaki",
      "character": ""
    },
    {
      "id": "nm1132518",
      "name": "Izumi",
      "character": ""
    },
    {
      "id": "nm6698150",
      "name": "Cyborg Kaori",
      "character": ""
    },
    {
      "id": "nm5396950",
      "name": "Makoto Kikuchi",
      "character": ""
    },
    {
      "id": "nm7336027",
      "name": "Hinako Matsumoto",
      "character": "Actress"
    },
    {
      "id": "nm2052919",
      "name": "Mao Mita",
      "character": ""
    },
    {
      "id": "nm6408536",
      "name": "Kanon Miyahara",
      "character": ""
    },
    {
      "id": "nm5196853",
      "name": "Honoka Murakami",
      "character": ""
    },
    {
      "id": "nm10551039",
      "name": "Satoshi Nishikôri",
      "character": ""
    },
    {
      "id": "nm2392440",
      "name": "Wareta Okuda",
      "character": ""
    },
    {
      "id": "nm3451756",
      "name": "Akari Ozawa",
      "character": ""
    },
    {
      "id": "nm5575368",
      "name": "Misaki Saisho",
      "character": ""
    },
    {
      "id": "nm1102191",
      "name": "Takumi Saitoh",
      "character": "High School Boy /              Lord       (as Takumi Saitô)"
    },
    {
      "id": "nm2937275",
      "name": "Arisa Sakamoto",
      "character": ""
    },
    {
      "id": "nm2210296",
      "name": "Miku Sano",
      "character": ""
    },
    {
      "id": "nm5295209",
      "name": "Moe Sasaki",
      "character": ""
    },
    {
      "id": "nm7170643",
      "name": "Maki Sawa",
      "character": ""
    },
    {
      "id": "nm7170646",
      "name": "Asami Shibata",
      "character": ""
    },
    {
      "id": "nm5495598",
      "name": "Chihiro Shibata",
      "character": ""
    },
    {
      "id": "nm5156521",
      "name": "Maryjun Takahashi",
      "character": "Jun"
    },
    {
      "id": "nm1847583",
      "name": "Hiroko Yashiki",
      "character": ""
    },
    {
      "id": "nm5139997",
      "name": "Seia Yasuda",
      "character": ""
    },
    {
      "id": "nm6145133",
      "name": "Miki Yokota",
      "character": ""
    },
    {
      "id": "nm5602579",
      "name": "Mebuki Yoshida",
      "character": ""
    }
  ],
  "overview": "Female highs school students, including Mitsuko, Keiko and Izumi, become the targets of ghosts with various appearances including a groom with a pig's face and female teacher with a machine gun.",
  "storyline": "As the sole survivor of a horrendous and rather mysterious accident, Mitsuko, a typical Japanese teenager, can safely say that her day has got off to a bad start. It seems that an unstoppable force of nature, a doomed field trip, and a strange case of amnesia can easily coexist in a bizarre parallel universe, where a desperate Mitsuko is always on the run from something inexplicable, intangible, and utterly deadly. However, that's not all. Amid piles of fresh dead bodies, mounds of scorching bullet shells, and rivulets of fragrant young blood, frail Mitsuko must fight to stay alive, before her already messed up day becomes even stranger. But, the question still remains. Who is the enemy?",
  "plot": "A quiet high school girl named Mitsuko survives a gust of wind which slices through her school bus, bisecting everyone on board. She manages to escape the gust of wind, which chases her and kills all the other girls she comes into contact with. Dazed, and surrounded by numerous dead high school girls, she cleans herself off and changes into another schoolgirl's uniform and stumbles onto a different high school campus. She is greeted by her friends Aki, Sur (short for \"Surreal\") and Taeko. Not knowing who they are, Mitsuko confesses to Aki in a classroom where the chairs were on the tables that she cannot remember if she ever attended this school and believes she had a nightmare about girls being killed by a gust of wind. Aki reassures her that it was just a nightmare and proposes that they all cut class and go to the woods to cheer her up.\n\nIn the woods, the girls muse about whether destiny is truly predetermined and whether there are multiple realities with multiple versions of themselves. Sur illustrates predetermination with a white feather, stating that it would mean the time it takes for the feather to fall and where it will land are all decided already. Mitsuko wonders if there is nothing she can do to escape destiny, but Sur suggests that fate can be tricked by simply doing something one would never normally do, thus changing the outcome. The girls happily return to school. Aki and Mitsuko's homeroom teacher begins class, but suddenly brandishes a machine gun and opens fire, killing all the girls except Mitsuko. Before she can fire another round, Sur and Taeko burst in, grab Mitsuko, and the three hide. Another homeroom teacher, who has just killed her own entire class, finds and kills Taeko and Sur. Mitsuko and the remaining girls flee the grounds, running for their lives as they are gunned down. One of the girls recognizes Mitsuko and pleads for her to do something and think about why this is happening. The remaining girls are then sliced apart by a gust of wind.\n\nMitsuko continues to run, and then finds herself in increasingly surreal situations where her identity and appearance change: first, as a bride named Keiko on her wedding day, who is forced to marry a grotesque groom with a boar's head while her guests (all girls from the previous school) jeer at her, then later as a student named Izumi in the middle of a marathon, flanked by her friends and well wishers (again, made up of the girls from the school and wedding ceremony). In each scenario, she is supported by a version of her friend Aki, who either readies her for combat or distracts her attackers, made up of the groom and the two homeroom teachers from before. In every scenario, she must flee while the surrounding girls are slaughtered in various ways.\n\nAfter encountering a group of revenant girls who try to kill her after stating that so long as she lives, they all will continue to die, she is once again rescued by Aki. Aki tells her to focus and remember that although she is both Keiko and Izumi in these scenarios, she is ultimately Mitsuko. After returning to her original appearance as Mitsuko, Aki tells her that the two of them and all the girls are in a fictional world being observed by \"someone\" and that they will continue to hunt Mitsuko down and try to kill her while slaughtering the other girls unless Mitsuko, as the \"main character\", does something to change it. Each of the scenarios she encountered is a different world, and to reach the final one, Aki tells her that Mitsuko must brutally kill her. Urged on by Aki, Mitsuko reluctantly kills her and a portal opens up before her.\n\nShe finds herself in a lewd, dingy city called \"Men's World\" filled with only men who pervertedly enjoy a poster advertisement for a \"legendary\" violent 3-D survival horror video game called \"Tag\", depicting Mitsuko, Keiko, and Izumi as playable characters. She passes out and awakens in a temple where all the girls from the various scenarios are showcased like mannequins. She arrives at a room where a decrepit old man is playing the game on his TV, showing the various trials she went through. Mitsuko is horrified to see full size models of herself, Keiko, Izumi, Aki, Sur, and Taeko behind a glass display case. The man tells her that she is in the future and that 150 years ago, she was a girl he had admired as a fellow student. When she died, he managed to take her DNA and that of all her friends and make clones for his 3-D game. A younger version of the old man appears beside a bed and strips down, beckoning her to come to bed with him. The old man tells her that the final stage is the fulfillment of his deepest wish and he tells her to succumb to her destiny. Instead, Mitsuko attacks the younger man, screaming at him to stop playing with girls like toys. She rips one of the pillows, showering the room with feathers. Remembering what Sur said about tricking fate, she then commits suicide by stabbing herself, to the shock of both the old man and his younger self. Finding herself once again in the beginning of each of the three game scenarios, she simultaneously commits suicide on the bus, at the wedding chapel, and during the marathon before any of the violent scenarios can begin. Mitsuko then awakens alone in a field of white snow, gets up, and runs away, realizing that \"it's over now.\"",
  "synopsis": null
}