{
  "imdb_id": "tt4416518",
  "tmdb_id": "299553",
  "douban_id": null,
  "title": "Shark Lake (2015)",
  "genres": [
    "Action",
    "Adventure",
    "Crime",
    "Drama",
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "92 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.4,
  "director": [
    {
      "id": "nm1409208",
      "name": "Jerry Dugan"
    }
  ],
  "writer": [
    {
      "id": "nm1241006",
      "name": "Gabe Burnstein",
      "description": "story by &"
    },
    {
      "id": "nm4699584",
      "name": "David Anderson",
      "description": "story by"
    },
    {
      "id": "nm1241006",
      "name": "Gabe Burnstein",
      "description": "screenplay &"
    },
    {
      "id": "nm4699584",
      "name": "David Anderson",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0000185",
      "name": "Dolph Lundgren",
      "character": "Clint Gray"
    },
    {
      "id": "nm1523899",
      "name": "Sara Malakul Lane",
      "character": "Meredith Hernandez       (as Sara Lane)"
    },
    {
      "id": "nm7106360",
      "name": "Lily Brooks O'Briant",
      "character": "Carly Gray"
    },
    {
      "id": "nm2971607",
      "name": "Michael Aaron Milligan",
      "character": "Peter Mayes       (as Michael A. Milligan)"
    },
    {
      "id": "nm0629634",
      "name": "Lance E. Nichols",
      "character": "Lewis Galloway       (as Lance Nichols)"
    },
    {
      "id": "nm7450712",
      "name": "Kay Galvin",
      "character": "Sandy"
    },
    {
      "id": "nm0149949",
      "name": "James Chalke",
      "character": "Don Barnes"
    },
    {
      "id": "nm6146996",
      "name": "Frederick Douglas Plunkett Jr.",
      "character": "Monster"
    },
    {
      "id": "nm4129480",
      "name": "Ibrahim Renno",
      "character": "Larson       (as Ibrahim Renno Jr.)"
    },
    {
      "id": "nm3969329",
      "name": "Miles Doleac",
      "character": "Garreth Ross"
    },
    {
      "id": "nm2467078",
      "name": "Ted Ferguson",
      "character": "Christopher"
    },
    {
      "id": "nm4453240",
      "name": "Carol Ann Scruggs",
      "character": "Betty"
    },
    {
      "id": "nm5451383",
      "name": "Melissa Bolona",
      "character": "Sara"
    },
    {
      "id": "nm5648145",
      "name": "Jeremy Jude",
      "character": "Jim"
    },
    {
      "id": "nm9134928",
      "name": "Matalin Rayborn",
      "character": "Young Carly"
    },
    {
      "id": "nm4920569",
      "name": "Kelsey Deanne",
      "character": "Kay       (as Kelsey Deanne McDonald)"
    },
    {
      "id": "nm0454507",
      "name": "Bobby C. King",
      "character": "Chum Boat Guy"
    },
    {
      "id": "nm5089576",
      "name": "Kim Baptiste",
      "character": "Reporter"
    },
    {
      "id": "nm2364777",
      "name": "Ele Bardha",
      "character": "Ricky"
    },
    {
      "id": "nm9134929",
      "name": "Andrew Stern",
      "character": "Life Guard #1"
    },
    {
      "id": "nm2554469",
      "name": "John Ceallach",
      "character": "Hunter Dan"
    },
    {
      "id": "nm7476618",
      "name": "James Donald",
      "character": "Hunter Kyle       (as James Wayne Donald Jr.)"
    },
    {
      "id": "nm7133022",
      "name": "S.T. Streetman",
      "character": "Life Guard #2       (as Tyler 'Strat' Streetman)"
    },
    {
      "id": "nm9134930",
      "name": "Christine Hilts",
      "character": "Hostess"
    },
    {
      "id": "nm7476614",
      "name": "Jermaine Hines",
      "character": "Life Guard"
    },
    {
      "id": "nm7133578",
      "name": "Hannah Jacole Powell-Yost",
      "character": "Burning Man Partygoer       (as Hannah Powell-Yost)"
    }
  ],
  "overview": "Meredith Hendricks happens to be the best cop in her quiet town on Lake Tahoe. When a black-market exotic species dealer named Clint is paroled from prison, something he let loose begins to make its presence known. Swimmers and land-lovers alike begin to become part of the food chain at an unbelievable rate. Meredith and her team discover that they're not just hunting one eating machine, but a whole family of them. Not everyone will make it out alive, but those who do will never forget this summer at Shark Lake.",
  "storyline": "Fiercely protective single-mom Meredith Hendricks happens to also be the best cop in her quiet town on Lake Tahoe. When a black-market exotic species dealer named Clint, is paroled from prison, something he let loose begins to make its presence known. Swimmers and land-lovers alike begin to become part of the food chain at an unbelievable rate. Meredith and the new man in her life, a biologist named Peter, begin to investigate these brutal attacks and discover that they're not just hunting one eating machine, but a whole family of them. After a documentary crew is devoured when they don't take the threat seriously, it's up to Meredith, Peter, and the unlikely hero, Clint, to stop the most dangerous thing on the planet: A mother protecting its young. Not everyone will make it out alive, but those who do will never forget this summer at Shark Lake.",
  "plot": null,
  "synopsis": "A smuggler of wild animals (clint Gray, played by Dolph Lundgren) while being chased by the police on the highway, crashes his van into a lake. He is arrested, but unknown to the public, a bull shark he was carrying in the van, has escaped into the lake. Clint's 3 year old daughter Carly, without mother or anyone else, is taken care of by a young lady sheriff Meredith (played by Sara Lane). Five years later, Clint is out on parole. Also, the shark and its two young child have somehow survived the freshwater lake and grown big.When the sharks attack an elderly couple, the police suspect it's a bear attack, and kill a bear in the area. Lane meets a young professor Peter in a restaurant, who doubts the bear-attack-theory. Peter himself dives in the lake and collects evidence that it is a shark attack. Lane sees the evidence and reaches the beach to warn people, but it is too late as multiple people have taken shark bites. An experienced big fish catcher and TV presenter Gareth Ross (played by Miles Doleac) tries to catch the shark and film it for his show, but is killed, as he has underestimated the number of sharks(there are 3, not one), as well as their intelligence- they attack in a coordinated manner. The sheriff announce a reward to the public to whoever may catch the shark.Lane is extremely worried and protective about her adopted daughter meeting her criminal father again and warns her aged mother to keep an eye. She also found evidence that it was Clint who put a shark in the lake. Contrary to that perception, Clint has changed and refused to join back his former gang. He came to Lane's home and the dad-daughter catch a glimpse of each other and he returned back gently. His crime boss breaks in his house and threatens to harm his daughter, lest he bring him the shark, which he was to deliver 5 years back. Clint sets out on his boat, and finds his daughter hiding there- she has come to meet her dad. They have a happy reunion and then Clint asks her to go back to her mom Lane, and he would meet her regularly. Lane's mother, who had gone for a walk which gave Carly the chance to sneak out, is attacked by a shark, and is saved by Lane who shoots it dead.Lane then sets the police after Clint on charge of kidnapping her daughter and herself boards a small boat with Professor in the middle of the night to try catch him. A fisher trying to catch the shark in hope of reward money is killed by the shark and his boat crashes into Lane's. Their boat slowly sinks while they float with life-jackets, hoping the mobile phone GPS will help others track them. The sharks attack the professor who kills one, but another kills him. Lane is saved by Clint in his boat and she finds Carly there, who reveals she came on her own. Clint thanks Lane for taking care of his daughter, but as a dad he would do anything to be part of her life. An aggressive Lane reminds him he will have to face jail as he caused death of so many people by putting the shark in that lake. That's when a Shark (presumably the 3rd and last one) hits their boat and Carly falls in the water. Clint jumps in the water and manages to send her back on board. He himself is attacked, fights the shark head on and is bitten on the shoulder, when Lane jumps underwater to shoot the shark dead. Lane thanks Clint for saving Carly and advises him to run away, but he decides he has run enough and missed enough and wants to be with his daughter. The three return in a life-raft and Lane testifies to police how he saved both their lives and the sheriff agree to be lenient. Lane promises her daughter- she would meet her dad soon."
}