{
  "imdb_id": "tt4400028",
  "tmdb_id": "342163",
  "douban_id": null,
  "title": "No Kids (2015)",
  "genres": [
    "Comedy",
    "Romance"
  ],
  "country": "Argentina",
  "version": [],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm1033668",
      "name": "Ariel Winograd"
    }
  ],
  "writer": [
    {
      "id": "nm1258535",
      "name": "Pablo Solarz",
      "description": "original story"
    },
    {
      "id": "nm1409431",
      "name": "Mariano Vera",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0673391",
      "name": "Diego Peretti",
      "character": "Gabriel"
    },
    {
      "id": "nm0893941",
      "name": "Maribel Verdú",
      "character": "Vicky"
    },
    {
      "id": "nm6861627",
      "name": "Guadalupe Manent",
      "character": "Sofía"
    },
    {
      "id": "nm0685289",
      "name": "Martín Piroyansky",
      "character": "Keko"
    },
    {
      "id": "nm0285113",
      "name": "Horacio Fontova",
      "character": "Oscar"
    },
    {
      "id": "nm3889089",
      "name": "Marina Bellati",
      "character": "Leticia"
    },
    {
      "id": "nm1297986",
      "name": "Guillermo Arengo",
      "character": "José"
    },
    {
      "id": "nm0706567",
      "name": "Pablo Rago",
      "character": "Sebastián"
    },
    {
      "id": "nm1163123",
      "name": "Jorgelina Aruzzi",
      "character": "Gina"
    },
    {
      "id": "nm1340315",
      "name": "Erika de Sautu Riestra",
      "character": "Rosalía"
    },
    {
      "id": "nm1601387",
      "name": "Lucía Maciel",
      "character": "Mabel"
    },
    {
      "id": "nm1142124",
      "name": "Esteban Menis",
      "character": "Analista"
    },
    {
      "id": "nm3882868",
      "name": "Iair Said",
      "character": "Periodista"
    },
    {
      "id": "nm5554685",
      "name": "Ariel Pérez de María",
      "character": "Sereno"
    },
    {
      "id": "nm7231874",
      "name": "Chang Hung Cheng",
      "character": "Mozo"
    },
    {
      "id": "nm10396885",
      "name": "Franco Mellucci",
      "character": "Niño restaurante       (as Franco Valentino Melucci)"
    },
    {
      "id": "nm5604246",
      "name": "Luciano Linardi",
      "character": "Padre niño restaurante"
    },
    {
      "id": "nm1663926",
      "name": "Carla Pandolfi",
      "character": "Madre niño restaurante"
    },
    {
      "id": "nm4402239",
      "name": "Olivier Noel",
      "character": "Michel"
    },
    {
      "id": "nm8412901",
      "name": "Claudio Lauría",
      "character": "Carlo       (as Claudio Lauria)"
    },
    {
      "id": "nm10781624",
      "name": "Myriam Henne",
      "character": "Marie"
    },
    {
      "id": "nm4956066",
      "name": "Olivier Ubertalli",
      "character": "Erick"
    },
    {
      "id": "nm9725853",
      "name": "Lucio Schraier",
      "character": "Adolescente       (as Lucio Schrairer)"
    },
    {
      "id": "nm10781626",
      "name": "Vittorio Roberti",
      "character": "Bebé plaza"
    },
    {
      "id": "nm10781625",
      "name": "Jazmín Medina",
      "character": "Niña 3 años"
    },
    {
      "id": "nm9046783",
      "name": "Noe Montes",
      "character": "Profesor de música"
    }
  ],
  "overview": null,
  "storyline": "Gabriel has been separated for four years now. Since then his 8 year old daughter is the center of his life. Completely avoiding getting involved in a new romantic relationship, Gabriel focus all his energy in his daughter and work. This plan gets spoiled when Vicky, a platonic love from his adolescence, now a beautiful and independent woman appears in his life. When romance is about to start, she puts one condition: She would never get involved with a man with children. She just does not want children in her life. When Gabriel is confronted with this, he says he has no children. From that moment on his life becomes a torment, playing every trick at hand in order to hide his child and belongings from Vicky in every date.",
  "plot": "Heroine\n\nAt one point, Gertrude's future self travels back in time. She is in her thirties, and without Old Lace, and her superhero name is Heroine at this time. Nico reveals, with the aid of magic, that this version of Gertrude is the leader of the Avengers of her time line. Superheroes in her time includes characters to yet make an official appearance in the regular Marvel Universe, including an \"Iron Woman\", a heroic Scorpion, the \"Fantastic Fourteen\", and \"Captain Americas\". She, the rest of her team, the X-Men (led by Armor), and the Fantastic Fourteen are killed by Victor Mancha's future self, who completed his original mission programmed by Ultron to become the ultimate supervillain \"Victorious\".\nHouse of M\n\nIn the House of M reality warp, the Pride is mentioned as ruling not only Los Angeles, but all of Southern California. Unlike in the normal reality, their children stay with their parents. Karolina is mentioned as being a \"go-to\" girl for the Wolfpack. When the Scarlet Witch takes majority of the mutants populations' powers, Molly is one of the handful that keeps her powers.\n\nIn an interview with Comic Book Resources, Brian K. Vaughan revealed that Runaways (despite being in the main Marvel Universe) will not refer to the House of M reality warp. Vaughan's reason for not wanting Runaways to refer to the Scarlet Witch's attack was because he did not want the readers of Runaways to be confused about the complex House of M storyline. He did, however say there would be a brief one-line reference, which happened in the following issue: after Molly angrily punches Wolverine out of a church, he lands in the snow and bitterly says, \"Only 198 mutants left on the planet... and that girl had to be one of them.\" The events of House of M and \"Decimation\" are referred to later in an issue written by Chris Yost with Wolverine encountering Molly again and stating, \"I don't know if you're keeping up with the current events, but there used to be millions of mutants and now there's under 200.\"\nMarvel Zombies\n\nIn Marvel Zombies/Army of Darkness #2, the Blob is chased by various zombie super heroes. Behind him, in the background, zombie versions of the Runaways are shown feeding upon Old Lace.\nWha... Huh?\n\nGoofy versions of the original team, including Alex Wilder, are seen in the Wha... Huh? one shot as part of a joke about Wolverine appearing in every comic including Archie, Yu-Gi-Oh!, and Pokémon.\nWhat If...?\n\nIn December 2008, all five issues of What If...? featured the Runaways becoming the Young Avengers as back-up stories. The five-part back-up feature (entitled What If Runaways became Young Avengers?) illustrates how Iron Lad recruits the Runaways as the next new wave of the Avengers, forcing them to be an actual super-hero team with costumes. Although it is later revealed that the Iron Lad that brought them together was actually Victor Mancha – Iron Lad ran into Victor's future self when attempting to flee to the Avengers' era, with Victorious travelling back with him and using Victor to hi-jack his equipment – Kang's attempt to rescue his younger self results in Iron Lad being killed and Kang being erased from history while Victor destroys his future self and departs via Kang's time-belt to find his own way, leaving the Runaways to continue as Young Avengers with Chase now using parts of the Iron Lad armor after he was injured in a fight with Victorious. Written by C.B. Cebulski and drawn by Patrick \"Spaz\" Spaziante, the story had originally been called What If the Runaways didn't run away? But it was not until Cebulski accidentally stumbled onto the Young Avengers storyline that he decide to merge the two stories. Joe Quesada, editor in chief of Marvel Comics revealed early in his online interview feature, \"MyCup o' Joe\", that the main villain in the What if? storyline is Victorious, though Kang the Conqueror makes an appearance. A reviewer, Jesse Schedeen of IGN cited What If...? itself as \"a let down\", although the Runaways back-up story was positively received.\nUltimate Marvel\n\nIn the Ultimate Marvel universe, a version of the Runaways exist, but as an all mutant covert team under S.H.I.E.L.D. Director General Nick Fury called Ultimate X. After the events of Ultimatum, Nick Fury contacted former X-Men Jean Grey aka Karen Grant with a purpose to unite fellow mutants to combat threats mostly a conflict in Southeast Asian Republic/SEAR with two cities of superhumans. Members include Jimmy Hudson, son of the late Wolverine, Elizabeth \"Liz\" Allan aka Firestar, a former classmate of Spider-Man who discovered she was a pyrokinetic mutant, and Derek Morgan aka The Guardian, a vigilante in Chicago who can sprout wings, talons and glowing red eyes. The team was officially named The Runaways in Ultimate Comics: Ultimates.\nSecret Wars\n\nAn alternate version of the Runaways star in the comic's fourth volume, taking place during Secret Wars under the Battleworld banner. The mini series was created by Noelle Stevenson and Sanford Greene. In the series, a different group of children, who are students at the Victor von Doom Institute for Gifted Youths in Doomstadt, discover that the school's annual \"final exams\" are actually fatal. They escape but are chased down by senior student Bucky Barnes, under orders from school headmaster Valeria Von Doom.\n\nThe 'Secret Wars' crossover event series ended with 4 issues with no confirmation on whether or not the Runaways are returning for the All-New, All-Different Marvel event after Secret Wars.\nMembers\n\nThe new team includes alternate versions of Marvel heroes such as:\nAmadeus Cho of the Warzone, supposedly the brains of the group, as he can rig into computers and Doombots. He slightly admires Delphyne Gorgon.Cloak and Dagger of Arachnia, Tyrone is Dagger and Tandy is Cloak. The pair are siblings.Delphyne Gorgon of Arcadia, another member of the Night Witches. She loses an arm during the story.Frostbite (Sanna Strand) of Killville, a tough female who always sticks to the rules. She strongly dislikes Jubilee.Jubilee of Limbo, a member of a gang-type group called the Night Witches. However, it is not confirmed whether she is a vampire or not.Molly Hayes of the Kingdom of Manhattan, the only original Runaways character to appear.Pixie (Megan Gwynn) of Mutopia, the third member of Night Witches. Currently deceased.Skarr of Greenland, the Hulk of the group and Cho's bodyguard.",
  "synopsis": null
}