{
  "imdb_id": "tt4437046",
  "tmdb_id": "348499",
  "douban_id": null,
  "title": "Bad Night (2015)",
  "genres": [
    "Adventure",
    "Comedy",
    "Crime"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "92 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.0,
  "director": [
    {
      "id": "nm4801201",
      "name": "Chris Riedell"
    },
    {
      "id": "nm5485262",
      "name": "Nick Riedell"
    }
  ],
  "writer": [
    {
      "id": "nm1895939",
      "name": "Daniel Kinno",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm6835764",
      "name": "Lauren Elizabeth",
      "character": "Kate"
    },
    {
      "id": "nm6351795",
      "name": "Jenn McAllister",
      "character": "Abby"
    },
    {
      "id": "nm1566474",
      "name": "Julianna Guill",
      "character": "Viceroy"
    },
    {
      "id": "nm0551441",
      "name": "Judy Marte",
      "character": "Monarch"
    },
    {
      "id": "nm1747034",
      "name": "Owen H.M. Smith",
      "character": "Wheels       (as Owen Smith)"
    },
    {
      "id": "nm0721725",
      "name": "Gareth Reynolds",
      "character": "Brian"
    },
    {
      "id": "nm0909768",
      "name": "Matt Walsh",
      "character": "Ari"
    },
    {
      "id": "nm0000208",
      "name": "Molly Ringwald",
      "character": "The Collector"
    },
    {
      "id": "nm2053085",
      "name": "June Diane Raphael",
      "character": "Mrs. Goldstein"
    },
    {
      "id": "nm0871251",
      "name": "Ted Travelstead",
      "character": "Bear"
    },
    {
      "id": "nm1468061",
      "name": "Eric Edelstein",
      "character": "Skull"
    },
    {
      "id": "nm2410801",
      "name": "Jayson Paul",
      "character": "Knuckles"
    },
    {
      "id": "nm6950532",
      "name": "Mikey Bolts",
      "character": "Jesse       (as Michael Balalis)"
    },
    {
      "id": "nm3967766",
      "name": "Jade Bender",
      "character": "Jessie"
    },
    {
      "id": "nm5160580",
      "name": "John Mark Loudermilk",
      "character": "Chad"
    },
    {
      "id": "nm3941996",
      "name": "Daniel Button",
      "character": "Beowulf /              Trevor"
    },
    {
      "id": "nm1988111",
      "name": "Casey Wilson",
      "character": "Billy the Tattoo Artist"
    },
    {
      "id": "nm1269723",
      "name": "Adam Pally",
      "character": "The Painter"
    },
    {
      "id": "nm0672539",
      "name": "Eddie Pepitone",
      "character": "The Clown"
    },
    {
      "id": "nm1442113",
      "name": "Jack McBrayer",
      "character": "Motel Clerk"
    },
    {
      "id": "nm0641389",
      "name": "Jim O'Heir",
      "character": "Bob"
    },
    {
      "id": "nm1476601",
      "name": "Marc Evan Jackson",
      "character": "John"
    },
    {
      "id": "nm2076043",
      "name": "Carrie Clifford",
      "character": "Liz"
    },
    {
      "id": "nm1836202",
      "name": "James Kirkland",
      "character": "Snooty Waiter"
    },
    {
      "id": "nm1994245",
      "name": "Nathan Moore",
      "character": "Kratos"
    },
    {
      "id": "nm2285189",
      "name": "Chris Dinh",
      "character": "Hipster Maitre'D"
    },
    {
      "id": "nm0778533",
      "name": "Nellie Sciutto",
      "character": "Ellen"
    },
    {
      "id": "nm3748520",
      "name": "Saxon Anderson",
      "character": "GQ Merc"
    },
    {
      "id": "nm0506373",
      "name": "Dan Levy",
      "character": "Meatball"
    },
    {
      "id": "nm2976758",
      "name": "Robert Dill",
      "character": "Police Officer"
    },
    {
      "id": "nm2432430",
      "name": "Stephen Oyoung",
      "character": "Police Officer 2"
    }
  ],
  "overview": "When Kate and Abby are mistaken for famous art thieves, their fun night out quickly goes from good to bad.",
  "storyline": "When Kate and Abby are mistaken for famous art thieves, their fun night out quickly goes from good to bad.",
  "plot": "Kate (Lauren Elizabeth Luthringshausen) and Abby (Jenn McAllister) are heading to school for a field trip for their art history class that will award them extra credit if they attend. Right before Kate joins her classmates to wait for the school bus, she is informed by her parents that they are no longer able to pay for her college education due to another one of her father's failed investments, much to Kate's disappointment.\n\nAfter a morning spent at an art museum, the class stops at a restaurant for lunch. Although Kate and Abby find the food served repulsive and sickening, their classmates willingly consume it. Kate and Abby decide to eat granola bars Abby brought instead of the served food. While the class is on its way to its next stop after leaving the restaurant, everyone on the bus except for Kate and Abby become nauseous due to the lunch they ate and start vomiting. The teacher, having also eaten the food, brings the class to a motel to spend the night and recover. As Kate and Abby are in the motel asking for rooms, Abby notices an envelope on the counter with the names Viceroy and Monarch written on them.\n\nMeanwhile, Ari (Matt Walsh), gang leader and the owner of a nearby roller skating rink, meets with a driver known as Wheels (Owen Smith) and negotiates a deal. Wheels must drive the two art thieves Ari has hired, who go by the code names Viceroy and Monarch, to help them steal a painting that Ari plans to sell. In return, Wheels will receive a sum of money from the exchange. Wheels agrees to the deal, but on the condition that he will cut off all connections with Ari after this final job. Ari informs Wheels of the motel where the art thieves are to be picked up, which is revealed to be the same motel where Kate and Abby are staying.\n\nKate and Abby, bored with staying in their room, decide to sneak out of the motel to entertain themselves. To avoid identification, Kate names herself and Abby Viceroy and Monarch when ordering a ride. At the same time, the real Viceroy (Julianna Guill) and Monarch (Judy Marte) are preparing to leave the motel for their job to steal the painting Ari hired them to steal. Kate and Abby exit their rooms and find Wheels waiting in his car in the parking lot. With Wheels thinking that Kate and Abby are Viceroy and Monarch and Kate and Abby thinking that Wheels is their driver, Wheels lets them in and drives off while, unbeknownst to them, two of Ari's henchmen follow. Immediately after they leave, Brian, the driver Kate ordered, shows up and picks up the real Viceroy and Monarch.\n\nKate and Abby get Wheels to take them to a thrift store as their first stop, while Brian drops Viceroy and Monarch off at the painting's location. Viceroy and Monarch manage to obtain the painting and continue their operation as Kate and Abby continue their fun night out. They almost get caught by the police, but Monarch manages to take them down while Brian watches in surprise and tries to drive away. Viceroy and Monarch hold Brian at gunpoint and demand that he start talking. When Brian tells them that he is just a driver for a ride-share company, Viceroy and Monarch realize that they got into the wrong car and reveal to Brian that they are in fact undercover FBI agents. Meanwhile, as Kate and Abby are getting tattoos, Wheels realizes that they are not actually Viceroy and Monarch and tells them that they have to leave immediately, just as Ari calls his henchmen (who have been following Kate and Abby, thinking they are Viceroy and Monarch) and tells them to bring Viceroy and Monarch to him right away.\n\nWheels tries to help Kate and Abby escape, but the three encounter Ari's henchmen. Wheels tells Kate and Abby to run while he attempts to fight off the henchmen. However, despite their efforts to escape, Kate and Abby are captured and brought to Ari, who believes they are Viceroy and Monarch. While Abby attempts to explain that they are students, Kate lies and tells Ari that they are Viceroy and Monarch and they have what he wants. Ari holds Abby hostage and demands that Kate get the painting, threatening to kill Abby should she fail. Despite Abby's pleas for Kate to stay with her, Kate runs back to the motel to get help, where she meets the real Viceroy and Monarch, who have been going through the motel's security footage to find who took the ride meant for them.\n\nWith no other choice, Viceroy and Monarch get Kate to pose as Monarch (and gets Kate to pose Abby as Viceroy) and deliver the painting to Ari. As Ari waits for his buyer to arrive and authenticate the painting, Wheels (whose name he has already revealed as Andy) comes in and attempts to convince Ari that Kate and Abby are not Viceroy and Monarch. In response, Ari shows Wheels the painting Kate delivered to him, completely torpedoing Wheels' credibility. Ari's buyer comes and authenticates the painting, but just as she finishes, a clown under Ari's extortion arrives and initiates a shootout. In the ensuing gunfire, Viceroy and Monarch and take down Ari's henchmen and buyer. Ari prepares to shoot Kate and Abby for snitching, but Wheels tackles Ari before he does so. As the buyer tries to escape, Brian, who has been waiting outside, runs over her with his car. Viceroy and Monarch come in and meet Abby and Wheels for the first time, and reveal that they were working for an undercover unit specializing in recovering lost and stolen artwork.\n\nThe group destroys Brian's car to remove any stray links and Viceroy tells Kate and Abby to keep all events of the night confidential. Wheels takes Kate and Abby back to their motel and, to Kate's pleasant surprise, gives Kate a stack of cash to help with her college fund. Kate and Abby reunite with their class and continue their art history field trip.",
  "synopsis": null
}