{
  "imdb_id": "tt4421344",
  "tmdb_id": "364470",
  "douban_id": null,
  "title": "Game Therapy (2015)",
  "genres": [
    "Action",
    "Comedy",
    "Sci-Fi"
  ],
  "country": "Italy",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    }
  ],
  "imdb_rating": 2.2,
  "director": [
    {
      "id": "nm2152590",
      "name": "Ryan Travis"
    }
  ],
  "writer": [
    {
      "id": "nm2019992",
      "name": "Dov Mamann",
      "description": "idea and"
    },
    {
      "id": "nm7682226",
      "name": "Luca Casadei",
      "description": "story &"
    },
    {
      "id": "nm1829742",
      "name": "Marco Cohen",
      "description": "story &"
    },
    {
      "id": "nm6172384",
      "name": "Federico Clapis",
      "description": "story"
    },
    {
      "id": "nm2286969",
      "name": "Adam Lawson",
      "description": "screenplay &"
    },
    {
      "id": "nm6373024",
      "name": "Giacomo Berdini",
      "description": "screenplay &"
    },
    {
      "id": "nm1829742",
      "name": "Marco Cohen",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm6056033",
      "name": "Lorenzo Ostuni",
      "character": "Francesco       (as FaviJ)"
    },
    {
      "id": "nm6172384",
      "name": "Federico Clapis",
      "character": "Giovanni"
    },
    {
      "id": "nm6056034",
      "name": "Leonardo Decarli",
      "character": "Federico"
    },
    {
      "id": "nm7682224",
      "name": "Elisa Piazza",
      "character": "Danika"
    },
    {
      "id": "nm7452260",
      "name": "Daniele Sodano",
      "character": "Gianfilippo"
    },
    {
      "id": "nm2295534",
      "name": "Riccardo Cicogna",
      "character": "Holden Latter"
    },
    {
      "id": "nm1004605",
      "name": "Linus",
      "character": "Giornalista"
    },
    {
      "id": "nm4875795",
      "name": "Elisabetta Torlasco",
      "character": "Allegra"
    },
    {
      "id": "nm4712028",
      "name": "Jennifer Mischiati",
      "character": "Lana"
    },
    {
      "id": "nm3703722",
      "name": "Monica Faggiani",
      "character": "Paola"
    },
    {
      "id": "nm10218509",
      "name": "Lara Gianoli",
      "character": "Gemma"
    },
    {
      "id": "nm4611791",
      "name": "Vittorio Apicella",
      "character": "Alfonso"
    },
    {
      "id": "nm2826494",
      "name": "Lorenza Pisano",
      "character": "Celina"
    },
    {
      "id": "nm7682225",
      "name": "Krizia Picci",
      "character": "Fiona       (as Krizza Picci)"
    },
    {
      "id": "nm10218510",
      "name": "Giovanni Santoro",
      "character": "Medico"
    },
    {
      "id": "nm10218511",
      "name": "Laura Zeolla",
      "character": "Alba"
    },
    {
      "id": "nm6674123",
      "name": "Sofia Chicorelli Serna",
      "character": "Veronica       (as Sofia Jullianna Serna)"
    },
    {
      "id": "nm3145669",
      "name": "Graciela Ramirez",
      "character": "Madre di Veronica"
    },
    {
      "id": "nm1168757",
      "name": "Carlos Ayala",
      "character": "Gangster 1"
    },
    {
      "id": "nm10218512",
      "name": "Lucky Sun Tzu",
      "character": "Gangster 2"
    },
    {
      "id": "nm7625030",
      "name": "Rafael Lozano",
      "character": "Gangster 5"
    },
    {
      "id": "nm10218513",
      "name": "Sofia Valleri",
      "character": "Danzatrice del Ventre"
    },
    {
      "id": "nm10218514",
      "name": "Gaia Barlocco",
      "character": "Ballerina"
    },
    {
      "id": "nm6886265",
      "name": "Paolo D'Amico",
      "character": "Psychologist"
    },
    {
      "id": "nm3967355",
      "name": "William Guirola",
      "character": "Thug 1"
    },
    {
      "id": "nm4944851",
      "name": "Jonny Ortiz",
      "character": "Thug"
    }
  ],
  "overview": null,
  "storyline": "A man tries to cure his friend of his video-game obsession by using a virtual reality machine. When the device traps his friend in a virtual world, he goes in to help him fight for his life.",
  "plot": "Architect and happily married man Evan Webber (Keanu Reeves) has the house to himself and his dog Monkey on Father's Day weekend due to work and a physical therapy appointment due to a shoulder injury while his wife and children go on a family-planned beach trip. His wife Karen (Ignacia Allamand), a successful artist, leaves their assistant Louis (Aaron Burns) in charge of her sculpture that needs to be moved to an art gallery.\n\nTwo women, Genesis (Lorenza Izzo) and Bel (Ana de Armas) knock on Evan's door. He opens the door and they say that they are looking for the address of a party. As they have no means of communication, Evan allows them in to use the Internet and get hold of the party's host. The girls make themselves at home and Evan plays a few of his old vinyl records he has from when he was a DJ. They then disappear to the bathroom when their driver arrives. Evan tries to convince them to leave, but as they start forcing themselves upon him, he gives in and has a threesome with them.\n\nEvan finds out that his wife's sculpture has been vandalized by the girls. When Evan threatens to call the police, the girls reveal they are underage. Vivian (Colleen Camp), a friend of Karen's, stops by to see if Evan needs help. Seeing Genesis, Vivian angrily leaves. When Evan threatens to report a break-in, they give in and agree to be taken home.\n\nHe then returns home, cleans the mess, and tries to go back to his work. Just as he is getting closer to completing his project, he hears a shattering noise. He finds a broken picture frame of his family and Genesis knocks him out with one of his wife's sculptures. Bel climbs onto him trying to arouse him while role-playing as a school girl in his daughter's school uniform. Evan initially refuses, but the girls threaten to FaceTime his wife with him unless he agrees with their methods. Bel rapes him, and Genesis records everything. However, Evan releases himself, knocking Bel off. He charges at Genesis, but is then disarmed by her and Bel who tie him up to a chair with an electrical cord.\n\nLouis arrives to collect the sculpture and finds Evan tied up to a chair, but before he can help him he hears the girls smashing the vandalized sculpture. He runs to stop them, but then has an asthma attack and realizes they took his inhaler. As he tries to get it back, he slips on a piece of the sculpture, hits his head while falling, and dies. They turn Louis' body into a red sculpture and dig a makeshift grave in the backyard meant for Evan. They tie him up with a hose, then bury him in the hole, leaving only his head above ground. Genesis shows Evan the video she recorded earlier with his phone of him and Bel having sex. As Evan watches on, she uploads it to his Facebook profile. They depart and take Monkey with them, leaving Evan to his fate. Karen and the kids arrive home to the entire house ruined while speechless.",
  "synopsis": "The film tells the story of a shy genius of videogames. A friend wants to help him with a machine to detoxify him from dependence on video games, but the machine sends him instead in a virtual world, as Morpheus in Matrix. His friend be forced to follow him to save his life. There will be many action scenes, the two protagonists will have to fight for their lives."
}