{
  "imdb_id": "tt4468634",
  "tmdb_id": "340487",
  "douban_id": null,
  "title": "Certain Women (2016)",
  "genres": [
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "107 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.7,
  "director": [
    {
      "id": "nm0716980",
      "name": "Kelly Reichardt"
    }
  ],
  "writer": [
    {
      "id": "nm0716980",
      "name": "Kelly Reichardt",
      "description": "screenplay"
    },
    {
      "id": "nm1493594",
      "name": "Maile Meloy",
      "description": "based on stories by"
    }
  ],
  "cast": [
    {
      "id": "nm0000368",
      "name": "Laura Dern",
      "character": "Laura"
    },
    {
      "id": "nm0001457",
      "name": "James Le Gros",
      "character": "Ryan"
    },
    {
      "id": "nm0364813",
      "name": "Jared Harris",
      "character": "Fuller"
    },
    {
      "id": "nm1534700",
      "name": "Ashlie Atkinson",
      "character": "Secretary"
    },
    {
      "id": "nm0101777",
      "name": "Guy Boyd",
      "character": "Personal Injury Lawyer"
    },
    {
      "id": "nm0574807",
      "name": "Edelen McWilliams",
      "character": "Fuller's Wife"
    },
    {
      "id": "nm0315288",
      "name": "John Getz",
      "character": "Sheriff Rowles"
    },
    {
      "id": "nm2028579",
      "name": "James Jordan",
      "character": "Hostage Specialist"
    },
    {
      "id": "nm2284053",
      "name": "Matt McTighe",
      "character": "Officer Tommy Carroll"
    },
    {
      "id": "nm6700453",
      "name": "Joshua T. Fonokalafi",
      "character": "Amituana"
    },
    {
      "id": "nm0931329",
      "name": "Michelle Williams",
      "character": "Gina"
    },
    {
      "id": "nm3922989",
      "name": "Sara Rodier",
      "character": "Guthrie"
    },
    {
      "id": "nm0041281",
      "name": "Rene Auberjonois",
      "character": "Albert"
    },
    {
      "id": "nm4291409",
      "name": "Lily Gladstone",
      "character": "The Rancher"
    },
    {
      "id": "nm8050862",
      "name": "Stephanie Campbell",
      "character": "Teacher 1"
    },
    {
      "id": "nm0717520",
      "name": "Kilty Reidy",
      "character": "Teacher 2"
    },
    {
      "id": "nm0829576",
      "name": "Kristen Stewart",
      "character": "Elizabeth Travis"
    },
    {
      "id": "nm0401091",
      "name": "Marceline Hugot",
      "character": "Teacher 3"
    },
    {
      "id": "nm0215943",
      "name": "Zena Dell Lowe",
      "character": "Diner Waitress"
    },
    {
      "id": "nm2230681",
      "name": "Gabriel Clark",
      "character": "Replacement Teacher"
    },
    {
      "id": "nm8561350",
      "name": "Kory Gunderson",
      "character": "Woman in Diner"
    }
  ],
  "overview": "The lives of three women intersect in small-town America, where each is imperfectly blazing a trail.",
  "storyline": "Certain Women drops us into a handful of intersecting lives across Montana. A lawyer (Laura Dern) tries to defuse a hostage situation and calm her disgruntled client (Jared Harris), who feels slighted by a workers' compensation settlement. A married couple (Michelle Williams and James Le Gros) breaks ground on a new home but exposes marital fissures when they try to persuade an elderly man to sell his stockpile of sandstone. A ranch hand (Lily Gladstone) forms an attachment to a young lawyer (Kristen Stewart), who inadvertently finds herself teaching a twice-weekly adult education class, four hours from her home.",
  "plot": "Certain Women explores a handful of intersecting lives across Montana.\n\nLawyer Laura Wells (Laura Dern) has been dealing with a disgruntled client, Fuller (Jared Harris), for eight months. Out of work after a work place injury caused a disability he has taken to visiting Laura repeatedly at her office. As he will not listen to her advice she takes him to another lawyer who, after assessing the case, tells Fuller exactly what Laura told him; that though his company was at fault for his injuries he can no longer sue them after accepting their initial nominal settlement. On the way home from visiting the second lawyer Fuller feuds with his wife and is kicked out of their car and takes a ride back with Laura. On the way home, he tells her he wants to shoot his former employers.\n\nThat night Laura arrives at Fuller's former place of employment where he has taken hostage a security guard. After being prepped by police Laura goes and finds Fuller who has her read the case file his company has on him and the lawsuit. Laura reads the entire file which details how Fuller was cheated out of his settlement. He decides to let the guard go and then asks Laura to stall for him by going to the front and telling the police of his demands as if he has a gun pointed at her while he slips out the back. Instead Laura immediately tells the police where Fuller is and he is arrested.\n\nGina and Ryan Lewis (Michelle Williams and James Le Gros) are a married couple with a teenage daughter building their own home from the ground up. Gina feels that Ryan constantly undermines her with their daughter and is annoyed by his behaviour. On their way home from the campsite of their new home, they decide to stop at the home of Albert (René Auberjonois), an elderly man they know, to try to persuade him to sell them the sandstone on his property. As they talk Gina tries to persuade Albert to sell her the sandstone, but he interrupts her repeatedly and seems only interested in talking with Ryan. Eventually Albert tentatively agrees to give the sandstone to Gina and Ryan, and Gina, who has been secretly recording the conversation, signals that they should leave. In the car on their way home she finds it ridiculous how easily she was able to obtain the sandstone.\n\nSometime later Gina and Ryan arrive and load up a truck full of the sandstone. She notices Albert watching from his window and waves at him but he does not wave back.\n\nJamie (Lily Gladstone) is a ranch hand living in isolation during the winter, tending to horses on a farm outside Belfry. Heading into town one night, she sees cars turning into the school and follows them. She learns she has stumbled onto a class on school law taught by a young lawyer, Beth Travis (Kristen Stewart). Jamie goes out to eat with Beth after class, and Beth explains that she lives in Livingston which is a four-hour drive away, so she must make the eight-hour round trip twice a week to make it back in time for her real job.\n\nDespite having no interest in education law, Jamie returns to class week after week. One week she brings one of her horses to class, and she and Beth ride the horse to the diner. The following week, she is stunned when she learns Beth has quit and a new teacher is brought in as a permanent replacement. Jamie then immediately leaves the class and drives straight to Livingston. Spending the night in her car, she spends the morning driving to law offices hoping to find Beth. Locating her address, Jamie sees Beth in the parking lot and told her she drove over knowing that if she didn't she would never see her again. Beth fails to respond and so Jamie leaves abruptly. On her way home, she falls asleep at the wheel and plows into an empty field.\n\nLaura visits Fuller in prison where he tells her his wife left him for a man in prison and implores Laura to write to him.\n\nAt the site of their new home Gina looks at her pile of sandstone with satisfaction.\n\nBack at the ranch Jamie tends to the horses, still painfully alone.\n\nThe three stories intersect in passing: Laura is having an affair with Gina's husband Ryan, and Jamie inquires Laura's firm while searching for Beth.",
  "synopsis": null
}