{
  "imdb_id": "tt4480494",
  "tmdb_id": "367613",
  "douban_id": null,
  "title": "The Night My Mother Killed My Father (2016)",
  "genres": [
    "Comedy"
  ],
  "country": "Spain",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm0664194",
      "name": "Inés París"
    }
  ],
  "writer": [
    {
      "id": "nm0173101",
      "name": "Fernando Colomo",
      "description": "collaboration"
    },
    {
      "id": "nm0664194",
      "name": "Inés París",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0749104",
      "name": "Belén Rueda",
      "character": "Isabel"
    },
    {
      "id": "nm0673391",
      "name": "Diego Peretti",
      "character": "Diego"
    },
    {
      "id": "nm0273464",
      "name": "Eduard Fernández",
      "character": "Ángel"
    },
    {
      "id": "nm0700229",
      "name": "María Pujalte",
      "character": "Susana"
    },
    {
      "id": "nm0555093",
      "name": "Fele Martínez",
      "character": "Carlos"
    },
    {
      "id": "nm1686507",
      "name": "Patricia Montero",
      "character": "Álex"
    },
    {
      "id": "nm8118742",
      "name": "Alejandra Yu Pastor Pedreros",
      "character": "Estrella"
    },
    {
      "id": "nm8118743",
      "name": "Claudia Nortes",
      "character": "Alba"
    },
    {
      "id": "nm8104774",
      "name": "Lucas Paris",
      "character": "Dylan       (as Lucas París)"
    },
    {
      "id": "nm1940998",
      "name": "Andrés Poveda",
      "character": "Director"
    },
    {
      "id": "nm3453764",
      "name": "Lucrecia Cervelló",
      "character": "Profesora"
    },
    {
      "id": "nm0511023",
      "name": "Jaime Linares",
      "character": "Conductor de autobús"
    }
  ],
  "overview": "Isabel is an actress recent in her 40 years old, unable to get new roles for movies or theaters, since then directors looking for younger women. She is married with the neurotic Ángel, a screenwriter who is working in his next cinema project with Susana, his producer and ex wife. After Isabel, Ángel, Susana and Carlos, Isabel's first husband, send away to them respective child to a school excursion, Isabel accepts to organize in her house a business dinner for Diego, an important Argentinian actor to negotiate his participation in the movie. During the dinner Carlos appears suddenly with a young girl called Álex, announcing their next wedding and moving to Brasil. But when a little time later Carlos dies unexpectedly, Ángel and Susana suspects of the guilty of Isabel, starting a series of events more maddened each time, along a long night where surprises seems not having end...",
  "storyline": "Isabel is an actress recent in her 40 years old, unable to get new roles for movies or theaters, since then directors looking for younger women. She is married with the neurotic Ángel, a screenwriter who is working in his next cinema project with Susana, his producer and ex wife. After Isabel, Ángel, Susana and Carlos, Isabel's first husband, send away to them respective child to a school excursion, Isabel accepts to organize in her house a business dinner for Diego, an important Argentinian actor to negotiate his participation in the movie. During the dinner Carlos appears suddenly with a young girl called Álex, announcing their next wedding and moving to Brasil. But when a little time later Carlos dies unexpectedly, Ángel and Susana suspects of the guilty of Isabel, starting a series of events more maddened each time, along a long night where surprises seems not having end...",
  "plot": "The film begins with Hubert Minel giving a black-and-white monologue explaining how he loves his mother but cannot stand being her son; he also reveals that when he was younger, things were better between them.\n\nHubert is a 16-year-old Québécois living in suburban Montreal with his single mother, Chantale, who divorced Hubert's father, Richard, when Hubert was much younger. Hubert barely sees his father, and this adds to the animosity between mother and son. One morning, as his mother drives him to school, Hubert starts an argument with her about her applying makeup while driving. The argument ends when Chantale stops the car and tells him to walk to school. At school Hubert claims to his teacher, Ms Cloutier, that his mother is dead. After the teacher finds out that it is a lie, she expresses this lie as \"you killed your mother.\" This inspires Hubert to write an essay for school titled \"I killed my mother.\"\n\nLater in the film, Hubert's friend Antonin is revealed to be his boyfriend, but Hubert has not told his mother, and she finds out from Antonin's mother, who assumed that Chantale already knew. Chantale, to some extent, accepts her son's homosexuality; however, she appears hurt that he did not tell her. Hubert wants to live in his own apartment and is happy that his mother says it is a good idea, but the next day she has changed her mind and does not allow it, claiming that she thinks he is too young.\n\nTheir relationship continues to deteriorate, and Hubert goes to live with his teacher, pretending to be staying with his boyfriend. Hubert's father invites him over for a visit; however, once there, Richard and Chantale tell Hubert they've decided to send him to a boarding school in Coaticook. Hubert is deeply angered that his father makes the decision, since Hubert only sees his father at Christmas and Easter.\n\nAt the Catholic boarding school, Hubert meets Eric, with whom he has an affair. Eric invites Hubert to go to a nightclub with the other students, where they kiss and Hubert takes speed. He takes the Metro home, wakes his mother, and has an emotional conversation with her. The next morning, she takes Hubert to Antonin's mother's workplace to help drip the walls in paint. He and Antonin finish, and he lays down. Antonin proceeds to lay on top of him and kiss him, and they end up having sex. Hubert, later at home, trashes his mother's bedroom, but he calms down and cleans it up. The two fight and, in the morning, she sends Hubert back to the boarding school.\n\nBack at school, Hubert is beaten by two fellow students. Hubert runs away with the help of Antonin, who has borrowed his mother's car. On the journey, Antonin tells Hubert that he is selfish and only cares about himself, but adds that he loves him. The school's principal calls Chantale to inform her of the developments, revealing the note Hubert left, saying he will be \"In his kingdom\". The principal also begins to lecture Chantale, which causes her to have an angry outburst at him, saying how he thinks he's better than her and how he has no right to judge a single mother. Chantale knows exactly where Hubert's \"kingdom\" is; the house he lived in as a child with both his parents.\n\nIndeed, she finds Hubert and Antonin there. Chantale sits next to Hubert overlooking the beach. The film ends with a home movie clip of Hubert as a child playing with his mother.",
  "synopsis": null
}