{
  "imdb_id": "tt4459386",
  "tmdb_id": "340627",
  "douban_id": null,
  "title": "Ayanda (2015)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "South Africa",
  "version": [
    {
      "runtime": "105 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.9,
  "director": [
    {
      "id": "nm2431809",
      "name": "Sara Blecher"
    }
  ],
  "writer": [
    {
      "id": "nm0540523",
      "name": "Trish Malone",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm7132688",
      "name": "Fulu Moguvhani",
      "character": "Ayanda Olandele"
    },
    {
      "id": "nm3149922",
      "name": "O.C. Ukeje",
      "character": "David Oluwole"
    },
    {
      "id": "nm0608683",
      "name": "Nthati Moshesh",
      "character": "Dorothy Olandele"
    },
    {
      "id": "nm1970380",
      "name": "Kenneth Nkosi",
      "character": "Zama Buthelezi"
    },
    {
      "id": "nm2347318",
      "name": "Thomas Gumede",
      "character": "Zoum"
    },
    {
      "id": "nm2361025",
      "name": "Jafta Mamabolo",
      "character": "Lenaka Olandele"
    },
    {
      "id": "nm4610062",
      "name": "Sihle Xaba",
      "character": "Sifiso"
    },
    {
      "id": "nm0177505",
      "name": "Vanessa Cooke",
      "character": "Sadie"
    },
    {
      "id": "nm10668204",
      "name": "Yoliswa Mzwakali",
      "character": "Sophie"
    }
  ],
  "overview": "A coming of age story of a twenty one year old Afro hipster, who embarks on a journey of self discovery trying to keep the memory of her father alive, when she's thrown into a world of greasy overalls, gender stereotypes and abandoned vintage cars in need of a young woman's re inventive touch who tries to reclaim what would've been, what could've been.",
  "storyline": "In a community vibrant with migrants from across the African Continent, against the backdrop of unspoken love, a young woman tries to navigate a path for herself. But this is a world where everything keeps shifting... Everything except the one thing that really does need to change. Ayanda and the Mechanic is a coming of age story of a twenty one year old Afro hipster, who embarks on a journey of self discovery trying to keep the memory of her father alive, when she's thrown into a world of greasy overalls, gender stereotypes and abandoned vintage cars in need of a young woman's re inventive touch who tries to reclaim what would've been, what could've been.",
  "plot": "A photographer captures photos and stories of Africans in Yeoville, South Africa, centered largely around Ayanda, a young designer working out of her late father's garage. When Ayanda's mother and her mother's best friend disclose a need to sell the garage, Ayanda, not willing to let go of her father's memory, undertakes a scheme to refurbish old cars to save the business with the help of two loyal mechanics. The film explores the strain Ayanda's endeavor causes within her group of family and friends pitting her obsessive desire to retain everything of her father's against their attempts to move on.",
  "synopsis": null
}