{
  "imdb_id": "tt4568252",
  "tmdb_id": "341450",
  "douban_id": null,
  "title": "Ivan Maryadaraman (2015)",
  "genres": [
    "Comedy"
  ],
  "country": "India",
  "version": [],
  "imdb_rating": 3.4,
  "director": [
    {
      "id": "nm6209399",
      "name": "Suresh Divakar"
    }
  ],
  "writer": [
    {
      "id": "nm1440053",
      "name": "Siby K. Thomas",
      "description": null
    },
    {
      "id": "nm1437907",
      "name": "Udaykrishnan",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0226770",
      "name": "Dileep",
      "character": "Raman       (as Dilip)"
    },
    {
      "id": "nm6264784",
      "name": "Nikki Galrani",
      "character": ""
    },
    {
      "id": "nm7457612",
      "name": "Saju Navodaya",
      "character": "Train Passenger"
    }
  ],
  "overview": "The lead character Raman (Dileep), is an employee in a rice mill in Pune. He used to carry the rice to the mill for processing on a bicycle. Later he decides to buy an auto rickshaw and goes to his village to borrow money from his mother to buy his dream vehicle. But once he reaches his village he is shocked to find a gang of people waiting there to kill him. The rest of the event forms the crux of the plot.",
  "storyline": "The lead character Raman, enacted by Dileep, is an employee in a rice mill in Pune. He used to carry the rice to the mill for processing on a bicycle. Later he decides to buy an auto rickshawand goes to his village to borrow money from his mother to buy his dream vehicle. But once he reaches his village he is shocked to find a gang of people waiting there to kill him.The rest of the event forms the crux of the plot.",
  "plot": "The lead character Raman (Dileep), is an employee in a rice mill in Pune. He used to carry the rice to the mill for processing on a bicycle. Later he decides to buy an auto rickshaw and goes to his village to collect the money that his parents invested in his name in a post office in his hometown 30 years ago. One way to his hometown by train, he befriends a girl krishnendu, who happen's to be his father's arch enemy's daughter. Once he reaches his village he ends up in his father's rivals (krishnendu's) home and later comes to know that they are awaiting to kill him. Raman takes advantage of a tradition of their house that not even one drop of blood should fall inside the house to keep himself alive. Whether or not he comes alive forms rest of the plot of the movie.",
  "synopsis": null
}