{
  "imdb_id": "tt4503598",
  "tmdb_id": "329010",
  "douban_id": null,
  "title": "Emelie (2015)",
  "genres": [
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "82 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.4,
  "director": [
    {
      "id": "nm2836676",
      "name": "Michael Thelin"
    }
  ],
  "writer": [
    {
      "id": "nm2878500",
      "name": "Richard Raymond Harry Herbeck",
      "description": "screenplay as Rich Herbeck"
    },
    {
      "id": "nm2878500",
      "name": "Richard Raymond Harry Herbeck",
      "description": "story by as Rich Herbeck"
    },
    {
      "id": "nm2836676",
      "name": "Michael Thelin",
      "description": "story by"
    }
  ],
  "cast": [
    {
      "id": "nm7182217",
      "name": "Carly Adams",
      "character": "Sally Thompson"
    },
    {
      "id": "nm6211008",
      "name": "Elisha Ali",
      "character": "Kitchen Staff       (as Elisha Ceo Ali)"
    },
    {
      "id": "nm5825804",
      "name": "Tyler Aser",
      "character": "Neighbor"
    },
    {
      "id": "nm3877294",
      "name": "Carl Baily",
      "character": "Officer Morton       (as Carl Bailey)"
    },
    {
      "id": "nm6935437",
      "name": "Thomas Bair",
      "character": "Christopher"
    },
    {
      "id": "nm4318511",
      "name": "Jason John Beebe",
      "character": "Waiter"
    },
    {
      "id": "nm0066616",
      "name": "Chris Beetem",
      "character": "Dan"
    },
    {
      "id": "nm2071090",
      "name": "Heather Benson",
      "character": "Restaurant Patron"
    },
    {
      "id": "nm0092961",
      "name": "Sarah Bolger",
      "character": "Emelie"
    },
    {
      "id": "nm2710153",
      "name": "Bob Bozek",
      "character": "Skinny Man       (as Robert Bozek)"
    },
    {
      "id": "nm4426492",
      "name": "Annette Christian",
      "character": "Howie's mom"
    },
    {
      "id": "nm4885343",
      "name": "Doreen Donovan Corkin",
      "character": "Restaurant Patron"
    },
    {
      "id": "nm5993838",
      "name": "Lynn Czekaj",
      "character": "Restaurant Patron"
    },
    {
      "id": "nm6766438",
      "name": "O'Mick Donald",
      "character": "Kitchen Staff"
    },
    {
      "id": "nm7173539",
      "name": "Michael Joseph Dugan",
      "character": "Cabbie"
    },
    {
      "id": "nm10038520",
      "name": "Rosemarie Feliciano",
      "character": "Neighborhood Resident"
    },
    {
      "id": "nm4507586",
      "name": "Erika Frase",
      "character": "Waiter"
    },
    {
      "id": "nm10038519",
      "name": "Moriah Greene",
      "character": "Neighborhood Resident"
    },
    {
      "id": "nm6237075",
      "name": "Shawn Patrick Greene",
      "character": "Neighborhood Resident"
    },
    {
      "id": "nm5306984",
      "name": "Dante Hoagland",
      "character": "Howie"
    },
    {
      "id": "nm4461055",
      "name": "Daniel James",
      "character": "Waiter"
    },
    {
      "id": "nm6217561",
      "name": "Sara Kow-Falcone",
      "character": "Hostess"
    },
    {
      "id": "nm2348789",
      "name": "Randi Langdon",
      "character": "Anna"
    },
    {
      "id": "nm7710696",
      "name": "Shania Ling",
      "character": "Neighbor"
    },
    {
      "id": "nm7710697",
      "name": "Shannon Ling",
      "character": "Neighbor"
    },
    {
      "id": "nm5982842",
      "name": "Keith Lukowski",
      "character": "Restaurant Patron"
    },
    {
      "id": "nm7305039",
      "name": "Linda Mesi",
      "character": "Neighbor"
    },
    {
      "id": "nm0617188",
      "name": "Brian Mysliwy",
      "character": "Officer Serinos"
    },
    {
      "id": "nm7525775",
      "name": "Mary K. Pleakis",
      "character": "Neighbor"
    },
    {
      "id": "nm1581522",
      "name": "Susan Pourfar",
      "character": "Joyce Thompson"
    },
    {
      "id": "nm8570868",
      "name": "Wilson Prout",
      "character": "Kitchen Staff"
    },
    {
      "id": "nm0744186",
      "name": "Frank Rossi",
      "character": "Tow Truck Driver"
    },
    {
      "id": "nm3019095",
      "name": "Joshua Rush",
      "character": "Jacob"
    },
    {
      "id": "nm5332053",
      "name": "Christopher Srock",
      "character": "Paramedic #1       (as Chris Srock)"
    },
    {
      "id": "nm5823687",
      "name": "Elizabeth Stillwell",
      "character": "Maggie       (as Elizabeth Jayne)"
    },
    {
      "id": "nm2374606",
      "name": "Frank Tedesco",
      "character": "Restaurant Patron"
    },
    {
      "id": "nm7173544",
      "name": "Hilary Walker",
      "character": "Mother"
    },
    {
      "id": "nm4909519",
      "name": "Hilary R. Walker",
      "character": "Mother"
    },
    {
      "id": "nm8268609",
      "name": "Josh Ward",
      "character": "Waiter"
    },
    {
      "id": "nm5621774",
      "name": "Eric Witkowski",
      "character": "Paramedic #2"
    }
  ],
  "overview": "After their regular babysitter Maggie can’t make it, the Thompson family turns to her friend Anna to supervise their children while the parents go out to celebrate their anniversary. At first Anna seems like a dream come true to the kids, allowing them to eat extra cookies and play with things that are usually off-limits, but as her behavior becomes increasingly odd, the kids soon find out that her intentions are dark and twisted, and she is not who she seems to be.",
  "storyline": "A couple's replacement babysitter comes highly recommended. After the parents leave, the children begin to suspect that she is not the person she claims to be when she subjects them to a series of twisted activities.",
  "plot": null,
  "synopsis": "In the opening, we see a girl named Anna is supposed to be babysitting a home, but she is attacked by Emelie and Skinny Man before she can get to the home. Emelie then poses as Anna and enters the house of the kids she's supposed to be babysitting: the kids are 4-year-old Christopher, 9-year-old Sally, and 11-year-old Jacob.Emelie acts sweet until the parents leave for their date. After that, her disturbing nature is slowly revealed. She tells Sally not to smile when taking a picture of them in costumes. During a game of hide-and-seek, Emilie turns off the internet modem, removes the laces from the kids' shoes, and breaks open the safe in the parents' room. She later calls Jacob to the bathroom and asks him for a new tampon, as she's on her period. He asks what that is, and then retrieves one for her. She makes him unwrap it, then inserts it in front of him, flushing blood down the toilet. In the restaurant, the parents are being watched by Skinny Man. Dan, the father, tells Joyce, the mother, that he thinks he needs to have \"the talk\" with Jacob who is going through puberty. He implies that Jacob has been exploring adult content sites.Emelie lets the children run wild, eating too many cookies and drawing on the walls. She feeds Sally's hamster to Jacob's python and forces an extremely upset Sally to watch. She also puts on Joyce and Dan's sex tape, forcing Sally and Christopher to watch. Jacob goes through Emelie's things and finds out that she's not actually Anna. He is horrified to see what Emelie has put on TV and turns it off, angering Emilie.At bedtime, Emilie tells Christopher and Sally a story of a mama bear who had a cub that she loved. The cub died, and Mama Bear met Skinny Hyena, who liked the mama bear and said he'd help her make a new cub. Mama Bear and Skinny Hyena got into trouble and escaped to a new land to search for a new cub. It is revealed that Emelie is the mama bear in the story: one night, she fell asleep with her baby on the couch, accidentally suffocating him. She met Skinny Man (Skinny Hyena), but couldn't have any more children and was unable to adopt a new child. They got passports and Emelie is later seen watching small children at a playground. She texts Skinny Man that she's found her cub.Jacob takes his dad's gun, aiming it at Emelie. She tells him to shoot her but Jacob drops it. The doorbell rings and Emelie tells the kids not to say anything, slapping Jacob when he retorts. It is Maggie, the kids' usual babysitter, who is checking in since she hasn't heard from Anna, her friend. Sally shoves a note in Maggie's bag. Maggie reads the note about the impostor, but Emelie knocks her unconscious. She forces the kids to drink sleeping syrup and tries to suffocate Jacob with a pillow after they have fallen asleep, but Jacob has forcefully vomited up the syrup. Maggie wakes and attacks Emelie to protect the children, but Emelie kills her. She plans to kidnap Christopher so he can become her new child but Jacob has hidden him. Emilie texts Skinny Man that she needs more time. When Dan and Joyce are on their way home, a car drives into them. Skinny Man has sacrificed himself for Emelie's dream of a new child, and is now dead. Police tell the parents that he had no ID.Jacob subdues Emilie with exploding fireworks before taking away a sleeping Sally. Police open the trunk of the crashed car and find Anna's corpse. Dan and Joyce learn this and start rushing home. Jacob loads his brother and sister into his Dad's car and hits Emelie with it as she's aiming a gun at him. Police and his parents arrive and the kids reunite with them. Emelie pants and hurriedly limps away in the final shot."
}