{
  "imdb_id": "tt4519836",
  "tmdb_id": "412418",
  "douban_id": null,
  "title": "Mandela, My Dad and Me (2015)",
  "genres": [
    "Documentary"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "52 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm1427130",
      "name": "Daniel Vernon"
    }
  ],
  "writer": [
    {
      "id": "nm1427130",
      "name": "Daniel Vernon",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0252961",
      "name": "Idris Elba",
      "character": ""
    }
  ],
  "overview": "In 2013, Idris Elba produced and released \"Idris Elba presents mi Mandela\", an album inspired by his time researching and portraying Nelson Mandela in \"Mandela: Long Walk to Freedom\". The musical culture of South Africa was a great influence to him, both present day and historically, and connecting to the music Mr. Mandela would have listened to throughout his life was a great aid in Elba’s preparation for the role. Arrangements were made to record the album in South Africa and Mali at the end of 2013, however, sadly just before Elba left, his father, Winston, passed away. While working simultaneously on the album and promoting his film, Elba had BAFTA award-winning director Daniel Vernon document his movements. \"Mandela, My Dad and Me\" not only documents one man’s struggle in producing his first album, but also his emotional quest to pay a fitting tribute to two inspirational men.",
  "storyline": "In 2013, Idris Elba produced and released \"Idris Elba presents mi Mandela\", an album inspired by his time researching and portraying Nelson Mandela in \"Mandela: Long Walk to Freedom\". The musical culture of South Africa was a great influence to him, both present day and historically, and connecting to the music Mr. Mandela would have listened to throughout his life was a great aid in Elba's preparation for the role. Arrangements were made to record the album in South Africa and Mali at the end of 2013, however, sadly just before Elba left, his father, Winston, passed away. While working simultaneously on the album and promoting his film, Elba had BAFTA award-winning director Daniel Vernon document his movements. \"Mandela, My Dad and Me\" not only documents one man's struggle in producing his first album, but also his emotional quest to pay a fitting tribute to two inspirational men.",
  "plot": null,
  "synopsis": "In 2014 Idris Elba released Mi Mandela, an album inspired by his time researching and playing Nelson Mandela in Mandela: Long Walk to Freedom. The music of South Africa influenced him profoundly as he was preparing for the role. When the film finished shooting, Idris decided to record some music including some of the extraordinary South African musicians he'd heard.Arrangements were made to record in South Africa and Mali, but just as Idris was about to start work on the project his father, Winston, passed away. He decided to dedicate the music he'd produce to the memory of Winston Elba and Nelson Mandela.Idris asked BAFTA award-winning director Daniel Vernon to document this period of his life as he dealt with grief, worked on the album and promoted Mandela: Long Walk to Freedom. The film was originally intended to focus on the recording of the album, but it evolved into something far deeper. Mandela, My Dad and Me not only documents one man's struggle in producing his first album, but also his emotional quest to pay a fitting homage to the two men who have inspired him most."
}