{
  "imdb_id": "tt4537412",
  "tmdb_id": "349048",
  "douban_id": null,
  "title": "Hija de la laguna (2015)",
  "genres": [
    "Documentary"
  ],
  "country": "Peru",
  "version": [
    {
      "runtime": "87 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.7,
  "director": [
    {
      "id": "nm1212597",
      "name": "Ernesto Cabellos"
    }
  ],
  "writer": [
    {
      "id": "nm1212597",
      "name": "Ernesto Cabellos",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm10793107",
      "name": "Nélida Ayay Chilón",
      "character": "Herself"
    },
    {
      "id": "nm6470900",
      "name": "Maxima Acuna Atalaya Chaupe",
      "character": "Herself"
    },
    {
      "id": "nm10793108",
      "name": "Andrea Martínez Martínez",
      "character": "Herself"
    },
    {
      "id": "nm10793109",
      "name": "Bibi van der Velden",
      "character": "Herself"
    },
    {
      "id": "nm6470899",
      "name": "Marco Arana",
      "character": "Himself"
    }
  ],
  "overview": "At the height of the Peruvian gold rush, Nélida, an Andean woman able to communicate with water spirits, uses her powers to prevent a mining corporation from destroying the body of water she considers her mother. A gold deposit valued at billions of dollars lies just beneath Nélida’s lakes and leads farmers and Latin America’s biggest gold producer into conflict.",
  "storyline": "At the height of the Peruvian gold rush, an Andean woman able to communicate with water spirits uses her powers to prevent a mining corporation from destroying the lake she considers to be her mother.",
  "plot": null,
  "synopsis": "Nelida is an Andean woman able to communicate with natures spirits. She feels she is the daughter\nof the lakes that provide water to her village.But just beneath her lakes, Yanacocha, Latin Americas largest gold mine, has discovered a deposit\nvalued at billions of dollars. They have the Peruvian governments support to mine it, even though\nit means drying out the lakes.Farmers who live downstream oppose the project, because they fear running out of water. Its a life\nand death struggle. The police have killed five men during the protests and the farmers not only\nhave to confront the political and economic powers, but also the people in their communities who\nnow depend on the small jobs the mine has given them.When Nelida joins the march from her homeland to Lima, the countrys capital, over a thousand\nkilometers away, she realizes shes not alone. There are thousands of people who want to protect\nthe Andean water sources.Nelida's story has parallels in Bolivia too, where a group of women live on dried out land. Their\nwater disappeared after years of incessant mining. Then there is Bibi, a Dutch jeweler who exhibits\nher pieces on spectacular catwalks in Europe and who decides to visit Peru to discover the origin\nof the gold she uses.Back in Peru, again, there is retaliation against the protesters. Marco, an ex-priest and Nelida's\nmentor, is brutally detained by police whilst sitting in a public square, demonstrating peacefully.The conflict goes on. We see how, in front of 150 policemen about to evict a peaceful protest at the\nlakes, Nelida grabs a phone and communicates with journalists in the city of Cajamarca. Her determination\nprevents a brutal attack. But her participation in these demonstrations has consequences:\nNelida's father, who works for the mine, loses his job.But this doesn't change her determination. She goes back to the lakes and prays to the water\nspirits. She makes them an offering of flowers and the photos of the five farmers killed during this\nseemingly endless conflict. Finally, Nelida asks her mother for the strength to keep going in her\nstruggle for justice."
}