{
  "imdb_id": "tt4500932",
  "tmdb_id": "334656",
  "douban_id": null,
  "title": "En quête de sens (2015)",
  "genres": [
    "Documentary",
    "Adventure"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "88 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.4,
  "director": [
    {
      "id": "nm7169335",
      "name": "Nathanaël Coste"
    },
    {
      "id": "nm7169336",
      "name": "Marc De La Ménardière"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm7231554",
      "name": "Nathanaël Coste",
      "character": "Nathanaël       (voice)"
    },
    {
      "id": "nm7231555",
      "name": "Marc de la Ménardière",
      "character": "Himself"
    },
    {
      "id": "nm2009401",
      "name": "Hervé Kempf",
      "character": "Himself"
    },
    {
      "id": "nm10576477",
      "name": "Frédéric Lenoir",
      "character": "Himself"
    },
    {
      "id": "nm2127740",
      "name": "Pierre Rabhi",
      "character": "Himself"
    },
    {
      "id": "nm0794476",
      "name": "Vandana Shiva",
      "character": "Herself"
    }
  ],
  "overview": null,
  "storyline": "Two childhood friends travel the world to meet some of the greatest thinkers of our time. This incredible voyage, full of moments of doubt and moments of joy, will lead them to question the very beliefs that have shaped Western civilization. This film captures the change in human consciousness currently happening all over the planet, and the desire to live in harmony with oneself and the world.",
  "plot": "The movie is loosely based on historical accounts such as Primary Chronicle and Icelandic Kings' sagas.\n\nKievan Rus, late 10th century. After the death of his father, Svyatoslav I, ruler of Kievan Rus, the young prince Vladimir (Danila Kozlovsky) is forced into exile across the frozen sea in Sweden to escape his treacherous half-brother Yaropolk (Aleksandr Ustyugov), who has murdered his other brother Oleg (Kirill Pletnyov) and conquered the territory of Kievan Rus. The old warrior Sveneld (Maksim Sukhanov) convinces Vladimir to assemble a force of Viking mercenaries led by a Swedish chieftain (Joakim Nätterqvist), hoping to reconquer Kiev from Yaropolk.",
  "synopsis": null
}