{
  "imdb_id": "tt4512038",
  "tmdb_id": "331827",
  "douban_id": null,
  "title": "Rouge Fougère (2016)",
  "genres": [
    "Short",
    "Horror",
    "Musical",
    "Sci-Fi"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "25 min",
      "description": "original"
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm7179294",
      "name": "Machine-Sauvage"
    }
  ],
  "writer": [
    {
      "id": "nm7179297",
      "name": "Mortimer Joly",
      "description": "co-writer"
    },
    {
      "id": "nm7179296",
      "name": "Thomas Pukrop",
      "description": "co-writer"
    },
    {
      "id": "nm7179298",
      "name": "Thomas Zaderatzky",
      "description": "co-writer"
    }
  ],
  "cast": [
    {
      "id": "nm7179297",
      "name": "Mortimer Joly",
      "character": "the Doc"
    },
    {
      "id": "nm7179295",
      "name": "Tristan Mercier",
      "character": "the Leader"
    },
    {
      "id": "nm7179300",
      "name": "Akim Mokrani",
      "character": "Dead Body"
    },
    {
      "id": "nm7179296",
      "name": "Thomas Pukrop",
      "character": "the Right Hand"
    },
    {
      "id": "nm7179299",
      "name": "Simon Zaderatzky",
      "character": "Whipping Boy"
    },
    {
      "id": "nm7179298",
      "name": "Thomas Zaderatzky",
      "character": "the Independant"
    }
  ],
  "overview": "A group of survivors is looking for medicine in a toxic world. Addicted, mankind fells down in its darkest hour. As the team's reserves are dwindling, a new threat appears. Will survivors cope one last time?",
  "storyline": "In the film, protagonists must to ingest a substance every twenty four hours. They don't, they turn into dangerous lunatics. Their environment is toxic, breathing fresh air equals more exposure to the virus. On top of that all, survivors are hunted down by an army of self-aware drones. Their \"medicine\" is the one we all have to swallow every day. It is the message send off by the established order : boxes to fill, control, fear. In that world, you miss your pill and you realize that maybe humanity is slowed down in its elevation. Masses, controlled with cures for \"anxiety\". Sedatives to get us all back to sleep! Don't take your pill and you become a threat to the dogma instated. But beware of a weaponized system, for it will fight back. Perverse administrations, crushing people back into the tiny little box where they belong. Automated war machines, tracking deviants and terminating them. Those who stopped swallowing the pill are nowhere near a liberated human being. They are tortured...",
  "plot": null,
  "synopsis": null
}