{
  "imdb_id": "tt4566934",
  "tmdb_id": "330141",
  "douban_id": null,
  "title": "Cosmic Sex (2015)",
  "genres": [
    "Drama"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.1,
  "director": [
    {
      "id": "nm1125503",
      "name": "Amitabh Chakraborty"
    }
  ],
  "writer": [
    {
      "id": "nm7230338",
      "name": "Liaquat Ali",
      "description": null
    },
    {
      "id": "nm1125503",
      "name": "Amitabh Chakraborty",
      "description": null
    },
    {
      "id": "nm4318493",
      "name": "Surojit Sen",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3370252",
      "name": "Rii Sen",
      "character": "Sadhavi       (as Rii)"
    },
    {
      "id": "nm5746336",
      "name": "Ayushman Mitra",
      "character": "Kripa Shankar Rai"
    },
    {
      "id": "nm5446485",
      "name": "Biplab Banerjee",
      "character": "Kripa's Father"
    },
    {
      "id": "nm7230337",
      "name": "Papia Ghoshal",
      "character": "Devi"
    },
    {
      "id": "nm4581600",
      "name": "Riwk Jaiswal",
      "character": "Jonaki"
    },
    {
      "id": "nm6538373",
      "name": "Murari Mukherjee",
      "character": "Ruhul"
    }
  ],
  "overview": "Cosmic Sex is a 2014 art-house Independent Bengali Film written and directed by Amitabh Chakraborty and produced by Putul Mahmood. The film deals with the connection between Sex and Spirituality.Cosmic Sex is the story of a young man Kripa who is on the run from sex and violence one night in Kolkata when he meets a woman Sadhavi who strangely resembles his dead mother. She gives him shelter and teaches him to travel inwards through sex. The film deals with Dehotatva (worshipping through one’s own body) and explores the connection between Sex and Spirituality. The film stars Rii Sen who won the best actress award at Osian's Cinefan Festival of Asian and Arab Cinema for her bold act in the movie.[",
  "storyline": "Cosmic Sex is the story of a young man Kripa who is on the run from sex and violence one night in Kolkata when he meets a woman Sadhavi who strangely resembles his dead mother.She gives him shelter and teaches him to travel inwards through sex. The film deals with Dehotatva (worshipping through one's own body) and explores the connection between Sex and Spirituality.",
  "plot": null,
  "synopsis": null
}