{
  "imdb_id": "tt4552524",
  "tmdb_id": "339547",
  "douban_id": null,
  "title": "Jeruzalem (2015)",
  "genres": [
    "Horror"
  ],
  "country": "Israel",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.7,
  "director": [
    {
      "id": "nm3575912",
      "name": "Doron Paz"
    },
    {
      "id": "nm3576329",
      "name": "Yoav Paz"
    }
  ],
  "writer": [
    {
      "id": "nm3575912",
      "name": "Doron Paz",
      "description": "written by as The PAZ brothers &"
    },
    {
      "id": "nm3576329",
      "name": "Yoav Paz",
      "description": "written by as The PAZ brothers"
    }
  ],
  "cast": [
    {
      "id": "nm4141803",
      "name": "Yael Grobglas",
      "character": "Rachel Klein"
    },
    {
      "id": "nm1699158",
      "name": "Yon Tumarkin",
      "character": "Kevin Reed"
    },
    {
      "id": "nm2533979",
      "name": "Danielle Jadelyn",
      "character": "Sarah Pullman"
    },
    {
      "id": "nm5713899",
      "name": "Tom Graziani",
      "character": "Omar"
    },
    {
      "id": "nm3760468",
      "name": "Sarel Piterman",
      "character": "Young Priest"
    },
    {
      "id": "nm0728066",
      "name": "Howard Rypp",
      "character": "Howard Pullman"
    },
    {
      "id": "nm0810558",
      "name": "Ami Smolartchik",
      "character": "Taxi driver       (as Ami Smolarchik)"
    },
    {
      "id": "nm1441851",
      "name": "Yoav Koresh",
      "character": "Yehuda"
    },
    {
      "id": "nm4951041",
      "name": "Ori Zaltzman",
      "character": "Tomer"
    },
    {
      "id": "nm4164790",
      "name": "Fares Hananya",
      "character": "Fauzi       (as Fares Hanania)"
    },
    {
      "id": "nm0945788",
      "name": "Itsko Yampulski",
      "character": "David       (as Itzko Yampolski)"
    },
    {
      "id": "nm7362817",
      "name": "Mel Rosenberg",
      "character": "Priest"
    },
    {
      "id": "nm1414244",
      "name": "Danny Zahavi",
      "character": "David's Father       (as Daniel Zahavi)"
    },
    {
      "id": "nm7362819",
      "name": "Moran Zelma",
      "character": "Resurrected Mom"
    },
    {
      "id": "nm7980882",
      "name": "Salim",
      "character": "Oud Playing Grandfather"
    },
    {
      "id": "nm7362818",
      "name": "Ido Di Capua",
      "character": "David as Kid"
    },
    {
      "id": "nm7980883",
      "name": "Daniel Shamota",
      "character": "Zombie"
    },
    {
      "id": "nm7980884",
      "name": "Aya Jonas",
      "character": "Zombie"
    },
    {
      "id": "nm7362820",
      "name": "Geri Gendel",
      "character": "Drake"
    },
    {
      "id": "nm7980885",
      "name": "Udi Greenberg",
      "character": "Man in Asylum"
    },
    {
      "id": "nm7980886",
      "name": "Roy Amsalem",
      "character": "Man in Asylum"
    },
    {
      "id": "nm7980887",
      "name": "Gita Ben Nevat",
      "character": "Woman in Asylum"
    },
    {
      "id": "nm7980888",
      "name": "Peter Filatov",
      "character": "Man in Asylum"
    },
    {
      "id": "nm7980889",
      "name": "Yael Hakshurian",
      "character": "Woman in Asylum"
    },
    {
      "id": "nm7980890",
      "name": "Elroy Jakoby",
      "character": "Dead Man in Church"
    },
    {
      "id": "nm7980891",
      "name": "Shai Sagi",
      "character": "Dead Man in Church"
    },
    {
      "id": "nm7362821",
      "name": "Dibi Ben-Yosef",
      "character": "Tourist Guide"
    },
    {
      "id": "nm2020049",
      "name": "Jason F. Gilbert",
      "character": "Assistant Priest       (as Jason Fredric Gilbert)"
    },
    {
      "id": "nm7980893",
      "name": "Tomer Raziel",
      "character": "Rabbi"
    },
    {
      "id": "nm7980894",
      "name": "Ran Shternin",
      "character": "Rabbi"
    },
    {
      "id": "nm7980895",
      "name": "Moshe Mussa Cohen",
      "character": "Sheikh"
    },
    {
      "id": "nm7980896",
      "name": "Jonathan Israeli",
      "character": "Rabbi"
    },
    {
      "id": "nm7980897",
      "name": "Eran Zomer",
      "character": "Rabbi"
    },
    {
      "id": "nm7980898",
      "name": "Norbert Elbar",
      "character": "Rabbi"
    },
    {
      "id": "nm7980899",
      "name": "Pini Levi",
      "character": "Sheikh"
    },
    {
      "id": "nm7980900",
      "name": "Merav Eisenthal",
      "character": "Rabbi's Wife"
    },
    {
      "id": "nm7980901",
      "name": "Yossi Levim",
      "character": "Sheikh"
    },
    {
      "id": "nm7980902",
      "name": "Ward Melham Gabai",
      "character": "Kid stealing Bag"
    },
    {
      "id": "nm5908650",
      "name": "Steven Hilder",
      "character": "Joel Pullman"
    },
    {
      "id": "nm7980903",
      "name": "Marsh Dondurmar",
      "character": "Band in Club"
    },
    {
      "id": "nm0668570",
      "name": "Jonathan Paz",
      "character": "Priest"
    }
  ],
  "overview": "When a couple of American young adults fly to Israel to visit the city of Jerusalem, a biblical nightmare falls upon the city",
  "storyline": "American best friends Rachel Klein and Sarah Pullman travel to Tel Aviv to have fun. On the flight, they meet Kevin Reed, who invites them to Jerusalem. They accept and check into a hostel owned by Omar. Sarah and Rachel date Kevin and Omar respectively, and they go to a nightclub together. When they return to the hostel, they find that Jerusalem is under siege, a curfew has been imposed, and no one can leave, as they're under attack by demons.",
  "plot": null,
  "synopsis": "In 1972, two priests are called to record an event at Jerusalem. It is revealed that Jewish, Muslim, and Christian priests were all called to perform an exorcism on a woman who supposedly died three days before. Her son claims she was calm at first, but became violent later, injuring her husband. After failed attempts to cure her, the priests decide they have no choice but to kill the woman. In a final attempt, the woman screams while sprouting leather wings, just before a priest kills her with a derringer.In the present day, two Jewish Americans, Rachel Klein (Yael Grobglas) and Sarah Pullman (Danielle Jadelyn), plan a trip to Tel Aviv, Israel. On the plane they meet student Kevin Reed (Yon Tumarkin). Kevin is fascinated by religious mythology (especially the dark angel, the Golem and the undead or zombies). He suggests that Rachel and Sarah join him on his journey to Jerusalem, and mentions that he wants to spend Yom Kippur there. Sarah becomes infatuated with Kevin and convinces her friend to go to Jerusalem.On their way, to the hotel they meet a local who believes that he is King David. The local warns them to leave the city because it's dangerous, but the friends believe he is insane. In the hotel they meet Omar (Tom Grazian), a local Palistinenan. While Rachel starts an affair with Omar, Kevin and Sarah grow closer. The four friends enjoy their time in Jerusalem, party, and tour the city.When they visit the Western Wall, Sarah wishes for her recently dead brother Joel to return. As soon as she puts the paper into the Western Wall, a swarm of black birds fly over the Western Wall. The four friends leave to Solomon's Quarries. There Kevin sees drawings on the wall, feels nervous, and leaves to research the drawings in the city's archives. While Sarah joins him, Rachel and Omar stay at the quarries. After investigating, Kevin warns Sarah to leave the city, because after this day there wouldn't be a tomorrow. Sarah also thinks that there is something strange going on but Rachel refuses to leave.Kevin insists on leaving, but Omar and his father believe that Kevin is crazy and send him to a mental asylum. Later at night Sarah witnesses military planes bomb parts of the city. The media reports it as a potential terrorist attack and that the inhabitants should leave Jerusalem. Sarah tries to set Kevin free from the asylum, but Rachel and Omar, being escorted by two Israeli soldiers, refuse to stop and insist that they keep moving. Sarah convinces the soldiers to help her free Kevin. In the hospital, Sarah finds and frees Kevin. They manage to escape and meet Omar and Rachel at the city walls. However, the city walls are closed and the city is under quarantine. Anyone who tries to leave is brutally shot down. The four friends don't want to give up on their escape, and Omar's father suggests sneaking out through underwater caves he knew as a child. On their way there they are met by demons who attack the civilians, bite them, scratch them to infect them, and eat their flesh. Kevin believes that the doors to hell have been opened. Sarah soon realizes that Rachel has been infected as well. Kevin warns Sarah that Rachel's condition is contagious and that she will eventually change and attack them. Sarah and Kevin decide to take Rachel with them and have her see a doctor once they escape.In the caves, Rachel's condition worsens. Demons begin to attack the friends and Rachel transforms, her eyes turning black. Sarah falls down and Rachel regains control over herself, warning Sarah to run before killing herself. Sarah accidentally kills Omar's father with a sword taken from a statue, when Omar realizes what happened, he commits suicide leaving Kevin and Sarah alone. They meet a creature with black wings who turns out to be Sarah's brother Joel returned to life. Joel leads them from the caves. Upon reaching the other side of the wall, Sarah realizes that she has many scratches similar to Rachel's on her legs and arms. She turns into a demon and flies into the air, while Kevin watches on in shock.In the final shot, thousands of demons are seen flying above Jerusalem as military helicopters surround the scene and fires burn throughout the city."
}