{
  "imdb_id": "tt4512896",
  "tmdb_id": "340082",
  "douban_id": null,
  "title": "Iyore (2015)",
  "genres": [
    "Drama"
  ],
  "country": "Nigeria",
  "version": [],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm2606732",
      "name": "Frank Rajah Arase"
    }
  ],
  "writer": [
    {
      "id": "nm2606732",
      "name": "Frank Rajah Arase",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm6331954",
      "name": "Okawa Shaznay",
      "character": "Princess Ajoke /              Amenze /              Onaiwu Esosa"
    },
    {
      "id": "nm1422658",
      "name": "Paul Obazele",
      "character": "Oba"
    },
    {
      "id": "nm3980475",
      "name": "Joseph Benjamin",
      "character": "Prince Eweka - Azuwa"
    },
    {
      "id": "nm1650067",
      "name": "Rita Dominic",
      "character": "Osarugue"
    },
    {
      "id": "nm1361219",
      "name": "Bukky Wright",
      "character": "Queen Adekoya"
    }
  ],
  "overview": "Iyore means “The Return: A Life After Life“. It is based on the history and the culture of the people of Benin, Nigeria. Iyore – a mixture of historical facts and fiction – explores a tragic love story centered on the rich culture of pre-colonial Benin through to the present day of Benin while exploring the supernatural ideas of reincarnation.",
  "storyline": "Iyore (The Return) or as I like to call it \"Playing with Reincarnation\" is a twisted tale of love transcending from one lifetime to another and growing stronger each time it is reenacted. It tells the story of Osarugue (Rita Dominic) a married Secondary school English teacher in the 80's who is in love with a crown prince of Benin Kingdom Azuwa (Joseph Benjamin) but it is forbidden for she already belongs to another man Osas (Yemi Blaq). The Prince Azuwa is to be married to Ajoke (Okawa Shaznay) a Yoruba Princesss who might be a Reincarnation of Amenze on of the scared Virgins of the ancient Benin Kingdom who had an affair with Edosa the warrior and had to elope with when rather than be buried alive with the dying king.",
  "plot": null,
  "synopsis": null
}