{
  "imdb_id": "tt4502456",
  "tmdb_id": "376221",
  "douban_id": null,
  "title": "Eyes (2015)",
  "genres": [
    "Horror"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.5,
  "director": [
    {
      "id": "nm2203751",
      "name": "Yôhei Fukuda"
    }
  ],
  "writer": [
    {
      "id": "nm0840626",
      "name": "Kôji Suzuki",
      "description": "short story"
    }
  ],
  "cast": [
    {
      "id": "nm5633154",
      "name": "Marika Itô",
      "character": ""
    }
  ],
  "overview": "One day, a mysterious letter 'F' starts to be written on doorplates in a condominium building. Since then, mysterious incidents consistently occur around Yukari Yamamoto, who is an ordinary female high school student living in the building.",
  "storyline": "One day, a mysterious letter 'F' starts to be written on doorplates in a condominium building. Since then, mysterious incidents consistently occur around Yukari Yamamoto, who is an ordinary female high school student living in the building.",
  "plot": "The movie opens in Eastleigh, Nairobi, Kenya, where Alia Mo'Allim (Aisha Takow), a preteen girl, twirls a hula hoop that was just made by her father in their backyard.\n\nBritish Army Colonel Katherine Powell (Helen Mirren) wakes up early in the morning and hears that an undercover British/Kenyan agent has been murdered by the Al-Shabaab terrorist group. From Northwood Headquarters she then begins her no-nonsense command of a mission to capture high-level Al-Shabaab militants meeting in a safehouse in Nairobi, Kenya. The militants include a British couple, Susan Helen Danford (based on Samantha Lewthwaite) and her husband.\n\nA multinational team works together on this capture mission, bound together by video images. Aerial surveillance is provided by a USAF MQ-9 Reaper drone controlled from Creech Air Force Base in Nevada by USAF pilot, 2d Lt Steve Watts (Aaron Paul). Undercover Kenyan field agents, including Jama Farah (Barkhad Abdi), use short-range ornithopter and insectothopter cameras for ground intelligence. Kenyan special forces are positioned nearby to make the arrest. Facial recognition to identify human targets is done at Joint Intelligence Center Pacific at Pearl Harbor, Hawaii. The mission is supervised in the United Kingdom by a COBRA meeting that includes Lieutenant General Frank Benson (Alan Rickman) of the Royal Marines, government ministers and the UK Attorney General.\n\nFarah discovers that the occupants have explosives and are preparing two suicide bombers for what is presumed to be an attack on a civilian target. Powell decides that the imminent bombing changes the mission objective from \"capture\" to \"kill\". She informs drone pilot Watts to prepare a precision Hellfire missile attack on the building and solicits the opinion of her British Army legal counsel about doing so. To her frustration, her counsel advises her to seek approval from her superiors. Benson asks for permission from the COBRA members. Citing conflicting legal and political views and contrasting the tactical value of the assassination with the negative publicity of killing civilians and the status of some of the targets as American or British nationals, they fail to reach a decision and refer the question up to the UK Foreign Secretary (Iain Glen). Somewhat impaired by a bout of food poisoning on a trade mission to Singapore, he does not offer a definite answer and first tries to defer to the US Secretary of State (contacted on a cultural exchange in Beijing, he immediately authorises the strike) and then insists only for due diligence to be performed to minimize collateral damage.\n\nMeanwhile, the situation at the house has become more difficult to assess. Alia, who lives in the adjacent home, has walked over to the vicinity of the target building to sell her mother's baked bread at roadside stand. Alia is visibly, but without her knowledge, in grave danger if the building and the explosives inside are struck by a missile. The collective buck passing of the lawyers and politicians involved in the chain of command or the kill chain argue the personal, political and legal merits of launching a Hellfire missile attack in a friendly country that is not at war with the US or UK and the significant risk of Alia as collateral damage. Watts and his enlisted sensor operator, A1C Carrie Gershon (Phoebe Fox), can see Alia selling bread just outside the targeted building, and they seek to delay firing the Hellfire missile until she moves.\n\nFarah is directed to try and buy all of Alia's bread so she will leave, but in the process his cover is blown and he is forced to flee. The level of urgency is raised when, just as the suicide bombers finish their preparations, the surveillance video being captured by Farah's stationary insectothopter hidden above in the rafters, cuts off due to a drained battery.\n\nSeeking a way to get the authorisation she needs to execute the strike, Powell orders her risk-assessment officer to find strike parameters to let him quote a lower risk of civilian deaths. He re-evaluates a strike point and places the probability of Alia's death at 45–65%. She makes him report only the lower figure up the chain of command. The strike is subsequently authorised, and Watts reluctantly fires a missile. The building is destroyed, with casualties in and around it. Alia, who was reselling the bread Farah dropped upon fleeing, is injured and unconscious. However, Danford also survived. Watts has to fire a second missile, which strikes the site just as Alia's parents reach her. Both suffer minor injuries and rush Alia to a hospital, where she dies.\n\nIn the final London situation room scene, General Benson says: \"Never tell a soldier that he does not know the cost of war.\" The end credits begin rolling back to the beginning of the movie, with Alia shown twirling her hula hoop.",
  "synopsis": null
}