{
  "imdb_id": "tt4562128",
  "tmdb_id": "352596",
  "douban_id": null,
  "title": "Tititá (2015)",
  "genres": [
    "Documentary",
    "Drama",
    "Music",
    "Musical"
  ],
  "country": "Hungary",
  "version": [
    {
      "runtime": "87 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.5,
  "director": [
    {
      "id": "nm0022031",
      "name": "Tamás Almási"
    }
  ],
  "writer": [
    {
      "id": "nm0022031",
      "name": "Tamás Almási",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm7226432",
      "name": "Antal Kuru",
      "character": "Himself"
    },
    {
      "id": "nm1339999",
      "name": "Ferenc Snetberger",
      "character": "Himself"
    },
    {
      "id": "nm7239030",
      "name": "Ádám Lakatos",
      "character": "Himself"
    },
    {
      "id": "nm7239029",
      "name": "Tamás Siska",
      "character": "Himself"
    }
  ],
  "overview": "Anti is an 18-year-old gypsy boy with a passion for playing the guitar. He lives in a gypsy slum in a remote corner of Hungary. By an unexpected opportunity he has a chance to break out now from his hopeless situation. He gets selected to the Snétberger Music Talent Center among sixty other young talents. He is mesmerized by the chance of a better life and hopes for a miracle. Although it turns out soon that he has a huge disadvantage compared to the others, even to the gypsy students. He can't read the music sheets and he is not used to regular practice. The sensitive and lovable boy's story is full of unexpected twists and turns. The viewer is carried with his honesty and special humor. Through Anti's story the feature-length documentary gives a glimpse into the work of the Snétberger Music Talent Center with great music and memorable moments from the life of the Talent Camp.",
  "storyline": "Anti is an 18-year-old gypsy boy with a passion for playing the guitar. He lives in a gypsy slum in a remote corner of Hungary. By an unexpected opportunity he has a chance to break out now from his hopeless situation. He gets selected to the Snétberger Music Talent Center among sixty other young talents. He is mesmerized by the chance of a better life and hopes for a miracle. Although it turns out soon that he has a huge disadvantage compared to the others, even to the gypsy students. He can't read the music sheets and he is not used to regular practice. The sensitive and lovable boy's story is full of unexpected twists and turns. The viewer is carried with his honesty and special humor. Through Anti's story the feature-length documentary gives a glimpse into the work of the Snétberger Music Talent Center with great music and memorable moments from the life of the Talent Camp.",
  "plot": "Bliss Cavendar (Ellen Page) is a misfit in the small town of Bodeen, Texas, with no sense of direction in her life. Her mother, Brooke (Marcia Gay Harden), a former beauty queen, pushes her to enter beauty pageants despite her lack of interest. During a shopping trip to Austin with her mother, Bliss encounters three roller derby team members and finds herself intrigued by the sport in which teams and players are given pun names that highlight the violent aspect of the sport. Intrigued, she and her friend Pash attend a roller derby bout under the pretense of going to a football game, where they see the \"Holy Rollers\" defeat the \"Hurl Scouts\", a perennially unsuccessful derby team.\n\nReturning to Austin, Bliss lies about her age and tries out for the Hurl Scouts, discovering her natural skating abilities in the process. Joining the team, Bliss is given the derby name \"Babe Ruthless.\" After realizing she needs to be unmerciful in roller derby, Bliss sees she needs to take charge in other aspects of her life. One involves Bliss' love interest, a lanky young rock guitarist and singer named Oliver (Landon Pigg) whom she meets via her exposure to roller derby. They enjoy a whirlwind romance before Oliver leaves for a tour, taking a T-shirt Bliss gave him to remember her by, in exchange for his jacket. She later finds a picture of him at a gig with another girl, who is wearing her T-shirt. She burns his jacket in retribution and subsequently breaks up with him following his return, although he vehemently denies that anything happened.\n\nAnother sub-plot examines Bliss' relationship with her parents, a loving but controlling mother and an amiable but clueless father (Daniel Stern) who seldom opposes his wife's parental decisions. After seeing her excelling and enjoying roller derby, Bliss' father convinces her mother to let Bliss out of a pageant (which is at the same time as the championship roller derby game) and convinces the Hurl Scouts to come get Bliss for the bout. Various other sub-plots include her relationship with Pash, and confrontations with a stuck up snob at school. Pash is fine with Bliss' new path, until she gets arrested with an open container of beer while she is waiting for Bliss, who has left to go find Oliver. Eventually, Pash gets together with their manager and forgives Bliss. The movie ends with the Hurl Scouts narrowly losing the championship match and everyone finally getting along; the team chants \"We're number two!\" which was the same thing they chanted when they lost their first match.",
  "synopsis": null
}