{
  "imdb_id": "tt4536494",
  "tmdb_id": "324794",
  "douban_id": null,
  "title": "The Blue Hour (2015)",
  "genres": [
    "Drama"
  ],
  "country": "Thailand",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.9,
  "director": [
    {
      "id": "nm3594105",
      "name": "Anucha Boonyawatana"
    }
  ],
  "writer": [
    {
      "id": "nm3594105",
      "name": "Anucha Boonyawatana",
      "description": "written by and"
    },
    {
      "id": "nm7202258",
      "name": "Waasuthep Ketpetch",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm7202255",
      "name": "Atthaphan Phunsawat",
      "character": "Tam       (as Attapun Poonsawad)"
    },
    {
      "id": "nm6694718",
      "name": "Oabnithi Wiwattanawarang",
      "character": "Phum"
    },
    {
      "id": "nm2804459",
      "name": "Djuangjai Hirunsri",
      "character": "Mother       (as Duangiai Hirunyasri)"
    },
    {
      "id": "nm7202256",
      "name": "Nithiroj Simkamtom",
      "character": "Father       (as Nithirot Simkamtorn)"
    },
    {
      "id": "nm8023489",
      "name": "Apiwat Didsunthiae",
      "character": "Body in garbage dump"
    },
    {
      "id": "nm6694750",
      "name": "Panutchai Kittisatima",
      "character": "Brother       (as Panutchai Kittiisatima)"
    },
    {
      "id": "nm7202257",
      "name": "Chaowalit Teangsap",
      "character": "Phum's Senior"
    },
    {
      "id": "nm8023490",
      "name": "Supachai Nakboon",
      "character": "Motorcycle Mechanic"
    },
    {
      "id": "nm8023491",
      "name": "Teeradet Juthamongkhon",
      "character": "Ghost"
    },
    {
      "id": "nm8023492",
      "name": "Prasert Pleansri",
      "character": "Intermediary"
    },
    {
      "id": "nm5673708",
      "name": "Nipon Jitkert",
      "character": "Hitman"
    }
  ],
  "overview": "Tam, a timid loner, is bullied regularly by his fellow pupils at school. He is met with similar rejection and suspicion within the narrow confines of his parents’ dingy home, where his father beats him. One day Tam arranges online to meet Phum at a derelict swimming pool. They are both looking for sex, but their encounter leaves them with a feeling of comfort and security. A close bond develops between the two boys and, before long, they are roaming the rubbish heaps and dark  corners of the city together, day and night. Phum opens a door for Tam, revealing a fantastical parallel universe full of spirits and dangerous encounters. Although he feels safe and loved for the first time in his life, Tam can no longer differentiate between dream and reality and finds himself increasingly drawn into a spiral of paranoia and violence.",
  "storyline": "THE BLUE HOUR is a sexy supernatural love story about a bullied loner, Tam, who finds solace in the arms of Phum, a boy he meets at a haunted swimming pool. Phum reveals that his family's land has been stolen and the new found lovers imagine a perfect life together on the disputed land. Haunted by a ghostly presence, Tam struggles to stay connected to reality. An official selection of the Berlin International Film Festival, THE BLUE HOUR is a dark atmospheric tale of love and distress.",
  "plot": "This gay romance-horror tells a story of a bullied teenager Tam (Atthaphan Poonsawas) who befriends and has a sexual relationship with a mysterious gay boy Phum (Oabnithi Wiwattanawarang) at a haunted abandoned pool. Their affair starts out as a romance but, later, shifts to a darker territory.",
  "synopsis": null
}