{
  "imdb_id": "tt4588050",
  "tmdb_id": "307226",
  "douban_id": null,
  "title": "Carrossel: O Filme (2015)",
  "genres": [
    "Comedy",
    "Family"
  ],
  "country": "Brazil",
  "version": [
    {
      "runtime": "83 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm0100187",
      "name": "Alexandre Boury"
    },
    {
      "id": "nm4144240",
      "name": "Mauricio Eça"
    }
  ],
  "writer": [
    {
      "id": "nm1644533",
      "name": "Márcio Alemão",
      "description": null
    },
    {
      "id": "nm5448159",
      "name": "Mirna Nogueira",
      "description": null
    },
    {
      "id": "nm4486011",
      "name": "Erez Milgrom",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3987931",
      "name": "Larissa Manoela",
      "character": "Maria Joaquina Medsen"
    },
    {
      "id": "nm5119008",
      "name": "Jean Paulo Campos",
      "character": "Cirilo Rivera"
    },
    {
      "id": "nm5118855",
      "name": "Guilherme Seta",
      "character": "Davi Rabinovich"
    },
    {
      "id": "nm5118473",
      "name": "Maisa Silva",
      "character": "Valéria Ferreira"
    },
    {
      "id": "nm5118703",
      "name": "Nicholas Torres",
      "character": "Jaime Palillo"
    },
    {
      "id": "nm5118999",
      "name": "Fernanda Concon",
      "character": "Alícia Gusman"
    },
    {
      "id": "nm5118571",
      "name": "Matheus Ueta",
      "character": "Kokimoto Mishima"
    },
    {
      "id": "nm5118568",
      "name": "Lucas Santos",
      "character": "Paulo Guerra"
    },
    {
      "id": "nm5118914",
      "name": "Thomaz Costa",
      "character": "Daniel Zapata"
    },
    {
      "id": "nm5118455",
      "name": "Stefany Vaz",
      "character": "Carmen Carrilho"
    },
    {
      "id": "nm5628946",
      "name": "Léo Belmonte",
      "character": "Jorge Cavalieri"
    },
    {
      "id": "nm5146952",
      "name": "Gustavo Daneluz",
      "character": "Mário Ayala"
    },
    {
      "id": "nm5118948",
      "name": "Konstantino Atanassopulos",
      "character": "Adriano Ramos"
    },
    {
      "id": "nm5627790",
      "name": "Esther Marcos",
      "character": "Margarida Garcia"
    },
    {
      "id": "nm5118622",
      "name": "Ana Victória Zimmermann",
      "character": "Marcelina Guerra"
    },
    {
      "id": "nm7088829",
      "name": "Gabriel Calamari",
      "character": "Alan"
    },
    {
      "id": "nm5118966",
      "name": "Aysha Benelli",
      "character": "Laura Gianolli"
    },
    {
      "id": "nm0675471",
      "name": "Orival Pessini",
      "character": "Sr. Campos"
    },
    {
      "id": "nm0314077",
      "name": "Noemi Gerbelli",
      "character": "Diretora Olívia"
    },
    {
      "id": "nm4469486",
      "name": "Márcia de Oliveira",
      "character": "Graça"
    },
    {
      "id": "nm1102019",
      "name": "Paulo Miklos",
      "character": "Gonzales"
    },
    {
      "id": "nm3628316",
      "name": "Oscar Filho",
      "character": "Gonzalito"
    },
    {
      "id": "nm1287171",
      "name": "Eduardo Estrela",
      "character": "Chefe de polícia"
    },
    {
      "id": "nm1002251",
      "name": "Valéria Zopello",
      "character": "Repórter"
    },
    {
      "id": "nm1073280",
      "name": "Márcia Manfredini",
      "character": "Tereza"
    },
    {
      "id": "nm5146905",
      "name": "Carlinhos Aguiar",
      "character": "Jurandir"
    }
  ],
  "overview": null,
  "storyline": "On vacation, Escola Mundial's students travel to Panapaná camp, belonging to Alícia's grandfather. There they participate in a gymkhana organized by Mr. Campos, who does his best to make the kids have fun. However, things get worse with the arrival of González, a representative of a developer who plans to buy the camp's land to turn it into a factory.",
  "plot": "Helena Fernandes is a young and beautiful teacher who carries a lot of love. She entered the Escola Mundial (World School), her first job as a real teacher, to teach the principles of life to the class of third year. Using affection and peace she wins the love of all her students, which in turn have different personalities: a snob Maria Joaquina, the modest Cirilo Rivera, the outgoing Valéria Ferreira, the smart Daniel Zapata, the gentle David Rabinovich, guard Jaime Palillo, the mischievous Paulo Guerra, the rebel Mário Ayala, a shy Carmen Carrilho, the busy Kokimoto Mishima, the romantic Laura Gianolli, the fragile Marcelina Guerra, the cocky Jorge Cavalieri, the creative Margarida Garcia, the brave Alícia Gusman, a friendly Bibi Smith and peaceful Adriano Ramos. At school, the teacher has the support of employees Graça and Firmino who love the students. But Helena has to endure the rules and requirements of Olívia, the director of the institution and the envy of Suzana, a teacher who comes in to replace it for a period.\n\nOutside school, children form a club led by Daniel called \"Patrulha Salvadora\" (Saving Patrol) where they gather in an abandoned house in this group, they help other children who do not study in the Escola Mundial, such as the wheelchair Tom who lives with his mother, Glória is to teacher; Clementina, a girl who is trapped inside her own house and Abelardo Cruz, a mischievous boy who lives with his grandfather, who is in turn a fight with his father.\n\nThe plot takes place in Escola Mundial, which in turn, is coordinated and organized by severe Director Olívia. The Portuguese Firmino Gonçalves and flustered Graça are responsible to clean and guard the school. During the daily life of the characters, Mário Ayala is embittered by the death of his mother, father absence and rude stepmother; Cirilo suffers from bias Maria Joaquina; Jaime with the low grades; Marcelina put up with the antics of his brother Paulo and Carmen parental consent fights.\n\nAdriano lives with his mother and his imaginary friends, among them, half speaking Chulé; Cirilo lives with his parents José and Paula Rivera; Carmen lives with her brother Eduardo and her parents Inês and Frederico Carrilho; Maria Joaquina lives with her housekeeper-nanny Joana and her parents Clara and Miguel Medsen; Paulo and Marcelina live with their parents Lilian and Roberto Guerra; Valéria lives with her parents Rosa and Ricardo Guerra; Jaime lives with his brother Jonas and their parents Heloísa and Rafael Palillo; and Jorge lives with his parents Rosana and Alberto Cavalieri.\n\nRenê, an old school friend of Suzana, is hired to replace Escola Mundial music teacher, Matilde. Meeting Helena in a party thrown by Maria Joaquina, they fall in love, but Suzana is also in love with him and tells several lies to Helena, so that she should get away from him.",
  "synopsis": null
}