{
  "imdb_id": "tt4543578",
  "tmdb_id": "342238",
  "douban_id": null,
  "title": "Drop Dead Gorgeous (2015)",
  "genres": [
    "Comedy"
  ],
  "country": "Brazil",
  "version": [
    {
      "runtime": "100 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.7,
  "director": [
    {
      "id": "nm1006796",
      "name": "Cris D'Amato"
    }
  ],
  "writer": [
    {
      "id": "nm2263833",
      "name": "Carolina Castro",
      "description": "screenplay and"
    },
    {
      "id": "nm4981945",
      "name": "Jô Abdu",
      "description": "screenplay and"
    },
    {
      "id": "nm0754467",
      "name": "Marcelo Saback",
      "description": "screenplay"
    },
    {
      "id": "nm3061960",
      "name": "Bruno Garotti",
      "description": "script collaborator and"
    },
    {
      "id": "nm0031362",
      "name": "Regiana Antonini",
      "description": "script collaborator and"
    },
    {
      "id": "nm2478571",
      "name": "Sylvio Gonçalves",
      "description": "script collaborator"
    },
    {
      "id": "nm2263833",
      "name": "Carolina Castro",
      "description": "story uncredited"
    }
  ],
  "cast": [
    {
      "id": "nm0685123",
      "name": "Glória Pires",
      "character": "Paula Lins       (as Gloria Pires)"
    },
    {
      "id": "nm4420903",
      "name": "Emilio Dantas",
      "character": "Daniel"
    },
    {
      "id": "nm5095171",
      "name": "Antonia Morais",
      "character": "Alice Lins"
    },
    {
      "id": "nm0655938",
      "name": "Ângelo Paes Leme",
      "character": "Francis       (as Angelo Paes Leme)"
    },
    {
      "id": "nm2639487",
      "name": "Pablo Sanábio",
      "character": "Marcelo"
    },
    {
      "id": "nm3272435",
      "name": "Polly Marinho",
      "character": "Jaci       (as Priscilla Marinho)"
    },
    {
      "id": "nm0735110",
      "name": "Gláucia Rodrigues",
      "character": "Cristina"
    },
    {
      "id": "nm0896697",
      "name": "Susana Vieira",
      "character": "Mãe Lina"
    },
    {
      "id": "nm0592207",
      "name": "Stella Miranda",
      "character": "Gilda Bayão"
    },
    {
      "id": "nm0664650",
      "name": "Vivianne Pasmanter",
      "character": "Jô"
    },
    {
      "id": "nm1845119",
      "name": "Charles Fricks",
      "character": "Rodrigo"
    },
    {
      "id": "nm2778404",
      "name": "Cora Zobaran",
      "character": "Dona Marly"
    },
    {
      "id": "nm2815503",
      "name": "George Sauma",
      "character": "Leon Terra"
    },
    {
      "id": "nm0603862",
      "name": "Alexandre Moreno",
      "character": "Deodato"
    },
    {
      "id": "nm8121220",
      "name": "Aline Guimarães",
      "character": "Laura"
    },
    {
      "id": "nm0417962",
      "name": "Ana Jansen",
      "character": "Jaque"
    },
    {
      "id": "nm0563536",
      "name": "Alcione Mazzeo",
      "character": "Marcela"
    },
    {
      "id": "nm5056142",
      "name": "Laura Prado",
      "character": "Shirley"
    },
    {
      "id": "nm5627375",
      "name": "Bruno Jablonski",
      "character": "João"
    },
    {
      "id": "nm0695002",
      "name": "Adolfo Prado",
      "character": "Professor de Fotografia"
    },
    {
      "id": "nm1443549",
      "name": "Nilvan Santos",
      "character": "Médium Cemitério"
    },
    {
      "id": "nm8324995",
      "name": "Mel Costa",
      "character": "Alice Criança"
    },
    {
      "id": "nm2745966",
      "name": "Mariana Bassoul",
      "character": "Manicure"
    },
    {
      "id": "nm0210439",
      "name": "Dhu Moraes",
      "character": "Cliente do Salão"
    },
    {
      "id": "nm6284638",
      "name": "Gustavo Nader",
      "character": "Atendente de Farmácia"
    },
    {
      "id": "nm0858254",
      "name": "Luisa Thiré",
      "character": "Repórter 1 Fachada Clínica"
    },
    {
      "id": "nm5854795",
      "name": "Ronaldo Gontijo",
      "character": "Repórter 2 Fachada Clínica"
    }
  ],
  "overview": null,
  "storyline": "Paula Lins is a powerful woman who dies after uses her own medicine against cellulite and, on the other side of life, as an spirit, tries to avoid the sell of them.",
  "plot": "In 1995, Mount Rose is preparing for its annual beauty pageant. Amber Atkins (Kirsten Dunst) is an optimistic teenager who signs up to compete in the pageant so she can follow in the footsteps of her idols, Diane Sawyer, and her mother, a former contestant. Amber works after school applying makeups to corpses at the mortuary, and lives with her mother, Annette Atkins (Ellen Barkin), in a small trailer near their friend Loretta (Allison Janney). This is in stark contrast to fellow contestant Rebecca (\"Becky\") Leeman (Denise Richards), the daughter of the richest man in town and his wife, Gladys Leeman (Kirstie Alley), who is the head of the pageant organizing committee and a former winner. Various business connections between the Leeman Furniture Store and the judges of the pageant cause many to speculate that the contest will be rigged or fixed.\n\nMany odd events occur around town during the run-up to the pageant, including the death of a contestant, the athletic and competitive Tammy Curry, who is killed when her tractor explodes, and the death (ruled a hunting accident) of a boy who Becky liked, but who showed himself partial to Amber. Amber decides to pull out of the pageant after her mother is injured in an explosion at their mobile home, but reconsiders and decides to compete to follow her dreams and make her mother proud. At the dress rehearsal, fellow contestant Jenelle Betz swaps numbers with Amber. When Jenelle walks on stage at the beginning of rehearsal, a stage light falls and hits her in the head, knocking her unconscious and rendering her deaf. Luckily, Jenelle is a master of sign language so she claims that despite dropping out of the pageant, she has never been happier.\n\nAt the pageant, Amber's dance costume mysteriously goes missing. Amber blames Becky and the two get into a catty fight. Amber's best friend and fellow contestant Lisa Swenson (Brittany Murphy) tears them apart. After comforting a crying Amber, Lisa drops out of the pageant in order to give her own costume to Amber. Amber then performs her tap-dance number to a standing ovation, while Rebecca sings a cringe-worthy rendition of \"Can't Take My Eyes Off You\" and dances with a life-size Jesus doll on a crucifix, both amusing and horrifying the audience. During judging, the previous year's winner Mary Johanson (now hospitalized with anorexia) reprises her talent act (lip-synching \"Don't Cry Out Loud\") while being pushed around the stage in her hospital wheelchair in a re-enactment of her dance movements. When the new winner is announced, Amber is named first runner-up to Rebecca.\n\nDuring the victory parade the next day, Rebecca is killed in a freak accident when the elaborate float (made in Mexico, to save her father money) on which she is riding explodes. The grief-stricken Gladys flies into a blind rage and admits to having killed Tammy and to being responsible for all the attempts against Amber in the run-up to the pageant, and is immediately arrested. Rebecca's tragic death and Gladys's antics leave Amber as the new pageant winner.\n\nAt the State Competition, Amber wins the Minnesota American Teen Princess title by default after all the other contestants fall ill with seafood-related food poisoning, and Amber gets an all-expenses-paid trip to the national Sarah Rose American Teen Princess Pageant. Upon arrival there, Amber and the other state winners are devastated to find that the cosmetics company has been shut down by the IRS for tax evasion. This sends all the contestants except Amber on a rampage, vandalizing and destroying the property.\n\nA few years later, Gladys escapes from prison and is sniping from the top of the Mount Rose supermarket, declaring her intent to take revenge on Amber. During the six-hour police standoff, a television reporter doing a live report at the scene is hit by a stray bullet. Amber quickly picks up the reporter's microphone and takes over, impressing the news station with her poise and confidence. The film closes with a scene showing Amber as co-anchor of the evening news for Minneapolis–St. Paul television station WAZB-TV, thus living her dream of possibly becoming the next Diane Sawyer.",
  "synopsis": null
}