{
  "imdb_id": "tt4576246",
  "tmdb_id": "335564",
  "douban_id": null,
  "title": "That's It (2015)",
  "genres": [
    "Drama"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "110 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm0411025",
      "name": "Gakuryû Ishii"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm1687017",
      "name": "Gô Ayano",
      "character": ""
    },
    {
      "id": "nm5148361",
      "name": "Yohei Matsukado",
      "character": "Bar Ganeza master"
    },
    {
      "id": "nm3296538",
      "name": "Erina Mizuno",
      "character": ""
    },
    {
      "id": "nm0613472",
      "name": "Jun Murakami",
      "character": ""
    },
    {
      "id": "nm1097739",
      "name": "Kiyohiko Shibukawa",
      "character": ""
    },
    {
      "id": "nm2202409",
      "name": "Shôta Sometani",
      "character": ""
    }
  ],
  "overview": "Samao Daikoku’s (Shota Sometani) family register was taken which keeps him from escaping the underground life that he has led. To get away once and for all, Samao Daikoku breaks into Daikichi Ebisu's (Kiyohiko Shibukawa) coin locker to steal gold. Daikichi Ebisu is involved in a criminal organization. In the locker, Samao Daikoku finds a hard disk containing personal information on runaways, homeless people, bankrupt people and prostitutes. He hides the hard disk, but is locked up by Daikichi Ebisu. There, he sees a prostitute, Ami Nanmu (Erina Mizuno) and he also faces an evil gang boss, Kan Senju (Gou Ayano). Samao Daikoku is tortured by the gang boss. The mystery behind Samao Daikoku’s past is revealed.",
  "storyline": "Daikoku and Ami want to escape their wayward lives. When they are thrown together they set out to kill a yakuza boss and also blackmail the thugs using stolen information to find Daikoku's estranged father and move on. Violence, maiming and torture follows, but there is also the matter of the shared history of the characters that needs to be overcome.",
  "plot": null,
  "synopsis": null
}