{
  "imdb_id": "tt4579982",
  "tmdb_id": "403972",
  "douban_id": null,
  "title": "Ishq Click (2016)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": null,
  "version": [
    {
      "runtime": "165 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.4,
  "director": [
    {
      "id": "nm6182370",
      "name": "Anil Ballani"
    }
  ],
  "writer": [
    {
      "id": "nm7373312",
      "name": "Rajeev Yogendra Nath",
      "description": null
    },
    {
      "id": "nm7611356",
      "name": "Niket Pandey",
      "description": "dialogue and screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm3872330",
      "name": "Sara Loren",
      "character": ""
    },
    {
      "id": "nm3057159",
      "name": "Adhyayan Suman",
      "character": ""
    },
    {
      "id": "nm7373408",
      "name": "Aaryansh Arora",
      "character": ""
    },
    {
      "id": "nm7241241",
      "name": "Sanskkriti Jain",
      "character": ""
    },
    {
      "id": "nm5897302",
      "name": "Sanjay Gurbaxani",
      "character": ""
    },
    {
      "id": "nm4366664",
      "name": "Narendra Jetley",
      "character": "Mr. Mehta"
    },
    {
      "id": "nm4284265",
      "name": "Kaishav Arora",
      "character": "Dr. Tushar"
    }
  ],
  "overview": "Ishq Click is an upcoming 2016 Bollywood Romantic film, directed by Anil Balani and produced by Ajay Jaiswal and Satish Tripathi. It stars Adhyayan Suman and Sara Loren. The film is based on the life of a supermodel from Mumbai who struggles very hard to become a top model and a photographer who helps her in her struggle.",
  "storyline": "This is the story of Aditya a struggling photographer holidaying in the beautiful valleys of Himachal Pradesh, where he meets a pretty girl Sophie and happens to click her while sight seeing. Post which he tries to befriend her but has many failed attempts. He also loses focus from his own career as he can see no one beyond Sophie in his life. On befriending Sophie he persuades her to try modelling in the City of dreams Mumbai. As luck would have it her stunningly perfect looks work well for her career making her one of the topmost models. However Aditya is yet to find his ground as his parents are pushy and career oriented pressuring Aditya to become serious with his career. He also hugely depends on Sophie for money, networking and personal gains. One fine day Aditya meets Ira daughter of a successful photographer Mr Mehta at a family event and soon turns to her for his personal benefits. Realizing the struggle that goes into becoming a successful photographer Aditya takes a ...",
  "plot": "From Mumbai, a girl; Sophie Dias (Sara Loren), struggles too hard to become a top Super Model and during her struggle she meets a photographer; Aditya Vardhan (Adhyayan Suman), who helps her throughout her efforts and also falls in love with her. The movie was released on 22 July 2016 and the Promotions of the movie is done by Vedant Kumar Mishra Shamrock Communications.",
  "synopsis": null
}