{
  "imdb_id": "tt4535650",
  "tmdb_id": "370665",
  "douban_id": null,
  "title": "Dilwale (2015)",
  "genres": [
    "Action",
    "Comedy",
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "158 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.3,
  "director": [
    {
      "id": "nm1460159",
      "name": "Rohit Shetty"
    }
  ],
  "writer": [
    {
      "id": "nm1182352",
      "name": "Yunus Sajawal",
      "description": "screenplay"
    },
    {
      "id": "nm2260872",
      "name": "Farhad Samji",
      "description": "dialogue as Farhad &"
    },
    {
      "id": "nm2678319",
      "name": "Sajid",
      "description": "dialogue"
    }
  ],
  "cast": [
    {
      "id": "nm0451321",
      "name": "Shah Rukh Khan",
      "character": "Raj /              Kaali"
    },
    {
      "id": "nm0004418",
      "name": "Kajol",
      "character": "Meera Malik"
    },
    {
      "id": "nm3315894",
      "name": "Varun Dhawan",
      "character": "Veer"
    },
    {
      "id": "nm5305841",
      "name": "Kriti Sanon",
      "character": "Ishita"
    },
    {
      "id": "nm1224082",
      "name": "Boman Irani",
      "character": "King"
    },
    {
      "id": "nm5607349",
      "name": "Varun Sharma",
      "character": "Sidhu"
    },
    {
      "id": "nm0505323",
      "name": "Johnny Lever",
      "character": "Money Bhai"
    },
    {
      "id": "nm0864608",
      "name": "Mukesh Tiwari",
      "character": "Shakti"
    },
    {
      "id": "nm2690647",
      "name": "Pankaj Tripathi",
      "character": "Anwar       (as Pankaj Tripathy)"
    },
    {
      "id": "nm0592799",
      "name": "Sanjay Mishra",
      "character": "Oscar Bhai"
    },
    {
      "id": "nm7244102",
      "name": "Chetna Pande",
      "character": "Jenny"
    },
    {
      "id": "nm0451396",
      "name": "Vinod Khanna",
      "character": "Randheer Bakshi"
    },
    {
      "id": "nm0001934",
      "name": "Kabir Bedi",
      "character": "Dev Malik"
    },
    {
      "id": "nm3976983",
      "name": "Naushaad Abbas",
      "character": "King's Henchman"
    },
    {
      "id": "nm1568415",
      "name": "Kamal Adib",
      "character": "Uncle Joe"
    },
    {
      "id": "nm1603537",
      "name": "Shawar Ali",
      "character": ""
    },
    {
      "id": "nm7807766",
      "name": "Stuti Dixit",
      "character": "Young Ishita"
    },
    {
      "id": "nm1639811",
      "name": "Peter Fernandes",
      "character": "King's Driver"
    },
    {
      "id": "nm2234698",
      "name": "Pradeep Kabra",
      "character": "Joshua"
    },
    {
      "id": "nm1375482",
      "name": "Jahangir Khan",
      "character": "Patrick"
    },
    {
      "id": "nm6698705",
      "name": "Krishna Kotian",
      "character": "Peter"
    },
    {
      "id": "nm1582443",
      "name": "Yogesh Lakhani",
      "character": "Customer At The Cafe"
    },
    {
      "id": "nm7807765",
      "name": "Mitansh Lulla",
      "character": "Young Veer"
    },
    {
      "id": "nm2085345",
      "name": "Vladimir Mihailov",
      "character": "Bulgarian Goon"
    },
    {
      "id": "nm2268616",
      "name": "Vlado Mihailov",
      "character": "Bulgarian Goon"
    },
    {
      "id": "nm7055092",
      "name": "Avinash Ojha",
      "character": "Pintoo"
    },
    {
      "id": "nm1241985",
      "name": "Chetan Pandit",
      "character": ""
    },
    {
      "id": "nm8216501",
      "name": "Samrat Raichand",
      "character": ""
    },
    {
      "id": "nm7807767",
      "name": "Rajlaxmi",
      "character": "Meera's Maid"
    },
    {
      "id": "nm1205111",
      "name": "Sunil Rodrigues",
      "character": "Robert"
    },
    {
      "id": "nm7807764",
      "name": "Sujit Sen",
      "character": "Doctor"
    },
    {
      "id": "nm1167594",
      "name": "Nawab Shah",
      "character": "Raghav"
    },
    {
      "id": "nm7807763",
      "name": "Ahmad Shaikh",
      "character": "Tawde"
    },
    {
      "id": "nm1302330",
      "name": "Murli Sharma",
      "character": ""
    },
    {
      "id": "nm0788931",
      "name": "Vineet Sharma",
      "character": "Kaali's Man"
    }
  ],
  "overview": "The most painful goodbyes are the ones that are never said and never explained. The film is a story about Raj and Meera and their enchanting relationship that travels through years of hatred for each each other. Set in a vicious and violent environment, Raj and Meera deal with the conflict between their respective families and the repercussions of merciless violence between them. Not all love stories are destined to have happy endings. But as it is rightfully said that “every end has a new beginning” Raj and Meera’s story make us believe that love is a force more formidable than any other. It is invisible and cannot be seen or measured, yet it is powerful enough to transform you in a moment and offer you peace to overcome the most unforgettable memory of your life.",
  "storyline": "Raj is a Mafia member. One day he meet a girl (Meera) while chasing by his rival gang and falls in love with her. Later he finds out that this girl is the daughter of the leader of his rival gang. Yet their love story continues until he was shot by his girlfriend upon a deep misunderstanding. After that incident these two lovers lives separate until their siblings fallen in love. With this new love story their paths intertwines again.",
  "plot": "This article's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (October 2016) (Learn how and when to remove this template message)\nThe movie begins in Goa, where Raj leaves his auto repair shop to confront Mani for stealing a man’s cell phone. Mani tells Raj that he is stealing it for his younger brother, whom he must care for after both of their parents died. While out driving, Veer sees a woman, Ishita, hitchhiking but his friend refuses to pick her up. However, after he stops the car to urinate and leave his friend and went back to ishita, and he agrees to take her where she needs to go, damaging the car in his rush to get there. For penance, Raj forces Veer to work in the shop day and night. Veer’s friend Siddhu provides him with coffee so he can stay awake to fix the car. However, he falls asleep anyway and awakes to find that the car’s sound system has been stolen. Siddhu takes it to a pawn shop to sell it, having stolen the sound system while Veer was asleep.\n\nThe men of the local gang leader, King, try to sell drugs at a crab shack. Veer beats them up after they threaten Ishita. They then come back later to exact revenge on Veer, but Raj breaks up the fight. Raj’s men find him at the hospital where Veer is staying and tell him they know where to find King’s men. Raj goes to King's hideout, incapacitates the gang members, and burns their drug stash. Raj tells King’s men his gangster name, Kaali. King stops by Raj’s shop the next day to present a deal where Raj will fix all of King’s cars in exchange for protection.\n\nThe film then flashes back to Bulgaria. Raj is in a car chase with a rival gang, trying to make off with a container of gold, when he accidentally runs over a woman, Meera. When he gets out to help her, the rival gang catches up with him, and he has to leave. Later, Raj runs into Meera again, who works as a sketch artist. He reveals to her that he is a gangster, and that he is the son of Randhir Bakshi, the leader of the gang. Veer attends a boarding school where Raj only comes to visit once a month. Randhir and Raj talk about how Raj was adopted. Raj meets with Meera again, and she asks him to take care of some guys who are troubling her. She also asks him to celebrate her birthday with her the next day. He promises to take care of a job early and then meet her in the evening. The next day, Raj is engaged in a car chase. His car gets blown up and rolls over, trapping him inside. He is confronted by Meera, who he finds out is the daughter of the rival gang’s leader, Malik. She reveals that their entire relationship so far was designed so that Malik’s gang could have a chance to kill him. She holds a gun to his head, but she chooses to spare his life this time. Later, Raj gets a new car and engages in a car chase with Meera, eventually pushing her car to the edge of a cliff. He saves Meera from falling off the cliff, then tells her that the next time he sees her, he will kill her. Despite this warning, she later comes to his home and tells him that she loves him. At first he refuses to listen to her, but then he admits that he loves her, too. They make plans to tell their parents about their relationship.\n\nThe film quickly flashes back to Goa, where Veer discovers that Siddhu has been putting sleeping pills in Veer’s coffee so that he fell asleep on his shift, allowing Siddhu to steal items from the shop. Veer is upset, but Siddhu explains it is for his girlfriend, Jenny. They agree to help each other secure girlfriends. As a consequence, Veer reveals his feelings to Ishita. Upon finding out about their relationship, Raj wants to meet Ishita’s family. When Raj visits Ishita’s house, he discovers that Meera is Ishita’s older sister.\n\nThe film then quickly flashes back to Bulgaria, where Malik agrees to meet Randhir, but, secretly, he plans to kill him. The meeting breaks into a shootout, during which Malik shoots Randhir. Randhir then shoots Malik, and both men die. Raj holds Randhir and takes the gun out of his hand. Meera finds Raj and believes that he killed her father, for which she shoots Raj; however, he survives the gunshot. Both Meera and Raj decide to move far away from Bulgaria and start a new life.\n\nThe film is again in Goa, where Veer and Ishita come up with several plots to bring Meera and Raj together. As a side plot, Mani steals King’s car and brings it to the shop, where Veer discovers drugs in the trunk and decides to burn them. Ishita tells Raj that Meera has not forgotten her first love. King comes to Meera’s house one night, but Raj, as Kaali, shows up and stops them from causing her any harm. King asks Meera later if she knows Kaali, but she refuses to acknowledge their relationship.\n\nMeera issues an ultimatum that in order to marry Ishita, Veer must move in with Meera. Meera also tells him that Raj is adopted and not his blood brother. Veer says that he loves Ishita, but he cannot abandon his brother. Raghav, one of Malik’s men, decides to tell Meera that Raj did not kill Malik, but that Malik had shot Randhir, who had shot Malik in return. Upon learning this, Meera tells Veer that he can marry Ishita and stay with Raj.\n\nSiddhu and Jenny get married. King shows up at the wedding, having tracked down his stolen car, which is now being used as the bride and groom’s getaway car. King starts to cause a disturbance, but Raj beats him up. King then tries to shoot Raj, but accidentally shoots Meera. The gunshot doesn't turn out to be fatal.",
  "synopsis": null
}