{
  "imdb_id": "tt4549224",
  "tmdb_id": "408151",
  "douban_id": null,
  "title": "The Standoff (2016)",
  "genres": [
    "Comedy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.3,
  "director": [
    {
      "id": "nm1058415",
      "name": "Ilyssa Goodman"
    }
  ],
  "writer": [
    {
      "id": "nm1354901",
      "name": "Leigh Dunlap",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3127051",
      "name": "Olivia Holt",
      "character": "Amy Roberts"
    },
    {
      "id": "nm5524124",
      "name": "Ryan McCartan",
      "character": "Farrell Bennett"
    },
    {
      "id": "nm0122846",
      "name": "Regan Burns",
      "character": "Big Jim"
    },
    {
      "id": "nm1842974",
      "name": "Alex Wolff",
      "character": "Zane"
    },
    {
      "id": "nm2193008",
      "name": "Sydney Park",
      "character": "Emerson"
    },
    {
      "id": "nm3591790",
      "name": "McKaley Miller",
      "character": "Sophie Jackson"
    },
    {
      "id": "nm2733899",
      "name": "Audrey Whitby",
      "character": "Lala Zzyzx"
    },
    {
      "id": "nm3285029",
      "name": "Chandler Massey",
      "character": "Chris Goodman"
    },
    {
      "id": "nm6371037",
      "name": "Vanessa Merrell",
      "character": "Maya"
    },
    {
      "id": "nm6371036",
      "name": "Veronica Merrell",
      "character": "Mia"
    },
    {
      "id": "nm3860979",
      "name": "Julian Works",
      "character": "Jerome Bryant"
    },
    {
      "id": "nm7209984",
      "name": "Stony Blyden",
      "character": "Klyde Kosar       (as Stony)"
    },
    {
      "id": "nm7496975",
      "name": "Daniel Vasquez",
      "character": "Colby Mann"
    },
    {
      "id": "nm4026778",
      "name": "Timothy Granaderos",
      "character": "Jack Guthrie       (as Tim Granaderos)"
    },
    {
      "id": "nm5318250",
      "name": "Diana Caravella",
      "character": "Crazy Cat Lady"
    },
    {
      "id": "nm4414016",
      "name": "Howard Cai",
      "character": "GameNinjaKing"
    },
    {
      "id": "nm3752578",
      "name": "Ciara Hanna",
      "character": "Christie the Dream Girl"
    },
    {
      "id": "nm5652539",
      "name": "Radek Lord",
      "character": "Frank"
    },
    {
      "id": "nm8508077",
      "name": "Shervin Biteng",
      "character": "Lala's Geek"
    },
    {
      "id": "nm9511382",
      "name": "Logan Mills",
      "character": "Lala's Geek"
    },
    {
      "id": "nm9804386",
      "name": "Benjamin Phipps",
      "character": "Lala's Geek"
    },
    {
      "id": "nm7081830",
      "name": "Una Jensen",
      "character": "Colby's Cheerleader"
    },
    {
      "id": "nm7838589",
      "name": "Chelsey Knutson",
      "character": "Colby's Cheerleader"
    },
    {
      "id": "nm9804387",
      "name": "Jade Woods",
      "character": "Colby's Cheerleader"
    },
    {
      "id": "nm4477889",
      "name": "Drew Dammron",
      "character": "Bo"
    },
    {
      "id": "nm7837648",
      "name": "Frankie Anthony Velasquez",
      "character": "High School Student"
    }
  ],
  "overview": "At Big Jim’s Auto Depot there’s only one rule. The last man – or woman – standing wins. Eight teens enter, one teen leaves. Actually, all eight teens leave, but only one leaves with the ride of their dreams. To reach that dream, they’re going through a nightmare. Keep your hand on the car. That sounds simple enough, but two days of sleep deprivation and fierce competition can make things awfully hard.",
  "storyline": "They can barely stand each other, but can they stand next to each other for three days, without sleep, for the chance to win the car of their dreams?",
  "plot": "A young girl, Bird (Ella Ballentine) with her aunt's boyfriend waiting at the car, visits the grave of her parents on the anniversary of their deaths, witnesses and photographs a hitman, Sade (Laurence Fishburne), killing people attending a funeral. When her aunt's boyfriend, Roger, comes looking for her, Sade kills him and tries to kill her too, but she flees into the woods. Bird comes across the house of a war veteran, Carter (Thomas Jane), who vows to protect her. Arriving at the house, Sade shoots at Carter, who grabs a shotgun and shoots back. They exchange words and gunfire, and both are wounded. During a break in the gunfire, Sade tries to talk Carter into sending Bird down so he can kill her. Carter refuses, and they both pause to patch up their wounds and prepare for the next round. Carter sends the girl for some light bulbs, which he breaks and throws down the stairs, alerting Sade to the fact that he \"ain't no farmer.\" Carter finds out from the girl what happened in the cemetery and that she has a picture of Sade's face. Sade, in the downstairs of the house, starts going through Carter's possessions and finds a picture of Carter in military uniform with his wife and son. He tries to convince Carter he is also ex-military and he understands why Carter is protecting Bird. Carter lets him know he is aware that Bird has a picture of him and that is why he is after her.\n\nMeanwhile, a sheriff's deputy happens upon the abandoned cars at the cemetery. In the house, a resting Carter is dreaming about a tragedy that happened to his son. He wakes up and sends Bird to get a bottle of alcohol. She returns with the drink and his son's teddy bear, which he angrily tells her to put back. Sade finds and starts to read a letter Carter had written his wife, taking blame for the death of their son. In the letter, he states he knew she blamed him for the death and didn't blame her for leaving him. Sade realizes that Carter had packed up and written the letter as he was contemplating suicide. He snidely encourages him to go ahead.\n\nBird tells Carter that her dad told her she had \"no quit in her\" and wonders if she will see her dad when she dies. She asks Carter why his wife left him and he said the house reminded her of their son. They hug and Sade shoots a round, gaining the attention of the deputy (Jim Watson) who was looking around for the cars' owners. The light in the house starts to fade and Carter now needs to get Bird out as he only has one shot remaining and in the dark he can't protect her.\n\nThe deputy goes back to his car to report the shot fired and ask if a shooting range had opened. He drives up to the house, where Sade sees him arrive while Carter is trying to get Bird out through a window on the second level. Knocking at the door, the deputy is shot by Sade and Bird goes back into the house. Sade hides the deputy's car and starts to head back to the house where Carter confronts him and tells him to leave. Sade tries to goad him to shoot, guessing he only has the one shot and would likely miss given the shotgun's range. Carter backs off and Sade grabs the deputy as bait. He tries to bargain with Carter for the deputy's life as well as his own for Bird. When Carter refuses, Sade starts to torture the deputy. He eventually shoots him and rolls him out where Carter can see him.\n\nAfter a period of silence, Carter tells Bird to hide and starts down the stairs. Sade in the meanwhile makes his way barefoot across the roof. He ends up at the top of the stairs, where he is surprised by Carter, and falls down the glass-strewn stairs. Fed-up, Sade plans to set the house on fire, but changes his mind and calls Carter's wife on Carter's cell phone which he had found earlier. Resting again, the men engage in another argument.\n\nNight descends and Carter's wife Mara arrives. Sade bargains again for Bird implying he'll rape Mara if Carter doesn't comply. Fearing he will trade for his wife, Bird pleads with Carter not to. Instead he gives her the gun instructing her to shoot down the stairs if Sade heads up. He heads down the stairs, telling Sade \"if he wants her, go get her.\" Sade goes on a rant before shooting Carter in the leg. When Sade yells to Bird that he will kill Carter, she quickly heads down the stairs in order go save him. Before Sade has the chance to kill any of them, the lights in the house flicker, giving Carter the chance to rush the assassin, stabbing Sade multiple times, though is shot in the ensuring struggle. While Carter incapacitates Sade, Mara runs outside to call 911. Bird, however, stays behind, determined to kill her tormentor herself. Finding Sade against the wall, severally bleeding, he tells her to shoot him after she aims the gun at Sade and pulls the trigger, but the gun only clicks; with Sade realizing the round was a dud the whole time. Sade aims his gun at Bird, who looks on at the man, unafraid, telling him herself to pull the trigger, though he only responds with the fact that he is not a monster before dying without shooting. With it finally over, Bird heads over to Carter who is still alive. He simply tells her \"there is no quit in me.\" as the three of them wait for the police to arrive.",
  "synopsis": null
}