{
  "imdb_id": "tt4511452",
  "tmdb_id": "338440",
  "douban_id": null,
  "title": "The Little Man (2015)",
  "genres": [
    "Comedy",
    "Family",
    "Fantasy"
  ],
  "country": "Czech Republic",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.4,
  "director": [
    {
      "id": "nm7178585",
      "name": "Radek Beran"
    }
  ],
  "writer": [
    {
      "id": "nm7178588",
      "name": "Jirí Stach",
      "description": "book"
    },
    {
      "id": "nm0875718",
      "name": "Lumír Tucek",
      "description": "screenplay"
    },
    {
      "id": "nm7178587",
      "name": "Lenka Uhlírová",
      "description": "book"
    }
  ],
  "cast": [
    {
      "id": "nm0125748",
      "name": "Zuzana Bydzovská",
      "character": "Rybabice       (voice)"
    },
    {
      "id": "nm0404942",
      "name": "Vanda Hybnerová",
      "character": "Velká tísen       (voice)"
    },
    {
      "id": "nm0419522",
      "name": "Vladimír Javorský",
      "character": "Drobný mistr       (voice)"
    },
    {
      "id": "nm1716909",
      "name": "Miroslav Krobot",
      "character": "(voice)"
    },
    {
      "id": "nm0514090",
      "name": "Pavel Liska",
      "character": "Drzý zmetek       (voice)"
    },
    {
      "id": "nm0577153",
      "name": "Miloslav Mejzlík",
      "character": "(voice)"
    },
    {
      "id": "nm1325378",
      "name": "Klára Oltová",
      "character": "Larva Fída       (voice) (as Klára Sedlácková)"
    },
    {
      "id": "nm0650326",
      "name": "Jirí Ornest",
      "character": "Datel       (voice)"
    },
    {
      "id": "nm7178586",
      "name": "Tomás Procházka",
      "character": "Kapitán Beefheart       (voice)"
    },
    {
      "id": "nm0711191",
      "name": "Sasa Rasilov",
      "character": "Malý pán       (voice)"
    },
    {
      "id": "nm0875718",
      "name": "Lumír Tucek",
      "character": "Bádavci       (voice)"
    },
    {
      "id": "nm0879345",
      "name": "Miroslav Táborský",
      "character": "Promodral       (voice)"
    },
    {
      "id": "nm0897510",
      "name": "Tatiana Vilhelmová",
      "character": "Murí noha       (voice)"
    },
    {
      "id": "nm1169515",
      "name": "Jan Vondrácek",
      "character": "Knihovník       (voice)"
    },
    {
      "id": "nm0953840",
      "name": "Valérie Zawadská",
      "character": "Prázdná hlava       (voice)"
    }
  ],
  "overview": "The Little Man lives happily in his little house in the Hollow Mountain. His peaceful life ends once he begins to have dreams about a mysterious house where he is to find what he desires. Even though he does not feel like having any desires, he crack the mystery himself. (A-Company CZ)",
  "storyline": "There was house in a cave under little hill and that was a place where Little Man lived. He was quite well there until one night - when he had a mysterious dream. He dreamed about a house with provoking sign above its door: \"YOU WILL FIND HERE WHAT YOU MISS\". Little Man was confused. What was he missing? And what shall he find then? And where exactly? He could not get rid of a weird feeling since he woke up that one morning. He suddenly knew he is missing something really important in his life and he had to go out for it and find it. But his journey was not easy at all. He had to complete many difficult quests, overcome his fears and above all, keep moving forward no matter what was happening to him! During his journey he showed his good heart when he helped someone who needed it, he also proved considerable bravery when he faced dangerous creatures he had never seen before. He learned lots of things not just about the forest, but chiefly about himself. And did he finally reached the ...",
  "plot": "An ambitious Mother undertakes to prepare her daughter academically for enrollment in the prestigious Werth Academy, imposing a life plan that leaves little time for leisure. The Little Girl, however, becomes distracted by an elderly retired Aviator who tells her the story of the \"Little Prince\", whom he says he encountered in the Sahara desert after crash-landing there. The Aviator recounts how the Little Prince had asked him to draw a picture of a sheep. Lacking skill, the Aviator had eventually simply drawn a box instead, and explained that there was a sheep inside the box and this had satisfied the Little Prince.\n\nThe Little Girl and the Aviator continue to read and play together without the Mother's knowledge. The Aviator tells the Girl about the Little Prince's home, \"Asteroid B612\", which was covered in baobab sprouts, and he recounts how it came to pass that the Little Prince travelled to Earth. After spending some time clearing away baobab sprouts, the Little Prince had noticed a different plant; and had nurtured it until it grew into a Rose. The Rose had become his friend, but had been rather selfish, so after a while, the Little Prince had left his planet with a flock of birds. He eventually landed on Earth, where he found and tamed a red Fox. After a while, the Fox bid goodbye to the Little Prince, advising him to always see with his heart. When the Aviator finishes telling the Little Girl this story, he gives her a stuffed Fox as a gift, and tells her that he has decided to leave soon and go find the Little Prince.\n\nThe two of them decide to go out for free \"birthday\" pancakes first but it turns out that the Aviator is driving without a license. He is pulled over by a police officer, who brings the Girl home, whereupon her Mother realizes that she hasn't been doing her assigned lessons. Distressed, the Mother redoubles her daughter's assignments to make up for lost time. But the Girl continues to read the story of the Little Prince, and when she has read all the pages, she secretly visits the Aviator to find out what had happened to the Little Prince at the end and to go find him with the Aviator.\n\nThe Aviator tells her that in the end the Little Prince had submitted to a venomous snake bite in order to be reunited with his old friendly and beloved Rose. Although the Aviator assures the Girl that he firmly believes the Little Prince succeeded, she is upset by this dark twist to the story that she wishes she'd never met the Aviator and never heard the story again.\n\nTowards the summer's end, the Aviator is hospitalized. The Girl, wanting to put things right, sets off in search of the Little Prince. While using the gutter to escape from her room without her Mother knowing, the Girl falls into the Aviator's yard and blacks out. After she awakens, the Girl sets off on her journey accompanied by her little plush Fox who has now obtained consciousness and with all of the Little Prince's story pages. They fly the Aviator's plane into space, hoping to find the Little Prince somewhere. They discover that the stars have mysteriously disappeared and land on an asteroid populated only by workaholic adults owned by the star-holding \"Businessman\" character from the Little Prince's story. After encountering a police officer (the \"Conceited Man\") and an elevator operator (the \"King\"), they finally find the Little Prince.\n\nBut all is not well. He is now an adult named \"Mr. Prince\", and is working as a janitor for the Businessman. He has forgotten his past and who he was, and seems motivated only by a fear of disappointing the Businessman. Mr. Prince accordingly takes the Little Girl to an \"Academy\" where she is to be \"reconditioned\" as an adult under the tutelage of a slim, tall, sinister Academy Teacher. But luckily Mr. Prince suddenly recovers his memory and is able to rescue the Girl from this fate. They escape together, accompanied by the Fox. Then confront the Businessman, and triumphantly liberate of all of the stars into space where they belong. The Girl then takes Mr. Prince back to his home asteroid, B612, which has become overgrown with baobabs. They find the Rose dead. But then they see her image in the sunrise. This sight transforms Mr. Prince back to his younger self, and makes the baobabs disappear, giving the now-again Little Prince renewed hope.\n\nThe Girl and the Fox return home, accompanied by another flock of birds. The next morning, the Girl and her Mother visit the Aviator in the hospital. The Girl presents him with a book that contains the now-completed story of the Little Prince—the formerly loose pages are bound together and the formerly missing parts of the story have been filled in. The Girl has begun her studies at Werth Academy and reconciled with her Mother, and the Little Prince and the Aviator are heard laughing joyfully together on Asteroid B612, while the Girl and her Mother happily stargaze in one night.",
  "synopsis": null
}