{
  "imdb_id": "tt4530884",
  "tmdb_id": "357096",
  "douban_id": null,
  "title": "I Spit on Your Grave: Vengeance is Mine (2015)",
  "genres": [
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "92 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.2,
  "director": [
    {
      "id": "nm5189759",
      "name": "R.D. Braunstein"
    }
  ],
  "writer": [
    {
      "id": "nm0318319",
      "name": "Daniel Gilboy",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm1713632",
      "name": "Sarah Butler",
      "character": "Jennifer Hills /              Angela"
    },
    {
      "id": "nm0484916",
      "name": "Jennifer Landon",
      "character": "Marla"
    },
    {
      "id": "nm0571630",
      "name": "Doug McKeon",
      "character": "Oscar"
    },
    {
      "id": "nm0389527",
      "name": "Gabriel Hogan",
      "character": "Detective McDylan"
    },
    {
      "id": "nm0468772",
      "name": "Harley Jane Kozak",
      "character": "Therapist"
    },
    {
      "id": "nm0403335",
      "name": "Michelle Hurd",
      "character": "Detective Boyle"
    },
    {
      "id": "nm4459159",
      "name": "Russell Charles Pitts",
      "character": "Matthew       (as Russell Pitts)"
    },
    {
      "id": "nm1391090",
      "name": "Walter Perez",
      "character": "Chief"
    },
    {
      "id": "nm1022263",
      "name": "Karen Strassman",
      "character": "Lynne"
    },
    {
      "id": "nm0388847",
      "name": "Christopher Hoffman",
      "character": "Ron Merrick"
    },
    {
      "id": "nm2684603",
      "name": "Megan Raich",
      "character": "Cassie"
    },
    {
      "id": "nm4564387",
      "name": "Andrew Dits",
      "character": "Nicholas Woods"
    },
    {
      "id": "nm1944579",
      "name": "Adam Dunnells",
      "character": "Cole Watson"
    },
    {
      "id": "nm2153857",
      "name": "Lony'e Perrine",
      "character": "Victim"
    },
    {
      "id": "nm4486268",
      "name": "Alissa Juvan",
      "character": "Mallory"
    },
    {
      "id": "nm0715327",
      "name": "Bobby Reed",
      "character": "Drunk Man"
    },
    {
      "id": "nm3483440",
      "name": "Heath McGough",
      "character": "Homeless Man"
    },
    {
      "id": "nm2964992",
      "name": "Corey Craig",
      "character": "Hardware Store Employee"
    },
    {
      "id": "nm0466604",
      "name": "Alla Korot",
      "character": "Cassie's Mom"
    },
    {
      "id": "nm4028215",
      "name": "Joshua Kovalscik",
      "character": "Det. Homer"
    }
  ],
  "overview": "Jennifer Hills is still tormented by the brutal sexual assault she endured years ago. She’s changed identities and cities, reluctantly joining a support group where she begins to piece together a new life. But when her new friend’s murderer goes free and the tales of serial rapists haunt her, Jennifer will hunt down the men responsible and do what the system won’t – make them pay for their crimes in the most horrific ways imaginable. Only this time, no jury may be able to save her.",
  "storyline": "Jennifer Hills is still tormented by the brutal sexual assault she endured years ago. She's changed identities and cities, reluctantly joining a support group where she begins to piece together a new life. But when her new friend's murderer goes free and the tales of serial rapists haunt her, Jennifer will hunt down the men responsible and do what the system won't - make them pay for their crimes in the most horrific ways imaginable. Only this time, no jury may be able to save her.",
  "plot": "The film follows the life of Jennifer Hills (Butler), continuing the story from the first film I Spit on Your Grave. After Jennifer survived her assault and exacted revenge on the men who raped her, she settled in Los Angeles, but traumatized and mentally unbalanced from the whole ordeal. She's no longer an aspiring writer and now devotes herself between working as an assault hotline operator, going to group counseling, and getting personal therapy for her ordeal under the assumed name, Angela Jitrenka. Because of her mental/emotional scars, she has become highly aggressive and defensive around her environment; furthermore, she doesn't trust men and presumes all men simply want to have her, including the good ones.\n\nWhile in group counseling, Angela begins developing a bond with one of the girls in the group, Marla, who also doesn't trust men. The duo began their own personal crusade, by exacting poetic justice for victims of sexual assault. However, just as Angela begins to enjoy life, Marla dies under mysterious circumstances and no one guilty of her death. She becomes acquainted with Detective McDylan, an investigator to Marla's death. However, he wasn't able to bring justice for Marla nor closure for Angela. Distraught and enraged at how the law couldn't help Marla nor the rape victims in her support group, she decides to get revenge for them.\n\nOne-by-one, Angela stalks and lures the unpunished rapists to a private place to torture and kill them. However, her actions began to draw attention from the cops as they suspect she's behind all recent murders. By chance, Oscar (a support member who lost his daughter to suicide after a sexual assault) sacrificed himself by publicly admitting the murders to the police after slashing his own arms; he saved Angela at the cost of his life. Although Oscar's sacrifice helped Angela get out of jail, she was still being followed as a person of interest. Despite the police keeping an eye on her, she manages to evade detection, but becomes further disillusioned with society and enraged that there's no justice for wrongdoers. She realized that justice can only be exacted upon one's self.\n\nShortly after Oscar's death, Angela evaded the police and dressed herself in a suggestive red dress in attempt to bait a sexual predator, not realizing Detective McDylan was trailing her the whole time. While on her way home, she caught the attention of a local thug that has been propositioning her. Armed with a knife, she failed to lure him close enough to kill him and got into a struggle. McDylan arrived in attempt to neutralize the situation, but Angela refuses to yield and was forced to shoot and arrest her.\n\nIn the next scene, Angela is seen in her therapist room in orange jail clothes. She was arrested for attempted murder and was sentenced to two years and was now getting out later that week. Angela's therapist reassured her she cared for Angela and Angela thanked her and telling her \"she knows.\" Angela leaves the room, and switches the \"Therapist\" sign on the door to read, \"The rapist.\"\n\nAngela is suddenly attacked by two inmates. Angela quickly and violently fights back, killing both women (one with the very shiv she'd used to attack her with). Her therapist rushes out of her office and Angela pushes her back and brutally stabs her to death. Angela turns around and it is revealed that the whole altercation was in her head. Revealing that Angela's fantasies of killing are not over. She walks down the hallway smiling.",
  "synopsis": null
}