{
  "imdb_id": "tt4558194",
  "tmdb_id": "365754",
  "douban_id": null,
  "title": "Christmas Trade (Video 2015)",
  "genres": [
    "Comedy",
    "Family"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "99 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.1,
  "director": [
    {
      "id": "nm3522996",
      "name": "Joel Souza"
    }
  ],
  "writer": [
    {
      "id": "nm3522996",
      "name": "Joel Souza",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0000287",
      "name": "William Baldwin",
      "character": "Mitch Taylor"
    },
    {
      "id": "nm0000612",
      "name": "Denise Richards",
      "character": "Chloe"
    },
    {
      "id": "nm5837781",
      "name": "Michael Campion",
      "character": "Robbie Taylor"
    },
    {
      "id": "nm0000792",
      "name": "Tom Arnold",
      "character": "Gus"
    },
    {
      "id": "nm0335462",
      "name": "Jennifer Grant",
      "character": "Trish"
    },
    {
      "id": "nm2257054",
      "name": "Desiree Abeyta",
      "character": "Trudy"
    },
    {
      "id": "nm0824323",
      "name": "Anne Stedman",
      "character": "Harper Shaw"
    },
    {
      "id": "nm0115092",
      "name": "Victor Browne",
      "character": "Milton Green       (as Victor Brown)"
    },
    {
      "id": "nm3340800",
      "name": "Amanda Conlon",
      "character": "Mrs. Brewer"
    },
    {
      "id": "nm5059655",
      "name": "Camryn Sutton",
      "character": "Amelia"
    },
    {
      "id": "nm0400229",
      "name": "Shawn Huff",
      "character": "Dianne"
    },
    {
      "id": "nm1869784",
      "name": "Doug Bilitch",
      "character": "Kettering"
    },
    {
      "id": "nm4303194",
      "name": "Montana Marks",
      "character": "Bailey"
    },
    {
      "id": "nm0400194",
      "name": "Brent Huff",
      "character": "Billings"
    },
    {
      "id": "nm3260636",
      "name": "Francesca Manzi",
      "character": "Davis"
    },
    {
      "id": "nm3145199",
      "name": "Morissa O'Mara",
      "character": "Jewelry Clerk"
    },
    {
      "id": "nm4241862",
      "name": "Carly Peeters",
      "character": "Olivia"
    },
    {
      "id": "nm5359214",
      "name": "Brice Fisher",
      "character": "Francis"
    },
    {
      "id": "nm5843801",
      "name": "Parker Brightman",
      "character": "Max"
    },
    {
      "id": "nm0222570",
      "name": "Bettina Devin",
      "character": "Christmas Shopper"
    },
    {
      "id": "nm5911767",
      "name": "Veronica Lavery",
      "character": "Harper's Assistant 1"
    },
    {
      "id": "nm3016499",
      "name": "Jennifer Field",
      "character": "Harper's Assistant 2"
    },
    {
      "id": "nm2896480",
      "name": "Matthew Glen Johnson",
      "character": "Office Runner       (as Matthew Johnson)"
    },
    {
      "id": "nm7586609",
      "name": "Beatrix Barish",
      "character": "Hanna"
    },
    {
      "id": "nm7756367",
      "name": "Rory Berns Souza",
      "character": "Boy in Bouncy Castle"
    },
    {
      "id": "nm7801647",
      "name": "Rain Villanueva",
      "character": "Naomi"
    },
    {
      "id": "nm5733771",
      "name": "Duke Stone",
      "character": "Jerry"
    },
    {
      "id": "nm7756369",
      "name": "Lindsay LaBrecque",
      "character": "Harper's Nanny"
    },
    {
      "id": "nm7756368",
      "name": "Josh Gefken",
      "character": "Boy Painting Scenery"
    },
    {
      "id": "nm5861385",
      "name": "Nathan Egami",
      "character": "Little Boy"
    },
    {
      "id": "nm7801648",
      "name": "Bruce Davis",
      "character": "Security Gaurd"
    },
    {
      "id": "nm7801649",
      "name": "Maddox Grey Estrada",
      "character": "Harper's Baby"
    },
    {
      "id": "nm6681092",
      "name": "Pamela Drake Wilson",
      "character": "Background       (as Paula Drake Wilson)"
    },
    {
      "id": "nm1225848",
      "name": "Michael R. Barnard",
      "character": "Background"
    },
    {
      "id": "nm4425615",
      "name": "Janie Boisclair",
      "character": "School Teacher"
    },
    {
      "id": "nm7078465",
      "name": "Dirk Brown",
      "character": "TV Pitchman"
    },
    {
      "id": "nm5692772",
      "name": "Leonel Claude",
      "character": "Background"
    },
    {
      "id": "nm10644247",
      "name": "Jeffrey Kyle Lewis",
      "character": "Background"
    },
    {
      "id": "nm6738604",
      "name": "Gary Palmer",
      "character": "Party goer"
    },
    {
      "id": "nm7360564",
      "name": "Benji Risley",
      "character": "Student"
    },
    {
      "id": "nm3979831",
      "name": "Destiny Soria",
      "character": "Background"
    }
  ],
  "overview": "A career-oriented single father and his 11-year-old son are forced to see their worlds through each other's eyes when some Christmas magic switches their bodies. The pair find themselves growing closer as they scramble to figure out the secret of the magic that caused their predicament in time for Christmas.",
  "storyline": "Just days before Christmas, an LA real-estate lawyer and his eleven-year-old son magically swap bodies. As they walk in each other's shoes, from a cutthroat law firm and the frightening days of sixth grade, the father and son rediscover what it means to be family.LOS ANGELES, night. Inside the TAYLOR residence, ROBBY (11) sits behind a dimly lit laptop screen, scrolling through Christmas toys on a shopping website. As he climbs into bed, a loud THUMP is heard. He goes to his front door and looks around, but sees nothing. As he returns inside, a mysterious package is seen on the porch. The package is labeled, \"SANTA'S MYSTERY EMPORIUM.\" The next morning, life in the Taylor family is complete chaos. MITCH (40s) has his cell-phone glued to his ear and pays little attention to Robby. Since Robby's mother died a few years back, it's just the two of them. It's clear that they haven't exactly established a relationship or a daily routine. Robby bugs his father about getting a Christmas tree ...",
  "plot": "Three years after her husband died, Emily Spengler (Faith Ford), a 2nd grade teacher in the small Washington town of South Woodbourne is preparing for the arrival of her daughter, Heather (Emma Lahana), who is attending school at Boston College. When she comes to find out that her daughter wishes to do other things for Christmas, she calls her friend, Faith Kerrigan (Gabrielle Miller), for advice. Faith is a divorced event planner based in San Francisco. Meanwhile, in Boston, Charles Johnson (Tom Cavanagh), an English professor and writer is working on the finishing draft for his latest novel. He is struggling to finish his book after missing several deadlines, and so his brother, Ray Johnson (Gil Bellows), who is the owner of a software security company, suggests he get away and find some place to concentrate on his writing. Meanwhile, in Washington, Emily decides to surprise her daughter in Boston, although she is unaware that her daughter has already made plans to go with her boyfriend, Jason (Andrew Francis), to Phoenix, Arizona and stay at the home of his grandparents.\n\nEmily and Charles find each other on a house swapping website, and thus, trade houses for the week. Charles arrives in Washington to discover Emily's home, full of Christmas decor, despite his bad memories with a previous Christmas. Emily arrives at Charles' apartment in Boston, and discovers her daughter had gone to Phoenix after talking to her on the phone. Meanwhile, Emily's friend Faith takes a plane and bus to surprise her friend in Washington, only to discover that Charles is there. Because the bus back to Seattle does not leave until Christmas, she stays at Emily's house, much to Charles' dismay. Meanwhile, in Boston, Emily triggers the apartment alarm and Ray arrives with a police officer, and discovers that his brother took his advice, but did not tell him. He meets Emily, and offers to show her around and take her to dinner.\n\nOver the course of the week Emily and Ray spend a lot of time together, revealing their past Christmas memories. In Washington, Charles struggles to finish his book, until Faith reads the draft to his manuscript, and makes suggestions. Charles, at first, is reluctant to take her advice, but eventually does, and is able to break his writer's block to finish his novel. Meanwhile, in Arizona, Jason notices how homesick Heather is, and so he buys plane tickets to Boston so she can spend Christmas with her mother. After Heather arrives in Boston, Ray gives Emily a pair of earrings as a Christmas present, and since Emily is leaving in a couple of days, decides it would be best to not make things more difficult.\n\nOn Christmas Day, Charles drives Faith to the bus station, only to stop the bus because he doesn't want her to spend Christmas on the bus. She is delighted, and they kiss as the bus leaves without her. In Boston, Emily, Heather, and Jason arrive at Ray's apartment with a Christmas tree, and the four of them spend Christmas together. Emily learns that Raymond finally made a decision and sold his company, as he awaits the next chapter in his life.\n\nOne year passes, and it is revealed that Ray and Emily are married, living in Washington. They are visited for Christmas by Faith and Charles, who are now married and expecting a child. The film ends with the characters celebrating Christmas.",
  "synopsis": null
}