{
  "imdb_id": "tt4557014",
  "tmdb_id": "332830",
  "douban_id": null,
  "title": "Oru Vadakkan Selfie (2015)",
  "genres": [
    "Comedy",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "141 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.7,
  "director": [
    {
      "id": "nm7222219",
      "name": "G. Prajith"
    }
  ],
  "writer": [
    {
      "id": "nm2068971",
      "name": "Vineeth Sreenivasan",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4028885",
      "name": "Nivin Pauly",
      "character": "Umesh Manohar"
    },
    {
      "id": "nm4028151",
      "name": "Aju Varghese",
      "character": "Shaji"
    },
    {
      "id": "nm2068971",
      "name": "Vineeth Sreenivasan",
      "character": "Jack Tracker /              Nivin"
    },
    {
      "id": "nm7222220",
      "name": "Manjima Mohan",
      "character": "Daisy George"
    },
    {
      "id": "nm6697626",
      "name": "Neeraj Madhav",
      "character": "Thankamma (Thankaprasad)"
    },
    {
      "id": "nm1066795",
      "name": "Vijayaraghavan",
      "character": "Manohar"
    },
    {
      "id": "nm4027847",
      "name": "Bhagath Baby Manuel",
      "character": "Shailesh"
    },
    {
      "id": "nm10922175",
      "name": "Shyam Hariharakrishnan",
      "character": "Max Infotech Employee"
    },
    {
      "id": "nm4027746",
      "name": "Harikrishnan",
      "character": "Surya Narayan"
    },
    {
      "id": "nm6660756",
      "name": "Santhosh Keezhattoor",
      "character": "Mohan"
    },
    {
      "id": "nm6845864",
      "name": "Pradeep Kottayam",
      "character": "Shaji's Father"
    },
    {
      "id": "nm0474910",
      "name": "Vineeth Kumar",
      "character": "Himself"
    },
    {
      "id": "nm6444863",
      "name": "Gourav Menon",
      "character": ""
    },
    {
      "id": "nm4395136",
      "name": "Ganesh Raj",
      "character": "Classmate"
    },
    {
      "id": "nm0788713",
      "name": "Sharath",
      "character": ""
    },
    {
      "id": "nm7222222",
      "name": "Shravan",
      "character": ""
    },
    {
      "id": "nm5654277",
      "name": "Bobby Simha",
      "character": "John Mathew Baskar"
    },
    {
      "id": "nm7808011",
      "name": "Revathy Sivakumar",
      "character": "Umesh's sister"
    },
    {
      "id": "nm7222221",
      "name": "Sreelakshmi",
      "character": "Umesh's Mother"
    },
    {
      "id": "nm1477648",
      "name": "P. Sukumar",
      "character": "George (Daisy's Father)"
    },
    {
      "id": "nm6213877",
      "name": "Parvathi T.",
      "character": "Daisy's Mother"
    },
    {
      "id": "nm5654687",
      "name": "Ramesh Thilak",
      "character": "Aspiring Actor"
    }
  ],
  "overview": "Directing by Prajith Karanavar, starring Aju Varghese, Manjima Mohan, Nivin Pauly and Vineeth Sreenivasan in the lead roles.",
  "storyline": "When his father asks him to manage their grocery store, Umesh leaves for Chennai to become a filmmaker. His life changes, after he takes a selfie with his neighbor and posts it online.",
  "plot": "Umesh (Nivin Pauly) is a 21 year old carefree engineering student, who has 42 back papers to clear. His close pals are Shaji (Aju Varghese) and Thankaprasad (Neeraj Madhav). Wanting to find a quick way to earn money and fame, he decides to try his hand at movies, and wants to assist none other than the renowned South-Indian director Gautham Vasudev Menon. His friend Shaji suggests that he make a short film and upload it on the internet. But the result is utter failure, after losing the camera in an accident. Umesh's father (Vijayaraghavan) orders him to help him to run his small shop. To avoid such a bleak future, Umesh catches the next train to Chennai. On the train, he sees Daisy (Manjima Mohan), his neighbour back home. Umesh tries to woo Daisy throughout the journey, but miserably fails. He lies to his friends that they are having an affair, tricks her into posing for a selfie with him, and sends it to Shaji.\n\nAfter spending 6 days in Chennai, realising that he is not cut out for the struggle to enter the film industry, he returns to his town in Thalassery where he finds a slew of people waiting for his return. He learns that his hometown is hot with news of his elopement with Daisy! The selfie clicked by him had created a big problem among his family and neighbours.He finds out that Shaji had been the one who told them. He returns to Chennai immediately with Shaji to find her and prove his innocence, where they meet a Private Detective Jack Tracker (Vineeth Sreenivasan).\n\nWith the help of Jack, Umesh finds Daisy and later it is revealed that she is in love with a man called Hari Narayanan (Unni Mukundan) and wants to marry him. She also tells them that she had known him and communicated through Facebook and e-mails and had never met him. Later, Umesh, Daisy, Shaji and Jack set out to find Hari Narayanan and travels to his hometown Pazhani. The gang later manages to go to Hari's house with the help of a farmer. It is revealed that Hari had committed suicide one year before as his friend and business partner, John Mathew Bhaskar had cheated him in their business venture. John then used Hari's online accounts to cheat others.\n\nJack then reveals that he is an officer from Tamil Nadu CBCID economic investigation wing and he did all this to find the brain behind the online money fraud. He also says that the true intention of the guy in the internet is to cheat young women and steal their money. After the set of confusions being cleared Umesh, Daisy and Shaji go back to Kerala. A few months later Umesh meets Nivin at a resort where he says Umesh that the cybercell group had found the real culprit, John Mathew Bhaskar (Bobby Simha). Nivin then lets Umesh to vent out his anger on John for cheating innocent girls like Daisy. Umesh is then shown walking to a nearby table and asking whether the man sitting there is John Bhaskar. The movie ends with the man answering yes and Umesh hitting him over the head with a bottle.",
  "synopsis": null
}