{
  "imdb_id": "tt4675030",
  "tmdb_id": "403862",
  "douban_id": null,
  "title": "Great Grand Masti (2016)",
  "genres": [
    "Comedy",
    "Drama",
    "Fantasy",
    "Horror"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "134 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.7,
  "director": [
    {
      "id": "nm0409791",
      "name": "Indra Kumar"
    }
  ],
  "writer": [
    {
      "id": "nm1571874",
      "name": "Tushar Hiranandani",
      "description": "story"
    },
    {
      "id": "nm8229570",
      "name": "Akash Kaushik",
      "description": "screenplay"
    },
    {
      "id": "nm8257911",
      "name": "Madhur Sharma",
      "description": "dialogue"
    },
    {
      "id": "nm8257911",
      "name": "Madhur Sharma",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm5856898",
      "name": "Urvashi Rautela",
      "character": "Ragini"
    },
    {
      "id": "nm1299011",
      "name": "Riteish Deshmukh",
      "character": "Amar Saxena"
    },
    {
      "id": "nm1059103",
      "name": "Vivek Oberoi",
      "character": "Meet Mehta"
    },
    {
      "id": "nm0012778",
      "name": "Aftab Shivdasani",
      "character": "Prem Chawla"
    },
    {
      "id": "nm3684316",
      "name": "Puja Bose",
      "character": "Sapna Saxena"
    },
    {
      "id": "nm5786946",
      "name": "Mishti",
      "character": "Rekha (Meet's Wife)       (as Mishti Chakravarty)"
    },
    {
      "id": "nm3642275",
      "name": "Shradha Das",
      "character": "Nisha Chawla"
    },
    {
      "id": "nm0618936",
      "name": "Usha Nadkarni",
      "character": "Amar's Mother-in-law"
    },
    {
      "id": "nm7984492",
      "name": "Kangna Sharma",
      "character": "Prem's Sister-in-law"
    },
    {
      "id": "nm3643109",
      "name": "Ketan Karande",
      "character": "Meet's Brother-in-law       (as Ketan Mangesh Karande)"
    },
    {
      "id": "nm0592799",
      "name": "Sanjay Mishra",
      "character": "Antakshari Baba"
    },
    {
      "id": "nm8426321",
      "name": "Bhadra Parekh",
      "character": "A Boy Shepherd"
    },
    {
      "id": "nm6199207",
      "name": "Vijay Gupta",
      "character": "Father"
    },
    {
      "id": "nm2960779",
      "name": "Farzil Pardiwalla",
      "character": "Patient in Clinic"
    },
    {
      "id": "nm3194714",
      "name": "Pramod Bhangare",
      "character": "Baba's Disciple 1"
    },
    {
      "id": "nm3901975",
      "name": "Vidyadhar Karmakar",
      "character": "Dada in the Car"
    },
    {
      "id": "nm8426322",
      "name": "Ragini Vaidya",
      "character": "Dadi in Car"
    },
    {
      "id": "nm8426323",
      "name": "Chiranjeet Chabria",
      "character": "Husband in the Car"
    },
    {
      "id": "nm8426324",
      "name": "Shivani Thakur",
      "character": "Wife in the Car"
    },
    {
      "id": "nm2019649",
      "name": "Palash Dutta",
      "character": "House Buyer Couple (Male)"
    },
    {
      "id": "nm6432869",
      "name": "Sonali Raut",
      "character": "Shiney"
    },
    {
      "id": "nm8426325",
      "name": "Ghazal Sharma",
      "character": "House Buyer Couple (Female)       (as Gazla Sharma)"
    },
    {
      "id": "nm8426326",
      "name": "Rocky Ashok Banatkar",
      "character": "A Guy in Hotel"
    },
    {
      "id": "nm2520205",
      "name": "Ravi Ujjain",
      "character": "Broker"
    },
    {
      "id": "nm8426327",
      "name": "Karan Sharma",
      "character": "Client"
    },
    {
      "id": "nm8426328",
      "name": "Katy Printer",
      "character": "A Old Lady Doing Pottery in Dooohwadi"
    },
    {
      "id": "nm9166788",
      "name": "Archana Gautam",
      "character": "Gaav Ki Goori"
    }
  ],
  "overview": "Amar, Meet and Prem go into a small town where they encounter a 'femme fatale' in the form of Ragini. Ragini is everything they had dreamed of, but she slowly turns into their worst nightmare!",
  "storyline": "Amar, Meet and Prem go into a small town where they encounter a 'femme fatale' in the form of Ragini. Ragini is everything they had dreamed of, but she slowly turns into their worst nightmare!",
  "plot": "The film features three friends Amar, Meet and Prem who always want fun (Masti). The film begins with the title song where the three friends get married to Sapna, Rekha and Nisha. They are unhappy with their marriage life because of their Brother-in-law,Sister-in-law,and Mother-in-law. Amar's mother in law wants her late husband to be reborn and on the order of a fraud baba (fake spiritual leader) she has stopped her daughter from having any physical relations with Amar for over 6 months to achieve the rebirth of her late husband. Prem's sister in law is very attractive yet very silly, she comes to live with them and wants to sleep with her elder sister, forcing Prem to sleep on the couch away from his wife. Meet's wife is a twin and whenever he tries to go near his wife, it turns on his brother-in-law (who is a body builder). The connection between the two twins causes great problems like Meet's wife beating him up unintentionally when her brother is beating some goon up.\n\nOne day they meet in a bar and decide to enjoy their lives. They decide to go to Amar's village to sell off his family haveli(old mansion) and meanwhile have fun with the beautiful ladies in the village. When they reach the village, they find out that people are scared of the haveli. An old man tells them that there used to be a father daughter duo who lived in the haveli 50 years ago, the daughter, Ragini was very beautiful and many boys were smitten by her beauty but her father never let any guy near her, at the age of 20, Ragini died due to snake bite but her soul still resides in the haveli in search of a man who'll do masti with her. The guys laugh it off and proceed towards the haveli, there they meet a very attractive girl who's been living secretly in the haveli as she is alone and has no where to go. The boys hire her as their maid and each one starts trying to attract her. Soon it is revealed that she is indeed Ragini and she informs the boys that one of them must sleep with her in order to free her soul and whoever does so will die. The boys get scared and try escaping the mansion but to no avail. Prem commits to doing so in front of Ragini to buy them some time and meanwhile they hire Babu, a male prostitute to sleep with Ragini. But on the last moment their wives show up and Ragini turns Babu into a chicken. Ragini makes the boys do weird stuff in front of their wives and in laws who join them at the haveli so they would leave. When the boys see that their wives are secretly fasting for them even when Ragini depicted them off as such perverts in front of them, they decide to confront Ragini. The meet Ragini and tell her they won't sleep with her and she can't harm them as their wives are fasting for their long lives. Ragini hurts them but they light fire around her and call her father's spirit to help them. Rather Babu's spirit comes (who was cooked by the three wives) and does Masti with Ragini hence satisfying her urge. Babu and Ragini leave the world together and the three couples live happily ever after.",
  "synopsis": null
}