{
  "imdb_id": "tt4643844",
  "tmdb_id": "335051",
  "douban_id": null,
  "title": "God Willing (2015)",
  "genres": [
    "Comedy"
  ],
  "country": "Italy",
  "version": [
    {
      "runtime": "87 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm2640138",
      "name": "Edoardo Maria Falcone"
    }
  ],
  "writer": [
    {
      "id": "nm2640138",
      "name": "Edoardo Maria Falcone",
      "description": null
    },
    {
      "id": "nm0551431",
      "name": "Marco Martani",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0316074",
      "name": "Marco Giallini",
      "character": "Tommaso"
    },
    {
      "id": "nm0309348",
      "name": "Alessandro Gassmann",
      "character": "Don Pietro       (as Alessandro Gassman)"
    },
    {
      "id": "nm0603090",
      "name": "Laura Morante",
      "character": "Carla"
    },
    {
      "id": "nm1955816",
      "name": "Ilaria Spada",
      "character": "Bianca"
    },
    {
      "id": "nm3034455",
      "name": "Edoardo Pesce",
      "character": "Gianni"
    },
    {
      "id": "nm7290792",
      "name": "Enrico Oetiker",
      "character": "Andrea"
    },
    {
      "id": "nm0211336",
      "name": "Carlo Luca De Ruggieri",
      "character": "Pizzuti"
    },
    {
      "id": "nm3580531",
      "name": "Giuseppina Cervizzi",
      "character": "Rosa"
    },
    {
      "id": "nm3802316",
      "name": "Alex Cendron",
      "character": "Fratta"
    },
    {
      "id": "nm2069174",
      "name": "Fabrizio Giannini",
      "character": "Questore"
    },
    {
      "id": "nm1011789",
      "name": "Silvia Munguia",
      "character": "Xenia"
    },
    {
      "id": "nm0217029",
      "name": "Massimiliano Delgado",
      "character": "Cliente Pizzeria"
    },
    {
      "id": "nm7841698",
      "name": "Ramona Fiorini",
      "character": "Fidanza Pizzeria"
    },
    {
      "id": "nm2063290",
      "name": "Anna Foglietta",
      "character": "Cliente Pizzeria"
    },
    {
      "id": "nm3118221",
      "name": "Urbano Lione",
      "character": "Paziente"
    },
    {
      "id": "nm5063866",
      "name": "Maurizio Lops",
      "character": "Mimmo"
    },
    {
      "id": "nm6029866",
      "name": "Lorenzo Lucchi",
      "character": "Studente"
    },
    {
      "id": "nm7740046",
      "name": "Sebastian Gimelli Morosini",
      "character": ""
    },
    {
      "id": "nm5565166",
      "name": "Valeria Perri",
      "character": ""
    },
    {
      "id": "nm1205101",
      "name": "Carlo Ragone",
      "character": "Neurosurgeon"
    },
    {
      "id": "nm3542878",
      "name": "Tiziano Scrocca",
      "character": "Fidanzato Pizzeria"
    },
    {
      "id": "nm9541111",
      "name": "Roberta Federica Serrao",
      "character": "Moglie Paziente"
    },
    {
      "id": "nm10107735",
      "name": "Valentina Spalletta",
      "character": "Patrizia"
    },
    {
      "id": "nm1437922",
      "name": "Cristiana Vaccaro",
      "character": "Parente Paziente"
    }
  ],
  "overview": "The son of an atheist, authoritarian father, believed to be liberal, wants to become a priest.",
  "storyline": "A young man's decision to become a priest affects his whole family, especially his father.",
  "plot": "Tommaso is a successful, respected cardiac surgeon who also happens to be an atheist. However, Tommaso's son Andrea who is a medical student announces in a family get-together that he wants to become a priest. Tommaso is petrified with he hears the news as he expected his son was going to come out as homesexual. Tommaso who is irritated with Catholicism plan's with his son-in-law, Gianni to prevent Andrea's change.\n\nTommaso goes undercover while Andrea is absent, on retreat in a monastery, to investigate and bring down the charismatic Father Don Pietro, who he believes has \"brain-washed\" his son and caused upheaval in his family. Meanwhile his wife Carla, who feels unappreciated becomes an alcoholic and joins with a resistance movement reminiscing her active past and his daughter Bianca who lives in the opposite apartment gets interested and accepts Catholicism.\n\nFr. Pietro comes to know about Tommaso's plan and asks his help for one month as a handyman for renovating a church along with him to not reveal what Tommaso did against his son Andrea. Tommaso agrees and while working with Fr. Pietro, he starts to change his behaviors and become friendly with his co-workers and patients and a lot less uptight. Fr. Pietro takes him to a secluded serene hilltop with a view to a lake and explains everything that happens is god's will and plan. Tommaso's relationship with his wife gets better.\n\nTommaso's accidentally sees his son Andrea being intimate with a girl from their church group. Tommaso excuses himself, but his son comes and says the girl is his lover and intends to continue his medical studies. Tommaso asks about his priesthood decision and Andrea tells that after the retreat at the monastery he didn't feel he had what it required to really be a priest and tells Fr. Pietro knew about it. Tommaso feels fooled by the priest and equally funny.\n\nTommaso tries to reach Fr. Pietro through phone, but no response is there. The next morning Tommaso finds Fr. Pietro in a stretcher in his hospital. He finds out Fr. Pietro met with an accident the day before and his condition is serious. He discuss prognosis with his fellow doctor who was going to operate the priest and finds out the subdural hematoma is severe and would take a miracle to save him. Fr. Pietro goes out to the church he and Fr. Pietro was renovating and does the remaining minor works and goes out to the serene place where the priest has taken him and sits there for sometime and sees a pear fall down and remembers how funnily Fr. Pietro explained to him that everything happens is god's will.",
  "synopsis": null
}