{
  "imdb_id": "tt4693548",
  "tmdb_id": "315816",
  "douban_id": null,
  "title": "Das dunkle Gen (2015)",
  "genres": [
    "Documentary"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "99 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.4,
  "director": [
    {
      "id": "nm3233009",
      "name": "Miriam Jakobs"
    },
    {
      "id": "nm2266845",
      "name": "Gerhard Schick"
    }
  ],
  "writer": [
    {
      "id": "nm3233009",
      "name": "Miriam Jakobs",
      "description": "written by &"
    },
    {
      "id": "nm2266845",
      "name": "Gerhard Schick",
      "description": "written by"
    },
    {
      "id": "nm7388225",
      "name": "Frank Schauder",
      "description": "idea"
    }
  ],
  "cast": [
    {
      "id": "nm7388225",
      "name": "Frank Schauder",
      "character": "Himself"
    },
    {
      "id": "nm3060110",
      "name": "George Church",
      "character": "Himself"
    }
  ],
  "overview": "The film tells a very personal story from two perspectives: our protagonist is both doctor and patient. As a patient, he has struggled with recurring depression for years, and as a doctor he wants to find out why.  The search for the origins of his illness leads him into the realm of his own genes and casts light on the fundamental changes facing modern society as a result of the tremendous progress being made in the field of genetic sequencing. Along the way, he meets a host of people – researchers, artists, visionaries – who have developed their own very individual approach to genetic coding and are drawing attention to the social significance of genetic technology. The film does not restrict itself to a scientific view of the subject but also makes use of artistic visions and more playful approaches to genetic blueprints.",
  "storyline": "When a neurologist's career is derailed by a bout of severe depression he sets out to gain insights into the origin and treatment of the illness. Being a patient and doctor at the same time he will tell his story from two different perspectives, leading us far beyond the scope of his individual well being into the genetic universe and illuminating the immense changes lying ahead in the advance of DNA-sequencing at the same time. But the film does not stop at a purely scientific approach to the topic. Artistic and playful approaches to the genetic code, challenge the seemingly determining genetic fingerprint and help the protagonist to open up, despite pain, to a comforting perspective on the visually and acoustically fascinating world of cells, molecules and genes and the uniqueness of life.",
  "plot": null,
  "synopsis": null
}