{
  "imdb_id": "tt4610142",
  "tmdb_id": "403977",
  "douban_id": null,
  "title": "Böse Wetter (TV Movie 2016)",
  "genres": [
    "Adventure",
    "Drama"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "92 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm0340997",
      "name": "Johannes Grieser"
    }
  ],
  "writer": [
    {
      "id": "nm1752019",
      "name": "Michael Gebhart",
      "description": null
    },
    {
      "id": "nm1981355",
      "name": "Nicholas Hause",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0462706",
      "name": "Matthias Koeberlin",
      "character": "Leonard Gehra"
    },
    {
      "id": "nm0313443",
      "name": "Götz George",
      "character": "Ferdinand Türnitz"
    },
    {
      "id": "nm1002961",
      "name": "Catherine Bode",
      "character": ""
    },
    {
      "id": "nm0286194",
      "name": "Liane Forestieri",
      "character": ""
    },
    {
      "id": "nm2846375",
      "name": "Daniel Flieger",
      "character": "Heitmann"
    },
    {
      "id": "nm0359749",
      "name": "Michael Hanemann",
      "character": "Borowski"
    },
    {
      "id": "nm0484727",
      "name": "Gudrun Landgrebe",
      "character": ""
    },
    {
      "id": "nm0469679",
      "name": "Sven Kramer",
      "character": "Bartels"
    },
    {
      "id": "nm0718030",
      "name": "Rainer Reiners",
      "character": "Kudella"
    },
    {
      "id": "nm1418127",
      "name": "Alexandra von Schwerin",
      "character": "Susanne Türnitz"
    }
  ],
  "overview": null,
  "storyline": null,
  "plot": "In Cincinnati, four thieves commit an armed robbery stealing $3 million in cash from Hubert National Bank. The crew's leader executes manager Roy Hutchinson point-blank. FBI Special Agent Jonathon Montgomery heads the joint robbery-homicide investigation with Cincinnati PD. Forensics techs find a print matched to a dead Army Ranger named TJ Jackson. According to the official report, in 2011, TJ's unit went rogue, capturing Alexander Hubert to collect a ransom. The exchange went awry and Alexander and the Rangers were killed by a Special Forces team. TJ's body was never recovered. As the sole heir, Jeffrey Hubert, Alexander's brother, became president of Hubert International. By tracking the serial numbers, the FBI discovers the $3 million to have been donated by the thieves to a City Mission charity fund.\n\nIn a second heist at a different Hubert bank location, the thieves steal cash and the contents of personal safety deposit boxes belonging to Hubert and Ohio Senator Cook. David Dagley, a member of Hubert's security detail, is lured to the bank then stabbed to death in an ambush. The killer leaves a .45 bullet with TJ's fingerprint on it. Dagley was Commanding Officer of the Rangers who snatched Alexander Hubert, but didn't take part in the ransom scheme. The getaway vehicle is discovered registered to TJ's brother, James. Montgomery receives photo evidence of an apparent homosexual affair between Hubert and Cook and the thieves hack Montgomery's laptop and Skype call him hoping to persuade him to look into Hubert's corruption. Converging on the Main Branch for the third robbery, the thieves surprise the FBI during an interview with Hubert. High-powered rifle firefights erupt across the lobby as the men engage in close quarters combat. One thief is killed and the three others retreat into the downtown traffic. Victims Hutchinson and Dagley are found to be old members of an elite platoon with Cook.\n\nMontgomery is sent a file stolen from Hubert detailing the conspiracy to commit murder and military cover-up. It leaks to the media and the truth finally outs; Hubert conspired with Cook to prevent Alexander from taking over the company. They briefed the Ranger unit with false mission intel of a terrorist threat in Costa Rica.The Rangers sent in were then assessed as rogue agents and ambushed by a Special Forces team with no knowledge of the Rangers innocence. TJ was the sole survivor, saved by then Special Forces sniper Wells.\n\nWith his assets frozen, Hubert hastily makes large unauthorized cash withdrawals to flee the country. TJ is tracked by the FBI to a concert venue and taken into custody. FBI Special Agent Wells is revealed to be the thief crew leader with three special forces members that attacked TJ's squad as accomplices. He planned the heists as vengeance for the Ranger massacre he regrettingly took part in. Recalling a key detail in a map location, detective Mims correctly predicts Wells as the thief and arrives just as Wells preps to leave the stash spot with the stolen heist cash. Tormented by a guilty conscience and his wife's terminal cancer prognosis, Mims pleads with Wells to allow him to return the stolen money and atone. Wells tries to reason with Mims but kills him as Mims raises his weapon.\n\nSome time later, Montgomery tracks Hubert to Mexico. He finds Wells preparing to kill Hubert in a restaurant and suggests Wells absolve his transgressions by using the stolen money to help others. Montgomery takes a seat at Hubert's table, sips wine in remembrance of his wife, then stabs Hubert to death with a concealed blade. Wells shoots Hubert's bodyguard dead, shares a glance with Montgomery, and then leaves.",
  "synopsis": null
}