{
  "imdb_id": "tt4683366",
  "tmdb_id": "381298",
  "douban_id": null,
  "title": "Ghayal Once Again (2016)",
  "genres": [
    "Action",
    "Drama"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "127 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.7,
  "director": [
    {
      "id": "nm0219971",
      "name": "Sunny Deol"
    }
  ],
  "writer": [
    {
      "id": "nm1100075",
      "name": "Shaktimaan Talwar",
      "description": "story &"
    },
    {
      "id": "nm1834338",
      "name": "Sagar Pandya",
      "description": "story"
    },
    {
      "id": "nm1300956",
      "name": "Sanjay Masoom",
      "description": "screenplay &"
    },
    {
      "id": "nm4423914",
      "name": "Vishal Vijay Kumar",
      "description": "screenplay"
    },
    {
      "id": "nm4423914",
      "name": "Vishal Vijay Kumar",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0219971",
      "name": "Sunny Deol",
      "character": "Ajay Mehra"
    },
    {
      "id": "nm1675786",
      "name": "Soha Ali Khan",
      "character": "Rhea"
    },
    {
      "id": "nm0700875",
      "name": "Om Puri",
      "character": "ACP Joe D'Souza"
    },
    {
      "id": "nm3993263",
      "name": "Aanchal Munjal",
      "character": "Anushka       (as Aachal Munjal)"
    },
    {
      "id": "nm2368423",
      "name": "Narendra Jha",
      "character": "Raj Bansal"
    },
    {
      "id": "nm7739774",
      "name": "Manoj Joshi",
      "character": "Home Minister"
    },
    {
      "id": "nm0219946",
      "name": "Ramesh Deo",
      "character": "Nana"
    },
    {
      "id": "nm1538116",
      "name": "Tisca Chopra",
      "character": "Sheetal Bansal"
    },
    {
      "id": "nm1122077",
      "name": "Harsh Chhaya",
      "character": "Rajguru"
    },
    {
      "id": "nm1318321",
      "name": "Nadira Babbar",
      "character": "Dadi"
    },
    {
      "id": "nm7739776",
      "name": "Rishabh Arora",
      "character": "Varun"
    },
    {
      "id": "nm6923837",
      "name": "Ruhanika Dhawan",
      "character": "Ananya Bansal"
    },
    {
      "id": "nm1664541",
      "name": "Zakir Hussain",
      "character": "Commissioner"
    },
    {
      "id": "nm3188755",
      "name": "Sebastien Vandenberghe",
      "character": "Troy"
    },
    {
      "id": "nm7207150",
      "name": "Neha Khan",
      "character": "Renu"
    },
    {
      "id": "nm0451561",
      "name": "Sachin Khedekar",
      "character": "Kriplani"
    },
    {
      "id": "nm7739775",
      "name": "Nina Kulkarni",
      "character": "Mrs. Joe D'Souza"
    },
    {
      "id": "nm7788119",
      "name": "Abhilash Kumar",
      "character": "Bansal Kabir       (as Kumar Abhilash)"
    },
    {
      "id": "nm3237565",
      "name": "Lily Patel",
      "character": "Varun's Grandmother"
    },
    {
      "id": "nm7739777",
      "name": "Diana Khan",
      "character": "Zoya"
    },
    {
      "id": "nm5805017",
      "name": "Shivam Patil",
      "character": "Rohan"
    },
    {
      "id": "nm1137758",
      "name": "Satyajeet",
      "character": "Ajay Mehra's Friend"
    },
    {
      "id": "nm4765978",
      "name": "Akshay Singh",
      "character": "Akshay"
    },
    {
      "id": "nm1872498",
      "name": "Raymond Singh",
      "character": "Mrs. Kriplani (Rohan's Mother)"
    },
    {
      "id": "nm1259084",
      "name": "Manoj Joshi",
      "character": "Home Minister Kaka Saheb"
    },
    {
      "id": "nm9750158",
      "name": "Neha Khan",
      "character": ""
    },
    {
      "id": "nm0474620",
      "name": "Nina Kulkarni",
      "character": "Mrs. Joe Dsouza"
    },
    {
      "id": "nm10189828",
      "name": "Suchint Singh",
      "character": "Suchint"
    },
    {
      "id": "nm4178300",
      "name": "Lokesh Tilakdhari",
      "character": "Lokesh"
    },
    {
      "id": "nm10429240",
      "name": "Ajay Upadhyay",
      "character": "Press reporter"
    },
    {
      "id": "nm8408227",
      "name": "Rajeev Vashishth",
      "character": "Bansal's friend       (credit only)"
    }
  ],
  "overview": "Ajay Mehra (from previous Ghayal-1990), after finishing off his life sentence, starts a newspaper called Satyakam. Still dealing with the haunting trauma of losing his loved ones, Ajay manages to make a credible name for himself in investigative journalism. Working with a strange team of RTI activists, ex-criminals and ilk; and even stranger ways of unearthing and presenting truth, Ajay Mehra has earned quite a fan following among the youths, who finds his fearless and unforgiving approach in dealing with all kinds of sociopaths very inspiring.",
  "storyline": "Ajay Mehra (from previous Ghayal-1990), after finishing off his life sentence, starts a newspaper called Satyakam. Still dealing with the haunting trauma of losing his loved ones, Ajay manages to make a credible name for himself in investigative journalism. Working with a strange team of RTI activists, ex-criminals and ilk; and even stranger ways of unearthing and presenting truth, Ajay Mehra has earned quite a fan following among the youths, who finds his fearless and unforgiving approach in dealing with all kinds of sociopaths very inspiring. Among his die hard fans are these four teenagers who happened to have received bravery medals from him once. These four friends once out on photography expedition, accidentally record a murder on a camera. The footage turns out to be explosive as it clearly shows two of the city's most powerful people involved in the murder. Well what happens after this is a series of twists and turns where the four kids get entangled and have to fight it out ...",
  "plot": "The film opens with flashbacks of Ghayal, Angry Young Man Ajay Mehra shoots and kills Balwant Rai (who had murdered Ajay's brother) and surrenders himself to upright cop Joe D'Souza. Ajay is sentenced to prison. Upon his release he begins a new career as a reporter for an independent newspaper, but also works as a vigilante who assists the police with their hard-to-prosecute cases (including cases where the accused are prominent and influential members of society).\n\nOne such case involves small town reporter Renu who was drugged and raped by her boss, the media baron Rajguru. Renu committed suicide and Rajguru's men covered up the matter, implicating her innocent boyfriend. Ajay swings into action and abducts Rajguru, soon forcibly obtaining a DNA swab. Rajguru is then arrested and Ajay is declared a sensational hero. However, Ajay still suffers anxiety attacks from his painful memories of his past. His girlfriend Riya, a psychiatrist, helps him with his problems.\n\nJoe D'Souza has retired and is now a social activist. Ajay often collaborates with him and helps him out. Later on, however, D'Souza is killed in a traffic accident in Panvel. Young blogger Zoya Saigal is shocked to discover that Joe was, in fact, shot dead. She had accidentally captured the murder on video, committed by Kabir Raj Bansal, son of business tycoon Raj Bansal. Zoya and her friends panic and want to take the video to the cops but Anushka's (Zoya's friend) grandfather infers that Raj Bansal had staged the road accident (where 8 other innocent people were killed) and stops them, due to Bansal's power. It is further revealed that D'Souza had visited Raj Bansal and directly accused him of a land grab. Bansal tried to buy him off, but an argument ensues, and Kabir, in a fit of rage, shot D'Souza. The accident was a cover up. Bansal privately realizes that Kabir is still a bratty kid and decides to enrol him into a military school.\n\nFollowing her grandfather's advice, Anushka turns the video over to the lawyer, Kriplani, in order to ensure the children remain safe. However, Kriplani quietly returns it to Bansal, and his son Rohan, also a friend of Zoya, realizes that his father has given up the video and thus urges Zoya to reach Ajay Mehra. As the children hurry to reach Ajay, they are intercepted by Bansal's thugs. A chase ensues and Ajay saves the children, recovering the video. Riya takes the children to the hospital, but they are yet again abducted by Bansal's men.\n\nIt is soon revealed that Anushka is Ajay's own daughter. Kabir tortures the children until Bansal, tired of his son's tantrums, warns him away. Bansal holds Ajay's daughter and releases the other children. He tells Ajay that his daughter will henceforth stay with Bansal in order to ensure the safety of Kabir. Bansal's mother objects but Bansal, locked in moral conflict, waves her away. Bansal orders the Home Minister to arrest Ajay Mehra.\n\nAjay overcomes the cops and mounts an attack on the Bansal mansion to rescue his daughter. There is a fierce fight. Ajay rescues his own daughter as well as Bansal's daughter who gets trapped in the debris. Bansal surrenders and is arrested along with his son. The film ends as Ajay and his daughter recover in the hospital surrounded by their friends.",
  "synopsis": null
}