{
  "imdb_id": "tt4637598",
  "tmdb_id": "390358",
  "douban_id": null,
  "title": "Pyromaniac (2016)",
  "genres": [
    "Crime",
    "Drama",
    "Mystery"
  ],
  "country": "Norway",
  "version": [
    {
      "runtime": "98 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.3,
  "director": [
    {
      "id": "nm0804408",
      "name": "Erik Skjoldbjærg"
    }
  ],
  "writer": [
    {
      "id": "nm2360523",
      "name": "Bjørn Olaf Johannessen",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3898788",
      "name": "Trond Nilssen",
      "character": "Dag       (as Trond Hjort Nilssen)"
    },
    {
      "id": "nm0295836",
      "name": "Per Frisch",
      "character": "Ingemann"
    },
    {
      "id": "nm0651475",
      "name": "Liv Bernhoft Osa",
      "character": "Alma"
    },
    {
      "id": "nm0706152",
      "name": "Henrik Rafaelsen",
      "character": "Lensmannen"
    },
    {
      "id": "nm3433423",
      "name": "Oddgeir Thune",
      "character": "Alfred"
    },
    {
      "id": "nm1748545",
      "name": "Agnes Kittelsen",
      "character": "Elsa"
    },
    {
      "id": "nm0772032",
      "name": "Gerdi Schjelderup",
      "character": "Johanna"
    },
    {
      "id": "nm0865539",
      "name": "Per Tofte",
      "character": "Olav"
    },
    {
      "id": "nm1086883",
      "name": "Kari Onstad Winge",
      "character": "Agnes"
    },
    {
      "id": "nm2683109",
      "name": "Kirsti Grundtvig",
      "character": "Postsjef       (as Kirsti Grundvig)"
    },
    {
      "id": "nm8664979",
      "name": "Geir Myre",
      "character": "Kaddeberg"
    },
    {
      "id": "nm4737529",
      "name": "Amund Hestsveen",
      "character": "Journalist"
    },
    {
      "id": "nm4860090",
      "name": "Patrik Stenseth",
      "character": "Tommy"
    },
    {
      "id": "nm8664980",
      "name": "Steffen Mulder",
      "character": "Stig"
    },
    {
      "id": "nm5450531",
      "name": "Ane Kirkeng Jørgensen",
      "character": "Anne"
    },
    {
      "id": "nm8664981",
      "name": "Dina Valberg",
      "character": "Maria"
    },
    {
      "id": "nm8664982",
      "name": "Sondre Berget",
      "character": "Torstein"
    },
    {
      "id": "nm8664983",
      "name": "Trym Arve Lund Gabrielsen",
      "character": "Rolf"
    },
    {
      "id": "nm6160368",
      "name": "Geir Høie Ludvigsen",
      "character": "Reporter       (as Geir Høye Ludvigsen)"
    },
    {
      "id": "nm8664984",
      "name": "Arne Rafaelsen",
      "character": "Johansens far"
    },
    {
      "id": "nm4937301",
      "name": "Julius Winger",
      "character": "Mann fra Kripos"
    },
    {
      "id": "nm8664985",
      "name": "Enok Enoksen",
      "character": "Politimann"
    },
    {
      "id": "nm4811768",
      "name": "Jan ø. Fjeldal",
      "character": "Politibetjent       (as Jan Fjeldal)"
    },
    {
      "id": "nm7308183",
      "name": "Ronnie Hakkim",
      "character": "Politibetjent"
    },
    {
      "id": "nm8664986",
      "name": "Njål S. Kristiansen",
      "character": "Politibetjent       (as Njål S. Kristensen)"
    },
    {
      "id": "nm8664987",
      "name": "Johannes Timenes",
      "character": "Brannvarsler"
    },
    {
      "id": "nm0284629",
      "name": "Torgeir Fonnlid",
      "character": "Sint Mann"
    },
    {
      "id": "nm3013431",
      "name": "Aase Helene Røinaas",
      "character": "Småbarnsmor       (as Aase Helene Røinaas Aabel)"
    },
    {
      "id": "nm8754539",
      "name": "Samuel Mathiesen",
      "character": "Dag - 10 år"
    },
    {
      "id": "nm8754540",
      "name": "Anita Heivoll",
      "character": "Noen"
    },
    {
      "id": "nm8754541",
      "name": "Erik Berntsen",
      "character": "Brannmann"
    },
    {
      "id": "nm8754542",
      "name": "Jarle Danielsen",
      "character": "Brannmann"
    },
    {
      "id": "nm8754543",
      "name": "Rune Finsland",
      "character": "Brannmann"
    },
    {
      "id": "nm8754544",
      "name": "Geir Klev",
      "character": "Brannmann"
    },
    {
      "id": "nm8754545",
      "name": "Bent Joachim Røiseland",
      "character": "Brannmann"
    },
    {
      "id": "nm8754546",
      "name": "Knut Røysland",
      "character": "Brannmann"
    },
    {
      "id": "nm8754547",
      "name": "Bjørn Severinsen",
      "character": "Brannmann"
    },
    {
      "id": "nm8754548",
      "name": "Frode Storbrua",
      "character": "Brannmann"
    },
    {
      "id": "nm8754549",
      "name": "Terje Syvertsen",
      "character": "Brannmann"
    },
    {
      "id": "nm8754550",
      "name": "Kjell Inge Vium",
      "character": "Brannmann"
    },
    {
      "id": "nm9239540",
      "name": "Stein Erik Skaar",
      "character": "Politietterforsker"
    }
  ],
  "overview": "In the darkness of a peaceful village, a pyromaniac ignites his first fire. As more fires break out, the society panics. An inferno lurks under the surface as a local policeman uncovers the unthinkable truth...",
  "storyline": "A ruthless pyromaniac is on the loose in a southern village of Norway. They don't know he's not a stranger, but one of them. We follow him, the fire brigade chief's own son, spreading fear in secret.",
  "plot": "At the White House, brainwashed teleporting mutant Nightcrawler attempts to assassinate the President of the United States but fails and escapes. Meanwhile, Wolverine explores an abandoned military installation at Alkali Lake in Alberta for clues to his past, but finds nothing. He returns to Professor Xavier's school for mutants, and Xavier tracks Nightcrawler using Cerebro. Xavier and Cyclops go to question the imprisoned Magneto about the attack, while X-Men Storm and Jean Grey retrieve Nightcrawler. Meanwhile, military scientist Colonel William Stryker approaches the president and receives approval to investigate Xavier's mansion for their ties to mutants. Stryker's forces invade the school and abduct most of the students, with only Wolverine, Rogue, Iceman, and Pyro escaping, and Stryker's assistant Yuriko Oyama captures Cyclops and Xavier. During the attack Wolverine confronts Stryker, who knows him by name.\n\nThe shape-shifting Mystique gains information about Magneto's prison and helps him escape while also discovering schematics for a second Cerebro. Wolverine, Rogue, Iceman, and Pyro visit Iceman's parents in Boston and meet up with Storm, Jean, and Nightcrawler. The X-Jet is attacked by fighter jets en route back to the mansion and is shot down, but Magneto saves them from crashing. Magneto explains to the group that Stryker has built the second Cerebro to use it, and Xavier, to telepathically kill every mutant on the planet. Stryker's son, Jason, is a mutant with mind-controlling powers, which Stryker will use to force Xavier to do this. Stryker had also previously used Jason's powers to orchestrate Nightcrawler's attack as a pretense to gain approval to invade Xavier's mansion. Magneto also tells Wolverine that Stryker was the man who grafted his adamantium skeleton onto his bones. Jean reads Nightcrawler's mind and determines that Stryker's base is underground in a dam at Alkali Lake.\n\nThe mutants infiltrate Stryker's base and Magneto and Mystique go to disable Cerebro before the brainwashed Xavier can activate it. Storm and Nightcrawler rescue the captured students, and Jean fights a mind-controlled Cyclops; their battle frees Cyclops but damages the dam, which begins to rupture. Wolverine finds Stryker in an adamantium smelting lab and remembers it as where he received his adamantium skeleton. Wolverine fights and kills Yuriko, then chases Stryker to a helicopter pad and chains him to the helicopter's wheel. Magneto stops Cerebro and, using Mystique impersonating Stryker to command Jason, has Xavier redirect its powers on normal humans. The two subsequently use Stryker's helicopter to escape, accompanied by Pyro who has been swayed to Magneto's views. Nightcrawler teleports Storm inside Cerebro, where she creates a snowstorm to break Jason's concentration and free Xavier from his control.\n\nThe X-Men flee the dam as water engulfs it, but the damaged X-Jet struggles to take flight. Stryker is killed in the deluge and Jean sacrifices herself to hold back the flood of water while getting the jet into the air, and is then consumed by the flood and presumed dead. The X-Men give the president Stryker's files, and Xavier warns him that humans and mutants must work together to build peace. Back at the school, Xavier, Cyclops, and Wolverine remember Jean, and Xavier begins to hold a class.\n\nThe film ends with a voice-over narration from Jean accompanied by the flooded Akali Lake, a fiery Phoenix-like shape rising from the water.",
  "synopsis": null
}