{
  "imdb_id": "tt4664092",
  "tmdb_id": "339304",
  "douban_id": null,
  "title": "Oru Second Class Yathra (2015)",
  "genres": [
    "Drama"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "104 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.4,
  "director": [
    {
      "id": "nm7308497",
      "name": "Jexson Antony"
    },
    {
      "id": "nm7308498",
      "name": "Rejis Antony"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm2068971",
      "name": "Vineeth Sreenivasan",
      "character": ""
    },
    {
      "id": "nm5584853",
      "name": "Chemban Vinod Jose",
      "character": ""
    },
    {
      "id": "nm6264784",
      "name": "Nikki Galrani",
      "character": ""
    },
    {
      "id": "nm5852449",
      "name": "Joju George",
      "character": ""
    },
    {
      "id": "nm2573453",
      "name": "Sreejith Ravi",
      "character": ""
    },
    {
      "id": "nm7936195",
      "name": "Aparna Balamurali",
      "character": ""
    },
    {
      "id": "nm2108782",
      "name": "Arun Ghosh",
      "character": ""
    },
    {
      "id": "nm1428724",
      "name": "Indrans",
      "character": ""
    },
    {
      "id": "nm1334387",
      "name": "Koottickal Jayachandran",
      "character": ""
    },
    {
      "id": "nm4051131",
      "name": "Sasi Kalinga",
      "character": ""
    },
    {
      "id": "nm7075397",
      "name": "Hareesh Kanaran",
      "character": "Auto-rickshaw Driver       (as Hareesh)"
    },
    {
      "id": "nm6845864",
      "name": "Pradeep Kottayam",
      "character": ""
    },
    {
      "id": "nm0889150",
      "name": "Vanitha Krishnachandran",
      "character": "(as Vanitha)"
    },
    {
      "id": "nm0541126",
      "name": "Mammukoya",
      "character": ""
    },
    {
      "id": "nm7792273",
      "name": "Veena Nair",
      "character": ""
    },
    {
      "id": "nm7457612",
      "name": "Saju Navodaya",
      "character": ""
    },
    {
      "id": "nm5917884",
      "name": "Nelson",
      "character": ""
    },
    {
      "id": "nm0683477",
      "name": "Maniyanpilla Raju",
      "character": ""
    },
    {
      "id": "nm7621790",
      "name": "Arya Rohit",
      "character": "Train Passenger"
    },
    {
      "id": "nm4584689",
      "name": "Sunil Sukhada",
      "character": ""
    },
    {
      "id": "nm7478940",
      "name": "Balu Varghese",
      "character": ""
    }
  ],
  "overview": "Oru Second Class Yathra is a comedy thriller where Vineeth Sreenivasan and Chemban Vinod play thieves, while Sreejith Ravi and Joju George play the roles of police officers. The film is set on the journey of these four in the train from Kannur Central Jail to Thiruvananthapuram.",
  "storyline": "Police constables Balagopal (Sreejith Ravi) and Jolly Kurien (Joju George) have been at odds for years but are under orders to transfer two prisoners Nandu(Vineeth Sreenivasan)and Maran (Chemban Vinod Jose) from Kannur to Trivandrum. But on the way one prisoner escapes. The two officers with second prisoner were hope to find the missing one before the day ends.",
  "plot": "Police constables Balagopal (Sreejith Ravi) and Jolly Kurien (Joju George) have been at odds for years but are under orders to transfer two prisoners from Kannur to Trivandrum. They board the Parasuram express with the handcuffed inmates. While at the Kayamkulam station, prisoner Nandu (Vineeth Sreenivasan) escapes. The two officers get off the train at the next stop with second inmate Maran (Chemban Vinod Jose) and frantically searches for Nandu. The three unlikely musketeers finds the back-story of Nandu. Nandu's father, Narayanan (Nedumudi Venu) always have a wrongful intention to his step-sister, Lakshmi (Nikki Galrani). Nandu, one day determines to kill his father for the same, but the trap he set accidentally killed his mother. He was arrested for his mother's murder. One day his father Narayanan comes to visit him at jail and reveals his true intentions for his step-sister. Nandu determines to escape at any possible opportunities. The three musketeers finds Nandu while roughing with Narayanan, both with the intention to kill. Accidentally Jolly Kurien kills Nandu's father. With knowing Narayanan's story, Maran devises a plan to not let the issue known to others, to which everyone agrees. Narayanan's body is buried in a nearby church cemetery at that night itself. In the end of the day everyone is shown as happy in their karmic lives.",
  "synopsis": null
}