{
  "imdb_id": "tt4650410",
  "tmdb_id": "410960",
  "douban_id": null,
  "title": "Die Krone von Arkus (2015)",
  "genres": [
    "Adventure",
    "Family",
    "Fantasy"
  ],
  "country": "Germany",
  "version": [],
  "imdb_rating": 4.5,
  "director": [
    {
      "id": "nm1914712",
      "name": "Franziska Pohlmann"
    }
  ],
  "writer": [
    {
      "id": "nm7295763",
      "name": "Franziska Pohlmann",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm7295759",
      "name": "Lukas Jantzen",
      "character": "Jono"
    },
    {
      "id": "nm7295760",
      "name": "Anna-Lena Sender",
      "character": "Saraja"
    },
    {
      "id": "nm10868557",
      "name": "Don Duncin Adams",
      "character": "Schemmi"
    },
    {
      "id": "nm2168624",
      "name": "Tom Barcal",
      "character": "Gurungur"
    },
    {
      "id": "nm10868561",
      "name": "Anton Baron",
      "character": "Morius"
    },
    {
      "id": "nm7378510",
      "name": "Juliane Behneke",
      "character": "Wiesel Jima"
    },
    {
      "id": "nm10868552",
      "name": "Sebastian Gniechel Christ",
      "character": "Troll"
    },
    {
      "id": "nm10868558",
      "name": "Katharina Christophoridis",
      "character": "Salmi"
    },
    {
      "id": "nm10868564",
      "name": "Kevin Dukes",
      "character": "Wache"
    },
    {
      "id": "nm10868565",
      "name": "Jan Großfeld",
      "character": "Wache"
    },
    {
      "id": "nm0351623",
      "name": "Ulrich Günther",
      "character": "Wache"
    },
    {
      "id": "nm3349036",
      "name": "Robert Harms",
      "character": "Wache"
    },
    {
      "id": "nm2384960",
      "name": "Thomas Hauck",
      "character": "Fremder"
    },
    {
      "id": "nm10868562",
      "name": "Andreas Kahnt",
      "character": "Wache"
    },
    {
      "id": "nm0449988",
      "name": "Sonja Kerskes",
      "character": "Geraldine"
    },
    {
      "id": "nm10868569",
      "name": "Kimber",
      "character": "Katze"
    },
    {
      "id": "nm10868556",
      "name": "Susan Lachermund",
      "character": "Lyris"
    },
    {
      "id": "nm10868570",
      "name": "Lyris Lawaty",
      "character": "Baletttänzerin"
    },
    {
      "id": "nm7034684",
      "name": "Jens-Holger Lemke",
      "character": "Fischer"
    },
    {
      "id": "nm3705345",
      "name": "Nicola Melissian",
      "character": "Julie"
    },
    {
      "id": "nm10868559",
      "name": "Morgane Meutiben",
      "character": "Pansch"
    },
    {
      "id": "nm9265670",
      "name": "Lennart-Fabian Müller",
      "character": "Herr Hase"
    },
    {
      "id": "nm7295761",
      "name": "Marit Persiel",
      "character": "Diamanz"
    },
    {
      "id": "nm4525318",
      "name": "Arne Prill",
      "character": "Wache"
    },
    {
      "id": "nm7523526",
      "name": "Yannik Raiss",
      "character": "Wache"
    },
    {
      "id": "nm7295762",
      "name": "Marion Iris Reinhardt",
      "character": "Roseanne"
    },
    {
      "id": "nm10868563",
      "name": "Patrick Rintsch",
      "character": "Wache"
    },
    {
      "id": "nm7694428",
      "name": "Mareike Rückert",
      "character": "Schildkröte Hentus Operator"
    },
    {
      "id": "nm10868566",
      "name": "Markus Schilling",
      "character": "Wache"
    },
    {
      "id": "nm0777962",
      "name": "Ernst-Georg Schwill",
      "character": "Menni"
    },
    {
      "id": "nm9298714",
      "name": "Paul Seegers",
      "character": "Troll"
    },
    {
      "id": "nm10868568",
      "name": "Sara Simons",
      "character": "Schlosskind Sula"
    },
    {
      "id": "nm1692987",
      "name": "Frank Streffing",
      "character": "Gastwirt Férimon"
    },
    {
      "id": "nm7659097",
      "name": "Kai Swaensson-Göring",
      "character": "Schmied"
    },
    {
      "id": "nm10868567",
      "name": "Maximilian von Stern",
      "character": "Anton Férimon"
    },
    {
      "id": "nm6500734",
      "name": "Jamie Watson",
      "character": "Fou"
    },
    {
      "id": "nm10868553",
      "name": "Robin Williamson",
      "character": "Troll"
    },
    {
      "id": "nm10868571",
      "name": "Miriam Winterseel",
      "character": "Baletttänzerin"
    },
    {
      "id": "nm4525268",
      "name": "Frank Wintjen",
      "character": "Wache"
    },
    {
      "id": "nm10868554",
      "name": "Carina Wolff",
      "character": "Troll"
    },
    {
      "id": "nm5965309",
      "name": "Jonathan Wolters",
      "character": "Erdmännchen Jami"
    },
    {
      "id": "nm10868560",
      "name": "Juna Robin Zackowitz",
      "character": "Pitsch"
    },
    {
      "id": "nm10868555",
      "name": "Sören Zehle",
      "character": "Troll"
    }
  ],
  "overview": "Arkus is reigned by Schiija. The Evil queen forces the inhabitants to give her their best work as gifts at the yearly gifts day. One day a former rival passes a hint on how to defeat the queen to the streetkids Jono and Saraja .",
  "storyline": "Fear and terror dictate the everyday life of Arkus. Schiija, the evil queen of the city, fossilizes the residents into stone whenever she wants to demonstrate her dark power. Once a year she forces all inhabitants of Arkus to donate gifts to their queen at the gifts day. One week before this event Saraja, a homeless girl, finds an astonishing message. The letter are as follows: \"Be here at midnight.\" At exactly twelve o'clock that day she comes back as the arcane message told her. Jono, the leader of the thieves with magical hands, is already waiting for her. Shortly before she was listening to his narration of the legend of the young boy Morius with the other members of the thieves with magical hands. Many years ago Morius has stolen a stone of Schiijas crown whereupon she turned him into stone. From this time on he is standing there as a fixed sculpture - no opportunity to talk or even talk. But the secret behind this evilness is, that he's still alive in his lithic prison. Schiija ...",
  "plot": null,
  "synopsis": "Fear and terror dictated the everyday life of the people of Arkus. Schiija, the evil queen of the city, petrifies the residents whenever she wants to demonstrate her dark power.Once a year she forces all inhabitants of Arkus to donate gifts to her on Gifts Day. But one week before this event Saraja, a homeless girl, finds an bewildering message: \"Be here at midnight!\"At exactly twelve o'clock that day she comes back as the mysterious message told her.\nJono, the leader of the thieves with magical hands, is waiting for her. She listens to his narration of the legend of the young boy Morius: Many years ago Morius had stolen a stone of Schiijas' crown and when she caught him she turned him into stone. From that time on he has been standing there as a fixed sculpture fully aware of his surroundings but unable to talk or move a muscle. Only somebody else fulfilling his mission could release him.Saraja and Jono both want to help Morius, but Saraja is not interested in working together with Jono. So she alone must work to overcome the three obstacles: The most beautiful dress, the biggest candy cane, and the most precious ring should own, who wants to overwhelm the evil queen's power.Saraja starts working for the tailor Géraldine and fabricates the most beautiful dress. It is not untill the end that she realizes, that Jono had secretly helped her. For this reason she is appreciative and decides to cooperate with Jono in order to help Morius. Lyris, a member of the thieves with magical hands who adores Jono, becomes jealous and angry and decides to move to the queens castle with all members of her family. There they realize quickly that diamonds and presents don't replace their friend Jono. But how can they get free again?At the same time Saraja and Jono produce the longest candy cane at the bakery. They are close to master the challenges, when they get caught by the old baker Menni. During a chase they escape only to fall into the next trap set by Jonos friend Lyris. It seems as if she is totally submissive towards the queen, but in reality she makes use of her intelligence and pretends to surrender herself to Schiija in order to covertly plan their escape.Again the kids have to realize that only if they all work together they can reach their goal and beat the evil queen. With a plan involving all the kids in crucial roles, they turn Schiija into stone and free Morius and the whole city of Arkus.THE CROWN OF ARKUS is a fairytale, magical musical film about a growing friendship amidst poverty and abundance. The soundtrack and the production design emphasize in a crucial way the impression of the magical, dreamy world of Arkus."
}