{
  "imdb_id": "tt4699534",
  "tmdb_id": "347666",
  "douban_id": null,
  "title": "We Need to Talk (2016)",
  "genres": [
    "Comedy"
  ],
  "country": "Spain",
  "version": [
    {
      "runtime": "91 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm0785515",
      "name": "David Serrano"
    }
  ],
  "writer": [
    {
      "id": "nm1749125",
      "name": "Diego San José",
      "description": null
    },
    {
      "id": "nm0785515",
      "name": "David Serrano",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3177382",
      "name": "Belén Cuesta",
      "character": "Yoli"
    },
    {
      "id": "nm6605716",
      "name": "Carla Diego",
      "character": "Chef"
    },
    {
      "id": "nm0286579",
      "name": "Verónica Forqué",
      "character": "Patricia"
    },
    {
      "id": "nm3128217",
      "name": "Luis Jaspe",
      "character": "Camarero Latino"
    },
    {
      "id": "nm1043338",
      "name": "Michelle Jenner",
      "character": "Nuria"
    },
    {
      "id": "nm7363007",
      "name": "Ilay Kurelovic",
      "character": "Víctor"
    },
    {
      "id": "nm0480587",
      "name": "Óscar Ladoire",
      "character": "Miguel"
    },
    {
      "id": "nm2587181",
      "name": "Borja Luna",
      "character": "Pepe"
    },
    {
      "id": "nm7046674",
      "name": "José Luis Marín",
      "character": "Trabajador Limpieza"
    },
    {
      "id": "nm1714832",
      "name": "Juan José Del Rey",
      "character": "Camarero Bar Copas       (as Juanjo del Rey)"
    },
    {
      "id": "nm1238859",
      "name": "Ernesto Sevilla",
      "character": "Lucas"
    },
    {
      "id": "nm1281229",
      "name": "Hugo Silva",
      "character": "Jorge"
    },
    {
      "id": "nm0959304",
      "name": "Roberto Álamo",
      "character": "Empresario"
    },
    {
      "id": "nm0554614",
      "name": "Diego Martín",
      "character": ""
    },
    {
      "id": "nm1438700",
      "name": "Diego París",
      "character": ""
    },
    {
      "id": "nm1087324",
      "name": "Coté Soler",
      "character": "Luis"
    }
  ],
  "overview": null,
  "storyline": "Nuria is a young girl with a good life, a boyfriend to marry him and a parents who love her, but a problem: she still is married with Jorge. Former CEO, Jorge lives almost in the ruin together his ex boss and friend Lucas. After two years separated, Jorge doesn't forget her, but Nuria tries to ask him files for divorce when she wrongly discovers that Jorge has tried to commit suicide jumping by a window. Feeling responsible by it, Nuria talks with her parents Miguel and Patricia, according cheat Jorge for that he beliefs that they aren't divorced and Miguel didn't lose his company due to the Jorge's bad business inversions that ruined his parents-in-law, in order to get the divorce without pain for anybody. The real problem is what when the lies accumulate, the situation is each time more dangerously out of control.",
  "plot": "Teenager Kevin Khatchadourian is in prison after committing a massacre at his high school. His mother, Eva, once a successful travel writer, lives alone in a rundown house and works in a travel agency in a town near the prison, where she visits Kevin. She looks back at her memories of him growing up as she tries to cope with the anger and hostility of her neighbors, who know she is Kevin's mother.\n\nKevin is detached and difficult even from childhood. Eva has problems with identifying as a mother and has trouble bonding with Kevin, who appears to loathe her and behaves in whatever way he thinks will torment her the most. As a baby, he cries incessantly, but only around her; as a child, he resists toilet training, rebuffs Eva's clumsy attempts at affection, and shows no interest in anything. He portrays a happy, loving son when his father is watching, and reverts to his sullen, bitter personality only when he is alone with his mother. While he is still small, Eva's frustration with his intractability drives her to throw Kevin against the wall, breaking his arm. They return from the hospital with Kevin's arm in a cast. When his father, Franklin, asks how he broke his arm, Kevin covers for his mother with a lie, using this incident later to subtly blackmail her into giving in to demands, like skipping her errands to take him straight home after school.\n\nWhen Eva tries to talk to her husband about her increasing concern about Kevin's problems, he dismisses her concerns and makes excuses for Kevin's behavior; he has never seen Kevin's dark side and so he doesn't think anything is wrong with Kevin. The only real affection and interest Kevin shows towards Eva occurs when he is confined to his bed with a fever and she reads him a book about Robin Hood. When reading the part of the story where Robin competes in Prince John's archery contest, Kevin snuggles with Eva and spurns Franklin when he interrupts the story. Franklin gives him a bow and arrow set and teaches him archery, and Kevin soon becomes an excellent marksman. He continues to practice and graduate to bigger bows as he gets older.\n\nEva and Franklin have a second child, Celia, who is lively and cheerful. However, her birth does nothing to lessen the tension within the family, as Kevin immediately shows disdain and jealousy towards her. A few years later, Celia's pet guinea pig is killed and she is blinded in one eye by an incident with a caustic cleaning fluid. Eva is convinced Kevin is responsible, whereas Franklin insists these events were accidents and that their son is blameless. This pattern of suspicion on Eva's part, combined with Franklin's unflagging defense of Kevin, ruins their marriage, and Franklin approaches Eva with the subject of a future divorce. Eva comes to fear her son, as she sees growing evidence of Kevin's pleasure in hurting others.\n\nThis eventually leads to the massacre, when Kevin locks the gymnasium doors with bike locks and murders multiple students with his bow and arrow. As Eva arrives at the school from work, along with the other concerned adults, the police cut through one of the bike locks, and Eva knows Kevin is responsible. Kevin voluntarily walks out, turning himself over, and revealing himself to be the killer. Eva finally arrives home, only to find the house empty and dark. She discovers the arrow-penetrated corpses of Franklin and Celia in the backyard, whom Kevin had killed before the massacre.\n\nOn the second anniversary of the massacre, Eva visits Kevin in prison. Kevin is anxious because his transfer to an adult prison is about to happen. Eva asks him why he committed the murders. Displaying rare vulnerability, Kevin responds that he used to know but is no longer sure. Eva gives Kevin a hug and says her good-byes while he is taken away.",
  "synopsis": null
}