{
  "imdb_id": "tt4678788",
  "tmdb_id": "338314",
  "douban_id": null,
  "title": "Lailaa O Lailaa (2015)",
  "genres": [
    "Action",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "168 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.2,
  "director": [
    {
      "id": "nm5346373",
      "name": "Joshiy"
    }
  ],
  "writer": [
    {
      "id": "nm1330994",
      "name": "Suresh Nair",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm3741799",
      "name": "Kainaat Arora",
      "character": "Laila"
    },
    {
      "id": "nm0222144",
      "name": "Rahul Dev",
      "character": "Victor Rana"
    },
    {
      "id": "nm8625106",
      "name": "Kalakalyani",
      "character": "Priya"
    },
    {
      "id": "nm2128968",
      "name": "'Ganja' Karuppu",
      "character": "Autodriver"
    },
    {
      "id": "nm2394329",
      "name": "Kasan Khan",
      "character": "Dhara"
    },
    {
      "id": "nm0558593",
      "name": "Joy Mathew",
      "character": "Dr. Aravind Menon"
    },
    {
      "id": "nm1122888",
      "name": "Vijay Menon",
      "character": "Christy"
    },
    {
      "id": "nm0482320",
      "name": "Mohanlal",
      "character": "Jayamohan"
    },
    {
      "id": "nm6440625",
      "name": "Anjali Nair",
      "character": "Officer       (as Anjali Aneesh Upasana)"
    },
    {
      "id": "nm2463487",
      "name": "Ramya Nambeeshan",
      "character": "Ramya"
    },
    {
      "id": "nm5805491",
      "name": "Sreerag Nambiar",
      "character": ""
    },
    {
      "id": "nm8622120",
      "name": "Abijith Paul",
      "character": "Officer"
    },
    {
      "id": "nm2486661",
      "name": "Kiran Raj",
      "character": ""
    },
    {
      "id": "nm7621790",
      "name": "Arya Rohit",
      "character": "Deccan Exports Receptionist"
    },
    {
      "id": "nm3898762",
      "name": "Amala Paul",
      "character": "Anjali"
    },
    {
      "id": "nm4760810",
      "name": "Junaid Sheikh",
      "character": "Dilawar"
    },
    {
      "id": "nm5667250",
      "name": "Sudheer Sukumaran",
      "character": "Salil"
    },
    {
      "id": "nm0766470",
      "name": "Sathyaraj",
      "character": "Shaheed Khadar"
    }
  ],
  "overview": "The story of the film revolves around Intelligence officer Jayamohan (Mohanlal) and his wife Anjali (Amala Paul). However, Anjali is unaware of the fact that he is an anti- terrorist intelligence agent as his job demands secrecy, but soon she will learn the truth behind Jayamohan. Certain turn of events lead Anjali to join the team of secret agents and together they try to solve the plots set up by the terrorist group",
  "storyline": "Jayamohan is a business magnate who leads a hectic life. Things start going topsy-turvy when he gets married to Anjali. He begins facing problems that affect his business as well.",
  "plot": "Jai Mohan (Mohanlal) leads a double life, he is a special agent of a special task force of the Indian government created to counter terrorism in India. Jai Mohan and his chief Shaheed Khadar (Sathyaraj) operate in Bengaluru under a cover setup of exporting business under the name \"Deccan Exporters\". Jai falls in love with Anjali Menon (Amala Paul) and marries her, for the reason he is constantly hazed by his chief.\n\nOne day, Anjali follows Jai on suspicion of having an affair and accidentally meet each other, which he is forced to reveal that he is an undercover agent who operates as a civilian. Meanwhile, Victor Rana (Rahul Dev) a terrorist who was caught and locked after Interrogation escapes by trick. To catch Victor Rana, Shaheed asks Anjali to act as Laila, a bar dancer, Victor's girlfriend. Anjali finally agrees and is trained as a regular in bar dancing.\n\nVictor Rana's men take Anjali Menon, knowing she is Laila. But Jai tracks them and arrives at a businessman and a party animal Mittal's house \"Ayesha\". Jai Mohan fights through the militants and rescues Anjali. Jai by arranging the evidence and facts understands that the terrorist's plan is to destroy an airplane carrying former US president and finds them through a commercial mini-drone and kills them all and thankfully ending the film.",
  "synopsis": null
}