{
  "imdb_id": "tt4616250",
  "tmdb_id": "416149",
  "douban_id": null,
  "title": "The Perfect Weapon (2016)",
  "genres": [
    "Action",
    "Drama",
    "Sci-Fi",
    "Thriller"
  ],
  "country": "USA",
  "version": [],
  "imdb_rating": 3.2,
  "director": [
    {
      "id": "nm3736022",
      "name": "Titus Paar"
    }
  ],
  "writer": [
    {
      "id": "nm6784572",
      "name": "Alex Brenner",
      "description": null
    },
    {
      "id": "nm3202669",
      "name": "Jesse Cilio",
      "description": null
    },
    {
      "id": "nm3508368",
      "name": "Ulysses Oliver",
      "description": "writer"
    },
    {
      "id": "nm3736022",
      "name": "Titus Paar",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0000219",
      "name": "Steven Seagal",
      "character": "The Director"
    },
    {
      "id": "nm0879186",
      "name": "Richard Tyson",
      "character": "Controller"
    },
    {
      "id": "nm0582257",
      "name": "Johnny Messner",
      "character": "Condor"
    },
    {
      "id": "nm0920460",
      "name": "Vernon Wells",
      "character": "The Interrogator"
    },
    {
      "id": "nm2358356",
      "name": "Sasha Jackson",
      "character": "Nina"
    },
    {
      "id": "nm4903281",
      "name": "Philip Fornah",
      "character": "Cronus"
    },
    {
      "id": "nm0629634",
      "name": "Lance E. Nichols",
      "character": "Politician"
    },
    {
      "id": "nm0385288",
      "name": "Marshal Hilton",
      "character": "The State Spokesman"
    },
    {
      "id": "nm3052104",
      "name": "Emilien De Falco",
      "character": "Bathroom Thug"
    },
    {
      "id": "nm2032510",
      "name": "Griffin Hood",
      "character": "Slack-Jaw"
    },
    {
      "id": "nm8236139",
      "name": "Sabina Mach",
      "character": "Jane"
    },
    {
      "id": "nm3736022",
      "name": "Titus Paar",
      "character": "Sniper"
    },
    {
      "id": "nm4468173",
      "name": "Sarah Kate Allsup",
      "character": "Druggie"
    },
    {
      "id": "nm6699665",
      "name": "Adrian Lockett",
      "character": "Nina Guard"
    },
    {
      "id": "nm3026526",
      "name": "Tara Kleinpeter",
      "character": "Vital Doctor"
    },
    {
      "id": "nm6642669",
      "name": "Sandra Yap",
      "character": "Kyoko"
    },
    {
      "id": "nm5278292",
      "name": "Eric Pettway",
      "character": "Interrogator"
    },
    {
      "id": "nm5584788",
      "name": "Steven Marlow",
      "character": "Hospital Guard /              Stunts"
    },
    {
      "id": "nm6584813",
      "name": "Kimberly Battista",
      "character": "Nurse"
    },
    {
      "id": "nm7063738",
      "name": "Gabrielle Skye Goodman",
      "character": "State Spokesperson 3"
    },
    {
      "id": "nm0614861",
      "name": "Brett Murray",
      "character": "Businessman #2       (as Brett Luciana Murray)"
    },
    {
      "id": "nm1030285",
      "name": "Jace Jeanes",
      "character": "Titan"
    },
    {
      "id": "nm4905035",
      "name": "Brent Nevison",
      "character": "Skull Guard"
    },
    {
      "id": "nm7980651",
      "name": "Kimberly Sadovich",
      "character": "State Spokesperson 2"
    },
    {
      "id": "nm7706117",
      "name": "Talia Andrews",
      "character": "Female Spokesperson"
    },
    {
      "id": "nm3865087",
      "name": "Drew Williams",
      "character": "Master Swordsman"
    },
    {
      "id": "nm5861461",
      "name": "Kevin J. McGrath",
      "character": "Doctor"
    },
    {
      "id": "nm7508804",
      "name": "Courtney Morse",
      "character": "State Spokesperson 1"
    },
    {
      "id": "nm7530423",
      "name": "Brad Spiers",
      "character": "SWAT /              Hospital Guard"
    },
    {
      "id": "nm6609111",
      "name": "Robert Deon",
      "character": "Swat Team Leader       (as Robert 'Bigg Sarge' Deon)"
    },
    {
      "id": "nm6873070",
      "name": "Edward J. Delmore III",
      "character": "Condor Agent #3"
    },
    {
      "id": "nm5807101",
      "name": "Martin Ross Henne",
      "character": "Sin Guard 27#"
    },
    {
      "id": "nm0108340",
      "name": "Eugene Brezany",
      "character": "Russian Man"
    },
    {
      "id": "nm7578172",
      "name": "Xavier DuPriest",
      "character": "SWAT /              Hospital Security Guard"
    },
    {
      "id": "nm0662087",
      "name": "Brent Parker",
      "character": "SWAT /              Hospital Guard"
    },
    {
      "id": "nm5047132",
      "name": "Bill Riales",
      "character": "Texas Businessman"
    },
    {
      "id": "nm2794086",
      "name": "Keone Fuqua",
      "character": "Throat Crush Guard - Stunts"
    },
    {
      "id": "nm7706118",
      "name": "Philip Norhah",
      "character": "Cronus"
    },
    {
      "id": "nm3938479",
      "name": "Joe Fuselli",
      "character": "Businessman 1"
    },
    {
      "id": "nm5076180",
      "name": "Ryan Kneeland",
      "character": "Guard /              Club Goer"
    },
    {
      "id": "nm7694027",
      "name": "Eric Van Dervort",
      "character": "Hospital Guard /              Stunts"
    },
    {
      "id": "nm5917777",
      "name": "Tim Mai",
      "character": "Nina's Facekick Guard"
    },
    {
      "id": "nm7525229",
      "name": "Jonathan Neesmith",
      "character": "Bodyguard /              Rebel"
    }
  ],
  "overview": "In a not too distant future, a totalitarian state run by ‘The Director” (Seagal) controls all aspects of life. All enemies of the state are dealt in the harshest way. Most of them are executed by the secret government’s assassins. The best operative is code-named “Condor” (Messner) – an elite agent and hit man for the government. However, in his latest assignment, “Condor” fails to kill an opposition leader, and finds himself on the run from the very same government agency that he works for. This sets in motion a chain of events with unforseen consequences for all involved.",
  "storyline": "In the not so distant future, society is controlled by the powerful State and a dictator known as the Director. Condor works as a hitman for the State, but a reunion with someone he thought was dead forces him to consider who his enemies really are.",
  "plot": "Jeff Sanders (Jeff Speakman) leads a double life: by day, he is a simple, unassuming construction worker, and by night, an expert Kenpo student and master of his craft.\n\nWhen Jeff lost his mother as a teenager, he became an outcast and frequently lashed out at his family and society in an attempt to assuage his anger. His father, Captain Sanders (Beau Starr), gained the idea from a mutual friend, Kim (Mako), to enroll Jeff in a Kenpō school to better manage his rage and feelings. However, he got into a fight with a bully who beat up his younger brother, and severely injured him with his martial arts. Displeased with his lack of self-control, Jeff's father forced him to move out of home. Jeff, now estranged from his family and living alone, continued with his courses in Kenpo and eventually gained Kim as a mentor and father figure.\n\nJeff decides to return to his old neighborhood and visit his mentor Kim when he detects that Kim is in danger. Jeff discovers that Kim is having trouble with local Korean mafia families, due to his refusal to pay them off and use his antique store to peddle drugs. Jeff helps out Kim by beating up the people who attacked his store which leads to Kim being murdered in his bed by hit-man Tanaka (Professor Toru Tanaka).\n\nJeff vows to avenge Kim's death and is determined to find out who ordered Kim's murder. He remembers a boy named Jimmy (Dante Basco) who lived with Kim, and tries to find him to ask if he knows about the murder. However, Jeff's estranged younger brother Adam (John Dye), now also a cop, is investigating the case, and warns Jeff against trying to settle matters in his own hands. In his hunt to exact revenge, Jeff is approached by a mafia boss named Yung (James Hong) who claims to be Kim's friend and knew of a possible lead to Kim's killer. Jeff is directed to Sam, one of the mafia bosses in Korea town, who was believed to be the one who ordered Kim's death. However, upon breaking into Sam's residence and attempting to kill him, Jimmy appears to reveal that Sam was Kim's friend and was the one who took him in for protection. Jimmy also explains that Yung is the one responsible for Kim's death, and he was merely attempting to use Jeff as a weapon to kill his rival boss Sam.\n\nJeff now plans to kill Yung, but Jimmy warns him that Yung is always protected by his hit-man Tanaka. In order to eliminate Tanaka, Jeff asks Jimmy to falsely testify (to Adam) that he witnessed Tanaka murdering Kim. The plan is have Adam arrest Tanaka so that Jeff can get Yung alone to kill him. Adam and the police eventually capture Tanaka after a long car chase, but to Jeff's dismay Yung was not in the car with him. Tanaka is attacked with a taser, but later manages to escape from the police by severely injuring Adam and breaking out of the police car.\n\nJimmy overhears that Yung plans to escape the country by boat, and tells Jeff about Yung's drug factory. Now further fueled for vengeance, Jeff sets out to attack Yung's drug factory, using his martial art skills and various weapons to defeat guards and hitmen protecting Yung. He eventually subdues Yung, but is attacked by Tanaka. Although Tanaka gains the upper hand during their fight, Jeff manages to kill Tanaka by setting fire to a gas tank he was standing next to. Despite initially wanting to kill Yung, in the end Jeff decides to capture him alive (showing he has learned self-control) and turns Yung in to his father, Captain Sanders.\n\nThe film ends with Jeff entering the kenpo dojo to visit his former master.",
  "synopsis": null
}