{
  "imdb_id": "tt4631532",
  "tmdb_id": "381707",
  "douban_id": null,
  "title": "Our Lovers (2016)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "Spain",
  "version": [
    {
      "runtime": "88 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm1532195",
      "name": "Miguel Ángel Lamata"
    }
  ],
  "writer": [
    {
      "id": "nm1532195",
      "name": "Miguel Ángel Lamata",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0635330",
      "name": "Eduardo Noriega",
      "character": "Carlos"
    },
    {
      "id": "nm1043338",
      "name": "Michelle Jenner",
      "character": "Irene"
    },
    {
      "id": "nm0555093",
      "name": "Fele Martínez",
      "character": "Cristobal"
    },
    {
      "id": "nm2319146",
      "name": "Amaia Salamanca",
      "character": "María"
    },
    {
      "id": "nm0225916",
      "name": "Gabino Diego",
      "character": "Jorge"
    },
    {
      "id": "nm3695189",
      "name": "Jorge Usón",
      "character": "Camarero"
    },
    {
      "id": "nm0604109",
      "name": "María José Moreno",
      "character": "Úrsula"
    },
    {
      "id": "nm2993965",
      "name": "Cristina Gallego",
      "character": "Mema"
    },
    {
      "id": "nm1531989",
      "name": "Salomé Jiménez",
      "character": "Lerda"
    },
    {
      "id": "nm8195478",
      "name": "Irene López Caballero",
      "character": "Poochie"
    },
    {
      "id": "nm8195479",
      "name": "Maxi Jiménez",
      "character": "Maxi"
    },
    {
      "id": "nm8195480",
      "name": "María Mira",
      "character": "Camarera"
    }
  ],
  "overview": null,
  "storyline": "Carlos is a man who goes to a coffee shop-library to take a cup, where Irene is reading a book. Not a reason for it, Irene close to Carlos and talks with him, starting a friendship with a little rules: no pasts, no birth names, no modern ways to contact between them (as Internet or similar), and finally not falling in love each other. Calling themselves Hada Chalada ('Crazy Fairy') and Duende Chiflado ('Mad Goblin'), both pass the days walking around the city engaged with magic, surrealist and funnies conversations about life, love and themselves, at the same time that Carlos tries to end his new script with his friend Cristóbal, and eccentric writer obsessed with Japan. But the good feeling between Carlos and Irene ends suddenly when Irene discovers that Carlos is really the husband of María, new lover of Jorge, Irene's boyfriend, who recently split with her in favor of Carlos' wife. When casually the four coincide in the same place, Carlos must be confront his feelings by Irene with...",
  "plot": "In Madrid, in the mid-1950s, Paco, a handsome young man from the provinces serving the last days of his military service, is in search of both a steady job and lodging. He is engaged to be married to Trini, his major’s maid. Trini is not only sweet and pretty, but also has saved a sizable amount of money through years of hard work and frugal living, which will enable her and Paco to start their lives together comfortably. With a factory job lined up, Paco moves out of his barracks and looks for somewhere to live until the wedding. Trini unwittingly refers him to Luisa, a beautiful widow who periodically takes in boarders and rents him a spare bedroom.\n\nBesides supplementing her income with boarders, Luisa engages in swindles with underworld contracts, and is not above cheating her partners by skimming money off her illicit earnings. Instantly smitten by Paco, the attractive Luisa quickly seduces her new tenant. Paco, frustrated by his unfruitful job hunt and by Trini's refusal to sleep with him until they are married, offers little resistance when Luisa seduces him, initiating an affair. He is dazzled with the sexual delight to which she introduces him. So intense is Paco’s attraction for Luisa, that he abandons Trini for long periods, finally showing up at the major’s house to spend Christmas Eve with her. Trini feels a distance between herself and Paco, and while the couple is strolling in the street, she is surprised to see the “old widow” and immediately guesses that she and Paco are having a relationship.\n\nTrini seeks the advice of the major’s wife, who tells her that she should use her own sexual powers to win Paco back. Waiting for Luisa to leave the apartment, Trini goes to Paco’s room and gives herself to him, making sure that Luisa later sees her leaving. At first, her tactic works and Paco reaffirms his love for her and they leave to visit Trini’s mother in her village. However, Trini is no match for her rival as a lover and Paco cannot get Luisa out of his mind.\n\nWhen they come back to Madrid, Paco is willing to continue his twin relationship, but Luisa, who knows of Trini’s existence, is wildly jealous of her rival. Things become more complicated for Paco by Luisa’s shady business dealings with Minuta and Gordo, members of a gang of swindlers whom she owes money. They have threatened her life, and Paco, attempting to aid his lover, suggests that he get the money by swindling Trini of her savings. Luisa would prefer that they simply kill Trini, but proposes that Paco should marry Trini, then steal her savings and run away with Luisa. Paco uneasily agrees.\n\nThe plan is for Paco to propose marriage to Trini and bring her to the provincial city of Aranda del Duero where they have planned to purchase a bar. Under that pretense, Paco and Trini leave Madrid. Luisa follows them, unsure of Paco’s resolve. While Trini is asleep, Paco steals the money from her handbag. He offers it to Luisa but pulls out of their plan to flee together. Luisa, very upset, tells him he's botched the plan, and when he tells her to wait and, \"Things will be okay,\" she excitedly utters, \"Kill her!\", and walks away, tossing the money at her feet – it is Paco she wants. Paco retrieves the money, and, driven by guilt, he returns to Trini to explain the situation. After the disappearance of the money, Trini realized the fraud and understands that her love for Paco is doomed. When Paco comes back to the hotel room and confesses the plan, Trini locks herself in the bathroom and attempts to commit suicide using Paco's razor. She is thwarted by Paco breaking the window and snatching the razor from her. Later, as the two sit in the rain on a bench in front of the cathedral of the town, Trini refuses to forgive Paco, and tells him she prefers death to abandonment. Thwarted in her attempt to cut her own wrist with Paco’s razor, she begs him to kill her since that is what he really wants. He does so, then rushes to the train station to prevent Luisa from leaving. Placing his bloody hands on her compartment window, signaling to Luisa that the mission has been accomplished, she gets off the moving train. The couple embraces passionately on the platform as the train pulls out. A title informs viewers that the police captured the pair three days later.",
  "synopsis": null
}