{
  "imdb_id": "tt4636022",
  "tmdb_id": "336053",
  "douban_id": null,
  "title": "The Shameless (2015)",
  "genres": [
    "Crime",
    "Drama"
  ],
  "country": "South Korea",
  "version": [
    {
      "runtime": "118 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm0644900",
      "name": "Seung-uk Oh"
    }
  ],
  "writer": [
    {
      "id": "nm0644900",
      "name": "Seung-uk Oh",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0161133",
      "name": "Do-yeon Jeon",
      "character": "Kim Hye-kyung"
    },
    {
      "id": "nm6094043",
      "name": "Seung-Hyeon Ji",
      "character": "Shoppingmall host"
    },
    {
      "id": "nm2339825",
      "name": "Nam-gil Kim",
      "character": "Jung Jae-gon"
    },
    {
      "id": "nm3663864",
      "name": "Sung-woong Park",
      "character": "Park Joon-gil       (as Sung Woong Park)"
    }
  ],
  "overview": "Kim Hye-Kyung (Jeon Do-Yeon) works at bar. She waits for her boyfriend (Park Sung-Woong) who killed another person and then fled. Jung Jae-Gon (Kim Nam-Gil) is a detective. He approaches Hye-Kyung to catch her boyfriend.",
  "storyline": "In order to capture a mob enforcer, homicide detective Jung befriends his girlfriend, Hye-kyung, only to fall in love with her.",
  "plot": "The police are staking out Park Joon-gil for the murder of Hwang Choong-nam, and jaded detective Jung Jae-gon is being pressured to close the case, particularly by his former superior Moon Ki-beom, who lost his badge for corruption. Joon-gil was once the mob enforcer for Jay Investment, but had fallen out of favor when he embezzled and stole the heart of Kim Hye-kyung, the girlfriend of the company's vice president Park Jong-ho. Jay Investment representative Min Young-ki approaches Jae-gon and offers him US$5,000 to ensure that Joon-gil is maimed during the arrest as payback. Jae-gon reluctantly agrees, but a botched arrest sends Joon-gil on the run, and Jae-gon decides the best way to find him again is by sticking with Hye-kyung, hoping she will lead him to the fugitive. Hye-kyung now works as a bar hostess to pay off her substantial debt to Jong-ho, and Jae-gon threatens his way into an undercover job as a floor manager at the nightclub she works at. Introducing himself as Joon-gil's former cellmate Lee Young-joon, Jae-gon begins to spend time with the suspicious Hye-kyung and gradually wins her trust. But when Joon-gil returns asking Hye-kyung for money for a potential deal, Jae-gon's newfound feelings of love and jealousy rise to the surface.",
  "synopsis": null
}