{
  "imdb_id": "tt4692226",
  "tmdb_id": "364515",
  "douban_id": null,
  "title": "He Hated Pigeons (2015)",
  "genres": [
    "Drama"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "80 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm0893116",
      "name": "Ingrid Veninger"
    }
  ],
  "writer": [
    {
      "id": "nm0893116",
      "name": "Ingrid Veninger",
      "description": "writer"
    },
    {
      "id": "nm0893116",
      "name": "Ingrid Veninger",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm7261794",
      "name": "Pedro Fontaine",
      "character": "Elias"
    },
    {
      "id": "nm1778970",
      "name": "Cristobal Tapia Montt",
      "character": "Sebastien"
    },
    {
      "id": "nm0893116",
      "name": "Ingrid Veninger",
      "character": "Traveler"
    },
    {
      "id": "nm7360895",
      "name": "Vanessa Ramos",
      "character": "Cynthia"
    },
    {
      "id": "nm7360896",
      "name": "Leonardo Fini",
      "character": "Hitchhiker"
    }
  ],
  "overview": "Love is everything with a young man journey's from the north to south of Chile to fulfill a promise.",
  "storyline": "Love is everything when a young man journey's from the north to the south of Chile to fulfill a promise.",
  "plot": "The film takes place in the autumn of 1946, in a small provincial town in western Kazakhstan. A local teenager Ivan Naydenov (Vyacheslav Ilyushchenko) nicknamed as \"The Gray\", is a passionate pigeon enthusiast who recklessly risking his life manages to catch a white dove which has unexpectedly appeared in the city. Other pigeon hobbyists of the city find out of The Gray's spoil and the dove hunting begins. Soon the thieves kidnap the pigeon from The Gray's pen at night. The Gray begins to search for and find the dove from the local \"pigeon authority\" – Kolya the Gypsy (Vladimir Steklov). The Gray cunningly recaptures his prey and realizing that the dove is still doomed releases it to freedom. All the events of the film unfold against the backdrop of a meager post-war life of the inhabitants of the town - a place of exile and evacuation.",
  "synopsis": null
}