{
  "imdb_id": "tt4670016",
  "tmdb_id": "363111",
  "douban_id": null,
  "title": "Wolves at the Door (2016)",
  "genres": [
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "73 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.4,
  "director": [
    {
      "id": "nm0502954",
      "name": "John R. Leonetti"
    }
  ],
  "writer": [
    {
      "id": "nm2477891",
      "name": "Gary Dauberman",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1556320",
      "name": "Katie Cassidy",
      "character": "Sharon"
    },
    {
      "id": "nm4464857",
      "name": "Elizabeth Henstridge",
      "character": "Abigail Folger"
    },
    {
      "id": "nm0968405",
      "name": "Adam Campbell",
      "character": "Wojciech Frykowski"
    },
    {
      "id": "nm0279702",
      "name": "Miles Fisher",
      "character": "Jay Sebring"
    },
    {
      "id": "nm0611889",
      "name": "Chris Mulkey",
      "character": "John"
    },
    {
      "id": "nm0434223",
      "name": "Jane Kaczmarek",
      "character": "Mary"
    },
    {
      "id": "nm1638022",
      "name": "Spencer Daniels",
      "character": "William"
    },
    {
      "id": "nm4544836",
      "name": "Lucas Adams",
      "character": "Steven"
    },
    {
      "id": "nm1426686",
      "name": "Eric Ladin",
      "character": "Detective Clarkin"
    },
    {
      "id": "nm0260224",
      "name": "Arlen Escarpeta",
      "character": "Officer"
    }
  ],
  "overview": "Loosely based on the Manson family murders in the late-1960's.",
  "storyline": "Four friends gather at an elegant home during the Summer of Love, 1969. Unbeknownst to them, deadly visitors are waiting outside. What begins as a simple farewell party turns to a night of primal terror. The intruders stalk and torment the four, who struggle for their lives against what appears to be an attack by a Manson Family type group.",
  "plot": "In 1924, Roxie Hart sees star Velma Kelly perform (\"All That Jazz\") at a Chicago theater. Wanting stardom for herself, she begins an affair with Fred Casely, who claims to know the manager. After the show, Velma is arrested for killing her husband Charlie and sister Veronica, who were in bed together. A month later, Casely admits to Roxie that he has no showbiz connections and just wanted her body. Enraged, she shoots him dead. She convinces her husband, Amos, to take the blame, telling him she killed a burglar in self-defence. As Amos confesses to the detective, Roxie fantasizes that she is singing a song devoted to her husband (\"Funny Honey\"). However, when the detective brings up evidence that Roxie and Casely were having an affair, Amos recants; Roxie furiously admits what really happened and is arrested. Ambitious District Attorney Harrison announces he will seek the death penalty.\n\nAt Cook County Jail, Roxie is sent to Murderer's Row, under the care of the corrupt matron \"Mama\" Morton (\"When You're Good to Mama\"). Roxie meets her idol Velma, but her friendship is rudely rebuffed. She learns the backstories of the other women there, including Velma Kelly (\"Cell Block Tango\"). On Morton's advice, Roxie engages Velma's lawyer, the brilliant Billy Flynn (\"All I Care About\"). Flynn and Roxie manipulate the press, reinventing Roxie's identity as an originally virtuous woman turned bad by the fast life of the city; she claims she had the affair with Casely because Amos was always working, but repented and dumped him for Amos, and Casely jealously attacked her (\"We Both Reached for the Gun\"). The press believe the story; praised by the public as a tragic heroine, Roxie becomes an overnight sensation (\"Roxie\"). Velma, unhappy at losing the public's attention, tries to convince Roxie to join her act, replacing the sister that she murdered (\"I Can't Do It Alone\"), but Roxie, now the more popular of the two rivals, snubs her just as Velma originally did.\n\nMeanwhile, Kitty Baxter, a wealthy heiress, is arrested for murdering her husband and his two lovers, and the press and Flynn pay more attention to her. To Velma's surprise, Roxie quickly steals back the fame by claiming to be pregnant. Amos is ignored by the press (\"Mister Cellophane\"), and Flynn, to create more sympathy for Roxie, convinces him that the child is Casely's, and that he should divorce Roxie in the middle of her predicament. Roxie over-confidently fires Flynn, believing she can now win on her own. However, when Katalin Helinszki, a Hungarian woman from Murderess' Row is hanged, she realizes the gravity of the situation and rehires Flynn.\n\nRoxie's trial begins, and Billy turns it into a media spectacle (\"Razzle Dazzle\") with the help of the sensationalist newspaper reporters and radio personality Mary Sunshine. Billy discredits witnesses, manipulates evidence, and even stages a public reconciliation between Amos and Roxie when she says the child is his. The trial seems to be going Roxie's way until Velma appears with Roxie's diary: she reads incriminating entries in exchange for amnesty in her own case. Billy discredits the diary, implying that Harrison was the one who planted the evidence (\"A Tap Dance\"). Roxie is acquitted, but her fame is eclpsed moments later when another woman shoots her husband just outside the courthouse. Flynn tells her to accept it, and admits that he tampered with her diary himself, in order to incriminate the district attorney and also free two clients at once. Amos remains loyal and excited to be a father, but Roxie cruelly rejects him, revealing that she is not pregnant, and he finally leaves her.\n\nRoxie does become a vaudeville performer, but is very unsuccessful (\"Nowadays\"). Velma is just as unsuccessful, and again approaches Roxie to suggest performing together: a double act consisting of two murderers. Roxie initially refuses, but later accepts when Velma points out that they can perform together despite their resentment for each other. The two stage a spectacular performance that earns them the love of the audience and the press (\"Nowadays / Hot Honey Rag\"). The film concludes with Roxie and Velma receiving a standing ovation from an enthusiastic audience, and proclaiming that, \"We couldn't have done it without you\".",
  "synopsis": "The movie begins with an older married couple sleeping in bed and are awaken by knocks on their doors and windows. The husband goes downstairs to investigate but finds nothing. As he gets back into bed, he hears a crash downstairs. He sees the shadow of a man saying \"Little Pig\". As he runs back to his room to his wife, he locks the door. The intruders shake and band on the door until it opens. It cuts to a police officer entering the house.The movie then goes to 4 friends at a restaurant celebrating their friend Abigail's birthday and going away party. The friends, Sharon, Jay, Wojciech, and Abigail return to Sharon's house. A pregnant Sharon calls her husband from the nursery, but suddenly the line goes dead. Meanwhile, someone is visiting the guest house to sell the occupant a stereo. As he leaves, the gate in the driveway doesn't work. He gets out and opens the gate, but his vehicle turns off unexpectedly. As he returns to his vehicle, he turns his headlights on to see a man standing in front of his truck and a woman standing behind his truck. He is then pulled out of his truck.Wojciech goes outside to have a cigarette. As he approaches the truck in the driveway, he sees a man slumped over. He asked the man if he is alright, but the man lunges at him and chases him to the front door which is locked. Later, we see the front door say \"Pig\" written in blood.Sharon and Abigail are talking in her bedroom when they hear Jay screaming and moaning from the living room couch. When they investigate, they discover he has been stabbed to death. They try to hide throughout the house as the intruders stalk them. Sharon and Wojciech are seen dragged through the hallway as Abigail escapes the house. She tries to get help from the man living in the guesthouse, but he has his headphones on and can't hear her. One of the intruders catches Abigail and carries her to the house.The intruders continue to torture and torment the 3 remaining friends as they hunt them down one by one.At the end of the movie, it shows interviews of Manson and some of the attackers involved in this story."
}