{
  "imdb_id": "tt4684028",
  "tmdb_id": "347897",
  "douban_id": null,
  "title": "Guddu Rangeela (2015)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "124 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.3,
  "director": [
    {
      "id": "nm1378015",
      "name": "Subhash Kapoor"
    }
  ],
  "writer": [
    {
      "id": "nm1378015",
      "name": "Subhash Kapoor",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0451174",
      "name": "Arshad Warsi",
      "character": "Rangeela"
    },
    {
      "id": "nm2815326",
      "name": "Amit Sadh",
      "character": "Guddu"
    },
    {
      "id": "nm0747172",
      "name": "Ronit Roy",
      "character": "Billu Pahalwan"
    },
    {
      "id": "nm2390814",
      "name": "Aditi Rao Hydari",
      "character": "Baby"
    },
    {
      "id": "nm5546451",
      "name": "Shriswara",
      "character": "Bibiji"
    },
    {
      "id": "nm0080349",
      "name": "Dibyendu Bhattacharya",
      "character": "Bangali"
    },
    {
      "id": "nm1748072",
      "name": "Amit Sial",
      "character": "Ajay SIngh"
    },
    {
      "id": "nm2240044",
      "name": "Brijendra Kala",
      "character": "Chunilal"
    },
    {
      "id": "nm0348491",
      "name": "Rajiv Gupta",
      "character": "Gulab Singh"
    },
    {
      "id": "nm6298111",
      "name": "Sandeep Goyat",
      "character": "Chotey"
    },
    {
      "id": "nm2119028",
      "name": "Vishal Om Prakash",
      "character": ""
    },
    {
      "id": "nm0768297",
      "name": "Virendra Saxena",
      "character": "Lawyer Gupta       (as Veerendra Saxena)"
    }
  ],
  "overview": "Rangeela (Arshad Warsi) and Guddu (Amit Sadh) are from North India they both are cousins. They play orchestra. But they want to make money from any way. One day the information provided to local gangsters about the richest families in town, has fetched them an easy and safe way to subsist without getting their hands dirty in the bargain. So they kidnap Baby (Aditi Rao Hydari). They were supposed to get 10 crore as kidnapping amount. After kidnapping her they have to face a lot of problem. But suddenly Billu Pahalwan (Ronit Roy) comes in action. He is politician and he changes the game of Guddu Rangeela. Then story takes an interesting twist.",
  "storyline": "Based in the dusty plains of North India, Guddu Rangeela is a story about two cousins trying to make ends meet in the crime infested surroundings. Orchestra singers by day and informants by night, acquiring measly pay offs from the information provided to local gangsters about the richest families in town, has fetched them an easy and safe way to subsist without getting their hands dirty in the bargain. Although cousins by blood, both are very much unlike each other. The love hate rapport of the two comes to be seen through the many dangerously funny circumstances that they are met with and their impromptu methods of saving their skin each time. Having suffered a tragic past at the hands of the gang lord turned politician Billo; the antagonist of the tale; both are discreetly entangled in a 10 year old legal battle against him through Gupta, an honest advocate fighting on their behalf. While the unorthodox and impulsive Guddu aspires to grow out of their hand to mouth way of life by ...",
  "plot": "Rangeela (Arshad Warsi) and Guddu (Amit Sadh) are from North India they both are cousins. They play orchestra. But they want to make money from any way. One day the information provided to local gangsters about the richest families in town, has fetched them an easy and safe way to subsist without getting their hands dirty in the bargain. So they kidnap Baby (Aditi Rao Hydari). They were supposed to get 10 lakh as kidnapping amount. After kidnapping her they have to face a lot of problem. But suddenly Billu Pahalwan (Ronit Roy) comes in action. He is a politician and he changes the game of Guddu Rangeela. Then story takes an interesting twist.",
  "synopsis": null
}