{
  "imdb_id": "tt4665264",
  "tmdb_id": "366515",
  "douban_id": null,
  "title": "The Library Book (2015)",
  "genres": [
    "Short",
    "Drama"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "8 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm7309518",
      "name": "Travis Calvert"
    }
  ],
  "writer": [
    {
      "id": "nm7309518",
      "name": "Travis Calvert",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0004778",
      "name": "Adrien Brody",
      "character": "Desmond"
    },
    {
      "id": "nm2303263",
      "name": "Cheryl Texiera",
      "character": "Sarah"
    },
    {
      "id": "nm2519517",
      "name": "Bjørn Alexander",
      "character": "Man Child"
    },
    {
      "id": "nm0712141",
      "name": "Nina Rausch",
      "character": "Girlfriend"
    }
  ],
  "overview": "A stranger returns an overdue book to his home library.",
  "storyline": "Desmond, a cryptic and soft-spoken stranger, enters the local library which is on the brink of shutting down, intent on returning an eight-year-overdue book. Before long, Sarah, a conscientious librarian, and Desmond engage in a sincere and meaningful conversation, discussing life's strange and marvellous itineraries. However, can they imagine the outcome?",
  "plot": "The Lightning Thief is narrated in the first person by Percy Jackson, a 12-year-old boy with dyslexia and ADHD living in New York City. During a class field trip to the Metropolitan Museum of Art to see a Greco-Roman exhibit, he stands up to a bully picking on his friend Grover Underwood and \"pushes\" her into a nearby fountain. One of the chaperoning teachers, an algebra teacher named Mrs. Dodds, takes him away from the other students, presumably to give him his punishment. Instead, Percy is shocked when she transforms into one of the three Furies of Greek myth and attacks him. The other chaperone, a Latin teacher named Mr. Brunner, suddenly appears and throws Percy a pen that changes into a strange sword. Percy instinctively swings at the monster in front of him, and she turns to dust and disappears. When Percy returns to the rest of the students, he discovers that not only do they have no idea what happened inside the museum, they also do not remember having a teacher named Mrs. Dodds. Over the course of the school year, Percy almost convinces himself that it was all a hallucination, except that his friend Grover seems to be hiding something whenever the subject is brought up. A few days before the end of school he overhears Grover and Mr. Brunner talking about him, Mrs. Dodds, and a stolen item of great importance—which only serves to confirm his suspicions.\n\nPercy and his mother, Sally, go on a summer trip to the beach. During a terrible storm, the two are awakened by a surprise visit from Grover—who Percy suddenly learns is actually not a human teenager, but instead a young satyr. Grover tells them they are in danger, and the three drive to a mysterious summer camp. Upon arrival, they are attacked by the Minotaur. In the ensuing fight, the Minotaur knocks out Grover and grabs Mrs. Jackson, who inexplicably dissolves into a blinding flash of gold light. Believing he has just lost his mother forever, Percy manages to break off one of the Minotaur's horns and kills the beast, then forces himself to drag the unconscious Grover over the property line and up to a farmhouse. He wakes up three days later and learns he is at a place called Camp Half-Blood. Percy then learns that he is a demigod: the son of a human and a Greek god.\n\nPercy settles into camp life and meets several other demigods, including: Luke Castellan, a son of Hermes; Annabeth Chase, a daughter of Athena; and Clarisse La Rue, a daughter of Ares. Several strange incidents begin to reveal his powers as a demigod. After Percy is attacked by a monster which shouldn't have gotten through the camp's borders, Percy is publicly claimed by his father, the god Poseidon.\n\nA few days later, Mr. Brunner (who is really Chiron the centaur) summons Percy to the Big House and tells him how the three eldest male gods (Poseidon, Zeus, and Hades) swore an oath not to have children more than 70 years ago; Percy represents a violation of that oath merely by being alive. This, coupled with the fact that King Zeus's master lightning bolt has recently been stolen, has bred much suspicion between the gods, and Percy is tasked with locating that bolt before an all-out war may break out. Percy chooses Annabeth and Grover to accompany him on a quest to the realm of Hades, the most likely culprit.\n\nAfter traveling across the country to Los Angeles and defeating several mythological monsters (including Medusa and the Chimera) the three find Hades, who reveals that his Helm of Darkness (his symbol of power) has been stolen too. Hades accuses Percy of stealing his helm and threatens to kill Percy and his mother (who has actually been a hostage in his realm the whole time) and release all the dead back into the real world unless it is returned. Percy and his friends manage to escape back to L.A. and there discover that the god Ares has been manipulating them and possesses all the missing items. Percy challenges Ares to a duel, wins, and gives the Helm of Darkness to the reformed Fury he knows as Mrs. Dodds; Hades then realizes that Percy was not the thief and returns Mrs. Jackson to their apartment in New York.\n\nPercy takes the master bolt back to Zeus, who rewards the young hero by not killing him as he should because of Poseidon's broken oath. Percy returns to camp a hero and enjoys the rest of his summer there. On the last day of camp, however, he goes into the woods to hang out with Luke Castellan, who then turns on him. Luke reveals himself to be the real thief of the Helm and master bolt, working on the orders of Kronos, the Lord of the Titans. Kronos also manipulated power-hungry Ares into taking part in the scheme. Percy can not believe that Luke, an all-around nice guy, would do such a thing, and so Luke explains his belief that the gods are irresponsible and poor leaders who must be overthrown. He offers Percy the chance to join him, and when the other demigod does not, Luke tries to kill Percy with a poisonous scorpion. Percy manages to kill it, but is badly poisoned and nearly dies. When he has recovered, Percy is given the choice of whether to return home for the school year or stay at camp year round. After much thought Percy decides to spend the school year with his mother, as it is the first time he won't have to go to boarding school, even though it will be more dangerous for him.\nProphecy\n\nThe prophecy given by the Oracle before Percy's quest reads:\n\nYou shall go west, and face the god who has turned.\n\nYou shall find what was stolen, and see it safely returned.\n\nYou shall be betrayed by one who calls you a friend.\n\nAnd you shall fail to save what matters most, in the end.\nMeaning\nAt first, it is assumed that Percy had to travel west from New York to L.A. to confront Hades, though it is later revealed that he really had to meet Ares, in Denver.Percy locates both Zeus's master bolt, which was always known to be missing, and also Hades's Helm.Luke betrays Percy immediately after treating him like a friend.Percy, forced to leave his mother behind in the Underworld, knows his quest is not complete, and also does not help his mother to rid herself of her abusive husband Gabe Ugliano. Sally is saved in the first case by Hades's choice to free her after he receives his Helm, and in the second, by her own choice to stand up to \"Smelly Gabe\".",
  "synopsis": null
}