{
  "imdb_id": "tt4776998",
  "tmdb_id": "354859",
  "douban_id": null,
  "title": "The Promise (2016)",
  "genres": [
    "Drama",
    "History"
  ],
  "country": "Spain",
  "version": [
    {
      "runtime": "133 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.1,
  "director": [
    {
      "id": "nm0313623",
      "name": "Terry George"
    }
  ],
  "writer": [
    {
      "id": "nm0313623",
      "name": "Terry George",
      "description": "written by"
    },
    {
      "id": "nm0842523",
      "name": "Robin Swicord",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm1209966",
      "name": "Oscar Isaac",
      "character": "Mikael Boghosian"
    },
    {
      "id": "nm3114649",
      "name": "Charlotte Le Bon",
      "character": "Ana Khesarian"
    },
    {
      "id": "nm0000288",
      "name": "Christian Bale",
      "character": "Chris Myers"
    },
    {
      "id": "nm0319843",
      "name": "Daniel Giménez Cacho",
      "character": "Reverend Dikran Antreassian"
    },
    {
      "id": "nm0013037",
      "name": "Shohreh Aghdashloo",
      "character": "Marta Boghosian"
    },
    {
      "id": "nm3092471",
      "name": "Marwan Kenzari",
      "character": "Emre Ogan"
    },
    {
      "id": "nm1494168",
      "name": "Angela Sarafyan",
      "character": "Maral"
    },
    {
      "id": "nm0390903",
      "name": "Tom Hollander",
      "character": "Garin"
    },
    {
      "id": "nm1485637",
      "name": "Numan Acar",
      "character": "Mustafa"
    },
    {
      "id": "nm0620981",
      "name": "Igal Naor",
      "character": "Mesrob"
    },
    {
      "id": "nm8390335",
      "name": "Milene Mayer",
      "character": "Yeva"
    },
    {
      "id": "nm1268748",
      "name": "Tamer Hassan",
      "character": "Faruk Pasha"
    },
    {
      "id": "nm0097304",
      "name": "Alicia Borrachero",
      "character": "Lena"
    },
    {
      "id": "nm0284272",
      "name": "Abel Folk",
      "character": "Harut"
    },
    {
      "id": "nm0000606",
      "name": "Jean Reno",
      "character": "Admiral Fournet"
    },
    {
      "id": "nm0000342",
      "name": "James Cromwell",
      "character": "Ambassador Morgenthau"
    },
    {
      "id": "nm0539616",
      "name": "Kevork Malikyan",
      "character": "Vartan Boghosian"
    },
    {
      "id": "nm8933390",
      "name": "Lucía Zorrilla",
      "character": "Tamar"
    },
    {
      "id": "nm2215706",
      "name": "Roman Mitichyan",
      "character": "Van"
    },
    {
      "id": "nm8933391",
      "name": "Carlos Miranda",
      "character": "Aaron Village Elder"
    },
    {
      "id": "nm1973209",
      "name": "Armin Amiri",
      "character": "Captain Ali"
    },
    {
      "id": "nm1270132",
      "name": "Stewart Scudamore",
      "character": "Ismet Ogan"
    },
    {
      "id": "nm0850329",
      "name": "Andrew Tarbet",
      "character": "Pastor Merril"
    },
    {
      "id": "nm0409691",
      "name": "Aharon Ipalé",
      "character": "Dr. Nazim"
    },
    {
      "id": "nm8933392",
      "name": "Masis Kouyoumdjian",
      "character": "Armenian Priest       (as Father Masis Kouyoumdjian)"
    },
    {
      "id": "nm8933393",
      "name": "Shnorhk Sargsyan",
      "character": "Komitas       (as Father Shnorhk Sargsyan)"
    },
    {
      "id": "nm3801140",
      "name": "Abdelali El Aziz",
      "character": "Turkish Car Driver"
    },
    {
      "id": "nm1208035",
      "name": "Aaron Neil",
      "character": "Talaat Pasha"
    },
    {
      "id": "nm1928459",
      "name": "James Chanos",
      "character": "General Zyniker"
    },
    {
      "id": "nm5716629",
      "name": "Anthony Rotsa",
      "character": "Ahmet the Student"
    },
    {
      "id": "nm1015968",
      "name": "Paul Portelli",
      "character": "Angry Mob Man #1       (as Portelli Paul)"
    },
    {
      "id": "nm7708314",
      "name": "Jean Marc Valente",
      "character": "Angry Mob Man #2"
    },
    {
      "id": "nm1253636",
      "name": "Julián Villagrán",
      "character": "Armenian Soldier"
    },
    {
      "id": "nm4314406",
      "name": "Juanan Moreno",
      "character": "Armenian Laborer"
    },
    {
      "id": "nm0434879",
      "name": "Marco Khan",
      "character": "Burly Nightwatchman"
    },
    {
      "id": "nm4041866",
      "name": "Stephen Buhagiar",
      "character": "Ferry Porter"
    },
    {
      "id": "nm1504599",
      "name": "Nacho Aldeguer",
      "character": "Gulhane Party Guest"
    },
    {
      "id": "nm3872225",
      "name": "Juan Portillo",
      "character": "Injured Armenian"
    },
    {
      "id": "nm0028487",
      "name": "Simón Andreu",
      "character": "Old Peasant Man       (as Simon Andreu)"
    },
    {
      "id": "nm3873456",
      "name": "Mariona Casanovas",
      "character": "Old Peasant Woman"
    },
    {
      "id": "nm0194717",
      "name": "Pau Cólera",
      "character": "Railway Sergeant       (as Pau Colera)"
    },
    {
      "id": "nm8933394",
      "name": "Pedro Reyes",
      "character": "Senior Conscription Officer"
    },
    {
      "id": "nm6119388",
      "name": "David Lifschitz",
      "character": "Conscription Officer"
    },
    {
      "id": "nm0649101",
      "name": "Mario Opinato",
      "character": "Armenian Hotel Manager"
    },
    {
      "id": "nm6904617",
      "name": "Rick Zingale",
      "character": "Turkish Merchant in Bazaar"
    },
    {
      "id": "nm8933395",
      "name": "Nicolas Lori",
      "character": "University Lecturer"
    },
    {
      "id": "nm2257077",
      "name": "Carlos Olalla",
      "character": "Surgeon"
    },
    {
      "id": "nm8906921",
      "name": "Joe Depasquale",
      "character": "Constantinople Night Watchman"
    },
    {
      "id": "nm0846004",
      "name": "Vic Tablian",
      "character": "Cattle Car Old Man"
    },
    {
      "id": "nm0622958",
      "name": "Marta Navarro",
      "character": "Pera Belly Dancer"
    },
    {
      "id": "nm8933396",
      "name": "Enya Dunne",
      "character": "Turkish Little Girl"
    },
    {
      "id": "nm1687073",
      "name": "Azzdine Benaji",
      "character": "Turkish Boy Patient"
    },
    {
      "id": "nm2523877",
      "name": "Alain Hernández",
      "character": "Turkish Telegraph Officer       (as Alain Hernandez)"
    },
    {
      "id": "nm4880926",
      "name": "Said Taibi",
      "character": "Turkish Officer at Party #1"
    },
    {
      "id": "nm4077107",
      "name": "David Fernández Fabu",
      "character": "Turkish Officer at Party #2"
    },
    {
      "id": "nm2343464",
      "name": "Markus Oberhauser",
      "character": "German Aide-De-Camp"
    },
    {
      "id": "nm8933397",
      "name": "Alex Van Der Meeberg",
      "character": "German Officer at Party"
    },
    {
      "id": "nm3378146",
      "name": "Ayoub El Hilali",
      "character": "Ahmet Companion #1"
    },
    {
      "id": "nm3462782",
      "name": "Jonás Beramí",
      "character": "Ahmet Companion #2       (as Jonas Berami)"
    },
    {
      "id": "nm0130429",
      "name": "Luis Callejo",
      "character": "Turkish Intelligence Officer"
    },
    {
      "id": "nm8933398",
      "name": "Gayane Asilbekyan",
      "character": "Fearful Armenian Woman"
    },
    {
      "id": "nm0816435",
      "name": "Ozman Sirgood",
      "character": "Deputy Governor Mazhar"
    },
    {
      "id": "nm8933399",
      "name": "Mariette Matoosian",
      "character": "Harut's Wife"
    },
    {
      "id": "nm7452984",
      "name": "Jonathan Pyatt",
      "character": "Morgenthau's Aide"
    },
    {
      "id": "nm0539606",
      "name": "Ara Malikian",
      "character": "Wedding Violinist"
    },
    {
      "id": "nm8933400",
      "name": "Aren Shaheenian",
      "character": "Funeral Priest       (as Father Aren Shaheenian)"
    },
    {
      "id": "nm8933401",
      "name": "Paul Roig",
      "character": "Lookout Kid"
    },
    {
      "id": "nm6946571",
      "name": "Teresa Abarca",
      "character": "Nightclub Dancer"
    },
    {
      "id": "nm8933402",
      "name": "Derek Esrailian",
      "character": "Armenian Boy at Betrothal #1"
    },
    {
      "id": "nm8933403",
      "name": "Andrew Esrailian",
      "character": "Armenian Boy at Betrothal #2"
    },
    {
      "id": "nm1221863",
      "name": "Michael Stahl-David",
      "character": "Brad"
    },
    {
      "id": "nm6487627",
      "name": "Celine Dayan-Bonilla",
      "character": "Maid of Honor"
    },
    {
      "id": "nm4866443",
      "name": "Louis Branco",
      "character": "Older Orphan"
    },
    {
      "id": "nm0217340",
      "name": "Sandy Dell",
      "character": "Mother of the Groom"
    },
    {
      "id": "nm6712975",
      "name": "Alfredo Montez",
      "character": "Older Orphan       (as John Ressosalfredo Montez)"
    },
    {
      "id": "nm8933404",
      "name": "Stefan Alexander",
      "character": "Older Orphan"
    },
    {
      "id": "nm4951854",
      "name": "Jason Carubia",
      "character": "Older Orphan"
    },
    {
      "id": "nm8200052",
      "name": "Christophe Morabito",
      "character": "Older Orphan"
    },
    {
      "id": "nm8678428",
      "name": "Dzmitry Patuk",
      "character": "Older Orphan"
    },
    {
      "id": "nm8933405",
      "name": "Rafael Reyes",
      "character": "Older Orphan"
    },
    {
      "id": "nm8933406",
      "name": "Ariana Tirelli",
      "character": "Older Orphan"
    },
    {
      "id": "nm7429052",
      "name": "Amanda Tenen",
      "character": "Older Orphan       (as Amanda Tenenzapf)"
    },
    {
      "id": "nm7055008",
      "name": "Christine Duke",
      "character": "Older Orphan"
    },
    {
      "id": "nm7911376",
      "name": "Esmeralda Frias",
      "character": "Older Orphan"
    },
    {
      "id": "nm4724792",
      "name": "Christina Carroll",
      "character": "Older Orphan"
    },
    {
      "id": "nm8242238",
      "name": "Alana Kyriak",
      "character": "Older Orphan"
    },
    {
      "id": "nm6242816",
      "name": "John Ressos",
      "character": "Older Orphan"
    }
  ],
  "overview": "Set during the last days of the Ottoman Empire, The Promise follows a love triangle between Michael, a brilliant medical student, the beautiful and sophisticated artist Ana, and Chris - a renowned American journalist based in Paris.",
  "storyline": "The film tells the story of Michael (Oscar Isaac), a young Armenian who dreams of studying medicine. When he travels to Constantinople to study, he meets Armenian Ana (Charlotte Le Bon) and falls in love with her, although she dates the American photographer Chris (Christian Bale), sent to Turkey to record the first genocide of the 20th century when the Turks exterminated the Armenian minority. A love triangle settles amidst the horrors of war.",
  "plot": null,
  "synopsis": "In the year 1915 during the First World War, Michael (Oscar Issac), an Armenian, who is naïve yet kind-hearted, arrives in Constantinople and meets his uncle to tell him he is going to medical school. His uncle has a wife and two daughters. The daughters have a dance instructor, Ana, (Charlotte Le Bon). Ana's father was a famous violinist who took Ana with him after her mother died when Ana was 10, to tour Europe until he left her in Paris to study at the Sorbonne. Because he was so deep in debt, he killed himself. Michael starts medical school and makes a friend with a Turk, Emre, (Marwan Kenzari) whose father is a Turkish official who is making him either go to medical school or join the army. Emre goes to medical school, even though he is ill-prepared for it (he faints during an anatomy lesson when he cuts into the bowels of a corpse and poop flies onto him).Ana is being courted by an American, Chris Myers (Christian Bale), who is a journalist that works for the Associated Press. Ana, Chris, Emre, and Michael go clubbing. Ana is nice to Michael, but the two don't seem to be in love, they just like each other.Later, Ana, Chris, and Michael go to a luncheon where the Germans give the Turks warships. Chris is a bit drunk and insults both the Germans and the Turks to their faces. Ana runs off and later tells Chris that he embarrassed her. He promises not to get drunk anymore.Michael's uncle thinks Ana, and he make a good match. Michael says he cant marry Ana because he has a fiancée in his hometown. He has her dowry that he is using to go the medical school. His uncle offers to repay the dowry plus 200 more so Michael can marry Ana. Michael refuses since he made a promise to marry his fiancée.War is declared. The Turks almost get Michael to enlist into the army, but Emre, who gets a medical student exemption, pays a Turk to give Michael an exemption. Emre's father gets angry at Emre for saving his friend and warns him not to help anymore.Turks start rounding up Armenian intelligencia, and rich men in Constantinople; Chris goes to the countryside in a car with a guide, and takes pictures of a destroyed Armenian village. The men are hanged, and after leaving the village, he finds women being lead away and sees a Turk shoot an Armenian woman who had fallen down in the forced march. The Turks (on horses) see Chris and chase him, but he gets away.Michael and Ana go to Chris for help for his uncle, but he is busy reporting the Armenian massacre. They try to get Michael's uncle out of the Turks clutches with his uncles money using Emer as an emissary. Emer's father disapproves of this and sends Emer into the army to restore his honor. We don't see the uncle again. Michael is arrested by the Turks. Michael's aunt and her two girls are taken in by Ana and Chris.Six months later we see Michael in a forced labor gang, building a railroad for the Turks. The Turks kill a prisoner with a broken leg that Michael and another prisoner (a former clown) were trying to help. After killing the man, the Turkish guard wanted the two to say, \"Thank you\".Later that night, the former clown entertains some of the prisoners with a pantomime show, making them laugh. The next day has Michael handing a case of dynamite to the former clown. The case is sweating (leaking nitroglycerin, making it very volatile) so Michael warns him. The former clown goes up to a guard, tells him thank you and throws the box of dynamite, blowing up a many of the Turkish guards. Michael escapes and is walking on the train tracks at night when a train comes. He jumps on the train and finds there were elderly prisoners trapped on board. He tries to break them out but falls off into a river and washes up on a farm of an Armenian couple who try to find out if he has seen their sons who were taking away by the Turks. They give him a mule to go to his mother and father. He arrives at night and scares his family, but they welcome him and tell him the young men were all taken away by the Turks. In the morning his future father-in-law and his fiancée, Maral, show up and they make plans for Michael to marry his fiancée and hide in the mountains in a cabin. Michael tells his mother he is reluctant to marry since he loves Ana, but his mother tells him to get married, forget Ana. Michael marries Maral, and when she asks, he tells her about how big Constantinople was with so many churches and mosques and lots of items from Britain and France and Russia.Ana, Chris, Michael's aunt and two cousins arrive in a town in Southern Turkey were a Protestant clergyman is running an orphanage. The clergyman sends the orphans secretly to Bagras to another priest so the children can take a boat and escape. The clergyman sends a few orphans at a time. He tells Chris he will send him along so Chris can report it. Chris is also introduced to a Turkish official who is facilitating the orphan rescues and promises not to mention the officials name.Ana, Chris and the aunt and the girls (one girl is named Yeva (Milene Mayer) arrive at Michael's parents house. Michael's mother tells them that Michael is dead. Chris and Eva go back to the orphanage. Michael comes out of his hiding place with his pregnant wife, since she isnt doing too well, and go to his parents. His aunt is surprised that he is alive. Michael finds out from his aunt that the orphans, with Chris and Ana, are going to escape, and Michael doesn't believe his family is safe and wants them to escape too. So he goes to the orphanage by himself and finds Ana. Ana is happy to see him but gets upset that he got married. Chris goes to Ana (after realizing from afar that Ana has feelings for Michael) and she says that after they help Michael and his family escape, she wont see Michael anymore. Michael, Ana, and Chris go with some men and some orphans and are on their way to Bagras when they hear gunshots. Michael and Chris go to investigate and find that the Turks killed the villagers from where Michael is from. They find Michael's dead father and wife. Michael finds his mother is still alive, and Chris finds Yeva, but Turkish cavalrymen find them. Chris leads the Turks away while everyone else runs off. Chris is under arrest. Even though he has credentials showing he is a journalist, the Turkish official interviewing him reads his journal which is unflattering to him, and the official wants the name of the other Turkish official that was helping the orphans. Chris is threatened to be shot, but even with a gun to his head, he refuses to name the other official. The Turkish official then tells Chris he is a spy, no matter what papers from the American Embassy he has.Michael and company encounter the villagers from Bagras who were kicked out of their village. They talk with the priest who tells them that the Turks destroyed all the ships, so there is no escape. The gutsy mayor tells Michael that his group can join them, as they go into the desert.Chris is in jail, and Emer goes to him telling him either sign a confession that invalidates all his work or dies that night. Chris refuses and tells Emer to go to the American Ambassador, who will be able to get him out. Emer tells him that it would be considered treason if he did. But the American Ambassador shows up to the offices of a Turk to demand Chris's release, or it would be a declaration of war. The Turk wants a list of Armenians who have life insurances from American companies. Since the Armenians are dead, with no living relatives, then the life insurance would go to the country of Turkey. The American Ambassador tells him never.Chris gets released and is sent to Malta as he is unwelcomed in Turkey. Emer is shot for treason.Back to Michael, Ana and all, the Mayor of Bagras tell the villagers that he rather stop and fight, even though they have enough to live on in the desert. The villagers think they will be fine in the desert, but Michael tells them of how all the people in his village were massacred, and the Turks will kill them too.The villagers make a stand on a nearby mountain, putting up defenses. A Turkish regiment shows up, but the villagers fight. Michael finds that he cant shot. The Turkish regiment retreats for reinforcements. The villagers go up the mountain. Michael's mother talks with Ana and they bond, but later on the mother dies, and they bury her. While the villagers go up the mountain, a French warship, with Chris on board, go toward the mountain to bomb the Turks. Up on the mountain as the Turks and the villagers fight (the villagers even throwing rocks at the Turks), the French arrive and dispatch French Marines and lifeboats to rescue the villagers. Fighting is intense. Chris arrives and sees how Michael and Ana care for each other (and even kiss). Ana, Yeva, Michael and Chris get in lifeboats and make it toward the French warship, but Turkish artillery hits near the lifeboat with Michael, Ana and Yeva, and Ana and Yeva fall in the water. Michael and Chris try to save Ana and Yeva, but Ana sinks and Michael helplessly find he cant save her, but he saves Yeva.Chris gets on the warship first and waits for Michael, Yeva, and Ana, but when he sees Michael and Yeva he asks for Ana, but Michael only cries.We get voice-over by Michael about how he adopted Yeva, and they move to America with all the orphans that were with them. We learn that Chris died in 1938 in the Spanish Civil War. We see Yeva getting married while America is getting ready for WWII and Michael says that Yeva wish her parents were there but Michael says in his speech that her parents are there and the orphans parents are there watching them.And there is a prescript about how many Armenians were killed by the Turkish Government during that year during the genocide and how that government refuses to acknowledge what they did to the Armenians."
}