{
  "imdb_id": "tt4707756",
  "tmdb_id": "344466",
  "douban_id": null,
  "title": "The World Is Mine (2015)",
  "genres": [
    "Drama"
  ],
  "country": "Romania",
  "version": [
    {
      "runtime": "104 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm2183781",
      "name": "Nicolae Constantin Tanase"
    }
  ],
  "writer": [
    {
      "id": "nm3717156",
      "name": "Raluca Manescu",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm7348187",
      "name": "Ana Maria Guran",
      "character": "Larisa"
    },
    {
      "id": "nm0613835",
      "name": "Crina Muresan",
      "character": "Mama"
    },
    {
      "id": "nm0751853",
      "name": "Mircea Rusu",
      "character": "Chelu"
    },
    {
      "id": "nm7348188",
      "name": "Ana Vatamanu",
      "character": "Olimpia"
    },
    {
      "id": "nm3988678",
      "name": "Oana Rusu",
      "character": ""
    },
    {
      "id": "nm6400397",
      "name": "Iulia Ciochina",
      "character": "Ana"
    },
    {
      "id": "nm4696492",
      "name": "Hritcu Florin",
      "character": "Florin"
    },
    {
      "id": "nm4775686",
      "name": "Alexandru Gatstramb",
      "character": "Gratian"
    }
  ],
  "overview": "Larisa is 16 and lives in a city by the sea. It's a small city, where gossip and news spread fast. It's a city where your image and influence, \"manelele\", money and power are all that matters. And Larisa… wants it all. And even if she doesn't have it, she fights for it. Larisa believes in herself. She knows that she deserves better. She is convinced that it's worth doing everything it takes to fulfill her dreams. And for her courage and recklessness - we love her.",
  "storyline": "'The World Is Mine' is about a teenager's drama in the 2000s, focusing on the story of Larisa (Ana Maria Guran), a regular teenager from Constanta, Romania. Larisa wants a lot from life: money, power, influence, popularity and respect. Now that she is in love, she will do anything for that.",
  "plot": "Kanneganti Gopala Rao is an atheist who owns a shop selling Hindu idols alongside his wife Meenakshi and son Moksha as well as his assistant Otthu. He obstructs a holy ritual involving his family, conducted by Siddheswar Maharaj, a fake godman. A sudden earthquake destroys his shop.\n\nRao approaches his insurance company who deny him assistance, claiming that an earthquake is an act of God. Rao decides to sue God but cannot find a lawyer willing to take the case on. He eventually engages Akbar Bhai, a disabled lawyer, who helps him file the case. Legal notices are sent to the insurance company as well as to Siddheshwar the priest and others from his group, as representatives of God. The court accepts the case, but Rao finds himself trapped among armed fundamentalists, with a creditor Ramji occupying the house and his wife having left him.\n\nRao is rescued by Gopala Govinda Hari, a consultant, who is revealed to the audience to be the deity Krishna in disguise. Gopala buys Rao's house from Ramji but allows Rao to stay with him. The lawsuit caused a public outcry, so on Gopala's advice, Rao gives an interview to the media about his views, which turns viral; public opinion swings in his favour. Hundreds of people whose insurance claims were rejected due to an Act of God clause turn up at Akbar's house and join the fight. Rao agrees to fight on behalf of all of them.\n\nIn the next court session, defending lawyer Shankar Narayana points out that Rao has no document that can prove the disaster was an Act of God. The judge orders Rao to present a written proof that will support his claim. Gopala gives Rao the Bhagavad Gita, Bible and Quran in which to find the answers. Rao subsequently points out a passage saying that \"This world is a creation of God, and it is his will to allow it to grow or destroy\", which strengthens his case. As he nears the end of his argument, he is stabbed by a staunch follower of Leeladhara.\n\nRao is rushed to the hospital where he slips into a coma due to heavy blood loss. Leeladhara then plans to make Rao a messenger of God and elevate him to a divine figure across the country after killing him. The lawsuit's verdict goes in Rao's favour and religious organisations are ordered by the court to pay the compensation to all the plaintiffs. After a month, Rao is rescued by Gopala, who later reveals his identity. Rao starts to believe in the existence of God. Meanwhile, Leeladhara, Gopika Matha, and Siddheshwar open a temple dedicated to Rao and accumulate millions in donations. Rao learns that his death is planned for Vijayadasami which coincides with the death of Sai Baba of Shirdi. He escapes with Gopala but is attacked by the priests' henchmen. Gopala manages to show them Narasimha in place of Rao, scaring them off.\n\nRao arrives to find his statues erected at the place where his shop once stood. He wades through the stunned crowd and breaks the statue, then admonishes the crowd about trusting in godmen. He advises them to search for God inside themselves rather than worshipping statues. Rao prevents the crowd from attacking the priests, asking for them to be allowed to leave unharmed but also insisting that they stop believing in them. After the completion of Ramlila, Rao goes back to Gopala to thank him, only to find him gone.\n\nRao's family arrive and they are reunited. He sees Gopala's key chain on the floor. When he is about to take it back, he hears Gopala's voice telling him to get rid of it. He throws it away, seeing it disappear into the sky with a flash as Gopala \"signs off\", promising him they will meet again.",
  "synopsis": "Larisa is 16 and lives in a city by the sea. It's a small city, where gossip and news spread fast. It's a city where your image and influence, \"manelele\", money and power are all that matters. And Larisa wants it all. And even if she doesn't have it, she fights for it. Larisa believes in herself. She knows that she deserves better. She is convinced that it's worth doing everything it takes to fulfill her dreams. And for her courage and recklessness - we love her.\nOnce she's up there, riding the wave, living her dreams of money, lover, friends, notoriousness - Larisa loses her world. She grows up."
}