{
  "imdb_id": "tt4729766",
  "tmdb_id": "367999",
  "douban_id": null,
  "title": "The Last Will Be the Last (2015)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "Italy",
  "version": [
    {
      "runtime": "103 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm0116511",
      "name": "Massimiliano Bruno"
    }
  ],
  "writer": [
    {
      "id": "nm2424881",
      "name": "Furio Andreotti",
      "description": "also play"
    },
    {
      "id": "nm0116511",
      "name": "Massimiliano Bruno",
      "description": "also play"
    },
    {
      "id": "nm3043425",
      "name": "Gianni Corsi",
      "description": "also play"
    },
    {
      "id": "nm0181246",
      "name": "Paola Cortellesi",
      "description": "also play"
    }
  ],
  "cast": [
    {
      "id": "nm0181246",
      "name": "Paola Cortellesi",
      "character": "Luciana Colacci"
    },
    {
      "id": "nm0309348",
      "name": "Alessandro Gassmann",
      "character": "Stefano Colacci       (as Alessandro Gassman)"
    },
    {
      "id": "nm0072768",
      "name": "Fabrizio Bentivoglio",
      "character": "Antonio Zanzotto"
    },
    {
      "id": "nm0010271",
      "name": "Francesco Acquaroli",
      "character": "Saltutti"
    },
    {
      "id": "nm4664281",
      "name": "Lara Balbo",
      "character": ""
    },
    {
      "id": "nm0135775",
      "name": "Giorgio Caputo",
      "character": "Enzo"
    },
    {
      "id": "nm0182437",
      "name": "Alessandra Costanzo",
      "character": "Signora Graziosi"
    },
    {
      "id": "nm4342586",
      "name": "Maria Di Biase",
      "character": "Loredana"
    },
    {
      "id": "nm3802360",
      "name": "Irma Carolina Di Monte",
      "character": "Manuela"
    },
    {
      "id": "nm2661915",
      "name": "Marco Falaguasta",
      "character": "L'amministratore delegato"
    },
    {
      "id": "nm7585158",
      "name": "Emanuela Fanelli",
      "character": "Nadia"
    },
    {
      "id": "nm0286466",
      "name": "Augusto Fornari",
      "character": "Ruggero"
    },
    {
      "id": "nm2862095",
      "name": "Stefano Fresi",
      "character": "Bruno"
    },
    {
      "id": "nm1833087",
      "name": "Marco Giuliani",
      "character": "Adriano"
    },
    {
      "id": "nm8565484",
      "name": "Lavinia Lilli",
      "character": "La moglie automobilista"
    },
    {
      "id": "nm5515332",
      "name": "Marco Rea",
      "character": ""
    },
    {
      "id": "nm0723017",
      "name": "Diego Ribon",
      "character": "Finardi"
    },
    {
      "id": "nm5626776",
      "name": "Silvia Salvatori",
      "character": "Rossana"
    },
    {
      "id": "nm1955816",
      "name": "Ilaria Spada",
      "character": "Simona"
    },
    {
      "id": "nm6575725",
      "name": "Cinzia Susino",
      "character": "Infermiera"
    },
    {
      "id": "nm0868370",
      "name": "Federico Torre",
      "character": "Ispettore"
    },
    {
      "id": "nm2789077",
      "name": "Matteo Valentini",
      "character": "Mario"
    }
  ],
  "overview": null,
  "storyline": "Life used to smile at Luciana Colacci. Well, she was not the wealthiest woman on earth, as she was only a worker in the local factory, but she had very good relationships with her friends, the people of her neighborhood and her fellow employees. And she was (almost) happily married to Stefano, a charmer with a nice sense of humor. But almost only... considering the fact that her partner was more interested in hanging out in cafes doing business that never succeeded than in supporting his wife. That almost perfect life unfortunately came to an end the day Luciana was abruptly fired. Her crime: being pregnant! A fateful day which marked the beginning of her slow descent into hell...",
  "plot": "The player controls the boy, who must care for and work with the large creature, Trico, using its animal instincts to solve puzzles\nThe Last Guardian has thematic similarities to Fumito Ueda's previous games, Ico and Shadow of the Colossus. Its story is framed as a flashback narrative told by an older man recounting his experience as a young boy meeting a giant, feathered creature, resembling a griffin, named Trico (トリコ, Toriko?). The name of the creature can be taken to mean \"prisoner\" (虜, toriko?), \"baby bird\" (鳥の子, tori no ko?), or a portmanteau of \"bird\" (鳥, tori?) and \"cat\" (猫, neko?).\n\nIn the flashback's present, the boy is kidnapped \"under mysterious circumstances\" and taken to a large expansive castle called \"the Nest\". The boy wakes to find tattoos on his body that he did not have before being kidnapped. The boy encounters the weakened creature, Trico. Trico is chained up, with numerous spears stuck in his body, and his wings too injured to allow him to fly. The boy finds a mirror-like shield that projects energy out of Trico's tail wherever the mirror is focused. The boy helps to remove the weapons, releases the chain using the mirrored shield, and feeds the starving creature. Though Trico is initially hostile to the boy, the creature slowly starts to accept the boy's care and guidance. Together, the two work to escape, avoiding or attacking guards that patrol the castle seeking to recapture them. Much of the game is set around the developing friendship between the boy and Trico.\n\nDuring their attempt to escape, they come to learn that the Nest holds a malevolent force that is able to brainwash living creatures like Trico and that controls the castle guards. Both battered and bruised, they encounter a pack of creatures similar to Trico that are all under the evil force's control. The other creatures attack the boy, but Trico rushes in to protect him, becoming severely wounded as the other creatures rip off Trico's tail. The boy uses the tail and mirror to destroy the evil force, causing the controlled creatures to plummet from the sky, with the exception of Trico and one other creature they had freed from the evil force's control earlier. Wounded, Trico takes the near-unconscious boy and manages to escape the mountain. Trico tracks down the boy's home village and attempts to return the boy. However, the villagers are frightened, as they recognize Trico as the creature that originally kidnapped the boy. Reluctantly, the boy commands Trico to leave, and Trico flies off back to the Nest.\n\nMany years later, the boy has grown up. The village children discover the battered shield, leading him to narrate his story—the narration provided over the game—to them. Finishing the story, the narrator remarks that he never saw Trico after those events. He holds up the mirrored shield to the skies, and the beam of light from the mirror travels back to the Nest. The game ends as the light from the shield falls into the cavern that the boy originally found Trico in. There, from the darkness, Trico's eyes light up with another set of eyes appearing beside him.",
  "synopsis": null
}