{
  "imdb_id": "tt4796654",
  "tmdb_id": "378146",
  "douban_id": null,
  "title": "Naxal (2015)",
  "genres": [
    "History"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "103 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm7410546",
      "name": "Debaditya Bandyopadhyay"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm0149822",
      "name": "Mithun Chakraborty",
      "character": "Anirban Sen"
    },
    {
      "id": "nm0154122",
      "name": "Dhritiman Chatterjee",
      "character": "Shiddhartha Chowdhury"
    },
    {
      "id": "nm0149826",
      "name": "Shankar Chakraborty",
      "character": "Arijit Mitra"
    },
    {
      "id": "nm3437910",
      "name": "Gargi Roy Chowdhury",
      "character": "Reena Sen"
    },
    {
      "id": "nm4120486",
      "name": "Srabanti Banerjee",
      "character": ""
    },
    {
      "id": "nm6757897",
      "name": "Kapil Bora",
      "character": ""
    },
    {
      "id": "nm3374598",
      "name": "Padmanabha Dasgupta",
      "character": "News Reporter"
    },
    {
      "id": "nm4371786",
      "name": "Nishita Goswami",
      "character": ""
    },
    {
      "id": "nm3517951",
      "name": "Kanchana Moitra",
      "character": ""
    }
  ],
  "overview": "After nearly 42 years one fine morning a FAX arrives at the Kolkata Metro Railways Headquarters. It says that today Anirban will commit suicide under the last Metro. Questions regarding his identity and demands start emerging as the news has taken centre stage in the city. This news shake the entire city from Kolkata Police Headquarters (Lalbazar) to the news channels, while Anirban rattles the administration with one FAX after the other.",
  "storyline": "The period was early 1970s. Brilliant brains from Calcutta Medical College to Presidency College, from Calcutta University to Bengal Engineering College, the meritorious boys and girls plunged into the revolution for social reform. They had given up their prosperous and promising careers for the sake of the society. However, the administration could eventually overcome the surge and more sadly, a few miscreants also took advantage of the general unrest for personal gain that eventually brought infamy to the revolution that was otherwise a dedicated and a respectable one. Thus the careers of these bright minds were doomed and many of them were killed and rest was forced to flee or go underground.",
  "plot": null,
  "synopsis": null
}