{
  "imdb_id": "tt4762826",
  "tmdb_id": "344334",
  "douban_id": null,
  "title": "Innimey Ippadithaan (2015)",
  "genres": [
    "Comedy",
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "134 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm7383220",
      "name": "Muruganand"
    }
  ],
  "writer": [
    {
      "id": "nm7383220",
      "name": "Muruganand",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1962272",
      "name": "Santhanam",
      "character": "Seenu"
    },
    {
      "id": "nm6442142",
      "name": "Ashna Zaveri",
      "character": "Maha"
    },
    {
      "id": "nm5859392",
      "name": "Akhila Kishore",
      "character": "Akhila"
    },
    {
      "id": "nm2536215",
      "name": "Vtv Ganesh",
      "character": "(as Ganesh)"
    },
    {
      "id": "nm4446366",
      "name": "Thambi Ramayya",
      "character": "Seenu's Uncle"
    },
    {
      "id": "nm4861046",
      "name": "Aadukalam Naren",
      "character": "Seenu's Father"
    },
    {
      "id": "nm7703388",
      "name": "Krithika",
      "character": "Maha's Friend"
    }
  ],
  "overview": "Seenu is in love with Maha but his parents fix up his marriage with Akhila. However, circumstances force him to stay silent every time he tries to reveal his love affair.",
  "storyline": "Seenu (Santhanam) is a happy go lucky guy. Everything goes well in his life until an astrologer predicts that he should get married within three months. By the time Seenu's parents scout a girl for him, he falls in love with Maha (Ashna Zaveri) but she keeps on ignoring him. At one point of time, Seenu says yes to an arranged marriage with Akila (Akila Kishore) due to the family circumstances and pressure mounted by his cunning uncle (Thambi Ramaiah.",
  "plot": "Seenu (Santhanam) is a happy go lucky guy; everything goes well in his life until an astrologer predicts that he should get married within three months. By the time Seenu's parents scout a girl for him, he falls in love with Maha(Ashna Zaveri) but she keeps on ignoring him. At one point of time, Seenu says yes to an arranged marriage with Akila (Akila Kishore) due to the family circumstances and pressure mounted by his foolish uncle (Thambi Ramaiah). Later, Seenu understands that Maha actually played a prank and she is indeed in love with him. When Maha finds about his engagement, she threatens him and tells him that he is going to marry her on the day of his wedding. Seenu runs away from his marriage to get married to Maha at the marriage registars office but in the end, Maha tricks him into becoming her witness for marriage and marries her cousin Karthik instead of Seenu. Seenu disappointed returns to his marriage back with Akhila only to find that he cannot marry Akhila as her parents get her married off to someone else since Seenu ran away. Thus, he is forced to marry his uncle's(Thambi Ramaiah) daughter (Vidyullekha).",
  "synopsis": null
}