{
  "imdb_id": "tt4730006",
  "tmdb_id": "368702",
  "douban_id": null,
  "title": "Dangerous Lessons (TV Movie 2015)",
  "genres": [
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.8,
  "director": [
    {
      "id": "nm0739117",
      "name": "Damián Romay"
    }
  ],
  "writer": [
    {
      "id": "nm5526583",
      "name": "Blaine Chiappetta",
      "description": null
    },
    {
      "id": "nm0739117",
      "name": "Damián Romay",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0518321",
      "name": "Louise Lombard",
      "character": "Stephanie"
    },
    {
      "id": "nm6170313",
      "name": "Alex Esola",
      "character": "James"
    },
    {
      "id": "nm4125403",
      "name": "Ella Wahlestedt",
      "character": "Nicole"
    },
    {
      "id": "nm3572271",
      "name": "Richard Haylor",
      "character": "Richard Berg"
    },
    {
      "id": "nm0668534",
      "name": "Jo Marie Payton",
      "character": "Linda"
    },
    {
      "id": "nm0368002",
      "name": "William Haze",
      "character": "Michael"
    },
    {
      "id": "nm2287653",
      "name": "Brooklyn Murphy",
      "character": "Detective Meyers"
    },
    {
      "id": "nm2524437",
      "name": "Carole Wood",
      "character": "Carol"
    },
    {
      "id": "nm0014873",
      "name": "Harvey Atkin",
      "character": "Principle Winters"
    },
    {
      "id": "nm0429318",
      "name": "Tamara Jones",
      "character": "Nurse"
    }
  ],
  "overview": "High school teacher Stephanie breaks the cardinal rule of not getting romantically involved with one of her students. To make things worse, her handsome teenage lover James starts to demonstrate psychotic, obsessive behavior. When James starts stalking Stephanie and her family, Stephanie is forced to teach James the ultimate dangerous lesson.",
  "storyline": "High school teacher Stephanie breaks the moral rule of not getting physically involved with one of her students. To make things worse, her handsome teenage fling James (Alex Esola) starts to demonstrate obsessive behavior after being exploited by her. When James starts stalking Stephanie and her family, Stephanie learns the ultimate dangerous lesson.",
  "plot": "Utilizing a film-within-a-film format, the overall plot involves New York City-based director Eddie Israel directing actors Sarah Jennings and Frank Burns in a Hollywood marital-crisis drama, Mother of Mirrors, which is about a formerly wealthy but unemployed husband who berates his newly religious wife about what he considers her hypocritical aversion to their sex-and-drug lifestyle. During the shooting of that film, Israel becomes more and more demanding of his actors, growing increasingly obsessive with finding the ugly truths beneath the story's surface. All the while, his own carelessness and bad behavior with his own family begins to erode him and to corrode his marriage to Madlyn.",
  "synopsis": null
}