{
  "imdb_id": "tt4707940",
  "tmdb_id": "356773",
  "douban_id": null,
  "title": "Miss Tanakpur Haazir Ho (2015)",
  "genres": [
    "Comedy",
    "Crime",
    "Family",
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "154 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.3,
  "director": [
    {
      "id": "nm7326029",
      "name": "Kapri Vinod"
    }
  ],
  "writer": [
    {
      "id": "nm7348331",
      "name": "Vinod Kapri",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4119309",
      "name": "Rahul Bagga",
      "character": "Arjun Prasad"
    },
    {
      "id": "nm1064764",
      "name": "Hrishitaa Bhatt",
      "character": "Maya"
    },
    {
      "id": "nm2240044",
      "name": "Brijendra Kala",
      "character": "Lawyer"
    },
    {
      "id": "nm0438465",
      "name": "Annu Kapoor",
      "character": "Sualaal Gandass"
    },
    {
      "id": "nm0457410",
      "name": "Ravi Kishan",
      "character": "Bheema"
    },
    {
      "id": "nm0592799",
      "name": "Sanjay Mishra",
      "character": "Pandit"
    },
    {
      "id": "nm0700875",
      "name": "Om Puri",
      "character": "Matang SIngh"
    }
  ],
  "overview": "Miss Tanakpur is a political satire that unfolds in the backdrop of a Love-story set in a village of Haryana. In the villages of Haryana the Pradhans in general have insurmountable powers. The Pradhan of Tanakpur, Sualal Gandas is no different. Like his contemporaries, Sualal rules his village using powers vested upon him by Khap. Not just the traditional court but when time comes Sualal manages to manipulate and exploit the bigger powers of the state i.e. the Police and the Law of the land. Ms Tanakpur is Sualal's Buffalo. She had won the Beauty pageant for Buffaloes in the Local fair. She had won the trophy because she produced more milk than all other Buffaloes in the contest. Serendipity will strike in this story. Ms Tanakpur thy name is justice.",
  "storyline": "Miss Tanakpur is a political satire that unfolds in the backdrop of a Love-story set in a village of Haryana. In the villages of Haryana the Pradhans in general have insurmountable powers. The Pradhan of Tanakpur, Sualal Gandas is no different. Like his contemporaries, Sualal rules his village using powers vested upon him by Khap. Not just the traditional court but when time comes Sualal manages to manipulate and exploit the bigger powers of the state i.e. the Police and the Law of the land. Ms Tanakpur is Sualal's Buffalo. She had won the Beauty pageant for Buffaloes in the Local fair. She had won the trophy because she produced more milk than all other Buffaloes in the contest. Serendipity will strike in this story. Ms Tanakpur thy name is justice.",
  "plot": "Sualaal is head of the village, Tanakpur. He is wealthy, chauvinist &amp; impotent. He has married at a late age &amp; his wife Maya is much younger to him. They tend to ignore each other. Arjun a young lad of the village, wins her heart &amp; they meet when Sualaal is not around. Arjun's father gives him lifetime's saving so that he can secure a job in the Police. Sualaal doubts her &amp; since he returns home in an inebriated state he is never able to prove anything. He is nonetheless angry over the fact that his wife mocks him for impotency &amp; having an affair. One fine day one of his cronies spots Maya &amp; Arjun together &amp; he receives severe thrashing for this. On day of his sister's wedding when everyone is at the wedding, Arjun snicks into Sualaal's home to meet Maya. Saulaal when finds Arjun missing from the wedding, immediately heads to his home and severely thrashes him. He is restrained by his cronies, when they tell him that if he creates more chaos people would come to know of his wife's affair. This would bring ill-repute to him. So he decides to frame him in a rape case of his buffalo \"Miss Tanakpur\". All the evidences are forged &amp; Saulaal wants to make sure that Arjun is severely punished. Initially everyone dismisses this as a sham, but then Sualaal bribes his way &amp; gets the case registered by the police. Arjun is now taken into police custody. This brings shame &amp; grief to his family. His sister's wedding is broken. His father goes on hunger strike &amp; dies in process. The police severely thrashes him &amp; when brought in front of court the judges orders prosecution to present the victim, i.e. miss Tanakpur.\n\nOn their way to the next hearing while transporting Miss Tanakapur to the court there is an accident &amp; she is severely injured. In this moment everyone is apathetic towards her, only Arjun being empathetic towards her. On the third court hearing Miss Tanakpur is brought to the court. The judge asks the police to do verification based on identification marks mentioned in the FIR &amp; it is found that this not the real Miss Tanakpur. The judge is angry &amp; admonishes the prosecutor for the farce. It is later revealed that Sualaal had sold off the Miss Tanakpur. With great difficulty they are able to locate her &amp; bring her back to the police station. Meanwhile, Sualaal is not happy with the progress in the court &amp; decides to further inflict pain to his family. He announces as a form of penance Arjun will have to marry Miss Tanakpur. Maya is not able to bear this &amp; offers to expose her husband. Arjun refuses her, saying that the truth would drag her into this murky business &amp; he doesn't want her to suffer similar fate. Throughout the ordeal Arjun is sympathetic towards Miss Tanakpur. On day of the wedding, Saulaal borrows Miss Tanakpur from the police for the night. As the wedding is going on, she runs away &amp; no one is able to trace her. This is a sort of reflection of the care &amp; affection shown by Arjun. On subsequent court hearings the police is not able to produce her, which means that the police officer investigating the case is suspended. In order to exact his revenge, the police officer reveals the truth in the court &amp; Saulaal along with his cronies are sent to jail. Arjun is lucky to be acquitted from the case &amp; all the embarrassment he has faced.",
  "synopsis": null
}