{
  "imdb_id": "tt4796568",
  "tmdb_id": "361243",
  "douban_id": null,
  "title": "First Growth (2015)",
  "genres": [
    "Drama"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm4071227",
      "name": "Jérôme Le Gris"
    }
  ],
  "writer": [
    {
      "id": "nm4554522",
      "name": "Vanessa Portal",
      "description": "scenario dialogue &"
    },
    {
      "id": "nm1462495",
      "name": "Rémi Bezançon",
      "description": "scenario dialogue &"
    },
    {
      "id": "nm4071227",
      "name": "Jérôme Le Gris",
      "description": "scenario as Jérôle Le Maire dialogue"
    }
  ],
  "cast": [
    {
      "id": "nm0487254",
      "name": "Gérard Lanvin",
      "character": "François Maréchal"
    },
    {
      "id": "nm0504267",
      "name": "Jalil Lespert",
      "character": "Charlie Maréchal"
    },
    {
      "id": "nm0998117",
      "name": "Alice Taglioni",
      "character": "Blanche Maubuisson"
    },
    {
      "id": "nm1357722",
      "name": "Laura Smet",
      "character": "Marie"
    },
    {
      "id": "nm1877162",
      "name": "Lannick Gautry",
      "character": "Marco"
    },
    {
      "id": "nm0864257",
      "name": "Frédérique Tirmont",
      "character": "Edith Maubuisson"
    },
    {
      "id": "nm0589569",
      "name": "Christiane Millet",
      "character": "Marguerite"
    },
    {
      "id": "nm0217783",
      "name": "Scali Delpeyrat",
      "character": "Roland"
    },
    {
      "id": "nm3822235",
      "name": "Shane Woodward",
      "character": "Christopher"
    },
    {
      "id": "nm7508079",
      "name": "Louis Wilwertz",
      "character": "Thibault (9 ans)"
    },
    {
      "id": "nm0128801",
      "name": "Stéphane Caillard",
      "character": "Cécile"
    },
    {
      "id": "nm0119711",
      "name": "Christian Bujeau",
      "character": "Joseph"
    },
    {
      "id": "nm0490734",
      "name": "Philippe Laudenbach",
      "character": "Monsieur du Mesnil"
    },
    {
      "id": "nm0411465",
      "name": "Julien Israël",
      "character": "Le juge"
    },
    {
      "id": "nm0241484",
      "name": "Roger Dumas",
      "character": "Grand-Jacques"
    },
    {
      "id": "nm7508080",
      "name": "Mattéo Milliet",
      "character": "Charlie (10 ans)"
    },
    {
      "id": "nm2246199",
      "name": "Antoine Gouy",
      "character": "Nicolas Rousselier"
    },
    {
      "id": "nm4267170",
      "name": "Marion Saussol",
      "character": "Serveuse restaurant Marie"
    },
    {
      "id": "nm0945063",
      "name": "Anton Yakovlev",
      "character": "Convive russe"
    },
    {
      "id": "nm2842024",
      "name": "Mark Antoine",
      "character": "Serveur restaurant Beaune"
    },
    {
      "id": "nm1115869",
      "name": "Olivier Hamel",
      "character": "Sommelier restaurant Paris"
    },
    {
      "id": "nm0636687",
      "name": "Jacques Nourdin",
      "character": "Tonnelier"
    },
    {
      "id": "nm7638056",
      "name": "Simon Benattar-Bourgeay",
      "character": "Un invité au mariage"
    }
  ],
  "overview": "Winemaker son, Charlie Marshall left Burgundy to become a Parisian renowned winemaker, author of a successful guide whose notes are annually tremble vineyards.  But in Côte-d'Or, his father lost the taste of wine and mistakes the family winery rush towards bankruptcy.  At first reluctant, Charlie returns to Burgundy. It must his boots and shoes back up his sleeves and become winemaker confront a profession he does not know, under the skeptical gaze of his father.  Between unpredictable weather and a delicate variety, Charlie will have to prove to his father that he is worthy of this land passed from generation to generation in their family.  It is easy to note a wine, but how do we do a great wine?",
  "storyline": "Charlie Maréchal, the owner of a successful guide to the wines of France, is forced to take over the vineyard that has been in his family for 200 years when it gets dangerously close to bankruptcy due to his father's loss of interest in the operation. Having little previous experience in the wine-making process, he gambles on using traditional methods that went in disuse with the introduction of technology.",
  "plot": "The story follows a team of fictional secret agents called Baby; which is a temporary task force headed by Feroz Khan (Danny Denzongpa) formed in response to the 2008 Mumbai attacks whose job is to find and eliminate terrorists who are planning attacks in India.\n\nWhile attempting to rescue a fellow Indian security agent in Turkey, Ajay Singh Rajput (Akshay Kumar) captures a traitor Jamal (Karan Anand) who formerly worked under Ajay and threatens to kill his family unless he gives them the information about their terror attack plans on India. Ajay is told about a terrorist plot to cause a bomb blast in a Delhi mall which he and Jai (Rana Daggubati) are able to prevent. In the process they learn that this was only the first, of a series of massive attacks that had been planned. Pakistan based terrorist mastermind, Maulana (Rasheed Naz), is causing trouble near the India-Pakistan border. He plans and executes a daring prison escape plan for Bilal (Kay Kay Menon). A team of officers is dispatched to interrogate Taufiq who is an ISI agent posing as a local leader. Ajay manages to get information on their local contacts after torturing him. They go to their hideout, but things go haywire when all of the squad members on the mission except Ajay are killed in an explosion. To collect further information from a terrorist logistics planner in Nepal, Ajay and officer Shabana Khan (Tapsee Pannu) travel to Nepal pretending to be husband and wife. Their plan to capture the terrorist Wasim Khan (Sushant Singh) goes wrong when Wasim finds out that Shabana is in fact an undercover officer. Shabana manages to hold Wasim and Ajay arrives to find that Shabana has knocked him unconscious.\n\nAs per the information given by Wasim, Feroz sends Ajay, Jai and Shukla (Anupam Kher) to meet their deep asset Ashfaq (Mikaal Zulfiqar) in Saudi Al-Dera where Bilal is holding meetings to discuss the funding and execution of their plans. Ajay and Jai crack into Bilal's room with the help of Shukla and manage to kill Bilal. As they are about to return, they find that Maulana is also at the suite. Jai knocks him out and they decide to bring Maulana back to India, under the pretext that he is a relative who needs to visit India for an urgent liver transplant. They manage to get a visa from the local authorities for Maulana (being shown as Ashfaq's ill uncle) with Ashfaq's help. Soon after, the hotel security discover the corpse of Bilal. The Arab police authorities put the police chief Hani Mohammad (Hasan Noman) on charge of investigating the crime. He attempts to track down the murderers quickly and eventually succeeds. However, once he learns that the murderers are Indian military agents who are attempting to smuggle Maulana back to India, he smiles and lets them escape without any hindrance. After 6 weeks of bringing Maulana, team sends him to Srinagar for interrogation and obtaining information and killing him. For successfully bringing in Maulana, Baby is given permanent status and the team celebrates it.",
  "synopsis": null
}