{
  "imdb_id": "tt4790268",
  "tmdb_id": "391757",
  "douban_id": null,
  "title": "Never Back Down: No Surrender (Video 2016)",
  "genres": [
    "Action",
    "Sport"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "101 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm0925220",
      "name": "Michael Jai White"
    }
  ],
  "writer": [
    {
      "id": "nm0369675",
      "name": "Chris Hauty",
      "description": "characters"
    },
    {
      "id": "nm0369675",
      "name": "Chris Hauty",
      "description": "screenplay"
    },
    {
      "id": "nm0369675",
      "name": "Chris Hauty",
      "description": "story"
    },
    {
      "id": "nm0925220",
      "name": "Michael Jai White",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0925220",
      "name": "Michael Jai White",
      "character": "Case Walker"
    },
    {
      "id": "nm2038245",
      "name": "Josh Barnett",
      "character": "Brody James"
    },
    {
      "id": "nm0914089",
      "name": "Gillian White",
      "character": "Myca Cruz"
    },
    {
      "id": "nm0005246",
      "name": "Esai Morales",
      "character": "Hugo Vega"
    },
    {
      "id": "nm0702749",
      "name": "Stephen Quadros",
      "character": "Matty Ramos"
    },
    {
      "id": "nm0428923",
      "name": "Nathan Jones",
      "character": "Caesar Braga"
    },
    {
      "id": "nm3306393",
      "name": "Amarin Cholvibul",
      "character": "Taj Mahale"
    },
    {
      "id": "nm7573800",
      "name": "Dan Renalds",
      "character": "Creech"
    },
    {
      "id": "nm2925876",
      "name": "JeeJa Yanin",
      "character": "Jeeja - Gym Fighter Girl"
    },
    {
      "id": "nm3100183",
      "name": "Brahim Chab",
      "character": "Brody's Young Pro Fighter       (as Brahim Achabbakhe)"
    },
    {
      "id": "nm0810653",
      "name": "Ron Smoorenburg",
      "character": "Case's 1st Fight Opponent"
    },
    {
      "id": "nm1388074",
      "name": "Tony Jaa",
      "character": "Tony Jaa"
    },
    {
      "id": "nm1961693",
      "name": "Quinton 'Rampage' Jackson",
      "character": "Rampage"
    },
    {
      "id": "nm0095465",
      "name": "Sahajak Boonthanakit",
      "character": "Joe Kanarot"
    },
    {
      "id": "nm0115930",
      "name": "Aaron Brumfield",
      "character": "Boris"
    },
    {
      "id": "nm2531116",
      "name": "Steven Dasz",
      "character": ""
    },
    {
      "id": "nm7874288",
      "name": "Grégory Matthias Garcia",
      "character": "Camera Guy       (as Greg Matt Garcia)"
    },
    {
      "id": "nm8632435",
      "name": "James Lee Hardman",
      "character": "MMA Fighter"
    },
    {
      "id": "nm3387607",
      "name": "Creighton Mark Johnson",
      "character": "Trainer       (as Creighton Mark Johnsom)"
    },
    {
      "id": "nm1524066",
      "name": "Elidh MacQueen",
      "character": "Hottie"
    },
    {
      "id": "nm0546460",
      "name": "John Marengo",
      "character": "Journalist"
    },
    {
      "id": "nm2314909",
      "name": "Damian Mavis",
      "character": "Cage fighter"
    },
    {
      "id": "nm5478558",
      "name": "Eoin O'Brien",
      "character": "Cobra O'Conor"
    }
  ],
  "overview": "Picking up after the events of Never Back Down 2, former MMA champion Case Walker is on the comeback trail to become champion once again.",
  "storyline": "Picking up after the events of Never Back Down 2, former MMA champion Case Walker is on the comeback trail to become champion once again.",
  "plot": "This article's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (September 2014) (Learn how and when to remove this template message)\nJake Tyler (Sean Faris) has recently moved from Iowa to Orlando, Florida with his mother, Margret (Leslie Hope), and younger brother, Charlie (Wyatt Smith), to support Charlie's shot at a professional tennis career. Jake was a star athlete on the football team at home, but in this new city, he is an outsider with a reputation for being a quick tempered brawler after an internet video of him starting a fight at one of his football games after a frustrated player from the opposing team taunted Jake about his father, who died in a drunk driving accident, circulates around his new school.\n\nMaking an attempt to fit in, at the invitation of a flirtatious classmate, Baja Miller (Amber Heard), Jake goes to a party where he is unwillingly pulled into a fight with the fighting MMA champion at the school, Ryan McCarthy (Cam Gigandet). Originally, Jake does not wish to fight until Ryan taunts him about his father who died while driving drunk with Jake in the car. Jake is brutally defeated in the fight, causing Jake to feel depressed. But a classmate, Max Cooperman (Evan Peters), who later becomes one of his best friends, introduces himself to Jake and tells him about the sport known as Mixed Martial Arts. He sees a star in Jake and asks that he meet with Jean Roqua (Djimon Hounsou). It is immediately apparent to Jake that MMA is not street fighting, but rather an art form he wants to master. Roqua agrees to take Jake as a pupil, but under the condition that Jake refrains from fighting outside of the gym which Jake agrees to, despite knowing he wishes to confront Ryan anyway. Baja attempts to apologize to Jake, but he does not sympathize with her and refuses to forgive her. Baja then confronts Ryan about the fight with Jake and proceeds to end their relationship when Ryan shows no remorse for the beating he gave him or his sadistic tendencies. Ryan begins to create a scene before the entire school but Jake tries to step in to defend Baja. After Ryan insults him again and leaves, Jake attends training with Roqua. Still angry about the incident, he is unable to calm down and train effectively. Roqua asks Jake to leave so that he could \"cool off\".\n\nAfter he and Max leave the gym, Jake gets into a brawl with a group of guys in a Hummer whom Jake easily disposes of while Max films. This video again circulates around the school raising Jake's social status but agitating Ryan in the process. Ryan then proceeds to challenge Jake to compete in the Beatdown, an underground fighting tournament of which Ryan is the reigning champion. After having been banished from the gym by Roqua after his fight is discovered, Jake begs for forgiveness saying his anger is quelled when he is training with Roqua. Roqua agrees to allow Jake to train at his gym again, but does not take it easy on him anymore. He then prepares to compete in the Beatdown. While training with Roqua, Jake inquires why he lives in the gym. Jake discovers that Roqua is from Brazil and he is in exile because he believes he is the reason his brother, Joseph the favorite son, was killed and his father had disowned him for. Jake apologizes to Baja for not listening when she first apologized and the two proceed to begin a relationship.\n\nUpon hearing that Jake has decided not to compete in the Beatdown, Ryan invites Max to hang out at his house; there he begins to spar with Max before brutally assaulting him and leaving him at Jake's door. Jake and Baja take Max to the hospital where Jake decides to fight. Despite Baja's pleas against his decision, he states that doing nothing has consequences. Before he goes to the tournament, he has a brief argument with Roqua about his decision to fight. Roqua eventually assents and tells him to \"control the outcome\" of the fight. Jake arrives at the tournament where it is about to begin. After a mix-up where Jake and Ryan almost fight in the first round, they both proceed to make their way through each fight. Jake makes it to the semifinals in spite of an injury he received in the previous match due to a kick to the ribs. While Jake is recovering after the match, Baja sees him and tells him that she finally understands that Jake is fighting \"so [he doesn't] have to fight again\". After learning that Ryan was disqualified in his semifinal match, Jake forfeits, seeing no reason to continue. While he and Baja attempt to leave, Ryan confronts him and the two finally fight outside in the parking lot. Jake is still limited by his ribs, and Ryan at first gains the upper hand, applying a choke on Jake. However Jake escapes and, with the entire crowd watching, knocks out Ryan using one of the first combinations Roqua taught him.\n\nThe next day, a visibly injured Max has been released from the hospital. Jake has won the respect of his fellow students, including Ryan, and Roqua closes the gym with a ticket to Brazil, signaling his intention to reconcile with his father.",
  "synopsis": null
}