{
  "imdb_id": "tt4743562",
  "tmdb_id": "344906",
  "douban_id": null,
  "title": "The Last Heist (2016)",
  "genres": [
    "Action",
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.6,
  "director": [
    {
      "id": "nm0579079",
      "name": "Mike Mendez"
    }
  ],
  "writer": [
    {
      "id": "nm0828945",
      "name": "Guy Stevenson",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0738433",
      "name": "Henry Rollins",
      "character": "Bernard"
    },
    {
      "id": "nm2650700",
      "name": "Torrance Coombs",
      "character": "Paul"
    },
    {
      "id": "nm0695560",
      "name": "Victoria Pratt",
      "character": "Pascal"
    },
    {
      "id": "nm0420926",
      "name": "Mykel Shannon Jenkins",
      "character": "Washington"
    },
    {
      "id": "nm1891137",
      "name": "Nick Principe",
      "character": "Biggs"
    },
    {
      "id": "nm1193110",
      "name": "Mark Kelly",
      "character": "AJ"
    },
    {
      "id": "nm1719608",
      "name": "Ken Lyle",
      "character": "Rick"
    },
    {
      "id": "nm1640351",
      "name": "Kristina Klebe",
      "character": "Tracey"
    },
    {
      "id": "nm3435091",
      "name": "Zo Zosak",
      "character": "Harris"
    },
    {
      "id": "nm0639621",
      "name": "John O'Brien",
      "character": "Manager Mark"
    },
    {
      "id": "nm2874635",
      "name": "Ace Marrero",
      "character": "Santiago"
    },
    {
      "id": "nm0948718",
      "name": "John J. York",
      "character": "Sinclair"
    },
    {
      "id": "nm0828945",
      "name": "Guy Stevenson",
      "character": "Jones"
    },
    {
      "id": "nm0223205",
      "name": "Fay DeWitt",
      "character": "Mrs. Waxman"
    },
    {
      "id": "nm1595746",
      "name": "Courtney Compton",
      "character": "Cynthia"
    },
    {
      "id": "nm0638412",
      "name": "Cris D'Annunzio",
      "character": "Smith"
    },
    {
      "id": "nm0186060",
      "name": "Robert Craighead",
      "character": "Franklin"
    },
    {
      "id": "nm1277604",
      "name": "Steve Suh",
      "character": "Chen"
    },
    {
      "id": "nm0101603",
      "name": "Lombardo Boyar",
      "character": "Vendor"
    },
    {
      "id": "nm2735837",
      "name": "Graham Denman",
      "character": "Tech"
    },
    {
      "id": "nm3022685",
      "name": "Johnny Rey Diaz",
      "character": "Cop #3"
    },
    {
      "id": "nm2180928",
      "name": "Camilla Jackson",
      "character": "Ally"
    },
    {
      "id": "nm2971607",
      "name": "Michael Aaron Milligan",
      "character": "Danny"
    },
    {
      "id": "nm0639625",
      "name": "John O'Brien",
      "character": "Mark"
    }
  ],
  "overview": "A bank heist descends into violent chaos when one of the hostages turns out to be a serial killer. Trapping the well-organized team of bank robbers in the building, the killer is now picking them off one by one.",
  "storyline": "A bank Robbery goes terribly wrong when one of the hostages turns out to be a wanted serial killer",
  "plot": "Joe Moore runs a ring of professional thieves, which includes Bobby Blane, Don \"Pinky\" Pincus and Joe's wife Fran. During a robbery of a New York City jewelry store, Joe's face is captured by a security camera after he takes off his mask in an attempt to distract the store's last remaining employee. As both the picture and a witness can identify him, Joe retires from crime and plans to disappear on his sail boat with his wife.\n\nThis does not sit well with Joe's fence, Mickey Bergman, who runs a garment business as a front. After accruing a number of expenses in setting up another robbery, Bergman decides to withhold the payment due to Joe and his crew. He insists they go through with the other job — robbing an airplane carrying a large shipment of gold. Bergman further insists that his nephew, Jimmy Silk, be a part of the crew. Joe accepts, but a series of shifting loyalties changes the complexity of their task, including Jimmy's interest in Joe's wife and Bergman and Jimmy's belief that Joe's skills are declining.\n\nThey attempt to rob the plane twice. In their first attempt, while setting up explosive devices along the border of the airport, they are stopped by a passing officer. While Joe and Bobby talk the officer into leaving, an agitated Jimmy draws his gun but is stopped by Pinky. He forces his team out of finishing the job after he finds out that Pinky didn't destroy the getaway car, covered in the team's fingerprints. Bergman doesn't accept the team's departure and forces them to finish the job.\n\nThe plane robbery is a series of misdirects. Pinky poses as a guard while Joe, Bobby, and Jimmy pose as airport security personnel. They stop the jet, pretending to be responding to an emergency. They fill a van with what they take from the plane, then move the van to a rented garage on the airport grounds, where they re-brand it and call for a tow truck to have it hauled away.\n\nJimmy betrays the others to steal the gold and Fran. He knocks out Joe and tells Fran he knew Joe changed the plan. He and Fran take the van, but Jimmy finds out that the hidden compartments are filled with metal washers. Joe avoids arrest and returns to the plane in disguise. He and Bobby remove a shipment of goods they had booked on board the same Swiss flight, which they insist now must be driven to its destination due to the plane's delay. Inside the shipment is the stolen gold, which Joe and Bobby melt into long rods.\n\nBergman apprehends Pinky, who is walking his niece to the school bus. Pinky discloses the plan in order to save his niece. Bergman and his crew arrive at Joe's sail boat along with Jimmy and Fran, where they hold Joe at gunpoint. They notice the boat railings are golden. Fran leaves with Jimmy, pleading with Bergman to give Joe some money and let him go. The railings are painted and a hidden Bobby opens fire. Bergman's men are killed and Joe kills Bergman.\n\nBobby gives Joe the address to send his share. Joe waits to meet Fran with a new truck filled with black-painted rods. Fran shows up with Jimmy. They take the truck and the gold. Joe gets into an older truck to leave. A black bar in the truck scrapes the garage door, revealing gold underneath. Joe lifts a tarp in the truck bed, revealing the gold rods. He covers the rods with the tarpaulin and drives away.",
  "synopsis": null
}