{
  "imdb_id": "tt4772908",
  "tmdb_id": "408466",
  "douban_id": null,
  "title": "The Land of Mine (2016)",
  "genres": [
    "Documentary"
  ],
  "country": "Finland",
  "version": [
    {
      "runtime": "98 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm1535961",
      "name": "Mika Koskinen"
    }
  ],
  "writer": [
    {
      "id": "nm1535961",
      "name": "Mika Koskinen",
      "description": null
    },
    {
      "id": "nm7391660",
      "name": "Sampsa Oinaala",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1535961",
      "name": "Mika Koskinen",
      "character": "Narrator       (voice)"
    },
    {
      "id": "nm8074006",
      "name": "Jason Marshall",
      "character": "Narrator in English version       (voice)"
    },
    {
      "id": "nm1716511",
      "name": "Tuija Brax",
      "character": "Herself"
    },
    {
      "id": "nm4439104",
      "name": "Sanni Grahn-Laasonen",
      "character": "Herself"
    },
    {
      "id": "nm1927705",
      "name": "Tarja Halonen",
      "character": "Herself"
    },
    {
      "id": "nm1648184",
      "name": "Heidi Hautala",
      "character": "Herself"
    },
    {
      "id": "nm3271909",
      "name": "Hannu Hyvönen",
      "character": "Himself, environmental activist"
    },
    {
      "id": "nm3436677",
      "name": "Lauri Ihalainen",
      "character": "Himself"
    },
    {
      "id": "nm8857967",
      "name": "Eleonoora Karttunen",
      "character": "Herself, environmental activist"
    },
    {
      "id": "nm8857966",
      "name": "Antti Lankinen",
      "character": "Himself, environmental activist"
    },
    {
      "id": "nm0631568",
      "name": "Sauli Niinistö",
      "character": "Himself"
    },
    {
      "id": "nm3379448",
      "name": "Ville Niinistö",
      "character": "Himself"
    },
    {
      "id": "nm7145194",
      "name": "Pekka Perä",
      "character": "Himself"
    },
    {
      "id": "nm2419268",
      "name": "Olli Rehn",
      "character": "Himself"
    },
    {
      "id": "nm1909702",
      "name": "Alexander Stubb",
      "character": "Himself"
    },
    {
      "id": "nm2117016",
      "name": "Matti Vanhanen",
      "character": "Himself"
    },
    {
      "id": "nm3376114",
      "name": "Jan Vapaavuori",
      "character": "Himself"
    }
  ],
  "overview": "Republic of Finland is promoting clean technology by organizing Green Mining seminars where foreign experts tell us how the development of the world is becoming increasingly expensive by 2050. The Earth is running out of resources and mining companies have to use increasingly low-grade metal deposits. Finland aims to be a model country for environmentally friendly mining. Its pioneer project is Talvivaara, which uses new biotechnology to extract nickel, zinc and uranium. Through several charismatic characters, the documentary film The Land Of Mine follows the rise of the biggest nickel mine in Western Europe and the ensuing disasters whose effects continue to reverberate in the nation.",
  "storyline": "How the celebrated billion euro flagship of green mining industry, the Talvivaara mine, built in pristine Finnish wilderness, became an environmental catastrophe, a bottomless money pit, and a source for endless governmental hearings and public discussion and industry sweet talk.",
  "plot": null,
  "synopsis": "As the Earth is running out of resources, mining companies have less and less to exploit.Finland aims to be a model country for environmentally friendly mining and organizing Green Mining seminars to promote clean technology. Foreign experts tell us there how the development of the World is becoming increasingly expensive by 2050. The Earth is running out of resources and mining companies have to use increasingly low-grade metal deposits. Finland aims to be a model country for environmentally friendly mining. Its pioneer project is the Talvivaara mine, which uses new biotechnology to extract low-grade nickel, zinc and uranium.This chronicled film follows the local community whose frustration mounts after predicting and witnessing environmental disasters caused by the mine. It documents the industry's lobbying activities, and its preconceptions on activists. The company issues new shares to survive and tries to restore its reputation with help of PR consultants. It looks at the state government: the attitudes of civil servants who are licensing and supervising environmental permits and promoting sustainable mining industry. Politicians making decisions as the mine is going bankrupt and water levels are rising.Who are the real experts to trust? A farmer, a fisherman, a clergyman, a rally driver; engineers, consultants, ministers and presidents: through several charismatic characters, the documentary film TERRA FAME - Land of Mine follows the tragicomic rise and fall of the biggest nickel mine in Western Europe, the effects of which continue to reverberate in the nation."
}