{
  "imdb_id": "tt4705660",
  "tmdb_id": "411272",
  "douban_id": null,
  "title": "Pa Happy She Ta Yer (2015)",
  "genres": [
    "Comedy"
  ],
  "country": "Thailand",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.1,
  "director": [
    {
      "id": "nm7346537",
      "name": "Prueksa Amaruji"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm7346538",
      "name": "Khemanit Jamikorn",
      "character": "Pesuk"
    },
    {
      "id": "nm7346539",
      "name": "Ben Chalatit Tantiwut",
      "character": "Golffy"
    },
    {
      "id": "nm7938174",
      "name": "Jitpanu Klomkaew",
      "character": "Tul"
    },
    {
      "id": "nm5099585",
      "name": "Marius Robin Schroeter",
      "character": "Bob"
    }
  ],
  "overview": "\"Pancake - Khemanit Jamikorn\" role \"in joy\" over her head full access fittings. And the belief that the slogan of \"Happy's... Well, out!\" I do not bother to come. Just her smile is like suffering two strokes, it evaporates easily gone wrong. But as fate bullying and strong cafe on it! On one happy face every message fortune to third bounced fired from a job, man, like a bully to a fan, but also heart disease, arrhythmias, severe eligible Saint Death preceded another within one month. (Huh?), it is Feng Fu had to find a way to get his life back happy again! Then happy I found a way to survive until the clips on YouTube, stating that if she beats all day, then it will survive. .. (Huh? Hide serious?!) Coincided with the \"Coffee Club\" (Ben - Chalatit Tanti's) sidekick Wong bite invented choreography T26 fitted out like this she had to dance! dance! dance! ... Beating dead!",
  "storyline": "Miss Happy stars Pancake Khemanit as a happy-go-lucky woman named Happy, who often annoys her best friend Golfie (Ben Chalatit). Unfortunately, Happy is diagnosed with having an irregular heartbeat that will likely cause her death within a month. In an effort to survive, Happy looks up information and finds a YouTube video made by Tul, played by Jitpanu Klomkaew (Ball). Tul's video claims that Happy can stay alive if she dances in the way shown in the video.",
  "plot": null,
  "synopsis": null
}