{
  "imdb_id": "tt4741686",
  "tmdb_id": "369780",
  "douban_id": null,
  "title": "Joséphine, Pregnant & Fabulous (2016)",
  "genres": [
    "Comedy"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "94 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm0077622",
      "name": "Marilou Berry"
    }
  ],
  "writer": [
    {
      "id": "nm1142065",
      "name": "Samantha Mazeras",
      "description": "scenario"
    },
    {
      "id": "nm1142065",
      "name": "Samantha Mazeras",
      "description": "dialogue &"
    },
    {
      "id": "nm0077622",
      "name": "Marilou Berry",
      "description": "dialogue"
    },
    {
      "id": "nm4717265",
      "name": "Pénélope Bagieu",
      "description": "characters"
    }
  ],
  "cast": [
    {
      "id": "nm0077622",
      "name": "Marilou Berry",
      "character": "Joséphine"
    },
    {
      "id": "nm0623854",
      "name": "Mehdi Nebbou",
      "character": "Gilles"
    },
    {
      "id": "nm4150929",
      "name": "Medi Sadoun",
      "character": "Marc, le gynéco"
    },
    {
      "id": "nm3939436",
      "name": "Sarah Suco",
      "character": "Sophie"
    },
    {
      "id": "nm3053855",
      "name": "Vanessa Guide",
      "character": "Diane"
    },
    {
      "id": "nm1603574",
      "name": "Cyril Gueï",
      "character": "Cyril"
    },
    {
      "id": "nm0001929",
      "name": "Josiane Balasko",
      "character": "La mère de Joséphine"
    },
    {
      "id": "nm0105317",
      "name": "Patrick Braoudé",
      "character": "Le père de Joséphine"
    },
    {
      "id": "nm0000721",
      "name": "Victoria Abril",
      "character": "La mère de Gilles /              Andrée"
    },
    {
      "id": "nm2984738",
      "name": "Caroline Anglade",
      "character": "Alexandra"
    },
    {
      "id": "nm7910307",
      "name": "Enzo Nyezi-Bapoma",
      "character": "Bakary"
    },
    {
      "id": "nm0414185",
      "name": "Catherine Jacob",
      "character": "Anne de Beauvallet"
    },
    {
      "id": "nm2061338",
      "name": "Nicolas Chupin",
      "character": "Le sage-homme"
    },
    {
      "id": "nm3757235",
      "name": "Bérengère Krief",
      "character": "Chloé"
    },
    {
      "id": "nm0726814",
      "name": "Philippe Rigot",
      "character": "Le serveur"
    },
    {
      "id": "nm0692794",
      "name": "Juliette Poissonnier",
      "character": "La sage-femme"
    },
    {
      "id": "nm0483508",
      "name": "Lise Lamétrie",
      "character": "La responsable crèche"
    },
    {
      "id": "nm0846196",
      "name": "Benoît Tachoires",
      "character": "L'anesthésiste"
    },
    {
      "id": "nm1745769",
      "name": "Lucy Samsoën",
      "character": "La maîtresse"
    },
    {
      "id": "nm8217357",
      "name": "Mehdi Mangal",
      "character": "Assistant pub hôtel"
    },
    {
      "id": "nm6756914",
      "name": "Zahia Dehar",
      "character": "Femme en détresse /              L'égérie"
    },
    {
      "id": "nm8217358",
      "name": "Anna Fournier",
      "character": "Journaliste JRI"
    },
    {
      "id": "nm7079326",
      "name": "Lya Oussadit-Lessert",
      "character": "La petite fille"
    },
    {
      "id": "nm0626158",
      "name": "Jacky Nercessian",
      "character": "Le prêtre"
    },
    {
      "id": "nm8217359",
      "name": "Eleonora Rudakova",
      "character": "Le mannequin"
    },
    {
      "id": "nm7318675",
      "name": "Marjorie Le Noan",
      "character": "Infirmière"
    },
    {
      "id": "nm0056765",
      "name": "Véronique Barrault",
      "character": "La bigote"
    },
    {
      "id": "nm0173353",
      "name": "Marius Colucci",
      "character": "Le pharmacien"
    },
    {
      "id": "nm8217360",
      "name": "Nicolas Rouye",
      "character": "George"
    },
    {
      "id": "nm8217361",
      "name": "Ricardo Arroyo",
      "character": "Fernando"
    },
    {
      "id": "nm1740394",
      "name": "Jean-Pierre Pernaut",
      "character": "Jean-Pierre Pernaut"
    },
    {
      "id": "nm1022803",
      "name": "Tony Gomez",
      "character": "Tony"
    },
    {
      "id": "nm5565785",
      "name": "Marc-Antoine Le Bret",
      "character": "Voix off Cyril - Masterchef       (voice)"
    },
    {
      "id": "nm6895259",
      "name": "Yun Lai",
      "character": "Publicitaire"
    }
  ],
  "overview": "At last, Josephine has found her perfect non-smoker-cat-loving-amazing-cook-perfect-man-soulmate. They’ve been in love for two years and everything is peachy. Until she realizes she’s… pregnant. Time for Josephine to transform her life, mature into a responsible adult, not become like her mother, get a job, hold on to her man, refrain from falling out with her friends, and tell her sister, who's been crashing at her place, that she's got to move out. A bunch of overwhelming challenges that Josephine will have to face in her own, special way.",
  "storyline": "Joséphine and Gilles are totally in love. Everything is perfect. Until she discovers that she's pregnant! Now Joséphine will need to handle with the sudden desires, sex during the pregnancy, ginecologist and much more.",
  "plot": "The film opens in 2001 with a middle-aged Steve Jobs (Ashton Kutcher) introducing the iPod at an Apple Town Hall meeting.\n\nIt then flashes back to Reed College in 1974. Jobs had already dropped out due to the high expense of tuition, but was still attending classes with the approval of Dean Jack Dudman (James Woods) who took him under his wing. Jobs is particularly interested in a course on calligraphy. He meets up with his friend Daniel Kottke (Lukas Haas) who is excited to see that Jobs is holding a copy of Be Here Now by Baba Ram Dass. Influenced by this book and his experiences with LSD, Jobs and Kottke spend time in India.\n\nTwo years later, Jobs is back in Los Altos, California living at home with his adoptive parents Paul (John Getz) and Clara (Lesley Ann Warren). He is working for Atari and develops a partnership with his friend Steve Wozniak (Josh Gad) after he sees that Wozniak has built a personal computer (the Apple I). They name their new company Apple Computer, though there already is a company called Apple Records that is owned by The Beatles (Wozniak then teases Jobs that this is symbolic of his preference for Bob Dylan). Wozniak gives a demonstration of the Apple I at the Homebrew Computer Club. Jobs is later approached by Paul Terrell (Brad William Henke) who shows interest in the Apple I. Knowing that he and Wozniak will need a studio in which to build them, Jobs convinces his father Paul to allow them to use the family garage (set up as a carpentry/tool center) for his new company. Realizing that they cannot build these computers alone, Jobs also recruits Kottke, Bill Fernandez (Victor Rasuk), and Chris Espinosa (Eddie Hassell) to the Apple team.\n\nTerrell, however, is disappointed by the Apple I, a reaction which inspires Jobs to start again with a second model. He hires Rod Holt (Ron Eldard) to reconceptualize the power supply for what would be called the Apple II. In addition, after many failed attempts, Jobs finally wins the interest of a venture capitalist, Mike Markkula (Dermot Mulroney), who also joins Apple. They release the Apple II at the 1977 West Coast Computer Faire where it is a remarkable success. Suddenly Jobs and the company are very successful.\n\nThe success also causes Jobs to distance himself from his friends and his high school girlfriend Chrisann Brennan (Ahna O'Reilly). When Brennan tells him she is pregnant with their child, he promptly ends their relationship. Brennan eventually gives birth to Lisa Brennan whom Jobs continues to deny as his daughter. He also brings in John Sculley (Matthew Modine) to become the CEO of the company. As his behavior becomes more erratic (for example firing an employee for not appreciating his investment in using fonts), Jobs is moved away from The Lisa to the Macintosh Group where he works with Bill Atkinson, Burrell Smith (Lenny Jacobson), Chris Espinosa, and Andy Hertzfeld (Elden Henson). He also forces the original team leader of the Macintosh group, Jef Raskin, out of it. Though the Macintosh is introduced with a great deal of fanfare in 1984, Jobs is forced out of the company by Sculley in 1985.\n\nThe film jumps forward to 1996. Jobs is married to Laurene Powell Jobs (Abby Brammell) and has accepted Lisa (Annika Bertea) as his daughter (she now lives with them). He has a son, Reed (Paul Baretto) and is also running the company NeXT which Apple decides to buy. He is asked by then-CEO Gil Amelio to return to Apple as a consultant. Jobs does so and soon he is named the new CEO, ultimately firing Amelio and his ex-friend Markkula (who refused to support him when he was forced out of Apple 11 years prior). Jobs becomes interested in the work of Jonathan Ive (Giles Matthey) and works to reinvent Apple. The film ends with Jobs recording the dialogue for the Think Different commercial in 1997. Before the credits, there are original photos of all the main characters paired with clips from the film of the actor playing the part, plus a dedication to Steve Jobs.",
  "synopsis": null
}