{
  "imdb_id": "tt4717194",
  "tmdb_id": "342302",
  "douban_id": null,
  "title": "Wizard School (2015)",
  "genres": [
    "Comedy"
  ],
  "country": "Turkey",
  "version": [],
  "imdb_rating": 2.2,
  "director": [
    {
      "id": "nm7355035",
      "name": "Dikmen Erdi"
    }
  ],
  "writer": [
    {
      "id": "nm7355037",
      "name": "Sercan Ates",
      "description": null
    },
    {
      "id": "nm7355036",
      "name": "Erdi Dikmen",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm8497104",
      "name": "Barbaros Dikmen",
      "character": "Mehmet Kocero"
    },
    {
      "id": "nm2498137",
      "name": "Selen Seyven",
      "character": "Aria"
    },
    {
      "id": "nm7973027",
      "name": "Enes Atis",
      "character": "Coff"
    },
    {
      "id": "nm1891974",
      "name": "Seher Terzi",
      "character": "Mehmet's Mother"
    },
    {
      "id": "nm2388027",
      "name": "Yakup Yavru",
      "character": "Mehmet's Father"
    },
    {
      "id": "nm7063252",
      "name": "Melih Madan",
      "character": "David"
    },
    {
      "id": "nm9511069",
      "name": "Selim Karakaya",
      "character": "Demba"
    },
    {
      "id": "nm2070074",
      "name": "Ebru Karanfilci",
      "character": "Emilia"
    },
    {
      "id": "nm2553721",
      "name": "Levent Aykul",
      "character": "Alfred"
    },
    {
      "id": "nm1759831",
      "name": "Ayçe Abana",
      "character": "Teacher"
    },
    {
      "id": "nm7384394",
      "name": "Özlem Aktas",
      "character": "Teacher"
    },
    {
      "id": "nm1742030",
      "name": "Muhittin Korkmaz",
      "character": "Teacher"
    },
    {
      "id": "nm9511070",
      "name": "Rahime Atasayar",
      "character": "Teacher"
    },
    {
      "id": "nm7654200",
      "name": "Ercument Fidan",
      "character": "Teacher"
    },
    {
      "id": "nm6500171",
      "name": "Buse Narci",
      "character": "Cassie"
    },
    {
      "id": "nm9511071",
      "name": "Ekin Gökgöz",
      "character": "Harold"
    },
    {
      "id": "nm9511072",
      "name": "Sercan Tosun",
      "character": "Burton"
    },
    {
      "id": "nm9511073",
      "name": "Yakup Saygili",
      "character": ""
    },
    {
      "id": "nm9511074",
      "name": "Baris Atmaca",
      "character": "Fat Boy"
    },
    {
      "id": "nm8710929",
      "name": "Ugur Can Akgül",
      "character": "Petshop - 3"
    },
    {
      "id": "nm7410305",
      "name": "Mücahit Avci",
      "character": "Baskan"
    },
    {
      "id": "nm4873935",
      "name": "Sadi Celil Cengiz",
      "character": ""
    },
    {
      "id": "nm7406774",
      "name": "Kadir Dogrubakar",
      "character": "Ates Hocasi"
    },
    {
      "id": "nm7406775",
      "name": "Eray Efe",
      "character": "Muavin"
    },
    {
      "id": "nm8661406",
      "name": "Aykut Elmas",
      "character": "Petshop - 1"
    },
    {
      "id": "nm6920443",
      "name": "Leyla Uner Ermaya",
      "character": "Süheyla"
    },
    {
      "id": "nm8661756",
      "name": "Halil Ibrahim Göker",
      "character": "Petshop - 2"
    },
    {
      "id": "nm7835997",
      "name": "Halil Söyletmez",
      "character": "Necmi"
    }
  ],
  "overview": null,
  "storyline": "Sihirbazlik Okulunda Bir Türk",
  "plot": "Earth has been devastated by a nuclear war instigated by five terrorists, and it has taken two million years for the radioactive clouds to once again allow sunlight to reach the surface. Only a handful of humans have survived, while the rest have changed into mutants who roam the radioactive wastelands. In the idyllic land of Montagar, the true ancestors of man&#160;– fairies, elves and dwarves&#160;– have returned and live in peace. During a celebration of 3,000 years of peace Delia, queen of the fairies, falls into a trance and leaves the party. Puzzled, the fairies follow her to her home and discover that she has given birth to twin wizards. Avatar, a kind and good wizard, spends much of his boyhood entertaining his mother with beautiful visions, while Blackwolf, a mutant, never visits his mother, but spends his time torturing small animals.\n\nAfter many years, Delia dies. Blackwolf is excited; he believes he will take over her leadership and rule the land. Avatar opposes his evil brother and forces him to fight for the kingship. Avatar's magic is empowered by his grief, allowing him to defeat Blackwolf. Blackwolf leaves Montagar with a vow to return and \"make this a planet where mutants rule\".\n\nYears later, Blackwolf has risen to lead the dark land of Scortch, where he and his vast army of goblins, ogres and mutants salvage and restore ancient technology. He tries to attack Montagar twice, but is foiled both times when his mutant warriors become bored or sidetracked in the midst of battle. Blackwolf then discovers an old projector and reels of Nazi propaganda footage. He enhances the projector with magical power and uses it in battle to both inspire his own soldiers and horrify enemy troops. The mutants destroy the elf army.\nPeace, Avatar, Weehawk and Elinore.\nMeanwhile, in Montagar, Avatar has become a tutor tasked with training the president's daughter Elinore to become a full-fledged fairy. Suddenly, the president is assassinated by Necron 99, a robot sent by Blackwolf to kill believers in magic. Avatar confronts the robot and battles it using brain reading. Necron 99 loses the desire for war and changes his name to Peace. Avatar learns from the robot that the \"dream machine\"&#160;– the projector&#160;– is Blackwolf's secret weapon, inspiring his armies with images of ancient warfare. Avatar, Elinore, Peace, and the elf spy Weehawk set out to destroy the projector and save the world from another Holocaust.\n\nIn a forest inhabited by fairies, Peace has an intuition that something is amiss shortly before the group is accosted by the leader of the fairies, Sean (Mark Hamill). Weehawk realizes that Peace is missing, when an unseen assassin kills Sean and kidnaps Elinore. Avatar and Weehawk begin to search for Elinore in the forbidden Fairy Sanctuary, but Weehawk falls into a chasm and insists that Avatar leave him and find the girl. He locates her, captured by fairies and small human-like creatures, just as she is about to be killed. Avatar attempts to explain that they did not kill Sean, but the fairies don't believe him, and shoot him with an arrow. Wounded in the shoulder, Avatar refuses to fight back, which impresses the fairy king. Instead of executing them, he merely teleports Avatar and Elinore to a snowy mountaintop. Avatar and Elinore resume their journey despite the poor conditions, but they soon realize they are wandering in circles. Weehawk and Peace finally find them and together they find their way out of the mountains. Soon Avatar and the others encounter the encamped army of an elf General who is preparing to attack Scortch the following day, but Blackwolf launches a sneak attack that night. Elinore is outside with Peace when one of Blackwolf's mutants sneaks into camp and attacks her, but Avatar is able to stop it before it hurts her. Things turn for the worse, though, as a battle tank arrives to destroy the camp. Peace manages to disable the crew, but as he inspects the vehicle, Elinore kills him with a sword and climbs into the tank. It drives away as Avatar and Weehawk watch in confusion.\n\nThe next day, Avatar and Weehawk enter Scortch by ship and make for Blackwolf's castle while the General leads his elf warriors in a bloody battle to distract Blackwolf's forces. The pair splits up, Weehawk tracking Elinore while Avatar goes after his brother Blackwolf. Weehawk nearly kills Elinore, but she explains that Blackwolf had been controlling her mind ever since she first touched Peace. Blackwolf declares his magic superior to Avatar's and demands his surrender. Avatar admits that he hasn't practiced magic in some time, and offers to show Blackwolf one last trick that their mother showed him when Blackwolf wasn't around. Avatar then pulls a gun and fatally shoots Blackwolf. With the loss of their leader, the mutants give up fighting. With Montagar's safety secured, Weehawk returns home as the new ruler, but Avatar and Elinore decide to go start their own kingdom instead.",
  "synopsis": null
}