{
  "imdb_id": "tt4789296",
  "tmdb_id": "376275",
  "douban_id": null,
  "title": "Temporal (2015)",
  "genres": [
    "Drama"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "79 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.9,
  "director": [
    {
      "id": "nm3418486",
      "name": "Rob Burrows"
    }
  ],
  "writer": [
    {
      "id": "nm4485866",
      "name": "Theodore Divanis",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4485866",
      "name": "Theodore Divanis",
      "character": "Jake"
    },
    {
      "id": "nm7403575",
      "name": "Sarah Rumfitt",
      "character": "Melissa"
    },
    {
      "id": "nm2834384",
      "name": "Roger Bowmer",
      "character": "Senior Jake"
    },
    {
      "id": "nm7458727",
      "name": "Susan Bowmner",
      "character": "Senior Melissa"
    },
    {
      "id": "nm6093949",
      "name": "Harriet Ghost",
      "character": "Jennifer"
    },
    {
      "id": "nm3418486",
      "name": "Rob Burrows",
      "character": "Dr. Wolfgang Erikson"
    },
    {
      "id": "nm5048275",
      "name": "Nathaniel King Kai Smith",
      "character": "Evan"
    },
    {
      "id": "nm3908229",
      "name": "Jason Savin",
      "character": "Colin"
    },
    {
      "id": "nm7403576",
      "name": "Michael Collier",
      "character": "Enemy Enactment Soldier"
    },
    {
      "id": "nm7403577",
      "name": "Kate Hope",
      "character": "Teenage Jennifer"
    },
    {
      "id": "nm2242263",
      "name": "Alex Parkin-Goodchild",
      "character": "Teenage Jake"
    },
    {
      "id": "nm7403578",
      "name": "George Proud",
      "character": "Uncle Frank"
    },
    {
      "id": "nm7270403",
      "name": "Nik Grundison",
      "character": "Carla"
    },
    {
      "id": "nm6545086",
      "name": "Barbara French",
      "character": "Talking Head 1"
    },
    {
      "id": "nm7606016",
      "name": "Graham Lee",
      "character": "Mr. Dickens"
    },
    {
      "id": "nm7410812",
      "name": "Jo Newton",
      "character": "Young Jake's Mother"
    },
    {
      "id": "nm7403579",
      "name": "Daniel Petty",
      "character": "Talking Head 2"
    },
    {
      "id": "nm7403588",
      "name": "Samantha Giampaoli",
      "character": "Girl Reading Poem"
    },
    {
      "id": "nm7403580",
      "name": "Chris Hopper",
      "character": "Talking Head 3"
    },
    {
      "id": "nm2071049",
      "name": "Mark Burrows",
      "character": "Young Jake"
    },
    {
      "id": "nm7403581",
      "name": "Jo Newton",
      "character": "Young Jake's Mother"
    },
    {
      "id": "nm7410813",
      "name": "Sophie Newton",
      "character": "Toddler Jake's Mother"
    },
    {
      "id": "nm7410814",
      "name": "John Robinson",
      "character": "Spaceman Patient"
    },
    {
      "id": "nm7403582",
      "name": "Brian Soulsby",
      "character": "Jake's Father"
    },
    {
      "id": "nm7403583",
      "name": "Maximus Divanis",
      "character": "Toddler Jake"
    },
    {
      "id": "nm7403584",
      "name": "Sophie Newton",
      "character": "Toddler Jake's Mother"
    },
    {
      "id": "nm7361764",
      "name": "Rebekah Gray",
      "character": "Dancing Patient"
    },
    {
      "id": "nm7403585",
      "name": "John Robinson",
      "character": "Spaceman patient"
    },
    {
      "id": "nm5857405",
      "name": "Harriet Divanis",
      "character": "Head Banging Patient"
    },
    {
      "id": "nm7410815",
      "name": "Rebecca Edwards",
      "character": "Waitress"
    },
    {
      "id": "nm7410816",
      "name": "Gemma Wheelam",
      "character": "College Lecturer"
    },
    {
      "id": "nm7403589",
      "name": "Keeran Stephenson",
      "character": "Unhelpful Student"
    },
    {
      "id": "nm7403590",
      "name": "Victroria Dugdale",
      "character": "Late arrival student one"
    },
    {
      "id": "nm7403591",
      "name": "Tori McCallagh",
      "character": "Late arrival student two"
    },
    {
      "id": "nm7403592",
      "name": "Meagan Giles",
      "character": "College student"
    },
    {
      "id": "nm1706206",
      "name": "Nicole Glover",
      "character": "College student"
    },
    {
      "id": "nm7403593",
      "name": "Victoria Morrison",
      "character": "College student"
    },
    {
      "id": "nm7403594",
      "name": "Laura Ashworth",
      "character": "College student"
    },
    {
      "id": "nm7412826",
      "name": "Georgia Beth",
      "character": "College student"
    },
    {
      "id": "nm7412828",
      "name": "Turner Chloe",
      "character": "College student"
    },
    {
      "id": "nm7403598",
      "name": "Dana Barker",
      "character": "College Student"
    },
    {
      "id": "nm7462228",
      "name": "Rachel Dicken",
      "character": "College student"
    },
    {
      "id": "nm7403600",
      "name": "Bobby Mitchell",
      "character": "College student"
    },
    {
      "id": "nm7412820",
      "name": "Hannah Robinson",
      "character": "TV news reader       (voice)"
    },
    {
      "id": "nm7412821",
      "name": "Sophanie Ann Cottin",
      "character": "TV News reader       (voice)"
    },
    {
      "id": "nm5115066",
      "name": "Christopher Tose",
      "character": "Man in camp shop"
    },
    {
      "id": "nm7403601",
      "name": "Charles Boucher",
      "character": "Man at camp reception"
    }
  ],
  "overview": "Traumatised by the sudden death of his girlfriend Jake opens a door to a bizarre and surreal journey that leads him to question reality. (Four nominations).",
  "storyline": "Jake is a survivor, a skill that will be tested. Traumatised by the sudden death of his girlfriend he is torn apart by the savagery of his loss. But a new and very real threat emerges; Jake opens a door to a bizarre and surreal journey that leads him to question reality: Has he lost his mind or are his experiences real? After facing a challenge by an enigmatic guide called Evan Jake finds himself in an asylum. As he recaps episodes in his life he struggles with demons from his past brought to life so vividly by his crisis. As Jake struggles to come to terms with his girlfriend's death he fears he will be stuck in time in this alternate reality. Fighting to find a gateway home and helped by a new found love his life journey leads to a revealing conclusion in the pensive psychological drama. (Four nominations).",
  "plot": "This section's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (November 2016) (Learn how and when to remove this template message)\nThe film begins in medias res as a time travelling agent is trying to disarm a bomb that explodes and burns his face. Someone approaches and helps him to grasp his time travelling device, then brings him to a hospital in the future. While the agent is recovering from facial reconstruction, we learn that he has been trying to prevent the \"Fizzle Bomber\"'s attack on New York, in 1975. After his recovery he receives his last assignment.\n\nThe agent moves to 1970 New York. As a bartender, he starts a conversation with one of the customers. The customer, John, writes true confession articles under the pen name \"The Unmarried Mother\". This pseudonym is explained by his own life story, which he tells the bartender. The customer grew up as \"Jane\" in an orphanage. She excelled in her studies but had difficulty fitting in. Jane decided any children she had would be raised in a proper family, and thus avoided relationships. As an adult she applied for a program called \"Space Corp\", which promised women the chance to go to space while providing astronauts R&amp;R, but she was later disqualified because of a medical condition which she was not informed of, which a man named Robertson was interested in. Jane later met a man who said he was waiting for someone. The two fell in love with each other, but later the man disappeared. Robertson approached Jane, revealing that Space Corp worked for the Temporal Agency, and this agency now wanted to recruit her. They broke off contact when it was discovered that Jane was pregnant with her ex-lover's baby. While performing a Caesarean section, doctors discovered she was intersex, with internalized male sex organs as well as female sex organs. Complications during the birth forced them to remove her female sex organs, and she had to undergo a gender reassignment and begin living as a man. Furthermore, the baby was stolen by a mysterious man. Since then, John has been living a bitter life as \"The Unmarried Mother\".\n\nThe agent offers to take John back to the day that Jane met the lover who left her, so John can take revenge and kill him for ruining her life. In return, John will take over the agent's job for whatever duration he wishes. The agent reveals his time travel device and the two jump to that day in 1963. John prepares to kill his past lover before he can meet Jane. While waiting, he encounters Jane, and when they begin talking, John realizes that Jane's lover was him. The baby born from this \"self-fertilization\" is stolen by the agent and brought to the orphanage 18 years earlier, in 1945. Therefore, Jane, John, and their baby are the same person, revealing a predestination paradox.\n\nThe agent goes to 1975 New York, where he helps the burned man from the beginning of the film. The agent returns to 1963, a few months after he dropped John off. John has to leave Jane behind and is brought to the Temporal Agency. He now takes over the job so the agent can retire in 1975 New York, close to the day of the Fizzle Bomber's attack. The agent's time-travel device does not decommission itself as planned and can still be used. He has been ordered to check a launderette at the moment the Fizzle Bomber will be there. The Fizzle Bomber turns out to be the agent's own future self, now suffering from psychosis as a result of excessive time travel. The Fizzle Bomber insists that his actions have saved and will save more lives than the lives lost, and that they ultimately lead to the reinforcement of the Temporal Agency. He tries to convince the agent that the only way to end the cycle is to spare his life, unlike the Fizzle Bomber did in his past. The agent denies he will ever become the Fizzle Bomber and kills his future self.\n\nThe film finally reveals that in 1975, John is the man who travelled to New York and was burned while disarming a bomb. His subsequent facial reconstruction significantly changes his appearance, and it is now clear that Jane, John, the agent, and the Fizzle Bomber are the same person. This agent's creation was orchestrated by Robertson to create an agent who has no ties to time. This \"perfect\" temporal agent was responsible for both his own conception and death; he has driven the predestination paradox to its limit.",
  "synopsis": null
}