{
  "imdb_id": "tt4708348",
  "tmdb_id": "342657",
  "douban_id": null,
  "title": "The Silenced (2015)",
  "genres": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "country": "South Korea",
  "version": [
    {
      "runtime": "99 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm3122293",
      "name": "Hae-young Lee"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm6718695",
      "name": "Won-Hee Go",
      "character": "Shizuko"
    },
    {
      "id": "nm8471274",
      "name": "Ryun Jo",
      "character": "Housework Teacher"
    },
    {
      "id": "nm6975783",
      "name": "Bo-Bi Joo",
      "character": "Kihara"
    },
    {
      "id": "nm6642429",
      "name": "Dong-Hyun Kim",
      "character": "Driver"
    },
    {
      "id": "nm6020340",
      "name": "Ye-ji Kong",
      "character": "Yuka"
    },
    {
      "id": "nm8471275",
      "name": "Sun-Ah Lee",
      "character": "1st Phase Girl"
    },
    {
      "id": "nm3291520",
      "name": "Bo-Young Park",
      "character": "Joo-ran"
    },
    {
      "id": "nm6844186",
      "name": "Joo-hee Park",
      "character": "Joo-Ran's Mother"
    },
    {
      "id": "nm8471273",
      "name": "Se-In Park",
      "character": "Eguchi"
    },
    {
      "id": "nm5374082",
      "name": "Seong-yeon Park",
      "character": "Counselor"
    },
    {
      "id": "nm6476224",
      "name": "So-dam Park",
      "character": "Yeon-duk"
    },
    {
      "id": "nm8471276",
      "name": "Mi-Ji Seo",
      "character": "2nd Phase Girl"
    },
    {
      "id": "nm5396086",
      "name": "Hee-seop Sim",
      "character": "Kenji"
    },
    {
      "id": "nm1392076",
      "name": "Ji-won Uhm",
      "character": "Headmistress"
    }
  ],
  "overview": "A sickly girl Ju-ran transfers to a new sanitorium boarding school to regain health. But she discovers that students are disappearing and notices abnormal changes happening to her body. She suspects the school for what's happening and tries to discover what secret is hidden.",
  "storyline": "Korea in year 1938. Joo-ran is a sickly girl who is transferred to the Gyeongseong Boarding School for ill girls. She is given a new name; Shizuko. At first life seems to be not different from other boarding schools. Joo-ran learns that before she came, another girl named Shizuko had suddenly left the school without saying goodbye to her friends. Soon after other girls in the class are reported to have gone home as well, after disappearing in odd circumstances. Now the young girl is confident, that there is something wrong about the Gyeongseong School. Joo-ran starts a risky research to uncover the secrets surrounding the school, which puts her life in danger.",
  "plot": "Set in Gyeongseong in 1938 during the Japanese occupation, Ju-ran (Shizuko) is a sickly young girl who gets transferred to a sanatorium/girls' boarding school to recover her health. Her physical condition improves thanks to her new friend Yeon-deok, and the headmistress's special treatment program. But she soon notices that students are disappearing one by one and that her own body is undergoing abnormal changes. Determined to uncover the truth, Ju-ran starts to investigate the mysterious happenings and the school's possible role in them.\n\nShizuko begins seeing a couple of her classmates in terrible positions; bleeding out or having severe seizures. The school denies that anything unusual is happening in an effort to convince Shizuko that it is all in her head. After being confronted by her classmate Yuka, Shizuko snaps and in a violent rage almost strangles Yuka to death with a single hand showing incredible strength. Shizuko does not understand what is happening to her or to the other girls in the school and with the help of Yeon-deok, who now recalls other horrors from her time there, decides to investigate by breaking into the headmistress' office. While in the headmistress' office, they overhear an argument between her and a young man dressed in a Japanese military uniform. The argument is about a new drug and apparently losing test subjects, referring to Shizuko's disappearing classmates. When the headmistress and the soldier leave the office, Shizuko and Yeon-deok continue their snooping eventually finding an experiment proposal written in Japanese describing a drug that aims to alter the human condition making the subjects super strong but also heightening their emotions and causing many adverse side-effects. Shizuko and Yeon-deok also find video recordings of themselves and a previous cohort that demonstrate the effects of the drug. The two students then hear a commotion outside culminating in the attempted suicide of Yuko. They try to escape the school into the forest in the chaos, only to find that they were at the edge of a massive Japanese military base. The film is a scathing critique of Japanese imperialism and shows the resilience of two young Korean girls that attempt to live free.",
  "synopsis": null
}