{
  "imdb_id": "tt4791388",
  "tmdb_id": "357598",
  "douban_id": null,
  "title": "The Apartment: About Last Night (TV Movie 2015)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "Trinidad and Tobago",
  "version": [
    {
      "runtime": "50 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm1055839",
      "name": "Juliette McCawley"
    }
  ],
  "writer": [
    {
      "id": "nm7405319",
      "name": "Janine Charles-Farray",
      "description": null
    },
    {
      "id": "nm4913112",
      "name": "Pauline Mark",
      "description": null
    },
    {
      "id": "nm1055839",
      "name": "Juliette McCawley",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4913112",
      "name": "Pauline Mark",
      "character": "Ayanna St. Clair"
    },
    {
      "id": "nm7405309",
      "name": "Russell Wilkinson-Taitt",
      "character": "Akeel Sampson"
    },
    {
      "id": "nm5469489",
      "name": "Jamie Lee Phillips",
      "character": "Janelle Martin"
    },
    {
      "id": "nm5927867",
      "name": "Brett Bengochea",
      "character": "Derrick Pereira"
    },
    {
      "id": "nm7405308",
      "name": "Michelle Nadia Abraham",
      "character": "Michelle Costa"
    },
    {
      "id": "nm3737941",
      "name": "Stephen Hadeed Jr.",
      "character": "Eric"
    },
    {
      "id": "nm5225247",
      "name": "Grace Aberdeen",
      "character": ""
    },
    {
      "id": "nm7405317",
      "name": "Ahmad Ali",
      "character": "Guy 3"
    },
    {
      "id": "nm7409654",
      "name": "Michael Badal",
      "character": "Party Guest 3"
    },
    {
      "id": "nm7405314",
      "name": "Anokha Baptiste",
      "character": "Germaine"
    },
    {
      "id": "nm7409653",
      "name": "Kimberly Baptiste",
      "character": "Bank Worker 2"
    },
    {
      "id": "nm7409657",
      "name": "Mercedes Boodoo",
      "character": "Fashion Intern 1"
    },
    {
      "id": "nm7047875",
      "name": "Marie Chan-Durity",
      "character": "Yvette"
    },
    {
      "id": "nm6678227",
      "name": "Stacey Clarke",
      "character": "Sascha"
    },
    {
      "id": "nm7409660",
      "name": "Joanna D'Abreau",
      "character": "Young Janelle"
    },
    {
      "id": "nm6802854",
      "name": "Frances De Lancey",
      "character": "Kerry"
    },
    {
      "id": "nm7409658",
      "name": "Victoria DeFreitas",
      "character": "Fashion Intern 2"
    },
    {
      "id": "nm7457898",
      "name": "Soraya Lauren Duncan",
      "character": "Extra"
    },
    {
      "id": "nm2218145",
      "name": "Keon Francis",
      "character": "Party Guest 2"
    },
    {
      "id": "nm7420735",
      "name": "Claire Freakley",
      "character": "Extra"
    },
    {
      "id": "nm7409655",
      "name": "Cherisse Gibson",
      "character": "Extra"
    },
    {
      "id": "nm7420736",
      "name": "Peter Anthony Glaes",
      "character": ""
    },
    {
      "id": "nm7405310",
      "name": "Karla Gonzales",
      "character": "Anne St. Clair"
    },
    {
      "id": "nm6932992",
      "name": "Brigette Griffith",
      "character": "(as Bridgette Griffith)"
    },
    {
      "id": "nm7405315",
      "name": "Jason Jairam",
      "character": "Guy 1"
    },
    {
      "id": "nm7405318",
      "name": "Antoeneff Giselle Jimenez",
      "character": "Party Guest 1"
    },
    {
      "id": "nm7410370",
      "name": "Stacy Khan",
      "character": ""
    },
    {
      "id": "nm7405316",
      "name": "Shane Lee Kit",
      "character": "Guy 2"
    },
    {
      "id": "nm7409662",
      "name": "Brittany Lela",
      "character": "Extra"
    },
    {
      "id": "nm7410371",
      "name": "Gevelle-Marie Lezama",
      "character": ""
    },
    {
      "id": "nm7409651",
      "name": "Maria Lovero",
      "character": "Bank Worker 3"
    },
    {
      "id": "nm7405313",
      "name": "Ryan Martinez",
      "character": "Mr. Samlalsingh"
    },
    {
      "id": "nm6770511",
      "name": "MzMuffin",
      "character": "Irene Martin"
    },
    {
      "id": "nm5192634",
      "name": "Gina Parris",
      "character": "Gossipy Girl"
    },
    {
      "id": "nm7133169",
      "name": "Shari Petti",
      "character": "Extra"
    },
    {
      "id": "nm7409656",
      "name": "Kerima Rahim",
      "character": "Extra"
    },
    {
      "id": "nm5706982",
      "name": "Charles Reid",
      "character": "Party Guest 4"
    },
    {
      "id": "nm7405311",
      "name": "Sonya Roche-Duncan",
      "character": "Katherine Dyette"
    },
    {
      "id": "nm6521524",
      "name": "Cecilia Salazar",
      "character": "Gloria Costa"
    },
    {
      "id": "nm7420134",
      "name": "Chelsea-Marie Scope",
      "character": "Young Ayanna St.Clair"
    },
    {
      "id": "nm4678982",
      "name": "Chris Paul Smith",
      "character": "Kevin Singh"
    },
    {
      "id": "nm2822571",
      "name": "Rhoma Spencer",
      "character": "Ms. BB"
    },
    {
      "id": "nm4768950",
      "name": "Caroline Neisha Taylor",
      "character": "Jamie"
    },
    {
      "id": "nm7409652",
      "name": "Blaine Thomas",
      "character": "Bank Worker 1"
    },
    {
      "id": "nm7049504",
      "name": "Jodie Marie Williams",
      "character": "Extra"
    }
  ],
  "overview": "The Apartment: About Last Night centres around Ayanna, Janelle and Michelle; three women in their mid-twenties living together in an upscale apartment in Maraval and all their new experiences as burgeoning adults and roommates. The Pilot movie explores all the possible scenarios and situations that often occur when people (particularly women) live together and share a confined space.",
  "storyline": "Michelle Costa and Ayanna St. Clair move into their new upscale apartment. Their plans are foiled by the arrival of Ayanna's troubled cousin, Janelle.",
  "plot": "A dark-haired woman is the sole survivor of a car accident on Mulholland Drive, a winding road high in the Hollywood Hills. Injured and in shock, she makes her way down into Los Angeles and sneaks into an apartment. Later that morning, an aspiring actress named Betty Elms arrives at the apartment, which is normally occupied by her aunt. Betty is startled to find the woman, who has amnesia and assumes the name \"Rita\" after seeing a poster for the film Gilda starring Rita Hayworth. To help the woman remember her identity, Betty looks in Rita's purse, where she finds a large amount of money and an unusual blue key.\n\nAt a diner called Winkie's, a man tells his companion about a nightmare in which he dreamt there was a horrible figure behind the diner. When they investigate, the figure appears, causing the man with the nightmare to collapse in fright. Elsewhere, director Adam Kesher has his film commandeered by mobsters, who insist that he cast an unknown actress named Camilla Rhodes as the lead in his film. Kesher resists, but after being thrown out of his house when he finds his wife cheating on him, he learns that his bank has closed his line of credit and he is broke. He agrees to meet a mysterious figure called The Cowboy, who urges him to cast Camilla Rhodes for his own good. Later, a bungling hit man attempts to steal a book full of phone numbers and leaves three people dead.\n\nWhile trying to learn more about Rita's accident, Betty and Rita go to Winkie's and are served by a waitress named Diane, which causes Rita to remember the name \"Diane Selwyn\". They find Diane Selwyn in the phone book and call her, but she does not answer. Betty goes to an audition, where her performance is highly praised. A casting agent takes her to a soundstage where a film called The Sylvia North Story, directed by Kesher, is being cast. When Camilla Rhodes auditions, Kesher capitulates to casting her. Betty locks eyes with Adam, but she flees before she can meet him, saying that she is late to meet a friend.\n\nBetty and Rita go to Diane Selwyn's apartment and break in when no one answers the door. In the bedroom they find the body of a woman who has been dead for several days. Terrified, they return to their apartment, where Rita disguises herself with a blonde wig. She and Betty make love. At 2 a.m., Rita insists that they go to a theater called Club Silencio. The emcee explains in several languages that everything is an illusion; Rebekah Del Rio comes on stage and begins singing the Roy Orbison song \"Crying\" in Spanish, then collapses, while her vocals continue – the performance was a recording. Betty finds a blue box in her purse that matches Rita's key. Upon returning to the apartment, Rita retrieves the key and finds that Betty has disappeared. Rita unlocks the box, and it falls to the floor with a thump.\n\nDiane Selwyn wakes up in her bed in the same apartment that Betty and Rita investigated. She looks exactly like Betty, but is a failed actress driven into a deep depression by her failed affair with Camilla Rhodes, who looks exactly like Rita. On Camilla's invitation, Diane attends a party at Adam's house on Mulholland Drive. At dinner, Diane states that she came to Hollywood when her aunt died, and met Camilla at an audition for The Sylvia North Story. Another woman kisses Camilla, and they turn and smile at Diane. Adam and Camilla prepare to make an important announcement, and dissolve into laughter and then kiss while Diane watches, crying.\n\nIn her apartment, Diane finds a blue key on her coffee table—a key that the hit man had told her she would find when he had finished killing Camilla for her. Distraught, she is terrorized by hallucinations. She runs screaming to her bed, where she shoots herself. A woman at the club whispers \"Silencio\".",
  "synopsis": null
}