{
  "imdb_id": "tt4769476",
  "tmdb_id": "361629",
  "douban_id": null,
  "title": "G: Lost in Frankfurt (2015)",
  "genres": [
    "Drama"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "88 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.2,
  "director": [
    {
      "id": "nm2096372",
      "name": "George Dare"
    }
  ],
  "writer": [
    {
      "id": "nm2096372",
      "name": "George Dare",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3518596",
      "name": "Krzysztof Broda-Zurawski",
      "character": "(as Kristof Broda)"
    },
    {
      "id": "nm2096372",
      "name": "George Dare",
      "character": ""
    },
    {
      "id": "nm7388361",
      "name": "Damiano Gaumann",
      "character": ""
    },
    {
      "id": "nm7388365",
      "name": "Normen Kraft",
      "character": ""
    },
    {
      "id": "nm7388364",
      "name": "Andreas Kriener",
      "character": ""
    },
    {
      "id": "nm7388366",
      "name": "Veronika Kriener",
      "character": ""
    },
    {
      "id": "nm7388362",
      "name": "David Sembritzki",
      "character": ""
    },
    {
      "id": "nm7388367",
      "name": "Marco Siefert",
      "character": ""
    }
  ],
  "overview": "Kris cant land a job in Warsaw and is now trying his luck in Frankfurt, where he ends up in a design underwear store for men. After some initial difficulties he explores the foreign city in which he must now find his way around. When he gets to know Damiano at the shop, a young extremely attractive guy who wants to show him Frankfurt, he accepts the offer gladly. After tentative touches and intense eye contact a passionate affair ensues within one day.  G is a small study on the excitement a new life can bring. The film talks about the many levels of sensing and experiencing the complexity of the big city with its electronic music, clubs and the licentious sex between men under the influence of the fashionable drug G (GBL). Trying to find the very essence of life and love without ever getting enough of each, and the sneaking onset of disillusionment.",
  "storyline": "G is a small study on the excitement a new life can bring. The film talks about the many levels of sensing and experiencing the complexity of the big city with its electronic music, clubs and the licentious sex between men under the influence of the fashionable drug G (GBL). Trying to find the very essence of life and love without ever getting enough of each, and the sneaking onset of disillusionment.",
  "plot": null,
  "synopsis": "Kris cant land a job in Warsaw and is now trying his luck in Frankfurt, where he ends up in a design underwear store for men. After some initial difficulties he explores the foreign city in which he must now find his way around. When he gets to know Damiano at the shop, a young extremely attractive guy who wants to show him Frankfurt, he accepts the offer gladly. After tentative touches and intense eye contact a passionate affair ensues within one day.The following day Damiano shows up with his best mate David looking to hook up with Kris again on the drug G. But apparently Kris has his eyes set only on David... To make matters worse, and despite a hot threesome, that night the trio meets a couple of friends who also know David. The five of them now roam the nocturnal city and soon life confessions and stories of the mens group bubble to the surface with the effect that they become very close. Completely unplanned the night of intense partying ends again on G, filled with limitless erotic desires and without any taboos.G is a small study on the excitement a new life can bring. The film talks about the many levels of sensing and experiencing the complexity of the big city with its electronic music, clubs and the licentious sex between men under the influence of the fashionable drug G (GBL). Trying to find the very essence of life and love without ever getting enough of each, and the sneaking onset of disillusionment."
}