{
  "imdb_id": "tt4834622",
  "tmdb_id": "394314",
  "douban_id": null,
  "title": "The Magnificent Nine (2016)",
  "genres": [
    "Comedy",
    "History"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "129 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.7,
  "director": [
    {
      "id": "nm1327703",
      "name": "Yoshihiro Nakamura"
    }
  ],
  "writer": [
    {
      "id": "nm3707366",
      "name": "Michifumi Isoda",
      "description": "based on the novel by"
    },
    {
      "id": "nm0840613",
      "name": "Ken'ichi Suzuki",
      "description": "screenplay"
    },
    {
      "id": "nm1327703",
      "name": "Yoshihiro Nakamura",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0847624",
      "name": "Yûko Takeuchi",
      "character": "Toki"
    },
    {
      "id": "nm1070494",
      "name": "Satoshi Tsumabuki",
      "character": "Jinnai Asanoya"
    },
    {
      "id": "nm0945734",
      "name": "Tsutomu Yamazaki",
      "character": ""
    },
    {
      "id": "nm0559430",
      "name": "Ryûhei Matsuda",
      "character": "Moku Kayaba"
    },
    {
      "id": "nm4679580",
      "name": "Maika Yamamoto",
      "character": "Natsu-chan"
    },
    {
      "id": "nm1216345",
      "name": "Eita",
      "character": "Tokuheiji Sugawaraya"
    },
    {
      "id": "nm3877188",
      "name": "Yûdai Chiba",
      "character": "Chunai Chisaka"
    },
    {
      "id": "nm4249314",
      "name": "Daiki Shigeoka",
      "character": "Otoemon Kokudaya"
    },
    {
      "id": "nm6799894",
      "name": "Yuzuru Hanyu",
      "character": "Shigemura Date"
    },
    {
      "id": "nm0008369",
      "name": "Sadao Abe",
      "character": "Juzaburo Kokudaya"
    },
    {
      "id": "nm0632761",
      "name": "Masahiko Nishimura",
      "character": "Junai Endo"
    },
    {
      "id": "nm0457590",
      "name": "Kitarô",
      "character": "Jubei Kokudaya"
    },
    {
      "id": "nm0476179",
      "name": "Mitsukô Kusabue",
      "character": "Kiyo       (as Mitsuko Kusabue)"
    },
    {
      "id": "nm0855442",
      "name": "Yasufumi Terawaki",
      "character": "Ikuemon Endo"
    },
    {
      "id": "nm1066120",
      "name": "Ken Nakamoto",
      "character": "Zenbachi Kokudaya"
    },
    {
      "id": "nm10519528",
      "name": "Tokuhisa Yamashita",
      "character": ""
    },
    {
      "id": "nm5140883",
      "name": "Karen Iwata",
      "character": "Kayo"
    },
    {
      "id": "nm2644377",
      "name": "Ichirô Hashimoto",
      "character": "Shinshiro Hayasakaya"
    }
  ],
  "overview": "Residents in a town have a hard time due to the land tax and forced labor. 9 people, including Juzaburo Kokutaya (Sadao Abe), worry about the future of their town. They then set up a plan to save the town. The plan is to lend large amounts of money to han (historical term for the estate of a warrior) and distribute the interest annually to the residents, but if they're caught they will lose their lives.",
  "storyline": "It is eighteenth century Japan and the residents of a poor town lead a typically meagre life. Then nine residents, which include Juzaburo, hatch a scheme to improve their lots by running a pawn and loan business with the proceeds being distributed among the townfolk. However, the plan is risky with such commerce and profiteering being frowned upon in a society with a caste system. Based on a novel by Isoda Michifumi, The Magnificient Nine features a cast of well-known Japanese cinema familiars.",
  "plot": "In 1879, robber baron Bartholomew Bogue (Peter Sarsgaard) besieges the mining town of Rose Creek and slaughters a group of locals led by Matthew Cullen (Matt Bomer) when they attempt to stand up to him. Matthew's wife, Emma Cullen (Haley Bennett), and her friend Teddy Q. (Luke Grimes) ride to the nearest town in search of someone who can help them and come upon warrant officer Sam Chisolm (Denzel Washington) of Wichita, Kansas, who initially declines their proposal until he learns of Bogue's involvement.\n\nChisolm sets out to recruit a group of gunslingers who can help him, starting with gambler Joshua Faraday (Chris Pratt). They are later joined by sharpshooter Goodnight Robicheaux (Ethan Hawke), knife-wielding Billy Rocks (Lee Byung-hun), notorious Mexican outlaw Vasquez (Manuel Garcia-Rulfo), skilled tracker Jack Horne (Vincent D'Onofrio), and Comanche warrior Red Harvest (Martin Sensmeier).\n\nArriving in Rose Creek, the seven engage in a gunfight with Bogue's enforcer McCann (Cam Gigandet) and his men, shoot dead 22 of them, and drive the corrupt sheriff away with a warning to leave Rose Creek alone. Surmising that Bogue and his forces will return in a week, the seven train the townspeople to defend their home and grow fond of them. Robicheaux, haunted by the horrors of the Civil War and fearing the killing he will be a part of, abandons the group and is replaced by Cullen.\n\nBogue arrives with an army of mercenaries and attacks the city, which has been rigged with multiple bombs and traps. A massive shootout ensues, during which Robicheaux rejoins the group. McCann shoots and wounds Faraday but is killed by Vasquez. Bogue then unveils his secret weapon, a Gatling gun, with which he decimates the town and kills many of both sides. Realizing they're outgunned, the seven evacuate the townspeople and mount their last stand. Horne is killed by Bogue's Comanche assassin Denali (Jonathan Joss), who is later killed by Red Harvest.\n\nRobicheaux and Rocks are killed by a second round of gunfire. Faraday then rides up to the remainder of Bogue's men and the Gatling gun. After he is riddled with bullets he makes a final attempt to destroy the Gatling gun, by detonating a stick of dynamite destroying the Gatling gun, the rest of Bogue's men, and himself. Bogue flees into town, where he is confronted by Chisolm, who disarms and wounds Bogue. As Chisolm is strangling Bogue, he reveals that Bogue and his men raped and murdered his mother and sisters during a raid several years earlier, in which he himself survived being hanged. Bogue is then fatally shot by Cullen while attempting to shoot Chisolm with a hidden gun in his boot.\n\nIn the aftermath, Faraday, Robicheaux, Rocks and Horne are buried in town and honoured by the people of Rose Creek as heroes, while Chisolm, Vasquez and Red Harvest ride off. The film ends with Cullen remarking that their heroism made them legends and that it was \"magnificent\".",
  "synopsis": null
}