{
  "imdb_id": "tt4800708",
  "tmdb_id": "361376",
  "douban_id": null,
  "title": "Jilebi (2015)",
  "genres": [
    "Comedy",
    "Family"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "116 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.5,
  "director": [
    {
      "id": "nm7413885",
      "name": "Arun Shekhar"
    }
  ],
  "writer": [
    {
      "id": "nm7413885",
      "name": "Arun Shekhar",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1334389",
      "name": "Jayasurya",
      "character": "Sreekkuttan"
    },
    {
      "id": "nm6444863",
      "name": "Gourav Menon",
      "character": "Pachu"
    },
    {
      "id": "nm2463487",
      "name": "Ramya Nambeeshan",
      "character": "Shilpa"
    },
    {
      "id": "nm4143935",
      "name": "Dharmajan Bolgatty",
      "character": "Tony"
    },
    {
      "id": "nm6447222",
      "name": "Disney James",
      "character": "Vijay"
    },
    {
      "id": "nm4051131",
      "name": "Sasi Kalinga",
      "character": "Kumaran"
    },
    {
      "id": "nm0433884",
      "name": "K.P.A.C. Lalitha",
      "character": "Sharada"
    },
    {
      "id": "nm6414975",
      "name": "Harisree Martin",
      "character": ""
    },
    {
      "id": "nm6428707",
      "name": "Minon",
      "character": "Village Boy"
    },
    {
      "id": "nm1117035",
      "name": "Shari",
      "character": ""
    },
    {
      "id": "nm8223791",
      "name": "Manju Sunichen",
      "character": "Servant"
    },
    {
      "id": "nm1066795",
      "name": "Vijayaraghavan",
      "character": "Chandradas"
    },
    {
      "id": "nm8801017",
      "name": "Vineeth Vishwam",
      "character": ""
    }
  ],
  "overview": "Jilebi is the down-to-earth story about a sour-sweet confrontation between a village youngster Sreekuttan and his city-bred nephewsSreekuttan, is a village guy whose life is happily confined to his farm and his pet crops. Far away, in the Dubai city , trouble brews for him in the form of his nephew and niece.",
  "storyline": "Jilebi is the story of a confrontation between villager Sreekuttan and his city-bred nephews. Sreekuttan has his life happily confined to his farm and his pet crops. Far away, in Dubai, there is a family crisis and he is forced to take responsibility of his two Dubai-bred nephews. The kids hate leaving Dubai and are determined to make life miserable for Sreekuttan so that they are sent back to Dubai. The confrontation begins and leads to surprises - some sour, some sweet..",
  "plot": "The movie begins with a car chase in Chicago, which leads to a scuffle between a man ostensibly named Jude Rosario (Saif Ali Khan) and an American male known as Matthew Broody. The scuffle ends with Broody falling into the icy waters of Chicago River, and his body missing. This results in Rosario being arrested and convicted for murder.\n\nA flashback of six months ago shows the office of the Indian RAW chief Roy (Sabyasachi Chakrabarty), where he and his trusted men (Rajesh Tailang, Mohammed Zeeshan Ayyub) plan a daring covert operation. The man known as Jude Rosario in the opening sequence is shown to be Captain Daniyal Khan, a dead-end ex-soldier with a completely deadened sense of life and death is pulled out of oblivion and pressed into service by the spy agency to wreak vengeance on the men who planned the 26/11 Mumbai terror attacks. He agrees on the assurance that he will be reinstated in the Indian army to the same rank from which he was court-martialled, which meant regaining the respect of his estranged father. His only team member, Nawaz Mistry (Katrina Kaif) helps him find his first target Sajid Mir (Mir Sarwar) at a cricket match. On reaffirming his identity after breaking into his apartment Daniyal rigs up an explosion killing Sajid Mir, which makes the headlines causing an investigation by the Pakistani ISI.\n\nComing back to the present, Daniyal aka Jude has landed in the same jail as David Headley (J.Brandon Hill). He contacts Nawaz, in order to acquire money to buy a battery, as a replacement of another one which holds a certain poison. The poison is untraceable as it could kill a person whose tongue even comes in contact with it with a heart attack. After killing David Headley, Matthew Broody who supposedly died upon falling in the river is found alive and Daniyal is released as his earlier sentence is rendered null and void. Meanwhile, ISI agents gather information about Daniyal Khan.\n\nDaniyal and Nawaz, through Syria, go to Pakistan to take down the last two perpetrators, Sahabuddin Umvi and Haaris Saeed (Shahnawaaz Pradhan). In Pakistan, they make plans of killing Saeed with the help of local restaurant owner Khalid (Midat Sahab) by an explosive planted in the mic used during his public speech. However, their plan fails leading Daniyal to pursue Saeed in a car and shoot him dead, also causing an explosion. Umvi is killed with the help of a nurse Amina Bi (Sohaila Kapur) who replaces his regular syringe with a poisoned one.\n\nWith the Pakistani army and ISI pursuing them, Daniyal and Nawaz make their way to the coast to escape through the Arabian sea. Their accomplices get caught and interrogated for information or killed. While they are escaping on a boat, the Pakistani military finds about it and sends patrol boats to apprehend them. While hiding in the waters, Daniyal gets shot by the military and dies. Nawaz later gets rescued by the Indian Navy. Later, she goes to the Taj Hotel and has two cups of tea fulfilling a promise earlier made to Daniyal.",
  "synopsis": null
}