{
  "imdb_id": "tt4882642",
  "tmdb_id": "280107",
  "douban_id": null,
  "title": "Naalu Policeum Nalla Irundha Oorum (2015)",
  "genres": [
    "Comedy"
  ],
  "country": "India",
  "version": [],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm7473896",
      "name": "N.J. Srikrishna"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm4650730",
      "name": "Arulnithi",
      "character": "Shanmughapandian       (as Arulnidhi)"
    },
    {
      "id": "nm2463487",
      "name": "Ramya Nambeeshan",
      "character": ""
    },
    {
      "id": "nm2670388",
      "name": "Singampuli",
      "character": "Padhinettampadiyan"
    },
    {
      "id": "nm5408984",
      "name": "Bagavathi Perumal",
      "character": "Chelladurai"
    },
    {
      "id": "nm5408510",
      "name": "Rajkumar",
      "character": "Ilaiyakumar"
    },
    {
      "id": "nm4260932",
      "name": "Thirumurugan",
      "character": ""
    },
    {
      "id": "nm6489058",
      "name": "Yogi Babu",
      "character": ""
    },
    {
      "id": "nm7473897",
      "name": "Syed Abu",
      "character": ""
    },
    {
      "id": "nm7473899",
      "name": "Siranjiivi",
      "character": ""
    },
    {
      "id": "nm7473900",
      "name": "Venkat",
      "character": ""
    },
    {
      "id": "nm7473898",
      "name": "Karthick Siivan",
      "character": ""
    },
    {
      "id": "nm7473901",
      "name": "Mahesh",
      "character": ""
    }
  ],
  "overview": "Four cops try to stage a crime in their crime-free, model village so that they are not transferred from the place. But their naive attempts result in far-reaching conclusions.",
  "storyline": "Porpandhal is a proud winner of the best role model village award given by the Indian president. There is absolutely no crime in Porpandhal and the police station is being used as recreational club where the four cops Shanmughapandian (Arulnithi), Chelladurai (Bhagavathi Perumal), Ilaiyakumar (Rajkumar) and Head constable (Singampuli) having good time watching cricket matches and playing carrom. Meanwhile, the Home Ministry decides that Porpandhal no longer needs a police station and when they are about to issue transfer orders to all the four cops, our protagonists think of a plan and try their luck to get some serious cases in the village. To their misfortune, the role model village gets ruined and turns into an insecure place to live. What happens next?",
  "plot": "The film starts with an outsider coming to the village to provide invitations to the people there. There is a police station with one sub-inspector (Bagavathi Perumal) and 3 constables. The village is apparently winning the award from President for being a model village. People are very honest, hard working and there are no problems in the village. The Policemen lead a very peaceful life because of the villagers. They work from 9 to 5 and are closed on Sundays. The police station is used for playing board games and watching TV along with the villagers. Constable Shanmugha Pandi (Arulnithi) is a day dreamer and has a liking to a school teacher (Remya Nambeesan). However he is unable to proposer her. Since no crimes are happening in this village they are planned to transfer to another village known for its riots. Sadned by this, these four policemen try to create problem among the villagers.\n\nPadhinettampadiyan and Chelladurai ask favour from a thief to steal things so that they can file case. However all their attempts fail. How their actions caused changes in the villagers and their lives is the rest of the movie.",
  "synopsis": null
}