{
  "imdb_id": "tt4851630",
  "tmdb_id": "381691",
  "douban_id": null,
  "title": "Maheshinte Prathikaaram (2016)",
  "genres": [
    "Comedy",
    "Drama",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "120 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.1,
  "director": [
    {
      "id": "nm4584004",
      "name": "Dileesh Pothan"
    }
  ],
  "writer": [
    {
      "id": "nm4544331",
      "name": "Syam Pushkaran",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1335704",
      "name": "Fahadh Faasil",
      "character": "Mahesh"
    },
    {
      "id": "nm7936195",
      "name": "Aparna Balamurali",
      "character": "Jimsy"
    },
    {
      "id": "nm6229968",
      "name": "Soubin Shahir",
      "character": "Crispin"
    },
    {
      "id": "nm4425773",
      "name": "Alencier Ley Lopez",
      "character": "Artist Baby       (as Alancier Ley Lopez)"
    },
    {
      "id": "nm5573564",
      "name": "Anusree",
      "character": "Soumya"
    },
    {
      "id": "nm7934648",
      "name": "Antony Kochi",
      "character": "Vincent Bhavana"
    },
    {
      "id": "nm4584004",
      "name": "Dileesh Pothan",
      "character": "Eldho"
    },
    {
      "id": "nm6509368",
      "name": "Achuthanandan",
      "character": "Thahir"
    },
    {
      "id": "nm7936197",
      "name": "Leena Antony",
      "character": "Jimsy's mother"
    },
    {
      "id": "nm3154399",
      "name": "Jaffer Idukki",
      "character": "Kunjumon"
    },
    {
      "id": "nm7898733",
      "name": "Jayashankar",
      "character": "Baby's Bro-in-law"
    },
    {
      "id": "nm7934649",
      "name": "Lijo Mol Jose",
      "character": "Soniya"
    },
    {
      "id": "nm8282140",
      "name": "Vijilesh Karayad",
      "character": "Martial Arts Guy       (as Vijilesh)"
    },
    {
      "id": "nm9045614",
      "name": "Rajesh Madhavan",
      "character": "Cycle Boy"
    },
    {
      "id": "nm9759900",
      "name": "S.K. Mini",
      "character": "(as Sk Mini)"
    },
    {
      "id": "nm10923158",
      "name": "Harish Pengan",
      "character": "Tomy"
    },
    {
      "id": "nm9045615",
      "name": "Unnimaya Prasad",
      "character": "Sara"
    },
    {
      "id": "nm10147959",
      "name": "Shiny T. Rajan",
      "character": "Soumya's Mother"
    },
    {
      "id": "nm7936196",
      "name": "Sujith Sankar",
      "character": "Jimson"
    },
    {
      "id": "nm8223791",
      "name": "Manju Sunichen",
      "character": "Baby's Sister"
    },
    {
      "id": "nm3617629",
      "name": "Baiju V.K.",
      "character": "Police Officer (Cameo)"
    }
  ],
  "overview": "Mahesh, a studio photographer and owner of the studio. As the story moves on, Mahesh encounters an anonymous fight ending up with taking revenge that leads to certain realizations in his life.",
  "storyline": "Mahesh Bhavana from Idukki runs a photo studio and leads a happy contented life living along with his aging father, his darling pet dog, his friends & his lady love with whom he maintains a long distance relationship. One fine day, his rosy life is turned upside down with what could only be called a manifestation of the often quoted butterfly effect!",
  "plot": "Mahesh Bhavana (Fahadh Faasil) is a small-time photographer who lives with his father, Vincent Bhavana (K. L. Antony Kochi). They run the digital-photography Bhavana Studio in the Prakash region of Idukki district in Kerala. Next to the studio is a flex-board printing shop owned by Mahesh's good friend, Baby (Alencier Ley Lopez). His assistant Crispin (Soubin Shahir) is a Photoshop wizard who designs the flex-boards. Mahesh is in a relationship with Soumya (Anusree), his high-school sweetheart.\n\nBaby becomes involved in a trivial argument with a loafer in the centre of the village. The dispute escalates, but passersby calm them down. However, Crispin appears and attacks the man who had argued with Baby. The man, joined by Jimson Augustine (Sujith Shanker), jumps on Crispin in retaliation. Noticing the commotion, Mahesh tries to calm everyone down but Jimson, furious at Mahesh's authoritative stance, beats him up. Vincent breaks up the fight. Embarrassed, Mahesh vows to get back at Jimson and pledges that he will wear slippers only after he has avenged his humiliation.\n\nSoumya is forced to end her relationship with Mahesh. He learns about Jimson's whereabouts from Crispin and visits the garage where he apparently works as a welder. Its owner tells him that Jimson left for a better job in Dubai. Despite Baby's advice that he should forget the incident, Mahesh resolves to wait for Jimson's return; several weeks later, he enrolls in a kung fu course.\n\nJimsy Augustine (Aparna Balamurali), a young college student, goes to Bhavana Studio. She tells Mahesh that she wants to participate in Vanitha's cover competition and asks him to make her look as good as possible. Perplexed at the unusual request, Mahesh conducts the photo shoot. Jimsy's photograph turns out to be dull and unimpressive, and her irritation makes Mahesh question his skill as a photographer. Upset, he turns to his father for advice. Vincent explains photography as an art to his son. Mahesh goes through his father's photograph collection, finally understanding their angles and lighting, and gets an idea.\n\nInstead of his familiar still photography, Mahesh photographs Jimsy in motion and sends the best photo to the magazine. Shortly afterward, Jimsy goes to Mahesh's house with the magazine containing her photo. Although she rebukes him for photographing her without permission, she also praises the photo. They become interested in each other, and soon fall in love. Jimsy realises this first, and calls Mahesh to talk about their future. She tells him that she is Jimson's younger sister, but his agitation is overshadowed by love and he decides to continue their relationship.\n\nSeveral weeks later, Jimson is fired from his job for slapping his manager and is deported back to India. The following day, Mahesh and Baby challenge him to a hand-to-hand combat. After a few minutes of fighting, Mahesh pins down Jimson and Baby declares him the winner. Mahesh meets Jimson in a hospital on the next day and introduces himself to his mother in front of Jimsy. He admits his love for Jimsy and asks Jimson for his sister's hand in marriage, as Jimson and his mother look at each other in disbelief.",
  "synopsis": null
}