{
  "imdb_id": "tt4846006",
  "tmdb_id": "373857",
  "douban_id": null,
  "title": "Tattoo (2015)",
  "genres": [
    "Drama"
  ],
  "country": "South Korea",
  "version": [
    {
      "runtime": "93 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm3700023",
      "name": "Seo Lee"
    }
  ],
  "writer": [
    {
      "id": "nm3700023",
      "name": "Seo Lee",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm3836635",
      "name": "Hyun-Sang Kwon",
      "character": "Detective Oh Cheon-ki"
    },
    {
      "id": "nm7739296",
      "name": "Seo-Young",
      "character": "Gucci"
    },
    {
      "id": "nm0814271",
      "name": "Il-gon Song",
      "character": "Han Ji-soon       (as Song Il-Kook)"
    },
    {
      "id": "nm1866022",
      "name": "Il-guk Song",
      "character": "Han Ji-soon"
    },
    {
      "id": "nm3102257",
      "name": "Joo-Hee Yoon",
      "character": "Jo Soo-na       (as Yoon Joo-Hee)"
    }
  ],
  "overview": "Soo-na is a beautiful tattoo artist who possesses the unique skill of being able to perform the rare “stitchery tattoo” that uses needle and thread. This style of tattoo is very painful and she prefers not to do it this way. She also has a habit of mixing in some snake venom into the ink she uses for tattooing. This can cause some interesting and sometimes lethal side-effects whenever her clients are in the heat of passion. In other words, you do not want to mess with Soo-na. Now she has a new client, Ji-soon, who is very persistent in wanting her to use the stitchery tattoo technique. Soo-na gives in and agrees to finish the tattoo of a Medusa on his back. She quickly learns that behind the Medusa lies a dark secret that has ties to her own past. What follows is a tale of revenge, murder, and tattoos.",
  "storyline": "Tattooist Soo-na is one of the best tattoo-artists in South Korea. Her customers are the wealthy and the rich. She has no own studio, but therefore she visits her customers to make their tattoos. So they can keep their private life under wraps and Soo-na earns a lot of money. One day Ji-soo orders her to tattoo the head of the Medusa on his back. The Medusa is a monster from the Greek mythology with an ugly face and Hair made of snakes. Soo-na visits him regularly to draw always another snake to the head, which is quite strange. Why not getting the tattoo done in one session? But Soo-na has to face a terrible truth as she learns, that some girls in her city are missing. Because every time a girl get missing, Ji-soo orders another snake.",
  "plot": "Jake Sawyer (Jason Behr) is a global wanderer and tattooist who explores ethnic themes in his designs. While visiting Singapore to sell his craft at a local trade show, he swipes an ancient Samoan tattoo tool. After flying to New Zealand to resume his art, he meet up with a lovely Samoan woman named Sina (Mia Blake) and discovers the local Samoan culture. But Jake slowly learns that his stolen tool ends up unleashing an evil avenging spirit whom targets all of the customers that Jake has given tattoos to since his theft of the tool. While attempting to learn pe'a, the Samoan tradition of tattooing, Jake soon realizes that Sina is imperiled when she gets a tattoo from him and he must find a way to save her, and himself.",
  "synopsis": null
}