{
  "imdb_id": "tt4877706",
  "tmdb_id": "346244",
  "douban_id": null,
  "title": "Clown of the Dead (2015)",
  "genres": [
    "Horror",
    "Thriller"
  ],
  "country": "Indonesia",
  "version": [],
  "imdb_rating": 7.5,
  "director": [
    {
      "id": "nm2934741",
      "name": "Awi Suryadi"
    }
  ],
  "writer": [
    {
      "id": "nm3166964",
      "name": "Agasyah Karim",
      "description": "screenplay"
    },
    {
      "id": "nm1819084",
      "name": "Khalid Kashogi",
      "description": "screenplay"
    },
    {
      "id": "nm2934741",
      "name": "Awi Suryadi",
      "description": "screenplay"
    },
    {
      "id": "nm4381637",
      "name": "Daniel Topan",
      "description": "story"
    }
  ],
  "cast": [
    {
      "id": "nm4381637",
      "name": "Daniel Topan",
      "character": "Donald"
    },
    {
      "id": "nm4538079",
      "name": "Christoffer Nelwan",
      "character": "Farel"
    },
    {
      "id": "nm3779031",
      "name": "Aurélie Moeremans",
      "character": "Kayla"
    },
    {
      "id": "nm2439510",
      "name": "Ratu Felisha",
      "character": "Raisa"
    },
    {
      "id": "nm7470701",
      "name": "Tiara Westlake",
      "character": "Nikki"
    },
    {
      "id": "nm1229079",
      "name": "Ronny P. Tjandra",
      "character": "Badut       (as Ronny Paulus Tjandra)"
    },
    {
      "id": "nm2680501",
      "name": "Marcel Chandrawinata",
      "character": "Rocky"
    }
  ],
  "overview": "After three children are found tragically dead, a band of college students are forced to conduct an investigation. And that is when terror from a mysterious clown figure starts to mount. Our heroes soon realize that what they are facing is a force that disguises its darkness through laughter—a force so menacing, it will not hesitate to take lives to get what it wants: immortality.",
  "storyline": "Three friends in an apartment complex must discover what's behind the killings of local children, all of whom drew the same picture before they died. They uncover the evil spirit of a circus clown and must send it straight back to hell before more children are murdered.",
  "plot": null,
  "synopsis": "BADOETHe comes with laughter, goes with death.Tragedy strikes a close-knit Jakarta apartment complex when three children are found misteriously dead. Suspecting foul play, three tenants decide to investigate: DONALD (Daniel Topan), a smart college senior with a temper; FAREL (Christoffer Nelwan), Donald's socially awkward yet kind-hearted cousin, and KAYLA (Aurelie Moeremans), Donald's tomboy college mate. The entity responsible for the heinous deaths is revealed after our heroes find drawings of a clown made by all the victims, and, later, by VINO (Fernandito Syachputra), the 9-year-old son of feisty landlady RAISA (Ratu Felisha)who clearly now is in danger. With help from the eccentric indigo siblings NIKKI (Tiara Westlake) and ROCKY (Marcel Chandrawinata), our heroes do their best to save the boy.As Donald and his friends begin their attempt, terror starts to mount. Our heroes soon realize that they are facing a force that disguises its darkness through laughtera force so menacing, it will not hesitate to take lives to get what it wants: immortality."
}