{
  "imdb_id": "tt4809238",
  "tmdb_id": "322127",
  "douban_id": null,
  "title": "You & I (2014)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "79 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.9,
  "director": [
    {
      "id": "nm2020038",
      "name": "Nils Bökamp"
    }
  ],
  "writer": [
    {
      "id": "nm2020038",
      "name": "Nils Bökamp",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4122118",
      "name": "George Taylor",
      "character": "Philip"
    },
    {
      "id": "nm2863598",
      "name": "Eric Klotzsch",
      "character": "Jonas"
    },
    {
      "id": "nm3111123",
      "name": "Michal Grabowski",
      "character": "Boris"
    }
  ],
  "overview": "Summer in Berlin. Jonas is planning a trip through the little known area of the Uckermark in preparation for a photography project. He invites his best friend, Phillip, to come along. When they pick up a hitchhiker named Boris, the friendship of the two starts to fray. Maybe three’s a crowd after all? By the end of the summer, things between Jonas and Phillip won’t ever be the same again.",
  "storyline": "Summer in Berlin. Jonas is planning a trip through the little known area of the Uckermark in preparation for a photography project. He invites his best friend, Phillip, to come along. They haven't met since the time they spent together in London. So they pack up their Mercedes camper and take off across uncharted territory, stopping whenever they see something they like, taking pictures and generally enjoying a laid-back road trip. The fact that Phillip is gay has never been an issue for either of them. When they pick up a hitchhiker named Boris, however, who shows Jonas some interesting spots and starts to make moves on Phillip, the friendship of the two starts to fray. Maybe three's a crowd after all? By the end of the summer, things between Jonas and Phillip won't ever be the same again.",
  "plot": null,
  "synopsis": null
}