{
  "imdb_id": "tt4862478",
  "tmdb_id": "401441",
  "douban_id": null,
  "title": "Embrace (2016)",
  "genres": [
    "Documentary"
  ],
  "country": "Australia",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.9,
  "director": [
    {
      "id": "nm7308112",
      "name": "Taryn Brumfitt"
    }
  ],
  "writer": [
    {
      "id": "nm7308112",
      "name": "Taryn Brumfitt",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm7308112",
      "name": "Taryn Brumfitt",
      "character": "Herself"
    },
    {
      "id": "nm7919654",
      "name": "Renee Airya",
      "character": "Herself"
    },
    {
      "id": "nm10857280",
      "name": "Linda Bacon",
      "character": "Herself"
    },
    {
      "id": "nm10857279",
      "name": "Jes Baker",
      "character": "Herself"
    },
    {
      "id": "nm7919655",
      "name": "Jade Beall",
      "character": "Herself"
    },
    {
      "id": "nm7460226",
      "name": "Mathew Brumfitt",
      "character": "Himself"
    },
    {
      "id": "nm0004866",
      "name": "Amanda De Cadenet",
      "character": "Herself"
    },
    {
      "id": "nm10857273",
      "name": "Stefania Ferrario",
      "character": "Herself"
    },
    {
      "id": "nm10857276",
      "name": "Fardad Forouzanpour",
      "character": "Himself"
    },
    {
      "id": "nm2541902",
      "name": "Mia Freedman",
      "character": "Herself"
    },
    {
      "id": "nm7919652",
      "name": "Harnaam Kaur",
      "character": "Herself"
    },
    {
      "id": "nm0001442",
      "name": "Ricki Lake",
      "character": "Herself"
    },
    {
      "id": "nm10857277",
      "name": "Jane Langton",
      "character": "Herself"
    },
    {
      "id": "nm8116025",
      "name": "B. Jeffrey Madoff",
      "character": "Himself"
    },
    {
      "id": "nm10857281",
      "name": "Nigel Marsh",
      "character": "Himself"
    },
    {
      "id": "nm8366820",
      "name": "Lea Nayeli",
      "character": "Herself"
    },
    {
      "id": "nm2801244",
      "name": "Melinda Tankard Reist",
      "character": "Herself"
    },
    {
      "id": "nm10857278",
      "name": "Nikiah Seeds",
      "character": "Herself"
    },
    {
      "id": "nm10857275",
      "name": "Marika Tiggemann",
      "character": "Herself"
    },
    {
      "id": "nm10857274",
      "name": "Tina",
      "character": "Herself"
    },
    {
      "id": "nm1160560",
      "name": "Nora Tschirner",
      "character": "Herself"
    }
  ],
  "overview": "Your Body. The Movement. Global Change.",
  "storyline": "When Body Image Activist Taryn Brumfitt posted an unconventional before-and-after photo in 2013 it was seen by more than 100 million people worldwide and sparked an international media frenzy. EMBRACE follows Taryn's crusade as she explores the global issue of body loathing, inspiring us to change the way we feel about ourselves and think about our bodies.",
  "plot": "The film tells two stories thirty years apart, both featuring Karamakate, an Amazonian shaman and last survivor of his tribe. He travels with two scientists, firstly with German Theo von Martius in 1909 and American named Evan in 1940, to look for the rare yakruna, a (fictional) sacred plant.\n\nTheo, an ethnographer from Tübingen who has already resided in the Amazon for several years, is very sick and is travelling by canoe with his field notes and a westernised local he saved from enslavement on a rubber plantation named Manduca. Karamakate prolongs his life, blasting white powder called \"the sun's semen\" (possibly a hallucinogenic made from virola) up his nose, but is reluctant to become involved with a westerner and refuses his money. Theo is searching for yakruna as the only cure for his disease and the three set off in the canoe to search for it.\n\nMany years later an American botanist, Evan (Brionne Davis), paddles up to a much older Karamakate (Antonio Bolívar) who has apparently forgotten the customs of his own people. Evan says he is hoping to complete Theo's quest and Karamakate does assist, again reluctantly, saying his knowledge is spent. Evan has a book of Theo's final trek, which his aide sent back to Europe, as he did not survive the jungle. The book includes an image of Karamakate, which he refers to as his chullachaqui, a native term for hollow spirit. Karamakate agrees to help him only when Evan describes himself as someone who has devoted himself to plants, although Evan's real purpose is actually to secure disease-free rubber trees, since the United States's supplies of rubber from South East Asia had dwindled due to the Japanese wartime advance.\n\nBoth expeditions feature an \"Apocalypse Now\"-style Spanish Catholic Mission by the side of an Amazon tributary, run in 1909 by a sadistic, lone Spanish priest who beats orphan boys for any \"pagan\" behaviour, and in 1940 by a delusional Brazilian figure who believes he is the Messiah. He only trusts the visitors when he believes they are the Biblical Magi, but Karamakate wins his respect when he heals his wife. By now the children of 1909 have grown into disturbed and violent acolytes.\n\nIn 1909, we are left with Theo, sick and having fled the Mission, arriving at a frontier post just about to be invaded by Colombian soldiers during the Amazon rubber boom, where the sacred yakruna is being abused by drunken men, and cultivated, against local traditions. Karamakate is furious and destroys it. In 1940, Karamakate does show Evan the origin of the plant in striking denuded dome shaped mountains (Cerros de Mavecure), allegedly the home of yakruna. He reveals one yakruna flower that is on the last plant – he has destroyed all the others – and prepares it for Evan. The preparation being hallucinogenic, aids Evan in undergoing a superconscious experience. A part of this experience has been shown in colour to signify its intensity. The film ends with a transformed Evan remaining enamoured by a group of butterflies.",
  "synopsis": null
}