{
  "imdb_id": "tt4851852",
  "tmdb_id": "378502",
  "douban_id": null,
  "title": "While the Women Are Sleeping (2016)",
  "genres": [
    "Drama"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "103 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm0911061",
      "name": "Wayne Wang"
    }
  ],
  "writer": [
    {
      "id": "nm0555908",
      "name": "Javier Marías",
      "description": "short story as Javier Marias"
    },
    {
      "id": "nm2368458",
      "name": "Michael Ray",
      "description": "screenplay &"
    },
    {
      "id": "nm1425348",
      "name": "Shinho Lee",
      "description": "screenplay &"
    },
    {
      "id": "nm2738999",
      "name": "Mami Sunada",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0001429",
      "name": "Takeshi Kitano",
      "character": "Sahara"
    },
    {
      "id": "nm0632689",
      "name": "Hidetoshi Nishijima",
      "character": "Kenji"
    },
    {
      "id": "nm0654637",
      "name": "Sayuri Oyamada",
      "character": "Aya"
    },
    {
      "id": "nm3101617",
      "name": "Shioli Kutsuna",
      "character": "Miki       (as Shiori Kutsuna)"
    },
    {
      "id": "nm1078422",
      "name": "Hirofumi Arai",
      "character": "Ishihara"
    },
    {
      "id": "nm0913831",
      "name": "Makiko Watanabe",
      "character": "Kyoko"
    },
    {
      "id": "nm1410940",
      "name": "Lily Franky",
      "character": "Iizuka       (as Lily Frankie)"
    }
  ],
  "overview": "Kenji and Aya spend their summer days in a Hotel. While she is doing her own thing, he tries to work on his novel. But then a few strange hotel guest arouse the curiosity of the couple...",
  "storyline": "While vacationing with his wife, a writer (Hidetoshi Nishijima) begins following another man (Takeshi Kitano) and woman (Shiori Kutsuna) who are guests at the resort hotel where he stays.",
  "plot": "Lucy (Emily Browning) is a stoic, unemotional university student who has few friends and survives by working various short-term odd jobs. Her roommates dislike her, and she spends her time visiting Birdmann (Ewen Leslie), a male friend who is very attracted to her. While she does not return his sexual interest, Lucy enjoys Birdmann's company, and in his presence is the only time she is shown smiling or laughing. An old joke between the two is that Birdmann frequently asked Lucy to marry him; Lucy always says no.\n\nIn response to an ad for yet another short-term job, Lucy meets Clara (Rachael Blake), who runs a service in which attractive young women perform silver service while dressed in lingerie at a formal dinner party for male clients. Clara assures her that the men are not allowed to touch the women sexually, and Lucy agrees to try it. Clara inspects Lucy's body and names her \"Sara\" for the purpose of anonymity. At the dinner party, Lucy is the only girl dressed in white; the other women wear black lingerie that is much more revealing than Lucy's costume.\n\nAfter one other session as a serving girl, Lucy gets a call from Clara's assistant Thomas (Eden Falk) for a different request. Lucy is driven to a country mansion, where Clara offers Lucy a new role wherein she will be voluntarily sedated and sleep naked while male clients lie beside her. They are permitted to caress and cuddle her, but penetration is not allowed. As Lucy lies unconscious, Clara leads in the man who hosted the first dinner party. After Clara reminds the man of the no-penetration rule, he strips and curls up beside Lucy.\n\nAfter a few of these sessions, Lucy has enough money to move into a larger, more expensive apartment, where she lives alone. She receives a call from Birdmann, who has overdosed on painkillers. She goes to his house and finds him dying in his bed. Sobbing, she takes off her shirt and gets in bed with him, but he dies in her arms. At Birdmann's funeral, Lucy abruptly asks an old friend if he will marry her, in an echo of Birdmann's old playful banter. The friend, however, not understanding the reference, takes her seriously and, shocked, refuses her, citing a number of Lucy's personal problems as his reasons.\n\nAt her next assignment with Clara, Lucy asks if she can see what happens during the sessions while she is asleep. Clara refuses, saying it will put her clients at risk of blackmail. After being placed on the bed for the session, however, Lucy fights off the sleeping drugs long enough to hide a small camera in the room before returning to bed and succumbing to sleep. The client is once again the first man, but this time, he also drinks the tea with a much larger dose of the sleeping drug.\n\nThe following morning, Clara comes in and checks the man's pulse, showing no surprise when he cannot be awakened. She then tries to wake Lucy but is at first unable to do so, eventually having to use mouth-to-mouth resuscitation. Lucy awakes and, discovering that the naked man lying beside her is dead, begins to scream hysterically—the first emotion she has shown throughout the film.\n\nThe film ends with the scene captured by the hidden camera: the dead old man and the sleeping girl both lying peacefully together in bed.",
  "synopsis": null
}