{
  "imdb_id": "tt4883758",
  "tmdb_id": "382204",
  "douban_id": "26577937",
  "title": "A Cappella (2016)",
  "genres": [
    "Drama"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "132 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm0946937",
      "name": "Hitoshi Yazaki"
    }
  ],
  "writer": [
    {
      "id": "nm1883976",
      "name": "Mariko Koike",
      "description": "based on the novel by"
    },
    {
      "id": "nm7474653",
      "name": "Chiai Takeda",
      "description": "screenplay &"
    },
    {
      "id": "nm7474654",
      "name": "Masa Asanishi",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm2104632",
      "name": "Riko Narumi",
      "character": "Kyoko Noma"
    },
    {
      "id": "nm1257423",
      "name": "Sôsuke Ikematsu",
      "character": "Wataru Domoto"
    },
    {
      "id": "nm1102191",
      "name": "Takumi Saitoh",
      "character": "Yunosuke Seki"
    },
    {
      "id": "nm5718658",
      "name": "Nina Endô",
      "character": "Emma Takamiya"
    },
    {
      "id": "nm2614548",
      "name": "Wakana Matsumoto",
      "character": "Setsuko Domoto"
    },
    {
      "id": "nm0297845",
      "name": "Tomoko Fujita",
      "character": "Aiko Chiba"
    },
    {
      "id": "nm0594073",
      "name": "Ken Mitsuishi",
      "character": "Koichi Noma"
    }
  ],
  "overview": "Set in the year 1969 in Sendai, Miyagi Prefecture, Japan.  Kyoko Noma is a loving female high school student who takes part in campus protests. One day, she meets university student Wataru Domoto in the tea cafe Mubansou (\"A Cappella\"). Kyoko falls in love with him, but they get involved in an incident that leads to a shocking ending.",
  "storyline": "The movie is set in 1969, when Japanese students were enmeshed with campus riots, anti-war rallies, and the growth of subcultures in music, cinema, literature, and theater. Influenced by the atmosphere of the time, the protagonist, Kyôko, a senior at a high school for girls, forms an \"Anti-Uniform Committee\" and joins a rally at a university. However, Kyôko hates herself because she knows she is only copying others. One day, she is wounded at a rally, and realizes she has been taking campus riot for granted. Fleeing from the riot police, she runs into \"A Cappella,\" the café where she meets and falls in love with a college student, named Wataru. She undergoes a sexual awakening and loses her virginity. Things seem to be going well with Wataru, but then she witnesses something she cannot believe... This film depicts the emotional rollercoaster of being a teenager. Love, hurt, betrayal and rebellion all play a role. \"A Cappella\" is a coming-of-age tale, where one finds something ...",
  "plot": null,
  "synopsis": null
}