{
  "imdb_id": "tt4861064",
  "tmdb_id": "390788",
  "douban_id": null,
  "title": "The Next Step Live: The Movie (2015)",
  "genres": [
    "Documentary"
  ],
  "country": "Canada",
  "version": [],
  "imdb_rating": 7.7,
  "director": [
    {
      "id": "nm0187688",
      "name": "Derby Crewe"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm5589030",
      "name": "Logan Fabbro",
      "character": "Herself"
    },
    {
      "id": "nm5251583",
      "name": "Trevor Tordjman",
      "character": "Himself"
    },
    {
      "id": "nm5250845",
      "name": "Brittany Raymond",
      "character": "Herself"
    },
    {
      "id": "nm4667721",
      "name": "Jordan Clark",
      "character": "Herself"
    },
    {
      "id": "nm4045841",
      "name": "Lamar Johnson",
      "character": "Himself"
    },
    {
      "id": "nm5249795",
      "name": "Victoria Baldesarra",
      "character": "Herself"
    },
    {
      "id": "nm2786789",
      "name": "Isaac Lupien",
      "character": "Himself"
    },
    {
      "id": "nm5251522",
      "name": "Jennifer Pappas",
      "character": "Herself"
    },
    {
      "id": "nm4348069",
      "name": "Myles Erlick",
      "character": "Himself"
    },
    {
      "id": "nm5249857",
      "name": "Samantha Grecchi",
      "character": "Herself"
    }
  ],
  "overview": "The film features exclusive footage of the dancers from the series \"The Next Step\", as they prepared for their first-ever tour in Canada. Also includes live performances and exclusive interviews with cast members.",
  "storyline": "The film features exclusive footage of the dancers from the series \"The Next Step\", as they prepared for their first-ever tour in Canada. Also includes live performances and exclusive interviews with cast members.",
  "plot": "Katniss Everdeen is recovering after being attacked by Peeta Mellark, who has been brainwashed by the Capitol. Despite Katniss's desire to kill President Snow, Alma Coin refuses to allow her into battle, as she is too valuable to risk losing. However, Katniss volunteers to be sent to District 2, the only district still controlled by the Capitol. District 13's Air Force launches a full-scale bombing on a mountain nicknamed The Nut, that houses the Capitol's main weaponry and air force, with few survivors. Although Katniss manages to convince the district to join the rebellion, she is shot by one of the survivors, who is then shot and killed, but is saved by her bulletproof Mockingjay costume.\n\nAt Finnick Odair and Annie Cresta's wedding, Johanna Mason suggests Katniss sneak aboard a supply aircraft leaving for the Capitol. Unable to bring her back, Coin has her assigned to the \"Star Squad\", that is led by Boggs and includes Gale, Finnick, Cressida and her crew, and other soldiers. They will follow in relative safety behind the actual invasion of the Capitol providing video of their incursion for propaganda purposes. Boggs carries a holographic map (the \"Holo\") to help them evade known booby trapped \"pods\" that line the streets of the Capitol. Coin later sends Peeta to join the squad, even though he has not fully recovered from the Capitol's conditioning.\n\nAs they venture deeper into the Capitol, Boggs triggers a land mine and is fatally wounded; he gives the Holo to Katniss before dying. The squad triggers another pod that releases a flood of lethal black oil. Peeta momentarily succumbs to his conditioning and attacks Katniss, killing Private Mitchell in the process. The group takes shelter in an abandoned building, where Jackson, the second-in-command, attempts to commandeer the Holo, despite the crews disapproval, until Katniss says that she is under secret orders from Coin to kill Snow. Katniss and most of the group escape just before a squad of Peacekeepers arrive and destroy the building. The Capitol broadcasts a message announcing Katniss's death, that is interrupted by Coin, who delivers an impassioned eulogy for her to rally the rebels.\n\nCameraman Castor decides to have them go through the sewers to avoid getting detected by the Capitol's forces, having his mute brother and fellow cameraman Pollux show the way down. The team manages to avoid further pods, but they are attacked by a horde of genetically engineered creatures called \"mutts\" when Snow finds out that they are still alive. Jackson, Castor, and Private Homes are killed as the squad flees through the sewers. Finnick fights off the mutts with his trident and pocket-knife to allow the rest of the team to escape, but they overwhelm him, forcing Katniss to set the Holo's self-destruct, killing him and the remaining mutts. While running from pursuing Peacekeepers, Cameraman Messalla is melted by a pod. The surviving team members (Katniss, Peeta, Gale, Cressida and Pollux) reach the surface and take refuge in a shop, where Tigris, a former Hunger Games stylist and rebel sympathizer, hides them in her basement.\n\nAs rebel forces gain ground, Snow invites fleeing Capitol citizens into his mansion for protection. Katniss and Gale join the crowd, posing as refugees. As rebels arrive and attack, Peacekeepers capture Gale and herd Capitol children toward the palace gates. A hovercraft with Capitol markings flies overhead and drops small parcels into the crowd. The parcels explode, killing and injuring many people. A team of rebel medics attempt to help the injured, including Katniss's sister Prim. As Katniss rushes forward, a second wave of bombs detonate, killing Prim and knocking Katniss unconscious.\n\nUpon recovering, Katniss learns the Capitol has been conquered and Snow captured. When Katniss confronts Snow in his rose garden, he explains that Coin orchestrated the bombing using a Capitol hovercraft to make it look like he would kill their children and to turn his soldiers against him. Katniss tells Snow that she doesn't believe him, but he reminds her that they promised not to lie to each other. She realizes that the incident resembles a trap that Gale had developed earlier, bombing an area, then again later to kill medics. When Gale doesn't deny that it may have been based on his idea, Katniss becomes heartbroken and cuts all ties with him. Coin declares herself as the interim President of Panem and invites the remaining Hunger Games victors to vote on a proposal to have another Hunger Games using the children of the Capitol as a symbolic gesture to satisfy the districts. Peeta, Beetee and Annie disagree with the idea, while Johanna and Enobaria (the sixth Quarter Quell survivor) agree. Katniss votes yes in exchange for the right to publicly execute Snow and to avenge her sister's death. Haymitch considers the situation then swings the vote in favor.\n\nAt the execution, Katniss shoots and kills Coin instead of Snow, realizing that she is no better than Snow for killing people for her own personal gain. Katniss is then taken into custody while Snow is killed by the angry mob. Katniss receives a letter from Plutarch Heavensbee on her actions and is assured that she will eventually be pardoned by the newly appointed President of Panem for her crime and will be able to return to District 12 once the dissension quiets. At District 12 she is joined by Peeta, who has recovered from his condition. Commander Paylor of District 8 is elected the new President of Panem, and Katniss, Peeta, and Haymitch bond over their shared trauma. Years later, Katniss and Peeta play with their two children, and Katniss realizes she made the right choice. She contemplates the events of the series, stating that \"there are worse games to play\".",
  "synopsis": null
}