{
  "imdb_id": "tt4859246",
  "tmdb_id": "311166",
  "douban_id": null,
  "title": "Maari (2015)",
  "genres": [
    "Action",
    "Comedy",
    "Drama"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "138 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm4897036",
      "name": "Balaji Mohan"
    }
  ],
  "writer": [
    {
      "id": "nm4897036",
      "name": "Balaji Mohan",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1333687",
      "name": "Dhanush",
      "character": "Maari"
    },
    {
      "id": "nm2570245",
      "name": "Kajal Aggarwal",
      "character": "Sridevi       (as Kajal Agarwal)"
    },
    {
      "id": "nm1320481",
      "name": "Vijay Yesudas",
      "character": "Arjun Kumar"
    },
    {
      "id": "nm5199559",
      "name": "Robo Shankar",
      "character": "Sani Kizhamai"
    },
    {
      "id": "nm6106360",
      "name": "Kaali Venkat",
      "character": "Constable"
    },
    {
      "id": "nm1941409",
      "name": "Shanmugha Rajan",
      "character": "Velu"
    },
    {
      "id": "nm6504384",
      "name": "Mime Gopi",
      "character": "Bird Ravi"
    },
    {
      "id": "nm7457544",
      "name": "Kalloori Vinoth",
      "character": "Adithangi"
    },
    {
      "id": "nm7598802",
      "name": "Azhagu",
      "character": "Anbu"
    },
    {
      "id": "nm1560660",
      "name": "Sriranjani",
      "character": "Sridevi's Mother"
    },
    {
      "id": "nm6513615",
      "name": "Sampath Ram",
      "character": "Pandi"
    },
    {
      "id": "nm4794064",
      "name": "Anirudh Ravichander",
      "character": "Guest Appearance"
    },
    {
      "id": "nm4897036",
      "name": "Balaji Mohan",
      "character": "Guest Appearance"
    },
    {
      "id": "nm4442569",
      "name": "Joy Badlani",
      "character": "Assistant Police Officer"
    },
    {
      "id": "nm7708706",
      "name": "Joel Nigli",
      "character": "Store Customer Swaminathan"
    }
  ],
  "overview": "A local don locks horns with the new cop, who has come to his place, but both are not what they initially seem to be.",
  "storyline": "Maari (Dhanush) is a local don. According to popular hearsay-eight years back, Maari had murdered another powerful goon in that area after which he took over as local don. When Arjun (Vijay Yesudas), a cunning cop gets transferred to the area, he tries to collect enough proof to put Maari behind the bars with the help of Sridevi (Kajal) who has her own reasons to hate the don. Now, Maari the goon with a large heart returns from jail, only to realize that his area is now under the control of Arjun. What happens next ?",
  "plot": "A constable talks to the new subinspector Arjun (Vijay Yesudas) about Maari, a local rowdy, who rose to fame after killing a rival rowdy. Maari(Dhanush) is an irritating guy, who along with his henchmen Sanikilamai (Robo Shankar) and Adithangi (Kalloori Vinoth), constantly pesters the people in the area and extorts money from them. His main line of work is in training racing pigeons. His boss is Velu, a bigger don who also is involved in the pigeon races as well as the smuggling of sandalwood.\n\nMaari constantly has fights with \"Bird\" Ravi (Mime Gopi), another local rowdy who is also working under Velu. One day, a lady named Sridevi (Kajal Aggarwal) enters the business, trying to open a boutique in Maari's area. Maari forcefully becomes her partner in the business, which angers her after she loses some customers. She decides to help Arjun to catch Maari by getting close to him, pretending to fall in love with him and incriminating him with evidence of his confession: he had tried to kill the rival rowdy, but failed. Somebody else had killed him, and he took the credit. Maari is soon arrested by Arjun. 6 months later, when he is released, he finds out that Velu also has been arrested, and that Arjun is actually a corrupt cop - he and Ravi are working together and have arrested some people in the area under the pretext of smuggling, to extort money. Maari decides to take revenge on the duo. He first frees the local people from the extortion by Ravi's gang, when Sridevi also falls in love with him for real. Later he captures one of Arjun's smuggling vehicles and the driver and forces him to release Velu. When he takes revenge by burning the pigeon coop of Maari, he gets angry and beats up Ravi and Arjun, with the former agreeing to confess to everything. Angered, Arjun stabs Ravi but eventually gets arrested by the Revenue Department after his constable reveals all the secrets. Finally Sridevi approaches Maari to confess her love, which he rejects, returning to pester the local people and extort them for cash.",
  "synopsis": null
}