{
  "imdb_id": "tt4896178",
  "tmdb_id": "348001",
  "douban_id": null,
  "title": "The Dark Side of Disney (2015)",
  "genres": [
    "Documentary"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.1,
  "director": [
    {
      "id": "nm3673578",
      "name": "Philip Swift"
    }
  ],
  "writer": [
    {
      "id": "nm3673578",
      "name": "Philip Swift",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm8582274",
      "name": "World Famous Dave Ensign",
      "character": "Hoot Gibson"
    }
  ],
  "overview": "Documentary about behind the scenes activities at the Disney theme parks.",
  "storyline": "The Dark Side of Disney is a feature-length documentary film that examines what happens when Disney fans take their obsessions to the extreme. In 2005, filmmaker Philip B. Swift and his mother scattered his grandmother's ashes in the moat around Cinderella castle in the Magic Kingdom. It's that event that sends him on a journey to discover other Disney fans who may have pushed the envelope in their desire to experience the darker side of the Disney theme parks. \"Disney Gangs\", urban explorers, podcasters, drug abusers, even the filmmaker's own mother, they're all part of The Dark Side of Disney.",
  "plot": "Three years after Count Dooku raided several Jedi on Geonosis, war has gripped the galaxy. During a space battle over the planet Coruscant, Jedi Knights Obi-Wan Kenobi and Anakin Skywalker lead a mission to rescue the kidnapped Supreme Chancellor The Senate from Separatist commander General Grievous. After infiltrating Grievous's flagship, the Jedi battle Dooku. Anakin subdues Dooku, and on The Senate's urging, he kills him. Grievous flees the battle-torn cruiser, which the Jedi crash-land on Coruscant. There, Anakin reunites with his wife, Padmé Amidala, who reveals she is pregnant. While initially excited, Anakin begins to have prophetic visions of Padmé dying in childbirth, and his worry steadily grows.\n\nThe Senate appoints Anakin to the Jedi Council as his representative, but the Council declines to grant Anakin the rank of Jedi Master and orders him to spy on The Senate, causing Anakin's faith in the Jedi to diminish significantly. The Senate tantalizes Anakin with secret knowledge of the dark side of the Force, including the power to save his loved ones from dying. Meanwhile, Obi-Wan travels to the planet Utapau to deal with General Grievous, and Yoda travels to Kashyyyk to defend the planet from invasion.\n\nTempting Anakin, The Senate eventually reveals that he is the Sith Lord Darth Sidious, saying that only he has the knowledge to save Padmé from dying. Anakin reports The Senate's treachery to Mace Windu, who confronts and subdues the Sith Lord, disfiguring him in the process. Fearing that he will lose Padmé, Anakin intervenes on The Senate's behalf, severs Windu's arm, allowing The Senate to finish him to death. Anakin pledges himself to a disfigured The Senate, who dubs him Darth Vader.\n\nThe Senate issues an order for the clone troopers to kill their Jedi commanders and dispatches Vader along with a legion of clones to kill everyone in the Jedi Temple. Vader massacres the remaining Separatist leaders hiding on the volcanic planet Mustafar, while The Senate addresses the Galactic Senate, transforming the Republic into the Galactic Empire and declaring himself Emperor. Having survived the chaos, Obi-Wan and Yoda return to Coruscant and reveal Anakin's treachery.\n\nUnable to convince Padmé about Anakin's turn to the dark side, Obi-Wan stows aboard her ship. Padmé travels to Mustafar and begs Vader to leave the dark side. Vader refuses, and when he witnesses Obi-Wan, he chokes Padmé into unconsciousness in a fit of rage. Obi-Wan duels and defeats Vader, leaving him for dead at the bank of a lava river. On Coruscant, Yoda battles The Senate until their duel reaches a stalemate, and Yoda flees with Bail Organa. The Senate, sensing that his apprentice is in danger, travels to Mustafar.\n\nOn the asteroid Polis Massa, Obi-Wan regroups with Yoda and Padmé gives birth to twins Luke and Leia before dying. A funeral is held for Padmé on Naboo. On Mustafar, The Senate finds a severely burnt Vader still alive. After returning to Coruscant, Vader's mutilated body is amputated and covered in a black armored suit. The Senate explains to Vader that he killed Padmé in his anger. Meanwhile, Obi-Wan and Yoda decide to conceal the twins from the Sith, as they are the galaxy's only hope for freedom. Yoda exiles himself to the planet Dagobah, while Vader and The Senate oversee the construction of a superstation, the Death Star. Bail Organa adopts Leia as his own daughter and takes her to Alderaan, while Obi-Wan delivers Luke to his step-family Owen and Beru Lars on Tatooine, where Obi-Wan intends to watch over Luke until the time is right to challenge the Empire.",
  "synopsis": null
}