{
  "imdb_id": "tt4848404",
  "tmdb_id": "354885",
  "douban_id": null,
  "title": "Merry Riana: Mimpi Sejuta Dolar (2014)",
  "genres": [
    "Biography"
  ],
  "country": "Indonesia",
  "version": [],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm4935793",
      "name": "Hestu Saputra"
    }
  ],
  "writer": [
    {
      "id": "nm6370784",
      "name": "Rahabi Mandra",
      "description": "screenplay"
    },
    {
      "id": "nm1907447",
      "name": "Titien Wattimena",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm3022369",
      "name": "Sellen Fernandez",
      "character": ""
    },
    {
      "id": "nm6313534",
      "name": "Chelsea Islan",
      "character": "Merry Riana"
    },
    {
      "id": "nm1001160",
      "name": "Niniek L. Karim",
      "character": ""
    },
    {
      "id": "nm3153544",
      "name": "Cynthia Lamusu",
      "character": ""
    },
    {
      "id": "nm3150965",
      "name": "Kimberly Ryder",
      "character": "Irene Lee"
    },
    {
      "id": "nm1146837",
      "name": "Ferry Salim",
      "character": ""
    },
    {
      "id": "nm9306174",
      "name": "Darwyn Tse",
      "character": "Interrogating Officer"
    },
    {
      "id": "nm3311394",
      "name": "Dion Wiyoko",
      "character": "Alfa"
    },
    {
      "id": "nm7702823",
      "name": "Lanawati Tuti Wulandani",
      "character": ""
    }
  ],
  "overview": "Merry Riana depicts an individual’s tenacity and refusal to never bow to any hardship in life.",
  "storyline": "Riots in Indonesia , requires Merry Riana and her family who is a Chinese ethnic to move abroad. On their way to the airport, his family was robbed,their money, phones and document are stolen exceptMerrysfather laptop. Because the money is not enough for all family member so only Merry could go to Singapore. Her father give a laptop and money to her, he also give herUncle Hanss address so she can stay there for a while. When she was at Singapore, Merry go to Uncle Hans apartment but unfotunately he found that Uncle Hans was not live in there anymore because he couldnt pay the fees. Merry does not know anyone in Singapore. After that, she decided to go to a café in order to get an internet access and luckily she met Mrs. Noor, the owner of the Internet café. At first she tried to contact her senior high schools friend trough a fiture called locate friend and luckily she found her friend named Irenewhostudying at the Nanyang Technological University ( NTU ). She stayed in Irenes room ...",
  "plot": null,
  "synopsis": "Riots in Indonesia , requires Merry Riana and her family who is a Chinese ethnic to move abroad. On their way to the airport, his family was robbed,their money, phones and document are stolen exceptMerrysfather laptop. Because the money is not enough for all family member so only Merry could go to Singapore. Her father give a laptop and money to her, he also give herUncle Hanss address so she can stay there for a while. When she was at Singapore, Merry go to Uncle Hans apartment but unfotunately he found that Uncle Hans was not live in there anymore because he couldnt pay the fees.\nMerry does not know anyone in Singapore. After that, she decided to go to a café in order to get an internet access and luckily she met Mrs. Noor, the owner of the Internet café. At first she tried to contact her senior high schools friend trough a fiture called locate friend and luckily she found her friend named Irenewhostudying at the Nanyang Technological University ( NTU ). She stayed in Irenes room illegally and the next dayshe get caught, the dormitory guard came and asked Merry to go out of the dorm, except Merry enrolled as a student of NTU. So Merry decided to register and take the exam of NTU. Unexpetedly she pass the exam, but the problem is she doesnt have money to complete the administration, but then she asked for a student loan. Although she can use the student loan she still need a guarantor as a requirement given by the university. Irene help her to find the guarantor by asking her senior namedAlvaan Indonesian student who admired by Irene to become a guarantor. Unfortunately Alva does not agree with the idea except Merry has a job and to prove that she meant it, she was looking for a job and fortunately she could find a jobatSave Heart Boothat that time and she succeeded, Finally Alva agree to become her guarantor. Merry told her father about her college.\nMerry has to stop worked at Save Heart Boothdue tothe booth was suspectedby police that they were employed a worker without work pass. Merry soldher fathers laptopand use the money to make an investment at stock company. Then she came to the stock markets office named Success Forever to register and make an investment. She sent an e-mail to invite her friends to join Success Forever, including Alva. Alva hesitated, then asked Merry to come and see the office by his self to prove. But unexpetedly what they get is only an empty office containing scrap items. Alva invitedMerry to go to Singapore Flyer and give his job as a cleaning service. It was seen by Irene. Irene was angry to Merry and asked her to go out from her room at that night. Because she doens have place to sleep so she decide tosleepat Back Alley with shoe cobbler. The next day, Merry try to go back to her dorm and found that Irene had moved away.\nOne day, Alva meet Merry and invite her to participate in stock market online. Merry interested with that and decide to stopped working at the Singapore Flyer and focused on stock market online. One day, Alva invited Merry to some cafe and intend to propose Merry. He wanted to give her a ring with the carved on it, writtenSHMILY MERRY but Merry couldns stop talking about stock online and money, it makes him upset and leave her suddenly. Alvagive the ring to the shoe cobbler. On her way back to home she still focuse with the online stock and invest all her money. But not long ago, the company she was invested went bankrupt. The next morning, Merry transported to the police station because she was suspected as one of the company's agent impostor which is Success Forever. She called Alva asked for a help,then Merry finally free. When she arrived at the dormitory, it turned out her mother was waiting in the front of room and she feel very surprised and happy at the same time. The next morning, her mother give her a money before she returned home.\nShe took a job at an insurance company. On the wayback to the dormitory, she found the cobbler shoe fainted on the roadside. She took the cobbler shoe to the hospital and be responsible on her. When she rest on the side of the road, she met Mrs. Noor again and invited toher apartment to do a presentation. When sheenter the dormitory, she met Irene and apologize to her. The next morning, she went to the apartment of Mrs. Noor and present her an insurance prospects. Unexpectedly Mrs. Noor directly invested $ 100,000. It was shocking and makes Merry happy. She could pay the Shoe cobblers hospital fees. Shoe cobbler gives the ring as an expression of gratitude. Turns Merry recognize the ring, the shoe cobbler told herhow he was able to get the ring, after knowing that Merry meet Alva soon at the Singapore Flyer. And at that place Merry express her love to Alva."
}