{
  "imdb_id": "tt4897822",
  "tmdb_id": "352208",
  "douban_id": null,
  "title": "Where to Invade Next (2015)",
  "genres": [
    "Documentary",
    "Comedy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "120 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm0601619",
      "name": "Michael Moore"
    }
  ],
  "writer": [
    {
      "id": "nm0601619",
      "name": "Michael Moore",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0601619",
      "name": "Michael Moore",
      "character": "Himself"
    },
    {
      "id": "nm9126029",
      "name": "Johnny Fancelli",
      "character": "Himself"
    },
    {
      "id": "nm9126030",
      "name": "Christina Fancelli",
      "character": "Herself"
    },
    {
      "id": "nm9126031",
      "name": "Lorena Lardini",
      "character": "Herself"
    },
    {
      "id": "nm9126032",
      "name": "Luigi Lardini",
      "character": "Himself"
    },
    {
      "id": "nm9126033",
      "name": "Annarita Lardini",
      "character": "Herself"
    },
    {
      "id": "nm9126034",
      "name": "Claudio Domenicali",
      "character": "Himself"
    },
    {
      "id": "nm9126035",
      "name": "Salvatore Bernaducci",
      "character": "Himself"
    },
    {
      "id": "nm9126036",
      "name": "Valérie Rano",
      "character": "Herself"
    },
    {
      "id": "nm5348550",
      "name": "Krista Kiuru",
      "character": "Herself, Finnish Minister of Education"
    },
    {
      "id": "nm9126037",
      "name": "Pasi Majasaari",
      "character": "Himself, High School Principal"
    },
    {
      "id": "nm9126038",
      "name": "Anna Hart",
      "character": "Herself, First Grade Teacher"
    },
    {
      "id": "nm9126039",
      "name": "Leena Liusvaara",
      "character": "Herself, School Principal"
    },
    {
      "id": "nm9126040",
      "name": "Arttu Taipale",
      "character": "Himself, Finnish Student, year abroad in U.S."
    },
    {
      "id": "nm9126041",
      "name": "Meghan Smith",
      "character": "Herself, teacher, U.S. Native"
    },
    {
      "id": "nm6711986",
      "name": "Pasi Salhberg",
      "character": "Himself, Education Policy Advisor, Finland"
    },
    {
      "id": "nm9126042",
      "name": "Matej Zebovec",
      "character": "Himself"
    },
    {
      "id": "nm9126043",
      "name": "Sean Nolimal",
      "character": "Himself"
    },
    {
      "id": "nm9126044",
      "name": "Leeanna Whirl",
      "character": "Herself"
    },
    {
      "id": "nm9126045",
      "name": "Ivan Svetlik",
      "character": "Himself"
    },
    {
      "id": "nm9126046",
      "name": "Jenny Tumas",
      "character": "Herself"
    },
    {
      "id": "nm9126047",
      "name": "Borut Pahor",
      "character": "Himself"
    },
    {
      "id": "nm9126048",
      "name": "Indra",
      "character": "Herself"
    },
    {
      "id": "nm9126049",
      "name": "Madeline",
      "character": "Herself"
    },
    {
      "id": "nm9126050",
      "name": "Sabine",
      "character": "Herself"
    },
    {
      "id": "nm6009951",
      "name": "Thomas Sattelberger",
      "character": "Himself"
    },
    {
      "id": "nm9126051",
      "name": "Ralf Heyen",
      "character": "Himself"
    },
    {
      "id": "nm9126052",
      "name": "Ole Niethammer",
      "character": "Himself"
    },
    {
      "id": "nm9126053",
      "name": "Annika Schmidt",
      "character": "Herself"
    },
    {
      "id": "nm9126054",
      "name": "Sami Ahmed",
      "character": "Himself"
    },
    {
      "id": "nm9126055",
      "name": "Nelson Ribeiro",
      "character": "Himself"
    },
    {
      "id": "nm9126056",
      "name": "Rui Marta",
      "character": "Himself"
    },
    {
      "id": "nm5537310",
      "name": "Nuno Capaz",
      "character": "Himself"
    },
    {
      "id": "nm9126057",
      "name": "Rune",
      "character": "Himself"
    },
    {
      "id": "nm9126058",
      "name": "Bekim",
      "character": "Himself"
    },
    {
      "id": "nm9126059",
      "name": "Wojciech",
      "character": "Himself"
    },
    {
      "id": "nm9126060",
      "name": "Trond",
      "character": "Himself"
    },
    {
      "id": "nm9126061",
      "name": "Tom Eberhardt",
      "character": "Himself"
    },
    {
      "id": "nm9126062",
      "name": "Fidan",
      "character": "Himself"
    },
    {
      "id": "nm9126063",
      "name": "Victor",
      "character": "Himself"
    },
    {
      "id": "nm9126064",
      "name": "Jens Christian Syverstad",
      "character": "Himself"
    },
    {
      "id": "nm9126065",
      "name": "Trond Blattmann",
      "character": "Himself"
    },
    {
      "id": "nm9126066",
      "name": "Rim Ben Aissa",
      "character": "Herself"
    },
    {
      "id": "nm9126067",
      "name": "Amel Smaoui",
      "character": "Herself"
    },
    {
      "id": "nm6326486",
      "name": "Rachid Ghannouchi",
      "character": "Himself"
    },
    {
      "id": "nm9126068",
      "name": "Halla Tómasdóttir",
      "character": "Herself"
    },
    {
      "id": "nm2522340",
      "name": "Vigdís Finnbogadóttir",
      "character": "Herself"
    },
    {
      "id": "nm9126069",
      "name": "Hafdis",
      "character": "Herself"
    },
    {
      "id": "nm9126070",
      "name": "Rannveig",
      "character": "Herself"
    },
    {
      "id": "nm9126071",
      "name": "Margret",
      "character": "Herself"
    },
    {
      "id": "nm0323463",
      "name": "Jón Gnarr",
      "character": "Himself"
    },
    {
      "id": "nm9126072",
      "name": "Ólafur Þór Hauksson",
      "character": "Himself"
    },
    {
      "id": "nm1808853",
      "name": "Rod Birleson",
      "character": "Himself       (as Rod)"
    }
  ],
  "overview": "Academy Award-winning director Michael Moore returns with what may be his most provocative and hilarious film yet: Moore tells the Pentagon to \"stand down\" — he will do the invading for America from now on.",
  "storyline": "To show what the USA can learn from rest of the world, director Michael Moore playfully visits various nations in Europe and Africa as a one-man \"invader\" to take their ideas and practices for America. Whether it is Italy with its generous vacation time allotments, France with its gourmet school lunches, Germany with its industrial policy, Norway and its prison system, Tunisia and its strongly progressive women's policy, or Iceland and its strong female presence in government and business among others, Michael Moore discovers there is much that American should emulate.",
  "plot": null,
  "synopsis": "\"This is an expansive, rib-tickling, and subversive comedy in which the eccentric, left-wing, populist filmmaker Michael Moore, playing the role of 'invader,' visits a host of nations to learn how the U.S. could improve its own prospects\".In the opening voice-over, Moore gives a sarcastic introduction about him visiting the Pentagon in Washington DC and given the green light to \"invade\" a series of countries authorized by the joint chiefs of staff. Moore leaves to \"invade\" Europe to discuss the subjects which he most covers in his activist work which are worker benefits, school lunches, early education, college education, worker inclusion, decriminalized drugs, low recidivism, women's health care, and women inclusion.ItalyMoore arrives and visits a factory where he discusses with the owner and various workers about labor rights and workers' well-being (paid holiday, thirteenth salary, parental leave, etc.). It ends with him in a person-to-person interview with Claudio Domenicali, the CEO of DucatiFranceMoore visits an elementary school where he talks with the students and teachers (via a translator) about various topics such as school meals and sex education and how the USA school system exploits the students in his country.FinlandMoore discusses Finland's education policy (almost no homework, no standardized testing, etc.), as well as speaking with Krista Kiuru, the Finnish Minister of Education.SloveniaMoore visits a university where he discusses with the local and foreign students about the debt-free/tuition-free higher education system and about the political nature of that county's education. He has interviews with Ivan Svetlik, the University of Ljubljana's rector, and Borut Pahor, the President of Slovenia.GermanyMoore visits two factories and business parks where he talks (through his German translator) with various other blue-collared workers about the country's labor rights and work life balance. He and his film crew visit the pencil making factory Faber-Castell, and discuss education about Nazi Germany.PortugalMoore arrives in Lisbon where he talks with some people as well as three city policemen about the country's May Day holiday for the workers, the lenient drug policy of Portugal, and the abolition of the county's death penalty.NorwayMoore discusses Norway's humane prison system and comparing it with the harsh and overcrowded prison system in the USA. Moore visits the maximum-security Bastøy Prison and Halden Prison, and Norway's response to the July 22, 2011 Utøya attacks committed by the right-wing extremist Anders Behring Breivik.TunisiaMoore meets with some women activists to discuss the evolution of women's rights in the country, including reproductive health, access to abortion and their role in the Tunisian Revolution and the drafting of the new Tunisian Constitution of 2014.IcelandMoore discusses the theme of women in power, speaking with Vigdís Finnbogadóttir, the world's first democratically elected female president of Iceland. He also meets with members of the Best Party with Jón Gnarr being elected Mayor of Reykjavík City. Also discussed are the 2008-2011 Icelandic financial crisis and the criminal investigation and prosecution of bankers, with special prosecutor Ólafur HaukssonThe Fall of the Berlin Wall.In the final scene, Moore travels back to Germany to Berlin where he points out that many of these ideas actually originated in the U.S.A., such as the constitutional ban on cruel and unusual punishment, abolition of the death penalty, the struggle for the 8-hour workday and the May Day holiday, the Equal Rights Movement for women, prosecution of financial fraud during the savings and loan crisis, etc. He discusses the fall of the Berlin Wall as hope for not only Germany but the rest of the world. The film ends with a film clip of the 1939 film 'The Wizard of Oz' where he explains that the solution to the problems America is faced with is always in plain sight as with Dorothy who learns that she always had the power to travel back home to Kansas with her magical red shoes."
}