{
  "imdb_id": "tt4959326",
  "tmdb_id": "357708",
  "douban_id": null,
  "title": "Size Zero (2015)",
  "genres": [
    "Comedy",
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "125 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm7534873",
      "name": "Prakash Kovelamudi"
    }
  ],
  "writer": [
    {
      "id": "nm2837117",
      "name": "Kanika Dhillon",
      "description": null
    },
    {
      "id": "nm8111951",
      "name": "Rakav Mirdath",
      "description": "tamil dialogue"
    }
  ],
  "cast": [
    {
      "id": "nm2011932",
      "name": "Anushka Shetty",
      "character": "Soundarya (Sweety)"
    },
    {
      "id": "nm1951127",
      "name": "Arya",
      "character": "Abhi       (as Aarya)"
    },
    {
      "id": "nm2978161",
      "name": "Sonal Chauhan",
      "character": "Simran"
    },
    {
      "id": "nm0882219",
      "name": "Urvashi",
      "character": "Soundarya's Mother"
    },
    {
      "id": "nm7237124",
      "name": "Pavani Gangireddy",
      "character": ""
    },
    {
      "id": "nm3953246",
      "name": "Master Bharath",
      "character": ""
    },
    {
      "id": "nm0015459",
      "name": "Nagarjuna Akkineni",
      "character": "Cameo Appearance (Telugu)"
    },
    {
      "id": "nm1883318",
      "name": "Jiiva",
      "character": "Cameo Appearance (Tamil)"
    },
    {
      "id": "nm0103977",
      "name": "Brahmanandam",
      "character": "Comedian"
    }
  ],
  "overview": "An overweight, young woman, who finds it hard to land a husband, learns to accept her 'Size Sexy' figure and leads an awareness campaign against a dubious slimness centre.",
  "storyline": "Soundarya aka sweety (Anushka Shetty) is a carefree working girl, who is a foodie and enjoys her life to the fullest. But her mother (Urvashi) is worried about her obese daughter and all the grooms that she finds reject Sweety as she is fat. Frustrated by all the rejections, Sweety says \"No\" to Abhi (Arya) who is apparently smitten by her innocence and kindheartedness. Later, Abhi falls in love with a fitness freak Simran (Sonal Chauhan). But slowly somewhere down the lane, Sweety takes a liking for Abhi but is shattered when she realizes that he is in love with Simran. Sweety decides to join a slimming center to lose weight as advised by her mother. What happens then ?",
  "plot": "Soundarya a.k.a. Sweety (Anushka Shetty) is an overweight woman who is brave and independent. She is slightly conscious about her weight but does not let it affect her. She falls in love with Abhishek (Arya) who was once a prospective groom for her and now a friend. She later finds out that he is in love with Simran (Sonal Chauhan). Sweety is devastated and joins a weight loss clinic, size zero, as she thinks her weight is the issue. One of her friends, Jyothi (Pavani Gangireddy), who is in the clinic with her, develops kidney problems because of the weight loss drugs given in the clinic. Sweety begins a crusade against the clinic. She is joined by Abhi and Simran. Abhi slowly starts to fall for Sweety. The rest of the movie is how Sweety triumphs in her crusade and gets her Prince Charming back.",
  "synopsis": null
}