{
  "imdb_id": "tt4903366",
  "tmdb_id": "330415",
  "douban_id": null,
  "title": "Idhu Enna Maayam (2015)",
  "genres": [
    "Comedy",
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "139 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.4,
  "director": [
    {
      "id": "nm1777967",
      "name": "Vijay"
    }
  ],
  "writer": [
    {
      "id": "nm1777967",
      "name": "Vijay",
      "description": null
    },
    {
      "id": "nm7356610",
      "name": "A.L. Vijay",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm5076645",
      "name": "Vikram Prabhu",
      "character": "Arun"
    },
    {
      "id": "nm1963406",
      "name": "Navdeep",
      "character": "Santhosh"
    },
    {
      "id": "nm7146337",
      "name": "Keerthi Suresh",
      "character": "Maya"
    },
    {
      "id": "nm5798438",
      "name": "Kavya Shetty",
      "character": "Pallavi"
    },
    {
      "id": "nm7489703",
      "name": "Luthfudeen Baashaa",
      "character": "Venky"
    },
    {
      "id": "nm0621937",
      "name": "Nassar",
      "character": ""
    },
    {
      "id": "nm0024302",
      "name": "Ambika",
      "character": "Arun's Mother"
    },
    {
      "id": "nm5657068",
      "name": "RJ Balaji",
      "character": "Arun's Friend"
    },
    {
      "id": "nm4958823",
      "name": "Balaji",
      "character": "Bharath"
    },
    {
      "id": "nm7498306",
      "name": "Rj Ajay",
      "character": "Karthik"
    },
    {
      "id": "nm7489704",
      "name": "Abishek Joseph George",
      "character": "Abi       (as Abhishek Joseph)"
    },
    {
      "id": "nm3833583",
      "name": "Lollu Sabha Jeeva",
      "character": "Shaji"
    },
    {
      "id": "nm1706602",
      "name": "Charlie",
      "character": ""
    },
    {
      "id": "nm1007581",
      "name": "Manobala",
      "character": ""
    },
    {
      "id": "nm7489705",
      "name": "Madhav Vishnu",
      "character": ""
    },
    {
      "id": "nm7556452",
      "name": "Akhilesh Krishna",
      "character": "Akhil"
    },
    {
      "id": "nm8279299",
      "name": "Sanath Sivaraj",
      "character": "Collage Student"
    }
  ],
  "overview": "Arun past catches up with his present when he and his friends start a company to bring together those in love by setting them up in pre-planned scenes. What happens when he is forced to set up his true love to fall for another guy?",
  "storyline": "Arun (Vikram Prabhu) runs a drama troupe with like-minded friends but sadly there is no big reception. In order to make some money, they start a firm called Unnal Mudiyum Thambi (UMT) through with they literally write script and execute it to help the romantically challenged youngsters. Everything goes well until a businessman called Santhosh (Navdeep) approaches UMT as he badly wants to marry Maya (Keerthi Suresh).",
  "plot": "Arun (Vikram Prabhu) is a struggling theatre artiste. With the help of his friends, who are also struggling theatre artistes, he starts a website called UMT which helps men struggling in love to successfully unite with the woman of their dreams with the help of theaterics. One day, UMT gets a rich client in the form of Santhosh (Navdeep), the owner of a real estate company. Santhosh is in love with a singer Maya (Keerthy Suresh) and offers ₹1,00,00,000 if Arun and his friends can help him in winning Maya's heart. Arun has second thoughts over the offer because Maya is his ex-girlfriend. They had broken up due to a serious misunderstanding between them. Though he still has feelings for Maya, he reluctantly agrees to help Santhosh. However, he foils all the plans to bring Santhosh and Maya together. A frustrated Santhosh then directly proposes to Maya, but she rejects him as she has still not forgotten Arun.\n\nIn the end, it is revealed that Santhosh and Arun's friends knew about Arun's love for Maya and with the help of Maya, they deliberately made all the plans to unite Santhosh and Maya fail so that Arun and Maya can get back together. Arun realises his mistake and declares his love for Maya, thus rekindling their romance.",
  "synopsis": null
}