{
  "imdb_id": "tt4934408",
  "tmdb_id": "362003",
  "douban_id": null,
  "title": "Love, Love, Love (2016)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "Greece",
  "version": [
    {
      "runtime": "102 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.2,
  "director": [
    {
      "id": "nm1847774",
      "name": "Costas Zapas"
    }
  ],
  "writer": [
    {
      "id": "nm1847774",
      "name": "Costas Zapas",
      "description": "writer"
    },
    {
      "id": "nm1847774",
      "name": "Costas Zapas",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3028929",
      "name": "Angeliki Papathemeli",
      "character": "Stella"
    },
    {
      "id": "nm3188897",
      "name": "Antonis Papadopoulos",
      "character": "Nikos"
    },
    {
      "id": "nm1952889",
      "name": "Nikol Drizi",
      "character": "Fani"
    },
    {
      "id": "nm3164116",
      "name": "Mara Darmousli",
      "character": "Myrto"
    },
    {
      "id": "nm7512026",
      "name": "Angelos Valeras",
      "character": "Ektoras"
    },
    {
      "id": "nm0368961",
      "name": "Dimitra Hatoupi",
      "character": "Fofi"
    },
    {
      "id": "nm0693611",
      "name": "Dimitris Poulikakos",
      "character": "Manos"
    },
    {
      "id": "nm1464611",
      "name": "Errikos Litsis",
      "character": "Miltos"
    },
    {
      "id": "nm4059675",
      "name": "Katerina Laspa",
      "character": "Maria"
    },
    {
      "id": "nm7512028",
      "name": "Eva Koutsoupaki",
      "character": ""
    },
    {
      "id": "nm7167685",
      "name": "Sandy Markogiannaki",
      "character": ""
    },
    {
      "id": "nm4772960",
      "name": "Sakis Tziniaros",
      "character": ""
    },
    {
      "id": "nm7512027",
      "name": "Giorgos Voskopoulos",
      "character": ""
    }
  ],
  "overview": "Shortly before the completion of his latest project, a filmmaker who has already made his mark on the local cult and avant-garde film scene, presents his latest effort - a real low-budget masterpiece!",
  "storyline": "Stella, a forty years old exotic woman, after her husband's death in a car accident, whose causes remain unresolved for the police, works as a stripper in an old movie theatre that has been transformed to a strip club, in order to survive financially with her young daughter Fanny. There Stella will meet Nick, an aged ex-playboy, who drifts around alone, dumped by his wife, but also by his son, Hector, who has just been married. Nick will fall in love with Stella, fully, desperately. And he will vindicate her. But their children, Fani and Ektoras, will also vindicate their part form love. Because Fanny, who hasn't accept her father's death, has now become aggressive, rebellious, and explosive. And mainly erotic with every man and with all. But also Hector, abandoned by his mother, he becomes day by day a violent and unpredictable man. They all lack love and they want it more than anything their own, solely their own. Will love be able to change the fate of these people? Will love be ...",
  "plot": "Jiao Ye (played by Tang Wei) is a casino hostess in Macau who accompanies customers as they gamble and earns a living from their tips. Her father, who brought her to Macau from mainland China, was an inveterate gambler who has since died, leaving her with a large pile of debts and a gambling habit of her own. Despite this, she is a good-natured girl who balances her money problems with a longing to find some meaning in her life and a boyfriend she has feelings for.\n\nDaniel Luo (Wu Xiubo) is a real estate broker in Los Angeles who moved there with his parents from Beijing 20 years prior, although they subsequently divorced and both returned to China. Daniel has since built an outwardly successful life for himself in California, selling properties to wealthy Chinese buyers, but his parents' divorce when he was young still affects him, and he refuses to get into any kind of close emotional relationship.\n\nBoth Jiao and Daniel come across an old book, \"84 Charing Cross Road\", which tells the story of New York writer Helene Hanff and her 20-year correspondence with British bookseller Frank Doel, whose shop was at 84 Charing Cross Road in London. Daniel and Jiao, both in foul moods and blaming the book for recent misfortunes in their lives, decide to get rid of it by mailing the book to the address in the title. Unbeknown to either of them, the current proprietor of 84 Charing Cross Road, Mr Thomas, is an elderly gentleman who enjoys matchmaking and redirects the letters from Jiao and Daniel to each other.\n\nOver the course of the next year, Daniel and Jiao begin a regular correspondence by sending letters to 84 Charing Cross Road, each believing the other to be a Chinese person living in London. Mr Thomas continues forwarding their letters without their knowledge. The letters are hostile at first, but eventually a genuine friendship develops. Jiao incurs a large debt and accompanies a rich client to Las Vegas to pay it off. Meanwhile, Daniel befriends an elderly Chinese couple who own a house he wants to buy, but since he knows they would never approve of his plan to tear their house down and replace it with two new ones, he tries an underhanded tactic to trick them into selling. As part of his plan, he also takes them to Las Vegas for a vacation, and nearly crosses paths with Jiao several times, although neither knows what the other looks like.\n\nDaniel begins to feel guilty about what he is doing, and his plan is eventually found out by the old couple. Jiao's relationship with her client ends, and she and Daniel console each other through their letters. Around the same time, they also both decide to reveal their real identities to each other. However, Mr Thomas passes away before the letters admitting their identities can be forwarded on, and both Jiao and Daniel believe the other person has decided to break off the relationship. They also have no way of getting in touch with each other anymore.\n\nRealizing their growing feelings for each other, and desperately seeking news of what has happened to the other person, Daniel and Jiao travel separately to 84 Charing Cross Road, where they learn the truth about who has been forwarding their letters, and are also told about Mr Thomas's upcoming funeral. At the service, they just miss finding each other, although Daniel realizes that Jiao was also in attendance when he sees a tribute card she leaves for Mr Thomas at the funeral. However, none of their attempts to locate the other person work. Having given up, both Daniel and Jiao return to 84 Charing Cross Road one last time to leave a farewell letter, where they finally meet. The film ends as the two stroll through London's South Bank at night, chatting about their lives.",
  "synopsis": null
}