{
  "imdb_id": "tt4902130",
  "tmdb_id": "355441",
  "douban_id": null,
  "title": "L'homme qui répare les femmes: la colère d'Hippocrate (2015)",
  "genres": [
    "Documentary",
    "Biography",
    "News",
    "War"
  ],
  "country": "Belgium",
  "version": [
    {
      "runtime": "112 min",
      "description": ""
    },
    {
      "runtime": "52 min",
      "description": "TV"
    },
    {
      "runtime": "53 min",
      "description": "TV\n            2018"
    }
  ],
  "imdb_rating": 8.1,
  "director": [
    {
      "id": "nm0584921",
      "name": "Thierry Michel"
    }
  ],
  "writer": [
    {
      "id": "nm2198553",
      "name": "Colette Braeckman",
      "description": "co-writer"
    },
    {
      "id": "nm7139543",
      "name": "Colette Braeckman",
      "description": null
    },
    {
      "id": "nm0584921",
      "name": "Thierry Michel",
      "description": "writer"
    },
    {
      "id": "nm0584921",
      "name": "Thierry Michel",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2709314",
      "name": "Martin Spinhayer",
      "character": "Narrator"
    },
    {
      "id": "nm3067277",
      "name": "Denis Mukwege Mukengere",
      "character": "Himself"
    },
    {
      "id": "nm0166921",
      "name": "Hillary Clinton",
      "character": "Herself"
    }
  ],
  "overview": "Winner of the Sakharov Prize 2014, Doctor Mukwege is internationally known as the man who mends thousands of women who have been raped during the 20 years of conflicts in the East of the Democratic Republic of the Congo, one of the poorest countries on the planet, despite its extremely rich sub-soil.  His endless struggle to put an end to these atrocities and denounce the impunity enjoyed by the perpetrators is not welcome.  At the end of 2012, the Doctor was the target of another attempt on his life, which he miraculously survived.  Threatened with death, this doctor with an exceptional destiny now lives cloistered in his hospital in Bukavu under the protection of the United Nation peacekeepers.  But he is no longer alone in his struggle. The women to whom he has restored physical integrity and dignity, stand beside him, true activists for peace, hungry for justice.",
  "storyline": "Winner of the Sakharov Prize 2014, Doctor Mukwege is internationally known as the man who mends thousands of women who have been raped during the 20 years of conflicts in the East of the Democratic Republic of the Congo, one of the poorest countries on the planet, despite its extremely rich sub-soil. His endless struggle to put an end to these atrocities and denounce the impunity enjoyed by the perpetrators is not welcome. At the end of 2012, the Doctor was the target of another attempt on his life, which he miraculously survived. Threatened with death, this doctor with an exceptional destiny now lives cloistered in his hospital in Bukavu under the protection of the United Nation peacekeepers. But he is no longer alone in his struggle. The women to whom he has restored physical integrity and dignity, stand beside him, true activists for peace, hungry for justice.",
  "plot": null,
  "synopsis": null
}