{
  "imdb_id": "tt4970038",
  "tmdb_id": "399300",
  "douban_id": "26673947",
  "title": "Iron Protector (2016)",
  "genres": [
    "Action"
  ],
  "country": "China",
  "version": [
    {
      "runtime": "93 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.6,
  "director": [
    {
      "id": "nm3612638",
      "name": "Yue Song"
    }
  ],
  "writer": [
    {
      "id": "nm3612638",
      "name": "Yue Song",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0151155",
      "name": "Michael Wai-Man Chan",
      "character": "(as Wai-Man Chan)"
    },
    {
      "id": "nm0628877",
      "name": "Collin Chou",
      "character": ""
    },
    {
      "id": "nm3140222",
      "name": "Baocheng Jiang",
      "character": ""
    },
    {
      "id": "nm6184066",
      "name": "Chang-Hai Li",
      "character": "Mr. Fu"
    },
    {
      "id": "nm3612638",
      "name": "Yue Song",
      "character": "Wu Lin"
    },
    {
      "id": "nm5148289",
      "name": "Yuzheng Wang",
      "character": "Mr. Li"
    },
    {
      "id": "nm1789084",
      "name": "Xing Yu",
      "character": "Jiang Li"
    },
    {
      "id": "nm9041623",
      "name": "Dongmei Xu",
      "character": ""
    },
    {
      "id": "nm6184063",
      "name": "Li YuFei",
      "character": "Li FeiFei"
    }
  ],
  "overview": "Wu-Lin is the successor of an ancient, once powerful Chinese clan, the \"Iron Feet.\" After the death of his master, Wu-Lin leaves his rural village for the City of Stone-Cold looking for his fellow apprentice Jiang Li. Along the way, he becomes the bodyguard of Fei-Fei, the daughter of Jia-Shan Li, the richest family in the city, and quickly gets drawn into a mob war in order to protect her.",
  "storyline": "\"The bodyguard\" is a mixture of action-packed Kung Fu film and super heroes. Wu-Lin, the protagonist chose the dark path to seek for revenge, and take the law in his own hands. Wu-Lin is not just a regular man from the rural village, he is also the Successor of an ancient, once powerful Chinese clan, the \"Iron Feet\". After the death of the clan master, Wu-Lin left the village and come to the City of Stone-cold to look for his fellow apprentice Jiang Li. He turn out become the bodyguard of Fei-Fei, the daugther of Jia-Shan Li, the richest family in the city. A clash of an unruly rich girl with a rugged and masculin bodyguard, sparks the flame of true love. Wu-Lin soon discovered that a group of mobster led by Jiang Li, attempts to kidnap Fei-Fei. To protect his love one, Wu-Lin forced to fight them alone. Brutally crushed, but Wu-Lin managed to survive, he took off his iron-shoes, and feel the adrenaline rush into his body again. Wu-Lin decided to face the group of mobsters once more, ...",
  "plot": "The film is set in the 2000s in a medium-sized Chinese city located in northeast China, close to the Russian border. An old, overweight man named Ding witnesses a man being stabbed by a gang, but when he is summoned by the police to identify the suspect, he hesitates and is unable to. The police research Ding's background and discover that he is a retired Central Security Bureau officer from Beijing, and they figure that he is suffering from dementia. Back at his home, Ding is frequently invited for supper by his land-lord, Park, an elderly lady who is attracted to him. Ding, in turn, frequently cares for a little girl next door named Cherry, whose father, Li, is an abusive gambler.\n\nWhen Li becomes heavily in debt because of his gambling, Choi, a Chinese person of Korean descent, who happens to be the leader of the aforementioned gang, forces Li to embark on a criminal assignment. Li is driven to a hotel and told to steal the shoulder-bag of a Russian gang leader. The alarm is raised but Li escapes with the bag after a protracted chase. However, upon being told that his debt isn't absolved, Li goes into hiding, taking the bag with him. Choi reacts by sending men to abduct Li's daughter. Meanwhile, the Russian gang leader feels angry and plans an attack against Choi's gang for violating their territory.\n\nChoi's gang members follow Cherry and assault Ding's home after she enters it, but to their dismay, Ding proves to be a remarkable fighter, and they are repelled. To avoid arrest, two of them are sent by Choi to hide in the countryside. The police, noticing that Li has disappeared, send Cherry to live with her aunt and uncle. However, within a short time, the aunt and uncle wish to eject her, and Ding agrees to provide for her living. Then one night, Cherry goes missing, and what is more, Li suddenly appears in Ding's home, bringing money in order to compensate Ding for his service. As Li exits the house, he is assaulted by Choi's gang and killed, and the shoulder-bag is taken back.\n\nDing, who has been plagued with guilt for years, ever since his grand-daughter went missing on a hiking trip, resolves to bring Cherry back using force. He visits the gambling house demanding Cherry's release, and when Choi's gang attempts to kill him, he overpowers around 20 of them including a skilled knife assassin. At that moment, some of the Russian gang members appear and start to kill the rest of Choi's men in an attempt to reclaim their stolen money. Seeing this, Choi escapes, but not before Ding wounds his leg. The Russians proceed to attack Ding, believing that he works for Choi, and Ding is forced to kill them. At the same time, the police, led by Park's son, chase after two leaders of the Russian gang, who die when they collide with a truck. Choi, who thinks he is safe, is approached by the two subordinates he sent into the countryside. They proceed to murder Choi and to rob him, having accepted a Russian bribe to do so.\n\nIn the aftermath of the incident, Ding's dementia worsens, and he is paralyzed by the loss of Cherry. The police make no attempt to blame Ding, recognizing that his actions were self-defense. Suddenly, Cherry returns, revealing that she simply ran off to live at a friend's house. Even as Ding forgets his family members, he remembers his relationship with Cherry, who cares for him well into his senescence. In a scene after the credits, the two countryside criminals accidentally encounter a group of drilling PLA military-police, who turn and give chase. After a short chase the remaining criminals are captured.",
  "synopsis": null
}