{
  "imdb_id": "tt4946660",
  "tmdb_id": "355440",
  "douban_id": null,
  "title": "Enishi: The Bride of Izumo (2015)",
  "genres": [
    "Drama"
  ],
  "country": "Japan",
  "version": [],
  "imdb_rating": 5.8,
  "director": [
    {
      "id": "nm4472398",
      "name": "Hiroshi Horiuchi"
    }
  ],
  "writer": [
    {
      "id": "nm4472398",
      "name": "Hiroshi Horiuchi",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm2703776",
      "name": "Toshiya Isaka",
      "character": "Mitsuru Omori"
    },
    {
      "id": "nm1665253",
      "name": "Tomiyuki Kunihiro",
      "character": "Shuichi Akikuni"
    },
    {
      "id": "nm0510486",
      "name": "Lily",
      "character": "Sumiko"
    },
    {
      "id": "nm3303927",
      "name": "Toshifumi Fujimoto",
      "character": "Hiroyuki Horiuchi"
    },
    {
      "id": "nm0624383",
      "name": "Toshie Negishi",
      "character": "Yoko Mishiro"
    },
    {
      "id": "nm0410917",
      "name": "Issei Ishida",
      "character": "Yuta Tsuno"
    },
    {
      "id": "nm0762965",
      "name": "Shirô Sano",
      "character": "Yasuo Soda"
    },
    {
      "id": "nm8510523",
      "name": "Eri Araki",
      "character": "Local women"
    },
    {
      "id": "nm1778466",
      "name": "Yûta Hiraoka",
      "character": "(as Yuta Hiraoka)"
    },
    {
      "id": "nm5859694",
      "name": "Yura Komuro",
      "character": ""
    },
    {
      "id": "nm2956617",
      "name": "Nozomi Sasaki",
      "character": ""
    }
  ],
  "overview": "Maki Iizuka (Nozomi Sasaki) works as an editor for a wedding magazine in Tokyo. She is set to marry Kazunori Nakamura (Yuta Hiraoka) next month, when her grandmother dies. Her grandmother was like a mom to Maki.  While Maki arranges items left by her grandmother, she discovers a box made from empress tree. The box contains a white bridal Kimono and marriage registration forms. The marriage registration forms are mostly empty, except for the name \"Soichi Akiguni\" filled into a blank. Maki becomes curious about Soichi Akiguni and decides to go to her hometown Izumo in Shimane Prefecture. There, she meets a young fisherman.",
  "storyline": "Maki Iizuka (Nozomi Sasaki) works as an editor for a wedding magazine in Tokyo. She is set to marry Kazunori Nakamura (Yuta Hiraoka) next month, when her grandmother dies. Her grandmother was like a mom to Maki. While Maki arranges items left by her grandmother, she discovers a box made from empress tree. The box contains a white bridal Kimono and marriage registration forms. The marriage registration forms are mostly empty, except for the name \"Soichi Akiguni\" filled into a blank. Maki becomes curious about Soichi Akiguni and decides to go to her hometown Izumo in Shimane Prefecture. There, she meets a young fisherman.",
  "plot": null,
  "synopsis": null
}