{
  "imdb_id": "tt4935334",
  "tmdb_id": "354251",
  "douban_id": null,
  "title": "Southbound (2015)",
  "genres": [
    "Fantasy",
    "Horror",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "89 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.9,
  "director": [
    {
      "id": "nm1671066",
      "name": "Roxanne Benjamin"
    },
    {
      "id": "nm1410159",
      "name": "David Bruckner"
    },
    {
      "id": "nm1767139",
      "name": "Patrick Horvath"
    },
    {
      "id": "nm4761826",
      "name": "Radio Silence"
    }
  ],
  "writer": [
    {
      "id": "nm1671066",
      "name": "Roxanne Benjamin",
      "description": null
    },
    {
      "id": "nm2366012",
      "name": "Matt Bettinelli-Olpin",
      "description": null
    },
    {
      "id": "nm1410159",
      "name": "David Bruckner",
      "description": null
    },
    {
      "id": "nm2226741",
      "name": "Susan Burke",
      "description": null
    },
    {
      "id": "nm1463759",
      "name": "Dallas Richard Hallam",
      "description": "as Dallas Hallam"
    },
    {
      "id": "nm1767139",
      "name": "Patrick Horvath",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2318753",
      "name": "Chad Villella",
      "character": "Mitch"
    },
    {
      "id": "nm2366012",
      "name": "Matt Bettinelli-Olpin",
      "character": "Jack"
    },
    {
      "id": "nm1869640",
      "name": "Kristina Pesic",
      "character": "Sutter"
    },
    {
      "id": "nm4211652",
      "name": "Fabianne Therese",
      "character": "Sadie"
    },
    {
      "id": "nm2093939",
      "name": "Nathalie Love",
      "character": "Kim"
    },
    {
      "id": "nm2000954",
      "name": "Hannah Marks",
      "character": "Ava"
    },
    {
      "id": "nm0332344",
      "name": "Dana Gould",
      "character": "Raymond Kensington"
    },
    {
      "id": "nm1768017",
      "name": "Anessa Ramsey",
      "character": "Bunny Kensington /              Phone Operator"
    },
    {
      "id": "nm2226741",
      "name": "Susan Burke",
      "character": "Betty"
    },
    {
      "id": "nm2092836",
      "name": "Davey Johnson",
      "character": "Dale"
    },
    {
      "id": "nm0955991",
      "name": "Mather Zickel",
      "character": "Lucas"
    },
    {
      "id": "nm1175356",
      "name": "Karla Droege",
      "character": "EMT"
    },
    {
      "id": "nm1679648",
      "name": "Zoe Cooper",
      "character": "Dispatch"
    },
    {
      "id": "nm0919482",
      "name": "Justin Welborn",
      "character": "Surgeon"
    },
    {
      "id": "nm0950379",
      "name": "David Yow",
      "character": "Danny"
    },
    {
      "id": "nm1997169",
      "name": "Tipper Newton",
      "character": "Jesse"
    },
    {
      "id": "nm1835614",
      "name": "Matt Peters",
      "character": "Al"
    },
    {
      "id": "nm1864017",
      "name": "Maria Olsen",
      "character": "Sandy"
    },
    {
      "id": "nm1368748",
      "name": "Tyler Tuione",
      "character": "Warren"
    },
    {
      "id": "nm0063571",
      "name": "Kate Beahan",
      "character": "Cait"
    },
    {
      "id": "nm1042741",
      "name": "Gerald Downey",
      "character": "Daryl"
    },
    {
      "id": "nm6076950",
      "name": "Hassie Harrison",
      "character": "Jem"
    },
    {
      "id": "nm7911068",
      "name": "Tallulah Mounce",
      "character": "Kathryn"
    },
    {
      "id": "nm4444836",
      "name": "Courtney Bandeko",
      "character": "Maid"
    },
    {
      "id": "nm3947697",
      "name": "Max Folkman",
      "character": "The Kensington Twins"
    },
    {
      "id": "nm3948169",
      "name": "Nick Folkman",
      "character": "The Kensington Twins"
    },
    {
      "id": "nm7914444",
      "name": "Karina Fontes",
      "character": "Alex"
    },
    {
      "id": "nm1671066",
      "name": "Roxanne Benjamin",
      "character": "Claire"
    },
    {
      "id": "nm0826987",
      "name": "Damion Stephens",
      "character": "Shane"
    },
    {
      "id": "nm0275244",
      "name": "Larry Fessenden",
      "character": "The D.J."
    },
    {
      "id": "nm3800493",
      "name": "Brad Miska",
      "character": "Diner Patron 1"
    },
    {
      "id": "nm2920119",
      "name": "B.J. Farmer",
      "character": "Diner Patron 2"
    },
    {
      "id": "nm2319034",
      "name": "Matt Unsworth",
      "character": "Diner Patron 3"
    },
    {
      "id": "nm7914445",
      "name": "John Walker",
      "character": "Biker"
    },
    {
      "id": "nm4757423",
      "name": "Mark Rossignol",
      "character": "Farmer"
    },
    {
      "id": "nm3364306",
      "name": "Thom Newell",
      "character": "Freez'n' Over Soda Jerk"
    },
    {
      "id": "nm1661123",
      "name": "Joe Spampinato",
      "character": "Tattoo Man"
    },
    {
      "id": "nm7590342",
      "name": "Art L. Cortez",
      "character": "Tattoo Patron 1"
    },
    {
      "id": "nm7914446",
      "name": "Christine Martin",
      "character": "Tattoo Patron 2"
    },
    {
      "id": "nm7914447",
      "name": "Omar Camacho",
      "character": "Lost Soul 1"
    },
    {
      "id": "nm7914448",
      "name": "Jaime Gehly",
      "character": "Lost Soul 2"
    },
    {
      "id": "nm4574532",
      "name": "Carlos Simental",
      "character": "Lost Soul 3"
    },
    {
      "id": "nm7914449",
      "name": "Owen Edinger",
      "character": "Lost Soul 4"
    },
    {
      "id": "nm7372321",
      "name": "Paul Thorn Bacon",
      "character": "Lost Soul 5"
    },
    {
      "id": "nm2126915",
      "name": "Orleans Miranda",
      "character": "Lost Soul 6"
    },
    {
      "id": "nm7914450",
      "name": "Raimund Jones",
      "character": "Lost Soul 7"
    },
    {
      "id": "nm6644455",
      "name": "Carlos Simental Jr.",
      "character": "Lost Soul"
    }
  ],
  "overview": "The film contains five stories set on desolate stretches of a desert highway. Two men on the run from their past, a band on its way to a gig, a man struggling to get home, a brother in search of his long-lost sister and a family on vacation are forced to confront their worst fears and darkest secrets in these interwoven tales.",
  "storyline": "On a desolate stretch of desert highway, weary travelers - two men on the run from their past, a band on their way to the next gig, a man struggling to get home, a brother in search of his long-lost sister and a family on vacation - are forced to confront their worst fears and darkest secrets in a series of interwoven tales of terror and remorse on the open road.",
  "plot": "Five interlocking tales of terror follow the fates of a group of weary travellers who confront their worst nightmares and darkest secrets on a desolate stretch of desert highway.\n\nThe film unfolds in an endless loop through purgatory that plays out chronologically over the course of one never-ending day.\nThe Way Out\nDirected by Radio SilenceWritten by Matt Bettinelli-Olpin\nMitch (Chad Villella) and Jack (Matt Bettinelli-Olpin) are on the run from mysterious floating creatures. Filled with remorse, Mitch looks at a photograph of his daughter Katherine as they drive down a nameless highway. Out in the desert, Mitch sees the creatures stalking them but does not tell Jack. In desperation, the pair pulls up to a run-down gas station. Inside, the men witness strange events as the creatures stalk them from afar. As Mitch and Jack attempt to escape, they pull up to the same gas station further down the road. Jack tries to leave as the creatures close in on the pair, and is killed. Mitch, believing that this is the fate he deserves, refuses to leave and instead follows the creatures to a nearby motel. He enters room 6255 and finds himself in a home that he finds familiar. Hearing the sound of disembodied laughter, Mitch follows the sounds and finds an apparition of his daughter Katherine, who begs for his help. As he moves closer to his daughter, however, she continues to run away. Mitch is trapped in the hallway of the house, tormented until death by the regret he was not able to help his daughter, while the creatures oversee his punishment.\nSiren\nDirected by Roxanne BenjaminWritten by Roxanne Benjamin &amp; Susan Burke\nAt the same motel are Sadie (Fabianne Therese), Ava (Hannah Marks), and Kim (Nathalie Love), traveling musicians in a band called The White Tights. Leaving the motel, their van's tire goes flat and they are forced to pull over. Stranded in the middle of the desert, they are picked up by a friendly, eccentric couple (Susan Burke and Davey Johnson). In the backseat of their car, Sadie sees a bear trap. The band is taken to the couple's house further down the road. Inside, the band is shown to their room; Sadie hears the woman mention their late friend Alex, but neither Ava nor Kim seem to notice. At dinner with the Kensingtons (Anessa Ramsey and Dana Gould), who live nearby with twin sons, they are served a meal of burnt meatloaf; Sadie, a vegetarian, politely declines. After dinner, Kim begins to blame Sadie for Alex's death, whereupon both Ava and Kim suddenly begin vomiting a black substance. Sadie gets help and the people in the house give Ava and Kim a white liquid medicine to drink. Sadie confronts her friends for their strange behavior and tries to persuade them to leave; they refuse, in a trance, and decide to stay the night at the house. That night, Sadie has a nightmare of Alex being killed in a car accident. Waking up in the middle of the night, Ava and Kim are gone. She finds them outside around a bonfire, participating in a strange cult ritual with the others in the house. Investigating from the brush nearby, Sadie's foot becomes caught in the bear trap seen in the couple's car the day before. Hearing the commotion, Ava and Kim give chase as Sadie escapes the trap and moves into a nearby shed; here, she is accosted by an apparition of Alex. Terrified, Sadie runs out into the road and hails an approaching car for help.\n\nIn the road behind her, one of the floating enigmatic creatures can be seen watching Sadie.\nThe Accident\nDirected by David BrucknerWritten by David Bruckner\nThe driver of the car, Lucas (Mather Zickel), talks to his wife Claire on the phone. Distracted, he does not see Sadie and she is hit by his car. Lucas exits the car and sees Sadie lying on the ground, critically injured, and calls 911; however, he is unable to tell the dispatcher where he is. A certified EMT gets on the line to help. The voices of the dispatcher and the EMT tell Lucas to drive Sadie to a nearby town, where he finds a medical facility. Entering the facility, he finds it completely abandoned; after searching for help, the dispatcher opts to guide Lucas through performing lifesaving surgery; a third voice, that of a doctor, gets on the line. The surgery eventually fails, and Sadie dies; the voices begin to laugh at Lucas, and he hangs up. He tries to escape the hospital but finds that all doors are locked. Shortly after, his phone rings again; the dispatchers persuade Lucas to talk about the incident. They agree that Lucas did not deserve this, and promptly tell him that he can leave. They mysteriously provide him with access to clean clothes and a new car, so it will be as though nothing happened. Lucas, hesitant to leave, is reassured that he will not need to worry about Sadie's death. He leaves the facility, enters the car, and drives away.\n\nAs he does, one of the floating creatures can be seen on the edge of the road overseeing the events.\nJailbreak\nDirected by Patrick HorvathWritten by Dallas Hallam &amp; Patrick Horvath\nSandy (Maria Olsen), the dispatcher on the phone with Lucas, watches him drive away from a nearby payphone. She hangs up, and walks into a bar named The Trap; across the parking lot, Danny (David Yow) gets out of his car. Inside, the bartender Al (Matt Peters) reprimands Sandy for leaving the door open. An argument ensues between the two and Warren (Tyler Tuione), another patron in the bar. Danny barges in with a shotgun, and demands to know the location of his sister. Warren, revealed to be a demon, cuts a gash into Danny's back; Danny blows off Warren's clawed hand with the shotgun. Danny takes Al hostage and forces him to drive to his sister's location: the back room of an ice cream parlor. There are demons Danny cannot see closing in on him as Al leads him through a secret entrance into a hidden room. Inside the room, he finds his sister Jesse (Tipper Newton) applying a tattoo to a patron's back. Danny tells Jesse that he has come to rescue her; she tells him that she is there by choice, and refuses to leave. Danny kills Al and kidnaps his sister, carrying her to his car. The locals, all demons, chase Danny as he drives away. Coming to a pause before a rough dead end, Jesse begs Danny not to go off the road; Danny, with the locals in pursuit, decides he has no other option. The car shakes violently as the pair drive out into the desert, and eventually breaks down. Jesse reveals that she killed their parents, and that she deserves to live in the town. The demons pull Danny out of the car; Jesse leaves him behind and drives away. She smiles and turns on the radio.\n\nAs she drives, one of the floating creatures can be seen in the moonlight overseeing Jesse's plight.\nThe Way In\nDirected by Radio SilenceWritten by Matt Bettinelli-Olpin\nJem (Hassie Harrison) exits the bathroom at Freez'n Over and sees Jessie walk back to the secret door. Jem notices her and then meets her parents, Cait and Daryl (Kate Beahan and Gerald Downey), to finish their food. Jem is going to college and this is their last weekend together before she leaves. As they leave Freez'n Over someone in the parking lot watches them get into their car and drive to their vacation house. They are about to have dinner when three masked men break into their vacation house. Daryl and Cait are caught while Jem hides. Daryl realizes that he knows who the men are and what they want, and begs them to spare his family. One of the men whispers to Cait what Daryl did and she is astonished at her husband's secret. The same man then says \"eye for an eye\" and kills her in front of her husband. Jem then attacks one of the men with a knife. Surprisingly, the other two tell her to leave. She runs away and they kill Daryl. As he is dying, the man in the mask holds up the photograph of Katherine that Mitch was looking at in The Way Out to be the last thing he ever sees. After Daryl is dead, they remove their masks and they are recognizable as Mitch and Jack. As they are leaving, Jem returns and fights back. She injures them badly but when she’s about to escape, Mitch accidentally kills her. The men feel guilty because they went too far, but it's too late. Outside, the ground to hell opens up as the enigmatic floating creatures from below come through the dead bodies to drag the intruders down to hell. The men try to escape but Shane is dragged down by the tentacles from hell. As the ground behind them continues to crumble, Mitch and Jack drive away.",
  "synopsis": null
}