{
  "imdb_id": "tt4900716",
  "tmdb_id": "374173",
  "douban_id": "26753451",
  "title": "Kapoor & Sons (2016)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "132 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.9,
  "director": [
    {
      "id": "nm2439708",
      "name": "Shakun Batra"
    }
  ],
  "writer": [
    {
      "id": "nm2439708",
      "name": "Shakun Batra",
      "description": null
    },
    {
      "id": "nm2567850",
      "name": "Ayesha DeVitre",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3289096",
      "name": "Sidharth Malhotra",
      "character": "Arjun Kapoor"
    },
    {
      "id": "nm2717565",
      "name": "Fawad Khan",
      "character": "Rahul Kapoor"
    },
    {
      "id": "nm1017633",
      "name": "Alia Bhatt",
      "character": "Tia Malik"
    },
    {
      "id": "nm0438494",
      "name": "Rajat Kapoor",
      "character": "Harsh Kapoor - Dad"
    },
    {
      "id": "nm0438501",
      "name": "Rishi Kapoor",
      "character": "Amarjeet Kapoor"
    },
    {
      "id": "nm0643349",
      "name": "Anahita Oberoi",
      "character": "Neetu Chachi"
    },
    {
      "id": "nm1796215",
      "name": "Vikram Kapadia",
      "character": "Shashi Chacha"
    },
    {
      "id": "nm7995970",
      "name": "Pradeep Pradhan",
      "character": "Kishore (Tia's Cook)"
    },
    {
      "id": "nm7922607",
      "name": "Fahim Shaikh",
      "character": "Boobly"
    },
    {
      "id": "nm6955746",
      "name": "Niti Apurva Patel",
      "character": "Selfie Nurse"
    },
    {
      "id": "nm7995971",
      "name": "Aalekh Kapoor",
      "character": "Sahil"
    },
    {
      "id": "nm5794928",
      "name": "Sukant Goel",
      "character": "Wasim"
    },
    {
      "id": "nm0665550",
      "name": "Ratna Pathak Shah",
      "character": "Sunita Kapoor - Mom"
    },
    {
      "id": "nm6630256",
      "name": "Aditya Gunavanthe",
      "character": "Delivery Boy       (as Gunavanthe Aditya)"
    },
    {
      "id": "nm8624077",
      "name": "Rahul Arjun Adsul",
      "character": "Bodybuilder"
    },
    {
      "id": "nm8624074",
      "name": "Carlos Augusto Tavares Canhisares",
      "character": "Rahul's Boyfriend"
    },
    {
      "id": "nm1689533",
      "name": "Anuradha Chandan",
      "character": "Anu"
    },
    {
      "id": "nm5474665",
      "name": "Aakriti Dobhal",
      "character": "Bunkoo"
    },
    {
      "id": "nm8624073",
      "name": "Elena Roxana Maria Fernandes",
      "character": "Rahul's Agent"
    },
    {
      "id": "nm8624070",
      "name": "Justin",
      "character": "Dharmendra"
    },
    {
      "id": "nm5603798",
      "name": "Arbaaz Kadwani",
      "character": "Sharic"
    },
    {
      "id": "nm8624072",
      "name": "Rupa Kamath",
      "character": "Timmy Masi"
    },
    {
      "id": "nm8624069",
      "name": "Sanjay Kanojiya",
      "character": "Toll Booth Attendant"
    },
    {
      "id": "nm8602109",
      "name": "Narendra Khatri",
      "character": "Bodybuilding competition announcer"
    },
    {
      "id": "nm3469020",
      "name": "Sonam Nair",
      "character": "Drunk girl in Kar Gayi Chul"
    },
    {
      "id": "nm8624065",
      "name": "Burjor Patel",
      "character": "Chowsky Kaka"
    },
    {
      "id": "nm8624075",
      "name": "Olena Paul",
      "character": "Friends's Mother"
    },
    {
      "id": "nm8624064",
      "name": "Pradeep",
      "character": "Kishore"
    },
    {
      "id": "nm8624078",
      "name": "Raju",
      "character": "Geishu (Dog)"
    },
    {
      "id": "nm8624076",
      "name": "Promod Rampal",
      "character": "Bald Man"
    },
    {
      "id": "nm8624066",
      "name": "Chandrajit Ranavde",
      "character": "Broker Makhija"
    },
    {
      "id": "nm8624062",
      "name": "Faheem Shaikh",
      "character": "Boobly"
    },
    {
      "id": "nm8023097",
      "name": "Muskan Khanna Sharan",
      "character": "Preet"
    },
    {
      "id": "nm8479983",
      "name": "Arya Sharma",
      "character": "Zoey"
    },
    {
      "id": "nm4433984",
      "name": "Amarjeet Singh",
      "character": "Plumber"
    },
    {
      "id": "nm8624067",
      "name": "Amarjeet Singh",
      "character": "Plumber"
    },
    {
      "id": "nm8624071",
      "name": "Ram Singh",
      "character": "Mucchad Paanwala"
    },
    {
      "id": "nm4535968",
      "name": "Edward Sonnenblick",
      "character": "Dan"
    },
    {
      "id": "nm8624068",
      "name": "Sulekshna",
      "character": "Nurse"
    },
    {
      "id": "nm8428129",
      "name": "Gary John Tantony",
      "character": "Friend's Father"
    }
  ],
  "overview": "A story revolving around a dysfunctional family of two brothers who visit their parents and grandfather in Coonoor, and end up falling for the same woman.",
  "storyline": "A story revolving around a dysfunctional family of 2 brothers who visit their family and discover that their parents marriage is on the verge of collapse,the family is undergoing a financial crunch and much more as the drama unfolds.",
  "plot": "Estranged brothers Arjun (Sidharth Malhotra) and Rahul Kapoor (Fawad Khan) are compelled to return to their childhood home in Coonoor when their 90-year-old grandfather Amarjeet (Rishi Kapoor) suffers a heart attack. Rahul is a successful writer who appears to be the most mature in the family. Meanwhile, Arjun struggles to get his books published, resorting to working part-time as a bartender to make ends meet, while writing in his spare time. Their parents, Harsh (Rajat Kapoor) and Sunita Kapoor (Ratna Pathak Shah) favor Rahul more for being successful, which upsets Arjun. While the brothers struggle to get along, their parents also grapple with their troubled marriage. Harsh is discouraging of Sunita's wish to open a catering business and Harsh's past extra-marital affair is a sore spot in their relationship. Amarjeet reveals that his last wish is to take a family photo titled \"Kapoor &amp; Sons, since 1921\".\n\nAt a party, Arjun meets Tia Malik (Alia Bhatt), and the two hit it off. Rahul and Tia also meet, and the two go out for dinner. However, Rahul is shocked when she spontaneously kisses him. Tia reveals to Arjun that she lost her parents at the age of thirteen and lives alone. Arjun too reveals that Rahul's bestseller novel's idea was similar to his but he never confronted his brother so as to not break the family apart. Tia tells her friend that she loves Arjun but regrets unnecessarily involving herself with Rahul.\n\nThe Kapoor family throws a party to celebrate Amarjeet's birthday. Arjun discovers that Tia and Rahul know each other and fears that Rahul and Tia have something between them, but Rahul clarifies that he is already in a committed relationship in London. Problems arise when the family finds out that Harsh invited Anu, the woman he had an affair with. A family argument ensues, ending the party. Harsh and Sunita later reminisce on how happy they were. Harsh apologizes for losing all their money.\n\nThe Kapoor family tries to fulfill Amarjeet's wish to take a family photo but are unsuccessful when secrets are revealed. Rahul finds out that his father was lying about having ended the affair, while Sunita discovers that the relationship Rahul has in London is actually with another man. Tia tells Arjun what happened between her and Rahul, calling it a mistake. Arjun finds out Rahul has been reading his script, and confronts him about stealing his first story. A shaken Sunita then reveals to Arjun that she was the one who gave Rahul his story, thinking Arjun had no interest in writing. Amidst all this, Harsh dies in a car accident. Rahul comes out as gay to Arjun and the two leave for London and New Jersey respectively.\n\nAfter four months, the duo receive a video message from Amarjeet, in which he requests them to come back, as he is feeling alone. Sunita comes to terms with Rahul's homosexuality, the misunderstanding between Arjun and Tia is cleared and they get back together. The family finally takes the family photo Amarjeet wanted, where they place a cutout of Harsh in his memory.",
  "synopsis": "Rahul and Arjun have returned back home- to Coonoor, to be with their grandfather in (what they think will be) his last few days, after he has a heart attack at the age of 90. Rahul, for his age, seems to have built a pretty good life for himself; a good looking man, doing very well professionally, living in a swanky apartment in London, and also planning to pursue architecture along with writing. On the other hand is his younger brother- Arjun. Arjun is also an aspiring writer, living in New Jersey, clearly struggling to make ends meet.These two brothers arent exactly the inseparable brother duo we are used to seeing in our movies. The awkwardness and tension between them is apparent from the word go. Their arrival in India quickly unfolds their individual relations with their parents as well. Rahul is clearly the perfect one, loved by all, Arjun seems like the neglected one who according to the family is too immature/irresponsible to take decisions. The brothers arrive in India to find that their little family isnt as perfect as they had imagined. Their parents no longer sleep in the same room and their father seems to have developed a relationship with a long time family friend, which is making their mom uncomfortable. Furthermore, the family is going through a severe financial crunch as well. The brothers have returned to the same old home, but with totally different dynamics. Their parents get into quarrels over their financial situation, ending marriage, and other bad decisions. The sons on the other hand have their own battles with the parents, and with each other.Arjun has an old friend in Coonoor who helps him get out of the steaming pot environment in his house. One night, the friend takes Arjun out for a party to a friends place, which is where he meets Tia. Tia is a, attractive, flamboyant, young girl who Arjuninstantly strikes a chord with.Rahul meets Tia as well, regarding a business deal they are trying to strike, and even here, there is a certain equation right from the word go. We see the onset of another point of tension between the brothers- a love triangle.As the story unfolds, we realise that all the characters have had their fair share of mistakes and bad decisions. The family members who seem perfect arent necessarily so, and the ones who seem imperfect have had good reasons for their actions. Are the brothers able to bring back normalcy to their house? Are they able to resolve their own issues? What happens to the Tia-Arjun-Rahul trio? Is the grandfather able to get the perfect family photo hes been striving for? The answer to all these questions and many more forms the crux of the story."
}