{
  "imdb_id": "tt4959436",
  "tmdb_id": "381749",
  "douban_id": null,
  "title": "Porn to Be Free (2016)",
  "genres": [
    "Documentary"
  ],
  "country": "Italy",
  "version": [
    {
      "runtime": "78 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm0025251",
      "name": "Carmine Amoroso"
    }
  ],
  "writer": [
    {
      "id": "nm0025251",
      "name": "Carmine Amoroso",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm0771322",
      "name": "Riccardo Schicchi",
      "character": "Himself"
    },
    {
      "id": "nm0105808",
      "name": "Lasse Braun",
      "character": "Himself"
    },
    {
      "id": "nm0580499",
      "name": "Ilona Staller",
      "character": "Herself"
    },
    {
      "id": "nm0539652",
      "name": "Judith Malina",
      "character": "Herself"
    },
    {
      "id": "nm0303666",
      "name": "Giuliana Gamba",
      "character": "Herself"
    },
    {
      "id": "nm0712407",
      "name": "Lidia Ravera",
      "character": "Herself"
    },
    {
      "id": "nm1183127",
      "name": "Marco Pannella",
      "character": "Himself"
    },
    {
      "id": "nm7534968",
      "name": "Helena Velena",
      "character": "Herself"
    },
    {
      "id": "nm0321397",
      "name": "Marco Giusti",
      "character": "Himself"
    },
    {
      "id": "nm0094717",
      "name": "Achille Bonito Oliva",
      "character": "Himself"
    }
  ],
  "overview": "Porno &amp; libertà is a film documentary about the generation who fought against puritanism and censorship to defend freedom of speech and sexual freedom. From Italy, Denmark and France through to California, the film follows a group of rebels who started a battle against censorship through pornography. Together they shook the church, the politics and the institutions. Through uncensored exclusive footage and archive material, the film explores the story and the fights of a group of pioneers.",
  "storyline": "Porno & libertà is a film documentary about the generation who fought against puritanism and censorship to defend freedom of speech and sexual freedom. From Italy, Denmark and France through to California, the film follows a group of rebels who started a battle against censorship through pornography. Together they shook the church, the politics and the institutions. Through uncensored exclusive footage and archive material, the film explores the story and the fights of a group of pioneers: from film director and porn pioneer, Lasse Braun, to Riccardo Schicchi, master of transgression such as the election of porn star Cicciolina in the Italian Parliament. The documentary features numerous other protagonists such as feminist porn director Giuliana Gamba, author Lidia Ravera and a short animation by Charlie Hebdo's veteran Siné. Through their utopia and shocking dreams, they made the world a freer place and paved the way for forward-thinking debates today, such as neo-feminism, or the ...",
  "plot": null,
  "synopsis": null
}