{
  "imdb_id": "tt4993964",
  "tmdb_id": "382598",
  "douban_id": null,
  "title": "Full Speed (2016)",
  "genres": [
    "Action",
    "Comedy"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "91 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm1318381",
      "name": "Nicolas Benamou"
    }
  ],
  "writer": [
    {
      "id": "nm1318381",
      "name": "Nicolas Benamou",
      "description": null
    },
    {
      "id": "nm0418621",
      "name": "Frédéric Jardin",
      "description": null
    },
    {
      "id": "nm0736676",
      "name": "Fabrice Roger-Lacan",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0305296",
      "name": "José Garcia",
      "character": "Tom"
    },
    {
      "id": "nm0244707",
      "name": "André Dussollier",
      "character": "Ben"
    },
    {
      "id": "nm2404839",
      "name": "Caroline Vigneaux",
      "character": "Julia"
    },
    {
      "id": "nm5638922",
      "name": "Charlotte Gabris",
      "character": "Melody"
    },
    {
      "id": "nm0220798",
      "name": "Vincent Desagnat",
      "character": "Adjudant-chef Besauce"
    },
    {
      "id": "nm7561700",
      "name": "Josephine Callies",
      "character": "Lison"
    },
    {
      "id": "nm5493356",
      "name": "Stylane Lecaille",
      "character": "Noé"
    },
    {
      "id": "nm1569942",
      "name": "Jérôme Commandeur",
      "character": "Danieli"
    },
    {
      "id": "nm1589794",
      "name": "Ingrid Donnadieu",
      "character": "Gendarme Vignali"
    },
    {
      "id": "nm0396298",
      "name": "Vladimir Houbart",
      "character": "Jacky"
    },
    {
      "id": "nm6889700",
      "name": "Harrison Arevalo",
      "character": "Juan"
    },
    {
      "id": "nm0490734",
      "name": "Philippe Laudenbach",
      "character": "Monsieur Château-Chantelle"
    },
    {
      "id": "nm0182389",
      "name": "Béatrice Costantini",
      "character": "Madame Château-Chantelle"
    },
    {
      "id": "nm5189017",
      "name": "Jérôme Lenôtre",
      "character": "Le père chez le concessionaire"
    },
    {
      "id": "nm0243150",
      "name": "Sissi Duparc",
      "character": "La mère chez le concessionnaire"
    },
    {
      "id": "nm3456221",
      "name": "Mathieu Barbet",
      "character": "Le Planton"
    },
    {
      "id": "nm7561701",
      "name": "Bernard Cherqui",
      "character": "Gendarme Ping-Pong"
    },
    {
      "id": "nm0377388",
      "name": "Christian Hening",
      "character": "Super gendarme       (as Christian Hening de Franceschi)"
    },
    {
      "id": "nm9327657",
      "name": "Anne Ferrier",
      "character": "Medusa       (voice)"
    },
    {
      "id": "nm2971966",
      "name": "Hortense Gélinet",
      "character": "Journaliste BFMTV"
    },
    {
      "id": "nm4451134",
      "name": "Rachid M'Barki",
      "character": "Journaliste BFMTV plateau"
    },
    {
      "id": "nm0584800",
      "name": "Béatrice Michel",
      "character": "La clocharde"
    },
    {
      "id": "nm9327658",
      "name": "Louiza Arriouache",
      "character": "La gitane"
    },
    {
      "id": "nm1566456",
      "name": "Florence Foresti",
      "character": "Capitaine Peton"
    },
    {
      "id": "nm3918706",
      "name": "Amin Harfouch",
      "character": "Gitan"
    }
  ],
  "overview": null,
  "storyline": "A family together with their grandpa go on a vacation, when their new car won't stop and it nearly escapes crashing into a hundred cars.",
  "plot": "Angélique (Audrey Tautou) purchases a single pink rose at a flower shop to be delivered to her lover, Dr. Loïc Le Garrec (Samuel Le Bihan). Angélique is a successful art student. In between creating her art projects, she works part-time at a cafe and house sits for a wealthy vacationing family. Angélique's friend David (Clément Sibony) disapproves of Angélique's affair with Loïc, who is married, but Angélique insists that Loïc will leave his wife for her.\n\nWhen Loïc's wife, Rachel (Isabelle Carré), has a miscarriage, the pair separate and Angélique prepares to leave with Loïc on a romantic getaway to Florence, Italy. However, Loïc doesn't meet Angélique at the airport, having chosen to mend things with his wife. This throws Angélique into a self-destructive cycle of clinical depression, losing her job and scholarship. While watching the news one night, she learns that Loïc has been arrested for assaulting one of his patients, Sonia Jasmin (Nathalie Krebs). She goes to Sonia's house to convince her to drop the charges, and in the ensuing scuffle, Sonia has a heart attack and dies. Angélique steals from the house to make it look like a robbery. Angélique thinks this will win Loïc back, but instead he's arrested for Sonia's murder, and embraces his wife as he is dragged away. Angélique returns home, turns on the gas and lies down on the floor.\n\nAt this point the film rewinds to the opening scene when Angélique bought the pink rose. This time the film follows the delivery boy and the subsequent events play out from Loïc's viewpoint.\n\nLoïc receives the pink rose and assumes that his wife sent it to him. It is revealed that Loïc barely knows Angélique, and they cross paths only because Angélique is house sitting Loïc and Rachel's neighbor's house. Loïc receives Angélique's gifts and messages, but doesn't know who sent them. It is revealed that Rachel's miscarriage was caused by \"someone\" running her down with a moped; earlier in the film, Angélique is shown after an \"accident\" which ruined her friend's moped and injured her arm. Loïc comes to believe that his stalker is Sonia; he physically attacks her and she presses charges for assault. After she dies of a heart attack, Loïc is arrested as the prime suspect for her murder. At his arrest, Rachel tells the police that he was with her on the night of the death, which clears him of all charges.\n\nThat night, Loïc sees an ambulance pull up to his neighbor's house. Angélique has just tried to commit suicide, and as a doctor, Loïc performs mouth-to-mouth resuscitation which causes her to regain consciousness. Now aware of Angélique, he considers the possibility that she is his stalker. Loïc explores the house that Angélique was house-sitting, and finds a life-sized garbage mosaic of himself. Angélique and Loïc have a final confrontation, where he declares that they never had nor will ever have a relationship, and Angélique strikes him over the head with a brass figurine. She is arrested, diagnosed with erotomania and remanded to a mental institution. Rachel stands by her husband while he recovers from his injuries, with a scene showing the couple in a house filled with their children as Loïc hobbles around on a cane.\n\nFive years later, Angélique is released from the mental institution. Her therapist praises her progress and tells her, \"If you keep taking your medication, you will be fine.\" However, when the cleaning man is clearing Angélique's room, he discovers her pills have been glued to the wall behind the wardrobe in a mosaic of Loïc, thus showing that Angélique has never taken her medication. The film then ends with a quotation from a real erotomaniac, \"Though my love is insane, my reason relieves the pain of the heart, telling me to be patient and not lose hope,\" displayed on the screen.",
  "synopsis": null
}