{
  "imdb_id": "tt4949088",
  "tmdb_id": "361654",
  "douban_id": null,
  "title": "Thirst (2015)",
  "genres": [
    "Drama"
  ],
  "country": "Bulgaria",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.9,
  "director": [
    {
      "id": "nm0875159",
      "name": "Svetla Tsotsorkova"
    }
  ],
  "writer": [
    {
      "id": "nm0654042",
      "name": "Svetoslav Ovtcharov",
      "description": "written by"
    },
    {
      "id": "nm0875159",
      "name": "Svetla Tsotsorkova",
      "description": "written by"
    },
    {
      "id": "nm0890505",
      "name": "Ventsislav Vasilev",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm7532240",
      "name": "Monika Naydenova",
      "character": "The Girl"
    },
    {
      "id": "nm7021607",
      "name": "Alexander Benev",
      "character": "The Boy"
    },
    {
      "id": "nm0945901",
      "name": "Svetlana Yancheva",
      "character": "The Mother of The Boy       (as Svetla Yancheva)"
    },
    {
      "id": "nm0160666",
      "name": "Ivaylo Hristov",
      "character": "The Father of The Boy"
    },
    {
      "id": "nm0586152",
      "name": "Vassil Mihajlov",
      "character": "The Father of The Girl"
    },
    {
      "id": "nm0561415",
      "name": "Stefan Mavrodiyev",
      "character": "The Shopkeeper"
    },
    {
      "id": "nm1091878",
      "name": "Ivan Barnev",
      "character": "The mini bus driver"
    }
  ],
  "overview": "A couple and their teenage son eke out a living on a hilltop, doing the laundry for local hotels, despite the intermittent water supply. Their simple life is overturned by the arrival of a father-and-daughter team of diviner and well-digger, who promise to bring an end to this precarious existence by finding a source on their arid hill. But ultimately, these newcomers quench a thirst far greater than than the simple need for water.",
  "storyline": "The Mother, the Father and their 16-year-old son live on a hill, at the end of a village. They wash hotel sheets for a living. The water supply is inconsistent and they often find themselves without any water. A couple of drillers - a father and his daughter - arrive, in order to solve the water supply problem. The family's harmonious world shatters into pieces. Everyone loves and hates everyone else. The thirst for love is so great that only death could quench it.",
  "plot": "Sang-hyun (Song Kang-ho) is a Catholic priest who volunteers at the hospital, providing ministry to the patients. He is well respected for his unwavering faith and dedicated service, but he secretly suffers from feelings of doubt and sadness. Sang-hyun volunteers to participate in an experiment to find a vaccine for the deadly Emmanuel Virus (EV). Although the experiment fails, and Sang-hyun is infected with the seemingly fatal disease, he makes a complete and rapid recovery after receiving a blood transfusion.\n\nNews of his marvelous recovery quickly spreads among the devout parishioners of Sang-hyun’s congregation, and they begin to believe that he has a miraculous gift for healing. Soon, thousands more flock to Sang-Hyun’s services. Among the new churchgoers are Kang-woo (Shin Ha-kyun), Sang-hyun’s childhood friend, and his family. Kang-woo invites his old friend to join the weekly mahjong night at his house, and there, Sang-hyun finds himself attracted to Kang-woo’s wife, Tae-ju (Kim Ok-bin). Sang-hyun later relapses into his illness and wakes in dire need of shelter from the sunlight, having become a vampire.\n\nAt first, Sang-hyun feels a new-found vigor but soon he is aghast to find himself drinking blood from a comatose patient. After attempting to kill himself, Sang-hyun finds himself irresistibly drawn to human blood. To make matters worse, the symptoms of EV return and only seem to go away when he has drunk blood. Desperately trying to avoid committing a murder, Sang-hyun resorts to stealing blood transfusion packs from the hospital.\n\nTae-ju, who lives with her ill husband and overprotective mother-in-law, Lady Ra (Kim Hae-sook), leads a dreary life. She is drawn to Sang-hyun and his odd new physicality, including his inability to resist his desires. The two begin an affair, but when Tae-ju discovers the truth about Sang-hyun, she retreats in fear. When Sang-hyun pleads with her to run away with him, she turns him down, suggesting that they kill her husband instead.\n\nWhen Sang-hyun's superior at the monastery requests some vampire blood so that his eyes may heal and he may see the world before dying, Sang-hyun flees his position at the monastery. He moves into Lady Ra's house so that he may secretly be with Tae-ju. Sang-hyun notices bruises on Tae-ju and assumes her husband is the cause, a suspicion she sheepishly confirms. Sang-hyun decides to kill Kang-woo during a fishing trip with the couple. He pulls Kang-woo into the water and claims that he placed the body inside a cabinet in a house at the bottom of the lake, putting a rock on the body to keep it from floating to the surface.\n\nA police investigation ensues. Lady Ra drinks herself into shock after her son's death, sinking into a completely paralyzed state. In the meantime, Sang-hyun and Tae-ju are haunted by terrifying visions of Kang-woo's bloated corpse. When Tae-ju lets slip that Kang-woo never abused her, Sang-hyun is enraged because he only killed Kang-woo to protect her. Teary-eyed, she asks Sang-hyun to kill her and let her return to her husband. He obliges by snapping her neck, but after feeding on her blood, decides he does not want to be alone forever and feeds her corpse his own blood. She awakens as a vampire. Lady Ra, knocked to the floor by a seizure, witnesses everything.\n\nTae-ju quickly shows herself to be a remorseless monster, killing indiscriminately to feed, while Sang-hyun acts more conservatively, not killing unless he has to. Their conflicting ethics result in a chase across the rooftops and a short battle. Some time later, Lady Ra manages to communicate to Kang-woo's friends that Sang-hyun and Tae-ju killed her son. Tae-ju quickly disposes of two of the friends, and Sang-hyun appears to eliminate the third. Realizing the gravity of the situation, Sang-hyun tells Tae-ju that they must flee or be caught. Before leaving with her, he makes a visit to the camp of worshipers who consider him the miracle EV survivor. He makes it seem like he tried to rape a girl, leading the campers to chase him away, no longer idolizing him.\n\nSang-hyun then places Lady Ra in his car, and with Tae-ju, drives into the night. Back at the house, the third friend (having apparently been hidden by Sang-hyun) escapes. Upon waking from a nap in the car, Tae-ju realizes that Sang-hyun has driven to a desolate field with no cover from the imminent dawn. Realizing his plan to have them both burn when dawn breaks, Tae-ju tries to hide but Sang-hyun foils her every attempt. Resigning herself to her fate, she joins him on the car hood, and both are burnt to ash by the sun, as Lady Ra watches from the backseat of the car.",
  "synopsis": null
}