{
  "imdb_id": "tt4974230",
  "tmdb_id": "369001",
  "douban_id": null,
  "title": "Urumbukal Urangarilla (2015)",
  "genres": [
    "Comedy",
    "Crime",
    "Drama",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "138 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm4423404",
      "name": "Jiju Asokan"
    }
  ],
  "writer": [
    {
      "id": "nm4423404",
      "name": "Jiju Asokan",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4265894",
      "name": "Vinay Forrt",
      "character": "Manoj"
    },
    {
      "id": "nm5584853",
      "name": "Chemban Vinod Jose",
      "character": "Benny"
    },
    {
      "id": "nm4028151",
      "name": "Aju Varghese",
      "character": "Babutten"
    },
    {
      "id": "nm0409204",
      "name": "Innocent",
      "character": "Madhavettan       (as Innocent Vareed Thekkethala)"
    },
    {
      "id": "nm3130066",
      "name": "Ananya",
      "character": "Sheela"
    },
    {
      "id": "nm3397660",
      "name": "Sudheer Karamana",
      "character": "Keluvasan"
    },
    {
      "id": "nm6660756",
      "name": "Santhosh Keezhattoor",
      "character": "Davies"
    },
    {
      "id": "nm1722996",
      "name": "Thezni Khan",
      "character": "Rosely"
    },
    {
      "id": "nm6845864",
      "name": "Pradeep Kottayam",
      "character": "Sulu's husband"
    },
    {
      "id": "nm0889150",
      "name": "Vanitha Krishnachandran",
      "character": "Ratha"
    },
    {
      "id": "nm7548765",
      "name": "Janaki Krishnan",
      "character": "Deepa"
    },
    {
      "id": "nm1830213",
      "name": "Musthafa",
      "character": "Balu"
    },
    {
      "id": "nm1797498",
      "name": "Vettukili Prakash",
      "character": "Thief"
    },
    {
      "id": "nm3170229",
      "name": "Lakshmi Priya",
      "character": "Anitha"
    },
    {
      "id": "nm2573453",
      "name": "Sreejith Ravi",
      "character": "Chooden Rajappan"
    },
    {
      "id": "nm3175230",
      "name": "Kalabhavan Shajohn",
      "character": "Karlose"
    },
    {
      "id": "nm4584689",
      "name": "Sunil Sukhada",
      "character": ""
    },
    {
      "id": "nm8223791",
      "name": "Manju Sunichen",
      "character": "Rajappan's Wife"
    }
  ],
  "overview": "Movie is about a retired master thief Keluvashan and his dearest disciple Kallan Benny. Once a young man came to see Keluvashan and expressed his wish to study the tricks and secrets of theft.",
  "storyline": "The story of the film is based on thieves. A young man named Manoj joins with a theft guru Kelu Ashan, to learn the way of art. However, Kelu Ashan is old and retired so he introduces him to one of his students Benny (Chemban Vinod Jose) to be trained in the art of robbery. Benny trains him well. After Benny was caught, he meets Kelu Ashan again who teaches him the 'Science of Theft'. Manoj eventually gets caught. He is sent to jail, where he meets Benny. The pith of the story starts to unravel then. Manoj was actually in search of a thief, named Carlos who have murdered his parents when he was abroad. His intention to become a thief and to get in to jail, was with this objective. He finds the thief who have murdered his parents. He then hatches a plan and traps the thief and kills him viciously by slathering sugar solution all over his body and scattering ants. Later the young man starts an old age home and his co-thieves are shown living happily.",
  "plot": "The story of the film is based on thieves. A young man named Manoj ([Vinay Fort]) joins with a theft guru Kelu Ashan ([Sudheer Karamana]), to learn the way of art. However, Kelu Ashan is old and retired so he introduces him to one of his students Benny ([Chemban Vinod]) to be trained in the art of robbery. Benny trains him well. After Benny was caught, he meets Kelu ashan again who teaches him the 'Science of Theft'. Manoj eventually gets caught. He is sent to jail, where he meets Benny. The pith of the story starts to unravel then. Manoj was actually in search of a thief, Named Carlos who have murdered his parents when he was abroad. His intention to become a thief and to get in to jail(as he learned Carlos was also in Jail, from Kelu ashan), was with this objective. He finds the thief who have murdered his parents. He then hatches a plan and traps the thief and kills him viciously by slathering sugar solution all over his body and scattering ants. Later the young man starts an old age home and his co-thieves are shown living happily.",
  "synopsis": null
}