{
  "imdb_id": "tt5082014",
  "tmdb_id": "372297",
  "douban_id": null,
  "title": "Charlie (2015)",
  "genres": [
    "Drama",
    "Musical",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "130 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.7,
  "director": [
    {
      "id": "nm3964043",
      "name": "Martin Prakkat"
    }
  ],
  "writer": [
    {
      "id": "nm3964043",
      "name": "Martin Prakkat",
      "description": "screenplay"
    },
    {
      "id": "nm2634191",
      "name": "Unni R.",
      "description": "screenplay"
    },
    {
      "id": "nm2634191",
      "name": "Unni R.",
      "description": "dialogue"
    },
    {
      "id": "nm2634191",
      "name": "Unni R.",
      "description": "story"
    }
  ],
  "cast": [
    {
      "id": "nm4921260",
      "name": "Dulquer Salmaan",
      "character": "Charlie"
    },
    {
      "id": "nm2527173",
      "name": "Parvathy Thiruvothu",
      "character": "Tessa       (as Parvathi Menon)"
    },
    {
      "id": "nm5732706",
      "name": "Aparna Gopinath",
      "character": "Dr. Kani"
    },
    {
      "id": "nm0893449",
      "name": "Nedumudi Venu",
      "character": "Kunjappan"
    },
    {
      "id": "nm5732707",
      "name": "Tovino Thomas",
      "character": "Georgy"
    },
    {
      "id": "nm0663967",
      "name": "Seetha",
      "character": "Tessa's Mother"
    },
    {
      "id": "nm6229968",
      "name": "Soubin Shahir",
      "character": "'Kallan' Suni"
    },
    {
      "id": "nm0433884",
      "name": "K.P.A.C. Lalitha",
      "character": "Rahel"
    },
    {
      "id": "nm5584853",
      "name": "Chemban Vinod Jose",
      "character": "Mathai"
    },
    {
      "id": "nm1427780",
      "name": "Kalpana",
      "character": "Mariyam"
    },
    {
      "id": "nm1548005",
      "name": "P. Balachandran",
      "character": "Usman"
    },
    {
      "id": "nm6788941",
      "name": "Shereej K. Basheer",
      "character": "Auto-rickshaw Driver"
    },
    {
      "id": "nm5663832",
      "name": "Molly Kannamaly",
      "character": "Card Player"
    },
    {
      "id": "nm6697626",
      "name": "Neeraj Madhav",
      "character": "Ansari"
    },
    {
      "id": "nm0558593",
      "name": "Joy Mathew",
      "character": "Ummer"
    },
    {
      "id": "nm6428707",
      "name": "Minon",
      "character": "Room Boy"
    },
    {
      "id": "nm0621937",
      "name": "Nassar",
      "character": "Street Magician ('Cameo')       (as Nasser)"
    },
    {
      "id": "nm4915723",
      "name": "Omana Ouseph",
      "character": "Nun"
    },
    {
      "id": "nm1001625",
      "name": "Renji Panicker",
      "character": "Dr. Panicker (Cameo)"
    },
    {
      "id": "nm3542089",
      "name": "Ramesh Pisharody",
      "character": "Sojan ('Cameo')"
    },
    {
      "id": "nm8808451",
      "name": "Kannan Sagar",
      "character": "Kunjappan's Friend"
    },
    {
      "id": "nm4331023",
      "name": "Rajesh Sharma",
      "character": "Seban"
    },
    {
      "id": "nm4584689",
      "name": "Sunil Sukhada",
      "character": ""
    },
    {
      "id": "nm4538068",
      "name": "Surjith",
      "character": "'Aadu' Abootty"
    },
    {
      "id": "nm3646658",
      "name": "Jayaraj Warrier",
      "character": "'Vaattu' Jose ('Cameo')"
    }
  ],
  "overview": "A young, nonconforming woman named Tessa gets entangled in a cat-and-mouse chase in the by-lanes of Kerala, hunting for a mysterious artist who previously lived in her apartment.",
  "storyline": "Charlie is a young guy who always loves traveling and believes in enjoying life to the fullest. He considers life to be a celebration and tries to bring happiness in the lives of people around him. Tessa is a graphic artist with a sensitive outlook towards life. The film depicts the love story of Charlie and Tessa, and how their love influences the lives of the people around them.",
  "plot": "Natalie Cook (Cameron Diaz), Dylan Sanders (Drew Barrymore) and Alex Nuncy (Lucy Liu) are the \"Angels\", three talented, tough, attractive women who work as private investigators together for an unseen millionaire named Charlie (voiced by John Forsythe). Charlie uses a speaker in his offices to communicate with the Angels, and his assistant Bosley (Bill Murray) works with them directly when needed.\n\nCharlie assigns the Angels to find Eric Knox (Sam Rockwell), a software genius who created a revolutionary voice-recognition system and heads his own company, Knox Enterprises. Knox is believed to have been kidnapped by Roger Corwin (Tim Curry), who runs a communications-satellite company called Redstar. The Angels infiltrate a party held by Corwin and spot the Creepy Thin Man (Crispin Glover) who was seen on the surveillance videos during Knox's kidnapping. They chase and fight the Creepy Thin Man.\n\nAfter the Angels reunite Knox with his business partner Vivian Wood (Kelly Lynch), Charlie explains that they must determine whether the Creepy Thin Man has stolen Knox's voice-recognition software. The Angels infiltrate Redstar headquarters, fool the security system, and plant a device in the central computer that will enable them to explore it remotely. They retire for the night after giving Bosley the laptop computer that communicates with the Redstar computer. Dylan takes up Knox's offer to spend the night with him, end up in making love but he betrays her later that night, explaining that he faked the kidnapping with help from Vivian and the Creepy Thin Man. He has kidnapped Bosley, and, with access to Redstar's central computer, he intends to use his voice software with the Redstar satellite network to find and kill Charlie, who he believes had killed his father in the Vietnam War.\n\nKnox shoots at Dylan, seemingly killing her, but she escapes unharmed. Natalie and Alex are also attacked, and Corwin is murdered by the Creepy Thin Man. When the Angels regroup together, all uninjured, Charlie's offices are blown up. A radio receiver survives in the rubble, and Natalie deduces Bosley's location as he speaks to the Angels using a radio transmitter implanted in his teeth, explaining how to spot his location where he is being held captive.\n\nWith help from Dylan's current boyfriend The Chad (Tom Green), the Angels approach the abandoned lighthouse where Knox is holding Bosley prisoner. The Angels rescue Bosley and defeat Vivian, the Creepy Thin Man, and some henchmen before Knox blows up the lighthouse, but Knox uses his software and the Redstar satellite network to locate Charlie when he telephones Bosley. When Knox programs a helicopter with a missile towards Charlie's house, Bosley helps the Angels board the helicopter, and Alex reprograms the missile to have it shoot backwards, which blows up the helicopter and kills Knox while all of the Angels land safely together on the beach.\n\nSeeing the opportunity to finally meet Charlie in person, they enter the beach house that Knox had targeted the missile at, but Charlie has already left. He remotely congratulates the Angels on a job well done through another speaker, and treats them and Bosley to a vacation. Charlie tells them that Knox's father was undercover; however, he was discovered and he was killed by someone else but not Charlie. When he speaks to the Angels unseen again by telephone on the beach, they ask if they could ever meet him in person. Dylan then suspects that she might be seeing him nearby talking into a cell phone, but she doesn't tell the group.",
  "synopsis": null
}