{
  "imdb_id": "tt5039054",
  "tmdb_id": "369925",
  "douban_id": null,
  "title": "Oopiri (2016)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "158 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.1,
  "director": [
    {
      "id": "nm2449331",
      "name": "Vamsi Paidipally"
    }
  ],
  "writer": [
    {
      "id": "nm2449331",
      "name": "Vamsi Paidipally",
      "description": "screenplay"
    },
    {
      "id": "nm2449331",
      "name": "Vamsi Paidipally",
      "description": "story adaptation"
    },
    {
      "id": "nm2493024",
      "name": "Abburi Ravi",
      "description": "dialogue"
    }
  ],
  "cast": [
    {
      "id": "nm0015459",
      "name": "Nagarjuna Akkineni",
      "character": "Vikramaditya"
    },
    {
      "id": "nm1912683",
      "name": "Karthi",
      "character": "Seenu"
    },
    {
      "id": "nm1961459",
      "name": "Tamannaah Bhatia",
      "character": "Keerthi"
    },
    {
      "id": "nm0695177",
      "name": "Prakash Raj",
      "character": "Prasad"
    },
    {
      "id": "nm0419707",
      "name": "Jayasudha",
      "character": "Seenu's Mother"
    },
    {
      "id": "nm0900266",
      "name": "Vivek",
      "character": "Lawyer"
    },
    {
      "id": "nm0019382",
      "name": "Ali",
      "character": "Lawyer Lingam"
    },
    {
      "id": "nm1427780",
      "name": "Kalpana",
      "character": "Chef"
    },
    {
      "id": "nm0080238",
      "name": "Tanikella Bharani",
      "character": "Kalidasu /              Kalidasan"
    },
    {
      "id": "nm5852439",
      "name": "Punarnavi Bhupalam",
      "character": ""
    },
    {
      "id": "nm7972895",
      "name": "Sreenivasa Sayee",
      "character": "Kanna"
    },
    {
      "id": "nm0080248",
      "name": "Santhana Bharathi",
      "character": "Policeman"
    },
    {
      "id": "nm2011932",
      "name": "Anushka Shetty",
      "character": "Cameo Appearance"
    },
    {
      "id": "nm1328152",
      "name": "Shriya Saran",
      "character": "Cameo Appearance"
    },
    {
      "id": "nm3414188",
      "name": "Adivi Sesh",
      "character": "Cameo Appearance"
    },
    {
      "id": "nm7944794",
      "name": "Gabriella Demetriades",
      "character": "Cameo Appearance"
    },
    {
      "id": "nm6598222",
      "name": "Nora Fatehi",
      "character": "Cameo Appearance"
    },
    {
      "id": "nm5474289",
      "name": "Nicolas Lagiere",
      "character": ""
    },
    {
      "id": "nm8159626",
      "name": "Nikitha Anil",
      "character": "Seenu's Sister"
    },
    {
      "id": "nm6487250",
      "name": "Uday Bhanu Avirineni",
      "character": ""
    },
    {
      "id": "nm1350569",
      "name": "Harshavardhan",
      "character": "Police officer"
    },
    {
      "id": "nm5375105",
      "name": "Raghu Kumar Karumanchi",
      "character": ""
    },
    {
      "id": "nm2376650",
      "name": "Satya Krishnan",
      "character": "Therapist"
    },
    {
      "id": "nm1007581",
      "name": "Manobala",
      "character": ""
    },
    {
      "id": "nm4936620",
      "name": "Praveen",
      "character": ""
    },
    {
      "id": "nm5159260",
      "name": "Thagubothu Ramesh",
      "character": ""
    },
    {
      "id": "nm1022090",
      "name": "Raja Ravindra",
      "character": ""
    },
    {
      "id": "nm3606518",
      "name": "Bharath Reddy",
      "character": "Doctor"
    }
  ],
  "overview": "A convict out on parole finds employment as the caretaker of a multi-millionaire, who is paralysed from neck down.",
  "storyline": "An unemployed youngster, Seenu who is out on parole, is discarded by his family and lands up in an interview for the caretaker of a multi-millionaire quadriplegic Vikram. Amused at his carefree attitude and the fact that he treats him with bewilderment rather than sympathy, Vikram hires him. What follows is a roller-coaster journey of emotions!",
  "plot": "Vikramadhitya is a wealthy entrepreneur who owns a group of businesses. In Paris, a paragliding accident leaves him a quadriplegic. To ensure his girlfriend Nandini's happiness, Vikramadhitya's friend and legal adviser, Prasad, conveys a message on his behalf that he is not interested in marrying her.\n\nFive years later, Vikramadhitya leads a hopeless life with his secretary Keerthi, his cook Lakshmi, and a few servants. He and Keerthi interview candidates for a caretaker position; many seem pretentious and manipulative. Seenu, a paroled convict, applies for the job in accordance with his lawyer's (Lingam) advice; the job would prove to the court that Seenu is leading a law-abiding life, closing his case. He is detested by his mother (a railway clerk) and his siblings, Swathi and Kanna.\n\nVikramadhitya, finding Seenu honest and unpretentious, hires him. He defends his decision to Prasad, saying that Seenu is the right person for the time being since he is the only one who does not pity him. Initially reluctant, Seenu learns the extent of Vikramadhitya's disability and assists him with all his needs. He is attracted to Keerthi, who rejects his advances quickly and gives him an inferiority complex.\n\nSeenu learns that Vikramadhitya has a purely epistolary relationship with a woman called Priya. Seenu encourages him to meet her, but Vikramadhitya opposes it, fearing her reaction when she discovers his disability. Swathi's marriage is opposed by her lover's father, Kalidasu, who ridicules their economic status. Vikramadhitya learns about this, and coerces Kalidasu (through Prasad) without Seenu's knowledge. The marriage is arranged, and Seenu earns Swathi's respect.\n\nAfter celebrating his birthday, Vikramadhitya becomes ill during the night and is saved by his doctors. Seenu learns about Vikramadhitya's past from Prasad, and suggests a vacation in Paris. Vikramadhitya agrees and he, Seenu, and Keerthi leave for Paris. Seenu keeps Vikramadhitya happy and boosts his morale, which impresses Keerthi. He wagers that he will propose to Keerthi if Vikramadhitya impresses Jenny, a French dancer. Despite his disability, Vikramadhitya charms Jenny with his wit. Seenu is then forced to propose to Keerthi, who later accepts.\n\nVikramadhitya meets Nandini, her husband Abhinav, and their daughter Aadhya, and Seenu tells her about Vikramadhitya's accident and its aftermath. Relieved that Nandini is happy, he returns to India and his joyous attitude makes Prasad and Lakshmi happy. Later, Kanna gets in trouble with a gang, and meets Seenu at Vikramadhitya's mansion. Vikramadhitya, recognising Seenu's need to support his family, releases him from his obligations and suggests he may not want to push a wheelchair all his life. Although Seenu becomes a cab driver, leads a responsible life and regains his mother's love, Vikramadhitya is unhappy with his new caretakers and becomes a recluse.\n\nA worried Prasad contacts Seenu, who arrives and drives Vikramadhitya off in a car. They dress elegantly, and visit a restaurant with a beautiful ocean view. Seenu leaves moments before Priya arrives. Vikramadhitya looks outside through the window and sees Seenu, who smiles at him and walks away.",
  "synopsis": null
}