{
  "imdb_id": "tt5016444",
  "tmdb_id": "429777",
  "douban_id": null,
  "title": "Uncle (2015)",
  "genres": [
    "Comedy"
  ],
  "country": "Lithuania",
  "version": [],
  "imdb_rating": 6.3,
  "director": [
    {
      "id": "nm7016794",
      "name": "Justinas Krisiunas"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm1876322",
      "name": "Airida Gintautaite",
      "character": "Gabija"
    },
    {
      "id": "nm1873030",
      "name": "Aleksas Kazanavicius",
      "character": "Kristupas"
    },
    {
      "id": "nm7572521",
      "name": "Kipras Kliucinskas",
      "character": "Algis"
    },
    {
      "id": "nm5976282",
      "name": "Martynas Levickis",
      "character": "Rokas"
    },
    {
      "id": "nm3308443",
      "name": "Sam Pamphilon",
      "character": "Lovely Guy"
    },
    {
      "id": "nm4776166",
      "name": "Linas Pozera",
      "character": "Fisherman"
    },
    {
      "id": "nm0757063",
      "name": "Arunas Sakalauskas",
      "character": "Ziufas"
    },
    {
      "id": "nm1533013",
      "name": "Dziugas Siaurusaitis",
      "character": "Zilvinas"
    },
    {
      "id": "nm0832671",
      "name": "Arunas Storpirstis",
      "character": "Gintaras"
    },
    {
      "id": "nm3752249",
      "name": "Simonas Storpirstis",
      "character": "Martynas"
    },
    {
      "id": "nm1533300",
      "name": "Sakalas Uzdavinys",
      "character": "Sarunas"
    },
    {
      "id": "nm5503679",
      "name": "Juste Zinkeviciute",
      "character": "Juste"
    }
  ],
  "overview": "Following a fatal boating accident, in which one of his students dies, Gintaras, a champion yachtsman, swears off the sea, quits sailing and withdraws into himself.",
  "storyline": "Following a fatal boating accident, in which one of his students dies, Gintaras, a champion yachtsman, swears off the sea, quits sailing and withdraws into himself. His life is turned upside down when his brother asks him to look after his son Rokas, a misguided youth. He hopes that Gintaras can help Rokas put his life back together after a series of poor choices have put him on the path to self- destruction. En route to join his uncle in Nida, a Lithuanian jewel on the Baltic Sea, Rokas meddles in criminal activities, but he also finds true love. At the same time a new passion is born when he sets his eyes on yachts bobbing gracefully in the harbour. From that moment on Rokas has a dream - to take part in a regatta. Uncle Gintaras' opposition is no match for his nephew's dogged determination as Rokas gradually reforms himself, and helps Gintaras rekindle his passion for the sea. This action packed romantic comedy celebrates the powers of the human spirit to transform one's life and ...",
  "plot": "In 1963, professional thief-turned CIA agent Napoleon Solo extracts Gaby Teller, daughter of Dr. Udo Teller, an alleged Nazi scientist-turned United States collaborator at the end of World War II, from East Berlin, evading KGB operative Illya Kuryakin. He later reports to his superior, Sanders, who reveals that Gaby's maternal uncle Rudi works in a shipping company owned by Alexander and Victoria Vinciguerra, a wealthy Nazi sympathizing couple who intend to use Teller to build their own private nuclear weapon and give it to lingering Nazi elements. Due to the potentially world-ending nature of this crisis, the CIA and KGB have reluctantly teamed up, and Solo and Kuryakin are ordered to stop the Vinciguerras from succeeding, with both men secretly assigned to steal Udo Teller's research for their respective governments.\n\nThe trio travels to Rome, where Gaby and Kuryakin reluctantly pose as an engaged couple, and Solo pretends to be an antiquities dealer. Solo deduces they are being monitored and instructs Kuryakin not to defend himself from muggers so as to preserve this cover. Despite their hostilities towards each other, Kuryakin heeds his advice and does not react when his father’s prized watch is stolen. Later, at an auto racing event promoted by the Vinciguerras, Solo and Gaby flirt with Victoria and Alexander, respectively, in order to lure out information about Teller. Meanwhile Kuryakin acquires evidence the Vinciguerras were recently exposed to radiation, indicating that their weapon is near completion.\n\nSolo and Kuryakin begrudgingly join forces to break into a Vinciguerra shipping yard, in which they find traces of uranium. After accidentally setting off the alarm, they escape into the water only to find their way blocked. During the ensuing scuffle with the guards, Kuryakin nearly drowns in the waters but Solo escapes, only to surprise himself by returning to save Kuryakin. Although a suspicious Victoria pursues them with her henchmen, Solo and Kuryakin manage to slip past into their own rooms undetected, and Victoria and Solo spend the night together. The following day, Gaby meets with Rudi and Alexander to discuss a job, but unexpectedly betrays Kuryakin and Solo to them, forcing Kuryakin to escape, while Solo is drugged and captured by Victoria and taken to a nearby warehouse to be tortured in an electric chair by Rudi, who is revealed as an infamous Nazi torturer. Solo is saved by Kuryakin, who straps Rudi into the electric chair, in order to intimidate him into talking. Rudi reveals that the weapon is hidden in an island fortress, where Gaby has been reunited with her father, which is where Solo and Kuryakin head off to, with Rudi unintentionally being burnt alive due to the electric chair malfunctioning. To protect Gaby, Dr. Teller pretends to resume work on the weapon, which has a tracking system left over from when the warhead was non-nuclear, so that a second missile can home in on it for added impact, but although Gaby attempts to help her father escape and sabotage the warhead. Victoria quickly sees through this deception, and has Alexander imprison Gaby, as an extra incentive for Dr. Teller. Teller quickly adds the finishing touches to the bomb, but is then shot in the head by Victoria as soon as he does.\n\nMeanwhile, Solo and Kuryakin are approached by Alexander Waverly, a high-ranking MI6 operative who flies them on a Westland Wessex to HMS Ark Royal (R09) and reveals that Gaby is an undercover agent under his employment. He and his Special Boat Service commandos help Solo and Kuryakin infiltrate the Vinciguerras’ compound. Alexander Vinciguerra attempts to escape with Gaby and the warhead, but is intercepted and Alexander is killed by the duo. Solo secretly retrieves the disc with Teller’s research, but the warhead Vinciguerra was taking with him was the non-nuclear secondary missile, allowing Victoria to leave undetected on another boat with the real warhead. By Gaby's suggestion, having heard the weapon system explained, Solo is able to contact Victoria via radio and keep her on the line long enough for Waverly to locate her and launch the homing missile, simultaneously destroying the nuclear weapon and the boat, apparently taking Victoria with it.\n\nAfterwards, Kuryakin confronts Solo in his hotel room, intending to kill him and steal the disc for the Soviet Union, but changes his mind when Solo produces Kuryakin's father’s stolen watch, which he had retrieved. The two instead choose to share a drink on the terrace and burn the contents of the disk, so as to not give either of their countries the upper hand in the arms race. They then reunite with Gaby and Waverly, who reveals that the trio has been reassigned to a new international organization under his command. He then announces a new mission to Istanbul under their new codename: U.N.C.L.E..",
  "synopsis": null
}