{
  "imdb_id": "tt5069996",
  "tmdb_id": "401444",
  "douban_id": null,
  "title": "Rising Tides (2016)",
  "genres": [
    "Documentary"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "89 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.8,
  "director": [
    {
      "id": "nm0041709",
      "name": "Jason Auerbach"
    },
    {
      "id": "nm0244781",
      "name": "Scott Duthie"
    }
  ],
  "writer": [
    {
      "id": "nm0041709",
      "name": "Jason Auerbach",
      "description": null
    },
    {
      "id": "nm2309979",
      "name": "Michele Loschiavo",
      "description": null
    },
    {
      "id": "nm2312211",
      "name": "Holly Vogler",
      "description": "v.o. narration only"
    }
  ],
  "cast": [
    {
      "id": "nm7618779",
      "name": "Gary Appelson",
      "character": "Himself"
    },
    {
      "id": "nm0041709",
      "name": "Jason Auerbach",
      "character": "Himself"
    },
    {
      "id": "nm7618777",
      "name": "Kannon Auerbach",
      "character": "Himself"
    },
    {
      "id": "nm7618778",
      "name": "Roen Auerbach",
      "character": "Himself"
    },
    {
      "id": "nm7618766",
      "name": "Simon Paul Aycock",
      "character": "Himself"
    },
    {
      "id": "nm7618797",
      "name": "Todd Barber",
      "character": "Himself"
    },
    {
      "id": "nm3097345",
      "name": "Larry Beggs",
      "character": "Himself"
    },
    {
      "id": "nm7618790",
      "name": "Dwight Burrus",
      "character": "Himself"
    },
    {
      "id": "nm7618782",
      "name": "Tim Carlisle",
      "character": "Himself"
    },
    {
      "id": "nm7618785",
      "name": "Hervé Cazenave",
      "character": "Himself"
    },
    {
      "id": "nm7618772",
      "name": "Chuck Colley",
      "character": "Himself"
    },
    {
      "id": "nm7618769",
      "name": "Garner Corby",
      "character": "Himself"
    },
    {
      "id": "nm7618764",
      "name": "Jerry W. Craig",
      "character": "Himself"
    },
    {
      "id": "nm7618780",
      "name": "Justin Craig",
      "character": "Himself"
    },
    {
      "id": "nm7618765",
      "name": "Carol Dillon",
      "character": "Herself"
    },
    {
      "id": "nm7618789",
      "name": "Nicole Elko",
      "character": "Herself"
    },
    {
      "id": "nm7618770",
      "name": "Joe Ferrell Jr.",
      "character": "Himself"
    },
    {
      "id": "nm7618767",
      "name": "Elizabeth O. Fox",
      "character": "Herself"
    },
    {
      "id": "nm7618788",
      "name": "James Houston",
      "character": "Himself"
    },
    {
      "id": "nm3532465",
      "name": "Paul Jenkin",
      "character": "Himself"
    },
    {
      "id": "nm7618787",
      "name": "Jennifer Jurado",
      "character": "Herself"
    },
    {
      "id": "nm7618774",
      "name": "Kristen Kneifl",
      "character": "Herself"
    },
    {
      "id": "nm7618792",
      "name": "Jim Marino",
      "character": "Himself"
    },
    {
      "id": "nm7618773",
      "name": "Jesse McNinch",
      "character": "Himself"
    },
    {
      "id": "nm7618762",
      "name": "Sam Merrill",
      "character": "Himself"
    },
    {
      "id": "nm7051648",
      "name": "Chad Nelsen",
      "character": "Himself"
    },
    {
      "id": "nm7618771",
      "name": "Sarah Oktay",
      "character": "Herself"
    },
    {
      "id": "nm7618784",
      "name": "Laurent Peyrondet",
      "character": "Himself"
    },
    {
      "id": "nm5785125",
      "name": "Orrin Pilkey",
      "character": "Himself"
    },
    {
      "id": "nm7618795",
      "name": "Joan Pope",
      "character": "Herself"
    },
    {
      "id": "nm7618768",
      "name": "Walter Priest",
      "character": "Himself"
    },
    {
      "id": "nm7618791",
      "name": "John Ratzenberger",
      "character": "Himself"
    },
    {
      "id": "nm7618786",
      "name": "Martin Renard",
      "character": "Himself"
    },
    {
      "id": "nm7618783",
      "name": "Stanley R. Riggs",
      "character": "Himself"
    },
    {
      "id": "nm7618775",
      "name": "Thomas Ruppert",
      "character": "Himself"
    },
    {
      "id": "nm7618794",
      "name": "Harry Simmons",
      "character": "Himself"
    },
    {
      "id": "nm7618776",
      "name": "Philip K. Stoddard",
      "character": "Himself"
    },
    {
      "id": "nm7618761",
      "name": "Benjamin Strauss",
      "character": "Himself"
    },
    {
      "id": "nm7618781",
      "name": "Kate White",
      "character": "Herself"
    },
    {
      "id": "nm7618793",
      "name": "Sandy Williams",
      "character": "Himself"
    },
    {
      "id": "nm7618796",
      "name": "Jerry Yaokasin",
      "character": "Himself"
    },
    {
      "id": "nm7618763",
      "name": "Gary Zarillo",
      "character": "Himself"
    }
  ],
  "overview": "The effects of sea level rise and erosion on coast lines.",
  "storyline": "Hurricane Katrina. Hurricane Sandy. The increasing frequency of such devastating weather events demonstrates the realities of climate change and rising seas. For many coastal communities the impacts will be devastating. They have been fighting against vanishing coastlines for years with mixed results; often having no choice but to abandon properties and move buildings. Adding to this conversation are the conservationists and scientists who feel the coastlines should be left alone for a multitude of different reasons. Rising Tides explores the topic of coastline erosion, showing what has been done in the past, what is being done now, what worked, what didn't and what the coastal areas can expect in the future. Through interviews with scientists, experts, nonprofits, homeowners, government officials, and other groups offering possible solutions, Rising Tides covers all angles of this life-threatening issue. This award winning documentary offers an interesting and educational perspective...",
  "plot": "After a failed attempt to rescue his first mate, Joshamee Gibbs in London, Captain Jack Sparrow is brought before King George II. The king wants Jack to guide an expedition to the Fountain of Youth before King Ferdinand and the Spanish Navy can locate it. Jack's old nemesis, Captain Hector Barbossa, now a privateer in service to the British Navy after losing his leg and ship, the Black Pearl, which he says was sunk, is heading the expedition.\n\nJack refuses the offer and escapes. He meets up with his father, Captain Teague, who warns Jack about the Fountain's rituals. Jack learns someone is impersonating him to recruit a crew to find the Fountain. The impostor is Angelica, Jack's former lover, and the daughter of the ruthless pirate Blackbeard, who practices voodoo magic and wields the mythical \"Sword of Triton\" that controls his ship, the Queen Anne's Revenge. While Jack is shanghaied aboard Blackbeard's ship, Gibbs escapes execution by memorizing and destroying Jack's map showing the Fountain's location, forcing Barbossa to take him along.\n\nMeanwhile, after a failed mutiny aboard the Queen Anne's Revenge, Jack is forced to guide the crew to the Fountain. Blackbeard seeks the Fountain's power to circumvent his predestined fatal encounter with a \"one-legged man\", who happened to be Barbossa. Jack must find two silver chalices aboard Juan Ponce de León's missing flagship, the Santiago. The Fountain's water must simultaneously be drunk by two people from the chalices. Drinking from one chalice containing a mermaid's tear will extend life; the second person dies, their remaining years of life transferred to the other drinker. Jack also discovers that the Black Pearl was captured and shrunk before being added to Blackbeard's collection of other shrunken ships in bottles.\n\nThe Queen Anne's Revenge heads for Whitecap Bay to find and harvest mermaid tears. A mermaid named Syrena is caught, but Philip Swift, a captive missionary, falls in love with her. Reaching Ponce de León's ship on an uncharted island, Angelica and Blackbeard coerce Jack into retrieving both chalices. Jack locates the grounded, decaying vessel, only to find Barbossa there. Both guess that the Spanish have taken the chalices, after they are nowhere to be found on the vessel.\n\nJack and Barbossa team up to sneak into the Spanish camp and steal the chalices. Barbossa reveals he only wants revenge against Blackbeard for attacking the Black Pearl, and his leg being amputated. Jack and Barbossa escape with the chalices. Meanwhile, Syrena, reciprocating Philip's love, is tricked into shedding a tear. Blackbeard collects it, leaving her to die while Philip is forced to go with them. Jack returns with the chalices and bargains with Blackbeard for Angelica's safety, Jack's confiscated magical compass, and Gibbs' release. In return, Jack vows to give Blackbeard the chalices and lead him to the Fountain; Blackbeard agrees, and Gibbs is set free with the compass.\n\nAt the Fountain, Blackbeard's crew is confronted by Barbossa and his men and they battle while Barbossa and Blackbeard fight. The Spanish suddenly arrive, intending to destroy the Fountain, believing its power an abomination against God. They crush the chalices and throw them in the swamp. When Barbossa stabs Blackbeard with a poisoned sword, Angelica pulls it out but is cut and poisoned. Barbossa obtains Blackbeard's magic sword and gains control of the Queen Anne's Revenge and her crew. Philip is mortally wounded, but he returns to free Syrena. She retrieves the missing chalices and gives them to Jack, telling him not to waste her tear. Syrena goes back to the dying Philip. She says she can save him if he asks her to. When he asks for her forgiveness, she kisses him and takes him underwater.\n\nWith Blackbeard and Angelica both nearing death, Jack wants Angelica to drink from the chalice containing the tear. Instead, Blackbeard drinks it, asking his daughter to sacrifice herself. Angelica agrees and drinks from the second chalice. Anticipating that the self-serving Blackbeard would sacrifice his daughter, Jack lied about which chalice contained the tear to save Angelica's life and Blackbeard's soul, although they were not happy that Jack tricked them. Angelica's wounds are healed as the Fountain fatally consumes Blackbeard's body. Although Angelica claimed she loves Jack, he distrusts her intentions and strands her on a cay. Now wielding Blackbeard's magical sword, Barbossa captains the Queen Anne's Revenge and returns to piracy.\n\nJack finds Gibbs, who had used the compass to locate the Revenge. He reclaims the shrunken Black Pearl and the other conquered ships in bottles, carrying them in a gunny sack. The two leave, hoping to revert the Black Pearl to its original size.\n\nIn a post-credits scene, a voodoo doll of Jack crafted by Blackbeard washes ashore and is found by Angelica.",
  "synopsis": null
}