{
  "imdb_id": "tt5095770",
  "tmdb_id": "383743",
  "douban_id": null,
  "title": "Before the Streets (2016)",
  "genres": [
    "Crime",
    "Drama"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.9,
  "director": [
    {
      "id": "nm3212799",
      "name": "Chloé Leriche"
    }
  ],
  "writer": [
    {
      "id": "nm3212799",
      "name": "Chloé Leriche",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm7639726",
      "name": "Rykko Bellemare",
      "character": "Shawnouk"
    },
    {
      "id": "nm7639729",
      "name": "Kwena Bellemare-Boivin",
      "character": "Kwena"
    },
    {
      "id": "nm7639727",
      "name": "Jacques Newashish",
      "character": "Paul-Yves"
    },
    {
      "id": "nm7639728",
      "name": "Janis Ottawa",
      "character": "Anita"
    },
    {
      "id": "nm0239575",
      "name": "Martin Dubreuil",
      "character": "Thomas Dugré"
    },
    {
      "id": "nm3267449",
      "name": "Normand Daoust",
      "character": "Directeur"
    }
  ],
  "overview": "Menacing smoke rises over the forests of Manawan. Shawnouk has lost touch with the traditions of the Atikamekw people, and he struggles with daily life on the reservation. His mother's boyfriend is a policeman, and though he means well, Shawnouk won't accept him as part of the family. There's so much missing in his life. One night, Shawnouk gets involved in a break-in. When the home-owner turns up, Shawnouk pushes himself between the man and the gun. In the end, he is the one with blood on his hands. He goes into hiding in the vast forests of Québec. In the search for his roots, he faces regret, pain and anger. Fire and smoke, the ancient trees, and the music of his ancestors help Shawnouk to face his biggest challenge: the confrontation with himself.",
  "storyline": "Shawnouk, a young Atikamekw, commits a crime. After escaping into the forest, he returns to his community, where he tries healing by investing the native traditionalism. \"Before the streets\" is cast almost entirely by non-professional Atikamekw actors performing in their own language, and in the authenticity of their native village.",
  "plot": null,
  "synopsis": null
}