{
  "imdb_id": "tt5052966",
  "tmdb_id": "362434",
  "douban_id": null,
  "title": "Ominous (TV Movie 2015)",
  "genres": [
    "Horror"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "87 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.1,
  "director": [
    {
      "id": "nm0838289",
      "name": "Peter Sullivan"
    }
  ],
  "writer": [
    {
      "id": "nm1788721",
      "name": "Chris Regina",
      "description": "story"
    },
    {
      "id": "nm2621214",
      "name": "Justin Smith",
      "description": "story"
    },
    {
      "id": "nm0838289",
      "name": "Peter Sullivan",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0005538",
      "name": "Barry Watson",
      "character": "Michael Young"
    },
    {
      "id": "nm2657974",
      "name": "Esmé Bianco",
      "character": "Rachel Young"
    },
    {
      "id": "nm6349873",
      "name": "Gavin Lewis",
      "character": "Jacob Young"
    },
    {
      "id": "nm0152464",
      "name": "Mark Lindsay Chapman",
      "character": "The Stranger"
    },
    {
      "id": "nm0262026",
      "name": "Eric Etebari",
      "character": "Father Francis"
    },
    {
      "id": "nm0004968",
      "name": "Jaime Gomez",
      "character": "Detective Ezequiel Villa"
    },
    {
      "id": "nm1530860",
      "name": "Ian Donovan Hyland",
      "character": "Jeremy       (as Ian Hyland)"
    },
    {
      "id": "nm0173304",
      "name": "John Colton",
      "character": "Priest"
    },
    {
      "id": "nm6639370",
      "name": "Connor Bellina",
      "character": "Demon Jacob"
    },
    {
      "id": "nm6147466",
      "name": "Brandon Amano",
      "character": "Demon Jeremy"
    },
    {
      "id": "nm2396999",
      "name": "Gavin Collins",
      "character": "Parker"
    },
    {
      "id": "nm5786768",
      "name": "Jared Breeze",
      "character": "Logan"
    },
    {
      "id": "nm5773448",
      "name": "Hunter Payton",
      "character": "Sullivan"
    },
    {
      "id": "nm4891771",
      "name": "Alexander Walsh",
      "character": "Chris"
    },
    {
      "id": "nm0537103",
      "name": "Michael C. Mahon",
      "character": "Rachel's Doctor"
    },
    {
      "id": "nm3016406",
      "name": "Angela Relucio",
      "character": "Sofia"
    },
    {
      "id": "nm0330536",
      "name": "Randy Gordon",
      "character": "Man with the Staples"
    },
    {
      "id": "nm3171390",
      "name": "Ernie Charles",
      "character": "Paramedic Chuck"
    },
    {
      "id": "nm1945120",
      "name": "Dona Wood",
      "character": "Dr. Holtz"
    },
    {
      "id": "nm0161893",
      "name": "Carl Ciarfalio",
      "character": "Cook"
    },
    {
      "id": "nm1594672",
      "name": "Peter Stickles",
      "character": "Paramedic"
    },
    {
      "id": "nm4309786",
      "name": "Mike Jerome Putnam",
      "character": "Policeman"
    }
  ],
  "overview": "Michael and Rachel are devastated when their six-year-old son dies in a tragic accident. When a stranger offers to bring the boy back to life, they take the offer. However, the child who returns is not the child they once knew.",
  "storyline": "Michael and Rachel are devastated when their six-year-old son dies in a tragic accident. When a stranger offers to bring the boy back to life, they take the offer. However, the child who returns is not the child they once knew.",
  "plot": "A naïve young woman (Joan Fontaine) is in Monte Carlo working as a paid companion to Edythe Van Hopper (Florence Bates) when she meets the aristocratic but brooding widower Maximilian \"Maxim\" de Winter (Laurence Olivier). They fall in love, and within two weeks they are married. The young woman is now the second \"Mrs. de Winter.\"\n\nMaxim takes his new bride back to Manderley, his large country house in Cornwall. The housekeeper, Mrs. Danvers (Judith Anderson), is domineering and cold, and is obsessed with the beauty, intelligence and sophistication of Maxim's dead wife Rebecca, the first Mrs. de Winter, preserving her former bedroom, the master suite, as a shrine. Although dead, Rebecca's presence is nonetheless pervasive - several things throughout the house - stationery, handkerchiefs, bed linens, even the master bedroom door - bear her ornate \"R\" or \"R de W\" monogram. As her closest confidant, Mrs. Danvers regularly comments on Rebecca's exceptional grace and style. When asked what Rebecca was like, Frank Crawley (Reginald Denny), Maxim's best friend and manager of the estate, absent-mindedly tells the new Mrs. de Winter that Rebecca was an exceptional beauty.\n\nThe new Mrs. de Winter is intimidated by her responsibilities and begins to doubt her relationship with her husband. The continuous reminders of Rebecca overwhelm her; she believes that Maxim is still deeply in love with his first wife. She also discovers that her husband sometimes becomes very angry at her for apparently insignificant actions. She also meets Rebecca's so-called \"favorite cousin,\" Jack Favell (George Sanders), who visits the house while Maxim is away.\nMrs. Danvers attempts to persuade Mrs. de Winter to leap to her death.\nTrying to be the perfect wife, the young Mrs. de Winter convinces Maxim to hold a costume party, as he had done with Rebecca. She wants to plan her own costume, but Mrs. Danvers suggests she copy the beautiful outfit in the portrait of Lady Caroline de Winter, an ancestor of Maxim's. At the party, when the costume is revealed, Maxim is appalled; Rebecca wore the same outfit at the ball a year ago, shortly before her death.\n\nMrs. de Winter confronts Danvers, who tells her she can never take Rebecca's place, and almost manages to convince her to jump to her death. An airborne flare reveals that a ship has hit the rocks. Mrs. de Winter rushes outside, where she hears that during the rescue a sunken boat has been found with Rebecca's body in it.\n\nMaxim admits to his new wife that he had earlier misidentified another body as Rebecca's, in order to conceal the truth. His first marriage, until now viewed by the world as ideal, was in fact a sham. At the very beginning of their marriage Rebecca had told Maxim she intended to continue the scandalous life she had previously lived. He hated her for this, but they agreed to an arrangement: in public she would pretend to be the perfect wife and hostess, and he would ignore Rebecca's private wanton lifestyle. However, Rebecca grew careless, including an ongoing affair with Jack Favell. One night, Rebecca told Maxim she was pregnant with a child that was not his. Laughing at Maxim's dismay, Rebecca proclaimed that the child, presumed to be a boy and legally Maxim's son, would thus inherit his beloved estate Manderley. During the ensuing heated argument she fell, hit her head and died. Maxim took the body out in her boat, which he then scuttled.\n\nNow assured of her husband's love for her and not his first wife, the new Mrs. de Winter sheds the remnants of her girlish innocence. She begins to coach her husband how to conceal the mode of Rebecca's death from the authorities. In the police investigation, deliberate damage to the boat points to suicide. However, Favell shows Maxim a note from Rebecca, which appears to prove that she was not suicidal; Favell tries to blackmail Maxim. Maxim tells the police, and then falls under suspicion of murder. The investigation reveals Rebecca's secret visit to a London doctor (Leo G. Carroll), which Favell assumes was due to her illicit pregnancy. But the police interview with the doctor establishes that Rebecca was not actually pregnant; the doctor had told Rebecca that she was suffering from a late-stage cancer instead.\n\nThe coroner renders a finding of suicide. Only Frank Crawley, Maxim, and his wife know the full story: that Rebecca told Maxim she was pregnant with another man's child in order to try to goad him into killing her, an indirect means of suicide that would also have ensured her husband's ruination and possible execution.\n\nAs Maxim returns home from London to Manderley, he sees that the manor is on fire, set ablaze by the deranged Mrs. Danvers. The second Mrs. de Winter and the staff escape the blaze, but Danvers is killed when a ceiling collapses on her. Finally, a silk nightdress case on Rebecca's bed, with a beautifully embroidered \"R\" - Rebecca's proud emblem of ownership - is consumed by flames.",
  "synopsis": null
}