{
  "imdb_id": "tt5058222",
  "tmdb_id": "421272",
  "douban_id": null,
  "title": "Most Likely (2015)",
  "genres": [
    "Comedy"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "119 min",
      "description": ""
    }
  ],
  "imdb_rating": 9.1,
  "director": [
    {
      "id": "nm3898854",
      "name": "Andrew Bemis"
    }
  ],
  "writer": [
    {
      "id": "nm3898854",
      "name": "Andrew Bemis",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3898865",
      "name": "Jessica Conger",
      "character": "Beth"
    },
    {
      "id": "nm7625127",
      "name": "Thomas M. Campbell",
      "character": "Mike"
    },
    {
      "id": "nm7609993",
      "name": "Kevin Sandberg",
      "character": "Phil"
    },
    {
      "id": "nm6483265",
      "name": "Destinie Ryan",
      "character": "Mia"
    },
    {
      "id": "nm4254617",
      "name": "Alex Fandel",
      "character": "Chloe"
    },
    {
      "id": "nm7609990",
      "name": "Rory Acres",
      "character": "Kurt"
    },
    {
      "id": "nm3898854",
      "name": "Andrew Bemis",
      "character": "Joe"
    },
    {
      "id": "nm7609991",
      "name": "Jennifer Beaudoin",
      "character": "Lex"
    },
    {
      "id": "nm7609992",
      "name": "Alisa Leigh",
      "character": "Rain"
    },
    {
      "id": "nm4247523",
      "name": "Johnny Donaldson",
      "character": "Greg"
    },
    {
      "id": "nm3473588",
      "name": "Colin Allen",
      "character": "Chris"
    },
    {
      "id": "nm7609995",
      "name": "Annabelle Kennedy",
      "character": "Justice of the Peace"
    }
  ],
  "overview": "Kurt and Chloe are a free-spirited couple that invite their closest friends to Kurt's family's vacation house in rural New Hampshire for their wedding. Among the guests are Mia's lifelong friends - Beth, a talented but aimless aspiring writer; Mia, a recently divorced single mom who'd rather not be at a wedding; and Joe, Mia's best friend, who is recovering from the fallout of a bad breakup. Over the course of the weekend leading up to Chloe and Kurt's nuptials, wine is poured (and other substances imbibed) old friendships are tested, and new relationships begin.",
  "storyline": "Most Likely is an ensemble comedy that revolves around the wedding of Kurt and Chloe, a free-spirited couple that, instead of planning a traditional wedding, decide to invite their closest friends to Kurt's family's vacation house in northern New Hampshire for the weekend. Among the guests are Chloe's lifelong friends - Beth, a talented but aimless aspiring writer; Mia, a recently divorced single mom who'd rather not be at a wedding; and Joe, Mia's best friend, who is recovering from the emotional fallout of a bad breakup. Unfolding over the course of the weekend leading up to Chloe and Kurt's nuptials, wine is poured (and other substances are imbibed), old friends are tested and new relationships begin.",
  "plot": null,
  "synopsis": "Most Likely is an ensemble comedy that revolves around the wedding of Kurt and Chloe, a free-spirited couple that, instead of planning a traditional wedding, decide to invite their closest friend to Kurt's family vacation house in northern New Hampshire for the weekend. Among the guests are Chloe's lifelong friends - Beth, a talented but aimless aspiring writer; Mia, a recently divorced single mom whod rather not be at a wedding; and Joe, Mia's best friend, a theater director recovering from the emotional fallout of a bad breakup. Unfolding over the course of the weekend leading up to Chloe and Kurt's nuptials, wine is poured (and other substances are imbibed), old friendships are tested and new relationships begin."
}