{
  "imdb_id": "tt5090404",
  "tmdb_id": "357068",
  "douban_id": null,
  "title": "Dukale's Dream (2014)",
  "genres": [
    "Documentary"
  ],
  "country": null,
  "version": [
    {
      "runtime": "70 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.0,
  "director": [
    {
      "id": "nm0745320",
      "name": "Josh Victor Rothstein"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm8449973",
      "name": "Adanesh",
      "character": "Herself"
    },
    {
      "id": "nm1832752",
      "name": "Tim Costello",
      "character": "Himself"
    },
    {
      "id": "nm8449972",
      "name": "Dukale",
      "character": "Himself"
    },
    {
      "id": "nm0299028",
      "name": "Deborra-Lee Furness",
      "character": "Herself"
    },
    {
      "id": "nm3680089",
      "name": "Tefera Ghedamu",
      "character": "Himself"
    },
    {
      "id": "nm0413168",
      "name": "Hugh Jackman",
      "character": "Himself"
    },
    {
      "id": "nm8449974",
      "name": "Takele Mammo",
      "character": "Himself"
    },
    {
      "id": "nm1925679",
      "name": "Jeffrey Sachs",
      "character": "Himself       (as Jeffery D. Sachs)"
    },
    {
      "id": "nm8449975",
      "name": "Shameles",
      "character": "Himself"
    },
    {
      "id": "nm8449971",
      "name": "Assefa Tofu",
      "character": "Himself"
    }
  ],
  "overview": "In 2009, actors Hugh Jackman and his wife, Deborra-lee Furness, traveled to Ethiopia as ambassadors for World Vision Australia, one of the world's largest humanitarian aid organizations. As longtime donors, the Jackmans wanted to visit a World Vision community development project to see how rural communities were being empowered to eradicate poverty. While in the Yirgacheffe region, Hugh met a 27 year-old coffee farmer named Dukale, working to lift his family out of poverty. Spending time on Dukale's farm, Hugh learned first-hand about the value of fair trade coffee and clean cookstove technology. (C) Official Site",
  "storyline": "Hugh Jackman (X-MEN's \"Wolverine\") flies to Ethiopia as part of World Vision's initiative to bring attention to their success in raising people out of poverty. Hugh spends an entire day in the fields with a coffee grower named Dukale who is working hard to lift his family out of poverty. Spending time on Dukale's farm, Hugh learned first-hand about the value of fair trade coffee. Upon returning to New York, Hugh was invited to speak at UN Climate Week where he made an impassioned plea to world leaders to provide support for farmers like Dukale, noting something as simple as a cup of coffee had the power to reduce global poverty. Hugh was so inspired by Dukale, he launched Laughing Man Coffee, trading directly with the growers and donating 100% of the profit to support community development programs and social entrepreneurs around the world.",
  "plot": null,
  "synopsis": null
}