{
  "imdb_id": "tt5049302",
  "tmdb_id": "360551",
  "douban_id": "26279229",
  "title": "The Priests (2015)",
  "genres": [
    "Mystery",
    "Thriller"
  ],
  "country": "South Korea",
  "version": [
    {
      "runtime": "103 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.3,
  "director": [
    {
      "id": "nm6940206",
      "name": "Jae-hyun Jang"
    }
  ],
  "writer": [
    {
      "id": "nm6940206",
      "name": "Jae-hyun Jang",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2412823",
      "name": "Yoon-Seok Kim",
      "character": "Father Kim"
    },
    {
      "id": "nm1504868",
      "name": "Dong-won Gang",
      "character": "Deacon Choi"
    },
    {
      "id": "nm1366028",
      "name": "Byeong-ok Kim",
      "character": "Professor Park"
    },
    {
      "id": "nm0453440",
      "name": "Eui-sung Kim",
      "character": "Dean"
    },
    {
      "id": "nm0497398",
      "name": "Ho-jae Lee",
      "character": "Father Jeong"
    },
    {
      "id": "nm6476224",
      "name": "So-dam Park",
      "character": "Young-shin"
    },
    {
      "id": "nm5601908",
      "name": "Jong-hak Son",
      "character": ""
    },
    {
      "id": "nm5678382",
      "name": "Jo Soo-Hyang",
      "character": "Agnes"
    }
  ],
  "overview": "To save a girl in danger, a priest and deacon jump into a mysterious case.",
  "storyline": "The young girl Young-shin seems to be possessed by demon and Father Kim and Deacon Choi are about to investigate the case. But to save the life of Young-shin, the have to find out if the girl is truly possessed or maybe the victim of a human force. Or in the worst case both.",
  "plot": "The film begins with a brief prologue in 1976. At a Boston Police station, two policemen discuss the arrest of a Catholic priest for child molestation and the presence of a high ranking cleric talking to the mother of the children. The Assistant District Attorney then enters the precinct and tells the cops not to let the press get wind of what happened. The arrest is hushed up, and the priest is released.\n\nIn 2001, The Boston Globe hires a new editor, Marty Baron. Baron meets Walter \"Robby\" Robinson, the editor of the Spotlight team, a small group of journalists writing investigative articles that take months to research and publish. After Baron reads a Globe column about a lawyer, Mitchell Garabedian, who says that Cardinal Bernard Law (the Archbishop of Boston) knew that the priest John Geoghan was sexually abusing children and did nothing to stop him, he urges the Spotlight team to investigate. Journalist Michael Rezendes contacts Garabedian, who initially declines to be interviewed. Though he is told not to, Rezendes reveals that he is on the Spotlight team, persuading Garabedian to talk.\n\nInitially believing that they are following the story of one priest who was moved around several times, the Spotlight team begin to uncover a pattern of sexual abuse of children by Catholic priests in Massachusetts, and an ongoing cover-up by the Boston Archdiocese. Through Phil Saviano, who heads the victims' rights group Survivors Network of those Abused by Priests (SNAP), they widen their search to 13 priests. They learn through Richard Sipe, a former priest who worked at trying to rehabilitate pedophile priests, that statistically there should be approximately 90 abusive priests in Boston (six percent of priests). Through their research, they develop a list of 87 names, and begin to find their victims to back up their suspicions. When the September 11 attacks occur, the team is forced to deprioritize the story. They regain momentum when Rezendes learns from Garabedian that there are publicly available documents that confirm Cardinal Law was made aware of the problem and ignored it. Although Rezendes argues vociferously to run the story immediately before more victims suffer and rival newspapers publish, Robinson remains steadfast to research further so that the systemic problem can be more fully exposed. After The Boston Globe wins a case to have even more legal documents unsealed that provide the evidence of that larger picture, the Spotlight team finally begins to write the story, and plan to publish their findings in early 2002.\n\nAs they are about to go to print, Robinson confesses to the team that he was sent a list of 20 pedophile priests by lawyer Eric MacLeish in 1993 that he never followed up on, but Baron still commends him and his team's efforts to expose the crimes now. The story goes to print with a web link to the documents that expose Cardinal Law's inaction, and a phone number for victims of pedophile priests. The following morning, the Spotlight team is inundated with phone calls from victims coming forward to tell their stories. The film closes with a list of places in the United States and around the world where major scandals involving abuse by priests took place. It also states that Cardinal Law resigned, and was eventually promoted to the Basilica di Santa Maria Maggiore in Rome, one of the biggest churches in the world.",
  "synopsis": null
}