{
  "imdb_id": "tt5011290",
  "tmdb_id": "405755",
  "douban_id": "26290642",
  "title": "So Young 2: Never Gone (2016)",
  "genres": [
    "Drama",
    "Romance"
  ],
  "country": "China",
  "version": [
    {
      "runtime": "100 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.9,
  "director": [
    {
      "id": "nm7342815",
      "name": "Zhou Tuo Ru"
    }
  ],
  "writer": [
    {
      "id": "nm7342818",
      "name": "Yi Wu Xin",
      "description": null
    },
    {
      "id": "nm7342817",
      "name": "Tuo Ru Zhou",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm6806246",
      "name": "Kris Wu",
      "character": "Cheng Zheng"
    },
    {
      "id": "nm1703577",
      "name": "Yifei Liu",
      "character": "Su Yunjin"
    },
    {
      "id": "nm4369324",
      "name": "Kim Scar",
      "character": "Zhou Ziyi"
    },
    {
      "id": "nm3138181",
      "name": "Qin Li",
      "character": "Meng Xue"
    },
    {
      "id": "nm4083288",
      "name": "Meng Li",
      "character": "Mo Yuhua       (as Vivien Li)"
    },
    {
      "id": "nm0284015",
      "name": "Shao-Wen Hao",
      "character": "Song Ming       (as Steven Hao)"
    },
    {
      "id": "nm3619575",
      "name": "Kimi Qiao",
      "character": "Shen Ju'an"
    },
    {
      "id": "nm4026104",
      "name": "Ran Chen",
      "character": "Zhang Yue"
    }
  ],
  "overview": "A wealthy young man pursues a young woman of modest means, but circumstances often separate them as the years pass.",
  "storyline": "The story started in high school. Su Yunjin (Liu Yifei) is a struggling transfer student from a regional town, while rich heir Cheng Zheng (Kris Wu) is the star student who sits behind her. He fell in love with her and started to pursue her all the way through college, even though they studied and lived in different cities. Cheng Zheng was ultimately successful in pursuing Su Yunjin, who willed herself to follow her heart for once, even though she knew there would be many obstacles in their way. Soon, they were basking in happiness, and subsequently moved in together after university. However, reality caught up with them two years after graduation. Their vastly different personalities and disparate family background meant their relationship was unequal from the very beginning - their unspoken expectations of each other and all the misunderstandings that came with a mundane lifestyle caused them to part ways with each other. A few years later, both of them establish successful careers,...",
  "plot": "Zheng Wei started her college freshman year as a civil engineer major to be in the same city as her childhood playmate, Lin Jing, whom she determined she would marry one day. When Wei visited Jing at his college dormitory however, Jing's roommate told her Jing left for America. Unable to understand why Jing abruptly left without saying goodbye, Wei felt heartbroken.\n\nBack in her college dormitory, Wei became close friends with her three roommates, Ruan Guan, the most beautiful and popular girl in the class; Li Weijuan, a practical and realistic girl who came from province but determined to marry well; and Zhu Xiaobei, a tomboy. The four girls talked about their goals in life, and all cheered to Ruan Guan's ambition—to have a youth that will never fade away.\n\nWei also befriended Lao Zhang and his roommate Xu Kaiyang, architecture majors, during the college clubs and activities fair. Kaiyang came from a well-to-do family and started his romantic pursuit for Wei, but Wei would only regard him as a friend. One evening Wei went to Lao Zhang and Kaiyang's dorm room to borrow their DVDs. Wei was amazed and disgusted by the messy condition of the male dormroom, except one bed and corner that was neat and clean. Lao Zhang said this spot belonged to their disciplined and hardworking roommate, Chen Xiaozheng. Laozhang went out of the room to find his DVDs, leaving Wei alone in the room. Wei saw a near finished building model on the table and started fumbling with the parts. At this moment Xiaozheng came back and angrily yelled out, \"What are you doing there?\" Startled and swinging around to see who was yelling at her, Wei knocked the model off the table. Xiaozheng managed to save his model by shoving Wei out of the way. Wei stumbled to the floor and was enraged at her humiliation. Wei angrily demanded an apology from Xiaozheng, but Xiaozheng coolly replied that he had nothing to apologize for and that it was her fault to touch his building model. From then on, Wei was determined to repeatedly humiliate Xiaozheng as a revenge to at least get his apology that she believed she deserves. Through her attempts Wei realized she in fact, liked Xiaozheng. From Lao Zhang and Weijuan, Wei learned that Xiaozheng came from a poor family and was raised by a strict mother, hence his aloof and disciplined personality. Wei declared her interest in Xiaozheng, then openly, relentlessly, and shamelessly stalked Xiaozheng to get his attention, much to his annoyance. Eventually, Xiaozheng was impressed by her enthusiasm and determination, and agreed to be her boyfriend.\n\nDuring the rest of their college life and relationship, Xiaozheng and Wei found that they have starkly contrasting personalities. Although he appreciates Wei's fiery enthusiastic personality, Xiaozheng also reprimanded Wei at times for her laid-back and undisciplined attitude towards her coursework. Wei asked Xiaozheng why is he so serious all the time, Xiaozheng replied, \"I don't know what your attitude towards your life, but my life is like a building that can only be built once, so I cannot afford any margin of error.\" Xiaozheng implied that due to his family's modest financial circumstances, he needed to do anything and everything he can to ensure the best possible professional future for himself.\n\nEventually graduation came upon Wei and Xiaozheng. At the on-campus recruitment and interview fair, Wei believed she and Xiaozheng would work at the same institute thus remain together. Unbeknownst to Wei, Xiaozheng has applied and obtained a graduate fellowship to study architecture in America. When Wei learned of his plan, she confronted Xiaozheng to ask why she was the last one to know. Xiaozheng difficultly explained he could not tell her because he was afraid of hurting her and reiterating that he could not make any mistake in his life, he then apologized that he had to make this choice of leaving her to make a better future for himself.\n\nFast forward a few years; Wei had now become a mature professional great at her work, much different from her bygone youthful days. One day she suddenly encountered Lin Jing. Jing explained he left abruptly because he learned that his father was having an affair with Wei's mother, so he could not face Wei, he never went to America, but avoided contact with her except for once when he went to look for her but found her with Xiaozheng. He wanted to come back and rekindle their friendship and, possibly, romance.At this time, Xiaozheng also returned from America, now as a renowned and accomplished architect. While he now had everything professionally that he was determined to get, Xiaozheng regretted letting go of Wei and also wanted to rekindle their relationship. Wei on first meeting refused Xiaocheng. During this time, Ruan Guan is killed in a car accident trying to meet her university boyfriend for one last time before she got married. Wei in grief asks Lin Jing to get married. However, she later calls it off when Lin Jing tells about another girl that loved him during their time apart. Afterwards, Xiaocheng and Wei meet once more at the aquarium to reminisce. It is during this final scene when Xiaozheng asks Wei, \"Can I love you again?\" to which Wei replies, \"Xiaozheng, we spent our youth together...youth is to be commemorated.\"",
  "synopsis": null
}