{
  "imdb_id": "tt5065810",
  "tmdb_id": "378813",
  "douban_id": null,
  "title": "Aloys (2016)",
  "genres": [
    "Drama",
    "Fantasy",
    "Sci-Fi"
  ],
  "country": "Switzerland",
  "version": [
    {
      "runtime": "91 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm3065748",
      "name": "Tobias Nölle"
    }
  ],
  "writer": [
    {
      "id": "nm3065748",
      "name": "Tobias Nölle",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0295429",
      "name": "Georg Friedrich",
      "character": "Aloys Adorn"
    },
    {
      "id": "nm7615085",
      "name": "Tilde von Overbeck",
      "character": "Vera"
    },
    {
      "id": "nm1293187",
      "name": "Kamil Krejcí",
      "character": "Herr Schoch"
    },
    {
      "id": "nm7615086",
      "name": "Yufei Li",
      "character": "Yen Lee"
    },
    {
      "id": "nm7615087",
      "name": "Koi Lee",
      "character": "Herr Lee"
    },
    {
      "id": "nm0473132",
      "name": "Sebastian Krähenbühl",
      "character": "Hauswart"
    },
    {
      "id": "nm7615088",
      "name": "Karl Friedrich",
      "character": "Vater Aloys"
    },
    {
      "id": "nm2780876",
      "name": "Peter Zumstein",
      "character": "Bestatter"
    },
    {
      "id": "nm1952762",
      "name": "Agnes Lampkin",
      "character": "Julie Kramer"
    },
    {
      "id": "nm2487761",
      "name": "Rahel Hubacher",
      "character": "Schwangere Frau"
    },
    {
      "id": "nm7615089",
      "name": "Haroldo Simao",
      "character": "Drag Queen"
    },
    {
      "id": "nm3812951",
      "name": "Tobias Bienz",
      "character": "DJ"
    },
    {
      "id": "nm3932793",
      "name": "Aaron Hitz",
      "character": "Gonzo"
    },
    {
      "id": "nm7615090",
      "name": "Barblin Leggio-Hänseler",
      "character": "Polizistin Wohnung"
    },
    {
      "id": "nm3640100",
      "name": "Benjamin Merz",
      "character": "Polizist Lift 2"
    },
    {
      "id": "nm0592057",
      "name": "Arthur Miranda",
      "character": "Priester"
    },
    {
      "id": "nm7615091",
      "name": "Marlis Ochsner",
      "character": "Frau im Spital"
    },
    {
      "id": "nm1903301",
      "name": "Jürg Plüss",
      "character": "Polizist Wohnung"
    },
    {
      "id": "nm0782315",
      "name": "Alexander Seibt",
      "character": "Polizist Lift 1"
    },
    {
      "id": "nm0831542",
      "name": "Maja Stolle",
      "character": "Frau Schoch       (voice)"
    }
  ],
  "overview": "A lonely private investigator is contacted by a mysterious woman who pulls him into a mind game known as “telephone walking”. Fascinated by her voice, Aloys discovers an imaginary universe that allows him to break out of his isolation.",
  "storyline": "Aloys Adorn is a middle aged private detective who lives and works with his father. He experiences life from a safe distance, through a video camera he keeps recording 24 hours a day, and the massive collection of surveillance tapes he organizes and obsessively watches at home. But when his father dies, Aloys is left on his own and his sheltered existence begins to fall apart. After a night of heavy drinking, Aloys wakes up on a public bus to find that his camera and precious observation tapes have been stolen. Soon after, a mysterious woman calls to blackmail him. She offers to return the tapes if Aloys will try an obscure Japanese invention called 'telephone walking' with her, using his imagination as their only connection. As he is drawn deeper and deeper, falling in love with the voice on the other end of the phone, the woman opens up a new universe that may allow Aloys to break out of his isolation and into the real world.",
  "plot": "Aloys is a private investigator who is working with his father. He is a loner who has the professional approach never to interact with the subjects of his investigations, preferring to film them from a distance with his video camera. It is implied that Aloys hates personal contact with other people, e.g. ignoring a woman who lives in a neighboring apartment and who asks for a small favor. It is also shown that Aloys films persons who are not subjects of his job and that he likes to watch the material he filmed in private.\n\nWhen the film begins, his father has just died. On the bus ride home from the funeral, he drinks himself to unconsciousness. When he wakes up the next morning in the bus, he notices that his camera and several video tapes with filmed material have been stolen.\n\nA short time later a female voice calls him on the telephone, telling him that she stole his tapes, watched them, and plans to send them to the filmed subjects. Aloys threatens to call the police but does not go through with it. But he tries to find out the identity of the caller using some clues that he obtained during the phone conversation. But the caller is always one step ahead of him, mocking him for his tries.\n\nDuring one of the calls, the female voice tries to get Aloys to commit to something she calls a \"telephone hike\", where both callers try to concentrate on a location and imagine being at that location together while talking to each other. After initial hesitation, Aloys begins engaging in it, going on an imagined walk through the woods together with the woman.\n\nWhen he tries to initiate further telephone hikes, the woman abruptly ends the conversation, saying that this was the last time they talked. When he comes home to his apartment building, he notices that an unconscious neighbor is loaded into an ambulance. Using some of the clues that he obtained while trying to unmask the caller, he immediately realizes that his neigbor, Vera, the same one he ignored earlier, is the mysterious woman.\n\nHe obtains information that Vera is a zookeeper and has just tried to commit suicide. Not knowing whether she survived, he volunteers to water her flowers and feed her pet iguana.\n\nSome days later a text message arrives from Vera, who is now in a hospital following her suicide attempt, thanking him for looking after her stuff. Aloys, elated that she is alive, now tries to initiate phone conversations himself. Vera hesitatingly gives in and both have repeated telephone hikes, with Aloys inviting her to a tour of his apartment, complete with a virtual party with all the people Aloys was watching, both having a date at a restaurant, and Vera giving Aloys a tour of the zoo. All hikes are performed by Aloys being at the actual location and talking to Vera, who is in her hospital room, on the phone.\n\nBut Aloys gives his imagined version of Vera more space than the actual Vera. One day, when the real Vera, who is on a short leave from the hospital, wants to visit Aloys at his apartment, he does not let her in, instead being wooed inside his apartment by his imagined version of her. A dejected Vera leaves and returns back to the hospital. The shock of seeing the real Vera leave finally gives Aloys the strength to let go of his imagination and he follows Vera to the hospital, sneaking into her room in the night. The film ends the next morning with Vera sleeping in her hospital bed and Aloys sleeping on the floor beside her.",
  "synopsis": null
}