{
  "imdb_id": "tt5078100",
  "tmdb_id": "408274",
  "douban_id": null,
  "title": "The Apple of My Eye (2016)",
  "genres": [
    "Comedy",
    "Romance"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "84 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.5,
  "director": [
    {
      "id": "nm0740612",
      "name": "Axelle Ropert"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm0076889",
      "name": "Mélanie Bernier",
      "character": "Elise Mazure"
    },
    {
      "id": "nm3319078",
      "name": "Bastien Bouillon",
      "character": "Théo Papagika"
    },
    {
      "id": "nm1314328",
      "name": "Antonin Fresson",
      "character": "Léandro Papagika"
    },
    {
      "id": "nm7381498",
      "name": "Chloé Astor",
      "character": "Marina"
    },
    {
      "id": "nm0035128",
      "name": "Swann Arlaud",
      "character": "Nicolaï"
    },
    {
      "id": "nm1896791",
      "name": "Laurent Mothe",
      "character": "Monsieur Dimitros"
    },
    {
      "id": "nm0316441",
      "name": "Thierry Gibault",
      "character": "Le conseiller Pôle Emploi"
    },
    {
      "id": "nm1538543",
      "name": "Camille Cayol",
      "character": "L'addictologue"
    },
    {
      "id": "nm0102516",
      "name": "Serge Bozon",
      "character": "Le voisin rockeur"
    },
    {
      "id": "nm2806009",
      "name": "Jean-Charles Clichet",
      "character": "Le marginal"
    },
    {
      "id": "nm6622659",
      "name": "Grégoire Montana",
      "character": "L'ado dépressif"
    },
    {
      "id": "nm0529619",
      "name": "Vladimir Léon",
      "character": "Le maire"
    },
    {
      "id": "nm1342292",
      "name": "Benjamin Esdraffo",
      "character": "Le témoin de Jéhovah"
    },
    {
      "id": "nm4965605",
      "name": "Manon Kneusé",
      "character": "La première conquête de Théo"
    },
    {
      "id": "nm6301176",
      "name": "Aurore James",
      "character": "La deuxième conquête de Théo"
    },
    {
      "id": "nm7991668",
      "name": "Marguerite Lefranc",
      "character": "Athéna"
    },
    {
      "id": "nm9105565",
      "name": "Nicolas Maniakis",
      "character": "Le restaurateur grec"
    },
    {
      "id": "nm7790542",
      "name": "Marina Valleix",
      "character": "La cliente du café"
    },
    {
      "id": "nm5814275",
      "name": "Paul Bozon",
      "character": "L'enfant de la fête grecque"
    },
    {
      "id": "nm9105566",
      "name": "Annie Notto",
      "character": "La dame du mariage grec"
    },
    {
      "id": "nm9105567",
      "name": "Ioannis Christoforidis",
      "character": "Le réceptionniste du mariage grec"
    }
  ],
  "overview": "A boy, a girl. They live in the same building. They share a passion for music. But when they meet in the elevator, Théo doesn’t see that Élise is blind. It’s hate at first sight. Love takes its time. Will that early misunderstanding bring them together or drive them apart?",
  "storyline": "When they meet in the elevator, Théo doesn't see that Élise is blind. It's hate at first sight. Love takes its time. Will that early misunderstanding bring them together or drive them apart?",
  "plot": "The story begins in 1994. An outstanding student, Shen Chia-yi is popular among her teachers and classmates. Ko Ching-teng, mischievous and a poor student, claims that he has no interest in her, despite being her classmate since junior high school. One day, Ching-teng is caught masturbating during class, and the principal reseats him, placing him in front of Chia-yi.\n\nOne day, Chia-yi forgets her English textbook. Ching-teng slips her his own book and tells their teacher he forgot his own textbook; he then endures a long lecture and is punished. Chia-yi, touched by Ching-teng's generosity, prepares a practice exam for him in return, to encourage him to study. She also convinces him to stay after school to study with her. Their relationship grows, and Ching-teng's grades gradually improve.\n\nOn graduation, Ching-teng enrolls at the National Chiao Tung University. Chia-Yi, who did not do well on the admission exam because she was ill on that day, only manages to enter the National Taipei University of Education with her mediocre test results. Depressed and upset, she is consoled by Ching-teng, who calls her long-distance almost every night from university. During the winter holiday season that year, the two go on their first \"date\", during which Ching-teng asks Chia-yi if she loves him. However, fearing she would say no, he decides that he would rather not hear her answer (it is revealed later that her reply would have been \"yes\"). Ching-teng later organizes a fight night and invites Chia-yi to watch, hoping to impress her with his \"strength\". On the contrary, Chia-yi finds it childish for Ching-teng to injure himself for no reason. This upsets Ching-teng, sparking a quarrel that causes the two to break up.\n\nDuring the two years after their breakup, Ching-teng has no contact with Chia-yi. He qualifies for a graduate research course at Tunghai University, where he begins writing stories online. Ching-teng only regains contact with Chia-yi after the 921 earthquake, when he calls to see if she is okay. During their long conversation with each other, they both lament the fact that they were not fated to become a couple.\n\nYears later, in 2005, Chia-yi suddenly calls Ching-teng to tell him that she is getting married. All of her old friends gather at the wedding, making jokes and trying to embarrass her somewhat-older husband. They are surprised that their past emotions have transformed into deep friendship and serenity. Ching-teng begins to work on a web novel about his experiences with Chia-yi.\n\nLater, when they gather to congratulate the bride and groom, the friends joke that they should be able to kiss the bride. The husband says that anybody who wants to kiss the bride has to kiss him like that first. Ching-teng grabs the groom and pushes him onto the table, kissing him like he would kiss Chia-yi. During their kiss, he remembers how he regrets their fight from years ago, and what could have happened had he apologized for being childish.",
  "synopsis": null
}