{
  "imdb_id": "tt5095552",
  "tmdb_id": "376558",
  "douban_id": null,
  "title": "The Slayers (2015)",
  "genres": [
    "Comedy",
    "Horror"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "101 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.9,
  "director": [
    {
      "id": "nm6071536",
      "name": "John Williams"
    }
  ],
  "writer": [
    {
      "id": "nm6071536",
      "name": "John Williams",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1559617",
      "name": "Darren McAree",
      "character": "Nigel"
    },
    {
      "id": "nm7639520",
      "name": "Matthew Sandland",
      "character": "Job"
    },
    {
      "id": "nm1675336",
      "name": "George Newton",
      "character": "Reg"
    },
    {
      "id": "nm5764159",
      "name": "Sophie Elsby",
      "character": "Jess"
    },
    {
      "id": "nm7663678",
      "name": "Dan Smith",
      "character": "Dan"
    },
    {
      "id": "nm6086989",
      "name": "Marnix Van Der Kraan",
      "character": "Max"
    },
    {
      "id": "nm2279568",
      "name": "Pete Bennett",
      "character": "Vampire"
    },
    {
      "id": "nm8071980",
      "name": "Darren Anstey",
      "character": "Cult Member"
    },
    {
      "id": "nm4874237",
      "name": "Brooklyn Baker",
      "character": "Cult Member"
    },
    {
      "id": "nm8014463",
      "name": "Mark Carter",
      "character": "Vampire"
    },
    {
      "id": "nm7657218",
      "name": "Jason Conway",
      "character": "Shed Man"
    },
    {
      "id": "nm7663680",
      "name": "Kate Cubley",
      "character": "Sarah       (as Kate Thomson)"
    },
    {
      "id": "nm8074672",
      "name": "Colin Dmitri",
      "character": "Cult Member"
    },
    {
      "id": "nm8043126",
      "name": "Tim Edwards",
      "character": "Cult Member"
    },
    {
      "id": "nm7663682",
      "name": "Martin Elliot",
      "character": "The Scottish Barman"
    },
    {
      "id": "nm8043125",
      "name": "Pete Gallimore",
      "character": "Cult Member"
    },
    {
      "id": "nm7984878",
      "name": "Dan Lewis-Dayle",
      "character": "Candle Vampire"
    },
    {
      "id": "nm6931873",
      "name": "Chris Lines",
      "character": "Head Vampire"
    },
    {
      "id": "nm6832711",
      "name": "Donato Maglie",
      "character": "Cult Member"
    },
    {
      "id": "nm7148740",
      "name": "Sheena McDonagh",
      "character": "Campsite Lady"
    },
    {
      "id": "nm4423903",
      "name": "Anthony Miles",
      "character": "Brother Steve"
    },
    {
      "id": "nm8470048",
      "name": "Craig Ostrouchow",
      "character": "Cult Member"
    },
    {
      "id": "nm7974918",
      "name": "Damon Simms",
      "character": "Clive Tosspot"
    },
    {
      "id": "nm7663681",
      "name": "Neil Thorne",
      "character": "Polite Man       (as Neil Thorpe)"
    },
    {
      "id": "nm4713607",
      "name": "Ernest Vernon",
      "character": "Doctor"
    },
    {
      "id": "nm6891047",
      "name": "Steve Wood",
      "character": "Harry"
    }
  ],
  "overview": "Two cult members, Nigel and Job, decide to go on a road trip during their last two weeks on earth. Bucketlist in hand, motorhome fired up, the two head for the mountains of Scotland for a final fortnight filled with girls, skydiving, camping, alcohol and strange men claiming to be vampire slayers... Is this God's plan for Nigel and Job?",
  "storyline": "Two cult members, Nigel and Job, decide to go on a road trip during their last two weeks on earth. Bucketlist in hand, motorhome fired up, the two head for the mountains of Scotland for a final fortnight filled with girls, skydiving, camping, alcohol and strange men claiming to be vampire slayers... Is this God's plan for Nigel and Job?",
  "plot": "Kay (Sarah Kendall) is an abstract artist who has been plagued since childhood by a series of disturbing dreams. The intensity and frequency of the dreams have fluctuated over the course of her life, as has their content; some of her dreams are simply of glimpses of desolate locations that leave her feeling dread upon awakening, while others feature the gruesome deaths of her friends and loved ones at the hands of a supernatural force. Recently, her dreams have become more frequent and disturbing than ever, resulting in a shift in the quality of her work. Afraid that the dreams are aggravated by stress, and fearful that her newfound success may be slipping away, Kay's family and friends plan a vacation for her to a small island off the coast of Georgia. Accompanying Kay are her husband David (Alan McRae), Kay's brother Eric (Frederick Flynn) who introduced her to David, and Eric's wife Brooke (Carol Kottenbrook).\n\nAs the couples' plane prepares to land, their pilot, Marsh (Michael Holmes), informs them that he's just received notification that an Atlantic hurricane has shifted course towards the island. Marsh hurriedly drops the couple off, telling them that he has to leave the island before he's stranded there. The couples discover that, against expectations, the island is deserted, and populated largely by derelict buildings and the ruins of a once-thriving resort town. Kay informs the rest of the quartet that the island is the place she has been dreaming about since childhood, and that they are all in danger if they stay there. Unnable to leave due to the hurricane, Brooke, David, and Eric try to assuage her fears.\n\nOver the next three days, David, Eric, and Brooke are murdered one by one. With each subsequent killing, alternate possibilities as to the motive for their deaths are offered; Eric believes that Marsh never left the island and brought the couples there to kill them, a supposition that is granted some support when Marsh is later seen on the island. Kay believes that the island has allowed her dreams to cross over into reality, and that the creature from her nightmares is responsible - a theory supported by the fact that the deaths only occur when Kay is asleep. Additionally, it becomes apparent that Kay herself may be the killer, murdering in the throes of a somnambulistic trance out of repressed resentment towards her loved ones.\n\nWith everyone dead except for Kay, she barricades herself in the beach house and struggles to stay awake. As night falls, Marsh attempts to gain entry into the house, Kay shoots him with a flare gun which kills him and setting the house on fire. Kay discovers a flaming, skeletal creature waiting for her at the front door.\n\nThe film jumps to a scene of Kay as a child being woken up on Christmas morning by her parents. Kay tells them that she had a nightmare and describes the events of the film; it is unclear whether the scene is a flashback or if the film itself was merely a nightmare. After telling her parents about the dream, Kay's father presents her with a black cat, and Eric enters the room. Kay looks at the cat and becomes visibly frightened.",
  "synopsis": null
}