{
  "imdb_id": "tt5065314",
  "tmdb_id": "381148",
  "douban_id": null,
  "title": "Comic 8: Casino Kings",
  "genres": [
    "Action",
    "Comedy"
  ],
  "country": "Indonesia",
  "version": [],
  "imdb_rating": 6.7,
  "director": [
    {
      "id": "nm5322992",
      "name": "Anggy Umbara"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm4852549",
      "name": "Hannah Al Rashid",
      "character": "Bella"
    },
    {
      "id": "nm1902766",
      "name": "Donny Alamsyah",
      "character": "Isa"
    },
    {
      "id": "nm2999289",
      "name": "Ence Bagus",
      "character": "Satpam"
    },
    {
      "id": "nm6669031",
      "name": "Babe Cabita",
      "character": "Babe Cabiita"
    },
    {
      "id": "nm3276965",
      "name": "Candil",
      "character": "Senior Agent 2"
    },
    {
      "id": "nm0159027",
      "name": "Billy Chong",
      "character": "The Hunters 3"
    },
    {
      "id": "nm10467465",
      "name": "Adjis Doaibu",
      "character": "Adjis Doaibu"
    },
    {
      "id": "nm7609200",
      "name": "Fico Fachriza",
      "character": "Fico Fachriza"
    },
    {
      "id": "nm3652657",
      "name": "Gandhi Fernando",
      "character": "Announcer"
    },
    {
      "id": "nm5322786",
      "name": "Agung Hercules",
      "character": "Agung Hercules"
    },
    {
      "id": "nm6055228",
      "name": "Indro Warkop",
      "character": "Indro Warkop"
    },
    {
      "id": "nm1097660",
      "name": "Lydia Kandou",
      "character": "The Hunters 4"
    },
    {
      "id": "nm7609201",
      "name": "Arie Kriting",
      "character": "Arie Kriting"
    },
    {
      "id": "nm1257611",
      "name": "Agus Kuncoro",
      "character": "Senior Agent 1"
    },
    {
      "id": "nm1221134",
      "name": "Sophia Latjuba",
      "character": "The King"
    },
    {
      "id": "nm7609203",
      "name": "Cak Lontong",
      "character": "Cak Lemper"
    },
    {
      "id": "nm5199457",
      "name": "Nikita Mirzani",
      "character": "Nikita Mirzani"
    },
    {
      "id": "nm4545336",
      "name": "Prisia Nasution",
      "character": "Interpol"
    },
    {
      "id": "nm5322825",
      "name": "Bagus Netral",
      "character": "Bagus Netral"
    },
    {
      "id": "nm6669030",
      "name": "Kemal Palevi",
      "character": "Kemal Palevi"
    },
    {
      "id": "nm7241698",
      "name": "Ge Pamungkas",
      "character": "Ge Pamungkas"
    },
    {
      "id": "nm7609202",
      "name": "Pandji Pragiwaksono",
      "character": "Pandji Pragiwaksono"
    },
    {
      "id": "nm7609198",
      "name": "Ernest Prakasa",
      "character": "Ernest Prakasa"
    },
    {
      "id": "nm0697514",
      "name": "Barry Prima",
      "character": "The Hunters 1"
    },
    {
      "id": "nm0749035",
      "name": "George Rudy",
      "character": "The Hunters 2"
    },
    {
      "id": "nm3345670",
      "name": "Yayan Ruhian",
      "character": "The Ghost"
    },
    {
      "id": "nm5780243",
      "name": "Soleh Solihun",
      "character": "The Hunters 6"
    },
    {
      "id": "nm7609204",
      "name": "Sacha Stevenson",
      "character": "The Hunters 5"
    },
    {
      "id": "nm6281438",
      "name": "Mongol Stres",
      "character": "Mongol"
    },
    {
      "id": "nm7609199",
      "name": "Bintang Timur",
      "character": "Bintang Timur"
    },
    {
      "id": "nm2168032",
      "name": "Indro Warkop",
      "character": "Indro"
    },
    {
      "id": "nm5323041",
      "name": "Boy William",
      "character": "Inspektur Boy"
    }
  ],
  "overview": "Eight secret agent who poses as 8 comics, back in action, to defeat the Casino King, once and for all.",
  "storyline": "The eight secret agents (Arie Kriting, Babe Cabiita, Bintang Bete, Ernest Prakasa, Fico Fachriza, Ge Pamungkas, Kemal Palevi, Mongol) who adopted the code name COMIC 8 are back in action.They are led into a trap by THE KING (Sophia Latjuba) and her army, led by Isa (Donny Alamsyah) and Bella (Hannah Al Rashid), and a co-conspirator named Dr. Pandji (Pandji Pragiwaksono). Our secret agents must bet on their lives in the world's largest online gambling scheme whose players include renowned gamblers from around the globe. The eight of them must get through each life-threatening level together, facing a killer squad called The Hunters (Barry Prima, George Rudy, Lidya Kandou, Willy Dozan, Soleh Solihun, Sacha Stevenson) who keeps on hunting them to end their lives. They also have to face the Master of Martial Arts, The Ghost (Yayan Ruhian), who resurfaced back into the world simply to eliminate Babe Cabiita. At the same time, Indro Warkop, who is wanted by an Interpol Agent named Chintya (...",
  "plot": null,
  "synopsis": "Ke delapan agen rahasia (Arie Kriting, Babe Cabiita, Bintang Bete, Ernest Prakasa, Fico Fachriza, Ge Pamungkas, Kemal Palevi, Mongol) yang memakai nama samaran COMIC 8 kembali beraksi.Mereka yang telah dijebak oleh THE KING (Sophia Latjuba) bersama para pasukannya yang dipimpin oleh Isa (Donny Alamsyah) dan Bella (Hannah Al Rashid), serta seorang konspirator licik bernama Dr. Pandji (Pandji Pragiwaksono) ; terpaksa bertaruh akan kelangsungan hidup mereka, di dalam permainan Judi online yang tersebar ke para Raja Judi di seluruh dunia.Level demi Level harus mereka berdelapan lewati. Dari komplotan pasukan pembunuh bernama The Hunters (Barry Prima, George Rudy, Lidya Kandou, Willy Dozan, Soleh Solihun, Sacha Stevenson) yang terus memburu untuk menghabisi nyawa mereka, hingga Master Bela Diri bernama The Ghost (Yayan Ruhian) yang muncul ke permukaan dunia; hanya untuk menghadapi seorang Babe Cabiita. Pada saat yang bersamaan, Indro Warkop yang juga menjadi buruan agen Interpol bernama Chintya (Prisia Nasution), akhirnya juga ikut terjebak ke dalam permaianan Judi Online di pulau tersembunyi itu bersama seorang Satpam (Ence Bagus) yang hadir pada waktu dan tempat yang salah; ke dalam sebuah arena Fighting Cage, untuk melawan para petarung-petarung handal disana.Peristiwa lucu yang akan memecahkan tawa pun terus terjadi mengiringi semua aksi mereka, dimana twist demi twist tak terduga siap menunggu para penonton dalam mengikuti petualangan kocak nan seru dari sequel Comic 8 : Casino Kings Part 2 ini. Selain nama-nama di atas, film ini juga diramaikan oleh kehadiran Nikita Mirzani, Agung Hercules, Agus Kuncoro, Candil, Gandhi Fernando, Cak Lontong, Joe P Project, Boy William, Ray Sahetapy dan Bagus Netral."
}