{
  "imdb_id": "tt5128328",
  "tmdb_id": "320910",
  "douban_id": null,
  "title": "Naanum Rowdydhaan (2015)",
  "genres": [
    "Action",
    "Comedy",
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "139 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.3,
  "director": [
    {
      "id": "nm4174626",
      "name": "Vignesh Shivan"
    }
  ],
  "writer": [
    {
      "id": "nm4174626",
      "name": "Vignesh Shivan",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4043111",
      "name": "Vijay Sethupathi",
      "character": "Pondy Pandi"
    },
    {
      "id": "nm1521381",
      "name": "Nayanthara",
      "character": "Kadhambari"
    },
    {
      "id": "nm1011887",
      "name": "Parthiban",
      "character": "Killivalavan"
    },
    {
      "id": "nm0704654",
      "name": "Radhika Sarathkumar",
      "character": "Inspector Meenakumari"
    },
    {
      "id": "nm5657068",
      "name": "RJ Balaji",
      "character": "Junior Rowdy"
    },
    {
      "id": "nm1686962",
      "name": "Anandraj",
      "character": "Pondicherry Don"
    },
    {
      "id": "nm3327356",
      "name": "Motta Rajendran",
      "character": "Don Raja       (as Rajendran)"
    },
    {
      "id": "nm1386816",
      "name": "Azhagam Perumal",
      "character": "Inspector Ravikumar"
    },
    {
      "id": "nm7012715",
      "name": "Meenakshi",
      "character": "Baby"
    },
    {
      "id": "nm1658967",
      "name": "Mansoor Ali Khan",
      "character": "Mansoor"
    },
    {
      "id": "nm7665579",
      "name": "Surya Vijay Sethupathi",
      "character": "Young Pandi"
    },
    {
      "id": "nm7678728",
      "name": "Rajavel Thatha",
      "character": "Rahul"
    },
    {
      "id": "nm1182564",
      "name": "R. Sundarajan",
      "character": "Kilivalavan's Advisor"
    },
    {
      "id": "nm4171957",
      "name": "Anikha Surendran",
      "character": "Young Kaathambari"
    },
    {
      "id": "nm3830348",
      "name": "R.N.R. Manohar",
      "character": "Kilivalavan's Thalaivar"
    },
    {
      "id": "nm1958024",
      "name": "Dhilip Subbarayan",
      "character": "Rowdy"
    }
  ],
  "overview": "Pandian, the son of a cop and a wannabe rowdy, falls in love with Kadambarai, a hearing-impaired girl, who wants him to take on Killivalavan, a gangster-politician who has murdered her parents.",
  "storyline": "Pandi, son of a lady inspector in Pondicherry is a wannabe rowdy whose life-time ambition is to become a fearsome don but is an extremely fearful & jovial lad otherwise. He falls for the hearing impaired Kadhambari and tries to accomplish her request to take on the dreaded don, Killivalavan.",
  "plot": "Pandiyan aka \"Pondy Pandi\" (Vijay Sethupathi) is the son of a Puducherry-based police inspector P. Meena Kumari (Raadhika Sarathkumar). Despite being a police inspector's son, he grew up being friendly with the criminals behind bars and on reaching adulthood, unknown to his mother, he becomes a rowdy, though an incompetent one.\n\nPandi comes across a deaf girl Kadhambari (Nayantara) and immediately falls in love with her. Kadhambari is the daughter of a sincere police officer Ravikumar (Azhagam Perumal), who is in pursuit of Killivallavan aka Killi (Parthiban), a dreaded gangster and politician who had killed Ravikumar's wife and had caused Kadhambari to lose her hearing in her childhood. Kadhambari seeks Pandi's help in finding her father, who has not spoken to her for the past two days, to which he agrees. Pandi soon finds out that Ravikumar had been killed by Killi, but hides the matter from Kadhambari as it would make her upset. But Kadhambari finds out about her father's death from Pandi's mother and is determined to avenge his death by going after Killi and killing him. Pandi agrees to help her in her mission, with the promise that \"he will hold Killi's shoulders while she stabs him\".\n\nPandi and his gang along with Kadhambari hatch a plan to kill Killi while he is travelling. However, this is foiled as their plan gets mixed up with that of Mansoor (Mansoor Ali Khan), the political rival of Killi who wants to contest the upcoming election in place of Killi's wife Baby (Meenakshi). Pandi's gang is enraged and despite Paandi's reassurances, decide not to help Kadhambari further. Kadhambari decides to go ahead on her mission on her own as she doesn't want Pandi and his friends to split up over her. She reaches Killi's hideout, but on attempting to kill him, he slaps her, knocking her out. Pandi soon arrives at the hideout and he and Kadhambari, who has regained consciousness, try to kill Killi, but it fails as Kadhambari is unable to stab him. At this juncture, Mansoor arrives at the hideout and both Killi and Mansoor stab each other to death, with Pandi taking \"credit\" for their deaths in order to impress Kadhambari.\n\nIn the end, Pandi, disillusioned with the rowdy lifestyle, becomes a police officer as per his mother's wishes, despite Kadhambari's reservations.",
  "synopsis": null
}