{
  "imdb_id": "tt5128266",
  "tmdb_id": "330414",
  "douban_id": null,
  "title": "10 Endrathukulla (2015)",
  "genres": [
    "Action"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "144 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.2,
  "director": [
    {
      "id": "nm1703877",
      "name": "Vijay Milton"
    }
  ],
  "writer": [
    {
      "id": "nm1703877",
      "name": "Vijay Milton",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1417314",
      "name": "Vikram",
      "character": "James Bond       (as 'Chiyaan' Vikram)"
    },
    {
      "id": "nm3606487",
      "name": "Samantha Ruth Prabhu",
      "character": "Shakeela"
    },
    {
      "id": "nm1367730",
      "name": "Pasupathy",
      "character": "Doss"
    },
    {
      "id": "nm0222144",
      "name": "Rahul Dev",
      "character": "Daksha Bhai"
    },
    {
      "id": "nm0996625",
      "name": "Charmy Kaur",
      "character": "Item dancer"
    },
    {
      "id": "nm6106368",
      "name": "Munishkanth",
      "character": "(as Ramdoss)"
    },
    {
      "id": "nm6295704",
      "name": "Goli Soda Seetha",
      "character": "(as Seetha)"
    },
    {
      "id": "nm1007581",
      "name": "Manobala",
      "character": ""
    },
    {
      "id": "nm7151781",
      "name": "Sampoornesh Babu",
      "character": ""
    },
    {
      "id": "nm1358872",
      "name": "Abhimanyu Singh",
      "character": "Pooran Singh"
    },
    {
      "id": "nm2496992",
      "name": "Ajay",
      "character": "Don in Telangana"
    },
    {
      "id": "nm5180541",
      "name": "Imman Annachi",
      "character": "Petrol Bunk Man"
    },
    {
      "id": "nm4442569",
      "name": "Joy Badlani",
      "character": "Sheikh Imran"
    },
    {
      "id": "nm5576978",
      "name": "Ravi Jhanghu",
      "character": "Ravi"
    },
    {
      "id": "nm9541655",
      "name": "Vipin Katyal",
      "character": "Ajay"
    }
  ],
  "overview": "A skilled car driver takes on an assignment to deliver a 'package' from Chennai to Uttarkhand. What he doesn't realize is that the young woman who is travelling along with him is the 'package'. What is the mystery around her?",
  "storyline": "Vikram is a remarkable driver, who is able to do the incredible in just ten seconds. He is a complete stranger that his name remains unknown even to his close associates. As he is a transporter, he prefers to introduce himself with different names like James Bond, Kamal Haasan, Mani Ratnam. When Vikram meets Shakeela (Samantha), his life turns upside down as she is wanted by the most deadly terrorists in Uttarkhand. Why are they in search for her? Will Vikram save her life?",
  "plot": "A driving instructor (Vikram), who refers to himself by various names such as \"James Bond\" and \"Mani Ratnam\" or \"Sunil Gavaskar\", but never reveals his actual name, is assigned by a local criminal, Das (Pasupathy), to deliver a woman named Shakeela (Samantha Ruth Prabhu) to Pooran Singh (Abhimanyu Singh) in Mussoorie. Shakeela is an orphan who has failed her driving test 14 times. The driving instructor is constantly irritated by Shakeela's antics during the journey to Mussoorie, but soon falls in love with her. At Mussoorie, he learns from Pooran Singh that Shakeela is to be delivered to Daksha Bhai (Rahul Dev), an upper-caste landlord from an Uttarakhand village. He delivers Shakeela to Daksha Bhai and is invited to stay at his ancestral mansion for a festival.\n\nDuring the stay, he finds out why Shakeela has been delivered to Daksha Bhai: Shakeela is the doppelgänger of Daksha Bhai's sister Gadgi Moi (Also Samantha), a cruel and merciless upper-caste leader who has been sentenced to death for orchestrating a massacre against the lower-caste people. Daksha Bhai plans to send Shakeela to jail in the place of Gadgi, who has been released on parole to perform the last rites of her dead mother. The plan backfires as Shakeela escapes from the police. In the chaos that ensues, Gadgi breaks her cover and kidnaps Shakeela, planning to kill her in a moving train. The driving instructor manages to rescue Shakeela and kill Gadgi Moi. Daksha Bhai, distraught at Gadgi's death, commits suicide by jumping off the train with her body. Finally, the driving instructor and Shakeela, who are now in a relationship, happily drive back to Chennai.",
  "synopsis": null
}