{
  "imdb_id": "tt5186714",
  "tmdb_id": "375315",
  "douban_id": null,
  "title": "The Salesman (2016)",
  "genres": [
    "Drama",
    "Thriller"
  ],
  "country": "Iran",
  "version": [
    {
      "runtime": "124 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.5,
  "director": [
    {
      "id": "nm1410815",
      "name": "Asghar Farhadi"
    }
  ],
  "writer": [
    {
      "id": "nm1410815",
      "name": "Asghar Farhadi",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm1486911",
      "name": "Shahab Hosseini",
      "character": "Emad Etesami"
    },
    {
      "id": "nm1267552",
      "name": "Taraneh Alidoosti",
      "character": "Rana Etesami"
    },
    {
      "id": "nm3618794",
      "name": "Mina Sadati",
      "character": "Sanam"
    },
    {
      "id": "nm0439307",
      "name": "Babak Karimi",
      "character": "Babak"
    },
    {
      "id": "nm2320613",
      "name": "Farid Sajjadi Hosseini",
      "character": "The man"
    },
    {
      "id": "nm8511148",
      "name": "Mojtaba Pirzadeh",
      "character": "Majid"
    },
    {
      "id": "nm8511147",
      "name": "Shirin Aghakashi",
      "character": "Esmat"
    },
    {
      "id": "nm6143802",
      "name": "Mehdi Koushki",
      "character": "Siavash"
    },
    {
      "id": "nm8511146",
      "name": "Emad Emami",
      "character": "Ali"
    },
    {
      "id": "nm1846495",
      "name": "Ehteram Boroumand",
      "character": "Mrs. Shahnazari"
    },
    {
      "id": "nm8511145",
      "name": "Maral Bani Adam",
      "character": "Kati"
    },
    {
      "id": "nm8511150",
      "name": "Sam Valipour",
      "character": "Sadra"
    },
    {
      "id": "nm8511149",
      "name": "Sahra Asadollahe",
      "character": "Mojgan"
    }
  ],
  "overview": "Forced out of their apartment due to dangerous works on a neighboring building, Emad and Rana move into a new flat in the center of Tehran. An incident linked to the previous tenant will dramatically change the young couple’s life.",
  "storyline": "Forced to leave their collapsing house, Ranaa and Emad, an Iranian couple who happen to be performers rehearsing for Arthur Miller's \"Death of a Salesman\" rent a new apartment from one of their fellow performers. Unaware of the fact that the previous tenant had been a woman of ill repute having many clients, they settle down. By a nasty turn of events one of the clients pays a visit to the apartment one night while Ranaa is alone at home taking a bath and the aftermath turns the peaceful life of the couple upside down.",
  "plot": "Emad and Rana are a married couple who both work in the theatre, currently starring in a production of Death of a Salesman by Arthur Miller, with Emad portraying Willy Loman and Rana playing Linda. Emad is also a popular instructor at the school, where the youth joke about him being a \"Salesman.\" One night, their apartment begins to collapse and they flee the building with the other residents. Desperate to find a place to live, their fellow actor Babak secures another apartment for them, where a female tenant has just moved out. One night, Rana is home alone and begins bathing. When Emad returns, he finds she is missing and the bathroom is covered with blood. He rushes to the hospital, where he is told to change the apartment locks. It becomes apparent Rana has not had an accident, but has been assaulted by an intruder. Emad also learns from neighbours that the previous tenant was a prostitute, and that she had many conflicts with past clients.\n\nRana returns home, but suffers from trauma and no complaint is filed with the police. She does not bathe, fearing to go into the bathroom again, and in the middle of a performance, breaks down in tears and leaves the stage. Although she does not remember the face of her attacker, Emad finds the culprit left his van and a mobile phone outside of the building. The attacker also left behind money in a drawer, which Rana purchased groceries with, thinking Emad had left it for her for that purchase. While searching for a new apartment, Emad becomes angry with Babak, at one point calling his character Charley a degenerate in the midst of a performance, although this was not in Miller's script.\n\nFinally, Emad turns to one of his students, whose father policed traffic. He is able to trace the van to a man named Majid. Emad consults Majid's father-in-law, who protests that the van frequently changes owners. Gradually, it becomes apparent the father-in-law was himself the intruder, though he denies intent on attacking a woman, saying he thought there was a man in the bathroom. Emad calls the old man's family to the apartment, intending to reveal his true character to them all. Rana becomes fearful there will be an act of revenge, and tells Emad she will have nothing to do with him if he tells them what happened. By the time the family arrives, the old man is facing health issues, and the family believes they have been called to a medical emergency, thanking Emad for saving his life. When Emad is alone with the old man, he punches him, causing the old man to have a second episode. Rana and Emad afterwards return to the theatre for more performances.",
  "synopsis": null
}