{
  "imdb_id": "tt5184888",
  "tmdb_id": "373438",
  "douban_id": null,
  "title": "z'Bärg (2015)",
  "genres": [
    "Documentary"
  ],
  "country": "Switzerland",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm4377490",
      "name": "Julia Tal"
    }
  ],
  "writer": [
    {
      "id": "nm4377490",
      "name": "Julia Tal",
      "description": null
    }
  ],
  "cast": null,
  "overview": "Portrait of a couple who decide to work and live for the summer time on a lonely alp.",
  "storyline": null,
  "plot": "The story begins with the closing moments of a rather dull government lecture and slide show on agricultural policy, after which the leader of the security police of a right-wing military-dominated government (Dux) takes over the podium for an impassioned speech describing the government's program to combat leftism, using the metaphors of \"a mildew of the mind\", an infiltration of \"isms\", or \"sunspots\".\n\nThe scene shifts to preparations for a rally of the opposition faction where the pacifist Deputy (Montand) is to give a speech advocating nuclear disarmament. It is obvious that there have been attempts to prevent the speech’s delivery by the government. The venue has been changed to a much smaller hall and logistical problems have appeared out of nowhere. The Deputy is hit in the head by right-wing anticommunist bullies (some sponsored by the government) but carries on with his sharp speech. As the Deputy crosses the street from the hall after giving his speech, a delivery truck speeds past him and a man on the open truck bed strikes him down with a club. The injury eventually proves fatal, and by that time it is already clear to the viewer that the police have manipulated witnesses to force the conclusion that the victim was simply run over by a drunk driver.\n\nHowever, they do not control the hospital, where the autopsy disproves their interpretation. The examining magistrate (Trintignant), with the assistance of a photojournalist (Perrin), now uncovers sufficient evidence to indict not only the two right-wing militants who committed the murder, but also four high-ranking military police officers. The action of the film concludes with one of the Deputy's associates rushing to see the Deputy's widow (Papas) to give her the surprising news of the officers' indictments. The widow looks distressed, appearing not to believe things will change for the better.\n\nAn epilogue provides a synopsis of the subsequent turns of events. Instead of the expected positive outcome, the prosecutor is mysteriously removed from the case, several key witnesses die under suspicious circumstances, the assassins receive (relatively) short sentences, the officers receive only administrative reprimands, the Deputy's close associates die or are deported, and the photojournalist is sent to prison for disclosing official documents. The heads of the government resign after public disapproval, but before elections are carried out, a Coup d'etat occurs and the military seize all the power. They ban modern art and popular art in its many features, such as popular music and avant-garde novelists, as well as modern mathematics, classic and modern philosophers, and the use of the term \"Z\" (Greek: zíta, which was used by protesters against the former government), which referred to The Deputy and means: \"He lives\".",
  "synopsis": null
}