{
  "imdb_id": "tt5124096",
  "tmdb_id": "368017",
  "douban_id": null,
  "title": "Thanga Magan (2015)",
  "genres": [
    "Action",
    "Drama",
    "Romance"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "122 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm1399485",
      "name": "Velraj"
    }
  ],
  "writer": [
    {
      "id": "nm1399485",
      "name": "Velraj",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1333687",
      "name": "Dhanush",
      "character": "Tamizh"
    },
    {
      "id": "nm3606487",
      "name": "Samantha Ruth Prabhu",
      "character": "Yamuna"
    },
    {
      "id": "nm3367112",
      "name": "Amy Jackson",
      "character": "Hema DSouza"
    },
    {
      "id": "nm0433893",
      "name": "K.S. Ravikumar",
      "character": "Vijay Raghavan"
    },
    {
      "id": "nm0704654",
      "name": "Radhika Sarathkumar",
      "character": "Tamizh's Mother"
    },
    {
      "id": "nm0663967",
      "name": "Seetha",
      "character": "Tamizh's Aunt       (as Seetha Parthiban)"
    },
    {
      "id": "nm3951906",
      "name": "Sathish",
      "character": "Kumaran"
    },
    {
      "id": "nm1957308",
      "name": "V. Jayaprakash",
      "character": "Prakash Kumar"
    },
    {
      "id": "nm7802204",
      "name": "Adith Arun",
      "character": "Aravind"
    },
    {
      "id": "nm2132667",
      "name": "M.S. Bhaskar",
      "character": "Prakash Kumar's Assistant"
    },
    {
      "id": "nm8287435",
      "name": "Arjun",
      "character": "Achu"
    }
  ],
  "overview": "The happiness of Tamizh and his middle-class family is shattered when his dad commits suicide. The youngster tries to understand why his father took this extreme step and clear his name.",
  "storyline": "Thamizh's love that develops gradually, damaging relationship with his cousin in the process, gets torn around the lovers' conflicting ideas of where his family fits in their nucleus of life. The lover gets married to the estranged cousin, Thamizh gets a wife he considers he is blessed to have had and just when things appear to be settling down, a devastating turn of events shakes his family apart. In his quest for reason, he learns his cousin had something to do with it and teaches the ones involved a 'costly' lesson.",
  "plot": "This section's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (September 2016) (Learn how and when to remove this template message)\nThe film opens with Tamizh (Dhanush), his wife Yamuna (Samantha Ruth Prabhu) and his mother (Raadhika Sarathkumar) moving into a new home which is not very comfortable. Tamizh leaves them with his friend Kumaran (Sathish) after settling them in the new house in search of a job. All the companies are pleased with his resume but are hesitant to give him a job due to the occurrences in his past job. Finally, out of need, Tamizh becomes a worker in a roadside biriyani shop. He comes home for the night after he gets drunk. He then narrates the reason for him becoming like this through a series of flashbacks.\n\nDuring his college days, Tamizh (a second year B. Com student), Kumaran, and Tamizh's cousin Aravind (Adith Arun) were inseparable friends. One day, Tamizh's mother tells him to go to the temple for a pooja. There he meets Hema (Amy Jackson), who is an architecture student, and immediately falls in love with her. He then follows her around and wins her heart and they both fall in love. For their first anniversary, Tamizh, Hema, Kumaran and Hema's friend Revathi go to Darjeeling. Tamizh was doing all this without the knowledge of his father and Aravind, for which Tamizh feels guilty. He decides that he will tell them both the truth once he goes back to Chennai. But in Darjeeling he is faced by Aravind, who followed him to see what he was up to and make him feel guilty. Aravind says he never wants to see Tamizh again and storms off. Then they both go to the rooms and Hema gives Tamizh a plan of their future house. Tamizh sees that there is no room for his parents in their new house. He asks Hema about this and she says they will not be staying with them. This infuriates Tamizh and they both fight, eventually leading to their breakup.\n\nThey both move on with their own lives. Tamizh joins the same Income tax office as his father and Hema gets married to Aravind. Tamizh also accepts to get married and marries Yamuna. He is deeply in love with Yamuna and forgets Hema, leaving her to be Aravind's wife. One day Tamizh's father returns home tense and shouts at his wife. The next morning, when Yamuna opens the bathroom door, it is found that Tamizh's father has hung himself. Everybody says that he stole a file from his office and calls him a thief. Tamizh is also suspended without pay and eventually asked to vacate their house by the landlord. First they go to Yamuna's place. But Yamuna's parents treat Tamizh poorly, so she suggests they go to a new home.\n\nIn the present Tamizh tries to gather information regarding his father in vain. At last, a close friend of his father sees Tamizh and says that his father once mentioned a bag of money. So Tamizh goes to see his boss Prakash Kumar (Jayaprakash), who tells him that he gave his father 5 crore rupees to safeguard as there was a raid in his house, and that when asked to return it he said he forgot where he kept them. Prakash Kumar thinks that he stole the money and takes an important file and threatens Tamizh's father to return the money to get the file. Tamizh remembers his father once arguing with Aravind, so he goes to see him about the money. Aravind denies any such thing. Later, Hema confronts Aravind about the money and in a drunk state he tells her that he took the money for his business and that he was about to return it once he was settled but Tamizh's father had unexpectedly committed suicide before that. Hema meets Yamuna in the temple and tells her the truth behind the money. So Tamizh visits Aravind's house when he is out and searches his house, where he finds agreement papers for a certain builders. Tamizh goes to that builders which was under construction as one of Aravind's men, collects details about the place, date and time of the deal closure, and convinces the dealer this year to be he has changed the time to 9 o'clock instead of 7. At 7, Tamizh goes to the place of making the deal where Aravind arrives with one crore of the money. Tamizh takes the money with him.\n\nThat night some people come to Tamizh's house to steal the money, but Tamizh wards them off. The next day, Tamizh gets informed by an anonymous caller about an income tax raid at his house. Tamizh gives the money to Kumaran to safeguard it who is intercepted by Aravind and takes back the money. Tamizh finds out the call list of Aravind and finds a number frequently called by Aravind. He find the address of the owner and finds that he has the other 4 crore to turn it into white. He beats him up and takes the money back. Aravind finds out about this and tries to safeguard the rest, becoming a mental patient in the process. He finally give the money back to Tamizh asking for his forgiveness. Tamizh goes to Prakash Kumar and says that he got the money and that he will give it to him to get his job and the file back. But Prakash Kumar reveals that he sold the file for fifty crores and that Tamizh take the 5 crore and close this issue. But Tamizh doesn't want it and tells him to accept his mistake. So Prakash Kumar sends some goons to finish Tamizh off when he was coming with his wife Yamuna, who is now pregnant, but he fights back. He later calls Prakash Kumar and tell him to see the news where his assistant (M. S. Bhaskar) is revealing that Prakash's corrupt activities. Tamizh then tells him that he gave his assistant the 5 crore to confess. Prakash Kumar is arrested while Yamuna gives birth to a baby boy. The film ends showing a happy Tamizh leaving for a job.",
  "synopsis": null
}