{
  "imdb_id": "tt5198842",
  "tmdb_id": "417964",
  "douban_id": null,
  "title": "Le Voyageur (2016)",
  "genres": [
    "Drama",
    "Fantasy",
    "Mystery"
  ],
  "country": "Switzerland",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm4497243",
      "name": "Timo von Gunten"
    }
  ],
  "writer": [
    {
      "id": "nm0237266",
      "name": "Julie Dray",
      "description": "co-writer"
    },
    {
      "id": "nm0874834",
      "name": "Gilles Tschudi",
      "description": "co-writer"
    },
    {
      "id": "nm4497243",
      "name": "Timo von Gunten",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0237266",
      "name": "Julie Dray",
      "character": ""
    },
    {
      "id": "nm7629665",
      "name": "Dobromir Tonchew",
      "character": ""
    },
    {
      "id": "nm0874834",
      "name": "Gilles Tschudi",
      "character": ""
    }
  ],
  "overview": "Triggered by the mysterious phenomenon of the space probe ‘Voyageur’ returning to earth, Virginie meets her dead father on a train one night. She sets off with him on a metaphysical journey through Bulgaria, where her long-forgotten grief catches up with her. The young woman is confronted with feelings of transience, eternity and loss, brought on by the resurrection of her father.",
  "storyline": "Triggered by the mysterious phenomena of the Voyageur spacecraft returning to Earth, Virginia discovers her deceased father on a night train. With him she undertakes a metaphysical journey through the land of Bulgaria, revealing an event in the past where her greatest grief had always been ignored. Virginia is confronted with the awakened corpse of her father in a dramatic and playful manner, bringing back the themes of transience, eternity and loss. As her father regains joy feeling alive, he conducts a musical masterpiece recorded on the Voyager's golden record, recreating for Virginia the bridge between life and death.",
  "plot": null,
  "synopsis": null
}