{
  "imdb_id": "tt5129818",
  "tmdb_id": "369769",
  "douban_id": null,
  "title": "Under the Sun (2015)",
  "genres": [
    "Documentary"
  ],
  "country": "Czech Republic",
  "version": [
    {
      "runtime": "106 min",
      "description": ""
    },
    {
      "runtime": "106 min",
      "description": "original"
    }
  ],
  "imdb_rating": 7.5,
  "director": [
    {
      "id": "nm0543882",
      "name": "Vitaliy Manskiy"
    }
  ],
  "writer": [
    {
      "id": "nm0543882",
      "name": "Vitaliy Manskiy",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm8223579",
      "name": "Lee Zin-Mi",
      "character": "Herself"
    },
    {
      "id": "nm8223580",
      "name": "Yu-Yong",
      "character": "Herself, Zin-Min's schoolmate"
    },
    {
      "id": "nm8223581",
      "name": "Hye-Yong",
      "character": "Herself, Zin-Min's schoolmate"
    },
    {
      "id": "nm8223582",
      "name": "Oh-Gyong",
      "character": "Herself, Zin-Min's schoolmate"
    },
    {
      "id": "nm8223584",
      "name": "Choi Song-min",
      "character": "Herself"
    },
    {
      "id": "nm8223583",
      "name": "Lim Soo-Yong",
      "character": "Herself"
    },
    {
      "id": "nm8223585",
      "name": "Su-Yong",
      "character": "Herself"
    }
  ],
  "overview": "Over the course of one year, this film follows the life of an ordinary Pyongyang family whose daughter was chosen to take part in one of the famous Korean \"Spartakiads\". The ritualized explosions of color and joy contrast sharply with pale everyday reality, which is not particularly terrible, but rather quite surreal, like a typical life as seen \"through the looking glass\".",
  "storyline": "Over the course of one year, this film follows the life of an ordinary Pyongyang family whose daughter was chosen to take part in one of the famous Korean \"Spartakiads\". The ritualized explosions of color and joy contrast sharply with pale everyday reality, which is not particularly terrible, but rather quite surreal, like a typical life as seen \"through the looking glass\".",
  "plot": "A hiker finds a dead woman on the Yorkshire moors; the victim, who has been strangled, is identified as Alice Ruber. Shortly afterwards, Belgian detective Hercule Poirot (Peter Ustinov) examines a diamond belonging to millionaire industrialist Sir Horace Blatt (Colin Blakely), and declares it a fake. Assured that Sir Horace gave a real diamond to his mistress and she later returned the fake to him, Poirot accompanies Sir Horace to confront her at an exclusive island resort. The hotel is the former summer palace of the reigning King of Tyrania, now owned by Daphne Castle (Maggie Smith), who had received the palace \"for services rendered\".\n\nSir Horace's former mistress is actress Arlena Stuart Marshall (Diana Rigg), who is on holiday with her husband Kenneth (Denis Quilley). Arlena is emotionally abusive to her stepdaughter, Linda (Emily Hone), and flirts with handsome young Patrick Redfern (Nicholas Clay), who is himself married to the meek Christine (Jane Birkin). Patrick is on the island only because Arlena arranged it. Kenneth turns to his old friend, Daphne, who reviles the way that Arlena treats both him and Linda. Arlena has also caused financial problems for Odell and Myra Gardener (James Mason and Sylvia Miles) by walking out of a major play, and refusing another. Writer Rex Brewster (Roddy McDowall) has already spent the royalties advanced to him for a tell-all biography of Arlena. Early one morning, Arlena takes a paddle-boat to Ladder Bay. Patrick and Myra go for a boat trip around the island and see a body lying motionless on the beach. Patrick approaches the body and recognizes Arlena, announcing that she has been strangled. Poirot must determine which of his eight fellow guests—or Daphne—is the murderer.\n\nDaphne had heard Kenneth in his room typing at the time of the murder, and Christine was with Linda at Gull Cove and did not leave until 11:55 for a 12:30 tennis match. Sir Horace argued with Arlena about the diamond at Ladder Bay at 11:30, which is confirmed by his yacht crew and by Daphne. Arlena kept the diamond, promising an explanation that evening, and Poirot finds the jewel nearby in a grotto. Patrick left at 11:30 with Myra, seeing Sir Horace's yacht coming, and hearing the noon cannon. Rex met Linda entering Gull Cove at 12:00, and reports that a bottle flung from the top of a cliff nearly hit him. Odell was seen reading by Daphne and her staff. He claims low water pressure hindered his 12:15 wash before tennis, but nobody admits to bathing at that time.\n\nAssembling the suspects together, Poirot accuses Christine and Patrick of the crime: Christine knocked out Arlena and hid her in the nearby grotto, and Patrick strangled the helpless Arlena later. Christine posed as Arlena with self-tanning lotion, Arlena's swimsuit and large red hat, to be mis-identified by Patrick. But Poirot had smelled Arlena's perfume in the grotto. Christine set Linda's watch twenty minutes fast, suggested a swim cap to muffle the noon cannon, and corrected the watch afterward. She tossed out the lotion bottle, almost hitting Rex, and bathed off her tan, thus depriving the leaky hotel water system of pressure. Poirot suspects that Patrick switched Sir Horace's jewel with a paste one, and that Patrick and Christine killed Arlena to protect the theft. The Redferns scoff at the detective's accusations, as he has no real proof.\n\nOn leaving the hotel, Patrick pays by cheque, signing the \"R\" in \"Redfern\" in a distinctive way that Poirot recognizes as the same way \"Felix Ruber\", husband of the Yorkshire moor victim, signed his name. The hiker that found the body had been Christine, establishing Patrick's alibi. Poirot knows photos from the British police will show Patrick and Felix to be the same person. Patrick puts a pipe in his mouth that has never been lit during his stay; Poirot empties the pipe bowl to reveal the diamond.",
  "synopsis": null
}