{
  "imdb_id": "tt5151716",
  "tmdb_id": "376426",
  "douban_id": null,
  "title": "Tony Robbins: I Am Not Your Guru (2016)",
  "genres": [
    "Documentary"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "115 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm0075666",
      "name": "Joe Berlinger"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm3316617",
      "name": "Sage Bonnie Humphrey",
      "character": "Herself"
    },
    {
      "id": "nm10515148",
      "name": "Steven Kronick",
      "character": "Steven Kronick"
    },
    {
      "id": "nm0730288",
      "name": "Anthony Robbins",
      "character": "Himself       (as Tony Robbins)"
    },
    {
      "id": "nm8327026",
      "name": "Dawn Watson",
      "character": "Herself"
    }
  ],
  "overview": "Granted unprecedented access, Berlinger captures renowned life and business strategist Tony Robbins behind the scenes of his mega seminar Date with Destiny, pulling back the curtain on this life-altering and controversial event, the zealous participants and the man himself.",
  "storyline": "TONY ROBBINS: I AM NOT YOUR GURU, a feature documentary film about internationally renowned life and business strategist Tony Robbins, is a revelatory cinéma vérité film that goes behind the scenes of his mammoth seminar \"Date With Destiny,\" attended by over 2,500 people in Boca Raton, Florida, each year, to give an insider look at how one man can affect millions. Granted never before seen access to the behind the scenes modus operandi of this enormous event, this film captures both the immense effort of producing this live seminar, as well as the life-changing transformations of the participants in real time. Embedding with Tony Robbins and his team over the course of six days, Academy Award nominated filmmaker Joe Berlinger turns an unflinching eye on Tony Robbins' powerful and uncompromising approach to achieving success, ensuring the attendees leave \"Date With Destiny\" with new perspective on the forces, thoughts, and feelings that motivate their behavior and help them take ...",
  "plot": null,
  "synopsis": null
}