{
  "imdb_id": "tt5182856",
  "tmdb_id": "392795",
  "douban_id": null,
  "title": "Harmonium (2016)",
  "genres": [
    "Drama"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "120 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm3640621",
      "name": "Kôji Fukada"
    }
  ],
  "writer": [
    {
      "id": "nm3640621",
      "name": "Kôji Fukada",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0038355",
      "name": "Tadanobu Asano",
      "character": "Yasaka"
    },
    {
      "id": "nm1353095",
      "name": "Mariko Tsutsui",
      "character": "Akié"
    },
    {
      "id": "nm2665929",
      "name": "Taiga",
      "character": "Takashi Yamakami"
    },
    {
      "id": "nm5840275",
      "name": "Momone Shinokawa",
      "character": "Hotaru"
    },
    {
      "id": "nm8161303",
      "name": "Kana Mahiro",
      "character": "Hotaru (Adult)"
    },
    {
      "id": "nm3627424",
      "name": "Takahiro Miura",
      "character": "Atsushi Shitara"
    },
    {
      "id": "nm1967617",
      "name": "Kanji Furutachi",
      "character": "Toshio"
    }
  ],
  "overview": "Toshio hires Yasaka to work in his workshop. But then this old acquaintance, who has just been released from prison, begins to meddle in Toshio’s family life…",
  "storyline": "A family of three, comprised of a husband, wife and a young daughter, lead a routine and unspectacular life. The stillness is shattered occasionally by the young girl's practice on the harmonium and more unusually by the arrival of an acquaintance of the man. Apparently seeking to repay a debt and make up for lost time the new arrival is soon both a guest at the family home and an employee of their workshop. All hell breaks loose and no one is chaste.",
  "plot": "Toshio (Furutachi), his wife Akie (Tsutsui), and their daughter Hotaru (Shinokawa) live a banal existence. Toshio operates a machine shop in his garage when suddenly an old acquintance of Toshio's, Yasaka (Asano) arrives to help out at the shop. Hotaru practices the harmonium but is obviously a novice. Yasaka had just been released from prison and so without a permanent place to say, Toshio takes Yasaka in as an assistant. Yasaka bonds with Hotaru, helping her with her music, and being helpful around the shop and house. Yasaka reveals to Akie that he was imprisoned for eleven years as a result of murder, asks for forgiveness for not mentioning this earlier, and slowly Yasaka becomes a greater part of the family. Yasaka and Akie have some romantic feelings for each other, and Toshio becomes suspicious as the family goes on a river trip. The movie also reveals that Yasaka is bitter about taking the blame for the murder, which Toshio participated in.\n\nLater when they return, when Toshio is out of the house, Yasaka oversteps his bounds with Akie and tries to rape her. Having failed to do so, he sees Hotaru at the park and also attempts to sexually assault her, leaving her quadriplegic and nonverbal. Yasaka then disappears. Eight years later, Toshio hires a new assistant, Takashi (Taiga). Takashi was raised by a single mother and takes some interest in the now disabled Hotaru, sketching her. Akie has become extremely protective of her daughter. Takashi reveals separately to Toshio and Akie that he is the illegitimate son of Yasaka, that Yasaka was a member of the yakuza, and that he wanted to be employed by Toshio based on letters Yasaka sent to his mother before he disappeared. After Takashi stands too close to Hotaru, Akie kicks him out of the house. Akie confronts Toshio about his involvement in the murder. Later, Toshio receives a tip on the location of Yasaka, and Akie and Toshio take Takashi to kill his father in front of him. Takashi offers himself instead, which is rejected by the pair. The tip is only of someone who looks similar to Yasaka and having reached her breaking point, Akie takes Hotaru to a bridge, where she jumps and survives. The film ends with Toshio trying to resuscitate Hotaru.",
  "synopsis": null
}