{
  "imdb_id": "tt5151200",
  "tmdb_id": "366921",
  "douban_id": null,
  "title": "The Trick with the Gun (2015)",
  "genres": [
    "Documentary"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "89 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm0573710",
      "name": "Michael McNamara"
    }
  ],
  "writer": [
    {
      "id": "nm1246398",
      "name": "Christopher Gudgeon",
      "description": null
    },
    {
      "id": "nm3824565",
      "name": "Scott Hammell",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1756007",
      "name": "Charlie Gudgeon",
      "character": "Himself"
    },
    {
      "id": "nm8253166",
      "name": "Tavish Gudgeon",
      "character": "Himself"
    }
  ],
  "overview": "The Bullet Catch:  It's the most dangerous illusion in magic. Fourteen men and women have died performing it. In The Trick With the Gun, magician Scott Hammell and author Chris Gudgeon set out to perform their own version of the deadly trick, and get more than they bargained for.  What begins as an exploration of the hidden world of magic ends as a study of a friendship falling apart.  It's a story about risk, relationships and the delicate dance between reality and illusion  . . .  and how everything changes when you're staring down the barrel of a gun.  Featuring interviews and performances from Penn &amp; Teller, Bill Kalush, Carl Skenes, Hans Morretti, George Schindler, and many others.",
  "storyline": "Two men attempt their own version of magic's deadliest trick and discover how much changes when you're staring down the barrel of a gun, in this exploration of risk, relationships and the delicate dance between reality and illusion.",
  "plot": null,
  "synopsis": "Will two friends risk their lives and friendship for the sake of a magic trick?It's the most dangerous illusion in magic: the Bullet Catch. Fourteen men and women have died performing it. In The Trick With the Gun, a feature documentary, author Chris Gudgeon and magician Scott Hammell set out to perform their own version of the deadly trick . . . but wind up getting more than they bargained for. What starts off as an exploration of the hidden world of magic and magicians becomes a study of a friendship falling apart. It's a story about risk, relationships and the delicate dance between reality and illusion . . . and how everything changes when you're staring down the barrel of a gun."
}