{
  "imdb_id": "tt5173166",
  "tmdb_id": "366568",
  "douban_id": null,
  "title": "Four Against the Bank (2016)",
  "genres": [
    "Comedy",
    "Crime"
  ],
  "country": "Germany",
  "version": [
    {
      "runtime": "96 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.1,
  "director": [
    {
      "id": "nm0000583",
      "name": "Wolfgang Petersen"
    }
  ],
  "writer": [
    {
      "id": "nm2945690",
      "name": "Tripper Clancy",
      "description": "screenplay"
    },
    {
      "id": "nm0540598",
      "name": "Ralph Maloney",
      "description": "novel"
    }
  ],
  "cast": [
    {
      "id": "nm0001709",
      "name": "Til Schweiger",
      "character": "Chris"
    },
    {
      "id": "nm0777788",
      "name": "Matthias Schweighöfer",
      "character": "Max"
    },
    {
      "id": "nm0509583",
      "name": "Jan Josef Liefers",
      "character": "Peter"
    },
    {
      "id": "nm0378660",
      "name": "Michael Herbig",
      "character": "Tobias"
    },
    {
      "id": "nm1662644",
      "name": "Antje Traue",
      "character": "Elisabeth Zollner"
    },
    {
      "id": "nm0487884",
      "name": "Alexandra Maria Lara",
      "character": "Freddie"
    },
    {
      "id": "nm0374610",
      "name": "Thomas Heinze",
      "character": "Schumacher"
    },
    {
      "id": "nm0657822",
      "name": "Jana Pallaske",
      "character": "Heidi"
    },
    {
      "id": "nm0585098",
      "name": "Claudia Michelsen",
      "character": "Susanne Schumacher"
    },
    {
      "id": "nm4676589",
      "name": "Tamer Tirasoglu",
      "character": "Rolfi"
    },
    {
      "id": "nm0553326",
      "name": "Sven Martinek",
      "character": "Twiggy"
    },
    {
      "id": "nm1689177",
      "name": "Fahri Yardim",
      "character": "Obdachloser"
    },
    {
      "id": "nm1213137",
      "name": "Leopold Hornung",
      "character": "Zollner's Assistance"
    },
    {
      "id": "nm0319760",
      "name": "Thomas Gimbel",
      "character": "Ralf Niester"
    },
    {
      "id": "nm0778353",
      "name": "Bernhard Schütz",
      "character": ""
    },
    {
      "id": "nm0778216",
      "name": "Swetlana Schönfeld",
      "character": ""
    },
    {
      "id": "nm0036774",
      "name": "Hendrik Arnst",
      "character": ""
    },
    {
      "id": "nm3152518",
      "name": "Firat Arslan",
      "character": ""
    },
    {
      "id": "nm0065589",
      "name": "Stefan Becker",
      "character": "Jesus Freak"
    },
    {
      "id": "nm8361960",
      "name": "Viktor Bleischwitz",
      "character": "Bankräuber"
    },
    {
      "id": "nm9463313",
      "name": "Guido Böhm",
      "character": "TV reporter"
    },
    {
      "id": "nm0130600",
      "name": "Manfred Callsen",
      "character": "Werbeagenturchef"
    },
    {
      "id": "nm6320100",
      "name": "Fredderik Collins",
      "character": "Alex"
    },
    {
      "id": "nm0226284",
      "name": "Stefan Dietrich",
      "character": "Tankwart"
    },
    {
      "id": "nm0307191",
      "name": "Christoph Gareisen",
      "character": "Bankkunde"
    },
    {
      "id": "nm0475354",
      "name": "Janine Kunze",
      "character": "Bankkundin"
    },
    {
      "id": "nm6698506",
      "name": "Monique Lange",
      "character": "Polizistin"
    },
    {
      "id": "nm3036927",
      "name": "Jasmin Lord",
      "character": "Sexy Mädchen"
    },
    {
      "id": "nm10448434",
      "name": "Adam Sandhu",
      "character": "Zivilpolizist"
    },
    {
      "id": "nm4198580",
      "name": "David Schütter",
      "character": ""
    },
    {
      "id": "nm1258499",
      "name": "Axel Sichrovsky",
      "character": "Polizist"
    },
    {
      "id": "nm6363181",
      "name": "Chris Theisinger",
      "character": "Bankangestellter"
    }
  ],
  "overview": "Upcoming Wolfgang Petersen movie. It's going to be a remake of his own 1974 crime comedy. Release is planned for late 2016.",
  "storyline": "Four men, betrayed by the bank, unite to take revenge.",
  "plot": "While driving at night along the northern California coast, architect Dan Merrick (Tom Berenger) and wife Judith (Greta Scacchi) are involved in a car wreck. Dan suffers major injuries and brain trauma, resulting in psychogenic amnesia. After extensive plastic surgery, Dan returns home in Judith's care.\n\nDan relies on those close to him to help him restore his past, including his business partner Jeb Scott (Corbin Bernsen) and Jeb's wife, Jenny (Joanne Whalley-Kilmer). Dan has frequent flashbacks he believes to be events that led up to the car crash.\n\nDan finds discrepancies in the stories about his former self. He stumbles upon photographs of Judith sleeping with another man. Dan finds an expensive bill to a pet store and follows up with its proprietor, Gus Klein (Bob Hoskins). Gus says the payment was for services provided as a private investigator to follow Judith, and it revealed she was cheating with Jack Stanton (Scott Getlin).\n\nJudith arranges a meeting with Stanton and Dan follows her. Judith stops at an old shipwreck slated for removal by Dan's company. Assuming the wreck is a key in remembering his past, Dan has its removal postponed.\n\nJeb's wife Jenny accuses Judith of planning the accident to eliminate Dan. As he works with Gus to keep tabs on his wife with a wiretap, Dan tails her to a hotel where she and Stanton are to meet, but Stanton leaves and a chase ensues through a wooded area. After gunshots are fired from Stanton's car, Dan and Gus crash while Stanton escapes.\n\nThat night at home, Dan arms himself and lies in wait. At gunpoint, an intruder is revealed as Judith disguised as Stanton. She explains that Stanton is actually dead, killed by Dan on the night of the accident. Judith had intended to stop the affair with Stanton. Judith says she and Dan covered up the murder by disposing of Stanton's body in the shipwreck. When Dan reveals he postponed the ship's removal, Judith becomes hysterical and suggests they should flee.\n\nDan receives a phone call from Jenny imploring him to see her, but Dan finds Jenny dead. He is confronted at gunpoint by Gus, who thinks Dan must have murdered Stanton. Pleading for his life, Dan convinces Gus to visit the shipwreck, where they find a chemical storage container. Dan dredges up a body of a man who looks exactly like himself. Dan realizes he is not Dan Merrick; he is Jack Stanton.\n\nAn abusive Dan confronted his wife Judith with evidence of her infidelity. She called for help and Jack raced to her home, arriving too late to prevent her from shooting her husband. Jack wanted to go to the police, but Judith convinced him to cover up the murder and hide Dan's body. After doing so, Jack told Judith he wanted out of the relationship. This angered and distracted Judith, who drove into the car wreck.\n\nJudith had banked on the chemical dissolving Dan's body, but because it was actually Formaldehyde, she had preserved it. Gus is shot by Judith, who forces Jack to leave with her. She drives erratically down the same stretch of road from the night of the accident.\n\nShe hid the facts from Jack so he'd have plausible deniability. After the crash, plastic surgeons assumed the man she was with was her husband Dan. Distracted by a police helicopter, Judith loses control of the gun. Judith decides to kill them in a murder-suicide car crash. Jack rolls out, while she plummets to her death.\n\nThe police helicopter lands, and an injured Gus Klein emerges. The two board the helicopter and fly away, as Judith and her car burn at the bottom of the cliff.",
  "synopsis": null
}