{
  "imdb_id": "tt5298206",
  "tmdb_id": "400365",
  "douban_id": null,
  "title": "Bol Baby Bol (2014)",
  "genres": [
    "Comedy"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "135 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm3436116",
      "name": "Vinay Laad"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm1778107",
      "name": "Makarand Anaspure",
      "character": "Nandu"
    },
    {
      "id": "nm0045119",
      "name": "Aruna Irani",
      "character": "Aai"
    },
    {
      "id": "nm1667476",
      "name": "Neha Pendse",
      "character": "Sonali"
    },
    {
      "id": "nm1798561",
      "name": "Aniket Vishwasrao",
      "character": "Rahul"
    }
  ],
  "overview": "When Durgadevi's nephew tells her that her son has been blessed with a baby, she leaves behind all grudges and comes to meet him.",
  "storyline": null,
  "plot": "The film starts by showing the protagonist, Zainab (Humaima Malick), about to be hanged. She tells her story to media right before this happens. She grew up with six sisters, a mother and a father. The father always wanted a son so that the son could help with the financial issues of the family; the father doesn't believe in women being gainfully employed. They have a transgender child (khawajah sara in Urdu) named Syed Saifullah Khan or Saifi (Amr Kashmiri). The father (Hakim) doesn't like Saifi since he is transgender. Saifi is deeply loved by the rest of her family. Zainab is married to a guy who keeps harassing her for not giving birth. Hence, she comes back to her father's house. Zainab's mom keeps having babies that are born dead. Zainab arranges a tubal ligation for her. When Hakim (Manzar Sehbai) finds out, he becomes very angry.\n\nOne day, Zainab sees Saifi dressed in women's clothes and gets very disturbed. Hakim owns a small traditional pharmacy and is approached by a man who asks him to teach The Quran to children, since Hakim is a very religious man who has bonds with the mosque. Hakim initially refuses because the man, Saqa (Ishaq), is running a brothel. Meanwhile, the mosque gives him some money to keep, since they believe him to be trustworthy. Mustafa (Atif Aslam), a neighbour, gets Saifi a job at a place where they paint trucks. There, Saifi is harassed because others discriminate against her identification.\n\nOne day Saifi is raped. Another transgender person, (played by Almas Bobby – who in real life is a transgender person), finds her and takes her home. Hakim overhears Saifi telling her mother and Zainab what happened. Later on, when everybody is asleep, Hakim suffocates Saifi to death with a plastic bag. He must bribe the police officer to keep it a secret with two lakhs. Hakim is forced to take money out of the masjid funds. The masjid asks for the funds, and Hakim doesn't have enough money. He is forced to go to the Saqa's house to get it.\n\nTeaching children The Quran isn't giving him enough money, so Saqa gives him another option: Hakim must marry and have a baby with Meena (Iman Ali) who is one of the prostitutes and is Saqa's (Shafqat Cheema) oldest daughter. Hakim keeps having girls, and Saqa tells him that it is the men who creates the gender. Meanwhile, Zainab gets Ayesha (Mahira Khan) and Mustafa married since Hakim found another man at the masjid and wanted to get Ayesha married to that man. Simultaneously, Hakim marries Meena. When Hakim finds out about Ayesha's marriage, he is furious but can't do anything about it. Meena has her baby, and it is a girl meaning Saqa gets to keep it. Hakim begs Meena to give him the baby so that the child doesn't have to face a horrible future. Saqa overhears and kicks Hakim out.\n\nLater on, Meena comes to give Hakim's family the baby. When Hakim's wife asks who that women was, he takes the baby and tells her that he married her. She screams at him, and he beats her up. The mother tells the kids what happened, and Zainab insists they all leave the house and move somewhere else to start a new life.\n\nAt night, Saqa comes to take Meena's daughter, since Meena was not supposed to give it to Hakim. Hakim tries to kill the daughter to keep her from a horrible future. He is killed by Zainab with a fatal knock on the head. They hide the baby. Zainab tells Saqa that Hakim killed the baby and threw her out somewhere; she tells him that she killed Hakim, which is why she is being given the death penalty.\n\nBack in the present, a reporter keeps trying to prove that she is innocent but is unable to. Zainab ends by asking that why is only killing a sin? Why isn't giving birth, without any family planning, a sin? Then she is hanged. The President (Rashid Khawaja) sees the reporter's newscast that ends with that question and schedules a meeting with the topic as the same as the question. In the end, the rest of the daughters open up a restaurant called Zainab's Cafe, which becomes very successful. They also raise their new half-sister, Meena's daughter.",
  "synopsis": null
}