{
  "imdb_id": "tt5235880",
  "tmdb_id": "396643",
  "douban_id": null,
  "title": "A Flying Jatt (2016)",
  "genres": [
    "Action",
    "Adventure",
    "Comedy",
    "Drama",
    "Sci-Fi"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "151 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.6,
  "director": [
    {
      "id": "nm1150656",
      "name": "Remo"
    }
  ],
  "writer": [
    {
      "id": "nm1150656",
      "name": "Remo",
      "description": "story"
    },
    {
      "id": "nm1571874",
      "name": "Tushar Hiranandani",
      "description": "screenplay &"
    },
    {
      "id": "nm1150656",
      "name": "Remo",
      "description": "screenplay"
    },
    {
      "id": "nm2022237",
      "name": "Aakash Kaushik",
      "description": "dialogue &"
    },
    {
      "id": "nm8257911",
      "name": "Madhur Sharma",
      "description": "dialogue"
    }
  ],
  "cast": [
    {
      "id": "nm5899377",
      "name": "Tiger Shroff",
      "character": "Flying Jatt"
    },
    {
      "id": "nm2596365",
      "name": "Jacqueline Fernandez",
      "character": "Kirti"
    },
    {
      "id": "nm0428923",
      "name": "Nathan Jones",
      "character": "Raka"
    },
    {
      "id": "nm1946407",
      "name": "Kay Kay Menon",
      "character": "Malhotra"
    },
    {
      "id": "nm6661286",
      "name": "Mukesh Hariawala",
      "character": ""
    },
    {
      "id": "nm0802080",
      "name": "Amrita Singh",
      "character": "Bebe"
    },
    {
      "id": "nm6634887",
      "name": "Gaurav Pandey",
      "character": "Rohit"
    },
    {
      "id": "nm3601766",
      "name": "Shraddha Kapoor",
      "character": "Herself"
    },
    {
      "id": "nm3629670",
      "name": "Amrita Puri",
      "character": ""
    },
    {
      "id": "nm3575688",
      "name": "Pawan Jam",
      "character": "Rapist"
    },
    {
      "id": "nm6618099",
      "name": "Vakil Khan",
      "character": "Rana's Son"
    }
  ],
  "overview": "Jatt is a reluctant super hero that fights crime and protects people. He meets his match in the evil Raka who he must face off to save the day.",
  "storyline": "Malhotra wants to acquire a land of Sikh colony for his factory which is owned by Mrs Dhillon known as Bebe however Bebe is in no mood to sell the land to him it also has a tree which is considered holy by the everyone.Malhotra threatens Bebe 's son Aman that her life would be in danger if she doesn't sell the land to him,Malhotra sends Raka to cut the tree.On a stormy night Aman sits near the holy tree praying for his mother he notices that Raka is cutting the tree a fight occurs between them after being beaten by Raka,Aman gets holy powers from the tree and fights back soon Aman turns a superhero known as Flying Jat who helps people in need whereas Raka turns into a toxic Monster who wants to pollute the environment.",
  "plot": "This section may require copy editing. (September 2016)\nThe story begins with a strong influential businessman Mr. Malhotra (Kay Kay Menon) who has his factory on a land near a lake into which pollutants and toxins are leaked. He wants to build a bridge across it for faster transportation but cannot do so due to a sacred tree present on the other side of the lake on a piece of land which belongs to Mrs. Dhillon.\n\nMrs. Dhillon is a hard core Punjabi woman living with her two sons Aman Dhillon (Tiger Shroff) and Rohit Dhillon (Gaurav Pandey). Aman is a martial arts teacher in a school. He has a crush on Kirti (Jacqueline Fernandez).\n\nMalhotra who wants to get rid of the tree brings in Raka (Nathan Jones), a mutant, to get the job done.\n\nHe reaches the spot but Aman is present there and tries to stop Raka. Raka sticks Aman against the tree and tries to kill him. He does not notice that Aman has got a certain glow emanating from his body after hitting the tree. Raka tries to insert the saw blade into his neck but as soon as it touches the skin, a sudden thunderstorm hits the tree. The impact throws back Raka and he lands in Malhotra's factory's garbage area.\n\nNext morning Aman finds himself on his bed alive with no sign of any injury and presumes all that happened to be a dream. He does not notice the khanda that has appeared on his back, which is also carved on the tree. That day, he and his brother notice a few unusual things such as easily catching fast balls from a bowling machine, learning new stuff quickly by just touching items, etc. Later his mother also confirms this by hitting Aman various times with a sharp knife and all wounds are healed within seconds, confirming he gained access to a rapidly advanced healing factor. She immediately declares him a super hero.\n\nShe then goes so far as to remove Aman's fear of heights by showing him several superhero films from both Marvel and DC, and even tells him the story of his father Sardar Kartar Singh Dhillon, a Sikh who went to Shaolin to learn martial arts and was named \"Flying Jatt\". She asks Aman to take up the legacy of his father and keep \"Flying Jatt\" as his superhero name to which he agrees. Initially various events takes place like flying low due to his fear of heights, misunderstandings due to his costume, but he is recognised when he saved hostages from a terrorist attack at an airport. He even proposes to Kirti in the process and reveals his identity.\n\nRaka, who had been missing all this while, is found alive but is now stronger and more dangerous than before because he has more toxins deposited in his body and started growing stronger with increased pollution. Aman goes to battle him various times but is fatally injured. To save him from further pain, his brother Rohit goes in his place as Flying Jatt and gets killed. Not wanting to lose her other son, Mrs. Dhillon decides to leave the town.\n\nAman decides to stay, saying that he can leave the town, but the cries and sounds of pain of the people would never leave him. Aman's mother asks him to wear his father's turban, but he refuses. She then reminds him of a story of their town, in which all women were kidnapped. It was only the men of the town that had saved all of them while wearing their turbans. She said their turbans gave them power, and the power of his father would be with him if he would wear his turban. Aman then finally agrees to wear the turban and fight Raka.\n\nOn the other hand, the people who think Flying Jatt is dead decide to defeat Raka on their own and even Malhotra joins them, after his daughter is affected by the pollution. They decide to eliminate pollution by planting trees everywhere, but Raka comes to kill them once and for all, but Flying Jatt suddenly appears. Raka, in a fit of rage, drags Flying Jatt to the tree and tries to kill him when his mother comes in front and prays, giving more inspiration to Aman who gets up, and, while cutting through the clouds, takes Raka to an asteroid near Earth. He says that there is no place on Earth to defeat him, but he becomes vulnerable on the pollution free asteroid. After a long fight, Aman finally inserts his kara (steel bracelet) into Raka due to which Raka explodes. A victorious Am",
  "synopsis": null
}