{
  "imdb_id": "tt5269396",
  "tmdb_id": "367206",
  "douban_id": "21350556",
  "title": "Sword Master (2016)",
  "genres": [
    "Action",
    "Drama"
  ],
  "country": "China",
  "version": [
    {
      "runtime": "108 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.5,
  "director": [
    {
      "id": "nm0232504",
      "name": "Tung-Shing Yee"
    }
  ],
  "writer": [
    {
      "id": "nm0161159",
      "name": "Tin Nam Chun",
      "description": null
    },
    {
      "id": "nm0473325",
      "name": "Lung Ku",
      "description": "novel"
    },
    {
      "id": "nm0007139",
      "name": "Hark Tsui",
      "description": null
    },
    {
      "id": "nm0232504",
      "name": "Tung-Shing Yee",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm5341380",
      "name": "Kenny Lin",
      "character": "Hsieh Shao-Feng"
    },
    {
      "id": "nm0387363",
      "name": "Peter Ho",
      "character": "Yen Shih-San"
    },
    {
      "id": "nm2798295",
      "name": "Yiyan Jiang",
      "character": "Mu-Yung Chiu-Ti"
    },
    {
      "id": "nm3137610",
      "name": "Mengjie Jiang",
      "character": "'Princess' Hsiao Li"
    },
    {
      "id": "nm8640519",
      "name": "Moyan Chen",
      "character": "Hsieh Shao-Feng (Teen)"
    },
    {
      "id": "nm0160865",
      "name": "Norman Chu",
      "character": "(as Norman Chiu)"
    },
    {
      "id": "nm8640527",
      "name": "Yifan Hao",
      "character": ""
    },
    {
      "id": "nm8640528",
      "name": "Yifei Hao",
      "character": ""
    },
    {
      "id": "nm1504823",
      "name": "Daichi Harashima",
      "character": "Hsieh Shao-Feng (Juvenile)"
    },
    {
      "id": "nm8640523",
      "name": "Mu Hong",
      "character": "Madam Mu-Yung"
    },
    {
      "id": "nm8640518",
      "name": "Edward Ku",
      "character": "Hsieh Shao-Feng       (as Caobin Gu)"
    },
    {
      "id": "nm0473322",
      "name": "Kuan-Chung Ku",
      "character": ""
    },
    {
      "id": "nm6854530",
      "name": "Jiatong Lai",
      "character": "Nameless"
    },
    {
      "id": "nm5978705",
      "name": "Zhaoxu Lin",
      "character": ""
    },
    {
      "id": "nm0525475",
      "name": "Jamie Luk",
      "character": "Hsia Hou-Hsing"
    },
    {
      "id": "nm5350535",
      "name": "Jingjing Ma",
      "character": "Miao Tzu"
    },
    {
      "id": "nm8640522",
      "name": "Ruihan Ma",
      "character": ""
    },
    {
      "id": "nm0667978",
      "name": "Hee Ching Paw",
      "character": "Hsiao Li's mother"
    },
    {
      "id": "nm6914944",
      "name": "Kai Shen",
      "character": "Hsia Hou-Hsing"
    },
    {
      "id": "nm7862567",
      "name": "Yiren Song",
      "character": "Mu-Yung Chiu-Ti (Juvenile)"
    },
    {
      "id": "nm5941822",
      "name": "Nazeeh Tarsha",
      "character": "Additional Voices       (voice)"
    },
    {
      "id": "nm2995862",
      "name": "Nan Tie",
      "character": "Kao Tong"
    },
    {
      "id": "nm5618416",
      "name": "Mei-Ying Wang",
      "character": "Masters Apprentice"
    },
    {
      "id": "nm3552741",
      "name": "Phoebe Wang",
      "character": "(as Er Fei)"
    },
    {
      "id": "nm8640525",
      "name": "Shaodong Wei",
      "character": ""
    },
    {
      "id": "nm3971525",
      "name": "You Wu",
      "character": ""
    },
    {
      "id": "nm6915057",
      "name": "Xilai Zhang",
      "character": "Chu Yeh-Ching (Juvenile)"
    },
    {
      "id": "nm8640521",
      "name": "Ziyu Zhang",
      "character": "Mu-Yung Chiu-Ti (Teen)"
    },
    {
      "id": "nm8640524",
      "name": "Haiying Zhao",
      "character": ""
    }
  ],
  "overview": "Weary of the bloodshed and violence from the martial arts world, a powerful swordsman banishes himself to the humble life a vagrant, wandering the fringes of society. But his violent past refuses to let him go quietly. The master swordsman must regain the ability to wield his sword and fight those disrupting the peace he so desperately craves.",
  "storyline": "Hong Kong cinema giants Derek Yee (TRIPLE TAP) and Tsui Hark (YOUNG DETECTIVE DEE) join forces in this spellbinding martial arts epic about an elite swordsman who is haunted by his deadly skills, and the challenger who aims to take his place at any cost.",
  "plot": "In this beautifully shot wuxia epic, a self-taught highly skilled assassin swordsman is haunted by the destructive impact his deadly talents have and from the absence of a competent swords-person whom he can fight wanders around searching at the same time for a good location for his grave and lives the remaining of his life to the full as he is dying. The master swordsman, weary of the bloodshed and violence from the martial arts world and as a classically taught descendant of a legendary swordsman family, banishes himself to the humble life of a vagrant, wandering the fringes of society in search of real life and its simpleness absconding his will to fight. But his violent past refuses to let him go quietly. The master swordsman and the skilled assassin regain their ability to wield swords without hesitating to fight those disrupting the peace and to defeat those who desperately crave despotism. The master swordsman honors his dying ally, the assassin who sought for a worthy swordsman to fight and if fate allows to die honorably.",
  "synopsis": "The film opens with Peter Ho (as Yen Shih-San) battling a man on a bridge. To his consternation, while he is victorious the onlookers confuse him with another man called \"The 3rd Master\" (Hsieh Shao-Feng), his rival, and the shadow within which he lives. Yen Shih-San is approached by Mu-Yung Chiu-Ti (Yiyan Jiang), the heiress to a clan who has been slighted by a man. She attempts to hire Yen Shih-San to kill the man who left her at the altar, and reveals that the man also happens to be \"The 3rd Master\".\nYen Shih-San embarks on a journey to prove himself the superior sword master to be free of his shadow, journeying to the Sword Manor, the home clan of the 3rd Master, but is disappointed to learn of Hsieh Shao-Feng's death, and in the process, we learn that Yen Shih-San is sick, possibly even dying.Meanwhile, Hsieh Shao-Feng has hidden as a lowly servant in a brothel earning the nickname \"Ah Chi\", or \"Useless\". In the process of serving the ladies of the brothel, Ah Chi protects one of the girls from a customer who refuses to pay and is stabbed repeatedly with a knife, for you see the 3rd Master has become a pacifist, but in the process earns the attention of the \"Big Boss\" of the brothel. This attention is enough to cause him to flee, and while in a state of depression a passerby befriends him and gives him a new life in a scummy part of town collecting the contents of chamber pots. In his new home, Ah Chi learns that his new family also has a daughter called \"Princess\" who returns home only once a month, but her earnings in a noble home are enough that they can eat meat.Following a beating by a villainous customer, the girl from the brothel (Hsiao Li), returns home to be revealed as the girl known as \"Princess\", but their happiness is short-lived for the \"Big Boss\" sends men to take her back to the brothel. In the process, Ah Chi intervenes, though only slightly, and is recognized by a henchman as the \"3rd Master\". While this is happening, Yen Shih-San is passing by with a tombstone on his back, and chases off one of the thugs while scaring the rest of them.The villagers are thankful to Yen Shih-San and ask him to train Ah Chi in kungfu. Yen Shih-San, who by this point has confirmed that he is dying, has taken up residence in a cemetery to await his death having failed to fulfill his dream of being the best sword-master because he could never defeat the \"3rd Master\". Instead of teaching Ah Chi, Yen Shih-San launches an attack on the brothel, slaying the Big Boss and becoming a hero instead of the villain he had been most of his life. This leads to him teaching Ah Chi his techniques so that they would not perish with him.Word gets out to Ah Chi's enemies, and Mu-Yung Chiu-Ti comes to claim Hsieh Shao-Feng under the threat of destroying his new home. This leads to a brief sting of him trying to reconcile with his ambitious fiance. Unable to find peace in the relationship and wishing a life of isolation, Hsieh Shao-Feng goes back to Princess to warn them to flee before his fiance kills them. At that moment, both his fiance's clan and the evil clan that was behind \"Big Boss\" attack the village, destroying everything, but Princess survives the ensuing flames under the body of her mother.Hsieh Shao-Feng is rescued by Yen Shih-San, who convinces Hsieh Shao-Feng to fight without killing, providing him a path to be a hero without having to fight for his father's or his clan's reasons. Returning to his home, only to find it under the attack of his fiance's and the evil clan, Hsieh Shao-Feng is able to rescue his father. In the process, Mu-Yung Chiu-Ti's servant is revealed to be the leader of the evil gang, who was attempting to earn her hand by becoming powerful. Her disdain leads him to kill her in an act of passion.Free of the threats of his ambitious fiance and the evil gang after his home, Hsieh Shao-Feng grants Yen Shih-San his duel, and is victorious, granting Yen Shih-San the honourable death of a sword-master instead of that of a sick man. The film concludes with Hsieh Shao-Feng riding in a cart with Princess, saying that he will travel around saving people where they are needed, completing his journey from a life of despair and inaction, to a life of hope and action accompanied by a woman he loves, and who in turn loves him."
}