{
  "imdb_id": "tt5224834",
  "tmdb_id": "375533",
  "douban_id": "26605967",
  "title": "Wolf Girl and Black Prince (2016)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "116 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm0386382",
      "name": "Ryuichi Hiroki"
    }
  ],
  "writer": [
    {
      "id": "nm7750255",
      "name": "Ayuko Hatta",
      "description": "manga"
    }
  ],
  "cast": [
    {
      "id": "nm3049403",
      "name": "Fumi Nikaidô",
      "character": "Erika Shinohara"
    },
    {
      "id": "nm4081467",
      "name": "Kento Yamazaki",
      "character": "Kyota Sata"
    },
    {
      "id": "nm6186391",
      "name": "Riria Baba",
      "character": "Namie Yuki"
    },
    {
      "id": "nm4233819",
      "name": "Elaiza Ikeda",
      "character": ""
    },
    {
      "id": "nm5282266",
      "name": "Mugi Kadowaki",
      "character": ""
    },
    {
      "id": "nm4206125",
      "name": "Nanao",
      "character": "Reika Sata"
    },
    {
      "id": "nm4760665",
      "name": "Nobuyuki Suzuki",
      "character": ""
    },
    {
      "id": "nm6119056",
      "name": "Tina Tamashiro",
      "character": "Marin Tachibana"
    },
    {
      "id": "nm4290253",
      "name": "Yûki Yamada",
      "character": "Playboy"
    },
    {
      "id": "nm5378218",
      "name": "Ryûsei Yokohama",
      "character": ""
    },
    {
      "id": "nm4877001",
      "name": "Ryô Yoshizawa",
      "character": ""
    }
  ],
  "overview": "Erika Shinohara (Fumi Nikaido) is a first year of high school student. While talking to friends, she makes up a story about her \"boyfriend.\" In reality, Erika Shinohara doesn't have a boyfriend. Erika's friends soon begin to doubt her story and Erika is also running out of lies. Erika then sees a pretty boy on the street and takes his picture discreetly. She later shows his picture to her friends as her boyfriend. The boy in the picture is Kyouya Sata (Kento Yamazaki) and happens to attend the same school as Erika. She tells Kyouya about her situation and asks him to be her pretend boyfriend. Even though Kyouya has a pretty appearance, he has a dark side.",
  "storyline": "Erika Shinohara is a first year of high school student. While talking to friends, she makes up a story about her \"boyfriend.\" In reality, Erika Shinohara doesn't have a boyfriend. Erika's friends soon begin to doubt her story and Erika is also running out of lies. Erika then sees a pretty boy on the street and takes his picture discreetly. She later shows his picture to her friends as her boyfriend. The boy in the picture is Kyouya Sata and happens to attend the same school as Erika. She tells Kyouya about her situation and asks him to be her pretend boyfriend. Even though Kyouya has a pretty appearance, he has a dark side.",
  "plot": "Erika Shinohara is a high school student who desperately wants to fit in a clique so she would not become lonely. However, because her clique consists of girls who have boyfriends, she has to resort to tell lies about having one herself. To make them more authentic, Erika takes a photo of a random guy in the street. Unfortunately, the guy, Kyoya Sata, turns out to be the most popular boy from her school. Erika asks him to pretend to be her boyfriend, which he agrees to under one condition: that she become his \"Wolf Girl\" by acting like a pet to him.\n\nTo her dismay, Erika discovers that Kyoya is far more dark-hearted than the \"princely\" personality he feigns towards others; he frequently gives snarks, insults, and generally has a cynical view of the world. Despite this, Erika is slowly attracted and eventually falls in love with him. Kyoya in turn softens and finds out that he is attracted to her as well, something that is cemented when Erika quits being the Wolf Girl after a misunderstanding, which he responds by \"promoting\" her to become his actual girlfriend.\n\nErika and Kyoya go through their high school years as a couple while having to face many challenges, including love rivals for each other, misunderstandings, and jealousy. They also learn to understand and change for the benefit of each other. In the process, they befriend three people who form a part of a group: Erika's self-reliant best friend, Ayumi Sanda; Kyoya's hot-blooded best friend, Takeru Hibiya; and the flamboyant Nozomi Kamiya, who becomes their classmate during their second year. Near the end of the series, the couple also have to face the truth of a long-distance relationship when Erika has to move to Kyoto to attend a vocational school for glass making; the two ultimately decide on working it out somehow.\n\nSeven years after graduation, the group have attained each of their preferred professions, with Erika herself becoming a glass maker. She has also married Kyoya, with whom she has a daughter, Yuina.",
  "synopsis": null
}