{
  "imdb_id": "tt5271432",
  "tmdb_id": "374755",
  "douban_id": null,
  "title": "Adi Kapyare Kootamani (2015)",
  "genres": [
    "Comedy",
    "Horror"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "131 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm7792149",
      "name": "John Varghese"
    }
  ],
  "writer": [
    {
      "id": "nm7792150",
      "name": "Abhilash S. Nair",
      "description": "story & screenplay"
    },
    {
      "id": "nm7792149",
      "name": "John Varghese",
      "description": "story & screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm6098360",
      "name": "Dhyan Sreenivasan",
      "character": "Bhanuprasad"
    },
    {
      "id": "nm0611481",
      "name": "Mukesh",
      "character": "Fr. Alfred Kattuvilayil"
    },
    {
      "id": "nm5166292",
      "name": "Namitha Pramod",
      "character": "Adhishta Lekshmi"
    },
    {
      "id": "nm4028151",
      "name": "Aju Varghese",
      "character": "Bruno"
    },
    {
      "id": "nm6697626",
      "name": "Neeraj Madhav",
      "character": "Remo"
    },
    {
      "id": "nm7079028",
      "name": "Vineeth Mohan",
      "character": "Koshy"
    },
    {
      "id": "nm2465399",
      "name": "Sabumon Abdusamad",
      "character": "Veluchammi       (as Tharikida Sabu)"
    },
    {
      "id": "nm1798902",
      "name": "Devi Ajith",
      "character": "Adhishta Lakshmi's Mother"
    },
    {
      "id": "nm2469558",
      "name": "Bijukuttan",
      "character": "Shanthappan"
    },
    {
      "id": "nm6447222",
      "name": "Disney James",
      "character": "Old Lady's Son"
    },
    {
      "id": "nm6845864",
      "name": "Pradeep Kottayam",
      "character": "Bhanu's Relative"
    },
    {
      "id": "nm7911147",
      "name": "Krishnan",
      "character": "Auto Driver"
    },
    {
      "id": "nm4027847",
      "name": "Bhagath Baby Manuel",
      "character": "Harris"
    },
    {
      "id": "nm7733137",
      "name": "Roshan Mathew",
      "character": "Prem Raj"
    },
    {
      "id": "nm0579772",
      "name": "Valsala Menon",
      "character": "Old Lady"
    },
    {
      "id": "nm6440625",
      "name": "Anjali Nair",
      "character": "Old Lady's Helper       (as Anjali Aneesh Upasana)"
    },
    {
      "id": "nm6947814",
      "name": "Balaji Sarma",
      "character": "Electrician"
    },
    {
      "id": "nm9612962",
      "name": "Jithan V. Soubhagom",
      "character": "College Student"
    },
    {
      "id": "nm3682633",
      "name": "John Vijay",
      "character": "Adhishta Lakshmi's Father"
    }
  ],
  "overview": "The story revolves around a bunch of college students living in a boy's hostel. The story unfolds over a period of four days in the hostel. Problems begin when a young woman enters the hostel.",
  "storyline": "The story revolves around a bunch of college students when a young woman gets stuck inside the boys hostel with no way out.",
  "plot": "The movie starts with the introduction of Father Alfred Kattuvilayil (Mukesh) who considers himself to be a very strict warden of a college boys hostel. His assistant Shaanthappan (Bijukuttan) always tries to show him the mischief of the students but always fails. Adhishta Lakshmi (Namitha Pramod) fights with her father (John Vijay) over her boyfriend and by chance meets Bhanuprasad (Dhyan Sreenivasan) in the canteen of his college. Bhanu has lost his gold chain by lending it for his friend Harris (Bhagath Manuel). As he wanted money, Lakshmi offers him twenty thousand rupees for taking her to his hostel for some unknown reason on that night. That night Bhanu smuggles Lakshmi into the hostel, but by the time he tries to get her out, the way out was blocked. That night both stay in Bhanu's room. Not fully trusting Bhanu, Lakshmi ties his hands to a table and plans to leave by early morning three'o'clock. But both sleeps off and wake up only by eight, when Bhanu's friend Bruno (Aju Varghese) knocks his door. Bhanu skips college and tries to get her out. But the escape route was blocked by Father and Shanthappan. He tries to get her out through the Main entrance but to his horror, college was closed for some strike and the students came back to the hostel. Both stays in Bhanu's room for the whole day planning to escape from the terrace that night. When Bhanu goes to the terrace to check, he sees a number of students including his friends Bruno, Koshy (Vineeth Mohan) and Remo (Neeraj Madhav) boozing. They force him to drink and he forgets about Lakshmi locked in his room. When Shanthappan goes near Bhanu's room after sometime, he hears Lakshmi speaking in her sleep in Tamil. He thinks that it is a ghost and get the key from Bhanu's pocket and opens the door. Lakshmi kicks him and run out of the room, and Shanthappan is knocked out. Next day Bhanu wake up and Father is persuaded by Shanthappan to check Bhanu's room for the ghost. Bhanu opens the room reluctantly and is surprised not to see Lakshmi. He then finds out that his friends found out about Lakshmi and they together plans to get her out. Lakshmi tells them the reason that she came in the hostel. She had a lover Premraj (Roshan Mathew)who was a Casanova, who was in the hostel, and after he broke up with her she wanted to take revenge. So she went to his room and slapped him. Friends while planning to get her out, is irritated by the behavior of Remo as he constantly tries to flirt with Lakshmi. That day night when they try to get her out from the terrace, Father and Shanthappan see her in white dress and both believes that there is a ghost. Then Bhanu makes a new plan: to make everyone believe that there is actually a ghost and he will summon her with Ouija board in the presence of Father. When Father do some magical rituals the Ghost (Lakshmi) will leave and that way she can get out of the hostel. They plan and does things so that other inmates believe that there is a ghost. But in reality, there was an actual ghost in the hostel who came when Bhanu used the Ouija board. But Lakshmi successfully gets out of the hostel as per the original plan, even though some super natural events occur. The ghost is shown still wandering through the hostel.\n\nIn the credits, Lakshmi is in her house and Bhanu visits her with her bag which she had forgotten in his room. She asks him to leave but hears her fathers voice and asks him to wait till three in the morning. Bhanu now understands that he is trapped in her house just like how she was trapped in the hostel, which will possibly lead to a sequel.",
  "synopsis": null
}