{
  "imdb_id": "tt5278868",
  "tmdb_id": "373355",
  "douban_id": null,
  "title": "The Lovers & the Despot (2016)",
  "genres": [
    "Documentary",
    "Thriller"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "98 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm5366685",
      "name": "Ross Adam"
    },
    {
      "id": "nm1930956",
      "name": "Robert Cannan"
    }
  ],
  "writer": [
    {
      "id": "nm5366685",
      "name": "Ross Adam",
      "description": null
    },
    {
      "id": "nm1930956",
      "name": "Robert Cannan",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0158804",
      "name": "Eun-hie Choi",
      "character": "Herself"
    },
    {
      "id": "nm0183824",
      "name": "Paul Courtenay Hyu",
      "character": "Shin Sang-ok"
    },
    {
      "id": "nm0645661",
      "name": "Sang-ok Shin",
      "character": "Himself       (voice)"
    }
  ],
  "overview": "After the collapse of their glamorous romance, a famous director and actress are kidnapped by movie-obsessed dictator Kim Jong-il. Forced to make films in the world's weirdest state, they get a second chance at love, but only one chance at escape.",
  "storyline": "In 1970s South Korea, actor Choi Eun-hee and her ex-husband, film director Shin Sang-ok, were divorced, estranged and both struggling with stalled careers. Unfortunately, both their lives seemed changed forever when they were individually kidnapped in 1978 by their biggest fan, Kim Jong-il, despot of North Korea. With persuasion and brute force, the movie obsessed Kim planned to use them to develop the Hermit Kingdom's film industry and get it out of its mindless propaganda mentality. Through the words of Choi, their family, associates and US intelligence personnel, you will follow the story of the bizarre slavery of this couple even as they rediscovered their love and secretly gathered evidence of the dictator's crimes. All the while, they struggled to play along with the world's most dangerous film geek as they desperately planned their escape.",
  "plot": null,
  "synopsis": null
}