{
  "imdb_id": "tt5212698",
  "tmdb_id": "411101",
  "douban_id": null,
  "title": "Possessed (2015)",
  "genres": [
    "Short",
    "Horror"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "20 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm6425568",
      "name": "Bryan Hughes"
    }
  ],
  "writer": [
    {
      "id": "nm6425568",
      "name": "Bryan Hughes",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm6425568",
      "name": "Bryan Hughes",
      "character": "Thomas /              Demon"
    },
    {
      "id": "nm7740499",
      "name": "Vanessa Montalvo",
      "character": "Elaine"
    },
    {
      "id": "nm0724827",
      "name": "Michael Richartz",
      "character": "Leonard /              Exorcist"
    },
    {
      "id": "nm6429797",
      "name": "Staci Stander",
      "character": "Felicia"
    }
  ],
  "overview": "Father Leonard is called in to perform an exorcism on Felicia's husband, Thomas. But what he faces he wasn't expecting.",
  "storyline": null,
  "plot": "Scott Calvin is a divorced advertising executive, who is also a father to his son Charlie. Charlie's mother, Laura, is now married to psychiatrist Neil Miller. Charlie spends Christmas Eve with his father, who burns the Christmas turkey, forcing them to eat at Denny's. After Scott reads \"Twas the Night Before Christmas\" to Charlie on Christmas Eve, he and Charlie are awakened that night by sounds on the roof. After confronting a man on the roof, who inadvertently falls off when Scott startles him, then vanishes leaving his Santa Claus outfit behind, they discover eight reindeer on the roof and Charlie convinces Scott to put on the suit and finish Santa's work for him. As the morning comes, the reindeer return to the North Pole to Santa's Workshop, where the head elf Bernard explains that, due to a clausical contract written on a card Scott found on Santa, in putting on the suit and entering the sleigh he has accepted the \"Santa Clause\" and has agreed to the responsibilities of that position. He tells a skeptical Scott that he has eleven months to get his affairs in order before reporting to the workshop at Thanksgiving permanently.\n\nScott awakens in his own bed on Christmas morning and believes the night before having been a dream, but the enthusiastic Charlie recounts several events he had not told him and leaves him in doubt. After Charlie proudly tells his class that Scott is Santa Claus, Laura and Neil confide their concerns and ask Scott to put a stop to what they believe is a delusional fantasy. Not wanting to break Charlie's heart, Scott tells him to keep the North Pole and everything they saw a secret. However, over the course of the year, strange things begin to happen to Scott. The first thing to appear is a beard, which always re-grows, even immediately after shaving. He also develops a fondness for dessert items, primarily cookies. The taste for these newfound treats cause Scott to gain an inordinate amount of weight seemingly overnight and he balloons to 192lbs, which at first he thinks he is just bloated. He also begins losing the coloring of his hair, turning it stark white. Scott's doctor says his weight gain is just fluctuation, even when Scott insists that gaining 45lbs in a week is not right and the changing of his hair color is because he is middle aged. During a meeting with his company, Scott disrupts the meeting to call out their idea of promoting a television advertisement of Santa riding a toy tank. Scott's boss Mr. Whittle takes him aside and asks him to get some help. He also begins to recount 'naughty' and 'nice' children by name after getting his \"list\" of children in the mail, as well as his own suit. These changes prompt further concern from Laura and Neil, who subsequently call to have Scott's visitation rights removed. Laura confides that she stopped believing in Santa when she was only eight, when he failed to give her a board game Mystery Date for Christmas, while Neil, at the age of three years stopped believing when Santa did not give him an Oscar Mayer Weenie Whistle he wanted. On Thanksgiving night, Scott arrives to say goodbye to Charlie. As Neil insists to Charlie that Scott is not Santa, Charlie hands Scott a magical snowglobe he received from Bernard, which finally convinces Scott that he is Santa. As Laura and Neil steps out of the room for a moment, Bernard comes and takes Scott and Charlie away to the North Pole, leading Laura to believe Scott had kidnapped him.\n\nOn Christmas Eve night, Scott begins delivering presents, and is arrested when entering Laura and Neil Miller's house, leaving Charlie stranded in the sleigh on the roof. The E.L.F.S. (Effective Liberating Flight Squad) is called and rescues Charlie and frees Scott from custody. Scott returns to take Charlie home, and manages to convince Laura and Neil of his new identity by giving them the gifts they asked for as children. Bernard shows up to thank Laura for the cookies and disappears into thin air. Laura destroys the court order against Scott and tells him that he can visit Charlie anytime he wants. After a very public departure, Charlie attempts to use the snow globe to summon Scott to him and he eventually arrives. After getting Laura's permission for a sleigh ride with his father, Charlie and Scott head out to continue the Christmas deliveries and Scott accepts his new life as Santa Claus.",
  "synopsis": null
}