{
  "imdb_id": "tt5247022",
  "tmdb_id": "370755",
  "douban_id": null,
  "title": "Paterson (2016)",
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "118 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.7,
  "director": [
    {
      "id": "nm0000464",
      "name": "Jim Jarmusch"
    }
  ],
  "writer": [
    {
      "id": "nm0000464",
      "name": "Jim Jarmusch",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm3485845",
      "name": "Adam Driver",
      "character": "Paterson"
    },
    {
      "id": "nm0267042",
      "name": "Golshifteh Farahani",
      "character": "Laura"
    },
    {
      "id": "nm8165340",
      "name": "Nellie",
      "character": "Marvin"
    },
    {
      "id": "nm0542492",
      "name": "Rizwan Manji",
      "character": "Donny"
    },
    {
      "id": "nm8147527",
      "name": "Dominic Liriano",
      "character": "Boy on Bus 1"
    },
    {
      "id": "nm3663271",
      "name": "Jaden Michael",
      "character": "Boy on Bus 2"
    },
    {
      "id": "nm0377106",
      "name": "Barry Shabaka Henley",
      "character": "Doc"
    },
    {
      "id": "nm3571226",
      "name": "Trev Parham",
      "character": "Sam       (as Trevor Parham)"
    },
    {
      "id": "nm3571315",
      "name": "Troy T. Parham",
      "character": "Dave       (as Troy Parham)"
    },
    {
      "id": "nm5359238",
      "name": "Brian McCarthy",
      "character": "Jimmy"
    },
    {
      "id": "nm1320715",
      "name": "Frank Harts",
      "character": "Luis"
    },
    {
      "id": "nm1534888",
      "name": "Luis Da Silva Jr.",
      "character": "Blood in Convertible"
    },
    {
      "id": "nm3779256",
      "name": "Chasten Harmon",
      "character": "Marie"
    },
    {
      "id": "nm2860379",
      "name": "William Jackson Harper",
      "character": "Everett"
    },
    {
      "id": "nm0541218",
      "name": "Method Man",
      "character": "Method Man       (as Cliff Smith)"
    },
    {
      "id": "nm8147531",
      "name": "Kacey Cockett",
      "character": "Woman in Red"
    },
    {
      "id": "nm4442319",
      "name": "Kara Hayward",
      "character": "Female Student"
    },
    {
      "id": "nm4442068",
      "name": "Jared Gilman",
      "character": "Male Student"
    },
    {
      "id": "nm3606106",
      "name": "Sterling Jerins",
      "character": "Young Poet"
    },
    {
      "id": "nm1949214",
      "name": "Johnnie Mae",
      "character": "Doc's Wife"
    },
    {
      "id": "nm4291583",
      "name": "Helen-Jean Arthur",
      "character": "Older Woman 1"
    },
    {
      "id": "nm8147551",
      "name": "Joan Kendall",
      "character": "Older Woman 2"
    },
    {
      "id": "nm7690155",
      "name": "Owen Asztalos",
      "character": "Small Boy 1"
    },
    {
      "id": "nm5712052",
      "name": "Jorge Vega",
      "character": "Small Boy 2"
    },
    {
      "id": "nm7615109",
      "name": "Sophia Muller",
      "character": "Small Girl"
    },
    {
      "id": "nm0619185",
      "name": "Masatoshi Nagase",
      "character": "Japanese Poet"
    }
  ],
  "overview": "Set in the present in Paterson, New Jersey, this is a tale about a bus driver and poet.",
  "storyline": "Exactly one week in the life of a young man named Paterson of Paterson, New Jersey is presented. He lives an extremely regimented and routinized life, that routine perhaps most vividly displayed by the fact that he is able to wake up at exactly the same time every day without an alarm. That life includes eating Cheerios for breakfast, walking to work carrying his brown bag lunch packed in his lunch pail by his wife Laura, having a casual chat with his colleague Donny before he begins his shift driving the #23 Paterson bus for the local public transit company, walking home where he straightens out the exterior mailbox which somehow during the day gets knocked crooked, eating dinner with Laura and listening to her goings-on of the day, taking Laura's English bulldog Marvin - who he would admit to himself he doesn't much like - out for a walk to his neighborhood bar where he has one and only one beer before walking home with Marvin. There are day to day variations which are often the ...",
  "plot": null,
  "synopsis": "The film follows one week in the life of Paterson, a bus driver in the city of Paterson. Each day follow the same routine. Paterson, sleeping beside his girlfriend, Laura, wakes up around the same time, roughly 6:10 to 6:30. The time varies because he doesn't use an alarm clock. He also, as we find out later, doesn't own a cellphone. He eats breakfast and walks to work, composing poetry in his head. On the bus, he jots down his poetry ideas in a notebook that he shares with no one but Laura. He drive his route and visits Paterson Falls on his lunch break. When he comes home, he finds that Laura has been doing some artistic project, such as painting the drapes or painting a dress. Her artistic creations are always in black and white. Laura has many ambitions. She wants to start a cupcake business. She convinces Paterson to buy her a $600 guitar and instructional package, so she can become a country music star. (She has never played the guitar.)At the end of each day, Paterson takes their bulldog for a walk, leaving him outside the local bar while he goes in for a beer and a chat with the owner. A woman is there who is trying to ditch her boyfriend, who plea with her to give him another chance.The routine varies a little each day. One day, he meets a girl who is writing poems in her own secret notebook. Paterson doesn't tell her that he is also a poet. She reads a poem to her which he later recites to Laura. On another evening, in the bar, the boyfriend threatens to shoot himself, and Paterson disarms him. The gun, it turns out, is a toy. On Friday, his bus breaks down, and he has to call for help with a phone borrowed from a passenger.For the weekend, Laura has prepared a cupcakes (decorated in lack and white, naturally) to sell in the farmer's market. When she returns, she has made almost $300. They go out to celebrate, leaving the dog behind. When they return, they find that the dog has chewed up and destroyed Paterson's precious notebook. He had promised Laura to make a photocopy, but he hasn't gotten around to it.Paterson goes to the Falls to be alone with his thoughts. There he meets a Japanese tourist who is reading a volume of William Carlos Williams's poetry. The man is a poet who wants to see the hometown of Williams. Paterson does not tell him that he too is a poet. When the man leaves, he gives Paterson a gift - a blank notebook. Paterson begins composing poetry again."
}