{
  "imdb_id": "tt5278506",
  "tmdb_id": "373072",
  "douban_id": "26712559",
  "title": "Tickled (2016)",
  "genres": [
    "Documentary",
    "Mystery"
  ],
  "country": "New Zealand",
  "version": [
    {
      "runtime": "92 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm3910931",
      "name": "David Farrier"
    },
    {
      "id": "nm1190816",
      "name": "Dylan Reeve"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm3910931",
      "name": "David Farrier",
      "character": "Himself"
    },
    {
      "id": "nm1190816",
      "name": "Dylan Reeve",
      "character": "Himself"
    },
    {
      "id": "nm3787605",
      "name": "Marko Realmonte",
      "character": "Himself"
    },
    {
      "id": "nm8972944",
      "name": "Kevin Clarke",
      "character": "Himself"
    },
    {
      "id": "nm8972945",
      "name": "Adam",
      "character": "Himself"
    },
    {
      "id": "nm8972946",
      "name": "T.J. Gretzner",
      "character": "Himself, former tickle competitor       (as TJ)"
    },
    {
      "id": "nm8972947",
      "name": "Richard Ivey",
      "character": "Himself, tickle fetishist"
    },
    {
      "id": "nm7935330",
      "name": "David Starr",
      "character": "Himself"
    },
    {
      "id": "nm8972948",
      "name": "Anne James",
      "character": "Herself, radio host, KSEN /              K96       (voice) (archive footage)"
    },
    {
      "id": "nm8972949",
      "name": "Alden",
      "character": "Himself, former tickle video performer"
    },
    {
      "id": "nm7876242",
      "name": "Hal Karp",
      "character": "Himself, journalist 1992-2007"
    },
    {
      "id": "nm8972950",
      "name": "Debbie Scoblionkov",
      "character": "Herself, journalist 1981-2006"
    },
    {
      "id": "nm8972951",
      "name": "Jordan Schillaci",
      "character": "Himself"
    },
    {
      "id": "nm8972952",
      "name": "Lance Roberts",
      "character": "Himself       (voice)"
    },
    {
      "id": "nm8270931",
      "name": "David D'Amato",
      "character": "Himself, aka Terri Tickle aka Terri DiSisto aka Jane O'Brien aka Jane J. O'Brien aka Debbie Kuhn"
    },
    {
      "id": "nm8972953",
      "name": "Romeo Salta",
      "character": "Himself, attorney allegedly hired by Jane O'Brien Media"
    },
    {
      "id": "nm8972954",
      "name": "Dorothy J. D'Amato",
      "character": "Herself, David P. D'Amato's stepmother       (voice) (as Dorothy)"
    }
  ],
  "overview": "Journalist David Farrier stumbles upon a mysterious tickling competition online. As he delves deeper he comes up against fierce resistance, but that doesn’t stop him getting to the bottom of a story stranger than fiction.",
  "storyline": "David Farrier, a New Zealand pop cultural reporter whose story subjects often verge into the bizarre, believes he's found his next story when he stumbles across an online video on the world of competitive endurance tickling, a sport where the participants, with hands and feet tied down, are tickled for as long as they can endure. Participants are flown to Los Angeles first class, paid $1,500, and put up for four nights in a luxury hotel. Suitable participants are deemed to be younger, muscular males. The event is held on a monthly basis. In contacting the organizers, US-based Jane O'Brien Media, via their popular Facebook page to arrange for an interview, David receives a return message from one of their representatives, Debbie J. Kuhn, declining the offer, the message a homophobic rant largely against David. In that message, Debbie asserts that the competition is wholly a heterosexual athletic activity, she who does not appreciate what will be David's assumed gay bent on the story as...",
  "plot": "David Farrier, a New Zealand \"light entertainment\" television reporter, sees videos online about an activity described as \"competitive endurance tickling\", in which young athletic men are restrained and tickled by each other; he begins to research it for a story. However, his inquiry to video producer Jane O'Brien Media elicits a hostile reply, focusing on his bisexuality and asserting that the sport is a \"passionately and exclusively heterosexual athletic endurance activity\". Farrier partners with television producer Dylan Reeve to learn more about tickling videos and the people who produce them.\n\nAfter blogging about the incident, they receive legal threats from Jane O'Brien Media, who send Kevin Clarke and two other representatives to New Zealand. Although their interactions are superficially cordial, the Jane O'Brien Media people seem intent on bullying the investigators into dropping the project. Farrier and Reeve respond by traveling to Los Angeles, and find the representatives at a site where the company records videos, but are turned away at the door.\n\nResearching the phenomenon further, they uncover information about a person known as Terri DiSisto (alias \"Terri Tickle\"), who pioneered recruiting and distributing tickling videos online in the 1990s. They interview independent tickling-video producer Richard Ivey whose operations are a low-key affair with an acknowledged homoerotic aspect. They speak to a few former participants in Jane O'Brien Media's videos, who describe coercive and manipulative treatment by the producers, such as defamation campaigns against them, exposing their personal information and contacting school or work associates to discredit them as homosexual or as sexual deviants, in retaliation for challenging or speaking out against the company. A local recruiter in Muskegon, Michigan, describes \"audition\" videos he had helped make, which were published by O'Brien Media without the participants' consent.\n\nFarrier and Reeve chance upon documents on a defunct tickling-video web site, which link Jane O'Brien Media to David D'Amato, the former school administrator behind the \"Terri Tickle\" alias. They learn that D'Amato had served a six-month prison sentence for disabling computer systems at two different universities on multiple dates, in retaliation against an 18-year-old male student who attempted to terminate their online relationship, begun when the young man was 17. They determine that D'Amato now lives on a substantial inheritance from his father, a successful lawyer. After considerable effort to locate him, they confront him on the street, to which he responds with additional legal threats. Before returning to New Zealand, Farrier contacts D'Amato's step-mother for comment; she implicitly confirms her step-son's \"tickling\" past, and Farrier informs her that he believes D'Amato is still involved in it.",
  "synopsis": null
}