{
  "imdb_id": "tt5254868",
  "tmdb_id": "419639",
  "douban_id": null,
  "title": "The Thinning (2016)",
  "genres": [
    "Action",
    "Drama",
    "Horror",
    "Sci-Fi",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "81 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.1,
  "director": [
    {
      "id": "nm2038422",
      "name": "Michael J. Gallagher"
    }
  ],
  "writer": [
    {
      "id": "nm2038422",
      "name": "Michael J. Gallagher",
      "description": null
    },
    {
      "id": "nm3475267",
      "name": "Steve Greene",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm6982686",
      "name": "Logan Paul",
      "character": "Blake Redding"
    },
    {
      "id": "nm2572554",
      "name": "Peyton List",
      "character": "Laina Michaels"
    },
    {
      "id": "nm3096796",
      "name": "Lia Marie Johnson",
      "character": "Ellie Harper"
    },
    {
      "id": "nm1101127",
      "name": "Calum Worthy",
      "character": "Kellan Woods"
    },
    {
      "id": "nm1707018",
      "name": "Ryan Whitney Newman",
      "character": "Sarah Foster       (as Ryan Newman)"
    },
    {
      "id": "nm1290115",
      "name": "Michael Traynor",
      "character": "Mason King"
    },
    {
      "id": "nm0001107",
      "name": "Stacey Dash",
      "character": "Kendra Birch"
    },
    {
      "id": "nm0322182",
      "name": "Matthew Glave",
      "character": "Gov. Dean Redding"
    },
    {
      "id": "nm0304580",
      "name": "Robert Gant",
      "character": "Vince Davi"
    },
    {
      "id": "nm0912916",
      "name": "Kiersten Warren",
      "character": "Barbara Michaels"
    },
    {
      "id": "nm2755239",
      "name": "Jana Winternitz",
      "character": "Ms. Cole"
    },
    {
      "id": "nm1140388",
      "name": "Patrick O'Sullivan",
      "character": "Mr. Glass"
    },
    {
      "id": "nm2625932",
      "name": "Amy Paffrath",
      "character": "Wendy Banks"
    },
    {
      "id": "nm0179167",
      "name": "Jeff Corbett",
      "character": "Victor Woods"
    },
    {
      "id": "nm0005009",
      "name": "Laura Harring",
      "character": "Georgina Preston"
    },
    {
      "id": "nm6507096",
      "name": "Aria Lyric Leabu",
      "character": "Corrine Michaels       (as Aria Leabu)"
    },
    {
      "id": "nm7217377",
      "name": "Marcel Nahapetian",
      "character": "Joey Michaels"
    },
    {
      "id": "nm1807372",
      "name": "David A. Cooper",
      "character": "Ted Grover"
    },
    {
      "id": "nm4951842",
      "name": "Steven Cox",
      "character": "Wade Freeman"
    },
    {
      "id": "nm0127988",
      "name": "Kurt Caceres",
      "character": "Hank"
    },
    {
      "id": "nm3823418",
      "name": "Miles Elliot",
      "character": "Simon"
    },
    {
      "id": "nm1726993",
      "name": "Sunkrish Bala",
      "character": "Dr. Prakash"
    },
    {
      "id": "nm4782330",
      "name": "Makeda Declet",
      "character": "Female DPC Guard"
    },
    {
      "id": "nm7383821",
      "name": "Bernard X. Kopsho",
      "character": "Chuck Freeman"
    },
    {
      "id": "nm5627664",
      "name": "Sully Zack",
      "character": "Layne Vick"
    },
    {
      "id": "nm2374329",
      "name": "Steven Wash Jr.",
      "character": "Marcus Langley       (as Stevie Wash Jr.)"
    },
    {
      "id": "nm6667192",
      "name": "Cooper J. Friedman",
      "character": "Nathan"
    },
    {
      "id": "nm5615654",
      "name": "Alexa Rambarran",
      "character": "Preppy Girl       (as Alexa Joel)"
    },
    {
      "id": "nm4665483",
      "name": "Adwin Brown",
      "character": "Preppy Guy"
    },
    {
      "id": "nm1555334",
      "name": "Nikki Boyer",
      "character": "Political Expert"
    },
    {
      "id": "nm1797323",
      "name": "Hunter Paris",
      "character": "Cheating Teen"
    },
    {
      "id": "nm5021372",
      "name": "Ramona Young",
      "character": "Adele"
    },
    {
      "id": "nm0314754",
      "name": "Frank Gerrish",
      "character": "Balding Teacher"
    },
    {
      "id": "nm3997074",
      "name": "Scott Broderick",
      "character": "Carl"
    },
    {
      "id": "nm2258196",
      "name": "Patrick Mulderrig",
      "character": "DPC Guard"
    },
    {
      "id": "nm6902919",
      "name": "Janna Cardia",
      "character": "Frustrated Parent       (as Jana Cardia)"
    },
    {
      "id": "nm3596146",
      "name": "Laura Covelli",
      "character": "Friendly Teacher"
    },
    {
      "id": "nm1297428",
      "name": "Tara Platt",
      "character": "Animation Voice Over       (voice)"
    },
    {
      "id": "nm5718997",
      "name": "Yolanda English",
      "character": "Funeral Goer"
    }
  ],
  "overview": "In a post-apocalyptic future where population control is dictated by a high-school aptitude test, two students discover the test is smoke and mirrors hiding a larger conspiracy.",
  "storyline": "\"The Thinning\" takes place in a future plagued by overcrowding where population control is dictated by a high-school aptitude test. When two students (Logan Paul and Peyton List) discover the test is smoke and mirrors hiding a larger conspiracy, they must fight the system to expose it and take it down.",
  "plot": "Billy Halleck (Robert John Burke) is an obese, upper-class lawyer living with his wife Heidi (Lucinda Jenney) and their daughter Linda (Bethany Joy Lenz). Billy recently defended an underworld crime boss named Richie \"The Hammer\" Ginelli (Joe Mantegna) in court. The town he lives in is hosting a carnival, run by gypsies that the townspeople hold obvious prejudice against.\n\nOne night, while Billy is driving, Heidi, in an attempt to persuade him to forget about his obsession with food, performs fellatio on him. Distracted, Billy accidentally runs over Suzanne Lempke (Irma St. Paule), an elderly gypsy woman, as she leaves a local pharmacy. Since Judge Cary Rossington (John Horton) is a personal friend of his, he soft-pedals the case, and no charges are filed against him. Outraged by the injustice, Suzanne's 106-year-old father, Tadzu Lempke (Michael Constantine) curses Billy by touching his face and saying the word \"thinner\". Billy begins to lose weight rapidly, regardless of how much he eats. Heidi, fearing the weight loss may be due to cancer, brings in Dr. Mike Houston (Sam Freed), with whom Billy soon begins to suspect his wife is having an affair.\n\nIt is revealed that the man also cursed Judge Cary and Police Chief Duncan Hopely (Daniel von Bargen), who helped him avoid punishment in court. Cary, whose curse was \"Lizard\", is now growing scales all over his body. Duncan, whose curse was \"leper\" becomes mutated with large boils and eventually commits suicide. Billy continues losing weight and calculates that he only has a few weeks to live. Billy looks for the gypsy carnival, to get Lempke to remove the curse, but they have gone.\n\nWhen Heidi continually mentions Dr. Houston, who is repeatedly visiting their home, Billy is convinced of her affair. He lashes out at her and blames her for the accident. He finds the gypsy camp and tries to reason with Lempke, but instead angers him into increasing the curse's effects. Gina, Lempke's great-granddaughter (Kari Wuhrer), uses her slingshot to shoot a large ball bearing which goes directly through Billy's hand. Billy is forced to leave, but not before furiously vowing revenge against Lempke and his gypsies. Billy enlists Richie Ginelli's help. Richie pays Frank Spurton (Josh Holland), a local man, to track down the gypsy camp. He then kills their dogs, and leaves a message demanding Billy's curse be removed. In retaliation, Gina and her husband Gabe kill Frank. Richie brings a gun to the camp and begins shooting, then pushes Gabe out into the open to be accidentally shot and killed by his fellow gypsies. The next day, Richie kidnaps Gina and forces her to tell Lempke to meet them.\n\nAt the meeting, Lempke finds Billy emaciated and near death. To prevent further attacks on his people, he decides to lift the curse. Lempke explains that the curse cannot be removed, only transferred to another person. Chanting a spell, he mixes Billy's blood into a strawberry pie. Lempke states that after being consumed by an unsuspecting person, the pie causes painful but rapid death, and the curse will be lifted. He urges Billy to eat the pie himself and die with dignity, but Billy refuses. He calls Linda, telling her to spend the night at her friend's house, so that he and Heidi have the evening to themselves. He arrives home and presents to Heidi the strawberry pie, which happens to be her favorite flavor. She delightedly eats a piece, while Billy heads to bed, exhausted.\n\nThe next morning, Billy finds Heidi's desiccated corpse next to him. He is gleeful to be free of the curse and of his disloyal wife. However, when he goes downstairs, he finds to his horror that Linda, who came home after he went to bed, had eaten some of the pie for breakfast. Wracked with guilt, he prepares to eat the rest of the pie. However, Billy is interrupted by Dr. Houston who is at the door. Seeing Billy, the doctor grows uncomfortable and struggles to explain his early and unannounced presence. Billy invites Houston in for a piece of pie, and closes the door with a smirk, after referring to Houston as \"white doctor from town\" in Lempke's dialect.",
  "synopsis": null
}