{
  "imdb_id": "tt5241578",
  "tmdb_id": "402331",
  "douban_id": null,
  "title": "Hard Target 2 (Video 2016)",
  "genres": [
    "Action",
    "Thriller"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "104 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.2,
  "director": [
    {
      "id": "nm0004152",
      "name": "Roel Reiné"
    }
  ],
  "writer": [
    {
      "id": "nm2791452",
      "name": "Matt Harvey",
      "description": "written by &"
    },
    {
      "id": "nm2788920",
      "name": "Dominic Morgan",
      "description": "written by and"
    },
    {
      "id": "nm0398986",
      "name": "George Huang",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm0012078",
      "name": "Scott Adkins",
      "character": "Wes Baylor"
    },
    {
      "id": "nm0460694",
      "name": "Robert Knepper",
      "character": "Jonah Aldrich"
    },
    {
      "id": "nm0593961",
      "name": "Rhona Mitra",
      "character": "Sofia"
    },
    {
      "id": "nm0607325",
      "name": "Temuera Morrison",
      "character": "Madden"
    },
    {
      "id": "nm6157325",
      "name": "Ann Truong",
      "character": "Tha"
    },
    {
      "id": "nm0766719",
      "name": "Adam Saunders",
      "character": "Esparto"
    },
    {
      "id": "nm2317782",
      "name": "Jamie Timony",
      "character": "Landon Marshall"
    },
    {
      "id": "nm0362728",
      "name": "Peter Hardy",
      "character": "Jacob Zimling"
    },
    {
      "id": "nm2407067",
      "name": "Sean Keenan",
      "character": "Tobias Zimling"
    },
    {
      "id": "nm6192434",
      "name": "Troy Honeysett",
      "character": "Jonny Sutherland"
    },
    {
      "id": "nm6593421",
      "name": "Katrina Grey",
      "character": "Kay Sutherland"
    },
    {
      "id": "nm1927199",
      "name": "Gigi Velicitat",
      "character": "Maduka"
    },
    {
      "id": "nm3306393",
      "name": "Amarin Cholvibul",
      "character": "Win"
    },
    {
      "id": "nm6078269",
      "name": "Thira Chutikul",
      "character": "Thai Youth"
    },
    {
      "id": "nm0321325",
      "name": "Geoffrey Giuliano",
      "character": "Vermeulen"
    },
    {
      "id": "nm1957822",
      "name": "David Asavanond",
      "character": "MMA Announcer"
    },
    {
      "id": "nm3137542",
      "name": "Byron Gibson",
      "character": "Trainer"
    },
    {
      "id": "nm2398603",
      "name": "Cullet Eric",
      "character": "Fighter #1       (as Eric Newik Cullet)"
    },
    {
      "id": "nm0938890",
      "name": "Komkrib 'Krib' Wongwirot",
      "character": "Fighter #2       (as Komkrib Wongwirot)"
    },
    {
      "id": "nm6445841",
      "name": "Suthipongse Phukaokaew",
      "character": "Fighter #3       (as Suthipongse Phukakaew)"
    },
    {
      "id": "nm0095465",
      "name": "Sahajak Boonthanakit",
      "character": "The General"
    },
    {
      "id": "nm7763993",
      "name": "Chanthathanisa Vismitananda",
      "character": "Aldrich's Friend       (as Chanthathanisa 'Jeeja' Vismitananda)"
    },
    {
      "id": "nm7259059",
      "name": "Chiv Patrick Tang",
      "character": "Aldrich's Friend"
    },
    {
      "id": "nm1710129",
      "name": "Supoj Khaowwong",
      "character": "Aldrich's Friend"
    },
    {
      "id": "nm5478558",
      "name": "Eoin O'Brien",
      "character": "Aldrich's Friend"
    },
    {
      "id": "nm6639721",
      "name": "Khiri Lowenstein",
      "character": "Class Helper"
    },
    {
      "id": "nm10454569",
      "name": "Dana Blouin",
      "character": "MMA Cornerman"
    },
    {
      "id": "nm10454570",
      "name": "Lee Livingston",
      "character": "MMA Referee"
    },
    {
      "id": "nm9024796",
      "name": "Gin Mung",
      "character": "ADR"
    }
  ],
  "overview": "Forced into a deadly cat-and-mouse game, a disgraced mixed martial arts fighter is hunted through the jungles of Southeast Asia.",
  "storyline": "Retired mixed martial artist Wes \"The Jailor\" Baylor (Scott Adkins) can't refuse a million-dollar purse he's offered for one final bout in Myanmar. But when he arrives for the fight, he learns he's been tricked into becoming the target of a human hunt. Carrying only water and a ruby-filled money belt for the last person standing, Wes must outsmart the heavily armed group that has paid to kill him. As he fights for his life in the treacherous jungle terrain, the hunters become the hunted.",
  "plot": "Professional MMA fighter Wes Baylor (Scott Adkins) takes on Tim Sutherland (Troy Honeysett) in a match at the MGM Grand. Upset with the judges' score, Baylor tries to knock Sutherland out and accidentally kills him. Overwhelmed with guilt, Baylor enters into self-imposed exile in Thailand.\n\nSix months later, Baylor is still haunted by the death of Sutherland and competes in underground fight clubs. A man named Aldrich (Robert Knepper) watches Baylor fight, and offers him 1 million USD for a private one-off match in Myanmar. Upon arrival, Baylor is informed that he will be the victim of a lethal hunt organized by Aldrich. Baylor is given a water bottle and money belt, which unbeknown to him, has a GPS tracker hidden inside. The hunting party consists of Sofia (Rhona Mitra), bullfighter Esparto (Adam Saunders), game designer Landon (Jamie Timony), Maduka (Gigi Veliciat), Jacob \"Texas\" Zimling (Peter Hardy), Zimling's son Tobias (Sean Keenan), Aldrich's right-hand man Madden (Temuera Morrison), and Aldrich himself. In addition, the party is accompanied by a group of corrupt Myanmar Army soldiers.\n\nMaduka hunts Baylor with a sniper rifle at a waterfall, but Baylor goes underwater, sneaks up on Maduka, and kills him. While fleeing from them, Baylor comes across a local woman named Tha (Ann Truong) who helps him get to the border. As the hunt continues, Aldrich gives the hunters motorcycles equipped with guns and rocket launchers. Baylor fights them and commandeers a motorcycle, leaving Tha alone. Zimling and Tobias attempt to kill Tha, but Tobias has a brief change of heart and flees. Tha then kills Zimling, while Baylor fights Sofia. After knocking her unconscious, he regroups with Tha and they run away. The two go to Tha's house to treat wounds, where Baylor learns something strange about Tha and her village.\n\nAfter running towards the border, Tha and Baylor come across a field full of landmines. Aldrich and the party arrive at the edge of the minefield, having tracked Baylor via the GPS. Tobias, angered by the death of his father, enters the minefield and dies by triggering one. The explosion gives Baylor and Tha enough time to hide in a cave, where Tha finds her missing brother who is revealed as a previous target of Aldrich's group. He had managed to evade the hunting group's detection and hide.\n\nIn the morning, Tha and her brother run away, leaving Baylor behind. Tha and her brother are captured, and Baylor rescues them by capturing Landon. Tha then kills Sofia. Meanwhile, Landon is killed by Aldrich for recording all of the events, which of course was forbidden. Baylor, Tha, and her brother all reach the border and wonder how Aldrich continuously captures them. They find the tracker in the money belt. Baylor takes on the soldiers working for Aldrich and remaining hunters alone while Tha and her brother hide. Esparto goes after Tha and her brother and is killed. Meanwhile, Baylor runs away with the boat from the army camp and heads towards the border.\n\nPursued by the army, Baylor manages to reach the border bridge, where he faces Aldrich and Madden in a final showdown. Finally, Tha uses the money belt to bribe the Army General into killing Aldrich. Having survived the ordeal, Baylor returns to Thailand with Tha and teaches children martial arts.",
  "synopsis": null
}