{
  "imdb_id": "tt5275730",
  "tmdb_id": "422364",
  "douban_id": null,
  "title": "The West Tako Cheerleaders (1987)",
  "genres": [
    "Action",
    "Comedy",
    "Drama"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "89 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm0368051",
      "name": "Izô Hashimoto"
    }
  ],
  "writer": [
    {
      "id": "nm2204740",
      "name": "Masayoshi Azuma",
      "description": null
    },
    {
      "id": "nm0368051",
      "name": "Izô Hashimoto",
      "description": null
    },
    {
      "id": "nm7795253",
      "name": "Juzo Tokoro",
      "description": "manga"
    },
    {
      "id": "nm4751651",
      "name": "Chiaki Watanabe",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1076600",
      "name": "Ginji Gao",
      "character": ""
    },
    {
      "id": "nm0949102",
      "name": "Akie Yoshizawa",
      "character": ""
    },
    {
      "id": "nm1474259",
      "name": "Kazuki Minabuchi",
      "character": ""
    },
    {
      "id": "nm7663314",
      "name": "Miki Itô",
      "character": "Ryoko Shima"
    },
    {
      "id": "nm0793671",
      "name": "Kôjiro Shimizu",
      "character": ""
    }
  ],
  "overview": "A boy seeks manhood in joining his school’s militaristic cheer squad.",
  "storyline": null,
  "plot": "The play was inspired by Giacomo Puccini's opera Madama Butterfly. The first act introduces the main character, Rene Gallimard, who is a civil servant attached to the French embassy in China. He falls in love with a beautiful Chinese opera diva, Song Liling, who is actually a man masquerading as a woman. In traditional Beijing opera, females were banned from the stage; all female roles (dan) were played by males. The first act ends with Gallimard returning to France in shame and living alone after his wife, Helga, finds out about his affair with Song and leaves him.\n\nAct two begins with Song coming to France and resuming the affair with Gallimard. They stay together for 20 years until the truth is revealed, and Gallimard is convicted of treason and imprisoned. Unable to face the fact that his \"perfect woman\" is actually a man, that has been posing as a woman for 20 years to be able to spy, he retreats deep within himself and his memories. The action of the play is depicted as his disordered, distorted recollection of the events surrounding their affair.\n\nThe third act portrays Gallimard committing seppuku (also known as harakiri, ritual Japanese suicide through self-disembowelment) while Song watches and smokes a cigarette.",
  "synopsis": null
}