{
  "imdb_id": "tt5254414",
  "tmdb_id": "411807",
  "douban_id": null,
  "title": "In Pursuit of Peace (2015)",
  "genres": [
    "Documentary"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "87 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm0067303",
      "name": "Garry Beitel"
    }
  ],
  "writer": [
    {
      "id": "nm0067303",
      "name": "Garry Beitel",
      "description": "writer"
    }
  ],
  "cast": null,
  "overview": "In Pursuit of Peace follows four Canadians on the front lines of international peace initiatives - in South Sudan, Turkey, Congo and Iraq. We experience the challenges of their work, exploring how their peace building strategies are put to the test in this new 21st century paradigm of conflict resolution.",
  "storyline": "In Pursuit of Peace follows four Canadians on the front lines of international peace initiatives - in South Sudan, Turkey, Congo and Iraq. We experience the challenges of their work, exploring how their peace building strategies are put to the test in this new 21st century paradigm of conflict resolution.",
  "plot": "The series is set in the time of World War II during the Japanese occupation of Singapore. The effects of war on people's lives are dramatically portrayed in the drama, which centres on the daily lives of characters from three different families and how they lived through the occupation.\n\nIn contrast with The Price of Peace, a similar television drama aired on the same channel in 1997, In Pursuit of Peace focuses on the development of the characters, while the former focuses more on historical aspects of the Japanese occupation. Themes of friendship, father-son relationship, romance are explored in this series, revolving around the main characters. This series, unlike its predecessor, also places emphasis on major events that happened in Singapore during the occupation, such as the $50 million donation by the Overseas Chinese Association and the gradual collapse of local Japanese morale towards the end of the war.",
  "synopsis": null
}