{
  "imdb_id": "tt5278004",
  "tmdb_id": "334780",
  "douban_id": null,
  "title": "Drei Eier im Glas (2015)",
  "genres": [
    "Comedy"
  ],
  "country": "Austria",
  "version": [
    {
      "runtime": "88 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm0841326",
      "name": "Antonin Svoboda"
    }
  ],
  "writer": [
    {
      "id": "nm0342623",
      "name": "Christoph Grissemann",
      "description": null
    },
    {
      "id": "nm1146327",
      "name": "Dirk Stermann",
      "description": null
    },
    {
      "id": "nm0835345",
      "name": "Heinz Strunk",
      "description": null
    },
    {
      "id": "nm0841326",
      "name": "Antonin Svoboda",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0121974",
      "name": "Ingrid Burkhard",
      "character": "Mutter Drakuhl"
    },
    {
      "id": "nm0125379",
      "name": "Haymon Maria Buttinger",
      "character": "Helmut"
    },
    {
      "id": "nm1065109",
      "name": "Christian Dolezal",
      "character": "Nachbar Alfred"
    },
    {
      "id": "nm0342623",
      "name": "Christoph Grissemann",
      "character": "Dragan 'Drakuhl' Kuhl"
    },
    {
      "id": "nm0406137",
      "name": "Wolfgang Hübsch",
      "character": "Meinhard Gnom"
    },
    {
      "id": "nm7996753",
      "name": "Sascha Merényi",
      "character": "Kunde"
    },
    {
      "id": "nm1797101",
      "name": "Davis O. Nejo",
      "character": "Richard Song"
    },
    {
      "id": "nm1927263",
      "name": "Angelika Niedetzky",
      "character": ""
    },
    {
      "id": "nm7797210",
      "name": "Martin Scheiner",
      "character": "Rainer Werner"
    },
    {
      "id": "nm1146327",
      "name": "Dirk Stermann",
      "character": "Bernhard 'Barney' Schweinheimer"
    },
    {
      "id": "nm0833909",
      "name": "Peter Strauß",
      "character": "Hubert"
    },
    {
      "id": "nm1306697",
      "name": "Ursula Strauss",
      "character": "Heidrun Fröhlich"
    },
    {
      "id": "nm0835345",
      "name": "Heinz Strunk",
      "character": "Michael Kiesel"
    },
    {
      "id": "nm7417273",
      "name": "Roland Trnka",
      "character": "Coroner"
    },
    {
      "id": "nm0874792",
      "name": "Alexander Tschernek",
      "character": "Manfred"
    }
  ],
  "overview": "According to an African fairy tale, every child receives a song from their parents that they carry with them throughout their lives. Richard, an orphaned Tanzanian immigrant, has never had his own song. How he got one before his unexpected death and the significant, though unintended, roles played by the dark-tourism entrepreneur Drakuhl, the gray-haired hair model Barney and the heavy-drinking music teacher Kiesel won't be revealed here. Merely that the song Dead Man Play becomes an international hit.",
  "storyline": null,
  "plot": "In the 1960s, Reggie Kray is a former boxer who has become an important part of the criminal underground in London. At the start of the film, his twin brother Ron is locked up in a psychiatric hospital for insanity and paranoid schizophrenia. Reggie uses threats to obtain the premature release of his brother, who is rapidly discharged from hospital. The two brothers unite their efforts to control a large part of London's criminal underworld. One of their first efforts is to muscle-in on the control of a local night club, using extortion and brutal violence.\n\nReggie enters into a relationship with Frances, the sister of his driver, and they ultimately marry; however, he is imprisoned for a previous criminal conviction, which he cannot evade. While Reggie is in prison, Ron's mental problems and violence lead to severe setbacks at the nightclub. The club is almost forced to close after Ron scares away most of the customers. When Reggie is finally released from prison, the two brothers have an all-out fist fight on the first night after Reggie's release, but they manage to partially patch things up.\n\nThe brothers are approached by Angelo Bruno of the Philadelphia crime family on behalf of Meyer Lansky and the American Mafia, to try to interest them in a crime syndicate deal. Bruno agrees to a fifty-fifty deal with Reggie to split London's underground gambling profits in exchange for local protection from the Kray brothers. Initially, this system is highly lucrative for the Kray brothers. However, the results of Ron's barely concealed violence continues to cause problems with Scotland Yard. The police open a full investigation on the Kray brothers.\n\nReggie beats and rapes Frances and she leaves him. Reggie then approaches her to start afresh offering her a holiday to Ibiza. However, she is soon found dead after committing suicide with an overdose of prescription drugs. The brothers' criminal activities continue, and they are unable to thwart the escalating Scotland Yard investigation by Detective Superintendent Leonard \"Nipper\" Read, who soon arrests Ron. The final scene shows a police squad breaking down the door to Reggie's apartment in order to apprehend him.\n\nThe closing captions indicate both brothers receiving criminal convictions for murder. They died five years apart, Ron from a heart attack in 1995, and Reggie from cancer in 2000.",
  "synopsis": null
}