{
  "imdb_id": "tt5347148",
  "tmdb_id": "390432",
  "douban_id": null,
  "title": "A Weekend with the Family (2016)",
  "genres": [
    "Comedy"
  ],
  "country": "USA",
  "version": [],
  "imdb_rating": 5.7,
  "director": [
    {
      "id": "nm0831321",
      "name": "Chris Stokes"
    }
  ],
  "writer": [
    {
      "id": "nm2977117",
      "name": "Chaz Echols",
      "description": null
    },
    {
      "id": "nm0396867",
      "name": "Marques Houston",
      "description": null
    },
    {
      "id": "nm0831321",
      "name": "Chris Stokes",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0396867",
      "name": "Marques Houston",
      "character": "Travis Stankershet"
    },
    {
      "id": "nm6556496",
      "name": "Karrueche Tran",
      "character": "Courtney Clancy"
    },
    {
      "id": "nm0733185",
      "name": "Wendy Raquel Robinson",
      "character": "Nip Stankershet"
    },
    {
      "id": "nm0694066",
      "name": "Clifton Powell",
      "character": "Dingo Stankershet"
    },
    {
      "id": "nm0933332",
      "name": "Dorien Wilson",
      "character": "John Clancy"
    },
    {
      "id": "nm0923560",
      "name": "Suzanne Whang",
      "character": "Sue Clancy"
    },
    {
      "id": "nm2624894",
      "name": "Black Thomas",
      "character": "Sargent Stankershet"
    },
    {
      "id": "nm6613760",
      "name": "Chantel Jeffries",
      "character": "Catherine Clancy"
    },
    {
      "id": "nm1414931",
      "name": "Shondrella Avery",
      "character": "Rosie"
    },
    {
      "id": "nm0670299",
      "name": "Kelly Perine",
      "character": "Vagabond"
    },
    {
      "id": "nm1209934",
      "name": "Braxton Davis",
      "character": "Ho-Jin"
    },
    {
      "id": "nm0600721",
      "name": "Dylan Mooney",
      "character": "Counselor Watson"
    },
    {
      "id": "nm0110232",
      "name": "Tracy Lynch Britton",
      "character": "the Judge"
    },
    {
      "id": "nm1216791",
      "name": "Jarell Houston",
      "character": "Joey"
    },
    {
      "id": "nm5939012",
      "name": "Daniela Lee",
      "character": "Hojin's Assistant"
    }
  ],
  "overview": "A Young Attorney looks to gain a position at a Prestigious Law firm while secretly dating his Boss' Daughter",
  "storyline": "A young attorney looks to gain a position at a prestigious law firm while secretly dating his boss' daughter, who he's hoping to marry; but when his loving girlfriend decides to arrange a surprise family weekend get-together, his plans blow up in his face, especially with the arrival of his ghetto-fied family, the Stankershets. Travis and Courtney portray love interests who struggle to hold on to their relationship all while their two families wage war in an explosion of hilarity. It's the far east against the deep south; strict, traditional, Korean customs versus a backwards, country way of life. In the end, Travis must find a way to make the two families peacefully co-exist long enough for him to propose to the woman he loves.",
  "plot": "Hiro Hamada, a 14-year-old robotics genius in the futuristic city of San Fransokyo, spends much of his free time participating in illegal robot fights. To redirect Hiro, his elder brother Tadashi takes him to the research lab at the San Fransokyo Institute of Technology, where Hiro meets Tadashi's friends, GoGo, Wasabi, Honey Lemon, and Fred, as well as Baymax, the inflatable healthcare robot Tadashi created. Hiro also meets Professor Robert Callaghan, the head of the university's robotics program. Amazed, Hiro decides to apply to the university. To enroll, he signs up for the school's science fair and presents his project: microbots, swarms of tiny robots that can link together in any arrangement imaginable using a neuro-cranial transmitter. Hiro declines an offer from Alistair Krei, CEO of Krei Tech, to market the microbots, and Callaghan accepts him into the school. When a fire breaks out among the exhibits, Tadashi rushes in to save Callaghan, but a sudden explosion apparently kills both of them.\n\nWeeks later, a depressed Hiro inadvertently reactivates Baymax, who follows Hiro's only remaining microbot to an abandoned warehouse. There, the two discover that someone has been mass-producing the microbots and are attacked by a man wearing a Kabuki mask who is controlling them. After they escape, Hiro equips Baymax with armor and a battle chip containing various karate moves and they track the masked man to the docks. GoGo, Wasabi, Honey Lemon, and Fred arrive and the masked man chases the group. The six escape to Fred's mansion where they decide to form a superhero team to combat the man.\n\nThe group tracks the masked man, who they suspect to be Krei, to an abandoned Krei Tech laboratory which had been used for teleportation research until a test pilot was lost in an accident. The masked man attacks, but the group reveals him as Callaghan, who had stolen Hiro's microbots to shield himself from the explosion on campus. Realizing that Tadashi died in vain, an enraged Hiro removes Baymax's healthcare chip, leaving only the battle chip, and orders him to kill Callaghan. Honey re-installs the healthcare chip at the last second, preventing Baymax from carrying out the kill order. Callaghan escapes, and Hiro leaves with Baymax, intent on avenging himself. Back home, Hiro tries to remove the healthcare chip again, but Baymax stops him and states that vengeance is not what Tadashi would have wanted. To calm him down, Baymax shows Hiro videos of Tadashi running numerous tests during Baymax's development as a demonstration of Tadashi's benevolence and legacy. A remorseful Hiro apologizes to Baymax and his friends, who reassure him they will catch Callaghan the right way.\n\nVideo footage from the accident reveals that the pilot was Callaghan's daughter Abigail, and that Callaghan is seeking revenge on Krei. Callaghan interrupts Krei at a public event and attempts to destroy his headquarters using Krei's teleportation portal. After a lengthy battle, the team deprives Callaghan of his microbots and the mask, saving Krei, but the portal remains active. Baymax detects Abigail inside, alive but in hyper-sleep, and leaps into the portal with Hiro to rescue her. They find Abigail's pod, but on the way back out, Baymax is struck by debris, damaging his armor and disabling his thrusters. Knowing that the portal will collapse, Baymax uses his armor's rocket fist to propel Hiro and Abigail back through the portal, forcing them to leave him behind. Callaghan is arrested while Abigail is taken to the hospital. Sometime later, Hiro discovers Baymax's personality chip clenched in the rocket fist. He rebuilds Baymax's body and the six friends continue their exploits through the city, fulfilling Tadashi's dream of helping those in need.\n\nDuring the end credits, a series of newspaper headlines reveals that the university has awarded Hiro a grant and dedicated a building in Tadashi's honor, and that the team has continued protecting the city. In a post-credits scene, Fred discovers a hidden cache of superhero equipment in his family mansion. His father, a retired superhero, returns from vacation and says, \"We have a lot to talk about.\"",
  "synopsis": "A young attorney looks to gain a position at a prestigious law firm while secretly dating his boss daughter, who he's hoping to marry; but when his loving girlfriend decides to arrange a surprise family weekend get-together, his plans blow up in his face, especially with the arrival of his ghetto-fied family, the Stankershets. Travis (Marques Houston) and Courtney (Karrueche Tran) portray love interests who struggle to hold on to their relationship all while their two families wage war in an explosion of hilarity. It's the far east against the deep south; strict, traditional, Korean customs versus a backwards, country way of life. In the end, Travis must find a way to make the two families peacefully co-exist long enough for him to propose to the woman he loves."
}