{
  "imdb_id": "tt5336902",
  "tmdb_id": "314076",
  "douban_id": null,
  "title": "Short Fuse (2016)",
  "genres": [
    "Action",
    "Mystery",
    "Thriller"
  ],
  "country": "Greece",
  "version": [
    {
      "runtime": "86 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm3857698",
      "name": "Andreas Lampropoulos"
    },
    {
      "id": "nm3857525",
      "name": "Kostas Skiftas"
    }
  ],
  "writer": [
    {
      "id": "nm7847261",
      "name": "Konstantinos Moutsinas",
      "description": null
    },
    {
      "id": "nm3857525",
      "name": "Kostas Skiftas",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1688987",
      "name": "Apostolis Totsikas",
      "character": "Ares Apostolou"
    },
    {
      "id": "nm0636739",
      "name": "Tasos Nousias",
      "character": "Miltos"
    },
    {
      "id": "nm2776138",
      "name": "Evgenia Dimitropoulou",
      "character": "Anna"
    },
    {
      "id": "nm0548607",
      "name": "Constantine Markoulakis",
      "character": "Tortured Guy"
    },
    {
      "id": "nm0040440",
      "name": "Thodoris Atheridis",
      "character": "Menelaos Apostolou"
    },
    {
      "id": "nm0650512",
      "name": "Nikos Orfanos",
      "character": "Lieutenant Lazarou"
    },
    {
      "id": "nm0998958",
      "name": "Nikos Kouris",
      "character": "Chief of Police"
    },
    {
      "id": "nm0051165",
      "name": "Irini Balta",
      "character": "Katerina Apostolou"
    },
    {
      "id": "nm1172134",
      "name": "Manos Gavras",
      "character": "Mitsos"
    },
    {
      "id": "nm0438869",
      "name": "Yorgos Karamihos",
      "character": "Lawyer"
    },
    {
      "id": "nm3222538",
      "name": "Giorgos Roustemis",
      "character": "Timos"
    },
    {
      "id": "nm1416584",
      "name": "Doretta Papadimitriou",
      "character": "Athena"
    },
    {
      "id": "nm0699620",
      "name": "Nikos Psarras",
      "character": "Athena's Husband"
    },
    {
      "id": "nm3935748",
      "name": "Yannis Rubus Rubulias",
      "character": "Bodyguard #1"
    },
    {
      "id": "nm7847259",
      "name": "Konstantinos Sinetos",
      "character": "Bodyguard #3"
    },
    {
      "id": "nm7847260",
      "name": "Kirilos Hioktouridis",
      "character": "Mafia Guy"
    },
    {
      "id": "nm4149975",
      "name": "Giorgos Galanis",
      "character": "Bodyguard #2"
    },
    {
      "id": "nm2798061",
      "name": "Kelly Kaimaki",
      "character": "Lawyer's Secretary"
    },
    {
      "id": "nm3796124",
      "name": "Thanos Kermitsis",
      "character": "Doctor"
    },
    {
      "id": "nm10168146",
      "name": "Foivos Daskalakis",
      "character": "Little Ares"
    },
    {
      "id": "nm10168147",
      "name": "Ioanna Kirolivanou",
      "character": "Singer"
    }
  ],
  "overview": "In this ticking clock action-thriller, a courier's last delivery of the day may also be the last day of his life. Strapped with explosives, he must fight for his life while trying to solve a mystery involving both his family and a criminal empire.",
  "storyline": "In this ticking clock action-thriller, a courier's last delivery of the day may also be the last day of his life. Strapped with explosives, he must fight for his life while trying to solve a mystery involving both his family and a criminal empire.",
  "plot": "S.D. Blass (Art Garfunkel) is a beat journalist for the Washington Daily Tribune newspaper in Washington, D.C. His editor-in-chief pressures him to deliver more featured stories, as it's been too long since Blass has had a decent article printed. Blass reaches out to Matthew Harrigan (Harris Yulin), a detective for the Washington Metropolitan Police department, looking for a good story to pursue. He learns about a nurse that was raped and murdered on her way home after working the night shift at Washington Metropolitan Hospital. Unbeknownst to Blass, the detective had fabricated the police report and placed the primary blame on go-go music and its concert goers. Blass take the story and publishes it with the title: \"Nurse Murdered at Go-Go: Music and Drugs Blamed for Violence.\"\n\nMeanwhile, Max (the owner of \"Maxx Saxx Entertainment\") manages three of the city's top go-go bands. After fifteen years of playing at local clubs, he feels the timing is perfect to take go-go music nationally. He arranges a sit-down meeting at the Watergate complex with Gil Colton (an L.A.-based record producer) hoping he'll sign his artists to a recording contract. Colton loves the music and the band's energy when performing live at the local clubs. However, he's worried about all of the bad press and media attention that's associated with the live performances. Because of this, he decides not to sign the artist and heads back to L.A.\n\nLittle Beats (an up-and-coming conga player for one of Max's go-go bands) has an older brother (\"Chemist\") who was once a promising college student majoring in chemistry. However, he started using illegal drugs, primarily PCP (aka \"Luv Boat\"), and is now robbing and stealing to finance his drug addiction. He also hangs with Mr. Ain't (Fred Brathwaite) and his street crew as they travel around the city wreaking havoc, including the rape and murder of the nurse. Eventually, this leads to Chemist being falsely accused and charged with the murder and rape. Little Beats is apprehended by Det. Harrigan, with hopes of getting more information of Chemist's whereabouts. Blass (now aware that the detective has been fabricating many of his police reports) has chosen to disassociate himself with Harrigan. He gets in touch with Little Beats, Chemist, and their mother and works to clear Chemist of the allegations, along with exposing the police misconduct of Det. Harrigan.",
  "synopsis": null
}