{
  "imdb_id": "tt5347472",
  "tmdb_id": "379344",
  "douban_id": null,
  "title": "Usted No Sabe Quien Soy Yo? (2016)",
  "genres": [
    "Comedy",
    "Family"
  ],
  "country": "Colombia",
  "version": [
    {
      "runtime": "95 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.3,
  "director": [
    {
      "id": "nm5412893",
      "name": "Fernando Ayllón"
    },
    {
      "id": "nm7856396",
      "name": "Andres Felipe Orjuela"
    }
  ],
  "writer": [
    {
      "id": "nm5412893",
      "name": "Fernando Ayllón",
      "description": null
    },
    {
      "id": "nm7072315",
      "name": "Ricardo Quevedo",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm7072315",
      "name": "Ricardo Quevedo",
      "character": ""
    },
    {
      "id": "nm7856397",
      "name": "Freddy Beltrán",
      "character": ""
    },
    {
      "id": "nm7856398",
      "name": "Iván Marín",
      "character": ""
    },
    {
      "id": "nm2061519",
      "name": "Abril Schreiber",
      "character": ""
    },
    {
      "id": "nm2637669",
      "name": "Aida Morales",
      "character": ""
    },
    {
      "id": "nm1096399",
      "name": "Natalia Duran",
      "character": ""
    }
  ],
  "overview": "Is the fun story of Ricardo, an amateur comedian who tries to reach the fame by doing stand up comedy in Bogota bar's. He's heart broken because his girlfriend ended their relationship and is now with an older and richer man. With two friends, he decides that he must pretend to be someone of better social class in order to emerge in Colombian society. So Ricardo pretends to be a millionaire in social networks. But the problem begins when he meets and felt in love with Margarita, who believes he is the owner of a radio stations network.",
  "storyline": "Is the fun story of Ricardo, an amateur comedian who tries to reach the fame by doing stand up comedy in Bogota bar's. He's heart broken because his girlfriend ended their relationship and is now with an older and richer man. With two friends, he decides that he must pretend to be someone of better social class in order to emerge in Colombian society. So Ricardo pretends to be a millionaire in social networks. But the problem begins when he meets and felt in love with Margarita, who believes he is the owner of a radio station.",
  "plot": null,
  "synopsis": null
}