{
  "imdb_id": "tt5365004",
  "tmdb_id": "234094",
  "douban_id": null,
  "title": "Dream Theater: Live at Luna Park (Video 2013)",
  "genres": [
    "Music"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "189 min",
      "description": ""
    }
  ],
  "imdb_rating": 9.0,
  "director": [
    {
      "id": "nm3045811",
      "name": "Mike Leonard"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm2138539",
      "name": "James LaBrie",
      "character": "Himself - Vocals"
    },
    {
      "id": "nm1906307",
      "name": "Mike Mangini",
      "character": "Himself - Drums"
    },
    {
      "id": "nm2104936",
      "name": "John Myung",
      "character": "Himself - Bass"
    },
    {
      "id": "nm2146562",
      "name": "John Petrucci",
      "character": "Himself - Guitar"
    },
    {
      "id": "nm2141775",
      "name": "Jordan Rudess",
      "character": "Himself - Keyboards"
    },
    {
      "id": "nm4923632",
      "name": "Dream Theater",
      "character": "Themselves"
    }
  ],
  "overview": "Live at Luna Park is a live album/video by American progressive metal band Dream Theater, released on November 5, 2013 through Eagle Rock Entertainment. The concert film was produced by Over The Edge Productions and directed by Mike Leonard. The album is available on Blu-ray, a two DVD set and Blu-ray plus two DVD combo with three CDs and a Deluxe Edition with a 40-page book. The album will also be available on iTunes.  The album was recorded over two nights at Luna Park Stadium in Buenos Aires. The DVD-Blu-ray will also feature a documentary as well as Behind The Scenes-footage. It is also the first Dream Theater live recording to feature drummer Mike Mangini, following Mike Portnoy's departure in 2010.  Dream Theater are rocks supreme virtuosos with many awards to their name and here in concert they bring all the power and drama of their music to life with breathtaking performances of classic tracks from across their career.",
  "storyline": "Live concert recorded on August 19 and 20, 2012 at Luna Park Stadium in Buenos Aires, Argentina, supporting their \"A Dramatic Turn of Events\" album.",
  "plot": null,
  "synopsis": null
}