{
  "imdb_id": "tt5328784",
  "tmdb_id": "371425",
  "douban_id": null,
  "title": "Bangalore Naatkal (2016)",
  "genres": [
    "Drama"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "156 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.0,
  "director": [
    {
      "id": "nm2347386",
      "name": "Bhaskar"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm1951127",
      "name": "Arya",
      "character": "Arjun"
    },
    {
      "id": "nm4248233",
      "name": "Sri Divya",
      "character": "Divya Raghavan"
    },
    {
      "id": "nm5654277",
      "name": "Bobby Simha",
      "character": "Kannan"
    },
    {
      "id": "nm2281292",
      "name": "Rana Daggubati",
      "character": "Prasad"
    },
    {
      "id": "nm2527173",
      "name": "Parvathy Thiruvothu",
      "character": "RJ Sarah       (as Parvathy)"
    },
    {
      "id": "nm2843559",
      "name": "Raai Laxmi",
      "character": "Lakshmi"
    },
    {
      "id": "nm3606487",
      "name": "Samantha Ruth Prabhu",
      "character": "Guest Appearance"
    },
    {
      "id": "nm0695177",
      "name": "Prakash Raj",
      "character": "Grace's Father"
    },
    {
      "id": "nm0764853",
      "name": "Saranya Ponvannan",
      "character": "Kannan's Mother"
    },
    {
      "id": "nm9969854",
      "name": "Rekha",
      "character": "Sarah's Mother       (as Rekha)"
    },
    {
      "id": "nm2132667",
      "name": "M.S. Bhaskar",
      "character": "Kannan's Father"
    },
    {
      "id": "nm2696440",
      "name": "Pattimandram Raja",
      "character": ""
    },
    {
      "id": "nm1560660",
      "name": "Sriranjani",
      "character": ""
    },
    {
      "id": "nm6928254",
      "name": "Prinz Nithik",
      "character": ""
    }
  ],
  "overview": "Three cousins — Arjun (Arya), Divya (Sri Divya) and Kutty (Simhaa) get to realise their childhood dream of living in Bangalore, and have to deal with the turns that their lives take there.",
  "storyline": "The film is a remake of the Malayalam smash hit - Bangalore Days. It s the story of three cousins - Divya, Kuttan and Arjun, fulfill their childhood dreams of relocating to Bangalore. As they embrace the warmth of the city, they also face challenges that transform their lives.",
  "plot": "The film's story revolves around three cousins Divya \"Ammu\" Raghavan (Sri Divya), Kannan \"Kutty\" (Bobby Simha) and Arjun \"Ajju\" (Arya), who share a close bond since their childhood. Kutty is a software engineer whose heart and soul is back home in his village. Ajju, whose parents are divorced, is a bike mechanic who lives his life on his own terms. Ammu has completed her B.Com and aspires to do her MBA from IIM but is compelled to get married to workaholic corporate executive Shivaprasad \"Prasad\" (Rana Daggubati) because of her family astrologer's dire predictions. After their wedding, Ammu moves to Bangalore as Prasad is settled there. Kutty too relocates to Bangalore for his job while Ajju joins a biker gang as a mechanic in the same city.\n\nAmmu feels lonely as Prasad often goes on long corporate trips and ignores her. Her only solace is the time she gets to spend with her cousins Ajju and Kutty. One day, upon inspecting a room in their apartment that Prasad never lets anyone enter, she is shocked to find it filled with photos, knickknacks and possessions of a woman (Samantha). In thought of not having a place in Prasad's heart and life, she leaves Prasad and returns to her village in sorrow.\n\nNaive Kutty, who wants a traditional, modest, saree-clad girl for a wife, falls in love with an air hostess named Lakshmi (Raai Laxmi) on a flight from Bangalore to Coimbatore. They date and Kutty changes from a reserved and shy person to a trendy person to impress her. But his dreams are shattered when her ex-boyfriend arrives at her apartment and he realizes that she was only trying to get back with him. He breaks off his relationship with her.\n\nAjju was a bike racer but due to a misdemeanour, he is forced to serve a one-year ban from racing. Rakesh, who is now a top-bike racer, troubles Ajju. Ajju eventually hits him but stopped by Coach Zechria. Rakesh tells that Ajju is best in fighting, but he is best in racing. Ajju falls for a radio jockey named Sarah (Parvathy), but when he finally meets her in person, he finds that she is a paraplegic. He starts to like her attitude and follows her. They become good friends, but Ajju is saddened when he learns that Sarah is to leave for Australia on a University scholarship.\n\nMeanwhile, as Ammu and Prasad are in the middle of getting a divorce, Ajju learns that a few years back that Prasad was a bike racer. He then went by the name Shiva and was the leader of his biker gang. Shiva had given up on racing after he was involved in an accident that killed his girlfriend Grace Deiva Pushpam (who was the girl whose photos and possessions Ammu had earlier discovered in Prasad's room). Upon knowing what happened, Ammu decides to return to Bangalore and works towards her MBA. She gradually wins over a repentant Prasad and soon arranges for him to meet Grace's parents (played by Prakash Raj and Vinaya Prasad). After the meeting, Prasad is able to let go of his past. Ammu forgives him and they get their marital life on track.\n\nAjju gets a chance to race on the same day that Sarah has to leave for Australia. Rakesh also arrives. With Ammu, Kutty and Prasad cheering for him, he wins the race. After the race, Ajju realizes how important Sarah is to him and his life. He pleads with her not to go to Australia. Sarah forgoes her scholarship to stay with him in Bangalore.\n\nIn the end, Kutty gets married to his neighbor in Bangalore, a European Bharathanatyam dancer, Michelle (Paris Laxmi), who has embraced the culture of India. The film ends with Ammu, Prasad, Ajju and Sarah breaking into Kutty's room and all of them posing for a photo.",
  "synopsis": null
}