{
  "imdb_id": "tt5304086",
  "tmdb_id": "370720",
  "douban_id": null,
  "title": "Dictator (2016)",
  "genres": [
    "Action",
    "Drama"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "155 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.5,
  "director": [
    {
      "id": "nm6725244",
      "name": "Sriwass"
    }
  ],
  "writer": [
    {
      "id": "nm2022987",
      "name": "Gopimohan",
      "description": "story, screenplay"
    },
    {
      "id": "nm8010673",
      "name": "M. Ratnam",
      "description": "dialogue"
    },
    {
      "id": "nm3964880",
      "name": "Sreedhar Seepana",
      "description": null
    },
    {
      "id": "nm0893128",
      "name": "Kona Venkat",
      "description": "story, screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0049395",
      "name": "Nandamuri Balakrishna",
      "character": "Chandrashekhar Dharma       (as Balakrishna)"
    },
    {
      "id": "nm3592766",
      "name": "Anjali",
      "character": "Kathyayani"
    },
    {
      "id": "nm2978161",
      "name": "Sonal Chauhan",
      "character": "Indu"
    },
    {
      "id": "nm5161145",
      "name": "Vikramjeet Virk",
      "character": "Vicky"
    },
    {
      "id": "nm0621937",
      "name": "Nassar",
      "character": "Lakshmi Narayana       (as Nasser)"
    },
    {
      "id": "nm0013159",
      "name": "Rati Agnihotri",
      "character": "Mahima Rai"
    },
    {
      "id": "nm1167594",
      "name": "Nawab Shah",
      "character": "Viswambhar"
    },
    {
      "id": "nm7216750",
      "name": "Kabir Duhan Singh",
      "character": "Panda"
    },
    {
      "id": "nm0793851",
      "name": "Sayaji Shinde",
      "character": "Bokha Sivaram"
    },
    {
      "id": "nm0838520",
      "name": "Suman",
      "character": "Shekar Dharma"
    },
    {
      "id": "nm6442108",
      "name": "Kalyani N.",
      "character": "Mrs. Lakshmi Narayana"
    },
    {
      "id": "nm3953956",
      "name": "Stefan Alamanov",
      "character": "Bodyguard #1"
    },
    {
      "id": "nm3808948",
      "name": "Vennela Kishore",
      "character": ""
    },
    {
      "id": "nm7945656",
      "name": "Arjun Kolishetty",
      "character": "Arjun"
    },
    {
      "id": "nm3766373",
      "name": "Gautam Kurup",
      "character": "Hit Man"
    },
    {
      "id": "nm9637391",
      "name": "Venkat Prasad",
      "character": ""
    }
  ],
  "overview": "Dictator is an upcoming Telugu film, jointly produced by Eros International and Sriwass under Vedhaaswa Creations banner, directed by Sriwass. The film stars Nandamuri Balakrishna, Anjali and Sonal Chauhan in the lead roles. Music is composed by S. Thaman.It is the 99th movie in the career of Nandamuri Balakrishna. The movie is planned to release in January 14, 2016 as Sankranthi Release. The movie is going to be released also in Tamil and Malayalam as dubbed version simultaneously.",
  "storyline": "Chandu(Balakrishna) lives a normal life with his in laws in Hyderabad. One fine day, he comes across an aspiring actress(Sonal Chauhan) and helps her in a critical situation. The problems gets big and Chandu lands himself in a huge mess.",
  "plot": "Chandu (Nandamuri Balakrishna) works at Dharma Mart as a special in charge. He is living with his wife Katyayani’s (Anjali) family in Hyderabad and everyone thinks that Katyayani is working in Delhi. Aspiring actress Indu (Sonal Chauhan) befriends Chandu. She is in trouble because Hyderabad Don (Vikramjeet Virk) is hunting for her brother (Rajiv Kanakala). When she is kidnapped, Chandu locks horns with the Don (Vikramjeet Virk) and this gets him in direct enmity with Minister Goverdhan Rao (Madhu) and corrupt Police officer Prabhakar (Ajay). Meanwhile, one of the colleague of Chandu, Babji (Kasi Viswanath) steals some money from supermarket’s account for his daughter’s marriage but Chandu takes the blame on him. He is arrested and gets the attention of company Chairman Rajashekar Dharma (Suman), then his uncle Lakshmi Narayana (Nassar) and his family demands for the truth. Things change as Rajashekar reveals the true identity of Chandu as Chandrashekar Dharma The Dictator, Chairman of Dharma group of companies.\n\nChandrasekhar Dharma is one of the big shots in India, who fights against the mafia, eliminates all the gangsters and protects all businessmen in Delhi as a Dictator. Once he meets Katyayani, one of the employees in his companies. Both of them fall in love since Katyayani’s father Lakshmi Narayana doesn’t like rich people she introduces him as her co-employee Chandu and they get married. After sometime Chandrasekhar Dharma locks horns with a powerful lady Mahima Roy (Rati Agnihotri) who is responsible for killing the Hari Prasad (Kulbhushan Kharbanda) father figure of Chandrasekhar, by her son-in-law Viswambhar (Nawab Shah). Mahima Roy kidnaps the family members of Chandrasekhar and forces Chandrasekhar to arrive at her house. Mahima at first asks Chandrasekhar to fall at her feet. Mahima then receives calls from her relatives all over the world, Chandrasekhar later revealing that he has kidnapped all of his relatives across the world, proving his network. Chandrasekhar decides to kill Viswambhar and orders his men to kill him. Mahima Roy makes an attack on Chandrasekhar and in the fight his wife Katyayani gets stabbed by Mahima's men. On his wife's request Chandrasekhar leaves Delhi and changes his identity to live as a common man.\n\nIt is then revealed by Rajasekhar that Viswambhar is still alive, two of Chandrasekhar's men having betrayed him. One of Chandrasekhar's family members (Sayaji Shinde), his uncle, who had turned against him in the past, goes to Viswambhar and informs him that Chandrasekhar is going to conduct necessary rites for the dead Hariprasad and it would be a good opportunity to kill him. When Viswambhar arrives at the spot along with his men to kill Chandrasekhar. it is revealed that Sivaram (Sayaji Shinde) had sided with Chandrasekhar to bring Viswambhar out of his hiding. Chandrasekhar then kills Viswambhar and his gang and then forces Mahima Roy to leave the country, warning her for the last time that if she comes back to India, she will suffer the same fate as her son-in-law. Chandrasekhar then returns as Chandrasekhar Dharma, the Dictator, chairman of the industrialist's association of Delhi.",
  "synopsis": null
}