{
  "imdb_id": "tt5326230",
  "tmdb_id": "392569",
  "douban_id": null,
  "title": "Aadupuliyattam (2016)",
  "genres": [
    "Horror"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "145 min",
      "description": ""
    }
  ],
  "imdb_rating": 4.4,
  "director": [
    {
      "id": "nm7509231",
      "name": "Kannan Thamarakkulam"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm0419688",
      "name": "Jayaram",
      "character": "Sathyajith"
    },
    {
      "id": "nm0471447",
      "name": "Ramya Krishnan",
      "character": "Matangi"
    },
    {
      "id": "nm0700875",
      "name": "Om Puri",
      "character": "Yogeendra Muni"
    },
    {
      "id": "nm7785804",
      "name": "Akshara Kishor",
      "character": "Aami"
    },
    {
      "id": "nm6684210",
      "name": "Sheelu Abraham",
      "character": "Amala"
    },
    {
      "id": "nm6845864",
      "name": "Pradeep Kottayam",
      "character": "Kunji Narayanan"
    },
    {
      "id": "nm0579772",
      "name": "Valsala Menon",
      "character": "Black Magic Lady"
    },
    {
      "id": "nm7792273",
      "name": "Veena Nair",
      "character": "Jyothi"
    },
    {
      "id": "nm7457612",
      "name": "Saju Navodaya",
      "character": "Saju"
    },
    {
      "id": "nm3542089",
      "name": "Ramesh Pisharody",
      "character": "Sunny"
    },
    {
      "id": "nm3164292",
      "name": "Sampath Raj",
      "character": "Aadishwaran"
    },
    {
      "id": "nm1388202",
      "name": "Siddique",
      "character": "Psychiatrist (Cameo)"
    },
    {
      "id": "nm6178903",
      "name": "S.P. Sreekumar",
      "character": "Appu"
    },
    {
      "id": "nm1403667",
      "name": "Antony Thekkek",
      "character": "Priest (Cameo)"
    }
  ],
  "overview": "‘Aadupuliyattam’ is a horror-humor film based on a myth that is supposed to have taken place 600 years back. This myth affects the life of a businessman Satyajith who leads a happy life with his family. He approaches a yogi  for help who leads him to a house haunted by the woman from the myth, Mathangi. The resulting events form the plot of the film.",
  "storyline": "King Udayapandyan ruled some provinces of Tamil Nadu, 600 years ago. He fell in love with a huntress named Mathangi (Ramya Krishnan), married her and built her a bungalow near the forest. When Udayapandyan is defeated in a war, he takes shelter at Mathangi's bungalow and she vows to take care of the king. She sacrifices her life before the deity Bhadrakali, to save the life of King Udayapandyan. However, Mathangi's spirit continues to stay on and a yogi (Om Puri) performs certain rituals to rein in her spirit. When this myth continues, it affects the life of a well-known businessman Satyajith (Jayaram), who leads a happy life with his family.",
  "plot": "Satyajith (Jayaram) is a wealthy businessman who is haunted by some visions. On his psychiatrist's advice, he meets a yogi (Om Puri). The yogi tells him that the property, Chempakakottai, which he bought 2 years ago, is the reason for his visions and that some spirits are waiting to take revenge against him by killing his family and friends. He also says that soil taken from four corners of the kottai should be brought to him. Satyajith sends his friend to take the soil. Although his friend who does not believe in ghosts manages to get the soil, he is brutally beaten up and put in the ICU. Satyajith takes the soil to the yogi who puts it with some statues and does some karmas in three bags. He tells Satyajith to take the two bags to a priest and a musalyar while the third one is left with him.\n\nLater, the yogi asks him to stay in the house before the next full moon, 13 days from then as the spirit gets full powers on that day. The yogi gives them a raksha to be buried in front of the house. Satyajith and his friends go there. Meanwhile, the ghost kills another friend. The sequence of events from then take Satyajith back in time and reminds him of the bad things that happened in that house.\n\nThe story unfolds that years before he married a single mother named Mathangi by showing love and care for her little daughter Malli just in order to capture Chempakakottai. After a series of incidents, Mathangi and Malli gets trapped in Chempakakottai. After living there without food and water Malli dies due to starvation. It is Malli's ghost which returns to torture him.",
  "synopsis": null
}