{
  "imdb_id": "tt5328262",
  "tmdb_id": "387566",
  "douban_id": null,
  "title": "Darvinte Parinamam (2016)",
  "genres": [
    "Action",
    "Comedy",
    "Drama"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "148 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.2,
  "director": [
    {
      "id": "nm6363740",
      "name": "Jijo Antony"
    }
  ],
  "writer": [
    {
      "id": "nm6363740",
      "name": "Jijo Antony",
      "description": "screenplay"
    },
    {
      "id": "nm7839227",
      "name": "Manoj Nair",
      "description": "story, screenplay and dialogue"
    }
  ],
  "cast": [
    {
      "id": "nm1335387",
      "name": "Prithviraj Sukumaran",
      "character": "Anil Anto"
    },
    {
      "id": "nm5584853",
      "name": "Chemban Vinod Jose",
      "character": "'Gorilla' Darwin"
    },
    {
      "id": "nm7473973",
      "name": "Chandini Sreedharan",
      "character": "Amala"
    },
    {
      "id": "nm6229968",
      "name": "Soubin Shahir",
      "character": "Willy"
    },
    {
      "id": "nm1432578",
      "name": "Shammi Thilakan",
      "character": "Ayyappan"
    },
    {
      "id": "nm8063329",
      "name": "Hannah Reji Koshy",
      "character": "Ancy       (as Hannah)"
    },
    {
      "id": "nm7205423",
      "name": "Sudhi Koppa",
      "character": "Darwin's Henchman"
    },
    {
      "id": "nm2465399",
      "name": "Sabumon Abdusamad",
      "character": "Jackson       (as Tharikida Sabu)"
    },
    {
      "id": "nm7561226",
      "name": "Binu Adimali",
      "character": "Jayan"
    },
    {
      "id": "nm6840278",
      "name": "Anjana Appukuttan",
      "character": "Valsamma"
    },
    {
      "id": "nm4143935",
      "name": "Dharmajan Bolgatty",
      "character": "Dharman"
    },
    {
      "id": "nm3154399",
      "name": "Jaffer Idukki",
      "character": "Majeed"
    },
    {
      "id": "nm7075397",
      "name": "Hareesh Kanaran",
      "character": "Hareesh       (as Hareesh)"
    },
    {
      "id": "nm1722996",
      "name": "Thezni Khan",
      "character": "Parthan's Wife"
    },
    {
      "id": "nm7785804",
      "name": "Akshara Kishor",
      "character": "Child who watches Angels"
    },
    {
      "id": "nm6845864",
      "name": "Pradeep Kottayam",
      "character": "Parthan"
    },
    {
      "id": "nm7600010",
      "name": "Sethu Lakshmi",
      "character": "Anil's Mother"
    },
    {
      "id": "nm0541126",
      "name": "Mammukoya",
      "character": "Hassan Koya"
    },
    {
      "id": "nm4195566",
      "name": "Shaji Natesan",
      "character": "Pranchi (Cameo)"
    },
    {
      "id": "nm3859342",
      "name": "Lijo Jose Pellissery",
      "character": "Himself (Cameo)"
    },
    {
      "id": "nm1455641",
      "name": "Poojappura Ravi",
      "character": "Fr. Francis"
    },
    {
      "id": "nm6947814",
      "name": "Balaji Sarma",
      "character": "Police Constable"
    },
    {
      "id": "nm7638116",
      "name": "Subeesh Sudhi",
      "character": "'Negative' Thomman"
    },
    {
      "id": "nm6229969",
      "name": "Sumangal",
      "character": "Metro Rail Worker"
    },
    {
      "id": "nm7478940",
      "name": "Balu Varghese",
      "character": "Ravi"
    },
    {
      "id": "nm6325282",
      "name": "Sajid Yahiya",
      "character": "Dixon"
    }
  ],
  "overview": "The film revolves around the life of an ordinary man and a local goon and how their lives get changed due to some unfortunate events.",
  "storyline": "Anil Anto and his wife Amala have to shift to Kochi from Kottarakkara at a particular circumstance. Anil works in the Cable TV office and Amala works in a press. There they come across Darwin who thinks that Kochi is in his hands.",
  "plot": "Anil Anto and his wife shift from Kottarakara and settle down with help of his friends in Kochi. They rent a small apartment and slowly settle down to their lives. Anil works for a cable TV company as a technician. Gorilla Darvin is a well known gangster who along with his brothers rule Kochi underworld. Anil's wife is pregnant and they are very happy. During a drive by Darvin's brother steals Anil's wifes' chain and pushes her down causing an abortion. Their lives turns due to this incident. They complain to police to no avail. During an installation, he sees the person who caused this problem. He chases them and gets into a fight. He brutally beats him up and takes him to police. The Police inspector is a cousin of Darvin and abuses Anil for beating up a culprit. He then calls up Darvin to come pick his brother. Darvin picks his brother from the Police station and insults Anil by giving some money to Anil to get his wife a new chain. Anil slaps Darvin which causes a scene. Darvin retreats back. Anil then faces the wrath of Darvin. Darvin and gang slowly steal every belonging from Anil and leave them with just an empty apartment. Anil loses all his possessions. A friendly police then explains that this is Darvin's style of reacting and he cannot do anything about it. After all this, Anil takes help from a small time gangster to try kidnap Darvin's kid and fails spectacularly in comedic fashion. They decide to kidnap Darvin's younger brother who is a film buff. They make a ransom call to Darvin only to be rebutted. While browsing through the photos on Gilli's phone, Anil finds the photo of a golden statue belonging to the church in their area. He realises that Darvin in the pretext of repairing the church has switched the golden one for a duplicate statue and holds the golden one in his chicken farm. Anil then steals this statue from the farm and starts negotiating with Darvin knowing that Darvin has a deal fixed to sell this statue to a foreign customer. He asks Darvin to give him his stuff, not new but the exact items stolen from him. Beginning a cat and mouse game pushing Darvin's patience. The final item is Anil's bike which was stolen from him and sold to Darvin's rival. Darvin fights with his rival (solomon) to get the bike back. However, as Solomon tries to kill Darvin, Anil intervenes and helps Darvin out. Darvin initially plans to finish Anil for good once he tells him the location of the golden statue, however has a change of heart after Anil helps him out.",
  "synopsis": null
}