{
  "imdb_id": "tt5332280",
  "tmdb_id": "377250",
  "douban_id": null,
  "title": "Mother (2016)",
  "genres": [
    "Drama",
    "Thriller"
  ],
  "country": "Estonia",
  "version": [
    {
      "runtime": "89 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm1772728",
      "name": "Kadri Kõusaar"
    }
  ],
  "writer": [
    {
      "id": "nm4941188",
      "name": "Leana Jalukse",
      "description": null
    },
    {
      "id": "nm0564890",
      "name": "Kevin McCann",
      "description": "inspired by"
    },
    {
      "id": "nm7843316",
      "name": "Al Wallcat",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2283640",
      "name": "Tiina Mälberg",
      "character": "Mother"
    },
    {
      "id": "nm3577451",
      "name": "Andres Tabun",
      "character": "Father"
    },
    {
      "id": "nm1142263",
      "name": "Andres Noormets",
      "character": "Aarne"
    },
    {
      "id": "nm1796685",
      "name": "Siim Maaten",
      "character": "Lauri"
    },
    {
      "id": "nm3856179",
      "name": "Jaak Prints",
      "character": "Andres"
    },
    {
      "id": "nm7843310",
      "name": "Rea Lest",
      "character": "Riin"
    },
    {
      "id": "nm2313259",
      "name": "Jaan Pehk",
      "character": "Policeman"
    },
    {
      "id": "nm6543177",
      "name": "Getter Meresmaa",
      "character": "Kimberly"
    },
    {
      "id": "nm4807421",
      "name": "Katrin Kalma",
      "character": "Liina"
    },
    {
      "id": "nm1939863",
      "name": "Marin Mägi",
      "character": "Sister       (as Marin Mägi-Efert)"
    },
    {
      "id": "nm7843311",
      "name": "Margus Mikomägi",
      "character": "Ranger"
    },
    {
      "id": "nm5026540",
      "name": "Liis Laigna",
      "character": "Doctor"
    },
    {
      "id": "nm7843312",
      "name": "Märten Matsu",
      "character": "Karl-Andreas"
    }
  ],
  "overview": "Mother is a thrilleresque story about rash decisions made in the name of dreams that will have haunting consequences for some time to come. This small town crime story in the pastel tones of modern retro offers recognition and bitter humour. The film focuses on a woman whose adult son has fallen into a coma after being shot. Taking care of him at home, she has to face a whole town trying to solve the puzzle of what exactly happened.",
  "storyline": "This darkly comic crime mystery set in small-town Estonia centers on Elsa, the mother and full time caretaker of Lauri, a teacher who has been in a coma since being shot under shadowy circumstances. Attentive in her duties but at the end of her tether, Elsa receives Lauri's visitors-friends, students, his girlfriend, his boss, and others-who come to update the unconscious Lauri on their lives and unburden themselves of their troubles. But as the police inquiry into the crime progresses, some of his closest ties are called into question. Director Kadri Kõusaar cunningly navigates a script that slowly pieces together the truth behind Lauri's shooting through his visitors' confessionals to the comatose protagonist, cleverly building a web of motives among the tight-knit community. Bathed in the pastel tones of post-Soviet life, Mother is a smartly-crafted whodunit set in a small town where just about everyone is dreaming of something bigger and some are willing to do whatever it takes to...",
  "plot": "In 1986, Saroo, a five year old, lives with his elder brother Guddu, his mother and his younger sister in Khandwa, India. Guddu and Saroo steal coal from freight trains to trade for milk and food. One day Saroo follows his brother to a job and they arrive at a nearby train station, where Saroo decides to stay back and take a nap. Guddu tries to wake him up, but Saroo is too tired. When Guddu does not return, Saroo searches for him and boards a train presuming Guddu is aboard. He falls asleep again in one of the compartments, and wakes up to find the train in motion. After several days it arrives in faraway Calcutta, where he doesn't understand the local Bengali language. He stands at a ticket counter and tries to obtain a ticket home, but the attendant does not recognise the name of his village, which Saroo says is \"Ginestlay\". He spends the night in the station with some street children, but is then forced to run when they are snatched by some adults.\n\nSaroo continues to wander around the city before coming across Noor, a seemingly friendly woman who brings him back to her apartment. She tells Saroo that a man, Rama, will help him find his way home. Saroo, sensing that Noor and Rama have sinister intentions, runs away and escapes Noor when she pursues him. A young man eventually takes Saroo to the police. Unable to trace his family, they put him in an orphanage. Three months later, Saroo is introduced to Mrs. Sood, who tells him she has placed an advertisement about him in several local newspapers, but no one has responded. She then tells him that an Australian couple is interested in adopting him. She begins to teach Saroo English and he moves to Hobart, Tasmania in 1987, under the care of Sue and John Brierley, where he slowly starts to settle in. A year later, they adopt another boy, Mantosh, who has trouble adjusting to his new home and suffers from rage and self-harm.\n\nTwenty years later, Saroo, now a young man, moves to Melbourne to study hotel management. He starts a relationship with Lucy, an American student. During a meal with some Indian friends at their home, he comes across jalebi, a delicacy he remembers from his childhood. He confides that he is adopted, and his friends suggest he use Google Earth to search for his hometown in India. Saroo begins his search, but over time disconnects from Lucy, overwhelmed by the thought of emotions his family must have gone through when he was missing.\n\nSaroo visits Sue, whose health is deteriorating, and learns that she is not infertile, but had chosen to help others in need through adoption, believing that there were already too many people on Earth. Saroo spends a long time searching fruitlessly for his hometown. One evening, while scanning Google Earth, he notices the rock formations where his mother worked, and then finds the area where he lived: the district called Khandwa, and the locality, Ganesh Talai. He finally tells his adoptive mother about his search, and she fully supports his efforts.\n\nSaroo returns to his hometown, where he has an emotional reunion with his biological mother and sister, but learns that Guddu is dead. Guddu was killed by a train the same night that they went to the station as children. Their mother never gave up hope and believed that one day her missing son would return, and never moved away from the village. The film ends with captions about the real Saroo's return to India in February 2012. Photos of the real Australian family are shown, as well as a video of Saroo and Sue meeting his biological mother in India, who deeply appreciates Sue's care for her son. Saroo, later learned that he had been mispronouncing his own name, which was actually Sheru, a diminutive for sher, the Hindi word for \"lion\".",
  "synopsis": null
}