{
  "imdb_id": "tt5425488",
  "tmdb_id": "413797",
  "douban_id": null,
  "title": "Further Beyond (2016)",
  "genres": [
    "Documentary"
  ],
  "country": "Ireland",
  "version": [
    {
      "runtime": "89 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm2614266",
      "name": "Joe Lawlor"
    },
    {
      "id": "nm2613934",
      "name": "Christine Molloy"
    }
  ],
  "writer": [
    {
      "id": "nm2614266",
      "name": "Joe Lawlor",
      "description": "writer"
    },
    {
      "id": "nm2613934",
      "name": "Christine Molloy",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm1740112",
      "name": "Denise Gough",
      "character": "Voice Over 1"
    },
    {
      "id": "nm2600406",
      "name": "Alan Howley",
      "character": "Voice over 2"
    },
    {
      "id": "nm7910485",
      "name": "Jose Miguel Jimenez",
      "character": "Ambrosio O'Higgins"
    }
  ],
  "overview": "In their debut documentary Christine Molloy and Joe Lawlor take as their point of departure the compelling 18th Century figure, Ambrose O'Higgins, and attempt to retrace his remarkable journey from Ireland to Chile.",
  "storyline": "In their debut documentary Christine Molloy and Joe Lawlor take as their point of departure the compelling 18th Century figure, Ambrose O'Higgins, and attempt to retrace his remarkable journey from Ireland to Chile. Key locations in O'Higgins' life - a lake in Sligo, a field in Meath, the port of Cadiz, the sea, and the edge of a snow-covered mountain in the Andes - are visited and reflected upon in the hope that something might be revealed, as if these very locations might contain clues. Having long dreamt of making a biopic of O'Higgins, this wayward and wry documentary is the filmmakers' attempt to realise this dream through a personal voyage into the idea of the cinematic location. However, as they speculate on the idea of place and what O'Higgins embodies, the filmmakers continually get sidetracked by a competing story of immigration and displacement. Gradually, and not without humour, these intertwining narratives uncover ideas about the transformative powers of travelling, as ...",
  "plot": null,
  "synopsis": null
}