{
  "imdb_id": "tt5485874",
  "tmdb_id": "393588",
  "douban_id": null,
  "title": "Batrachian's Ballad (2016)",
  "genres": [
    "Documentary",
    "Short"
  ],
  "country": "Portugal",
  "version": [
    {
      "runtime": "11 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.0,
  "director": [
    {
      "id": "nm4740205",
      "name": "Leonor Teles"
    }
  ],
  "writer": [
    {
      "id": "nm4740205",
      "name": "Leonor Teles",
      "description": "writer"
    }
  ],
  "cast": null,
  "overview": "“Once upon a time, before people came along, all the creatures were free and able to be with one another”, narrates the voiceover. “All the animals danced together and were immeasurably happy. There was only one who wasn’t invited to the celebration – the frog. In his rage about the injustice, he committed suicide.” Something Romani and frogs have in common is that they will never be unseen, or stay unnoticed. In her film, young director Leonor Teles weaves the life circumstance of Romani in Portugal today with the recollections of a yesterday. Anything but a passive observer, Teles consciously decides to participate and take up position. As a third pillar, she establishes an active applied performance art that becomes integrated in the cinematic narrative. Thereby transforming “once upon a time” into “there is”. “Afterwards, nothing will be as it was and the melody of life will have changed”, explains a voice off-camera.  Golden Bear for Best Short Film 2016",
  "storyline": "\"Once upon a time, before people came along, all the creatures were free and able to be with one another\", narrates the voiceover. \"All the animals danced together and were immeasurably happy. There was only one who wasn't invited to the celebration - the frog. In his rage about the injustice, he committed suicide.\" Something Romani and frogs have in common is that they will never be unseen, or stay unnoticed. In her film, young director Leonor Teles weaves the life circumstance of Romani in Portugal today with the recollections of a yesterday. Anything but a passive observer, Teles consciously decides to participate and take up position. As a third pillar, she establishes an active applied performance art that becomes integrated in the cinematic narrative. Thereby transforming \"once upon a time\" into \"there is\". \"Afterwards, nothing will be as it was and the melody of life will have changed\", explains a voice off-camera.",
  "plot": null,
  "synopsis": null
}