{
  "imdb_id": "tt5431016",
  "tmdb_id": "372519",
  "douban_id": null,
  "title": "Moses and the Ten Commandments: The Movie (2016)",
  "genres": [
    "Adventure",
    "Drama",
    "Fantasy"
  ],
  "country": "Brazil",
  "version": [
    {
      "runtime": "120 min",
      "description": "original"
    }
  ],
  "imdb_rating": 3.4,
  "director": [
    {
      "id": "nm0042768",
      "name": "Alexandre Avancini"
    }
  ],
  "writer": [
    {
      "id": "nm0210734",
      "name": "Vivian de Oliveira",
      "description": "written by"
    }
  ],
  "cast": [
    {
      "id": "nm2273491",
      "name": "Guilherme Winter",
      "character": "Moisés"
    },
    {
      "id": "nm0549517",
      "name": "Sergio Marone",
      "character": "Ramsés       (as Sérgio Marone)"
    },
    {
      "id": "nm1690530",
      "name": "Camila Rodrigues",
      "character": "Nefertari"
    },
    {
      "id": "nm0411658",
      "name": "Giselle Itié",
      "character": "Zípora"
    },
    {
      "id": "nm0327404",
      "name": "Petrônio Gontijo",
      "character": "Arão"
    },
    {
      "id": "nm0216011",
      "name": "Denise Del Vecchio",
      "character": "Joquebede"
    },
    {
      "id": "nm2016649",
      "name": "Tammy Di Calafiori",
      "character": "Ana"
    },
    {
      "id": "nm1117910",
      "name": "Juliana Didone",
      "character": "Leila"
    },
    {
      "id": "nm2486870",
      "name": "Gabriela Durlo",
      "character": "Eliseba"
    },
    {
      "id": "nm0271282",
      "name": "Samara Felippo",
      "character": "Joquebede (jovem)"
    },
    {
      "id": "nm0276634",
      "name": "Paulo Figueiredo",
      "character": "Jetro"
    },
    {
      "id": "nm0323628",
      "name": "Roger Gobeth",
      "character": "Anrão (jovem)"
    },
    {
      "id": "nm0330904",
      "name": "Paulo Gorgulho",
      "character": "Anrão"
    },
    {
      "id": "nm0401078",
      "name": "Vitor Hugo",
      "character": "Corá"
    },
    {
      "id": "nm1011366",
      "name": "Aisha Jambo",
      "character": "Radina"
    },
    {
      "id": "nm8055524",
      "name": "Isabella Koppel",
      "character": "Miriã (jovem)"
    },
    {
      "id": "nm1036670",
      "name": "Mel Lisboa",
      "character": "Henutmire (jovem)"
    },
    {
      "id": "nm0532458",
      "name": "Zécarlos Machado",
      "character": "Faraó Seti I"
    },
    {
      "id": "nm1146973",
      "name": "Larissa Maciel",
      "character": "Miriã"
    },
    {
      "id": "nm0553431",
      "name": "Heitor Martinez",
      "character": "Apuki"
    },
    {
      "id": "nm8595763",
      "name": "Fran Maya",
      "character": "Jaque"
    },
    {
      "id": "nm0612884",
      "name": "Angelina Muniz",
      "character": "Tuya"
    },
    {
      "id": "nm0631527",
      "name": "Paulo Nigro",
      "character": "Paser"
    },
    {
      "id": "nm0670639",
      "name": "Floriano Peixoto",
      "character": "Hur"
    },
    {
      "id": "nm7633668",
      "name": "Paula Lafayette Perera",
      "character": "Mulher Misteriosa       (as Paula Lafayette)"
    },
    {
      "id": "nm8069137",
      "name": "Edu Pinheiro",
      "character": "Ramsés (jovem)"
    },
    {
      "id": "nm3903277",
      "name": "Kiko Pissolato",
      "character": "Bakenmut"
    },
    {
      "id": "nm1150818",
      "name": "Sidney Sampaio",
      "character": "Oseias /              Josué"
    },
    {
      "id": "nm5856354",
      "name": "Rafael Sardão",
      "character": "Uri"
    },
    {
      "id": "nm5996127",
      "name": "Jeniffer Setti",
      "character": "Safira       (as Jennifer Setti)"
    },
    {
      "id": "nm8069136",
      "name": "Enzo Simi",
      "character": "Moisés (jovem)"
    },
    {
      "id": "nm2489523",
      "name": "Nanda Ziegler",
      "character": "Judite"
    },
    {
      "id": "nm0956795",
      "name": "Vera Zimmermann",
      "character": "Henutmire"
    }
  ],
  "overview": "Follows Moses leading and conducting the Hebrew people from the slavery of Egypt to the freedom towards the Promised Land according to the Ancient Testament Bible book of the Exodus. The story told like never before is faithful to the Scriptures.",
  "storyline": "Follows Moses leading and conducting the Hebrew people from the slavery of Egypt to the freedom towards the Promised Land according to the Ancient Testament Bible book of the Exodus. The story told like never before is faithful to the Scriptures.",
  "plot": "Pharaoh Rameses I of Egypt has ordered the death of all the firstborn Hebrew male infants after hearing the prophecy of the Deliverer, but a Hebrew mother named Yoshebel saves her own infant son by setting him adrift in a basket on the Nile. Bithiah, the Pharaoh's daughter, who had recently lost both her husband and the hope of ever having children of her own, finds the basket and decides to adopt the boy even though her servant, Memnet, recognizes the child is Hebrew and protests. Because she drew the infant out of the water, Bithiah decides to name the baby Moses.\n\nMany years later, Prince Moses grows up to become a successful general, winning a war with Ethiopia and then entering Egypt into an alliance with them. Moses loves Nefretiri, who is the throne princess and must be betrothed to the next Pharaoh. She reciprocates his love. While working on the building of a city for Pharaoh Sethi's jubilee, Moses meets the stonecutter Joshua, who tells him of the Hebrew God. An incident occurs when an elderly woman is almost crushed to death when her sash gets caught under the slab of stone, prompting Moses to scold overseer Baka. Moses frees the elderly woman, not realizing that she is his natural mother, Yoshebel.\n\nMoses institutes numerous reforms concerning the treatment of the slaves on the project, and eventually Prince Rameses, Moses's \"brother\", charges him with planning an insurrection, pointing out that the slaves are calling him the \"Deliverer\". Moses defends himself against the charges, arguing that he is simply making his workers more productive by making them stronger and happier and proves his point with the impressive progress he is making. Rameses had earlier been charged by Sethi with finding out whether there really is a Hebrew fitting the description of the Deliverer.\n\nNefretiri learns from Memnet that Moses is the son of Hebrew slaves. Nefretiri kills Memnet but reveals the story to Moses only after he finds the piece of Levite cloth he was wrapped in as a baby, which Memnet had kept. Moses goes to Bithiah to learn the truth. Bithiah evades his questions, but Moses follows her to the home of Yoshebel and thus learns the truth, while also meeting his true brother, Aaron, and sister, Miriam.\n\nAlthough Moses feels no real change from this revelation, he spends time working amongst the slaves to learn more of their lives. Nefretiri urges him to return to the palace so he may help his people when he becomes pharaoh, to which he agrees after he completes a final task. The master builder Baka steals Lilia, who is engaged to the stonecutter Joshua. Joshua rescues Lilia by causing a commotion in Baka's stables. Joshua strikes Baka in the process and gets captured; he is then whipped by Baka for this insult. Moses strangles Baka and frees Joshua, confessing to Joshua that he too is Hebrew. The confession is witnessed by the ambitious Hebrew chief overseer Dathan. In exchange for his freedom, riches and Lilia, Dathan tells about this to Rameses, who then arrests Moses. Brought in chains before Sethi, Moses explains that he is not the Deliverer, but would free the slaves if he could. Bithiah tells her brother Sethi the truth about Moses, and Sethi reluctantly orders his name stricken from all records and monuments, and Rameses is declared the next Pharaoh. Rameses, well aware of his father's (and Nefretiri's ) devotion to Moses, decides not to execute him and make a martyr out of him. Instead he banishes Moses to the desert, where Nefretiri will never know if he survives, or perhaps finds another love. He also tells Moses that Yoshebel had died after delivering a robe of Levite cloth for Moses.\n\nMoses makes his way across the desert, nearly dying of hunger and thirst before he comes to a well in the land of Midian. At the well, he defends seven sisters from Amalekites who try to push them away from the water. Moses finds a home in Midian with the girls' father Jethro, a Bedouin sheik, who reveals that he is a follower of \"He who has no name\", whom Moses recognizes as the God of Abraham. Moses impresses Jethro and the other sheiks with his wise and just trading, and marries Jethro's eldest daughter Sephora.\n\nWhile herding sheep in the desert Moses finds Joshua, who has escaped from the copper mines of Ezion-Geber that he was sent to after the death of Baka. Moses sees the burning bush on the summit of Mount Sinai and hears the voice of God. God charges Moses to return to Egypt and free His chosen people. In the meantime, in Egypt, Sethi dies, his last word being Moses's name. Before he dies, he hands over the reins to his son Ramseses, who becomes Rameses II.\n\nAt Pharaoh's court, Moses comes before Rameses to win the slaves' freedom, turning his staff into a cobra. Jannes does the same with his staves, but Moses's snake devours his. Rameses decrees that the Hebrews be given no straw to make their bricks, but to make the same tally as before on pain of death. As the Hebrews prepare to stone Moses in anger, Nefretiri's retinue rescues him. He spurns her when she attempts to renew her relationship with him by saying that he is on a mission and is also married.\n\nAs Moses continues to challenge Pharaoh's hold over his people, Egypt is beset by divine plagues. Moses turns the river Nile to blood at a festival of Khnum and brings burning hail down upon Pharaoh's palace. Moses warns him the next plague to fall upon Egypt will be summoned by Pharaoh himself. Enraged at the plagues and Moses' continuous demands, as well as his generals and advisers telling him to give in, Rameses orders all first-born Hebrews to die. Nefretiri warns Sephora to escape with her son Gershom on a passing caravan to Midian, and Moses tells the Queen that it is her own son who will die. In an eerily quiet scene, the Angel of Death creeps into Egyptian streets in a glowing green mist, killing all the firstborn of Egypt, including the adult son of Pharaoh's top general, and Pharaoh's own child. The Hebrews who have marked their doorposts and lintels with lamb's blood are eating a hasty meal and preparing to depart. Bithiah reunites with Moses and decides to go with him and his people when they leave. Broken and despondent, Pharaoh orders Moses to leave with the Hebrews. In the following day, the Hebrews, now homeless and uprooted, begin their exodus from Egypt with Dathan, reluctantly, also among them.\n\nRameses spends the next three days begging Seker to call life back into the body of his son. Nefretiri goads him into such a rage that he arms himself and gathers the elite Egyptian forces and pursues the former slaves to the shore of the Red Sea. When the people see the Egyptian troops heading for them, they beg Moses to save them. Dathan told the Israelites to bring Moses to Rameses. With God's help, he puts out a pillar of fire. Held back by this pillar, the Egyptian forces are afraid to passed the fire. Moses parts the waters with power. As the Hebrews race over, at the seabed, many of them are been injured by a mud, one of them struggling a wagon (at the middle of the road during the Crossing) because of a loose wheel. When they reach the other side of the stormy sea, Joshua told moses to climb at the stone. when the pillar of fire then dies down, Rameses and the army follows them, Rameses stays on the rock where Moses parts the waters. The Hebrews make it to the far shore, one Israelite shouted and run with panic, Dathan wants them come. Moses close the walls of water, drowning every man and horse, except Rameses, who looks on in despair. All he can do is return to Nefretiri, confessing to her, \"His god is God\". and he sits on the throne.\n\nThe former slaves camp at the foot of Sinai and wait as Moses again ascends the mountain with Joshua. During his absence, the Hebrews lose faith. Urged by Dathan, they build a golden calf as an idol to take back to Egypt, hoping to win Rameses' forgiveness. They force Aaron to help fashion the gold plating. The people indulge their most wanton desires in an orgy of sinfulness, Dathan took Lilia for sacrifice for the calf. except for a few still loyal to Moses, including Lilia, Joshua, Sephora, Bithiah, Aaron, and Miriam.\n\nHigh atop the mountain, Moses witnesses God's creation of the stone tablets containing the Ten Commandments. When Moses finally climbs down and meets Joshua, they both behold their people's iniquity. Moses hurls the tablets at the idol in a rage. The idol explodes, and Dathan and his followers are killed. After God forces them to endure forty years' exile in the desert to kill off the rebellious generation, the Hebrews are about to arrive in the land of Canaan. An elderly Moses, who is not allowed to enter the promised land, because of his disobedience to God at the waters of Strife, appoints Joshua to succeed him as leader, says a final good bye to Sephora, and goes forth to his destiny, Alone with God.... Moses dies. The film depicts With words saying&#160;: \" it was written that it shall be done \".",
  "synopsis": null
}