{
  "imdb_id": "tt5495258",
  "tmdb_id": "369939",
  "douban_id": null,
  "title": "Pokkiri Raja (2016)",
  "genres": [
    "Comedy"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "139 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.7,
  "director": [
    {
      "id": "nm6725347",
      "name": "Ramprakash Rayappa"
    }
  ],
  "writer": [
    {
      "id": "nm7958351",
      "name": "Gnanagiri",
      "description": "dialogue"
    },
    {
      "id": "nm6725347",
      "name": "Ramprakash Rayappa",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1883318",
      "name": "Jiiva",
      "character": "Sanjeev"
    },
    {
      "id": "nm4971960",
      "name": "Sibiraj",
      "character": "'Cooling Glass' Guna"
    },
    {
      "id": "nm1394426",
      "name": "Hansika Motwani",
      "character": "Sunitha"
    },
    {
      "id": "nm6106368",
      "name": "Munishkanth",
      "character": "(as Ramdoss)"
    },
    {
      "id": "nm1007581",
      "name": "Manobala",
      "character": ""
    },
    {
      "id": "nm1416319",
      "name": "Mayilsamy",
      "character": ""
    },
    {
      "id": "nm6489058",
      "name": "Yogi Babu",
      "character": ""
    },
    {
      "id": "nm8840172",
      "name": "Manasa Himavarsha",
      "character": ""
    }
  ],
  "overview": "A young man whose constant yawning leaves him out of work gets a gangster arrested by accident. Now, the latter is out to get his revenge, but what he doesn't know is how powerful a yawn can be.",
  "storyline": "Sanjeevani's (Jiiva) biggest embarrassment in life is his frequent yawning that puts anyone near him to sleep. At one point of time, Sanjeev loses his job and girl friend because of this strange condition, which even earns him the wrath of the local gangster 'cooling glass' Guna (Sibiraj) as the latter loses his eyesight because of the powerful 'yawn'. What happens next ?",
  "plot": "Ramesh (Rajinikanth) starts managing the office of an industrialist who strongly suspects his relatives to be looting him. Ramesh finds the culprit and keeps a tight leash on everything happening in the office, thereby earning the wrath of the industrialist's relatives. Ramesh and Sridevi (the industrialist's daughter) initially find themselves at loggerheads, but eventually fall in love with each other. The industrialist is happy about this development until he sees Ramesh cheating on his daughter. He fires Ramesh the very same day.\n\nThe industrialist is murdered and Sridevi also sees Ramesh in her house that same night. Ramesh is dragged to court and is shortly framed for murder. Sridevi is upset, and the ill-intentioned relatives start closing their net around her, forcing her to marry Y. G. Mahendran (the son of two of the industrialist's relatives).\n\nIn the meantime, the grief-stricken Ramesh meets another person named Raja (also Rajinikanth) in jail who looks exactly like him. Together Ramesh and Raja plan to punish the culprits and set the record straight.",
  "synopsis": null
}