{
  "imdb_id": "tt5455344",
  "tmdb_id": "368230",
  "douban_id": null,
  "title": "Zombie (2016)",
  "genres": [
    "Action",
    "Horror"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "106 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.3,
  "director": [
    {
      "id": "nm6725254",
      "name": "Shakti Soundar Rajan"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm1865947",
      "name": "Jayam Ravi",
      "character": "Karthik"
    },
    {
      "id": "nm5068044",
      "name": "Lakshmi Menon",
      "character": "Renuka"
    },
    {
      "id": "nm6106360",
      "name": "Kaali Venkat",
      "character": "Karthik's Friend"
    },
    {
      "id": "nm3830348",
      "name": "R.N.R. Manohar",
      "character": "Minister"
    },
    {
      "id": "nm7915125",
      "name": "Jeeva Ravi",
      "character": "Doctor"
    },
    {
      "id": "nm4171957",
      "name": "Anikha Surendran",
      "character": "Vidhya       (as Baby Anikha)"
    },
    {
      "id": "nm4533261",
      "name": "Amit Bhargav",
      "character": "Naveen"
    },
    {
      "id": "nm1417060",
      "name": "Sriman",
      "character": "Watchman"
    },
    {
      "id": "nm5631806",
      "name": "Crane Manohar",
      "character": "Marriage Broker"
    }
  ],
  "overview": "When a zombie outbreak occurs in a hill station, a traffic cop takes on the responsibility of transporting a team of doctors to a city hospital so that they can find an antidote.",
  "storyline": "Despite qualifying for armed force, Karthik ('Jayam ' Ravi) prefers to be a traffic cop in Ooty as he believes that such a no risky job would help him get enough time to look after his cute little sister Vidhya (Baby Anikha). Karthik also has a short lived one side love story with Renu (Lakshmi Menon), who is a doctor. When a hazardous chemical in the nearby industry gets leaked, a dog consumes it and turns into a zombie. As the dog bites a watchman, he too becomes a zombie and eventually, the virus spreads rapidly across the town. Can Karthik save his sister and the city ?",
  "plot": "The film opens with a stray dog becoming violent, after drinking toxic fumes, which then bites a security guard. The security guard becomes a zombie momentarily and starts a chain of human infections via bites.\n\nKarthik (Jayam Ravi) a traffic officer in Ooty who avoids danger as he has to take care of a younger sister who is in her early teens. He is in love with a doctor named Renuka (Lakshmi Menon) but never proposes in all their meetings. Renu is engaged and is about to get married to Naveen (Amit Bhargav) who is also a doctor. Meanwhile, Karthik's sister is kidnapped and is suspected to be attacked by a zombie. The police of Ooty decides go shooting whoever who had turned into a zombie. Karthik is also looking for his sister and meanwhile killing the zombies. He receives a call in which he is told to arrive at a place to find his sister. There he finds Renu and her group of doctors finding a vaccine. Karthik also finds his sister and later comes to know that the doctors are trapped inside the house which is invaded by zombies.\n\nAt that moment, the chief doctor, Dharan, is attacked by a zombie and does not tell anyone. With Dharan, Renu, another doctor Kamal, Renu's father and Karthik's friend and sister all head to Kovai (Coimbatore), to utilise medical equipment to find a cure . Karthik unknowingly disturbs some zombies and they are forced to take shelter in a mall which is opposite the hospital. Naveen is inside the hospital trying to find the vaccine. They get hold of a frightened security guard of the mall (Sriman). After sometime Dharan turns into a zombie and attacks Karthik's sister but she does not turn into a zombie despite the fact that she was attacked almost an hour ago. Kamal says that she will be able to help them in finding the vaccine as she has the required antibodies. Because of that, Karthik had to escort them to the Hospital which faces the mall. For this, he is using pressurised water from the Mall's Fire Truck knowing that they are allergic to water. Despite the reduced time, Karthik, manages to bring everyone safely to the hospital except Renu. He goes back to the mall to bring Renu. But he does that without any water source. So, he brought Renu to the Hospital, but, got attacked by the zombies while he was escorting her. He himself turns into a zombie. Renu realises her love for him but he turns into a zombie and attacks her leading her to shoot him.\n\nTwo days later, Karthik, who is completely a zombie now is seen on top of a bus which is going to Chennai.",
  "synopsis": null
}