{
  "imdb_id": "tt5474522",
  "tmdb_id": "382653",
  "douban_id": null,
  "title": "Old Stone (2016)",
  "genres": [
    "Thriller"
  ],
  "country": "Canada",
  "version": [
    {
      "runtime": "80 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.9,
  "director": [
    {
      "id": "nm3534176",
      "name": "Johnny Ma"
    }
  ],
  "writer": [
    {
      "id": "nm3534176",
      "name": "Johnny Ma",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm7209188",
      "name": "Gang Chen",
      "character": "Lao Shi"
    },
    {
      "id": "nm0619627",
      "name": "Nai An",
      "character": "Mao Mao"
    },
    {
      "id": "nm0910912",
      "name": "Hongwei Wang",
      "character": "Captain"
    },
    {
      "id": "nm7932105",
      "name": "Zebin Zhang",
      "character": "Li Jiang"
    },
    {
      "id": "nm7932106",
      "name": "Xue'er Luo",
      "character": "Xue'er"
    }
  ],
  "overview": "A man falls down the stairs, but instead of helping him, the bystanders just take photos with their phones. Lao Shi is a taxi driver and he’s fighting for justice in the darkest recesses of Chinese society. The man who pushed him got into his taxi drunk not so very long ago, grabbed the steering wheel and caused an accident. The victim of the crash has been in a coma ever since, and because his family is destitute, Lao Shi is paying the hospital bills. The insurance company is refusing to cover the costs because the taxi driver left the scene of the accident with the injured man because no help was in sight. Now Lao Shi needs the testimony of his passenger, who angrily refuses to cooperate.",
  "storyline": "It is a sad world. A Chinese taxi driver, who was was forced into an accident, suffers the consequences as he finds himself victimized by humans, companies, the system and materialism. With the greed and cruelty of the society pushing him underwater he tries one thing after the other to rescue himself. Yet, when it rains, it pours.",
  "plot": "After the good King of England dies, leaving no heir to the throne, a sword appears inside an anvil in London. The sword bears an inscription proclaiming that \"whoso pulleth out this sword of this stone and anvil is rightwise king, born of England\". No one can remove the sword, which is eventually forgotten, leaving England in the Dark Ages.\n\nYears later, a 12-year-old orphan named Arthur, commonly called Wart, accidentally scares off a deer his foster brother Kay was hunting, causing Kay to launch his arrow into the forest. In retrieving the arrow, Arthur lands in the cottage of Merlin the wizard, who declares himself Arthur's tutor and returns with the boy to his home, a castle run by Sir Ector, Arthur's foster father. Ector's friend, Sir Pellinore, arrives with news that the annual jousting tournament will be held on New Year's Day in London, and the winner will be crowned king. Ector decides to put Kay through serious training for the tournament and appoints Arthur as Kay's squire.\n\nIn order to educate Arthur, Merlin transforms the boy and himself into fish. They swim in the castle moat in order to learn about physics, but more importantly for Arthur to rely upon intellect in facing dangerous situations (brain over brawn). Arthur is attacked by a pike but is saved by Archimedes, Merlin's pet owl. Arthur is sent to the kitchen as punishment for trying to relate his lesson to a disbelieving Ector. Merlin enchants the dishes to wash themselves, then takes Arthur for another lesson, turning them into squirrels to learn about gravity, and to understand to think before acting (\"look before you leap\"). During their trip, two female red squirrels fall in love with them. Arthur is nearly eaten by a wolf, but is saved by the younger of the female squirrels before Merlin returns them to human form. While Merlin's pursuer is first scared then angry at this, Arthur's pursuer is heartbroken. When Merlin and Arthur return to the castle, Ector accuses Merlin of using black magic on the dishes. Arthur defends Merlin, but Ector refuses to listen and punishes Arthur by giving Kay another squire, Hobbs.\n\nResolving to make amends, Merlin plans on educating Arthur full-time. However, Merlin's knowledge of future history causes confusion, prompting Merlin to appoint Archimedes as Arthur's teacher. When Arthur imagines what it would be like to fly, Merlin transforms him into a sparrow and Archimedes teaches Arthur how to fly. However, during their lesson Arthur is attacked by a hawk and falls into the chimney of Madam Mim, an evil witch and Merlin's nemesis. Mim's magic uses trickery, as opposed to Merlin's scientific skill. Merlin intervenes before Mim can destroy Arthur, and she challenges him to a Wizards' Duel. Despite Mim's cheating, Merlin outsmarts her by transforming into a fictional germ called \"Malignalitaloptereosis\" that infects her with a chickenpox-like disease, effectively defeating her and illustrating the importance of knowledge over strength.\n\nOn Christmas Eve, Kay is knighted, but Hobbs comes down with the mumps, forcing Ector to reinstate Arthur as Kay's squire. This causes a falling-out between Arthur and Merlin, who angrily (and unintentionally) transports himself to Bermuda when Arthur defends his choices. On the day of the tournament, Arthur realizes that he has left Kay's sword at an inn, which is now closed for the tournament. Archimedes sees the Sword in the Stone, which Arthur removes, unknowingly fulfilling the prophecy. When Arthur returns with the sword, Ector recognizes it and the tournament is halted. Ector places the sword back in its anvil, demanding Arthur prove that he pulled it. Thinking anyone can pull the sword now, Kay and others try unsuccessfully to retrieve it. Sir Pellinore and another knight, Sir Bart, stand up for Arthur and encourage him to pull the sword again. He does so, revealing that he is England's rightful king and earning Ector's and Kay's respect.\n\nArthur, crowned king, sits in the throne room with Archimedes, feeling unprepared to take the responsibility of ruling. Overwhelmed by the cheering crowd outside, Arthur calls out to Merlin for help. Merlin returns from Bermuda (and the 20th century) and is elated to find that Arthur is the king that he saw in the future. Merlin tells Arthur that he will go on to lead the Knights of the Round Table and become famous, starring in books and even movies, which (as usual) confuses Arthur.",
  "synopsis": null
}