{
  "imdb_id": "tt5423310",
  "tmdb_id": "377621",
  "douban_id": null,
  "title": "Ola Bola (2016)",
  "genres": [
    "Drama",
    "History",
    "Sport"
  ],
  "country": "Malaysia",
  "version": [
    {
      "runtime": "113 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.9,
  "director": [
    {
      "id": "nm4691188",
      "name": "Keng Guan Chiu"
    }
  ],
  "writer": [
    {
      "id": "nm7890907",
      "name": "Tan Pik Yee",
      "description": null
    },
    {
      "id": "nm7890906",
      "name": "Chan Yoke Yeng",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm7430507",
      "name": "J.C. Chee",
      "character": "Chow Kwok Keong"
    },
    {
      "id": "nm7890900",
      "name": "Luqman Hafidz",
      "character": "Ahmad Ali"
    },
    {
      "id": "nm8262436",
      "name": "Andy Darrel Gomes",
      "character": "Office Collegue"
    },
    {
      "id": "nm10161091",
      "name": "Taufiq Hanafi",
      "character": ""
    },
    {
      "id": "nm7890904",
      "name": "Katrina Ho",
      "character": "Tan Siew Lee"
    },
    {
      "id": "nm7890901",
      "name": "Saran Kumar",
      "character": "Muthu Kumar"
    },
    {
      "id": "nm7926437",
      "name": "Frankie Lee",
      "character": "Pak Guard Security"
    },
    {
      "id": "nm6170162",
      "name": "Daphne Low",
      "character": "Chow Mei Ling"
    },
    {
      "id": "nm9582625",
      "name": "Firzany Mokti",
      "character": "Assistant Coach"
    },
    {
      "id": "nm2387707",
      "name": "Bront Palarae",
      "character": "Rahman"
    },
    {
      "id": "nm5413373",
      "name": "Marianne Tan",
      "character": "Marianne"
    },
    {
      "id": "nm7890903",
      "name": "Eric Teng",
      "character": "Eric Yong"
    },
    {
      "id": "nm7890902",
      "name": "Lim Jian Wen",
      "character": "Ong Tiam Cai"
    },
    {
      "id": "nm7890905",
      "name": "Mark Williams",
      "character": "Harry Mountain"
    },
    {
      "id": "nm8059653",
      "name": "Haris Zainuddin",
      "character": "Sanjeet Singh"
    }
  ],
  "overview": "Set in the 1970s, a multicultural team of Malaysian football players struggle to overcome personal and collective hardships as a team. Together they create the most triumphant zero to hero story and gain a place at the Asian Games.",
  "storyline": "It is a story set in the 1980s during tumultuous economic times, about an unlikely team of footballers whose disagreements have left them with a streak of embarrassing losses. Personal issues have caused each of them to crack under pressure while the team slowly falls apart. They have only one chance left for international glory, and this multicultural team has to find it in their hearts to overcome their individual odds and unite for the sake of an entire country. But unknown to them, their greatest test is yet to come, one that will make or break their fighting spirit and the nation's hopes and aspirations.",
  "plot": "A journalist, Marianne is commissioned to research the Malaysia national football team of the 80's. Disillusioned by her working life in Malaysia, she decides to emigrate to England once she completes the project. She goes to Sabah to interview Eric, a former player of the team.\n\nIn 1980, the team practises for the upcoming pre-Olympics matches, with captain Chow Kwok Keong serving as the interim coach until Harry Mountain takes over. Meanwhile, aspiring sports commentator and Chow's friend, Rahman practises with his mentors. Mountain revises the formation, such as by having Eric being changed from a reserve goalkeeper to a striker. Having not getting used to the new formation, and also due to Chow disobeying the coach's orders, the team is unable to win any friendly matches. Soon, Eric and fellow striker Ali have a falling out over the squad number 10. Chow assumes responsibility for their embarrassing performance and quits the team.\n\nThe team continues on their losing streak. In the meantime, the three younger brothers of Muthu the goalkeeper are injured in an attempt to help their father deliver coconuts by driving the lorry. Fed up with Muthu's (fruitless) football endeavours and him not being able to help with work, Muthu's father reprimands him. Muthu contemplates also about quitting the team out of perceived incompetence, but does not do so.\n\nChow remembers his pledge to lead the team to glory and decides to rejoin the team. Mountain welcomes him back and advises him to \"not make the same mistakes I did when I was younger.\" After extensive practice and military training, the team finally starts winning again.\n\nMalaysia competes with South Korea at Stadium Merdeka in the final match, where Rahman is assigned to commentate. In the first half, an opponent informs Ali that Malaysia is boycotting the Olympics. During the half-time break, Ali shares the news to his teammates' disappointment. Mountain and Chow knew about this all along, but could not disclose it lest team morale be affected. Not willing to give up, Muthu encourages them to play on resolutely regardless whether they make it to Moscow. They display excellent skill and teamwork later on as Rahman delivers a thrilling and emphatic commentary. Ali scores the decisive goal; they win 3–2.\n\nIn the present day, Marianne gets the now-elderly Chow on television and has changed her mind about leaving. In a post-credits scene, she tells her boss Rahman that she knows his \"secret\": his past career as a football commentator.",
  "synopsis": "Marianne, a young professional, is disillusioned with her working life in Malaysia. Feeling she has had enough, she prepares to leave for Englands greener pastures. But her one final assignment leads her to discover a story so amazing, it literally changes her life.It is a story set in the 1980s during tumultuous economic times, about an unlikely team of footballers whose disagreements have left them with a streak of embarrassing losses. Personal issues have caused each of them to crack under pressure while the team slowly falls apart. They have only one chance left for international glory, and this multicultural team has to find it in their hearts to overcome their individual odds and unite for the sake of an entire country. But unknown to them, their greatest test is yet to come, one that will make or break their fighting spirit and the nations hopes and aspirations.At once a powerful lesson from the past and a hopeful missive for the future, OlaBola, a fictional tale based on true events, invites us to celebrate our differences and unite as a nation with a collective goal. This poignant zero-to-hero story reminds us that there is beauty in our diversity and strength in our unity. And like Marianne, we might just find our reason to persevere and fight for our dreams here within this beautiful country called Malaysia."
}