{
  "imdb_id": "tt5490380",
  "tmdb_id": "382267",
  "douban_id": null,
  "title": "Those Who Jump (2016)",
  "genres": [
    "Documentary"
  ],
  "country": "Denmark",
  "version": [
    {
      "runtime": "80 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm7943796",
      "name": "Abou Bakar Sidibé"
    },
    {
      "id": "nm3211559",
      "name": "Moritz Siebert"
    },
    {
      "id": "nm3155311",
      "name": "Estephan Wagner"
    }
  ],
  "writer": [
    {
      "id": "nm3211559",
      "name": "Moritz Siebert",
      "description": null
    },
    {
      "id": "nm3155311",
      "name": "Estephan Wagner",
      "description": null
    }
  ],
  "cast": null,
  "overview": "In northern Morocco lies the Spanish enclave of Melilla: Europe on African Land. On  the mountain above live over a thousand hopeful African migrants, watching the land  border, a fence system separating Morocco and Spain. Abou from Mali is one of them –  the protagonist in front of the camera, as well as the person behind it. For over a year,  he has ceaselessly persisted in attempting to jump the fence.",
  "storyline": "Mount Gurugu overlooks the Spanish enclave of Melilla on northern Africa's Mediterranean coast. The European Union and Africa are separated here by a high-security border facility consisting of three fences. Refugees, mostly from the sub-Saharan region, live in the tree-covered foothills, from where they try to cross the land border between Morocco and Spain. One of them is Abou Bakar Sidibé from Mali, who in Les Sauteurs is both the protagonist and the one doing the documenting.",
  "plot": "Two years following their success in the 21 Jump Street program, Schmidt (Jonah Hill) and Jenko (Channing Tatum) are back on the streets chasing narcotics. However, after failing in the pursuit of a group of drug dealers led by Ghost (Peter Stormare), Deputy Chief Hardy (Nick Offerman) puts the duo back on the program to work for Captain Dickson (Ice Cube) – now located across the street at 22 Jump Street. Their assignment is to go undercover as college students and locate the supplier of a drug known as \"WHYPHY\" (Work Hard? Yes, Play Hard? Yes) that killed a student photographed buying it on campus from a dealer.\n\nAt college, Jenko quickly makes friends with a pair of jocks named Zook (Wyatt Russell) and Rooster (Jimmy Tatro), the latter being a prime suspect of the investigation. Jenko starts attending parties with the jocks who do not take as kindly to Schmidt. Meanwhile, Schmidt gets the attention of an art student, Maya (Amber Stevens), by feigning an interest in slam poetry. The two sleep together, to the disapproval of Maya's roommate Mercedes (Jillian Bell), and Schmidt later finds that Maya is the daughter of Dickson, whom Schmidt bragged to about \"getting laid,\" much to Dickson's fury. Despite sleeping together, Maya tells Schmidt not to take it seriously, and he starts to feel left out as Jenko bonds more and more with Zook who encourages him to join the football team.\n\nWhen Schmidt and Jenko are unable to identify the dealer, they visit Mr. Walters (Rob Riggle) and Eric (Dave Franco) in jail for advice. Walters points out a unique tattoo on the arm of the dealer in the photograph. Whilst hanging out with Zook and Rooster, Jenko notices that Rooster does not have the tattoo but sees it on Zook's arm. Schmidt and Jenko are invited to join the fraternity led by the jocks but Schmidt refuses, furthering the tension between the two as Jenko passes their requirements. They later realize that Zook is not the dealer but rather another customer. Soon afterwards, they find Ghost and his men on campus, but Ghost again evades them. Jenko reveals to Schmidt that he has been offered a football scholarship with Zook and is uncertain about his future as a police officer. Afterwards, Schmidt reveals his true identity and moves out of the dorm, angering Maya.\n\nSpring break arrives and Schmidt goes after Ghost. He is joined by Jenko, so the two can have one final mission together. The pair head to the beach where Ghost is likely to be dealing WHYPHY. Inside a bar, they find Mercedes, who is Ghost's daughter, giving instructions to other dealers. The pair, backed up by Dickson and the rest of Jump Street, ambush the meeting. Ghost flees, while Mercedes is knocked out by Maya. While pursuing Ghost, Jenko is then shot in the shoulder. Ghost attempts to escape in a helicopter; Schmidt and Jenko manage to jump across to it, but they fall into the sea due to Jenko's injured arm. However, Jenko is able to throw a grenade into the helicopter, supposedly killing Ghost. Back on land, Jenko tells Schmidt that he still wants to be a police officer as he believes their differences help their partnership, and the two reconcile in front of a cheering crowd. Dickson approaches them claiming to have a new mission undercover at a med school.\n\nDuring the credits, Jenko and Schmidt go on to a variety of undercover missions to different schools, which are portrayed as fictional sequels, an animated series, and a toy line. One mission features Detective Booker (Richard Grieco) while another sees the return of Ghost, who survived the helicopter explosion. In a post-credits scene, Walters reveals to Eric that he is late, implying he is pregnant.",
  "synopsis": null
}