{
  "imdb_id": "tt5477608",
  "tmdb_id": "413547",
  "douban_id": null,
  "title": "Kahaani 2 (2016)",
  "genres": [
    "Mystery",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "127 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.0,
  "director": [
    {
      "id": "nm1223910",
      "name": "Sujoy Ghosh"
    }
  ],
  "writer": [
    {
      "id": "nm1223910",
      "name": "Sujoy Ghosh",
      "description": "story &"
    },
    {
      "id": "nm1330994",
      "name": "Suresh Nair",
      "description": "story"
    },
    {
      "id": "nm1223910",
      "name": "Sujoy Ghosh",
      "description": "screenplay"
    },
    {
      "id": "nm1937760",
      "name": "Ritesh Shah",
      "description": "dialogue &"
    },
    {
      "id": "nm1223910",
      "name": "Sujoy Ghosh",
      "description": "dialogue"
    }
  ],
  "cast": [
    {
      "id": "nm1799038",
      "name": "Vidya Balan",
      "character": "Durga Rani Singh /              Vidya Sinha"
    },
    {
      "id": "nm0992000",
      "name": "Arjun Rampal",
      "character": "Sub-inspector Inderjeet Singh"
    },
    {
      "id": "nm0361407",
      "name": "Jugal Hansraj",
      "character": "Mohit Dewan"
    },
    {
      "id": "nm1425584",
      "name": "Kharaj Mukherjee",
      "character": "Pranab Halder"
    },
    {
      "id": "nm1421628",
      "name": "Tota Roy Chowdhury",
      "character": "Arun"
    },
    {
      "id": "nm8536228",
      "name": "Naisha Khanna",
      "character": "Mini"
    },
    {
      "id": "nm8176161",
      "name": "Tunisha Sharma",
      "character": "Teen Minnie"
    },
    {
      "id": "nm8536229",
      "name": "Manini Chadha",
      "character": "Rashmi Singh"
    },
    {
      "id": "nm8651411",
      "name": "Soma Adhikari",
      "character": "Mini's nurse"
    },
    {
      "id": "nm4429138",
      "name": "Ardhendu Banerjee",
      "character": "Doctor Sen"
    },
    {
      "id": "nm2270922",
      "name": "Biswajit Chakraborty",
      "character": "Lalbazaar Police Officer"
    },
    {
      "id": "nm1393288",
      "name": "Pradeep Chakraborty",
      "character": "Benu Uncle"
    },
    {
      "id": "nm3810326",
      "name": "Haridas Chatterjee",
      "character": "Mad Beggar"
    },
    {
      "id": "nm6341122",
      "name": "Michael Raymond Fox",
      "character": "Custom Officer"
    },
    {
      "id": "nm3374330",
      "name": "Nitya Ganguly",
      "character": "Constable Ram Singh"
    },
    {
      "id": "nm10342295",
      "name": "Susanta Joddar",
      "character": "Fighter"
    },
    {
      "id": "nm0611544",
      "name": "Pradip Mukherjee",
      "character": "Doctor Maity"
    },
    {
      "id": "nm8517638",
      "name": "Sanjay Paul",
      "character": "Inspector Pawan"
    },
    {
      "id": "nm3613184",
      "name": "Amba Sanyal",
      "character": "Mrs. Dewan"
    },
    {
      "id": "nm1387306",
      "name": "Koushik Sen",
      "character": "The Policeman Of Kalimpong"
    }
  ],
  "overview": "Vidya Sinha (Vidya Balan) has only one obsession in life. She wants to see her teenage daughter Mini, who is paralysed waist-downwards, walk again. But, is this scenario as obvious as it seems? Or is Vidya an impersonator of Durga Rani Singh from Kalimpong, who is wanted for kidnapping and murder?",
  "storyline": "Vidya Sinha and her daughter Mini live peacefully in the sleepy town of Chandan Nagore. Vidya's life revolves around Mini. Her greatest joys are the little things she does with her daughter, like playing little games and going for walks. However, life has other plans: Mini is kidnapped and while trying to locate her daughter, Vidya is in an accident and goes into a coma. As Inspector Inderjeet investigates the car accident, he discovers that Vidya Sinha may not be all she appears. She has a dark past linking her to Durga Rani Singh - a wanted criminal on the run for kidnapping and murder.",
  "plot": "A poison-gas attack on a Kolkata Metro Rail compartment kills the passengers on board. Two years later Vidya Bagchi (Vidya Balan), a pregnant software engineer, arrives in Kolkata from London during the Durga Puja festivities in search of her missing husband, Arnab Bagchi. A police officer, Satyoki \"Rana\" Sinha (Parambrata Chatterjee), offers to help. Although Vidya claims that Arnab went to Kolkata on an assignment for the National Data Center (NDC), initial investigations suggest that no such person was employed by the NDC.\n\nAgnes D'Mello, the NDC's head of human resources, suggests to Vidya that her husband resembled former employee Milan Damji (Indraneil Sengupta), whose file is probably kept in the old NDC office. Before Agnes can provide any further help she is killed by Bob Biswas (Saswata Chatterjee), an assassin working undercover as a life insurance agent. Vidya and Rana break into the NDC office and find Damji's file, barely escaping an encounter with Bob, who is searching for the same information. Meanwhile, the attempts to obtain Damji's records have attracted the attention of two Intelligence Bureau (IB) officials in Delhi—the chief Bhaskaran K. (Dhritiman Chatterjee) and his deputy Khan (Nawazuddin Siddiqui). Khan arrives in Kolkata and reveals that Damji was a rogue IB agent responsible for the poison-gas attack. In spite of Khan's warnings, Vidya continues her search, fearing that Arnab's resemblance to Damji may have led him into trouble.\n\nThe address on Damji's record leads Vidya and Rana to a dilapidated flat. An errand boy from the neighbourhood tea stall identifies R. Sridhar (Shantilal Mukherjee), an NDC officer, as a frequent visitor to Damji's flat. Bob attempts to kill Vidya, but fails, and is run over by a car during a chase. Examination of Bob's mobile phone leads Vidya and Rana to an IP address sending instructions to kill her. They break into Sridhar's office to verify his IP address, but he is alerted electronically and returns to his office. Vidya accidentally shoots Sridhar dead during a scuffle, which upsets Khan, who had wanted him alive.\n\nSridhar's computer data reveals a code, which when deciphered reveals Bhaskaran's phone number. Vidya calls Bhaskaran to tell him that she has retrieved sensitive documents from Sridhar's office. She asks Bhaskaran to help find her husband in exchange for the documents, but Bhaskaran tells her to contact the local police. Vidya soon gets a call from an unknown number however, warning her that she should hand over the documents to the caller if she wishes to see her husband alive. Khan thinks the caller is Milan Damji.\n\nVidya goes to meet Damji, followed by Rana and Khan. Damji cuts the meeting short when Vidya expresses her doubt that he will be able to return her husband in exchange for the sensitive file, and he attempts to leave. Vidya tries to stop him, and in the ensuing struggle Damji draws a gun on her. Vidya disarms him using the prosthetic belly she has been using to fake her pregnancy and promptly stabbing him in the neck with her hair stick, before shooting him with his own gun. She flees into the crowd before the police arrive, leaving a thank you note for Rana and a pen drive containing data from Sridhar's computer, which leads to Bhaskaran's arrest. Rana concludes that no Vidya or Arnab Bagchi ever existed, and that Vidya had been using the police and the IB to achieve her own ends.\n\nVidya is revealed to be the widow of Arup Basu (Abir Chatterjee), an IB officer and Damji's colleague, who was killed in the poison-gas attack, which also caused Vidya to immediately fall unconscious upon seeing her husband's corpse and suffer a miscarriage. In her mission to avenge his and their unborn child's death, Vidya was helped by retired IB officer Pratap Bajpayee (Darshan Jariwala), who suspected the involvement of a top IB official.",
  "synopsis": "Vidya Sinha (Vidya Balan) is a middle-class working mother who lives in Chandan Nagar, West Bengal with her teenage daughter Minnie (Tunisha Sharma), who is paralyzed from the waist down and uses a wheelchair. Minnie is a happy child and Vidya dotes on her, working hard to save money so that she can take Minnie to America in the hope that the girl will walk again.One day, Vidya returns home in the evening to find her daughter is missing. Vidya then receives a call from an unknown man asking her to come to an address if she does not want to see Mini dead. When she crosses the road, a taxi knocks her down, sending her into a coma. The taxi driver takes her to a nursing home run by Dr. Maity (Pradip Mukherjee). Police Sub-Inspector Inderjeet Singh (Arjun Rampal) is put on Vidya's case. He visits Vidya's home and finds her diary, which he takes as evidence. Inderjeet's senior, Pranab Halder (Kharaj Mukherjee), informs him that a woman named Durga Rani Singh is wanted for a kidnapping and murder case.As Inderjeet reads Vidya's diary, her past is revealed. She worked as a clerk in a school in Kalimpong as Durga Rani Singh. She is friendly with Arun (Tota Roychoudhury) and it is obvious that Arun has feelings for her. At school, she noticed that a student named Minnie Dewan (Naisha Khanna) was always punished for sleeping during classes. When after repeated attempts at befriending reclusive Minnie fail, Durga decides to visit Minnie's grandmother (Amba Sanyal), pretending to be a teacher. Durga's worst fears come true when Minnie confides that her uncle Mohit Dewan (Jugal Hansraj) was sexually abusing her. It is now clear from Durga's diary that she was also a survivor of child sex abuse and she informs Minnie's grandmother but she admonishes her. Durga tries to file a case with the police. But after an investigation made by a Police Officer (Koushik Sen), he finds Mohit Dewan (Jugal Hansraj) innocent and doesn't believe Durga. Minnie jumps off the terrace in desperation and becomes paralyzed from the waist down. A policewoman (Gargi Bharadwaj), taking the side of Minnie's grandmother, threatens Durga not to pursue the matter. Durga decides to save Minnie from her family and has a fight with her grandmother, who gets killed accidentally in the incident. Durga flees with Minnie, settling in Chandan Nagar, with a new name, Vidya Sinha. But Mohit hunts them down and gets Minnie kidnapped with the help of the police woman.In the present, the kidnapper policewoman comes to the nursing home and threatens Vidya to pay ransom to save Minnie, who has been kidnapped by Mohit and her. Terrified, Vidya escapes from the hospital after recovering from the coma and returns home in search of the address that the kidnapper asked her to come to. She is caught by Halder and Inderjeet at her home. However, she is successful in escaping from there, as she shoots Inderjeet in his arm. Vidya then arrives at Kolkata, where she goes to the docks as ordered by Mohit. Vidya offers to pay the ransom to the kidnapper policewoman. Mohit shoots the policewoman when she takes interest in the ransom money. He then tries to strangulate Vidya, but is shot dead by Minnie, who picked up his fallen revolver. Vidya then calls Inderjeet to seek his help, but Haldar and other police officer ask Inderjeet to call her to a place where they can arrest her. Inderjeet asks Vidya to come to his paternal house, where they are surrounded by the police force. Halder tries to come near to Vidya, but she shoots him in the leg. Later, she sets the house on fire.It is finally revealed that Vidya's real name is Durga Rani Singh and she was married to Inderjeet Singh at a very young age, but got separated later. Durga after recovering from the coma asked Inderjeet for his help and they planned her escape. It was Inderjeet, who helped Durga in arranging the real passports for Vidya and her adopted daughter. He helped her in escaping to Kolkata in the police Ambassador car, inside the car trunk, and he helped her escape from the burning house.It is seen that Durga is alive, (who is believed to be dead by the police) and is traveling to New York City for Minnie's operation. Inderjeet is seen happily driving with his family."
}