{
  "imdb_id": "tt5597408",
  "tmdb_id": "385962",
  "douban_id": null,
  "title": "Time Renegades (2016)",
  "genres": [
    "Fantasy",
    "Romance",
    "Thriller"
  ],
  "country": "South Korea",
  "version": [],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm8037968",
      "name": "Jae-Yong Kwak"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm1280145",
      "name": "Soo-jung Lim",
      "character": "Yoon-jung /              So-eun"
    },
    {
      "id": "nm4983186",
      "name": "Jung-suk Jo",
      "character": "Ji-hwan"
    },
    {
      "id": "nm2353702",
      "name": "Jin-wook Lee",
      "character": "Gun-woo"
    },
    {
      "id": "nm1045685",
      "name": "Jin-young Jung",
      "character": "Detective Kang"
    },
    {
      "id": "nm1305598",
      "name": "Ki-woo Lee",
      "character": "Detective Lee"
    },
    {
      "id": "nm1759395",
      "name": "Joo-Wan On",
      "character": "Teacher Park       (as Ju-wan On)"
    },
    {
      "id": "nm4990643",
      "name": "Tae-Ri Lee",
      "character": "Kang Seung-bum       (as Min-ho Lee)"
    },
    {
      "id": "nm1081518",
      "name": "Woong-in Jeong",
      "character": "Kang Hyeong-chul"
    },
    {
      "id": "nm4735772",
      "name": "Sin-hwan Jeon",
      "character": "Biology Teacher"
    }
  ],
  "overview": "In 1983, high school teacher Ji-hwan is attacked by a pickpocket. In 2015, homicide detective Gun-woo is shot during a chase and loses consciousness. Both men are taken to the same hospital in different time periods, and both their hearts stop and miraculously start again at the same time. A mysterious force binds them together, allowing them to see through each other’s lives in their dreams. Soon realizing that the women they love strikingly resembles each other and that they are in fatal danger, the two men must team up to trace the past and change her destiny.",
  "storyline": "In 1983, high school teacher Ji-hwan is attacked by a pickpocket. In 2015, homicide detective Gun-woo is shot during a chase and loses consciousness. Both men are taken to the same hospital in different time periods, and both their hearts stop and miraculously start again at the same time. A mysterious force binds them together, allowing them to see through each other's lives in their dreams. Soon realizing that the woman they love strikingly resemble each other and that they are in fatal danger, the two men must team up to trace the past and change her destiny.",
  "plot": null,
  "synopsis": null
}