{
  "imdb_id": "tt5599692",
  "tmdb_id": "393184",
  "douban_id": null,
  "title": "Clash (2016)",
  "genres": [
    "Drama",
    "Thriller",
    "War"
  ],
  "country": "Egypt",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.2,
  "director": [
    {
      "id": "nm2559996",
      "name": "Mohamed Diab"
    }
  ],
  "writer": [
    {
      "id": "nm2409430",
      "name": "Khaled Diab",
      "description": null
    },
    {
      "id": "nm2559996",
      "name": "Mohamed Diab",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0439292",
      "name": "Nelly Karim",
      "character": "Nagwa"
    },
    {
      "id": "nm3192881",
      "name": "Hani Adel",
      "character": "Adam"
    },
    {
      "id": "nm8072533",
      "name": "El Sebaii Mohamed",
      "character": "Zein"
    },
    {
      "id": "nm8144298",
      "name": "Ahmed Abdelhamid Hefny",
      "character": "Awad"
    },
    {
      "id": "nm8229994",
      "name": "Mahmoud Fares",
      "character": "Central Force Soldier"
    },
    {
      "id": "nm8229995",
      "name": "Waleed Abdel Ghany",
      "character": "Nader"
    },
    {
      "id": "nm5046090",
      "name": "Attef Ammar",
      "character": "Central Force Officer"
    },
    {
      "id": "nm1669689",
      "name": "Tarek Abdel Aziz",
      "character": "Hossam"
    },
    {
      "id": "nm5605139",
      "name": "Hosny Sheta",
      "character": "Fisho"
    },
    {
      "id": "nm6265372",
      "name": "Ahmed Dash",
      "character": "Faris"
    },
    {
      "id": "nm5972255",
      "name": "Ahmed Malek",
      "character": "Mans"
    },
    {
      "id": "nm8161602",
      "name": "Mohamed Abdel Azim",
      "character": "Radwan"
    },
    {
      "id": "nm8161603",
      "name": "Gamil Barsoum",
      "character": "Salah"
    },
    {
      "id": "nm8229997",
      "name": "Khaled Kamel",
      "character": ""
    },
    {
      "id": "nm8229998",
      "name": "Mohamed Tarek",
      "character": "Hussein"
    },
    {
      "id": "nm8229999",
      "name": "Mohamed Gamal Kalbaz",
      "character": "Tamer"
    },
    {
      "id": "nm2764655",
      "name": "Ashraf Hamdi",
      "character": "Omar"
    },
    {
      "id": "nm8230000",
      "name": "Amr Elqady",
      "character": "Mohamed Hashem"
    },
    {
      "id": "nm8230001",
      "name": "Ali Eltayeb",
      "character": "Hothayfa"
    },
    {
      "id": "nm8230002",
      "name": "Mahmoud Gomaa",
      "character": ""
    },
    {
      "id": "nm8229986",
      "name": "Mohamed Salah",
      "character": "M. Hashem"
    },
    {
      "id": "nm7117374",
      "name": "Mohamed Alaa",
      "character": "Moath       (as Mohammad Alaa)"
    },
    {
      "id": "nm8229988",
      "name": "Mohamed Abu Elsoa'ud",
      "character": "Abdel Hamid"
    },
    {
      "id": "nm8162814",
      "name": "May Elghety",
      "character": "Aisha"
    },
    {
      "id": "nm8229989",
      "name": "Ahmed El Turky",
      "character": ""
    },
    {
      "id": "nm8229993",
      "name": "Mohamed ElSouisy",
      "character": "Ouais"
    },
    {
      "id": "nm5106104",
      "name": "Mohamed Radwan",
      "character": "Badr"
    }
  ],
  "overview": "Inspired by a real event , Clash takes place almost entirely in a riot van during a demonstration in Cairo after the removal of President Morsi in 2013.",
  "storyline": "Set entirely in an 8m police truck, a number of detainees from different political and social backgrounds are brought together by their inevitable fate, during the turmoil that followed the ousting of former president Morsi from power.",
  "plot": "In ancient times, after defeating their predecessors, the Titans, the gods divided the Universe among themselves. Zeus took the skies, Poseidon took the seas, and Hades was left with the Underworld upon being tricked by Zeus. The gods created the mortals, whose faith and prayers fueled the gods' immortality. As time passed, however, mortals began to question and soon resist their creators, angering the Olympians.\n\nA fisherman named Spyros finds a coffin adrift in the sea, discovering a baby, Perseus and his mother Danaë. Spyros and his wife, Marmara, raise Perseus as their own son, alongside their daughter, Tekla. One day, an adult Perseus and his family watch soldiers from the city of Argos destroying the statue of Zeus. Infuriated at this, the Gods unleash the Furies who attack the soldiers and destroy the family's fishing vessel. Only Perseus survives and is found by a group of the soldiers.\n\nPerseus is brought before King Cepheus and Queen Cassiopeia, who are celebrating their campaign against the gods. Queen Cassiopeia compares her daughter Andromeda to the gods and boasts that she is more beautiful than Aphrodite. The revelry is cut short by the arrival of Hades, who has been given leave by Zeus to punish the mortals for their defiance. Hades threatens to unleash his monster, the Kraken, against Argos, unless Andromeda is offered as a sacrifice. Before leaving, he reveals that Perseus is a demigod and the son of Zeus. Perseus meets Io, who confirms his origin. According to Io, a king of Argos named Acrisius defied the Gods and laid siege on Olympus. Zeus wanted to teach him a lesson, but he could not kill the humans because he loved them so much. Instead, he decided to make an example out of Acrisius and disguised himself as the king, and then had sex with Queen Danae. When Acrisius realized this, he executed his wife and son, while cursing Zeus and denying him their bodies. Zeus punishes him further by changing him into the deformed creature Calibos. Though Queen Danae dies, her son, who turns out to be Perseus, survives.\n\nPerseus leads the King's Guard to the Stygian Witches, looking for a way to kill the Kraken. After being betrayed by the power-hungry Hades, Zeus gives Perseus a sword forged on Mount Olympus and a winged horse named Pegasus. Perseus refuses both, but the captain of the King's guard, Draco, keeps the sword for when Perseus needs it. Soon after, they are attacked by Calibos. Draco severs Calibos's hand and forces him to flee. The band give chase but are attacked by giant scorpions called Scorpioxs that spring from spilled drops of Calibos's blood. They are saved by a band of Djinn, non-human desert sorcerers led by Sheik Suleiman, who tame the remaining Scorpioxs. Also wishing for the gods' defeat, the Djinn lend their aid to Perseus and his band.\n\nThe group arrives at the lair of the Stygian Witches and learn that to kill the Kraken, they must obtain and use the head of Medusa, a gorgon who resides in a temple in the Underworld. Any living creature that looks on Medusa's eyes turns into stone. Perseus, Io, Suleiman, Draco, and their remaining men cross into the Underworld. The men enter Medusa's temple lair while Io, being a woman and forbidden from entering, remains outside. Medusa kills everyone but Perseus, who manages to behead her by using his reflective shield to see her with his back turned. As he leaves the temple, Calibos appears behind Io and fatally stabs her. As Perseus and Calibos fight, Perseus accepts that he is a son of Zeus, picks up the Olympian sword, and stabs Calibos through the chest, which restores him to his human form. With his last breath, Calibos urges Perseus not to become a God. Before dying, Io urges Perseus to leave her and save Andromeda and Argos. Pegasus takes Perseus back to Argos as the Kraken is released. The people of Argos seize and bind Andromeda to offer her to the Kraken. Meanwhile, Hades reveals he does not require the faith or worship of mortals as Zeus does, as he has learned to survive on their fear. Hades then subdues the weakened Zeus.\n\nPerseus arrives at Argos and exposes Medusa's head to the Kraken, which makes eye contact just before it is able to reach Andromeda. The Kraken, petrified, slowly turns to stone and shatters. Prokopion, the insane leader of the Cult of Hades, tries to kill Perseus, but Cepheus stops him and is stabbed, before both are killed when the Kraken's petrified hand falls on them. Hades appears, intending to kill Perseus, but Perseus, calling upon Zeus, throws his sword at Hades, forcing him back to the Underworld. Perseus rescues Andromeda, who is now crowned Queen of Argos. She asks Perseus to stay by her side as King, but he declines. Perseus also refuses another offer of godhood from Zeus, who then proclaims that if Perseus is to live as a human he should not be alone and subsequently revives Io. Thus, Perseus and Io become lovers.",
  "synopsis": null
}