{
  "imdb_id": "tt5504168",
  "tmdb_id": "386427",
  "douban_id": null,
  "title": "Kshanam (2016)",
  "genres": [
    "Thriller"
  ],
  "country": "India",
  "version": [],
  "imdb_rating": 8.4,
  "director": [
    {
      "id": "nm6044364",
      "name": "Ravikanth Perepu"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm3414188",
      "name": "Adivi Sesh",
      "character": "Rishi"
    },
    {
      "id": "nm3153204",
      "name": "Adah Sharma",
      "character": "Shwetha"
    },
    {
      "id": "nm7850258",
      "name": "Anasuya Bharadwaj",
      "character": "ACP Jaya Bharadwaj"
    },
    {
      "id": "nm8900594",
      "name": "Ravi Varma",
      "character": "Bobby       (as Antagonist)"
    },
    {
      "id": "nm2637065",
      "name": "Ravi Verma",
      "character": "Bobby       (as Ravi Varma)"
    },
    {
      "id": "nm8488982",
      "name": "Satyadev Kancharana",
      "character": "Karthik"
    },
    {
      "id": "nm3808948",
      "name": "Vennela Kishore",
      "character": "Babu Khan"
    },
    {
      "id": "nm1152338",
      "name": "Satyam Rajesh",
      "character": "Chowdary"
    },
    {
      "id": "nm9716845",
      "name": "Raviraja",
      "character": "Assasin 1"
    },
    {
      "id": "nm8285593",
      "name": "Swaraj Rebbapragada",
      "character": "Shwetha's father"
    },
    {
      "id": "nm7834365",
      "name": "Nicola Vann",
      "character": "Stacy"
    },
    {
      "id": "nm3139868",
      "name": "Scot Weaver",
      "character": "Waiter"
    }
  ],
  "overview": "Rishi,an NRI and ex-lover of Swetha returns to India because she asks for help in search of her kidnapped daughter,where the believes doesn't exist.How did Rishi find out the truth behind this scenario?",
  "storyline": "Rishi, an NRI, comes to India in search of his ex-lover Swetha's daughter, who was kidnapped by a gang of Nigerians. The police are uncooperative and there is no evidence to collaborate Swetha's version of events. How will Rishi unravel the mystery?",
  "plot": null,
  "synopsis": "Rishi(Adavi Sesh) is an investment banker settled in the US. One fine day, he gets a call from his ex-girlfriend Swetha(Adah Sharma) and rushes back to India to meet her. Upon his arrival, Swetha reveals a shocking truth to him that her daughter has been kidnapped.A curious Rishi approaches the cops but to his surprise, they do not cooperate with him at all. He then decides to start finding the girl all by himself and comes across many shocking truths during his search.What problems does he face during his search ? What truths does Rishi find out ? and will manage to trace out the little girl ? That forms the rest of the story.Kshanam is one of the technically strong films in the recent past. Even though it is made on a shoe string budget, the production values are superb and credit should go to PVP for backing up a project like this. Camera work by Shaniel Deo is top notch and showcases the film in a engaging mood. A special mention about the music director Sricharan Pakala, who has given a thumping background score which lifts the film decently. Screenplay by Adavi Sesh and Ravikanth Perepu has a few glitches here and there.Coming to the director Ravikanth Perepu, this young man has impressed with his debut film. The new age director has narrated the film in a gripping manner and did not shy away in showcasing some hard hitting twists and turns. What makes his work appreciable is the fact that he manages to build and maintain the suspense till the very end of the film."
}