{
  "imdb_id": "tt5531934",
  "tmdb_id": "398690",
  "douban_id": null,
  "title": "Long Long Time Ago 2 (2016)",
  "genres": [
    "Comedy",
    "Drama"
  ],
  "country": "Singapore",
  "version": [
    {
      "runtime": "122 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.6,
  "director": [
    {
      "id": "nm0626090",
      "name": "Jack Neo"
    }
  ],
  "writer": [
    {
      "id": "nm7142060",
      "name": "Ivan Ho",
      "description": null
    },
    {
      "id": "nm0626090",
      "name": "Jack Neo",
      "description": null
    },
    {
      "id": "nm8001453",
      "name": "Link Sng",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0848817",
      "name": "Aileen Tan",
      "character": "Lim Zhao Di"
    },
    {
      "id": "nm0497834",
      "name": "Mark Lee",
      "character": "Lim Ah Kun"
    },
    {
      "id": "nm3046392",
      "name": "Lei Wang",
      "character": "Si Shu"
    },
    {
      "id": "nm7406651",
      "name": "Benjamin Josiah Tan",
      "character": "Lim Ah Hee       (as Benjamin Tan)"
    },
    {
      "id": "nm2099550",
      "name": "Suhaimi Yusof",
      "character": "Osman"
    },
    {
      "id": "nm4831863",
      "name": "Ryan Lian",
      "character": "Ah Long"
    },
    {
      "id": "nm8232194",
      "name": "Cynthia Kuang",
      "character": "Shu Ting"
    },
    {
      "id": "nm2376347",
      "name": "Jing Jing Ng",
      "character": "Ah Ma       (as Suan Loi Ng)"
    },
    {
      "id": "nm2815600",
      "name": "Silvarajoo Parakasam",
      "character": "Shamugen"
    },
    {
      "id": "nm8232192",
      "name": "Bharathi Rani",
      "character": "Rani"
    },
    {
      "id": "nm3963630",
      "name": "Nurijah Sahat",
      "character": "Fatimah"
    },
    {
      "id": "nm8001448",
      "name": "Charmaine Sei",
      "character": "Ah Feng"
    }
  ],
  "overview": "Zhao Di takes over her family farm with the help of Ah Long after the 1969 floods. After the government started reclaiming land for development in 1977, licensed owners like Zhao Di are compensated but her brother accuses her of having an affair with Ah Long to get the money for himself. Meanwhile, Osman does not approve of his son playing in a rock band as he fears the negative influence, causing his son to run away from home. As for Ah Hee and Rani, they decide to get married but their traditional parents are against it.",
  "storyline": "After the 1969 nationwide floods, Zhao Di takes over her father's family farm with the help of reformed gangster Ah Long. As Singapore's economy prospers, the Singaporean mindset is also forced to change with the times. Osman catches his teenage son, Ahmad practicing with his rock band. As a conservative man, Osman believes rock music will have a negative influence on Ahmad. Father and son argue over their different opinions, causing Ahmad to run away. Meanwhile, Ah Hee and Rani decide to get married. But their traditional parents disapprove of their marriage. In 1977, the Government begins expropriating land for redevelopment, forcing villagers from their kampongs. Licensed farmland owners, such as Zhao Di, are financially compensated for their land. Ah Kun, Zhao Di's greedy brother accuses Zhao Di and Ah Long of having an affair to tarnish her name in front of the family. In the midst of Ah Kun's persistent accusations, Zhao Di's health takes a hit. Will Zhao Di be able to keep her ...",
  "plot": null,
  "synopsis": null
}