{
  "imdb_id": "tt5518022",
  "tmdb_id": "142611",
  "douban_id": null,
  "title": "Houston, We Have a Problem! (2016)",
  "genres": [
    "Documentary",
    "Drama"
  ],
  "country": "Slovenia",
  "version": [
    {
      "runtime": "88 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.2,
  "director": [
    {
      "id": "nm4069208",
      "name": "Ziga Virc"
    }
  ],
  "writer": [
    {
      "id": "nm7588052",
      "name": "Bostjan Virc",
      "description": "writer"
    },
    {
      "id": "nm4069208",
      "name": "Ziga Virc",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm1670978",
      "name": "Slavoj Zizek",
      "character": "Himself"
    },
    {
      "id": "nm0864482",
      "name": "Josip Broz Tito",
      "character": "Himself       (archive footage)"
    },
    {
      "id": "nm0448123",
      "name": "John F. Kennedy",
      "character": "Himself       (archive footage)"
    },
    {
      "id": "nm0425696",
      "name": "Lyndon Baines Johnson",
      "character": "Himself       (archive footage) (as Lyndon Johnson)"
    },
    {
      "id": "nm4194092",
      "name": "David Scott",
      "character": "Himself       (archive footage)"
    },
    {
      "id": "nm0750807",
      "name": "Dean Rusk",
      "character": "Himself       (archive footage)"
    },
    {
      "id": "nm0633271",
      "name": "Richard Nixon",
      "character": "Himself       (archive footage)"
    },
    {
      "id": "nm0141699",
      "name": "Jimmy Carter",
      "character": "Himself       (archive footage)"
    },
    {
      "id": "nm0001051",
      "name": "Bill Clinton",
      "character": "Himself       (archive footage)"
    },
    {
      "id": "nm2699804",
      "name": "Michael Reed",
      "character": ""
    },
    {
      "id": "nm0806988",
      "name": "Bozidar Smiljanic",
      "character": ""
    }
  ],
  "overview": "The cold war, the space race, and NASA’s moon landing are landmark events that defined an era. But they are also fodder for conspiracy theories.\r In Houston, We Have a Problem! filmmaker Žiga Virc adds new material to the discussion on both fronts. This intriguing docu-fiction explores the myth of the secret multi-billion-dollar deal behind America’s purchase of Yugoslavia’s clandestine space program in the early 1960s.",
  "storyline": "The cold war, the space race, and NASA's moon landing are iconic events that defined an era. They are also fodder for conspiracy theories. In Houston, We Have a Problem! filmmaker Ziga Virc explores the myth of a secret multi-billion-dollar deal involving America's purchase of Yugoslavia's space program in the early 1960s. This masterfully crafted feature-length docu-fiction is an intriguing blend of reality and fiction that recreates recent history through the prism of conspiracy theories. It invites the audience to make up its own mind about what is invented and what is real. In between the blurred lines of reality and fiction, Slovenian philosopher Slavoj Zizek asks the billion-dollar question: 'What is truth?' Using a wealth of archive footage, the film brings together all the strands of the myth through an eyewitness account from Ivan, a senior space engineer in the controversial Yugoslav space program. After WW2, Yugoslav intelligence reveals the existence of long-lost space ...",
  "plot": "Yugoslavia developed a space program, as the forgotten third player in the Space Race beside United States and Soviet Union, which Josip Broz Tito then sold to the John F. Kennedy administration in the U.S. in return for $2.5 billion (film estimates at a value of about $50 billion today) in \"overseas aid\" which boosted Yugoslav economy. When the imported technology failed to deliver its promised results for the NASA's future Moon landing, an angry U.S. applied pressure to Tito, including financial blackmail and threats of military action, culminating in a secret CIA plot that triggered the bloody breakup of Yugoslavia.",
  "synopsis": null
}