{
  "imdb_id": "tt5588416",
  "tmdb_id": "408102",
  "douban_id": null,
  "title": "2Eleven (2015)",
  "genres": [
    "Action"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "107 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.9,
  "director": [
    {
      "id": "nm8029047",
      "name": "Derek Scott"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm9251438",
      "name": "Vince Arians",
      "character": "Basketball Player"
    },
    {
      "id": "nm8029049",
      "name": "Chamar Avery",
      "character": "Zo"
    },
    {
      "id": "nm4549004",
      "name": "Delores Harris",
      "character": "Mama       (as Delores 'lady dee' Harris)"
    },
    {
      "id": "nm8447738",
      "name": "Martell Lane",
      "character": "Tell"
    },
    {
      "id": "nm8029048",
      "name": "April Lockett",
      "character": "Cynthia"
    },
    {
      "id": "nm9251437",
      "name": "Joseph Mcphasion",
      "character": "Drive by Driver"
    },
    {
      "id": "nm8447736",
      "name": "Murda Pain",
      "character": "Murda"
    },
    {
      "id": "nm8029047",
      "name": "Derek Scott",
      "character": "Killz"
    },
    {
      "id": "nm3972728",
      "name": "Paije Speights",
      "character": "Esha"
    },
    {
      "id": "nm5936661",
      "name": "Angel Spieghts",
      "character": "Len's Girlfriend"
    },
    {
      "id": "nm9251436",
      "name": "Geneia Staranna",
      "character": "Natty"
    }
  ],
  "overview": "2ELEVEN IS THE TALE OF TWO BROTHERS HUSTLING TO SURVIVE IN THE STREETS OF DETROIT. ZO, THE CALM, AMBITIOUS BROTHER WANTS NOTHING MORE THAN TO GIVE HIS DAUGHTER, NATTY, A BETTER LIFE WHILE MURDA, THE FLASHY HOT TEMPERED BROTHER LOVES THE FAST LIFE AND EVEN FASTER MONEY. TWO VERY DIFFERENT BROTHERS WITH THE SAME OCCUPATION, COMMITTING ROBBERIES. ZO, MURDA, AND THEIR ACCOMPLICE, RELL START OFF AS SMALL TIME THIEVES UNTIL ZO LINKS UP WITH A SEASON VETERAN WHO GIVES THEM THE OPPORTUNITY TO CATCH BIGGER FISH AND MAKE MORE MONEY. ONCE THESE \"JACK BOYS\" BEGIN TO SEE A SHIFT IN INCOME, THE DIFFERENCES BETWEEN ZO AND MURDA BECOME MORE APPARENT. TEMPERS FLARE, BLOOD IS SHED, AND LINES ARE CROSSED. THE MORE MONEY THAT IS MADE, THE MORE LOYALTY IS TESTED. THIS URBAN DRAMA IS SURE TO LEAVE YOU THINKING",
  "storyline": "2Eleven is the tale of two brothers hustling to survive in the streets of Detroit. Zo, the calm, ambitious brother, wants nothing more than to give his daughter, Natty, a better life while Murda, the flashy, hot tempered brother, loves the fast life and even faster money. Two very different brothers with the same occupation, committing robberies. Zo, Murda, and their accomplice Rell start off as small time thieves until Zo links up with a season veteran who gives them the opportunity to catch bigger fish and make more money. Once these \"jack boys\" begin to see a shift in income, the differences between Zo and Murda become more apparent. Tempers flare, blood is shed, and lines are crossed. The more money that is made, the more loyalty is tested. This urban drama is sure to leave you thinking.",
  "plot": "A Baker and his Wife wish for a child but suffer under a curse laid upon the Baker's family by a Witch who found the Baker's father robbing her garden when his mother was pregnant. The Baker's father also stole some beans which caused the Witch's mother to punish her with the curse of ugliness. The Witch offers to lift the curse, but only if the Baker and his Wife obtain four critical items for her: a cow as white as milk, a cape as red as blood, the hair as yellow as corn, and a slipper as pure as gold. The Witch later tells the Baker that she asked him to do this task for her because she is not allowed to touch any of the objects.\n\nThe Witch's demands eventually bring the Baker and his Wife into contact with Jack, who is selling his beloved cow Milky-White and to whom the Baker offers magic beans left him by his father (which were stolen from the Witch) which grow into a large beanstalk; with Red Riding Hood, whose ruby cape the couple notices when she stops to buy sweets on her way to grandmother's house; with Rapunzel, whose tower the Baker's Wife passes in the woods; and with Cinderella, who also runs into the Baker's Wife while fleeing from the pursuing Prince.\n\nAfter a series of failed attempts and misadventures, the Baker and his Wife finally are able to gather the items necessary to break the spell. Meanwhile, each of the other characters receive their \"happy endings\": Cinderella marries the Prince; Jack provides for his mother by stealing riches from the Giant in the sky, and kills the pursuing Giant by cutting down the beanstalk; Little Red Riding Hood and her Grandmother are saved from the Big Bad Wolf; and the Witch regains her youth and beauty after drinking the potion.\n\nHowever, each of the characters learns their \"happily ever after\" is not so happy: the Baker is worried he is a poor father to his newborn baby; the Baker's Wife is temporarily seduced by the Prince; Cinderella is disenchanted by the cheating Prince; and the Witch learns that she has lost her powers with her restored youth and beauty. The growth of a second beanstalk from the last remaining magic bean allows the Giant's Wife to climb down and threaten the kingdom and its inhabitants if they do not deliver Jack in retribution for killing her husband. The characters debate the morality of handing Jack over. In the process, Red Riding Hood's Mother and Grandmother, Jack's Mother, and the Baker's Wife are killed. The characters blame each other for their individual actions that lead to the tragedy, ultimately blaming the Witch for raising the beans in the first place. She curses them for their inability to accept their individual responsibilities and disappears into the ground, summoning a large pit of boiling tar in the process.\n\nThe remaining characters resolve to kill the threatening Giant's Wife, though Cinderella and the Baker try to explain to the distraught Red Riding Hood and Jack the complicated morality of retribution and revenge. The characters lure the Giant's Wife into stepping in the tar pit where she ultimately trips and falls to her death. The Giant's Wife is killed, and the characters move forward with their ruined lives. The Baker, thinking of his Wife, is determined to be a good father. Cinderella decides to leave the Prince and help the Baker, and Jack and Red Riding Hood, now orphans, are living with the Baker and Cinderella. The Baker comforts his son after he begins to cry by telling a story as the movie ends with the Witch's moral, meaning that children can change due to the parent's actions and behaviors.",
  "synopsis": null
}