{
  "imdb_id": "tt5517816",
  "tmdb_id": "393885",
  "douban_id": null,
  "title": "A Year in Space (TV Series 2015– )",
  "genres": [
    "Documentary"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "56 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.1,
  "director": [
    {
      "id": "nm1953967",
      "name": "Jonathan Halperin"
    },
    {
      "id": "nm5356362",
      "name": "Shaul Schwarz"
    }
  ],
  "writer": [
    {
      "id": "nm1953967",
      "name": "Jonathan Halperin",
      "description": "unknown episodes"
    }
  ],
  "cast": [
    {
      "id": "nm2836768",
      "name": "Scott Kelly",
      "character": "Himself                  unknown episodes"
    },
    {
      "id": "nm4773741",
      "name": "Mark Kelly",
      "character": "Himself                  unknown episodes"
    },
    {
      "id": "nm7718303",
      "name": "Mikhail Kornienko",
      "character": "Himself                  unknown episodes"
    },
    {
      "id": "nm7205395",
      "name": "Gennady Padalka",
      "character": "Himself                  unknown episodes"
    },
    {
      "id": "nm7895181",
      "name": "Amiko Kauderer",
      "character": "Herself                  unknown episodes"
    }
  ],
  "overview": "A day in space means 16 trips around the Earth, 16 sunrises and sunsets, and 16 opportunities to watch the Earth crawl by below, always in your sight—and always out of reach.  A Year in Space follows American Astronaut Scott Kelly and Russian Cosmonaut Mikhail Kornienko on their record-breaking stay aboard the International Space Station—part of an ambitious experiment to determine if humanity's grand dreams of traveling to Mars can ever be achieved. This 11-episode series chronicles their mission, the thousands of people who work to support live in space and the families they left behind.",
  "storyline": "Astronaut Scott Kelly's record-breaking year in space -- from launch to landing.",
  "plot": "At a video-game arcade in 1982 with his friend Will Cooper, 13-year-old Sam Brenner discovers he can master the games by spotting patterns. Participating in a video-game championship, he loses in a match with obnoxious arcade player Eddie Plant in Donkey Kong. A videocassette with footage of the event is included in a time capsule that is launched into space.\n\n33 years later, Brenner has become an installer of home-theater systems while Cooper is the President of the United States. In Guam, a U.S. military base is attacked by UFOs of Galaga that turn pieces of the base into small glowing cubes and one of the soldiers is abducted.\n\nWhile working at the home of divorcée Violet Van Patten and her son Matty, Brenner is summoned to the White House. To his surprise, he finds Violet is also headed there as a lieutenant colonel. Upon seeing the video footage and meeting with Ludlow \"The Wonder Kid\" Lamonsoff, a friend he made at the video game tournament, Brenner determines the aliens have found the videocassette images to be a declaration of war and are attacking with a spacecraft resembling those of their classic video games. This is affirmed when the aliens interrupt a television broadcast, challenging Earth to a battle where if the aliens win three rounds, they will conquer the Earth. Brenner and Cooper are unable to stop one of the attacks as Arkanoid paddles sling balls of light to destroy the Taj Mahal, and another person is abducted.\n\nBrenner and Ludlow train Navy SEALs to play the old games. Violet develops light cannons that are effective against the aliens. In London, the aliens attack in the form of the video game Centipede, but as the soldiers are unable to beat them (as they forgot to shoot at the heads), Brenner and Ludlow step in and shoot them down. Following the victory, the aliens send congratulations and a \"trophy\" in the form of the dog from Duck Hunt to an old woman (who appeared earlier at the London attack).\n\nLudlow and Cooper retrieve Eddie, who had been serving a prison sentence for fraud. In New York City, the team discovers it must participate as the ghosts against Pac-Man. Toru Iwatani, the creator of Pac-Man, flees after his hand is bitten off by him. Using Mini Cooper cars, Brenner, Ludlow, and Eddie overcome the task, but Violet notices that something about Eddie is off, as he moved at supersonic speeds around the board. They win Q*Bert as a trophy, but the aliens (as Hall &amp; Oates) later declare that someone cheated and the contest for the planet has been forfeited. Matty discovers Eddie used a speed cheat, thus revealing that he is the one that cheated. When the aliens' mother ship suddenly appears, Eddie flees from it, but Matty is abducted by the aliens.\n\nAs revenge for Earth cheating, the aliens launch a massive attack using characters from all sorts of classic video games on Washington, D.C. Cooper joins the team, while Ludlow stays to fight. An alien takes the form of Lady Lisa, a character on whom Ludlow had a crush since childhood. Ludlow persuades Lady Lisa to choose love, and she sides with the humans; Eddie, wishing to make amends, returns to fight as well. Brenner, Violet and Cooper are summoned to the mother ship where they face the alien leader who takes the form of Donkey Kong on the game's starting level with the aliens' captives at the top. As the group dodges barrels and fireballs, Brenner feels depressed and loses hope, until Matty reveals to him that Eddie was cheating, restoring his confidence, and Brenner eventually throws a hammer to defeat Donkey Kong. The aliens' characters then self-destruct.\n\nThe team is hailed as heroes and a peace agreement is reached with the aliens. Eddie apologises to Brenner for cheating in his life. Although Ludlow is saddened that Lady Lisa is gone, Q*Bert transforms its likeness to Lady Lisa. Brenner and Violet become a couple, while Eddie gets to meet Serena Williams and Martha Stewart. A year later, Lady Lisa and Ludlow are married and have Q*Bert children.",
  "synopsis": null
}