{
  "imdb_id": "tt5535814",
  "tmdb_id": "384289",
  "douban_id": null,
  "title": "Peter and the Farm (2016)",
  "genres": [
    "Documentary"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "91 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.9,
  "director": [
    {
      "id": "nm2708306",
      "name": "Tony Stone"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm7985809",
      "name": "Peter Dunning",
      "character": ""
    }
  ],
  "overview": "Peter Dunning is a rugged individualist in the extreme, a hard-drinking loner and former artist who has burned bridges with his wives and children and whose only company, even on harsh winter nights, are the sheep, cows, and pigs he tends on his Vermont farm. Peter is also one of the most complicated, sympathetic documentary subjects to come along in some time, a product of the 1960s counterculture whose poetic idealism has since soured. For all his candor, he slips into drunken self-destructive habits, cursing the splendors of a pastoral landscape that he has spent decades nurturing.",
  "storyline": "Peter Dunning is the proud proprietor of Mile Hill Farm, which sits on 187 acres in Vermont. The land's 38 harvests have seen the arrivals and departures of three wives and four children, leaving Peter with only animals and memories. The arrival of a film crew causes him to confront his history and his legacy, passing along hard-won agricultural wisdom even as he doubts the meaning of the work he is fated to perform until death. Haunted by alcoholism and regret, Peter veers between elation and despair, often suggesting to the filmmakers his own suicide as a narrative device. He is a tragedian on a stage it has taken him most of his life to build, and which now threatens to collapse from under him. At once a postcard from paradise and a cautionary tale for our times, Peter and The Farm sifts through the potential energy of a human life, that which is used and that which is squandered.",
  "plot": null,
  "synopsis": null
}