{
  "imdb_id": "tt5571734",
  "tmdb_id": "415358",
  "douban_id": null,
  "title": "Pink (2016)",
  "genres": [
    "Drama",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "136 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.5,
  "director": [
    {
      "id": "nm2287772",
      "name": "Aniruddha Roy Chowdhury"
    }
  ],
  "writer": [
    {
      "id": "nm1999473",
      "name": "Shoojit Sircar",
      "description": "story &"
    },
    {
      "id": "nm2287772",
      "name": "Aniruddha Roy Chowdhury",
      "description": "story &"
    },
    {
      "id": "nm1937760",
      "name": "Ritesh Shah",
      "description": "story"
    },
    {
      "id": "nm1937760",
      "name": "Ritesh Shah",
      "description": "dialogue"
    },
    {
      "id": "nm1937760",
      "name": "Ritesh Shah",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm3966456",
      "name": "Tapsee Pannu",
      "character": "Minal Arora"
    },
    {
      "id": "nm0000821",
      "name": "Amitabh Bachchan",
      "character": "Deepak Sehgal"
    },
    {
      "id": "nm4112854",
      "name": "Kirti Kulhari",
      "character": "Falak Ali"
    },
    {
      "id": "nm8019376",
      "name": "Andrea Tariang",
      "character": "Andrea"
    },
    {
      "id": "nm0592795",
      "name": "Piyush Mishra",
      "character": "Prashant Mehra"
    },
    {
      "id": "nm1979275",
      "name": "Angad Bedi",
      "character": "Rajveer Singh"
    },
    {
      "id": "nm1994146",
      "name": "Vijay Varma",
      "character": "Ankit Malhotra"
    },
    {
      "id": "nm3883134",
      "name": "Raashul Tandon",
      "character": "Dumpy"
    },
    {
      "id": "nm7517010",
      "name": "Tushar Pandey",
      "character": "Vishwajyoti Ghose"
    },
    {
      "id": "nm0154122",
      "name": "Dhritiman Chatterjee",
      "character": "Judge Satyajeet Dutt"
    },
    {
      "id": "nm0788164",
      "name": "Mamata Shankar",
      "character": "Sara Sehgal"
    },
    {
      "id": "nm5645491",
      "name": "Amit Baisoya",
      "character": "Waiter Mukesh"
    },
    {
      "id": "nm7507760",
      "name": "S.K. Batra",
      "character": "Neighbour Sinha"
    },
    {
      "id": "nm8349000",
      "name": "Prashant Bhagia",
      "character": "Dr. Uday"
    },
    {
      "id": "nm5448327",
      "name": "Arjun Chakraborty",
      "character": "Ritwik"
    },
    {
      "id": "nm6509792",
      "name": "Alka Chatwal",
      "character": "The Female Constable In Court"
    },
    {
      "id": "nm5440206",
      "name": "Sushil Dahiya",
      "character": "Ranjit Sherawat"
    },
    {
      "id": "nm8464449",
      "name": "Sudhanva Deshpande",
      "character": "Javed"
    },
    {
      "id": "nm5000540",
      "name": "Swaroopa Ghosh",
      "character": "Uma Di"
    },
    {
      "id": "nm8464453",
      "name": "Johar Kango",
      "character": "Neighbour Gupta"
    },
    {
      "id": "nm8464452",
      "name": "Rita Kapoor",
      "character": "Mrs. Sinha"
    },
    {
      "id": "nm8464450",
      "name": "Radha Khandelwal",
      "character": "The Female Constable"
    },
    {
      "id": "nm3999011",
      "name": "Pawan Mahendru",
      "character": "Minal's Helpless Father"
    },
    {
      "id": "nm8674661",
      "name": "Mamta Malik",
      "character": "S.H.O. Sarla Premchand"
    },
    {
      "id": "nm1030318",
      "name": "Jogi Mallang",
      "character": "Police Inspector Shaukeen       (as Jogi)"
    },
    {
      "id": "nm8464454",
      "name": "Sakshi Mehta",
      "character": "Suman"
    },
    {
      "id": "nm0619405",
      "name": "Vinod Nagpal",
      "character": "Kasturilal"
    },
    {
      "id": "nm4718094",
      "name": "R. Pandey",
      "character": "Manager Ramakant Vijay"
    },
    {
      "id": "nm8464455",
      "name": "Arun Poorie",
      "character": "Andrea's Boss"
    },
    {
      "id": "nm1639099",
      "name": "Vinod Rai",
      "character": "Andrea's Father"
    },
    {
      "id": "nm9360449",
      "name": "Ansh Rathore",
      "character": "Vik"
    },
    {
      "id": "nm1937760",
      "name": "Ritesh Shah",
      "character": "Falak's Boss"
    },
    {
      "id": "nm8464451",
      "name": "Savita Sharma",
      "character": "Falak's Mother"
    }
  ],
  "overview": "Deepak is a lawyer suffering from bipolar disorder who experiences frequent mood swings. One night, Rajveer and his friends get drunk and try to molest Miss Arora and her two roommates leading to an accident. The film revolves around how Deepak fights the girls' case against these influential boys.",
  "storyline": "Deepak is a lawyer suffering from bipolar disorder who experiences frequent mood swings. One night, Rajveer and his friends get drunk and try to molest Miss Arora and her two roommates leading to an accident. The film revolves around how Deepak fights the girls' case against these influential boys.",
  "plot": "This section's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (December 2016) (Learn how and when to remove this template message)\nThe movie opens with Raunak Anand a.k.a. Dumpy (Raashul Tandon) and Ankit Malhotra (Vijay Verma) rushing their friend, Rajveer Singh (Angad Bedi) who is profusely bleeding from an injury to his forehead, to a hospital in south Delhi. He nearly loses his eye but is treated. They nervously refrain from filing a police complaint. Elsewhere three young women — Meenal Arora (Taapsee Pannu), Falak Ali (Kirti Kulhari) and Andrea Tariang (Andrea Tariang) — travel nervously in a taxi and reach their apartment. They look disoriented, and it is implied that they have something to do with the incident.\n\nMeenal and her friends try to carry on with their normal life. They are independent and self-sufficient women staying together in a south Delhi locality. Meenal goes out for her morning run as usual, where she sees an old man staring at her. He turns out to be Deepak Sehgal (Amitabh Bachchan), their neighbor. Eventually a series of threats arise apparently from Rajveer’s friends with Falak losing her job and others being followed. They are discouraged by a police officer from filing a complaint stating it would make their daily life miserable. In reality the police are aware that the young men are \"well connected\" and are backed-up by Rajveer’s uncle who is a powerful politician from South Delhi.\n\nMeenal is kidnapped by Rajveer’s friends during her morning run. Deepak Sehgal who watches this but is helpless. He learns from the ACP that they are involved in a brawl with the nephew of a South Delhi politician. Meenal is molested by Rajveer’s friends in the moving car and dropped back at night after being warned. The next day, Meenal is arrested by Haryana police from her apartment apparently based on a complaint from Ranveer labeling them as prostitutes and charging Meenal with an attempt to murder. Deepak Sehgal visits Falak and Andrea at their apartment and helps them with the bail procedures. It turns out that Deepak Sehgal was a reputable lawyer who has retired. He comes out of retirement and help the young women. He also has to take care of his ailing wife Sara (Mamta Shankar) and has to put up with his own health issues related to ageing.\n\nIn the courtroom, Rajveer’s lawyer, Prashant Mehra (Piyush Mishra), presents his client, Rajveer’s version of the story of what happened in the private resort, as follows: “Rajveer and his friends meet with Meenal and her friend at a rock concert. The boys invite the three girls for dinner in a private hotel resort, where they have a drink. The girls provoke the boys and demand money, all signs indicating that they are prostitutes. Rajveer refuses to pay and an enraged Meenal hits him in the head with a bottle and flees.”\n\nPrashant’s argument focuses on the poor moral character of the women. The statements from the accused indicate that they were tricked into such a compromising situation and forced against their will. They refused and said “no”. Deepak’s argument focuses on the “consent” and a woman’s right. A series of interesting and chilling courtroom arguments ensues in the following days. Toward the end of the trial, Rajveer gets provoked and unintentionally states that the women “got what they deserved”. Deepak criticizes the regressed views of the society where women are stereotyped as spoilt and prostitutes: If they come home late, if they move out of their home, want to be independent, if they drink, if they giggle and so on, but none of these apply to men.\n\nIn his closing remarks, Deepak mentions that his client said “no” which is a statement and implies a woman’s right. No simply means no and doesn’t require further explanation. The court rules in favor of the women acquitting them. Rajveer, Ankit, and Dumpy are remanded with the final verdict of their punishment pending. Deepak gains the respect of all those gathered, including Prashant.\n\nThe closing credits shows what happened in the resort, with the events leading up to Meenal’s attack on Rajveer.",
  "synopsis": "Three young and affluent boys, Raunak (Raashul Tandon), Vishwajyoti (Tushar Pandey) and Rajveer Singh (Angad Bedi) rush to the nearest hospital because Rajveer is profusely bleeding from an injury to his head. They nervously refrain from filing a police complaint.On the other side of the same town, three young women - Minal (Taapsee Pannu), Falak (Kirti Kulhari) and Andrea - hurriedly travel in a taxi to their apartment. They look disoriented, and it is implied that they have something to do with the incident. Minal and her friends are shaken but try to carry on with their normal life.The story revolves around these three young women. They are independent and self-sufficient women living together in Faridabad.Minal goes out for her usual morning run, where she is constantly observed by an old man who lives in her neighbourhood, a man called Deepak (Amitabh Bachchan). He senses there is something wrong and introduces himself to these women as a reputable lawyer who is in retirement, and they enlist his help in the matter.Eventually, as Deepak had predicted to the women, a series of threats arise from Rajveer's friend Ankit (Vijay Varma), who pushes for revenge. The threats result in Andrea being stalked and Falak losing her job. They are discouraged by a police officer from filing a complaint stating it would make their daily lives more miserable unless they relocate to another town or city. In reality, the local police are aware that the young men are \"well connected\" and are backed-up by Rajveer's uncle Ranjit, a powerful influential politician from South Delhi.Nevertheless, Minal files a complaint.Immediately, the next day, Minal is kidnapped by Rajveer's friends during her morning run. Deepak witnesses the incident but is unable to help in the heat of the moment even though he notes down the details and number plate of the carMinal is threatened to stop filing complaints, blackmailed and is molested in the moving car and later dropped back home after all the commotion with a serious warning. A few days later, Minal is arrested by police from her apartment, based on a complaint from Rajveer labelling the women as prostitutes and charging Minal with attempted murder.At this point, Deepak says enough is enough and visits Falak and Andrea at their apartment. Soon enough he helps them with the bail procedures and also in representing them in the court to plead their case.In the courtroom, Rajveer's lawyer, Prashant Mehra (Piyush Mishra), presents the following version of events:Rajveer and his friends meet with Minal and her friends at a rock concert. The men invite the women for dinner at a hotel resort, where they have drinks. The women provoke the men, have intimate relations and thereafter demand money, all signs indicating that they are prostitutes. Rajveer refuses to pay and an enraged Minal hits him on the head with a bottle and flees. Prashant's argument focuses on the poor moral character of the women. He pushes the idea that the friendly manner of the women, the fact that they attended a rock concert and the fact that they had drinks with the men indicate that they were prostitutes. Prashant attacks the fact that Minal has family in Delhi but chooses to live alone, Falak is in a relationship with an older man, and Andrea has moved to the city from Northeast India.Contrary to this, Minal and her friends statement: that the men tried to sexually assault them. Minal alleges that Rajveer tried to rape her, and she attacked him with the bottle in self-defense.Deepak's argument focuses on the issue of consent and a woman's right to say no.A series of interesting and chilling courtroom arguments ensues in the following days.Towards the end of the trial, Rajveer becomes enraged and provoked by the reputable and respected lawyer Deepak, revealing the truth by stating that the women \"got what they deserved\".Deepak criticizes the regressed views of the society where women are stereotyped as prostitutes if they come home late, move out of their home, want to be independent, drink and so on, but none of these applies to men.In his closing remarks, Deepak mentions that his client said \"no\". No means no and does not require further explanation. The women are acquitted while Rajveer, Ankit, and Dumpy are charged, with the duration of their sentences pending. Vishwajyoti is let off with a warning."
}