{
  "imdb_id": "tt5672048",
  "tmdb_id": "401146",
  "douban_id": null,
  "title": "Your Lie in April (2016)",
  "genres": [
    "Drama",
    "Music",
    "Romance"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "122 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.1,
  "director": [
    {
      "id": "nm0793944",
      "name": "Takehiko Shinjo"
    }
  ],
  "writer": [
    {
      "id": "nm7566180",
      "name": "Naoshi Arakawa",
      "description": "manga"
    },
    {
      "id": "nm1413751",
      "name": "Yukari Tatsui",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm4081467",
      "name": "Kento Yamazaki",
      "character": "Kousei Arima"
    },
    {
      "id": "nm5620173",
      "name": "Suzu Hirose",
      "character": "Kaori Miyazono"
    },
    {
      "id": "nm5140138",
      "name": "Anna Ishii",
      "character": "Tsubaki Sawabe"
    },
    {
      "id": "nm4667834",
      "name": "Taishi Nakagawa",
      "character": "Ryota Watari"
    },
    {
      "id": "nm1040533",
      "name": "Masahiro Kômoto",
      "character": ""
    },
    {
      "id": "nm0393093",
      "name": "Hirotarô Honda",
      "character": ""
    },
    {
      "id": "nm0411644",
      "name": "Yuka Itaya",
      "character": "Hiroko Seto"
    },
    {
      "id": "nm2237350",
      "name": "Rei Dan",
      "character": "Saki Arima"
    }
  ],
  "overview": "Arima Kousei won numerous piano competitions while under the strict watch of his mother. He was known as the human metronome during that time. Since the death of his mother, Kousei has been unable to hear the sound of his piano. He then meets Miyazono Kaori through childhood friend Sawabe Tsubaki. Kaori plays the violin and has a free sprit. Since meeting her, Kousei is able to face the piano again. Meanwhile, Kaori holds a secret.",
  "storyline": "A piano prodigy who lost his ability to play after suffering a traumatic event in his childhood is forced back into the spotlight by an eccentric girl with a secret of her own.",
  "plot": "Piano prodigy Kōsei Arima dominated the competition and has become famous among child musicians but also controversial. After his mother, who was also his coldhearted, abusive instructor that forced him to play the piano emotionlessly, died, he had a mental breakdown while performing at a piano recital at the age of eleven. As a result, he is no longer able to hear the sound of his piano even though his hearing is perfectly fine. Two years later, Kōsei hasn't touched the piano and views the world in monochrome, without any flair or color. He has resigned himself to living out his life with his good friends, Tsubaki and Watari, until, one day, a girl changes everything. Kaori Miyazono, a fourteen-year old audacious, free-spirited violinist whose playing style reflects her manic personality, helps Kōsei return to the music world and shows that it should be free and mold breaking unlike the structured and rigid style Kōsei was used to, and as she continues to uplift him, he quickly realizes that he loves her, though she already likes Watari. The three watch Kaori play at a competition and is greatly moved. She is selected to play at the prelims, due to winning audiences' choice. After Watari stays after school for soccer practice and doesn't walk with Kaori, she asked Kōsei to fill in. They go to a café and Kōsei shows two girls his piano skills. He does an amazing job, but stops abruptly. He explains later on to Kaori, why this is. She asked Kōsei to accompany her at the prelims. He refuses at first, but after much persuasion from Tsubaki and Kaori, Kōsei finally agrees. Though they have not rehearsed, they do an incredible job, except for the time when Kōsei is unable to hear the notes for a moment. Kaori stops and waits for him, and they eventually pick back up. Because of this, the two are disqualified. When they finish Kōsei and Kaori receive a long round of applause, but Kaori suddenly collapses and is hospitalised. When visited by Kōsei, Tsubaki, and Watari she says she has always been anemic and her father just wanted some routine testing done. She then says she will be fine. Though, when they leave she asks the nurse to hook her back up to the IVs and has a flashback looking out the window in her hospital bed saying, \" I see, so I collapsed again\". She is back in school soon after. Kaori invites Kōsei to play at a gala concert with him.",
  "synopsis": null
}