{
  "imdb_id": "tt5641970",
  "tmdb_id": "424393",
  "douban_id": null,
  "title": "Memo (TV Movie 2016)",
  "genres": [
    "Drama"
  ],
  "country": "Hungary",
  "version": [],
  "imdb_rating": 7.7,
  "director": [
    {
      "id": "nm0850952",
      "name": "István Tasnádi"
    }
  ],
  "writer": [
    {
      "id": "nm0850952",
      "name": "István Tasnádi",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0961287",
      "name": "Tamás Lengyel",
      "character": "Dr. Lónyai Péter"
    },
    {
      "id": "nm3263356",
      "name": "Áron Molnár",
      "character": "Seress Ervin"
    },
    {
      "id": "nm0369412",
      "name": "Péter Haumann",
      "character": "Apa"
    },
    {
      "id": "nm2102212",
      "name": "Orsolya Holecsko",
      "character": "Olga"
    },
    {
      "id": "nm0785031",
      "name": "Zoltán Seress",
      "character": "Wéber professzor"
    },
    {
      "id": "nm0190794",
      "name": "Eszter Csákányi",
      "character": "Tanszékvezetö"
    },
    {
      "id": "nm0879434",
      "name": "Attila Tóth",
      "character": "Kiss Mátyás"
    },
    {
      "id": "nm7568762",
      "name": "Judit Osváth",
      "character": "Luca"
    },
    {
      "id": "nm8076245",
      "name": "Sára Gábor",
      "character": "Diáklány"
    },
    {
      "id": "nm8076246",
      "name": "Bence Bíró",
      "character": "Eminens"
    },
    {
      "id": "nm2127674",
      "name": "Kriszta Szorcsik",
      "character": "Növér 1"
    },
    {
      "id": "nm8076247",
      "name": "Janka Kertész",
      "character": "Növér 2"
    },
    {
      "id": "nm6632265",
      "name": "Gergo Bánki",
      "character": "Pincér"
    },
    {
      "id": "nm0879248",
      "name": "Roland Tzafetás",
      "character": "Vendég"
    },
    {
      "id": "nm8076248",
      "name": "Timur Khrotko",
      "character": "Szaktekintély"
    },
    {
      "id": "nm8076249",
      "name": "Ida Kovács",
      "character": "Tolmács"
    },
    {
      "id": "nm3072343",
      "name": "Ádám Béli",
      "character": "Mentöorvos"
    },
    {
      "id": "nm2156329",
      "name": "Béla Szemán",
      "character": "Orvos"
    },
    {
      "id": "nm8076250",
      "name": "Ildikó Végh",
      "character": "Tanárnö"
    },
    {
      "id": "nm8076251",
      "name": "Péter Braun",
      "character": "Kutató tanár"
    },
    {
      "id": "nm6697659",
      "name": "Gábor Dávid Nádas",
      "character": "Asszisztens"
    },
    {
      "id": "nm0598404",
      "name": "András Monori",
      "character": "Szintetizátoros"
    },
    {
      "id": "nm9200843",
      "name": "Márton Csuzi",
      "character": "Beteg"
    },
    {
      "id": "nm5771028",
      "name": "Judit Molnár",
      "character": "Seress anyja"
    }
  ],
  "overview": "An ambitious psychiatrist is researching a strange and unique mental state: hypermnesia, first of all because he would like to help his amnesic father. When he finds a patient with hypermnesia, he decides to take him out of the mental hospital at his own risk and study him. An unusual relationship is formed between the two men, which starts to endanger the doctor's career, his marriage and even the patient himself.",
  "storyline": "An ambitious psychiatrist is researching a strange and unique mental state: hypermnesia, first of all because he would like to help his amnesic father. When he finds a patient with hypermnesia, he decides to take him out of the mental hospital at his own risk and study him. An unusual relationship is formed between the two men, which starts to endanger the doctor's career, his marriage and even the patient himself.",
  "plot": "A young Roy Hobbs plays baseball with his father on the family farm. Roy's father dies suddenly under a tree. That tree is split in half by lightning, and Roy carves a baseball bat from it. He burns a lightning bolt on the barrel and calls it Wonderboy.\n\nIn 1923, Hobbs, now 19 years old, is trying out for the Chicago Cubs as a pitcher. At a carnival, Hobbs is challenged to strike out \"The Whammer\", the top hitter in the Majors. Sportswriter Max Mercy, traveling with Whammer, draws a picture of the event.\n\nHobbs also encounters Harriet Bird, an alluring woman, who becomes smitten with him after he strikes out Whammer. Bird lures Hobbs to her hotel room and shoots him before she commits suicide. It is revealed that Bird kills rising athletes, having already murdered two others.\n\nSixteen years later, the New York Knights sign the now 35-year-old Hobbs, frustrating the team's manager and co-owner, Pop Fisher. With the Knights mired in last place, Pop is angry over being saddled with a \"middle-aged\" rookie.\n\nDuring the next game, \"Bump\" Bailey's careless playing results in Hobbs becoming a pinch hitter. Hobbs literally knocks the cover off the baseball, winning the game. When Bump later dies after crashing through an outfield fence, Hobbs becomes the league's sensation, turning the Knights' fortunes around.\n\nHobbs' success prompts Mercy to try to unearth Hobbs' background. Later, Hobbs is summoned to a meeting with the principal owner of the team, The Judge. The Judge has an agreement with Pop that if the Knights fail to win the pennant at the end of the season, Pop's share of the team reverts to the Judge. To ensure the team loses, the Judge had a scout stock the roster with unknown players like Hobbs.\n\nWhen Hobbs refuses a bribe to throw the season, gambler Gus Sands and the Judge sends Memo Paris, Pop's niece and Bump's former girlfriend, to trick Hobbs. Mercy finally remembers where he had seen Hobbs before. Later, Mercy introduces Hobbs to Gus and Memo. Pop warns Hobbs that Memo is \"bad luck,\" but they begin a relationship and Hobbs soon falls into a playing slump.\n\nAt Wrigley Field in Chicago, Hobbs comes to bat. A woman dressed in white rises in the stands, and Hobbs, seeing her, promptly hits a game-winning home run. The woman is his childhood sweetheart, Iris. They meet later and Hobbs confides to her about the shooting and how he lost his way in life. Iris tells him she has a 16-year-old son and says the boy's father lives in New York.\n\nWith Hobbs hitting again, the Knights surge into first place, needing just one more win to clinch the pennant. Hobbs again refuses a payoff from Gus to throw the game. During a party at Memo's, Hobbs collapses and awakens in a hospital a few days later. Without Hobbs, the Knights have lost their last three games, setting up a one-game playoff against the Pittsburgh Pirates for the pennant. The doctor informs Hobbs that his stomach lining has been deteriorating due to his old gunshot injury. If he continues to play, the physical strain could kill him.\n\nMemo encourages Hobbs to accept Gus' payoff, and The Judge later increases the amount. Hobbs refuses, but the Judge has a contingency plan, having bribed another key team member. Hobbs later tells Iris that he feels responsible for failing to achieve his full potential, but she insists he is a great player. Before the final game, Pop tells Hobbs that he is the best hitter he ever saw. Hobbs realizes during the game that the Knights' starting pitcher, Fowler, is the player the Judge bribed. Hobbs confronts him on the mound, warning him not to throw the game. Fowler replies he will start pitching when Hobbs starts hitting. Iris, in the stands with her son, asks an usher to deliver a message to Hobbs saying she and her son are at the game and that Hobbs is the boy's father. Shocked, Hobbs peers out from the dugout but cannot see them.\n\nThe Knights are trailing and Hobbs comes up to bat. The Pirates bring in a young, hard-throwing, left-handed pitcher who sees that Hobbs is affected by his old injury. Down to his last strike, Hobbs hits a foul ball so hard it splits \"Wonderboy\" in two, shaking his confidence. Bobby, the bat boy, brings Hobbs the \"Savoy Special,\" the bat that Hobbs helped Bobby make. Hobbs hits the next pitch into the overhead lights, winning the pennant.\n\nSome time later, Hobbs plays catch with his son on Iris' farm, as she looks on.",
  "synopsis": null
}