{
  "imdb_id": "tt5735804",
  "tmdb_id": "398626",
  "douban_id": null,
  "title": "Peshmerga (2016)",
  "genres": [
    "Documentary",
    "War"
  ],
  "country": "France",
  "version": [
    {
      "runtime": "92 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.3,
  "director": [
    {
      "id": "nm0529717",
      "name": "Bernard-Henri Lévy"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm0529717",
      "name": "Bernard-Henri Lévy",
      "character": ""
    }
  ],
  "overview": "From July to December 2015, with a camera team in tow, Bernard-Henri Lévy journeyed 1,000 km along the frontline separating Iraqi Kurdistan from Islamic State troops. The journey resulted in an illustrated logbook offering a special insight into an unfinished war with a global impact. Alongside the Peshmergas – Kurdish fighters imbued with a spirit of unfailing determination in their fight against obscurantism and jihadism, the film takes us from the heights of Mosul to the heart of the Sinjar mountains, passing the last Christian monasteries threatened with destruction along the way. A tale peopled by real characters, men and women whose faces are rarely seen...",
  "storyline": "From July to December 2015, Bernard-Henri Lévy and a team of cameramen travelled the 1000 kilometres of the frontline that separates Iraqi Kurdistan from Daesh's troupes. From this journey, comes a logbook in images that offers a privileged view of a war that is unfinished but whose stakes are of global importance. In close quarters with the Peshmergas, these Kurdish fighters who show unfailing determination in their fight against obscurantism and jihadi fundamentalism, the film takes us from the heights of Mosul to the heart of the Sinjar Mountains passing on the way via the last Christian monasteries threatened with destruction. Many remarkable characters make their mark on this account, men and women of an ilk one rarely encounters.",
  "plot": null,
  "synopsis": null
}