{
  "imdb_id": "tt5788528",
  "tmdb_id": "418694",
  "douban_id": null,
  "title": "On the Map (2016)",
  "genres": [
    "Documentary",
    "Sport"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "85 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm1836981",
      "name": "Dani Menkin"
    }
  ],
  "writer": [
    {
      "id": "nm1836981",
      "name": "Dani Menkin",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3800697",
      "name": "Tal Brody",
      "character": "Himself"
    },
    {
      "id": "nm0827668",
      "name": "David Stern",
      "character": "Himself"
    },
    {
      "id": "nm0910476",
      "name": "Bill Walton",
      "character": "Himself"
    }
  ],
  "overview": "\"On The Map\" tells the story of '77 team, the one that brought the first European Cup to Israel and became \"The Team of the Nation\" Still demoralized after the 1973 Yom Kippur War, Israel was hungry for a collective uplifting event. \"On The Map\", a fast-moving, emotional and awe-inspiring documentary, recounts the story of how one Tel Aviv team no one thought could win toppled the four-time defending European Champions and put Israel firmly on the map. Featuring interviews with the Jewish American athletes who made history, \"On the Map\" combines the pulsepounding action of a high-stakes game with an incendiary political situation at the height of the Cold War to deliver a film that honors Israeli heroes, mesmerizes fans of the game and captures the spirit of a nation triumphant and victorious against all odds.",
  "storyline": "ON THE MAP tells the against-all-odds story of Maccabi Tel Aviv's 1977 European Championship, which took place at a time when the Middle East was still reeling from the 1973 Yom Kippur War, the 1972 Olympic massacre at Munich, and the 1976 hijacking of an Air France flight from Tel Aviv. Through the of lens of sports, ON THE MAP presents a much broader story of how one team captured the heart of a nation amid domestic turmoil and the global machinations of the Cold War.",
  "plot": null,
  "synopsis": null
}