{
  "imdb_id": "tt5792702",
  "tmdb_id": "411237",
  "douban_id": null,
  "title": "Curse of the Man Who Sees UFOs (2016)",
  "genres": [
    "Documentary",
    "Comedy",
    "Mystery",
    "Sci-Fi"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "92 min",
      "description": ""
    }
  ],
  "imdb_rating": 9.0,
  "director": [
    {
      "id": "nm3621252",
      "name": "Justin Gaar"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm7320981",
      "name": "Christo Roppolo",
      "character": ""
    },
    {
      "id": "nm8203464",
      "name": "Dennis Deakin",
      "character": ""
    },
    {
      "id": "nm8203466",
      "name": "Laurence Cefalu",
      "character": ""
    },
    {
      "id": "nm8203467",
      "name": "Steve Cefalu",
      "character": ""
    },
    {
      "id": "nm8203468",
      "name": "Jim Culcasi",
      "character": ""
    },
    {
      "id": "nm8203465",
      "name": "Gregg Maldanado",
      "character": ""
    },
    {
      "id": "nm8490197",
      "name": "Dennis Deakin",
      "character": ""
    },
    {
      "id": "nm8203470",
      "name": "Franz Fernandez",
      "character": ""
    },
    {
      "id": "nm8490195",
      "name": "Gregg Maldanado",
      "character": ""
    },
    {
      "id": "nm8203469",
      "name": "Lidia Plascencia",
      "character": ""
    }
  ],
  "overview": "Christo Roppolo claims to have been videotaping and communicating with UFOs around Monterey, CA for several years. He contacted filmmaker, Justin Gaar, in 2013 to begin creating a film about his sightings. Skeptical of the footage but intrigued by Christo's eccentricities and wild stories, Justin begins spending time with Christo hunting UFOs along California's beautiful central coast. When a crop circle appears in Monterey County and becomes international news, Christo is validated in his belief of alien contact and Justin, shocked, begins investigating the source of the crop circle and how Christo knows beyond a doubt that he's being contacted by his \"brother's from space.\"",
  "storyline": "Christo Roppolo claims to have been videotaping and communicating with UFOs around Monterey, CA for several years. He contacted filmmaker Justin Gaar in 2013 to begin creating a film about his sightings. Skeptical of the footage but intrigued by Christo's eccentricities and wild stories, Justin begins spending time with Christo hunting UFOs along California's beautiful central coast. When a crop circle appears in Monterey County and becomes international news, Christo is validated in his belief of alien contact and Justin, shocked, begins investigating the source of the crop circle and how Christo knows beyond a shadow of a doubt that he's being contacted by his 'brother's from space'. The two travel up and down the central coast and through the central valley hunting for UFO activity. Christo is like a traveling UFO preacher, explaining the sightings to passersby, asking about their own experiences with the unknown, spreading his gospel of extraterrestrial salvation. In their journey...",
  "plot": null,
  "synopsis": null
}