{
  "imdb_id": "tt5776736",
  "tmdb_id": "412338",
  "douban_id": null,
  "title": "Loki 7 (2016)",
  "genres": [
    "Action",
    "Comedy",
    "Crime",
    "Drama",
    "Thriller"
  ],
  "country": "Dominican Republic",
  "version": [
    {
      "runtime": "101 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.8,
  "director": [
    {
      "id": "nm2560748",
      "name": "Ernesto Alemany"
    }
  ],
  "writer": [
    {
      "id": "nm3142090",
      "name": "Isaac Saviñón",
      "description": null
    },
    {
      "id": "nm5327711",
      "name": "Miguel Yarull",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm3142090",
      "name": "Isaac Saviñón",
      "character": "Alvaro Romero"
    },
    {
      "id": "nm1741883",
      "name": "José Guillermo Cortines",
      "character": "Pietro Francesco"
    },
    {
      "id": "nm1867915",
      "name": "David Chocarro",
      "character": "Sebastian Buenanio"
    },
    {
      "id": "nm1525011",
      "name": "Shalim Ortiz",
      "character": "Alex Rivera"
    },
    {
      "id": "nm1968110",
      "name": "Carlos de la Mota",
      "character": "Dimitri Ivanov"
    },
    {
      "id": "nm6029605",
      "name": "Héctor Aníbal",
      "character": "Winston 'El Toro' Espin       (as Héctor Aníbal Estrella)"
    },
    {
      "id": "nm1914766",
      "name": "Marco de Paula",
      "character": "Mario Canovas"
    },
    {
      "id": "nm8074617",
      "name": "Carlos Forero",
      "character": "Juan Esteban Jaramillo"
    },
    {
      "id": "nm1101708",
      "name": "Julián Gil",
      "character": "Rodrigo"
    },
    {
      "id": "nm8188886",
      "name": "Soni Hill",
      "character": "Eva"
    },
    {
      "id": "nm7466544",
      "name": "Erick Hsu",
      "character": "Tsu       (as Tung Chi Hsu)"
    },
    {
      "id": "nm2696907",
      "name": "Jean Jean",
      "character": "La Yarda"
    },
    {
      "id": "nm8188885",
      "name": "Uxio Lis",
      "character": "Andrei 'El Ruso'"
    },
    {
      "id": "nm1966417",
      "name": "Cynthia Olavarría",
      "character": "Candy"
    },
    {
      "id": "nm3080200",
      "name": "Salvador Perez Martinez",
      "character": "Anunciador"
    },
    {
      "id": "nm0673563",
      "name": "Manny Perez",
      "character": "El Moncho"
    },
    {
      "id": "nm1747967",
      "name": "Enrique Quailey",
      "character": "Wilson"
    },
    {
      "id": "nm2975663",
      "name": "Elvira Taveras",
      "character": "Norma"
    },
    {
      "id": "nm8188887",
      "name": "Stephan Weinzierl",
      "character": "Hans 'El Aleman'"
    },
    {
      "id": "nm1388067",
      "name": "Natasha Yarovenko",
      "character": "Ivanna"
    }
  ],
  "overview": "Álvaro and his friends try to scam a Dominican crime lord in order to pay off a debt to a Russian mobster.",
  "storyline": "Alvaro and his friends try to scam a Dominican crime lord in order to pay off a debt to a Russian mobster.",
  "plot": "Eons ago, Bor, father of Odin, clashes with the Dark Elf Malekith, who seeks to unleash a weapon known as the Aether on the nine realms. After conquering Malekith's forces, including enhanced warriors called the Kursed, on their home world of Svartalfheim, Bor safeguards the Aether within a stone column. Unbeknownst to Bor, Malekith, his lieutenant Algrim, and a handful of Dark Elves escape into suspended animation.\n\nIn present-day Asgard, Loki stands imprisoned for his war crimes on Earth.1 Meanwhile, Thor, alongside warriors Fandral, Volstagg, and Sif, repel marauders on Vanaheim, home of their comrade Hogun; it is the final battle in a war to pacify the Nine Realms following the reconstruction of the Bifröst, the \"Rainbow Bridge\" between realms, which had been destroyed two years earlier.2 The Asgardians soon learn that the Convergence, a rare alignment of the Nine Realms, is imminent; as the event approaches, portals linking the worlds appear at random.\n\nIn London, astrophysicist Dr. Jane Foster and her intern Darcy Lewis travel to an abandoned factory where such portals have appeared, disrupting the laws of physics around them. Separating from the group, Jane is teleported to another world, where she is infected by the Aether. Heimdall alerts Thor that Jane has moved beyond his near all-seeing vision, leading Thor to Earth. When Thor finds Jane, she inadvertently releases an unearthly force, and Thor returns with her to Asgard. Odin, recognizing the Aether, warns that the Aether will not only kill Jane, but that its return heralds a catastrophic prophecy.\n\nMalekith, awakened by the Aether's release, turns Algrim into a Kursed and attacks Asgard. During the battle, Malekith and Algrim search for Jane, sensing that she contains the Aether. Thor's mother Frigga is killed protecting Jane, and Malekith and Algrim are forced to flee without Jane. Despite Odin's orders not to leave Asgard, Thor reluctantly enlists the help of Loki, who knows of a secret portal to Svartalfheim, where they will use Jane to lure and confront Malekith, away from Asgard. In return, Thor promises Loki vengeance on Malekith for killing their mother. With Volstagg and Sif stalling Asgardian soldiers and Fandral assisting their escape, Thor, Loki, and Jane head to Svartalfheim.\n\nThere, Loki tricks Malekith into drawing the Aether out of Jane, but Thor's attempt to destroy the exposed substance fails. Malekith merges with the Aether and leaves in his ship as Loki is fatally wounded while killing Algrim. Thor, cradling Loki in his arms, promises to tell their father of his sacrifice. Afterwards, Thor and Jane discover another portal in a nearby cave and reunite in London with Darcy and Jane's mentor Dr. Erik Selvig — who was briefly institutionalized due to the mental trauma he suffered during Loki's attack on Earth. They learn that Malekith plans to restore the Dark Elves to dominance by unleashing the Aether at the center of the Convergence in Greenwich. Thor battles Malekith through various portals and across multiple worlds until one portal separates them, leaving Malekith unopposed on Earth. Thor returns in time to help his mortal comrades use their scientific equipment to transport Malekith to Svartalfheim, where he is crushed by his own damaged ship.\n\nThor returns to Asgard, where he declines Odin's offer to take the throne and tells Odin of Loki's sacrifice. As he leaves, Odin's form transforms into Loki, who is alive and impersonating Odin.\n\nIn a mid-credits scene, Volstagg and Sif visit the Collector and entrust the Aether to his care, commenting that with the Tesseract already in Asgard, having two Infinity Stones so close together would be unwise. As they leave, the Collector remarks, \"One down, five to go.\" In a post-credits scene, Jane and Thor reunite on Earth while somewhere in London a frost monster from Jotunheim, accidentally transported to Earth during the final battle, continues to run amok.",
  "synopsis": null
}