{
  "imdb_id": "tt5713232",
  "tmdb_id": "397365",
  "douban_id": "26830254",
  "title": "Madaari (2016)",
  "genres": [
    "Adventure",
    "Drama",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "133 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.7,
  "director": [
    {
      "id": "nm1723225",
      "name": "Nishikant Kamat"
    }
  ],
  "writer": [
    {
      "id": "nm7917740",
      "name": "Shailja Kejriwal",
      "description": "story"
    },
    {
      "id": "nm1937760",
      "name": "Ritesh Shah",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm0451234",
      "name": "Irrfan Khan",
      "character": "Nirmal Kumar"
    },
    {
      "id": "nm0792116",
      "name": "Jimmy Sheirgill",
      "character": "Nachiket Verma       (as Jimmy Shergill)"
    },
    {
      "id": "nm5092260",
      "name": "Vishesh Bansal",
      "character": "Rohan Goswami"
    },
    {
      "id": "nm1189040",
      "name": "Tushar Dalvi",
      "character": "Prashant Goswami"
    },
    {
      "id": "nm2439674",
      "name": "Nitish Pandey",
      "character": "Sanjay Jagtap"
    },
    {
      "id": "nm8325539",
      "name": "Kedar Bagaria",
      "character": "Apurva Kumar"
    },
    {
      "id": "nm3438304",
      "name": "Manoj Bakshi",
      "character": "Govind Bakshi"
    },
    {
      "id": "nm8325535",
      "name": "Sunil Bedi",
      "character": "Shivender Singh"
    },
    {
      "id": "nm3464047",
      "name": "Rajat Bhalla",
      "character": "Political Aide"
    },
    {
      "id": "nm5264628",
      "name": "Satyajit Bhattacharya",
      "character": "Abhay Sahani"
    },
    {
      "id": "nm7555766",
      "name": "Akash Dabas",
      "character": "Nachiket's assistant"
    },
    {
      "id": "nm9865122",
      "name": "Rahul Dhir",
      "character": "Goon"
    },
    {
      "id": "nm2656417",
      "name": "Jitendra Gupta",
      "character": "Home Secretary"
    },
    {
      "id": "nm0348491",
      "name": "Rajiv Gupta",
      "character": "Mr. Bansal"
    },
    {
      "id": "nm8325536",
      "name": "Vikas Jain",
      "character": "Cop at the bus stand"
    },
    {
      "id": "nm5810735",
      "name": "Sadhil Kapoor",
      "character": "Cheeku"
    },
    {
      "id": "nm10584860",
      "name": "Vijay Kaushik",
      "character": ""
    },
    {
      "id": "nm2510776",
      "name": "Sabir Khan",
      "character": "Jogi"
    },
    {
      "id": "nm7555795",
      "name": "Ravi Mahasabde",
      "character": "Nachiket's assistant"
    },
    {
      "id": "nm4533476",
      "name": "Pallavi Mishra",
      "character": "Wadia's Wife"
    },
    {
      "id": "nm2414088",
      "name": "Purva Parag",
      "character": "Nirmal's Wife"
    },
    {
      "id": "nm3237860",
      "name": "Sachin Pathak",
      "character": "Lodge Receptionist"
    },
    {
      "id": "nm8325537",
      "name": "Manish Raj",
      "character": "Cop at the bus stand"
    },
    {
      "id": "nm8193151",
      "name": "Dr. Vivek Rajpal",
      "character": "Prime Minister"
    },
    {
      "id": "nm2217498",
      "name": "Ayesha Raza",
      "character": "Goswami's Wife"
    },
    {
      "id": "nm8325538",
      "name": "Sanjeev Sahay",
      "character": "Opposition Leader"
    },
    {
      "id": "nm8325534",
      "name": "Umesh Shrivastav",
      "character": "NIA chief Raghuvaran"
    },
    {
      "id": "nm2711559",
      "name": "Deepak Shroff",
      "character": "Fareed Wadia"
    },
    {
      "id": "nm1789346",
      "name": "Gurvinder Singh",
      "character": "Army Officer"
    },
    {
      "id": "nm5514899",
      "name": "Vikrant Singh",
      "character": "Barber"
    },
    {
      "id": "nm7555789",
      "name": "Chandraprakash Thakur",
      "character": "Structural Engineer"
    }
  ],
  "overview": "Nirmal loses his family in a man-made disaster, he starts the journey of seeking answers asking for accountability which leads him to a deadly path. The journey brings out the extraordinaire out of an ordinary man.",
  "storyline": "'Madaari' is the story of a common man who sets out to avenge the death of his son caused by rampant corruption in the government. Losing the only family he had brings him to kidnap the home minister's son and bring those responsible to justice.",
  "plot": null,
  "synopsis": "A 10 year old child, Rohan, is kidnapped from his hostel. Rohan is the only son of the Home Minister. The army and the CBI storm into action. CBI officer Nachiket Verma (Jimmy Sheirgill) heads the case and gets restrain order from all the other security agencies to make sure that the kidnappers don't panic and kill Rohan. Initially the case is thought of mistaken identity wherein the kidnapper might have tried to kidnap the friend of Rohan, Cheeku who was also drugged while kidnapping.For a long time there is silence from the kidnapper and everyone is left guessing as who it might be and at the same time the investigation is kept extremely secret, so as to keep the kidnapper(s) from killing Rohan. Behind the scenes the security agencies try to find the location of the kidnapper without raising any kind of suspicion. Rohan is actually kidnapped by Nirmal (Irrfan Khan) after drugging him. Rohan shows his anger towards Nirmal for kidnapping him. Nirmal shows Rohan a pre-recorded video of his friend Cheeku who is in a drugged state struggling with fear. Nirmal tells Rohan that Cheeku will be killed if he refuses to co-operate with him. Nirmal keeps traveling via public transport to evade his location.One day, the kidnapper call the father of Cheeku to convey a message to the Home Minister that the kidnapper has kidnapped the son of the Home Minister on purpose. His demand is that he wants his son, who was lost in an act of negligence by the government, be found. It is then revealed that Nirmal had a happy family with his son, Apu (short for Apurva), after his wife left them. Apu died when a bridge collapsed on him on his way to school. Moved and depressed by his loss, Nirmal decided to seek revenge from the politicians and others responsible for the death of his son.The news becomes a hot item in the media. Towards the end, Nirmal travels back to his house in Mumbai with Rohan, and calls a TV news channel from there and demands all those who were involved in the bridge collapse, including the Home Minister, come to his house, threatening to kill Rohan and himself if they don't. He makes the bridge contractor, the Home Minister, whose name appears in the initial scenes of the movie as Gilani (stated in a newspaper headline), and the ruling party's money man (Pratap Nimbalkar), confess their corrupt activities on a live broadcast on TV. Rohan indicates he understands why Nirmal did what he did and Rohan and Nirmal hug before Rohan leaves with his father. Nirmal surrenders to the police and is later seen immersing the articles his son was wearing when he died, in sea while being under the custody of the police."
}