{
  "imdb_id": "tt5787348",
  "tmdb_id": "406837",
  "douban_id": null,
  "title": "Epen Cupen the Movie (2015)",
  "genres": [
    "Comedy"
  ],
  "country": "Indonesia",
  "version": [
    {
      "runtime": "91 min",
      "description": "original"
    }
  ],
  "imdb_rating": 5.2,
  "director": [
    {
      "id": "nm8405448",
      "name": "Irham Acho Bahtiar"
    }
  ],
  "writer": [
    {
      "id": "nm8405448",
      "name": "Irham Acho Bahtiar",
      "description": "writer"
    }
  ],
  "cast": [
    {
      "id": "nm8198765",
      "name": "Abdur Arsyad",
      "character": ""
    },
    {
      "id": "nm8198763",
      "name": "Nato Beko",
      "character": ""
    },
    {
      "id": "nm6669031",
      "name": "Babe Cabita",
      "character": "Babe"
    },
    {
      "id": "nm8198762",
      "name": "Klemen Awi Celo",
      "character": "Celo"
    },
    {
      "id": "nm3139179",
      "name": "Deddy Mahendra Desta",
      "character": ""
    },
    {
      "id": "nm7609200",
      "name": "Fico Fachriza",
      "character": ""
    },
    {
      "id": "nm2679703",
      "name": "Pierre Gruno",
      "character": ""
    },
    {
      "id": "nm2663399",
      "name": "Edward Gunawan",
      "character": ""
    },
    {
      "id": "nm3001140",
      "name": "Marissa Nasution",
      "character": ""
    },
    {
      "id": "nm8198764",
      "name": "Temon Rarameha",
      "character": ""
    },
    {
      "id": "nm1831169",
      "name": "Uus",
      "character": ""
    }
  ],
  "overview": "Celo a young man from Papua, prompting his father to go look for the lost twin brother since childhood. Celo set off by following the instructions of the dream of his father who saw his twin brother were in the battlefield.  On arrival in the city of Jayapura, accidentally Celo met with Babe, a bankrupt businessman from Medan and asking him to look where the battlefield was. Babe involved a lot of debt just makes the problem Celo grow complicated. They were chased by debt collectors and hid in airport cargo warehouse, they unknowingly carried by air to Jakarta.  In Jakarta, Celo and Babe involved a lot of new problems, especially when they pursued Nato Beko, gangs are again fighting dragons estate owned by William Male deer gang.  Celo honest apart must find his twin brother, he was involved in the conflict between urban gangs, while Babe cunning also continue to utilize the cello to get his wish.",
  "storyline": "Celo a young man from Papua, prompting his father to go look for the lost twin brother since childhood. Celo set off by following the instructions of the dream of his father who saw his twin brother were in the battlefield. On arrival in the city of Jayapura, accidentally Celo met with Babe, a bankrupt businessman from Medan and asking him to look where the battlefield was. Babe involved a lot of debt just makes the problem Celo grow complicated. They were chased by debt collectors and hid in airport cargo warehouse, they unknowingly carried by air to Jakarta. In Jakarta, Celo and Babe involved a lot of new problems, especially when they pursued Nato Beko, gangs are again fighting dragons estate owned by William Male deer gang. Celo honest apart must find his twin brother, he was involved in the conflict between urban gangs, while Babe cunning also continue to utilize the cello to get his wish.",
  "plot": null,
  "synopsis": null
}