{
  "imdb_id": "tt5712246",
  "tmdb_id": "422237",
  "douban_id": null,
  "title": "Paththini (2016)",
  "genres": [
    "History",
    "Romance"
  ],
  "country": "Sri Lanka",
  "version": [],
  "imdb_rating": 8.1,
  "director": [
    {
      "id": "nm1414912",
      "name": "Sunil Ariyaratne"
    }
  ],
  "writer": [
    {
      "id": "nm1414912",
      "name": "Sunil Ariyaratne",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm5324158",
      "name": "Uddika Premarathna",
      "character": "Kovalan"
    },
    {
      "id": "nm3079741",
      "name": "Aruni Rajapaksha",
      "character": "Madhavi"
    },
    {
      "id": "nm2661079",
      "name": "Pooja Umashankar",
      "character": "Kannagi"
    },
    {
      "id": "nm5824855",
      "name": "Ama Wijesekara",
      "character": "Vasanthimala"
    }
  ],
  "overview": "Kannagi (Pooja) born in the Chola kingdom, one of the three kingdoms in South India around 1,500 years ago, is happily married to Kovalan (Uddika), a millionaire. Kovalan attends the crowning ceremony of the Chola dancing queen, Princess Madhavi (Aruni). Pleased with he performance the king wants Madhavi to indicate whom she would pick to become her husband from among the wealthy male guests present. She selects Kovalan. Spellbound by Madhavi's beauty and her dancing skills, Kovalan too likes Madhavi. The happy marriage crashes. Kovalan spends all his wealth on Madhavi. Broken-hearted, the weeping Kannagi bears up the agony.",
  "storyline": "Kannagi (Pooja) born in the Chola kingdom, one of the three kingdoms in South India around 1,500 years ago, is happily married to Kovalan (Uddika), a millionaire. Kovalan attends the crowning ceremony of the Chola dancing queen, Princess Madhavi (Aruni). Pleased with he performance the king wants Madhavi to indicate whom she would pick to become her husband from among the wealthy male guests present. She selects Kovalan. Spellbound by Madhavi's beauty and her dancing skills, Kovalan too likes Madhavi. The happy marriage crashes. Kovalan spends all his wealth on Madhavi. Broken-hearted, the weeping Kannagi bears up the agony. She resists overtures by young men and lives a solitary life maintaining her chastity. Being a professional dancer, Madhavi has to perform whenever important personalities visit her. Kovalan is irritated by her behaviour and this leads to constant arguments. How does the love triangle between Kovalan, Kannagi and Madhavi end..? How does Kannagi who aspires for ...",
  "plot": null,
  "synopsis": null
}