{
  "imdb_id": "tt5735582",
  "tmdb_id": "403032",
  "douban_id": null,
  "title": "The Tenants Downstairs (2016)",
  "genres": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "country": "Taiwan",
  "version": [
    {
      "runtime": "110 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.2,
  "director": [
    {
      "id": "nm5679377",
      "name": "Adam Tsuei"
    }
  ],
  "writer": [
    {
      "id": "nm3321182",
      "name": "Giddens Ko",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0945189",
      "name": "Simon Yam",
      "character": "The Landlord /              Chang Jiajun"
    },
    {
      "id": "nm7608976",
      "name": "Yu-Wei Shao",
      "character": "Yingru"
    },
    {
      "id": "nm7096497",
      "name": "Xing Li",
      "character": "Miss Chen"
    },
    {
      "id": "nm0497642",
      "name": "Kang-sheng Lee",
      "character": "Guo Li"
    },
    {
      "id": "nm4949493",
      "name": "Kai Fung",
      "character": "Detective"
    },
    {
      "id": "nm4752065",
      "name": "Kaiser Chuang",
      "character": "Mr. Chang"
    },
    {
      "id": "nm0948185",
      "name": "An-Shun Yu",
      "character": "Mr. Wang"
    },
    {
      "id": "nm3561863",
      "name": "Yan-xi Hou",
      "character": "Boyan       (as Phil Yan)"
    },
    {
      "id": "nm8850067",
      "name": "Bernard Senjun",
      "character": "Linghu"
    },
    {
      "id": "nm6668000",
      "name": "Angel Ho",
      "character": "Mr. Wang's daughter"
    },
    {
      "id": "nm2119124",
      "name": "Akio Chen",
      "character": "Huang Silang /              Rich old man       (as Mu-Yi Chen)"
    },
    {
      "id": "nm7262427",
      "name": "Kurt Chou",
      "character": "Yingru's first victim /              Nurse"
    },
    {
      "id": "nm4918457",
      "name": "Shih-Mei Tu",
      "character": "Aphrodisiac saleswoman /              Nurse"
    },
    {
      "id": "nm3117618",
      "name": "Toyoharu Kitamura",
      "character": "Miss Chen's boss"
    },
    {
      "id": "nm3206916",
      "name": "Meng-sheng Shen",
      "character": "Old man"
    },
    {
      "id": "nm8475903",
      "name": "Sean Lin",
      "character": "Miss Chen's selfish lover"
    },
    {
      "id": "nm5124819",
      "name": "Alex Shu-Yuan Ko",
      "character": "Chief Constable"
    },
    {
      "id": "nm0939038",
      "name": "Don Wong",
      "character": "Inspector Chen"
    },
    {
      "id": "nm0702672",
      "name": "Chiung-Tzu Chang",
      "character": "Inspector Chen's wife       (as Nora Chang)"
    },
    {
      "id": "nm3871004",
      "name": "Ryan Kuo",
      "character": "Police"
    },
    {
      "id": "nm7946703",
      "name": "Vera Chen",
      "character": "Relative /              Hospital patient"
    },
    {
      "id": "nm6207552",
      "name": "Michelle Chiang",
      "character": "Hospital administrator"
    },
    {
      "id": "nm8692415",
      "name": "Rose Chiu",
      "character": "Young Yingru"
    },
    {
      "id": "nm8396112",
      "name": "Hung Chou",
      "character": "Hospital patient"
    },
    {
      "id": "nm6692293",
      "name": "Chien-Tsang Hong",
      "character": "Relative /              Hospital patient"
    },
    {
      "id": "nm9247246",
      "name": "Yu-Ting Huang",
      "character": "Relative /              Hospital patient"
    },
    {
      "id": "nm6088521",
      "name": "Mei-Man Jin",
      "character": "Relative /              Hospital patient"
    },
    {
      "id": "nm8532771",
      "name": "Karolyn Kieke",
      "character": "Hospital patient"
    },
    {
      "id": "nm7932186",
      "name": "Yung-Kang Lee",
      "character": "Lawyer /              Hospital nurse"
    },
    {
      "id": "nm4651374",
      "name": "Sheng-Hua Li",
      "character": "Linghu's stand-in"
    },
    {
      "id": "nm5684100",
      "name": "Ambrose Liao",
      "character": "Hospital patient"
    },
    {
      "id": "nm8704049",
      "name": "Yu-Hsien Lin",
      "character": "Hospital patient"
    },
    {
      "id": "nm4687497",
      "name": "Wen-Hsueh Lu",
      "character": "Relative /              Hospital patient"
    },
    {
      "id": "nm4062902",
      "name": "Emerson Tsai",
      "character": "Supermarket seller"
    },
    {
      "id": "nm4614040",
      "name": "Yi-Chun Tung",
      "character": "Relative /              Hospital patient"
    },
    {
      "id": "nm1364791",
      "name": "Chih-xing Wen",
      "character": "Doctor /              Hospital patient       (as Chi-Shing Woon)"
    },
    {
      "id": "nm4940028",
      "name": "Chih-Hsiang Yu",
      "character": "Police officer"
    }
  ],
  "overview": "A lurid fantasy of wounded flesh and accursed lives that entwine and separate in a building run by a landlord (Simon Yam), who seeks to find a particular type of tenant for the property he inherits from his relatives. Driven by his desire of peeping into the darkest aspects of human nature, what he sees through the eyes of the omnipresent cameras ain’t pretty… but it gives him the wry, abject satisfaction of a dark god lording over and leering at the souls of the damned, his imagination hungering toward them.",
  "storyline": "A loafer inherits an apartment block and lets out the place to a group of tenants, including a lusty gymnastics teacher, a geeky college student, a single father with his young daughter, a gay couple, a writer and a sexy female office worker. An incredible story is about to unfold as they start their lives in the same building.",
  "plot": "A police interrogator questions a man inside an interrogation room. The man claims he inherited a building with studio apartments from a distant relative, so he became the landlord of the building, renting the apartments out to tenants. The Landlord's penthouse apartment is equipped with screens that allow the Landlord to see inside each apartment, which all have hidden cameras. His tenants include divorcee Mr. Wang Ming-kai and his fourth-grade daughter; Ms. Chen Min-hui, an office worker who uses her body for financial gain and advantages in the workplace; Mr. Chang Kuo-sheng, a physical education teacher who enjoys peeping on his neighbors and is infatuated with Ms. Chen; Bo-yan, a geeky college student obsessed with the idea of having superpowers; and a gay couple, Kuo Li and Ling Hu. The Landlord also claims that a mysterious woman named Ying-ru lives in the apartment directly under his penthouse; however, the police interrogator states that there is no record of anyone named Ying-ru having lived there.\n\nThe Landlord spies on his tenants closely, and figures out everyone's routine. However, he finds that Ying-ru has no discernible routine. He lets himself into Ying-ru's apartment to investigate while she is out, but Ying-ru returns unexpectedly, with a man. The Landlord hides, and watches as Ying-ru drugs the man with poisoned tea, then ties him up in the bathtub. However, the Landlord does not alert the authorities, and over the course of several days, Ying-ru tortures the man to death. A few days later, Ying-ru drags a bound woman back to her apartment in a suitcase, and also tortures her to death in her bathtub. The Landlord confronts Ying-ru, who says that she cannot accept a life without change or possibility. Therefore, she is determined to avoid a mundane life, and will shatter whatever boundaries are in her way. The Landlord takes her words to heart, and decides to shatter his tenants' routine lives.\n\nThe Landlord tricks Bo-yan into thinking he has teleportation powers, manipulates Kuo Li and Ling Hu into believing the other is being unfaithful, allows Mr. Chang to break into Ms. Chen's room and have sex with her, and adds an aphrodisiac to Mr. Wang's mosquito coil to give him lustful feelings towards his daughter. The Landlord's antics eventually result in the deaths of Mr. Wang and Ling Hu.\n\nThe police interrogator points out places where the Landlord's story does not match the facts. Ms. Chen is actually married to Mr. Wang; Kuo Li and Ling Hu are uncle and nephew, not lovers; Mr. Chang is a gay university professor and thus could not be infatuated with Ms. Chen; and Bo-yan is a model student and is not obsessed with superpowers.\n\nThe Landlord's interrogation is then interrupted by a police officer, who has found the Landlord's true identity. The Landlord used to be a police officer named Chang Chia-chun, and had participated in an investigation against Huang Si-lang, a man who had abducted and tortured schoolgirls to death—including Chang's daughter Chang Ying-ru. Huang had avoided serious punishment by claiming insanity. Chang had volunteered to go undercover in the asylum where Huang was being kept, in order to extract a confession, but Chang's superior officer died unexpectedly, which meant no one knew Chang was undercover in the asylum. Chang underwent forced treatments and tortures, which broke his mind. In the asylum, Huang gave Chang the keys to the building where he had killed the schoolgirls, including Chang's daughter, and then committed suicide. After Chang was released, he left the police force, went to the building, and began accepting tenants there. He also imagined his daughter Ying-ru as one of the tenants, and himself as Ying-ru, he tracked down the people who had forcibly treated him in the asylum, and tortured them to death one by one.",
  "synopsis": null
}