{
  "imdb_id": "tt5735464",
  "tmdb_id": "382220",
  "douban_id": null,
  "title": "Master (2016)",
  "genres": [
    "Action",
    "Crime"
  ],
  "country": "South Korea",
  "version": [
    {
      "runtime": "143 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.2,
  "director": [
    {
      "id": "nm1181534",
      "name": "Ui-seok Jo"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm0496932",
      "name": "Byung-Hun Lee",
      "character": "President Jin"
    },
    {
      "id": "nm1504868",
      "name": "Dong-won Gang",
      "character": "Kim Jae-Myung"
    },
    {
      "id": "nm5311765",
      "name": "Woo-Bin Kim",
      "character": "Park Jang-Goon"
    },
    {
      "id": "nm1392076",
      "name": "Ji-won Uhm",
      "character": "Shin Gemma"
    },
    {
      "id": "nm1367681",
      "name": "Dal-su Oh",
      "character": "Hwang Myung-Joon"
    },
    {
      "id": "nm3782167",
      "name": "Kyung Jin",
      "character": "Kim Eom-Ma"
    },
    {
      "id": "nm1040397",
      "name": "Won-joong Jung",
      "character": "Chief of National Police Agency"
    },
    {
      "id": "nm8784183",
      "name": "Lei Arellano",
      "character": "Bodyguard"
    },
    {
      "id": "nm6280477",
      "name": "Tom Bauer",
      "character": "Ahn Kyung-Nam       (voice)"
    },
    {
      "id": "nm5804925",
      "name": "Chris Hackney",
      "character": "Park Jang-Goon       (voice)"
    },
    {
      "id": "nm6448856",
      "name": "Ian Ignacio",
      "character": "Bodyguard"
    },
    {
      "id": "nm3513747",
      "name": "Bernard Laxa",
      "character": "Bodyguard"
    },
    {
      "id": "nm1302161",
      "name": "Diego Salvador",
      "character": "Bodyguard"
    }
  ],
  "overview": "An intellectual crime investigation team goes after company Won Network. The company is involved in a massive fraud case.  Kim Jae-Myung is the leader of intellectual crime investigation team. He is smart, charismatic, aggressive and bold to lead the intellectual crime investigation team.  President Jin is the president of Won Network. Park Jang-Goon is the Section Chief of Won Network. He is the brains behind Won Network.",
  "storyline": "JIN Hyun-pil heads up a multi-level marketing company called 'One Network Inc.' that has an extensive network covering all of Korea. The Intellectual Criminal Investigation's Chief, KIM Jae-myung, is on to Jin's company suspecting its deep and widespread connection to CEOs, politicians, and bureaucrats. Kim catches a break when he tracks down the company's IT architect and brain, PARK Jang-gun. Kim persuades Park to hand over information on Tech Hub and Jin's secret ledger, in exchange of a plea bargain. Park pretends to cooperate while making his own plans to turn in his boss and steal the company's huge secret fund. Jin gets wind of the police closing in on him. He closes off his scheme in Korea and stows away with his partner, hiring assassins to execute Park. Kim never gives up pursuing Jin but 6 months later, news about Jin's murder stirs the country once again.",
  "plot": "In this beautifully shot wuxia epic, a self taught highly skilled assassin swordsman is haunted by the destructive impact his deadly talents have and from the absence of a competent swords-person whom he can fight wanders around searching at the same time for a good location for his grave and lives the remaining of his life to the full as he is dying. The master swordsman, weary of the bloodshed and violence from the martial arts world and as a classically taught descendant of a legendary swordsman family, banishes himself to the humble life of a vagrant, wandering the fringes of society in search of real life and its simpleness absconding his will to fight. But his violent past refuses to let him go quietly. The master swordsman and the skilled assassin regain their ability to wield swords without hesitating to fight those disrupting the peace and to defeat those who desperately crave despotism. The master swordsman honors his dying ally, the assassin who sought for a worthy swordsman to fight and if fate allows to die honorably.",
  "synopsis": null
}