{
  "imdb_id": "tt5871184",
  "tmdb_id": "397366",
  "douban_id": null,
  "title": "Mobile Suit Gundam: The Origin III",
  "genres": [
    "Animation",
    "Action",
    "Drama",
    "Sci-Fi",
    "War"
  ],
  "country": "Japan",
  "version": [
    {
      "runtime": "68 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.9,
  "director": [
    {
      "id": "nm0408086",
      "name": "Takashi Imanishi"
    }
  ],
  "writer": [
    {
      "id": "nm0946654",
      "name": "Yoshikazu Yasuhiko",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0407454",
      "name": "Shûichi Ikeda",
      "character": "Char Aznable       (voice)"
    },
    {
      "id": "nm2132616",
      "name": "Tetsuya Kakihara",
      "character": "Garma Zabi       (voice)"
    },
    {
      "id": "nm2966078",
      "name": "Tomoaki Maeno",
      "character": "Lino Fernandez       (voice)"
    },
    {
      "id": "nm1959211",
      "name": "Jin Urayama",
      "character": "Degwin Sodo Zabi       (voice)"
    },
    {
      "id": "nm0319980",
      "name": "Banjô Ginga",
      "character": "Gihren Zabi       (voice)"
    },
    {
      "id": "nm1399925",
      "name": "Kenta Miyake",
      "character": "Dozle Zabi       (voice)"
    },
    {
      "id": "nm1337113",
      "name": "Akeno Watanabe",
      "character": "Kycillia Zabi       (voice)"
    },
    {
      "id": "nm0051761",
      "name": "Naoki Bando",
      "character": "Torenov Y. Minovsky       (voice)"
    },
    {
      "id": "nm4438173",
      "name": "Ai Kayano",
      "character": "Zenna Mia       (voice)"
    },
    {
      "id": "nm4751364",
      "name": "Megumi Han",
      "character": "Sayla Mass       (voice)"
    },
    {
      "id": "nm0756985",
      "name": "Kôichi Sakaguchi",
      "character": "Tem Ray       (voice)"
    },
    {
      "id": "nm0299228",
      "name": "Tôru Furuya",
      "character": "Amuro Ray       (voice)"
    },
    {
      "id": "nm0960033",
      "name": "Akio Ôtsuka",
      "character": "Narrator       (voice)"
    },
    {
      "id": "nm2837894",
      "name": "Robbie Daymond",
      "character": "Lino Fernandez       (voice)"
    },
    {
      "id": "nm0228356",
      "name": "Ben Diskin",
      "character": "Char Aznable (Real)       (voice)"
    },
    {
      "id": "nm2335252",
      "name": "Lucien Dodge",
      "character": "Amuro Ray       (voice)"
    },
    {
      "id": "nm0280230",
      "name": "Erin Fitzgerald",
      "character": "Zenna Mia       (voice)"
    },
    {
      "id": "nm0090464",
      "name": "Neil Kaplan",
      "character": "Dozle Zabi       (voice) (as Bob Johnson)"
    },
    {
      "id": "nm0292823",
      "name": "William Frederick Knight",
      "character": "Torenov Y. Minovsky       (voice) (as William Knight)"
    },
    {
      "id": "nm0283253",
      "name": "Wendee Lee",
      "character": "Kycilia Zabi       (voice)"
    },
    {
      "id": "nm1862473",
      "name": "Chris Niosi",
      "character": "Garma Zabi       (voice)"
    },
    {
      "id": "nm1240448",
      "name": "Liam O'Brien",
      "character": "Gihren Zabi       (voice)"
    },
    {
      "id": "nm0642601",
      "name": "Colleen O'Shaughnessey",
      "character": "Sayla Mass       (voice) (as Maggie O'Connor)"
    },
    {
      "id": "nm0643703",
      "name": "Joe Ochman",
      "character": "Tem Ray       (voice) (as B.J. Oakie)"
    },
    {
      "id": "nm0651184",
      "name": "Lisa Ortiz",
      "character": "Additional Voices       (voice)"
    },
    {
      "id": "nm1075459",
      "name": "Bill Rogers",
      "character": "Additional Voices       (voice)"
    },
    {
      "id": "nm1142722",
      "name": "Keith Silverstein",
      "character": "Char Aznable       (voice)"
    },
    {
      "id": "nm0860443",
      "name": "Marc Thompson",
      "character": "Degwin Sodo Zabi       (voice)"
    },
    {
      "id": "nm0861558",
      "name": "Kirk Thornton",
      "character": "Ramba Ral       (voice)"
    },
    {
      "id": "nm1720779",
      "name": "David Vincent",
      "character": "Miguel Gaia       (voice)"
    }
  ],
  "overview": "Universal Century 0074. Since leaving Texas Colony, Édouard Mass has camouflaged his identity and enrolled in the Autonomous Republic of Zeon's Space Defense Military Academy under the name of Char Aznable. He develops a friendship with his classmate Garma, a scion of the Zabi family. Gradually the two become admired by the other students.  Then, in Universal Century 0077, the young at last rise up in arms and begin the fight for independence against the Earth Federation's security forces. This rebellion, however, also marks the beginning of Char’s spectacular scenario of revenge…  Now, the gears of history are turning!",
  "storyline": "Universal Century 0074. After leaving Texas Colony, Édouard Mass camouflages his identity and enrolls in the Autonomous Republic of Zeon's Space Defense Military Academy under the name of Char Aznable. He develops a friendship with his classmate Garma, a scion of the Zabi family. Gradually the two become admired by the other students. Then, in Universal Century 0077, the students at last rise up in arms and begin the fight for independence against the Earth Federation's security forces. This rebellion, however, also marks the beginning of Char's spectacular scenario of revenge... Now, the gears of history are turning!",
  "plot": "See also: Mobile Suit Gundam §&#160;Plot\nThe plot of the manga follows somewhat closely the plot of the original series. It is the year Universal Century 0079, and the eighth month of a vicious war between the Earth Federation and a breakaway nation of space colonists, the Principality of Zeon. The story follows the crew of the warship White Base, as they fight to ferry the experimental RX-78-02 Gundam mobile suit to the Federation base at Jaburo.\n\nAlthough for the most part faithful to the original series' plot (all of the major events unfold in mostly the same manner as the TV series, though often in different locales), Yasuhiko has taken the liberty of changing certain elements in the series universe, giving a different character to the series and the struggle that unfolds. Primary among these is the presence of mobile suits in both sides well before the conflict begins—in fact, in the flashback sequences, both the Earth Federation Forces and Zeon use Guntanks in 0068, and they and the Guncannon mobile suit are described as \"obsolete\" and fit for target practice in the first volume (in the TV series proper, both the RX-75 and the RX-77 were as new as the RX-78 Gundam itself, designed to serve as long- and mid-range fire support units).\n\nOther differences concern the breadth of the Gundam's journey to Jaburo. Where it's implied that the White Base's journey to Jaburo in the series was pretty much a circumnavigation of the globe unconnected to many real-world locations, Yasuhiko's journey places the White Base's landfall near Los Angeles, the headquarters of Garma Zabi (in the series, Garma was based out of a generic \"New York\" — Origin in fact states the Zeon occupation HQ as Los Angeles City Hall, with Garma residing in Hollywood/Beverly Hills) and moves the craft steadily to the southeast, and down the South American coast—past Caracas, Venezuela and through Machu Picchu and into Brazil, where Jaburo, the headquarters of the Earth Federation, is located. This retelling cuts out some of the more trivial encounters seen in the original series, while keeping and expanding on important characters like Garma, Ramba Ral, and the Black Tri-Stars. As a direct result the events of Operation Odessa which takes place around the Ukrainian city of the same name, occur after the events of Jaburo, as opposed to the anime where they occur before.\n\nYasuhiko further finally tells the entire back story of the Gundam universe in the manga. After the successful defense of Jaburo, the story diverts into a very in-depth flashback, told primarily from the viewpoints of Sayla and Char (with a secondary thread being told from Amuro's POV) recounting the downfall of Zeon Zum Deikun, the rise of the Zabi family, the construction of Side 7 and the research into mobile suits, and leading up through a decade until the launching of the One Year War. It also goes into detail answering many previously unanswered questions such as the appearance of heretofore unseen Zeon mobile suits prior to the MS-05 Zaku I, how Dozle Zabi received his trademark scars and even the origin of Casval Deikun/Edward Mass' \"Char Aznable\" identity. Volume fourteen, deals with the Battle of Loum at the beginning of the One Year War, and is the last piece of the in-depth flashback.\n\nThe story shifted back on track to the original anime's storyline, featuring the White Base's involvement in the Federation's Operation Odessa, as well as including Kai Shiden's encounter with Miharu. Afterwards, the manga deals with the end of the Odessa campaign and (in another departure from the series) takes M'Quve and his Gyan out of the picture before he has a chance to confront the Gundam.",
  "synopsis": null
}