{
  "imdb_id": "tt5837046",
  "tmdb_id": "404828",
  "douban_id": null,
  "title": "Curiosity, Adventure & Love (2016)",
  "genres": [
    "Documentary"
  ],
  "country": "Philippines",
  "version": [
    {
      "runtime": "62 min",
      "description": ""
    }
  ],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm8244492",
      "name": "Sunshine Lichauco De Leon"
    },
    {
      "id": "nm1142532",
      "name": "Suzanne Richiardone"
    }
  ],
  "writer": [
    {
      "id": "nm8244492",
      "name": "Sunshine Lichauco De Leon",
      "description": null
    },
    {
      "id": "nm3576236",
      "name": "Justin Weinrich",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm7166892",
      "name": "Jessie Coe Lichauco",
      "character": "Herself"
    }
  ],
  "overview": "One woman’s journey through a century of love, war and discovery.  Curiosity, Adventure &amp; Love is a the story of a woman raised by fate to go boldly where few young women of her time and upbringing would go, into the arms of chance and life. A young American woman leaves her country and all security behind, to begin an adventure in the Philippines that would witness the birth of a nation, a cruel war and Occupation and reconstruction. Jessie is a striking personality, somewhere between Scarlett O’Hara and Amelia Earhart, who knew no boundaries and flew far ahead of her times, without regard to sex or society. Her story of a century well-lived is both rich and one that should restore our faith in our own humanity.",
  "storyline": "Curiosity, Adventure & Love is a the story of a woman raised by fate to go boldly where few young women of her time and upbringing would go, into the arms of chance and life. A young American woman leaves her country and all security behind, to begin an adventure in the Philippines that would witness the birth of a nation, a cruel war and Occupation and reconstruction. Jessie is a striking personality, somewhere between Scarlett O'Hara and Amelia Earhart, who knew no boundaries and flew far ahead of her times, without regard to sex or society. Her story of a century well-lived is both rich and one that should restore our faith in our own humanity.",
  "plot": null,
  "synopsis": "Curiosity, Adventure & Love weaves together 3 threads - the life of a 104-year-old American who journeys to the Philippines alone in the 1930s at age 18, the history of the country that she has witnessed and the insights and wisdom of a woman whose indomitable spirit has evoked inspiration for the thousands who have known her.Sitting alone in her 250-year old Spanish colonial home, Jessie Lichauco's poetic soul draws comfort from the ebb and flow of the river outside her window and protection from an ancient banyan tree while sharing stories with others of a life guided by fate, and where her innate sense of adventure, curiosity and compassion for others knows no boundaries.Jessie's husband Marcial Lichauco, whom she met while he was working for the Philippine colonial government lobbying for independence in Washington DC, was among the country's most prominent lawyers of that era and this allowed her a front row seat to witness the rebirth of a nation. In time, Jessie's conviction to help her fellow man in every way possible led her to be granted Philippine citizenship for her profound contributions to the Filipino people. Bridging the past, the present and future, it's an amazing journey of a century of humankind, of love and finding home, of the cruelty of war and deprivations of a hostile occupation, and the rebuilding of a nation while living a life that restores our faith in the power of our own humanity."
}