{
  "imdb_id": "tt5837818",
  "tmdb_id": "404927",
  "douban_id": null,
  "title": "Dalisay (2016)",
  "genres": [
    "Drama"
  ],
  "country": "Italy",
  "version": [],
  "imdb_rating": null,
  "director": [
    {
      "id": "nm8245154",
      "name": "Maurizio Baldini"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm8245155",
      "name": "Jana Leyva",
      "character": "Dalisay"
    },
    {
      "id": "nm2963158",
      "name": "Sue Prado",
      "character": "Nida"
    },
    {
      "id": "nm8275929",
      "name": "Red Ibasco",
      "character": "Anne"
    },
    {
      "id": "nm8275930",
      "name": "Acey Bryle",
      "character": "Lou"
    }
  ],
  "overview": "A young woman by the name of Dalisay, known as Daly, lives in a small hamlet in the Filipino countryside.  She’s an observant, smart and intelligent girl who through an unfortunate accident lost both her father and mother. Her older sister Anne works in a nearby city as a waitress in a restaurant. Her modest income allows for both of them to live sparingly. Every day Daly passes in front of the Sari Sari or general store owned by Nida, a woman that lives not far from her. Nida is an artist, and a solitary never-been-married artist. Daly, hungry for knowledge, often spends time with Nida, the older woman feeding the natural curiosity of the girl. Nida ultimately teaches Daly what higher love is and how the rhythm of nature affects each of our souls.",
  "storyline": "A young woman by the name of Dalisay, known as Daly, lives in a small hamlet in the Filipino countryside. She's an observant, smart and intelligent girl who through an unfortunate accident lost both her father and mother. Her older sister Anne works in a nearby city as a waitress in a restaurant. Her modest income allows for both of them to live sparingly. Every day Daly passes in front of the Sari Sari or general store owned by Nida, a woman that lives not far from her. Nida is an artist, and a solitary never-been-married artist. Daly, hungry for knowledge, often spends time with Nida, the older woman feeding the natural curiosity of the girl. Nida ultimately teaches Daly what higher love is and how the rhythm of nature affects each of our souls.",
  "plot": "The film opens with this quote:\n\nThe Fault... is Not in Our Stars,But in Ourselves...\n— William Shakespeare\nand announces that it wishes to highlight the virtues of psychoanalysis in banishing mental illness and restoring reason.\n\nDr. Constance Petersen (Ingrid Bergman) is a psychoanalyst at Green Manors, a mental hospital in Vermont. She is perceived by the other (male) doctors as detached and emotionless. The director of the hospital, Dr. Murchison (Leo G. Carroll), is being forced into retirement, shortly after returning from an absence due to nervous exhaustion. His replacement is Dr. Anthony Edwardes (Gregory Peck), who turns out to be surprisingly young.\n\nDr. Petersen notices that Dr. Edwardes has a peculiar phobia about sets of parallel lines against a white background. She also soon realizes, by comparing handwriting, that this man is an impostor. He confides to her that he killed Dr. Edwardes and took his place. He suffers from massive amnesia and does not know who he is. Dr. Petersen believes he is innocent and suffering from a guilt complex. He disappears overnight, leaving a note for her. At the same time, it becomes public knowledge that 'Dr. Edwardes' is an impostor, and that the real Dr. Edwardes is missing and may have been murdered.\nGregory Peck and Ingrid Bergman in Spellbound\nDr. Petersen manages to track him down, and starts to use her psychoanalytic training to break his amnesia and find out what really happened. Pursued by the police, Dr. Petersen and the impostor (calling himself 'John Brown') travel by train to Rochester, New York where they stay with Dr. Brulov (Michael Chekhov), Dr. Petersen's former mentor.\n\nThe two doctors analyze a dream that 'John Brown' had. The dream sequence (designed by Salvador Dalí) is full of psychoanalytic symbols – eyes, curtains, scissors, playing cards (some of them blank), a man with no face, a man falling off a building, a man hiding behind a chimney and dropping a wheel, and being pursued by large wings. They deduce that Brown and Edwardes had been on a ski trip together (the lines in white being ski tracks), and that Edwardes had somehow died there. Dr. Petersen and Brown go to the Gabriel Valley ski resort (the wings provide a clue), to reenact the event.\n\nNear the bottom of the hill, Brown's memory suddenly returns. He recalls that there is a precipice in front of them, over which Edwardes had fallen to his death. He stops them just in time. He also remembers a traumatic event from his childhood – he slid down a hand rail with his brother at the bottom, accidentally knocking him onto sharp-pointed railings, killing him. This incident had caused him to develop a guilt complex. He also remembers that his real name is John Ballantyne. All is understood now, and Ballantyne is about to be exonerated, when it is discovered that Edwardes had a bullet in his body. Ballantyne is convicted of murder and sent to prison.\n\nA heartbroken Dr. Petersen returns to her position at the hospital, where Dr. Murchison is once again the director. Murchison lets slip that he had known Edwardes slightly, and didn't like him, contradicting his earlier claims. Now suspicious, Dr. Petersen reconsiders her notes from the dream and realizes that the 'wheel' was a revolver, and that the man hiding behind the chimney and dropping the wheel, was Dr. Murchison who shot Edwardes, and then dropped the gun.\n\nPetersen confronts Murchison. He confesses, but explains that he still has the gun, and threatens to kill her. She walks away, the gun still pointed at her, explaining that while the first murder was committed under the extenuating circumstances of Dr. Murchison's fragile mental state, her murder would certainly lead him to the electric chair. He allows her to leave, then turns the gun on himself.\n\nDr. Petersen is reunited with Ballantyne. They honeymoon together from the same Grand Central Station where they first tried to pursue the mystery of his psychosis.",
  "synopsis": null
}