{
  "imdb_id": "tt5896674",
  "tmdb_id": "409069",
  "douban_id": null,
  "title": "The Fall (2016)",
  "genres": [
    "Documentary",
    "Sport"
  ],
  "country": "UK",
  "version": [
    {
      "runtime": "90 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.8,
  "director": [
    {
      "id": "nm1326085",
      "name": "Daniel Gordon"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm2115800",
      "name": "Zola Budd",
      "character": "Herself"
    },
    {
      "id": "nm9046311",
      "name": "Kyle Keiderling",
      "character": "Himself"
    },
    {
      "id": "nm1890229",
      "name": "Mary Decker Slaney",
      "character": "Herself"
    },
    {
      "id": "nm2950857",
      "name": "Richard Slaney",
      "character": "Himself"
    }
  ],
  "overview": "The Fall tells the remarkable story of a South African barefoot runner, an American track-and-field prodigy, and the events behind one of the most memorable moments in sporting history – the 1984 LA Olympics. The film charts two journeys, from rural South Africa under apartheid and the rolling hills of Southern California, to the starting line of the women’s 3,000 metres. It uncovers a tale of betrayal and exploitation, of the blurred lines between politics, media and sport, and of the dedication and sacrifice required to compete at the highest level. It’s a story that split governments and divided nations, but at its heart is a tale of two young women who, despite the turmoil in their lives, just wanted to run.",
  "storyline": "The story of Mary Decker and Zola Budd and their lives building up to the infamous 1984 Olympics 3000M race in which both of them collide.",
  "plot": "\"There is something achingly familiar about Daniel Grigori. Mysterious and aloof, he captures Luce Price's attention from the moment she sees him....\"\n\nLucinda \"Luce\" Price goes to Sword and Cross, a boarding in Savannah where she meets the mysterious Daniel Grigori. Luce is drawn to him in a way no words could describe, but he wants nothing to do with her. The deeper she dives into information about him, the more questions she has... it's a matter of time until she finds out Daniel's darkest secret that may have something to do with her.",
  "synopsis": null
}