{
  "imdb_id": "tt5915304",
  "tmdb_id": "408327",
  "douban_id": null,
  "title": "How to Be Yours (2016)",
  "genres": [
    "Romance"
  ],
  "country": "Philippines",
  "version": [
    {
      "runtime": "113 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.4,
  "director": [
    {
      "id": "nm2758967",
      "name": "Dan Villegas"
    }
  ],
  "writer": [
    {
      "id": "nm2758967",
      "name": "Dan Villegas",
      "description": "story"
    },
    {
      "id": "nm6747643",
      "name": "Patrick John Valencia",
      "description": "screenplay &"
    },
    {
      "id": "nm4596274",
      "name": "Hyro Aguinaldo",
      "description": "screenplay"
    }
  ],
  "cast": [
    {
      "id": "nm1379134",
      "name": "Bea Alonzo",
      "character": ""
    },
    {
      "id": "nm2375377",
      "name": "Gerald Anderson",
      "character": ""
    },
    {
      "id": "nm1235418",
      "name": "Bernard Palanca",
      "character": ""
    },
    {
      "id": "nm1168681",
      "name": "Janus del Prado",
      "character": ""
    },
    {
      "id": "nm1905455",
      "name": "Alex Vincent Medina",
      "character": "(as Alex Medina)"
    },
    {
      "id": "nm4200805",
      "name": "Anna Luna",
      "character": ""
    },
    {
      "id": "nm3173851",
      "name": "Nicco Manalo",
      "character": ""
    },
    {
      "id": "nm7186713",
      "name": "Jerome Tan",
      "character": ""
    },
    {
      "id": "nm5804614",
      "name": "Divine Aucina",
      "character": ""
    },
    {
      "id": "nm8317695",
      "name": "Bryan Sy",
      "character": ""
    },
    {
      "id": "nm2261723",
      "name": "Cheska Iñigo",
      "character": ""
    },
    {
      "id": "nm7476923",
      "name": "Brian Sy",
      "character": "EJ       (as Bryan Sy)"
    }
  ],
  "overview": "A story about two people who met and fell in love. Niño, a sales agent who's bent on attaining stability and Anj, a self-taught cook who dreams of working in a high-end restaurant someday.",
  "storyline": "Two people driven by their professional ambitions fall in love and are forced to reassess their goals as they encounter the trials of a serious relationship.",
  "plot": "Alice (Dakota Johnson) temporarily dumps her college boyfriend Josh (Nicholas Braun) and moves to New York City to be a paralegal. She moves in with her sister, Meg (Leslie Mann), an OB/GYN who refuses to have a baby or any form of relationship. Alice befriends wild co-worker Robin (Rebel Wilson), who enjoys partying and one-night stands, and local bartender Tom (Anders Holm), who willfully embraces the bachelor lifestyle and hooks up with various women including Alice. Tom meets Lucy (Alison Brie) at his bar when she uses his Internet for free. She explains she is looking for \"The One\" using various dating sites.\n\nAlice meets with Josh to tell him she is finished with their break and ready to get back together. Josh explains that they cannot because he is seeing someone else and rejects her bluntly, which distresses Alice. Meanwhile, Meg has a change of heart and decides to have a child via sperm donor. She starts dating a younger man named Ken (Jake Lacy) shortly after learning her attempt at in vitro fertilization was successful, however she hides the pregnancy from Ken.\n\nBack at Tom's bar, Lucy has a string of bad dates. Tom witnesses this and realizes he has feelings for Lucy. As her sister kindles her own relationship, Alice continues to pine after Josh. In an attempt to put herself out there, she attends a Wesleyan alumni networking event, where she hits it off with a man named David (Damon Wayans, Jr.).\n\nLucy, having been in a relationship for three weeks with a man named Paul, goes to Grand Central Station to send him off to the train. Paul reveals that he has been seeing other people, thinking she was doing the same, and breaks up with her. Lucy, extremely agitated, breaks down at her volunteer job reading stories to children. George (Jason Mantzoukas), who works at the bookstore, soothes her and the two begin a relationship.\n\nAlice and Robin attend Josh's winter holiday party, however Alice finds she cannot watch Josh with his new girlfriend. Walking alone, she runs into David, who shows her a private view of the Rockefeller Christmas tree. Dazzled, Alice thanks him and they begin a relationship. Three months later, as she is singing, \"Can't Take My Eyes Off You\", with David's daughter, Phoebe, David becomes upset with Alice, reminding her sternly that she's not Phoebe's mother; as it's revealed that David's wife died two years ago and he has not told Phoebe about it, believing that his daughter is not ready to know, which causes the two to break up.\n\nOn St. Patrick's Day, Alice bumps into Josh and his parents, and he appears pleasantly surprised to see her. Lucy comes to Tom's bar and shows him the swanky outfit she got for herself to share with George, whom she introduces to Tom. Tom becomes visibly upset, and he invites Alice to get drunk. The two talk about their frustrations with their feelings for Josh and Lucy, and end up sleeping together in an attempt to distract themselves. Meanwhile, Ken discovers Meg is pregnant, but is eager to help raise her child. Meg, concerned to believe that he is not truly committed, ends the relationship, with Ken walking away.\n\nLater, at Alice's birthday party, Robin has invited Tom, David, and Josh without Alice's knowledge, only because she thought it would be funny. Shaken by the presence of all three men, Alice argues with Robin. Tom goes to confess his feelings to Lucy, who announces she is engaged to George. Then George threatens Tom to stay away from Lucy. Now sitting on the fire escape, Alice is joined by Josh. The two make out passionately, but stop when Alice is horrified to learn that Josh is now engaged and was simply looking for closure. Invigorated by a desire to find herself, Alice leaves to go home. Her cab hits Robin, who has purposely jumped on the windshield to get a cab for Meg, who is in labor. Alice and Meg rush to the hospital, where Meg successfully delivers a baby girl, naming her Natalie. Ken appears and convinces her to re-enter the relationship, while Alice repairs her relationship with Robin, who is revealed to be heavily wealthy, living in an entire floor apartment.\n\nThe film closes as Alice reflects on her time living alone and being single. Tom is seen repairing his tap water plumbing, which he had purposely cut in an attempt to prevent hungover women from hanging around his apartment. Meg and Ken are playing with Natalie, and Robin carries on partying. Lucy has finally settled down with George. David finally tells his daughter the truth about her mother's death. And finally, Alice is seen hiking the Grand Canyon by herself so that she can witness the sunrise on New Year's Day, a dream she always had.",
  "synopsis": null
}