{
  "imdb_id": "tt5943306",
  "tmdb_id": "414276",
  "douban_id": null,
  "title": "Freaky Ali (2016)",
  "genres": [
    "Comedy",
    "Sport"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "120 min",
      "description": ""
    }
  ],
  "imdb_rating": 5.1,
  "director": [
    {
      "id": "nm0451326",
      "name": "Sohail Khan"
    }
  ],
  "writer": [
    {
      "id": "nm0451326",
      "name": "Sohail Khan",
      "description": "story"
    },
    {
      "id": "nm0451326",
      "name": "Sohail Khan",
      "description": "screenplay &"
    },
    {
      "id": "nm7447165",
      "name": "Raaj Shaandilyaa",
      "description": "screenplay"
    },
    {
      "id": "nm7447165",
      "name": "Raaj Shaandilyaa",
      "description": "dialogue"
    }
  ],
  "cast": [
    {
      "id": "nm1596350",
      "name": "Nawazuddin Siddiqui",
      "character": "Freaky Ali"
    },
    {
      "id": "nm0451170",
      "name": "Arbaaz Khan",
      "character": "Maqsood"
    },
    {
      "id": "nm3367112",
      "name": "Amy Jackson",
      "character": "Megha"
    },
    {
      "id": "nm1794460",
      "name": "Asif Basra",
      "character": "Kishan Lal"
    },
    {
      "id": "nm8745739",
      "name": "Akash Agarwal",
      "character": "Aquaguard Executive"
    },
    {
      "id": "nm8408571",
      "name": "Rajesh Aher",
      "character": "Pehelwan"
    },
    {
      "id": "nm9257919",
      "name": "Amarnath",
      "character": "NGO Man"
    },
    {
      "id": "nm0037017",
      "name": "Jas Arora",
      "character": "Vikram Rathod"
    },
    {
      "id": "nm0084443",
      "name": "Seema Biswas",
      "character": "Sulbha"
    },
    {
      "id": "nm2131954",
      "name": "Pradeep Choudhary",
      "character": "Inspector"
    },
    {
      "id": "nm3049068",
      "name": "Nikitin Dheer",
      "character": "Danger Bhai"
    },
    {
      "id": "nm0304093",
      "name": "Paresh Ganatra",
      "character": "Fakru"
    },
    {
      "id": "nm9257913",
      "name": "Sneha Garud",
      "character": "Nandita"
    },
    {
      "id": "nm9257918",
      "name": "Deh Nilesh Ghodasara",
      "character": "Fat Kid"
    },
    {
      "id": "nm7287295",
      "name": "Alam Khan",
      "character": "Mohalla Kid"
    },
    {
      "id": "nm4541970",
      "name": "Irfan Khan",
      "character": "Mohalla kid"
    },
    {
      "id": "nm9257914",
      "name": "Javed Khan",
      "character": "Vikram's Caddy"
    },
    {
      "id": "nm2719636",
      "name": "Karishma Kotak",
      "character": "Aditi"
    },
    {
      "id": "nm6294201",
      "name": "Durgesh Kumar",
      "character": "Babu"
    },
    {
      "id": "nm2541032",
      "name": "Micky Makhija",
      "character": "Singhaniya"
    },
    {
      "id": "nm8938104",
      "name": "Priyanka Mishra",
      "character": "Bride"
    },
    {
      "id": "nm9257915",
      "name": "Hosla Pandey",
      "character": "Old Man Customer"
    },
    {
      "id": "nm1335248",
      "name": "Arvind Parab",
      "character": "Kidnapped Old Man"
    },
    {
      "id": "nm9257912",
      "name": "Dhawal Parab",
      "character": "Jojo"
    },
    {
      "id": "nm9257916",
      "name": "Habib Azmi Shaikh",
      "character": "Basti Old Man"
    },
    {
      "id": "nm9257917",
      "name": "Hussain Shaikh",
      "character": "Bride's Father"
    },
    {
      "id": "nm0006763",
      "name": "Jackie Shroff",
      "character": "Bada bhai"
    },
    {
      "id": "nm7817320",
      "name": "Supriya Singh",
      "character": "Call Girl"
    },
    {
      "id": "nm8738708",
      "name": "Farida Patel Venkat",
      "character": "Maharani"
    }
  ],
  "overview": "Freaky Ali is an upcoming 2016 Indian sports rom-com film directed, produced, and written by Sohail Khan, co-produced by Nishant Pitti, with dialogue by Raaj Shaandilyaa and presented by Salman Khan. It is inspired by Adam Sandler's Happy Gilmore (1996) and is scheduled for release on 9 September 2016.",
  "storyline": "Nawazuddin Siddiqui (Ali ) plays a character of an extortion debt collector for the local goon along with Arbaaz Khan (Maqsood ). His fate turns when one day he and Arbaaz goes to a golf course to collect extortion, after waiting for many hours for a man to give him money. Nawazuddin's character confronts the man who tells him to wait while he finishes the hole .This is where Nawazuddin's character challenges him saying it to be easy, The man asks Nawazuddin to show it, Nawazuddin putts the ball in just one ace for he has a gifted natural swing, This not only surprises the man but his caddie as well who knows Nawazuddin. What follows is an inspiration story of a simple extortion debt collector to a golfing sensation, and along the way of him becoming a champion, Nawazuddin's character beats all odds and meets his dream girl played by Amy Jackson",
  "plot": "Ali, a poor man turned gangster gets fired after working in an owner's clothing store. Ali worries that he won't be able to earn money anymore to take care of his mother named Salubha but his friend Maqsood inspires him. Ali and Maqsood try to get money from a rich and royal woman Padmavati but they manage to do it only after a fight with her. Maqsood is been working for Danger Bhai to get him money. Ali was going to be married but gets stopped by the owner in whose store Ali was working. Ali goes to golf course to get some money from Singhania. As Singhania is unable to put a ball in hole, Ali suddenly gets challenged. Ali accepts his challenge and he wins it to collect money. Ali's uncle Kishan Lal who is a caddy driver , tells Ali that if he plays golf he can earn lots of money and can become a champion. Ali goes for practice but is unable to do it properly. Kishan tells Ali that his future is stuck between a perfect shot and a wrong choice. Ali inspired by this takes the correct path and practices perfectly. Ali in this process falls in love with Megha, a manager of golf champion Vikram Rathod who is arrogant, greedy and dishonest. Megha praises Ali's performance but when Vikram tries to insult him he (Ali) overcomes it by telling him that even if poor people play the game played by the rich people can learn to win but \"never lose\". Ali pays the fee of entering into tournament and qualifies into top 60 against 72 players. Vikram soon fires Megha and shows his arrogance to Ali but Ali reflects his attack by lessons that he learnt from the world. Ali wins events and earns money to take care of Salubha, at this process Ali and Megha developed feelings with each other. Danger Bhai tricks and blackmails Maqsood to not help Ali and Maqsood does it. When Megha finds out she tells to Ali's mother (Salubha) and Maqsood gets scolded for this. Maqsood tries to explain why was he doing this, Ali's mother convinces Maqsood that being honest/true person is more important. Kishan tells Ali that Maqsood has troubled him (Kishan) too. Ali feels annoyed and insults Maqsood. Maqsood regrets and decides to help Ali. Vikram injures Ali's hand, everyone feels worried and starts praying. Ali comes back to the final event with an injured hand which is recovering currently. Bade Bhai comes in the match to see and Danger Bhai joins Vikram. Maqsood insults and tells Vikram that Vikram can injure Ali's hand but not his courage and goal and Maqsood becomes the new caddy. Ali gets inspired by his mother who insults Danger Bhai and Bade Bhai who were trying to insult Ali. Ali then during the match gains his confidence back, removes plaster-bandage and plays perfectly. When Maqsood asks Ali what he's going to do, Ali tells that he's going to \"hit a six like in cricket\". Ali executes a great shot flying above the tree and into the hole and Ali wins. Vikram accepts his defeat and lets him go. Bade Bhai praises Ali and cancels all illegal business and Ali celebrates his victory with his friends and his lover Megha.",
  "synopsis": null
}