{
  "imdb_id": "tt5921524",
  "tmdb_id": "427034",
  "douban_id": null,
  "title": "Shalom Italia (2016)",
  "genres": [
    "Documentary"
  ],
  "country": "Israel",
  "version": [
    {
      "runtime": "59 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.5,
  "director": [
    {
      "id": "nm4745866",
      "name": "Tamar Tal"
    }
  ],
  "writer": [
    {
      "id": "nm4745866",
      "name": "Tamar Tal",
      "description": null
    }
  ],
  "cast": null,
  "overview": "Shalom Italia tells the story of three brothers, who set off on a journey to find a cave in the woods of Tuscany. The place where they, as children, hid to escape the Nazis. But more than a search to find a geographical location, the brothers are on their way to locate the common ground of memory, the nexus where the conflicting versions of their stories can come to rest.",
  "storyline": "Three Italian Jewish brothers set off on a journey through Tuscany, in search of a cave where they hid as children to escape the Nazis. Their quest, full of humor, food and Tuscan landscapes, straddles the boundary between history and myth, and the result of which is a profound portrait of memory and history.",
  "plot": "Shalom, a young Israeli at the outset of his life, was born into a bourgeois family in Tel-Aviv. His parents wish he would go to college, but Shalom doesn't feel like studying. His father isn't quite convinced his beloved son is doing the best he can when not doing anything at all. Shalom has a dilapidated station-wagon, two girlfriends to ride and love and \"don't think twice, it's all right\", as one of them sings to her sweet babbling infant. Shalom goes out on the road looking for his own self – an Israeli easy rider. In his wandering he comes across a group of artists debating over Israel's social-political fate. War and peace, occupied territories and settlements, rich and poor. One thing is not up for discussion, the future doesn't seem bright. Shalom makes up his mind to leave it all and go to America. Makes up his mind, but stays.",
  "synopsis": null
}