{
  "imdb_id": "tt6024768",
  "tmdb_id": "408265",
  "douban_id": null,
  "title": "By the Time It Gets Dark (2016)",
  "genres": [
    "Drama"
  ],
  "country": "Thailand",
  "version": [
    {
      "runtime": "105 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm2300866",
      "name": "Anocha Suwichakornpong"
    }
  ],
  "writer": [
    {
      "id": "nm2300866",
      "name": "Anocha Suwichakornpong",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm1856583",
      "name": "Visra Vichit-Vadakan",
      "character": "Ann"
    },
    {
      "id": "nm2876934",
      "name": "Arak Amornsupasiri",
      "character": "Peter"
    },
    {
      "id": "nm8406209",
      "name": "Achtara Suwan",
      "character": "Nong"
    },
    {
      "id": "nm0153400",
      "name": "Inthira Charoenpura",
      "character": "Ann"
    },
    {
      "id": "nm2570658",
      "name": "Soraya Nakasuwan",
      "character": "Ann"
    },
    {
      "id": "nm2088360",
      "name": "Rassami Paoluengtong",
      "character": "1st Taew"
    },
    {
      "id": "nm1500517",
      "name": "Penpak Sirikul",
      "character": "2nd Taew"
    },
    {
      "id": "nm2698591",
      "name": "Apinya Sakuljaroensuk",
      "character": "Tak /              Ou"
    },
    {
      "id": "nm9821680",
      "name": "Waywiree Ittianunkul",
      "character": "Female Student"
    },
    {
      "id": "nm6943161",
      "name": "Natdanai Wangsiripaisarn",
      "character": "Male Student"
    },
    {
      "id": "nm9821681",
      "name": "Apiwong Sajee",
      "character": "Chompoo"
    },
    {
      "id": "nm9821682",
      "name": "Vigrom Suvarnnapradip",
      "character": "Pun"
    },
    {
      "id": "nm9821683",
      "name": "Chailuang Dithabumroong",
      "character": "Mushroom Farm Owner"
    },
    {
      "id": "nm9821684",
      "name": "Jawaree Thongdeelert",
      "character": "Ou"
    },
    {
      "id": "nm5076597",
      "name": "Danaya Chulphuthiphong",
      "character": "Crew Member at Gor Surangkanang's House"
    },
    {
      "id": "nm9821688",
      "name": "Unchalee Anantawat",
      "character": "Peter's Friend"
    },
    {
      "id": "nm2306874",
      "name": "Phuttiphong Aroonpheng",
      "character": "Film Crew in Editing Suite"
    },
    {
      "id": "nm9821686",
      "name": "Yaowares Arreyamitr",
      "character": "Tea Drinking Lady"
    },
    {
      "id": "nm2663399",
      "name": "Edward Gunawan",
      "character": "Film Crew in Editing Suite"
    },
    {
      "id": "nm2892686",
      "name": "Nopawat Likitwong",
      "character": "Killer Cop"
    },
    {
      "id": "nm9821687",
      "name": "Chalat Siriwanij",
      "character": "Peter's Friend"
    },
    {
      "id": "nm8023507",
      "name": "Parisa Sriwichai",
      "character": "Film Crew in Editing Suite"
    },
    {
      "id": "nm8406211",
      "name": "Chayamporn Taeratanachai",
      "character": "Film Crew in Editing Suite"
    },
    {
      "id": "nm4835887",
      "name": "Aacharee Ungsriwong",
      "character": "Film Crew in Editing Suite       (as Machima Ungsriwong)"
    },
    {
      "id": "nm9821685",
      "name": "Viriya Vichit-Vadakan",
      "character": "Tea Drinking Lady"
    }
  ],
  "overview": "A film director and her muse who was a student activist in the 1970s, a waitress who keeps changing jobs, an actor and an actress, all live loosely connected to each other by almost invisible threads. The narrative sheds its skin several times to reveal layer upon layer of the complexities that make up the characters’ lives.",
  "storyline": "In 1970, She was student activist, a waitress who keeps changing her job, now a film director. All lives loosely connected to each others.",
  "plot": "In the time of the Song dynasty during the reign of the Renzong Emperor, a few miles north of the Great Wall, a mercenary group originally consisting of twenty men searching for black powder are pursued by Khitan bandits, who have already killed some of the men. Upon escaping they seek refuge in a cave but are then attacked by an unknown monster, leaving only William (Matt Damon) and Tovar (Pedro Pascal) alive, with the former having slashed off the monster's hand. The two decide to bring the arm with them. The next day, they stumble upon the Great Wall and are taken prisoner by Chinese soldiers of a secretive military sect called the Nameless Order, led by General Shao (Zhang Hanyu) and Strategist Wang (Andy Lau).\n\nThe Nameless Order is a Chinese military order commissioned by the Imperial Court of the Song Dynasty as a special division of the Imperial Army conceived for the sole purpose of repelling a horde of alien monsters (the Tao Tie 饕餮) who rise every 60 years. The commanding officers are shocked upon seeing the monster's severed hand, as the Order believed the invasion was still weeks away. Suddenly, a wave of monsters attack the Great Wall, and the battalions are mobilized. The Nameless Order is divided into five special units: the melee-specialist Bear Troop, the acrobatic-specialist Crane Troop, the archer-specialist Eagle Troop, the siege engine-specialist Tiger Troop, and the horse-mounted Deer Troop. Losses are sustained on both sides before the monsters' queen recalls her drones. During the battle, William and Tovar are freed by Peng Yong, an unskilled soldier from the Bear Troop and William, in turn, saves him from the attacking monsters. William and Tovar's battle skills earn the respect of General Shao and Commander Lin (Jing Tian), leader of the Crane Troop. Later, William and Tovar meet Sir Ballard (Willem Dafoe), a European who, like them, had ventured east twenty-five years ago in search of black powder. Like them, Ballard was also taken prisoner and now has been serving as an English and Latin teacher. The three foreign mercenaries discuss plans to steal black powder from the storeroom and flee while the soldiers are occupied by battle. Later, Strategist Wang meets William and explains the situation: The monsters that William fought were Taoties (in the film collectively called the Tao Tei), which are monsters originating from a green meteor that crash-landed onto Gouwu Mountain two thousand years ago. The Chinese believe the Taotie were sent from the gods to punish the Emperor for abusing his authority over the Middle Kingdom and the people. They attack northern China once every sixty years, an invasion for which the Order has been training for their entire lives.\n\nDuring the night, two Taoties reach the top of the Wall and silently kill several watchmen. Shao and Lin lead the Deer soldiers to investigate, but are ambushed. The Tao Ties are slain but Shao, wounded beyond recovery, succumbs to his injuries and dies, leaving Lin to take command of the Nameless Order. Around this time, an envoy from the capital arrives with an ancient scroll which suggests that the monsters are pacified by magnets. Wang believes that the stone William carried all this time enabled him to slay the Taotie he fought before entering the Wall. To test the theory, William suggests that they should capture a Taotie alive and agrees to help. This results in his delaying his escape plans, which puts him at odds with Tovar who nevertheless delays his escape plan to assist William, much to Ballard's chagrin. During the next attack, the Taotie are numerous enough to cause Lin to resort to using black powder rockets, whose existence had been kept secret from the Westerners until now. They manage to capture a living Taotie and prove the theory. The Taotie is taken to the capital by the envoy. A short while later, a hole is discovered in the base of the Great Wall, which the Taotie queen has used to lead her hordes to the capital. While Lin investigates, Tovar and Ballard try to escape and knock William unconscious for resisting. William is then arrested by the Chinese soldiers, and despite being saved by a statement from Peng Yong, William eventually is locked up in the Wall. Some distance away, Ballard betrays and abandons Tovar, but is himself captured by the Khitans, who inadvertently destroy themselves and Ballard after carelessly igniting the powder. Tovar reclaims the horses but is recaptured by the Deer Troop. At the capital the envoy decides to show their theory to the Song emperor, but the Taotie wakes up and signals to the Taotie queen.\n\nKnowing that the horde is nearing the capital, Lin orders the use of unstable hot-air balloons, to follow the Taotie. Before setting out for Bianliang, the capital, Lin passes word to set William free, with Wang telling him to tell the outside world about the danger about to come, but William decides to stay and boards the last balloon with Peng and Wang. They arrive just in time to see Lin's balloon crash-landing in the now destroyed capital, and save her from being devoured. They land safely in the Emperor's palace, where Wang proposes an idea to kill the queen by tying explosives to the captured Taotie from earlier and giving the Taotie meat to be delivered to the queen. While transporting, a horde of Taotie breach the sewers. Peng Yong sacrifices himself to save the others.\n\nWith the Taotie released, Lin, William and Wang climb a tower to shoot a black powder rocket to detonate the explosives. Wang is killed while moving to the upper floors. Two of William's arrows are deflected by the Taoties, but Lin's spear breaches the defenses after William throws the magnet into the horde. The queen is destroyed, and the rest of the horde is frozen solid. With the horde destroyed, William is given an offer, during which he forgoes the powder and instead frees Tovar, much to Tovar's annoyance. The two, guided by cavalry, begin their journey back to Europe as Lin, now the General, watches over them from the wall. William says that he wants to go back, but jokes with Tovar, saying he doesn't trust him going alone.",
  "synopsis": "Two women arrive at a secluded house surrounded by fields and mountains.\nThe younger woman will direct a film about the older one, a writer who led the\nstudent movement in the 1970s. The director records their interviews to use as\nmaterial for her script.The women dine at a nearby cafe and have an awkward conversation with the\ngirl who serves them. The director begins venturing out alone, and explores a\nnearby mushroom farm. In the forest, she encounters a glittery blue mushroom.The director records an interview with herself.A road leads to another farm, where workers are engaged in the elaborate process\nof curing tobacco leaves. One farmer gets done with work and leaves in\nhis truck. En route to Bangkok, he's recognized as an actor. When he arrives\nhome, he reads a new script for an indie film. Later, he lies in bed naked with\na woman who traces his features. He plays a series of roles, including that of a\nsinging fish. The actor runs into the woman with whom he was in bed. They exchange\nsmall talk about their respective acting careers. She tells him she's\ntaking time off from acting to direct her own film.The first scene of the film recurs with new women who wear full makeup. The\nseason has changed. The woman who was in bed with the actor is there.The girl who waited on the director and writer is now in Bangkok, where she is\nworking as a cleaner at the actor's gym. She goes from one job to another,\nnever connecting with anyone. Eventually, she arrives at a temple, where she\nshaves her head, lives alone, and sweeps the grounds.She enjoys disco dancing."
}