{
  "imdb_id": "tt6076366",
  "tmdb_id": "410432",
  "douban_id": null,
  "title": "Aandavan Kattalai (2016)",
  "genres": [
    "Drama"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "151 min",
      "description": ""
    }
  ],
  "imdb_rating": 8.3,
  "director": [
    {
      "id": "nm6717590",
      "name": "M. Manikandan"
    }
  ],
  "writer": [
    {
      "id": "nm6717590",
      "name": "M. Manikandan",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm4043111",
      "name": "Vijay Sethupathi",
      "character": "Gandhi Arumugan"
    },
    {
      "id": "nm3277309",
      "name": "Ritika Singh",
      "character": "Kaarmegha Kuzhali"
    },
    {
      "id": "nm6299092",
      "name": "Pooja Devariya",
      "character": "Aarthi"
    },
    {
      "id": "nm0621937",
      "name": "Nassar",
      "character": "Master"
    },
    {
      "id": "nm6489058",
      "name": "Yogi Babu",
      "character": "Muthupandi Selvam"
    },
    {
      "id": "nm2670388",
      "name": "Singampuli",
      "character": "Murugesan"
    },
    {
      "id": "nm6998719",
      "name": "George Maryan",
      "character": "Senior Lawyer"
    },
    {
      "id": "nm4062141",
      "name": "A. Venkatesh",
      "character": "Gandhi's Brother in Law"
    },
    {
      "id": "nm3847657",
      "name": "S.S. Stanley",
      "character": "Kumar"
    },
    {
      "id": "nm5782889",
      "name": "Hareesh Peradi",
      "character": "Deportation Officer"
    },
    {
      "id": "nm6678966",
      "name": "Vinodhini Vaidynathan",
      "character": "Junior Lawyer"
    },
    {
      "id": "nm3455011",
      "name": "Aravindhan",
      "character": "Nesan"
    },
    {
      "id": "nm8111864",
      "name": "Cheenu Mohan",
      "character": "Passport Official"
    },
    {
      "id": "nm10203261",
      "name": "Sushila Natraj",
      "character": "Judge Shanthakumari"
    },
    {
      "id": "nm5042878",
      "name": "Muthuraman",
      "character": "Regional Passport Officer"
    },
    {
      "id": "nm3830348",
      "name": "R.N.R. Manohar",
      "character": "Minister"
    },
    {
      "id": "nm5654687",
      "name": "Ramesh Thilak",
      "character": "Special Appearance"
    }
  ],
  "overview": "A young man, on the advice of an agent, lies that he is married, to go to London. But his visa application is rejected and now, he has to follow-up with a string of lies to hide one lie.",
  "storyline": "Debt-ridden Gandhi & Pandi come to Chennai from their native village near Madurai in search of a 'Travel agent' who can arrange their travel to London on fake passports/reasons to earn some money. However, fate plays havoc on their lives as their lies take them to the brink of disaster.",
  "plot": "Faced with several debts, a village accountant Ganthi Arumugam (Vijay Sethupathi) leaves his village near Madurai to head to Chennai with his best friend Muthupandi Selvam alias Pandi (Yogi Babu) to get all the documents necessary for going to London, where they plan to make money to pay off their debts. They approach two middlemen to help them get the passport and British tourist visa necessary for them to go to London. The middlemen claim that the British Deputy High Commission would prefer to give tourist visas to those who are already married, so the duo are forced to add their \"wife's\" name while applying for the passport, with Ganthi adding his \"wife's\" name as Karmeghakuzhali, following a suggestion from their real estate broker, Murugesan (Singampuli). However, Ganthi's visa application is rejected, forcing him to remain in Chennai and take up a job as an accountant with a drama troupe Stray Factory, run by Master (Nassar), while Pandi passes his visa interview and leaves for London with the help of a passport officer, Kumar (S. S. Stanley).\n\nWith his hardwork and sincerity, Gandhi soon becomes the favourite employee of Master and is made to act in his plays. Eventually, Stray Factory are invited to perform in London, leaving Gandhi in a bind as he now needs to get his \"wife's\" name removed from his passport. He finds out that the only way to do so is to divorce his \"wife\", but for that he needs to find a woman who has the name Karmeghakuzhali. He successfully manages to track down a woman with the name Karmeghakuzhali (Ritika Singh), who is a television journalist, and tries to convince her to act as his wife and \"divorce\" him. Initially she refuses, but she soon gives Gandhi the necessary documents to \"divorce\" her, feeling pity for him. However, since both husband and wife need to be present at court at the time of divorce, Gandhi convinces Aarthi (Pooja Devariya), an actress who works in Stray Factory, to act as Karmeghakuzhali at the court. But at the time of the divorce hearing, Aarthi disappears to the toilet, forcing a reluctant Karmeghakuzhali, who is present at the court, to take part in the divorce hearing. The subsequent events at the divorce hearing prove humiliating for Karmeghakuzhali and she leaves the court in tears with no \"divorce\" granted.\n\nLater, Gandhi finds out that Pandi was deported upon arrival in London by immigration officials for giving false information and address verification while obtaining his passport, and he too finds himself in the dock for doing the same. However, he shows his and Pandi's original Voter ID cards to the immigration officials, getting them released, while the middlemen are arrested. Pandi reveals that he was sent to Sri Lanka and tortured by prison officials after he had tried to seek asylum in London as a Sri Lankan refugee, and humiliated by the recent events, he returns to his village.\n\nGandhi goes to the Regional Passport Office in Chennai and admits his crime to the Regional Passport Officer. The passport officer asks him to pay a fine of ₹1,300 (US$19) to get Karmeghakuzhali's name removed from his passport. But in a last-minute decision, Gandhi chooses not to remove Karmeghakuzhali's name from his passport and instead proposes marriage to Karmeghakuzhali, who is initially taken aback, but agrees. He soon gets his British visa and leaves for London with the rest of the Stray Factory troupe.",
  "synopsis": null
}