{
  "imdb_id": "tt6082818",
  "tmdb_id": "419372",
  "douban_id": null,
  "title": "I babysitter (2016)",
  "genres": [
    "Comedy"
  ],
  "country": "Italy",
  "version": [
    {
      "runtime": "81 min",
      "description": ""
    }
  ],
  "imdb_rating": 3.8,
  "director": [
    {
      "id": "nm4996440",
      "name": "Giovanni Bognetti"
    }
  ],
  "writer": [
    {
      "id": "nm4996440",
      "name": "Giovanni Bognetti",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm0007746",
      "name": "Diego Abatantuono",
      "character": "Gianni Porini"
    },
    {
      "id": "nm0145951",
      "name": "Antonio Catania",
      "character": "Commissario"
    },
    {
      "id": "nm1596920",
      "name": "Francesca Cavallin",
      "character": "Marta"
    },
    {
      "id": "nm1784417",
      "name": "Francesco Facchinetti",
      "character": "vice ispettore Ermanno"
    },
    {
      "id": "nm7232389",
      "name": "Alberto Farina",
      "character": "Tonino"
    },
    {
      "id": "nm0303687",
      "name": "Bruno Gambarotta",
      "character": ""
    },
    {
      "id": "nm10380529",
      "name": "Michela Giraud",
      "character": ""
    },
    {
      "id": "nm6346127",
      "name": "Vito Mancini",
      "character": "Police Officer"
    },
    {
      "id": "nm0541751",
      "name": "Francesco Mandelli",
      "character": "Andrea Tasso"
    },
    {
      "id": "nm8523905",
      "name": "Andrea Panciroli",
      "character": ""
    },
    {
      "id": "nm8863123",
      "name": "Giuseppe Panebianco",
      "character": "Invitato al party"
    },
    {
      "id": "nm5008260",
      "name": "Luca Peracino",
      "character": "Ernesto"
    },
    {
      "id": "nm8456249",
      "name": "Davide Pinter",
      "character": "Remo"
    },
    {
      "id": "nm4875595",
      "name": "Andrea Pisani",
      "character": "Mario"
    },
    {
      "id": "nm0749303",
      "name": "Paolo Ruffini",
      "character": "Aldo Morelli"
    },
    {
      "id": "nm6350234",
      "name": "Simona Tabasco",
      "character": "Sonia"
    }
  ],
  "overview": null,
  "storyline": "Andrea is a thirty-year old guy who dreams to become a famous sports agent and works for Gianni Porini, a big name in the sports sector. The day Porini receives a prestigious prize at the Grand Gala of the Sport, his wife suddenly realizes that she'll need a babysitter to take care of his son Remo. In the hurry, she asks Andrea to look after Remo. Andrea sees it as a great chance to curry favor with his boss, and accepts. However, the exact same day was Andrea's birthday, and his friends Aldo and Mario decide to celebrate it in the woman's house organizing a party and filming the whole thing. The Porini's house becomes the location of a wild party. The following morning, police investigates on the devastated house and finds the camera used by Andrea's friends.",
  "plot": "This article's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (June 2016) (Learn how and when to remove this template message)\nJenny Parker (Sabrina Carpenter) and Lola Perez (Sofia Carson) are teenagers with opposite personalities but the same passion for photography. The two meet when they are finalists for a prestigious photography internship and accidentally switch phones at their interview. Helen Anderson (Gillian Vigman) calls Jenny's phone, begging for a last-minute babysitter because of a relative who couldn't make it. Lola is about to explain the mistake, but decides to take the job when she gets served with a parking ticket from Officer James (Max Lloyd-Jones). Jenny's crush Zac Chase (Kevin Quinn) calls to invite Jenny to a Psychic Rockets concert but Lola quickly dismisses him in order to flirt with Officer James. Zac mistakenly believes that Jenny is not interested in him so he decides to take another girl to the concert instead.\n\nJenny and Lola arrive at the Coopers' and the Andersons' for their respective babysitting jobs. Jenny is told by Donna Cooper (Gabrielle Miller) not to let Emily (Nikki Hahn) do anything to her hair, nor to let Katy (Mallory James Mahoney) go through her mother's jewelry box. Also, both Lola and Jenny realize they switched phones, and Jenny travels to Lola to switch their phones back. By that time, Bobby (Jet Jurgensmeyer) has made a mess by cooking and Trey (Max Gecowets) has snuck out to a Psychic Rockets concert despite being grounded for spending $200.00 worth of money on applications for his electronics.\n\nJenny, Lola, and the children journey in the Anderson's SUV to a sketchy pawn shop in the city in order to track Trey down. However, they find that he has already left with his friends. In the shop, Bobby accidentally lets loose a rare Sapphire Ferret and Lola takes a picture of the commotion for her photography resume. Since the animal is illegal, the pawn shop owners Tiny (Michael Northey) and Scalper (Ken Lawson) chase the seven out of the store, trying to delete the photo from Lola's camera. The group makes it to the car only to find that it is being towed. The truck owner tells them that they need $100 to pay off the fine and have until midnight to pay it off. The group is forced to take a bus to their next destination, Trey's favorite pizza parlor. They find Trey and, now all together, try to figure out how to pay off the tow truck fees. Bobby spots Tiny and Scalper following them and a chase ensues into a clothing factory. The seven once again escape them and once they are safe, Lola suggests re-selling the ticket at the concert.\n\nTiny and Scalper track them down but hold off from revealing themselves when Lola gets arrested for illegally re-selling the ticket. As they wait at the police station, Jenny is horrified to see that Emily secretly dyed her hair green and angrily reprimands her. Hurt, Emily calls and leaves a voicemail message to Mrs. Cooper explaining the trouble they are in. In the interrogation room, Lola meets Officer James. He scolds her for trying to scalp the ticket, pointing out that she could have been hurt and is setting a bad example for her babysitting charges. Lola finally realizes her impulsiveness has consequences and begs to go free to make things right. Meanwhile in the lobby, AJ meets her roller derby idol Jailer Swift when Swift and her roller derby team are brought in on charges for disorderly conduct. Lola is cleared of all charges and when she goes to meet with the group, Tiny and Scalper charge in. The derby team starts fighting among themselves and provides enough distraction for the seven to get away.\n\nOnce safe, Katy remembers that her mother keeps a $100 bill in her coat for emergencies and the group decides to sneak into the local planetarium where the Coopers and Andersons are attending a party to steal it for the truck fees. As Jenny, Katy and Lola sneak into the storage room to look for Mrs. Cooper's coat, the Coopers hear Emily's message and head to the police station to check on their children. The coat turns out to be left at the Cooper's table where the Andersons are sitting, so Lola disguises herself as a wealthy socialite to steal the money. Meanwhile, Bobby takes charge of the catering after the chef quits. Tiny and Scalper are caught by security and the Sapphire Ferret is grabbed.\n\nOnce Lola retrieves the money, the group heads to the tow place before it closes and get the car back. Tiny and Scalper are arrested and the Sapphire Ferret is taken to an animal shelter. Lola jokes how Jenny's night is more interesting than going to a concert with Zac and Jenny finally learns why Zac has suddenly become distant. She becomes angry with Lola, but Lola suggests driving to the Psychic Rockets concert to explain everything. Lola trades her precious camera in exchange for Jenny's admission so Jenny and Zac can reconcile. The group then races home before the parents. Upon arrival, they find out about a much bigger mess. The washing machine has burst, with soap everywhere. The Andersons' dog Lady Marmalade is covered with sauce, which is also all over the floor. Trey washes the car and helps Emily clean their dog, Jenny and Katy clean the laundry room, and Lola, Bobby and AJ clean the kitchen. Once they all are done, Jenny, Katy and Emily leave to get them back home, and the Andersons' arrive home, where Lola immediately covers up and says they were great. Jenny does the same. As she leaves, Zac arrives saying he forgot to give Emily her headphones, and the two start dating, much to the delight of Katy and Emily who are watching. Lola gets her driver's license back from Officer James.\n\nEventually, Lola and Jenny begin to adopt some of the others' traits, and Jenny declines her photography scholarship, giving it to Lola, who begins a relationship with Officer James. At the end, Lola sends the pictures to Katy, Emily, AJ, Bobby, Trey, Jenny and accidentally Helen.",
  "synopsis": null
}