{
  "imdb_id": "tt6071534",
  "tmdb_id": "413834",
  "douban_id": null,
  "title": "Gringo: The Dangerous Life of John McAfee (2016)",
  "genres": [
    "Documentary",
    "Crime"
  ],
  "country": "USA",
  "version": [
    {
      "runtime": "97 min",
      "description": ""
    }
  ],
  "imdb_rating": 6.6,
  "director": [
    {
      "id": "nm0123379",
      "name": "Nanette Burstein"
    }
  ],
  "writer": null,
  "cast": [
    {
      "id": "nm8445856",
      "name": "Allison Adonizio",
      "character": "Herself"
    },
    {
      "id": "nm0123379",
      "name": "Nanette Burstein",
      "character": "Herself"
    },
    {
      "id": "nm2538937",
      "name": "John McAfee",
      "character": "Himself"
    }
  ],
  "overview": "The strange story of John McAfee, who went from millionaire software mogul to yogi, Kurtz-like jungle recluse to potential murderer, and most recently a prospective presidential candidate for the American Libertarian Party.",
  "storyline": "Mysteries abound in the life of John McAfee. He made millions creating antivirus software, then reinvented himself as a yogi, a proponent of herbal medicine, and a serial entrepreneur. He was known for his charm and generosity. Then his life took another turn. He moved from the US to Belize and built a heavily armed compound in the jungle, like a modern day Heart of Darkness. McAfee never shied away from media attention and boasted of his libertine lifestyle, maintaining a harem of young women. In 2012 his neighbour in Belize, an American named Gregory Faull, was found murdered by a gunshot. Sought for questioning by local authorities, McAfee fled to Guatemala, then returned to the US where he pursued the Libertarian Party nomination for President in 2016. Over the years, journalists have told pieces of McAfee's story (including the infamous Vice report accidentally revealing his secret location). Here the Academy Award-nominated filmmaker Nanette Burstein delivers a deep ...",
  "plot": null,
  "synopsis": null
}