{
  "imdb_id": "tt6286666",
  "tmdb_id": "399171",
  "douban_id": null,
  "title": "Saithan (2016)",
  "genres": [
    "Action",
    "Thriller"
  ],
  "country": "India",
  "version": [
    {
      "runtime": "123 min",
      "description": ""
    }
  ],
  "imdb_rating": 7.0,
  "director": [
    {
      "id": "nm8614207",
      "name": "Pradeep Krishnamoorthy"
    }
  ],
  "writer": [
    {
      "id": "nm8614212",
      "name": "Joe D. Cruz",
      "description": null
    },
    {
      "id": "nm8614213",
      "name": "Karthik Krishna",
      "description": null
    },
    {
      "id": "nm8614207",
      "name": "Pradeep Krishnamoorthy",
      "description": null
    }
  ],
  "cast": [
    {
      "id": "nm2537099",
      "name": "Vijay Antony",
      "character": "Dinesh"
    },
    {
      "id": "nm7796389",
      "name": "Arav",
      "character": "Nataraj"
    },
    {
      "id": "nm0352031",
      "name": "Charu Haasan",
      "character": "(as Chaaruhasan)"
    },
    {
      "id": "nm8614210",
      "name": "Kamal Krishna",
      "character": ""
    },
    {
      "id": "nm1572739",
      "name": "Meera Krishna",
      "character": ""
    },
    {
      "id": "nm0471430",
      "name": "Raja Krishnamoorthy",
      "character": ""
    },
    {
      "id": "nm1559594",
      "name": "Y.G. Mahendran",
      "character": ""
    },
    {
      "id": "nm4820548",
      "name": "Murugadass",
      "character": ""
    },
    {
      "id": "nm8614208",
      "name": "Arundathi Nair",
      "character": "Devagi /              Ishwarya /              Jayalakshmi"
    },
    {
      "id": "nm8614211",
      "name": "Vijay Sarathy",
      "character": ""
    },
    {
      "id": "nm8614209",
      "name": "Siddhartha Shankar",
      "character": ""
    }
  ],
  "overview": "A software engineer starts hearing a voice inside his head that tells him to go in search of a woman named Jayalakshmi and murder her!",
  "storyline": "A successful software engineer, Dinesh gets married to Aishwarya through an online matrimonial portal. However, post the honeymoon, he suddenly starts hearing voices and seeing abnormal things that do not have any sort of pattern whatsoever. Only when he gets to a psychiatrist the mystery unravels.",
  "plot": "Shaitan starts off with Amy (Kalki Koechlin), who is mentally disturbed and deeply affected by the attempted suicide and eventual institutionalisation of her mother, Saira. She moves from Los Angeles to Mumbai, where she meets KC (Gulshan Devaiya) at a party her parents forcefully take her to. KC introduces her to his gang – Dash (Shiv Pandit), Zubin (Neil Bhoopalam) and Tanya (Kirti Kulhari). They lead a directionless life, having fun, drinking, using drugs and driving around in a Hummer. On one such occasion, they start racing a random car and win. In the celebration rush, they run over two people riding on a scooter, killing them instantly.\n\nThey quickly leave the spot but are easily traced down by a slimy cop, Inspector Malwankar (Rajkummar Rao), who demands ₹ 2,500,000 ($41,500) to drop the case. Dash tells them about a friend (Rajat Barmecha) who faked his own brother's kidnapping and extracted ₹ 2 million from his own parents. After Amy volunteers to be the kidnapping victim, they hatch a plan. Upon receiving the ransom call, Amy's father, contrary to their expectations immediately approaches Police Commissioner (Pavan Malhotra) for help. The Police Commissioner assigns an upright cop Arvind Mathur (Rajeev Khandelwal) to solve the case unofficially, as he is on suspension after throwing a corporator from the first floor of his own house for allegedly beating up a woman. Inspector Mathur is shown to be having a disturbed married life and nearly divorces his wife.\n\nThe group of youngsters then hide in a shady hotel, acting upon the plan hatched by Dash. When Tanya is nearly raped by a man, they react violently and kill him. They escape from the lodge and hide out in a cinema hall, where Amy finds a packet of cocaine in Dash's satchel. Tanya is deeply disturbed by their recent actions, and convinces Zubin to take her home. While Zubin leaves to find a taxi, Tanya gets into an altercation with Amy. Amy, while under the influence of cocaine, is convinced that the phone call that Tanya was making to her sister was actually to the police. In the physical confrontation that follows, KC severely injures Tanya. Zubin, upon returning, finds the gruesome scene and flees. He is later arrested by the police while attempting to leave the city. Dash takes Amy and KC to a church in the outskirts of Mumbai and instructs them to hide there while he tries to figure things out with Malwankar.\n\nThe arrested Zubin, in the meantime, reveals the entire scenario to the police. They track down Malwankar, who was attempting to escape with his wife. In the ensuing chase, Malwankar is nearly killed in an auto collision. While buying food, the exasperated KC sees his handicapped sister being traumatised by the media. He then calls his father and asks him for help. Using this call, the police trace the trio to the church. Upon returning to the church, KC tells the other two everything and tries to convince Amy to leave the church with him. Dash, however, confronts him and the two get into a bloody confrontation. It ends with Dash beating KC to death. Dash then tries to get Amy to leave the church with him. However, a cocaine-fuelled Amy has a traumatic flashback involving her mother trying to drown her as a child. In this frenzy, she stabs Dash, who is trying to restrain her. She is then found by Inspector Mathur.\n\nThe police, despite knowing the truth, get the three surviving friends to sign a statement saying that Dash had kidnapped all four. This is done to save the reputation of the much-maligned police force. Mathur then meets his wife, indicating a possible reconciliation. The film ends with Amy being resigned to the convent, that she always feared, albeit with her mother's name (Saira).",
  "synopsis": null
}